{"id": 5021, "submission_id": "zovut1", "title": "AITA for refusing to eat at my husband’s family dinner?", "selftext": "This year, my husband (36M) & his extended family decided to go to a fancy restaurant to celebrate the holidays. For context as it’s relevant to the situation, I (30F) am a white woman, while my husband and his family are 1st/2nd gen east and southeast Asian. \n\nWhen we originally made plans, we agreed on a local higher-end chain spot that we had been to many times in the past. However, the day before, my MIL sent us a message that her brother had switched spots to another high end Chinese restaurant. I’d never been there,  but I didn’t really care and was happy to go. We regularly eat and sometimes make home-cooked traditional Chinese food anyways, so there was no issue.\n\nSo we pack up our son (1M) and meet his family at this new restaurant. It was mostly nice but one thing struck me immediately. The restaurant HEAVILY advertised and displayed its shark fin soup menu. To the point that there were some fins literally hanging on display. \n\nIn our country, the sale of shark fins is illegal. It’s also known to be extremely cruel (basically, the fin is removed from living sharks and the animal is left to slowly die unable to swim), and ecologically a key reason for some at-risk shark species population declines. \n\nEveryone sat down, and I was notably quiet. I quickly pulled my husband to the side to explain that I was really uncomfortable with this restaurant as it sold shark fin and try to figure out what to do. I was really anxious given the illegality of the dish and morally upset. He said we could talk about it when we got home but to please just get through the dinner.\n\nWhen it came time to order, a lot of the aunts and uncles ordered shark fin soup, while everyone else ordered fancy dishes. Internally I was still freaking out, and quickly just chose the plainest possible noodle dish (basically noodles with oil) and said I would share it with my son. I got some weird looks from my MIL and BIL since they know I regularly love Chinese food and this wouldn’t be my typical order. \n\nThe food arrives and I cut up/give some of the noodles to my son (he still needs to eat) and really just pick at the rest while we’re there. There is a lot of food sharing but I wouldn’t participate and also blocked my son from participating. Some family made comments on my & my son’s not sharing but I just laughed them off or changed the subject. There wasn’t any conflict while we were at the restaurant and I tried to hide my discomfort and hold happier conversations with everyone there. \n\nWhen we got home my husband asked if I was feeling well and why I hadn’t eaten more food. I told him I was uncomfortable eating shark fin and didn’t want to eat at a restaurant that supported eating shark fin, and didn’t want our son eating there either. He got angry and said I was embarrassing him, and I guess called a couple family members. Now I have a bunch of them messaging me saying I am racist and I am “stealing my son’s culture from him”. \n\nAITA for not sucking it up and eating at the restaurant?", "created_utc": 1671360188, "permalink": "/r/AmItheAsshole/comments/zovut1/aita_for_refusing_to_eat_at_my_husbands_family/", "score": 259, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refused to eat shark fin at my husband’s family dinner because of the legal and moral implications. I might be the asshole as it’s a traditional food and not an issue from his family’s perspective.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA at all. Shark fin soup practices sound really really bad from what I’ve learned about it, and you didn’t make a fuss about it at the table. I personally wouldn’t support a restaurant like that, and this has nothing to do with being racist or depriving your child of culture. It’s hard to stand up to your in-laws, and I think you handled the situation really well. Just don’t go to that restaurant again, regardless of who’s asking.", "NTA at all!! \n\nThe sale of shark fins is largely illegal for a reason. You obviously know and are uncomfortable with the way shark fins are harvested, I am too. it’s appalling. But even when they ordered shark fin soup you didn’t make a scene, you just sat with your son and ate your own food.\n\nShark fin soup is not imperative to their culture, you’re not stealing anything from your son.\n\nYour husband shouldn’t have called his relatives to tell them, he created a much bigger problem.", "NTA. Your husband should have supported you. Time to report that restaurant (anonymously of course).", "Regardless of the sharks, anyone whose first reaction to a relationship issue is to leave their partner hanging and phoning mommy and/or other relatives and inviting them to butt in where they shouldn't have any input is an **hole. You, on the other hand, are NTA. You were put into a legitimately uncomfortable situation that you handled as best as possible. Your husband does not have your back and your relatives are using the race card were it has no relevance. But now you know that you will always be an outsider in this family.", "NTA for how you handled it.\n\nAs I don't know the specific culture that rests on shark fin soup, I won't even attempt to decide if your refusal to eat it was insulting to them.\n\nI do know that some Asian cultures are offended when a guest refuses to eat, but it's usually the food the hosts cooked.  So I'm not sure how that part even fits into the culture argument since the elders at your table didn't make the dishes.\n\nYour husband, total AH for ratting you out however.  What was his goal, to humiliate you?  To make himself look virtuous, above you, to his family?  Bad move on his part and for no good reason.", "NTA\n\nIf your husband's family tradition is to harm the environment and contribute to the extermination of an endangered species, it's not a tradition to preserve.  Just because it's traditional, just because it's part of a legacy, doesn't mean they're okay.  The same can be said for cockfights and bullfights.", "NTA - it’s not racist to call out illegal and harmful traditions just because it is “their tradition”. In this logic they could just get away with whatever and say it’s their tradition and if you don’t like it you are racist.", "Info: would they have been upset if you’d ordered normally instead of just plain noodles, or were they specifically offended by you not eating shark fin? It’s possible they view you barely eating anything as kind of a passive aggressive statement.", "NTA. You handled the situation as best as you could --- didn't make a scene but stuck to your mortals.", "So very much NTA! I wouldn’t have been able to sit there so tactfully and not make snarky passive aggressive comments. You did beautifully under trying circumstances!", "NTA. It's illegal for a reason and if I were you I'd report the shit out of that restaurant.", "Info: is there any possibility they're using a substitute and you didn't realize? Just kind of hanging onto a glimmer of hope there.\n\nIf that is the case they're all jerks for not just *saying* \"it isn't real shark fin\".\n\nI also think it's a huge problem that your husband basically tattled to mommy and brought his family in to harass you when you literally did not make a scene.", "Is the serving of shark fin illegal? In Canada the importation and trade of shark fin not naturally attached is not permitted but whole carcasses are. \n\nThat said, NTA. Whether permitted or not, there are serious ecological, sustainability issues with the shark fin trade. Shark fin is considered a delicacy and not part of the day to day cuisine. It's be an imperceptible cultural loss for your son. The language, customs, art, music and lots of other food, let alone relationships with elders is more impactful.", "NTA", "Info: was the only thing on the menu shark fin related? If not, did they only order things with shark fin? \n\nI don’t think your TA for not eating the shark fin. But if there were other dishes I feel like that could have been eaten shared, if not by you but by your son. \n\nIn the totality, I think NTA. \nPersonally, I would check whether or not they were doing something illegal. If they were I would personally feel compelled to report it.", "Nta", "NTA. At all. I completely agree with you. Just the thought of it makes me sick. Having to see it would set me off. I understand that it is a cultural thing, but as someone who is fascinated with marine biology and loves sharks I just couldn't deal. You handled that very well in my opinion. I would have noped the F outta there.\n\nEdit to add: Also your husband never should have called his family and told them. He turned it into a bigger deal than it needed to be. Especially since you told him at the beginning you were uncomfortable about the soup.", "NTA\n\nAlso, if it’s illegal…report the place", "NTA You handled the situation very well. You did not raise a stink, you were polite through dinner and you did not make the meal about you. You were right in being uncomfortable and are allowed to have those feelings  (I never even heard of shark fin soup before this post so I’d have no idea if I encountered it). But you did nothing wrong.", "Ugh. Chinese woman here. I HATE when people pull out the racist card when it's not racist. It just diminishes actual racism and gets white people on this reverse racism shit. Not okay. You're allowed to dislike and not eat something that is illegal here. You have eaten Chinese food and even say you love it. Your in laws know this. This wasn't being racist, or rude, you were very respectful given the circumstances. Good for you. As a mama to half Asian boys - remember that YOUR culture is equally important too!! Remind your hubby's family that your son is also apart of your culture, as he is mixed, and will experience different cultures but will NOT participate in illegal activity!!", "NTA. There’s a reason it’s illegal. I would have walked out and reported them", "NTA His family is embarrassing themselves by supporting a restaurant that promotes shark fin soup. I would have refused to order/eat anything in such a restaurant. \n\nAnd to be honest I would have told the aunts and uncles they're barbarians for eating it themselves. No point in mincing words.\n\nJust because it's a cultural practice does not make it acceptable. Foot binding was a cultural practice. It stopped because it could not be justified.\n\nBut I am confused. You were not back in China? You were actually in a country where shark fin is illegal? Why not report the restaurant. How is it even still open?", "NTA. Shark fin soup is not only illegal, it's morally repugnant purely for the extreme cruelty of the method of \"harvest\". I'm on your side, I wouldn't want to eat there either. Your husband is lucky you didn't make a scene *at* the restaurant, and is a massive AH for not realising that when you told him you weren't happy at the restaurant *that meant that you weren't happy at the restaurant*. \n\nTrust me, shark fin soup is *not* so culturally important that not eating it affects how Asian he is. Report the restaurant.", "INFO: I'm sure you ate the other animals they had in the menu,  but you drew the line at shark fin, right? Whatever.  You have no moral high ground here.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis year, my husband (36M) & his extended family decided to go to a fancy restaurant to celebrate the holidays. For context as it’s relevant to the situation, I (30F) am a white woman, while my husband and his family are 1st/2nd gen east and southeast Asian. \n\nWhen we originally made plans, we agreed on a local higher-end chain spot that we had been to many times in the past. However, the day before, my MIL sent us a message that her brother had switched spots to another high end Chinese restaurant. I’d never been there,  but I didn’t really care and was happy to go. We regularly eat and sometimes make home-cooked traditional Chinese food anyways, so there was no issue.\n\nSo we pack up our son (1M) and meet his family at this new restaurant. It was mostly nice but one thing struck me immediately. The restaurant HEAVILY advertised and displayed its shark fin soup menu. To the point that there were some fins literally hanging on display. \n\nIn our country, the sale of shark fins is illegal. It’s also known to be extremely cruel (basically, the fin is removed from living sharks and the animal is left to slowly die unable to swim), and ecologically a key reason for some at-risk shark species population declines. \n\nEveryone sat down, and I was notably quiet. I quickly pulled my husband to the side to explain that I was really uncomfortable with this restaurant as it sold shark fin and try to figure out what to do. I was really anxious given the illegality of the dish and morally upset. He said we could talk about it when we got home but to please just get through the dinner.\n\nWhen it came time to order, a lot of the aunts and uncles ordered shark fin soup, while everyone else ordered fancy dishes. Internally I was still freaking out, and quickly just chose the plainest possible noodle dish (basically noodles with oil) and said I would share it with my son. I got some weird looks from my MIL and BIL since they know I regularly love Chinese food and this wouldn’t be my typical order. \n\nThe food arrives and I cut up/give some of the noodles to my son (he still needs to eat) and really just pick at the rest while we’re there. There is a lot of food sharing but I wouldn’t participate and also blocked my son from participating. Some family made comments on my & my son’s not sharing but I just laughed them off or changed the subject. There wasn’t any conflict while we were at the restaurant and I tried to hide my discomfort and hold happier conversations with everyone there. \n\nWhen we got home my husband asked if I was feeling well and why I hadn’t eaten more food. I told him I was uncomfortable eating shark fin and didn’t want to eat at a restaurant that supported eating shark fin, and didn’t want our son eating there either. He got angry and said I was embarrassing him, and I guess called a couple family members. Now I have a bunch of them messaging me saying I am racist and I am “stealing my son’s culture from him”. \n\nAITA for not sucking it up and eating at the restaurant?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA. That place sel something ilegal, and they go there are suporting It. The restaurant its Lucky if you don't call the police.", "NTA but how is your relationship with your inlaws? Do they have a problem with their son marrying a white woman? This might have been some sort of test on their part. Think they will try to use this against you at a later date. Don't let them.", "NTA. You handled it perfectly. It is not racist to be opposed to animal cruelty and illegal  animal harvesting practices. It is ethical. \n\nCruelty to animals is not culture just like slavery is not culture and sexual organ mutilation is not culture.\n\nYour husband should have had your back instead of blowing it up. He should be embarrassed. And his family should be embarrassed as well.", "NTA, report the restaurant to the police", "Report that restaurant immediately! Shark fin is illegal for a reason, and sharks need to be protected and advocated for. Everyone knows hunting sharks is illegal. They knew this and still chose this place, so they obviously don't care and are using their culture to justify the cruel mutilation and deaths of animals. You are not racist or denying your sons heritage. You are standing up for what is right and good. NTA. I wouldn't have handled that tactfully, I'd have said this restaurant is engaging in illegal practices and called right then and walked out.", "NAH-your cause is noble but if you normally eat meat and other animal products you are being hypocritical.  Cows and chickens don’t live good lives either before they are slaughtered.", "NTA. Frankly I would have left. Cruelty is not a part of their culture they should be proud of. 🤢", "I had the same thought.", "They were less offended about just ordering noodles, they were mostly offended that I wouldn’t share/accept sharing food - especially when I blocked my son from being served other’s food. The majority did have shark fin and in the moment I felt it would be very awkward to share with some and not others, and I didn’t want to get into the ethics of shark fin while sitting in the restaurant serving it. \n\nA little bit of me also didn’t want to give money to support a restaurant serving shark fin, and the noodles were definitely one of the cheapest items on the menu, which is why I leaned towards it rather than a non-shark fancier menu item.", "Good point. To be fair to the restaurant I didn’t ask if it was a potential substitute. They did have displayed fins but I guess they could have been fake/decorative, I didn’t really get close enough to investigate. I did some quick googling now and they do show up under a list of sellers on an activist website, but it’s also possible that list just scrapes for “shark fin” on the menu. So I would say likely real but not definite.", "We’re actually in Canada! I didn’t know the whole shark was permitted, I just knew that the sale of fins was illegal and that the practice was largely seen as unethical from the big news stories when it was being banned a few years ago. That being said, the restaurant definitely didn’t have dishes that stated the use of the rest of the shark, it was a noticeably big push on the shark fin soup as a highlighted item & just the fins were displayed.", "There were other dishes, and some did order other things although a lot did also order the soup. My logic at the time was that it would be very awkward to share with some people and not others, and I wanted to avoid having to have the conversation and any potential argument on the issues with shark fin while some people were eating it, so I just avoided us sharing with everybody.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Vegetarian here. Shark fin dishes are orders of magnitude worse than pork & chicken and even dog. \n\nI detest your attitude that being better is bad because you're not being perfect.", "I find it hard to believe that everything they ate was shark fin soup or otherwise had shark fin in it. NTA for not eating shark fin when you don't know how it was sourced.", "If you think they're real you should report them. I know it may not do much but worth doing it. \n\nI'm mostly hoping it's a substitute because they're so brazenly displaying their use of an illegal ingredient.  But I know regulation isn't always great so they may just be getting away with it.\n\nJust a quick Google but you can make something that looks like shark fin, such as for display, with agar agar.  They'll also use these for substitutes in the soup itself - \"chicken breast, jinhua ham, vermicelli, soy, sea cucumber, bird's nest, pig's skin and gelatin\"\n\nAdmittedly I watch a lot of cooking shows where people make one food look like another food so I'm aware of the tricks they can use to make it look real when it isn't so yeah *hoping* it's not real but sadly would not be surprised if it is.\n\nAnd, again, if they knew this wasn't real shark fin *they are still assholes* because instead of just saying \"oh no we don't condone that either, this is actually [substitute]\" they're just attacking you.\n\nIt's not racist to oppose animal cruelty and illegal practices.", "Sorry I should clarify - the restaurant definitely does also sell non-shark items and some people ordered other dishes. The family did order a fair amount of it overall though. I didn’t want to be in the situation of being OK with sharing with some people and not others, and then having to go into the whole dilemma while they were literally eating the soup. I thought it would be easier to just not share at all so the dinner wasn’t super awkward.", "imo nta, as someone who’s chinese indonesian I wouldn’t eat shark fin soup due to the horrible morals behind the harvest of shark fin, and I never have, dk why ur husband is pulling the whole racism card here tbh. you also handled the situation very respectfully", "The culture thing is just bullshit. I’m Indian and reject a lot of things within my culture (as do many people my age) because the practises are cruel, unfair, or not rooted in any logic. Yet, I still consider myself Indian, because rejecting things here and there is not a wholesale rejection of the culture. I am sure there are also plenty of young people in China who think the same way you do. \n\nNTA. Especially because you only kept it to yourself and your son, and made zero fuss about it during the meal, or even to others. Your husband should be asking himself why he is OK eating a product that was so cruelly taken from an animal as a luxury - is that really a good cultural practise that is worth upholding? What will he tell your son about this?", "NTA. Your refusal to eat and have your son eat a dish you disagree with does not make you a racist.", "I think a lot of people are missing the comments in which the OP admits she was wrong -- shark fin soup is not illegal in Canada. She of course still has every right not to eat it, but telling her to report the restaurant makes no sense. \nAs for family members telling her she's racist, it may sound ridiculous based on this post, but there's background there in that the Canadian anti-shark-fin campaign of the 2000s was widely criticized for being rooted in anti-Chinese racism. It's a complicated issue, and a very sensitive one for a lot of older Chinese-Canadians. OP isn't TA, but it's understandable why the people she was with might be hurt by her judgment (especially if they were eating *imitation* shark fin soup, which is quite common).", "NTA. Tell anyone who complains “you might have no problem with breaking the law and cruelty to animals, but I do and I will not make an innocent child part of it either!”\n\nEdit: gotta say though, I wouldn’t have gone in at all.", "NTA. But you will be if you don't report that restaurant", "NTA - The fact you didn’t make a big deal about it to his family but he did is a huge red flag. He needs to grow up, going crying to mommy and causing problems is such a childish reaction. The stealing your sons culture comment is wild. Cultures change as we progress eating something like shark fin soup isn’t cool. If I knew where the restaurant was I would report it.", "Nta. You found yourself in a morally dubious situation and acted as you saw best for you and your son, without creating a scene at the table. Alongside the moral issues, there’s also the safety issues that arise with (potentially) illegal products. Items that are illegally sourced/imported etc aren’t subjected to the usual safety standards/tests/checks etc which could make them risky to eat.", "Are you a vegan?\n\nNot sure why you'd object to shark fins and not, like, every other animal product industry.", "NTA, report the restaurant. It's shocking that it's even heavily advertised.", "YTA ---- I kinda get this.  I lived in China for 9 years and food culture has a whole different aspect that I am 100000% sure you haven't seen all of, even though you married into the family.  Yes, food sharing is part of the culture.  It is seen as a politeness and a way of showing that there is room for all and that all are important. It comes from a history of there being times of lack and the focus on everybody being equals and important.  It comes from a place of respect.  Just because YOU don't understand it doesn't mean it isn't important.\n\nAll cultures have food oddities.  Many religions will not eat pork.  Other cultures will not eat beef.  Still others will not eat shellfish.  None of them are right or wrong.  They just are.  Now, I totally get what you are saying --- there is an element of cruelty to the  harvesting of sharkfins. I get it.  It kinda grosses me out, too.  BUT -- I'm also not of that culture.  There is a slow evolution now -- there is more harvesting of the entire shark (grilled shark steaks are delish).\n\nYou have a decision to make.  You have to decide which is more important to you ---1)  Your moral high-horse about shark fins or 2) your love for your husband and respect for his culture and family.  You knew he was of a diff culture when you married him.  You don't get to say, \"yeah, but...\" now.", "Nta, report the restaurant please. Better yet take pics and send it to local news. That said... your husband is the asshole!! Why did he have to get family involved by calling them? Make sure he never ever does it again. This will tear your family apart.", "YTA, and borderline racist. This is your son’s culture. You should have been fine with him eating everything but actual shark fin. You yourself are not going to solve an ecological problem with your behavior at one meal, and you were placing heavy judgment on your husband’s family. I take it you abstain from consuming all ecologically harmful goods? You live in a grass hut? You don’t use plastic? You don’t buy shipped goods? Or just make moral stands against cultures that aren’t your own? \nYou were wrong here and you owe apologies, and you need to recognize now that your son has a right to all aspects of his culture, whether you like them or not.", "Yta for not sending the authorities there. But other than that, no your good", "You behaved amazingly! There's no way I would have sat there quietly like you did. I would have loudly made it know what they were selling is illegal and horrible. There's no way I would have sat thru the whole meal nicely! \n\nNTA but husband and his family are! How TF was he embarrassed exactly? You did nothing at the restaurant in front of his family. You told him privately, at home. He then let his family know of your private conversation. So if he's embarrassed, that is 100% on him. Also, how long have you 2 been together? For his family to jump straight to calling you racist is absolutely disgusting. \n\nYour husband should be embarrassed... by his own family. You did nothing wrong OP! NTA", "NTA. Shark fin soup is a terrible practice and it’s illegal in your country. I would support that restaurant as little as possible too.", "NTA \nIf the restaurant doesn't offer any other shark based dishes using other parts of the carcass then they are not advocating for ethical shark fin collection and are basically encouraging the non ethical and horrifically cruel collection methods. This is also nothing to do with racism or stealing your sons culture!", "NTA. \n\nSo first, you didn't embarrass anyone. You had a private conversation with your husband about it, then you ate lightly, and went home. Your husband thought you were feeling ill, and likely others at the table thought the same thing, so it was only by HIM calling people to tell them why you didn't eat that this became a problem for anyone else there. \n\nIgnore the messages from his family, and tell your husband due to HIS actions his family is calling you racist, and he can deal with that because now you aren't going to be around people that would call you racist. That is fully on him to deal with, and honestly, I wouldn't be around anyone who would text/tell me that. \n\nAnd it isn't racist to uncomfortable with animal cruelty. Sure, most of us- of all cultures across the globe- participate in practices/food that are cruel to animals and do a host of other practices that are bad for the environment or society. But, we are all allowed to decide how to navigate that, and I think a fair one is not participating in actions deemed so bad they are illegal like shark fin soup or items made out of ivory. \n\nThat's a very reasonable boundary, to not want to eat illegal food and support a business that does, and again, you were very polite and nonconfrontational in your discomfort. Your husband has now created a vile situation between you and the family members he told, so stay away from them and let him clean up the mess.", "NTA, however your husband on the other hand…..\n\nWhy did he feel the need to call family members and tell them? It just invited them to heap insults on you.", "NTA. I'm Asian and I told my family I'm not showing up if we go to a restaurant that serves real shark fin (note that many Chinese restaurants serve fake shark fin soup). \n\nYou sucked it up enough by not saying anything. It sounds like your husband either doesn't share your position or doesn't care enough to make a stink. \n\nMy family used to call me a problem but now they don't drink shark fin soup.", "NTA at all.  Some traditional, cultural staples are dying out for a reason - every new generation tries to improve on the mistakes of their ancestors, right?", "NTA\nYou were standing up for something you believe is wrong and hurtful to another living thing. You shouldn’t be shamed for that.", "NTA  You did absolutely nothing to embarrass him at the restaurant. Hes the one who called attention to it by acting like a gossipy old woman and telling his family what happened when he could have just kept his mouth shut. He has no one to blame for that but himself.", "NTA. It's racist to not want to eat shark fin soup now? It's a cultural thing to kill an animal slowly and painfully for their fucking fin? What the fuck is that logic?", "NTA. You should also report the restaurant if you can\n.", "NTA and quite literally the only adult in this story who doesn’t suck. Cruelty isn’t cultural. It’s just cruelty.", "NTA and report anonymously the restaurant. Culture is no excuse for such practices.", "NTA. \n\nBut if I were you I would have said that we could either go somewhere else to eat or we would leave. I wouldn't have stayed and had a meal where illegal activity was happening. \n\nNext time, be honest and tell then to change the restaurant or you and kid will leave. Let them be upset, you dont have to be apart of that type of place and give your money to someone like that. \n\nAlso, I would report the restaurant for illegal activity.", "NTA. You're awesome.", "NTA. Fuck that. East Asians are also actively campaigning against sharks fin these days. You're right to shame them!", "NTA, a single dish is not a culture. Shark fin is illegal for a reason. Same with rhino horn or elephant tusk, they need to go. Minimally it's not dissing an entire culture if you don't partake", "NTA Shark fin soup is HORRIFIC. Also I'd be reporting that restaurant.", "NTA but while I don't eat Shark Fin, because I don't like seafood, I don't care about the legality of food. My problem is why not just kill and eat the whole Shark along with the fun?\n\nBut anyway, both of you should be able to chose what your son eats and he should be allowed to try the dish. As for his family calling you racist? That makes absolutely no sense.", "NTA.\n\n>I was really uncomfortable with this restaurant as it sold shark fin and try to figure out what to do.\n\nTake a photo and report it is what you do, this is one law that exists for a good reason and should be enforced.\n\nTell them if their culture support immoral practises like shark fin then you will fight them tooth and nail to stop them from ever sharing that culture with him.\n\nCulture is no justification for immoral practises and trying to hold onto those practises in the name of culture just result in the entire culture becoming a problem.", "So the biggest problem is that your husband called his family members and sent them after you for this. You should really think about that NTA", "yta. report the resturant if you want to, but the fact you refused to let your son participate in sharing food for the sole reason of the fact they sell shark fin soup is pointless and stupid", "[removed]", "OP is wrong, though -- the sale of shark fin soup is legal in Canada. There's nothing to report.", "Sounds like he’s just overly emotional and needed support. He’d do better to take some classes on emotional regulation and listen to his fucking wife.", "In most east Asian cultures,  when you marry the person,  you marry THE FAMILY. \nOne of my friend's from Korea asked me if I'd talked to my mom and dad about something in my marriage and was shocked to learn, most westerners don't do that. \n\nRegarding the race card. I agree. OP isn't racist,  the family has outdated views. \nThey may be clinging to old mentalities in a new world out of \"tradition\"  She needs to bring her husband to the 21st century with her.", "In general our relationship is pretty good. I wouldn’t say we’re close but we are always friendly and generally get along. They were very supportive of our marriage. There have been a few comments that have caught me off-guard since my son, mainly things like “OH he looks a lot like you with light brown hair, I never thought I’d have a grandson with light brown hair!” sort of thing, and a couple questionable comments on my post-pregnancy weight (I’m like 150lbs and ok with it, but the women in my husbands family are all a good 20-30lbs lighter than me. My MIL has made some unsolicited suggestions on diets I should try, I should go to the gym while she watches baby, etc). But honestly I chalk these up to “old people comments” and try not to take any offence. I don’t think this situation was a test set up from them.", "they are in Canada where it's not illegal.", "So you can’t have a line? It’s either everything or nothing then? If you’re not a vegan living in a grass hut, you might as well dump your garbage out your window and kill every animal you see? Is that the position you’re taking?", "I'm a vegetarian and you're an asshole.", "It's legal in Canada as long as the fin is taken off a dead carcass.\n\nNothing to report a shark was killed and the fins ended up in this restaurant.\n\nWhat's illegal is cutting the fins off a live shark and then dumping the shark back in the water.", "You failed to say why you think she's an asshole.....this isn't about culture, your pretty oblivious if you think so", "Ok so a few things: \n\nSharks aren’t farmed. They’re harvested from the sea in their natural habitat. Those cute cows and pigs we buy chopped up in the store literally wouldn’t exist if we didn’t want to eat them.\n\nSharks are overharvested, affecting the local fish populations. (Not enough sharks = too many fish = fish eat all the plants = no more fish). I know, it’s a bit difficult to wrap your head around it but know that over harvesting = bad for the whole environment\n\nONLY the fin can be consumed. The rest of the animal is too ureic and is fucking nasty. The fin apparently also doesn’t actually taste very good and is only a status symbol. \n\nThe above means, in case you missed it, that harvesters chop off the dorsal fin only then leave the shark in the water to die slowly.\n\nYou can certainly argue that other animal consumption is also bad for the environment and living conditions are cruel but you can’t tell me that cow and pig aren’t fucking delicious and we use the whole animal.\n\nEating a shark is more akin to eating a white rhino than a burger", "It's not an illegal practice, though. Maybe it should be, but it's not.", "Partial comment stolen from: /u/hey_thatsmyinbox \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/zovut1/aita_for_refusing_to_eat_at_my_husbands_family/j0p7gh5/\n\nBot Reported.", "That is a glaring disappointment, Canada. Get it together, you’re supposed to be the good one.", "The import and export of shark fins is illegal in Canada.", "Aussie here, I think our laws are similar to yours.\n\nI think you’re maybe missing the fact that a fisher doesn’t have to sell the entire carcass to one person.   Fins go to the high-end restaurant, fillets go to fish and chips (rest goes to cat food or whatever).  Theoretically, the majority of the animal does get used, just not in the same restaurant.\n\nWhat *was* happening is that they’d just get the fins, throw the rest back and waste a lot of meat trying to maximise their profit-space ratio.   Now that they’re forced to bring the whole shark back to shore, wastage is less of a problem (they might as well sell it, now that it’s on land).", "Do you...understand what veganism is?\n\nDo you support the ethical treatment of animals? You seem to think that it's cruel to rip off a shark fin but not to forcibly impregnate cows, steal their babies, and ultimately slit their throats - so you can have cheese in your omelette.\n\nI'm sorry, but your position is logically incoherent.", "Vegetarians are just as guilty as carnists.\n\nDo you know how dairy cows are treated?\n\nAnd you're a hypocrite. Educate yourself.", "Per the OP,\n\n>In our country, the sale of shark fins is illegal. \n\nShe doesn't say anything about sourcing, just that the sale itself is illegal. She should report it.", "She took issue with the food sharing  -- which is absolutely cultural.  She took issue with the food itself -- again, totally cultural.", "how is shark fin any worse than flounder fin for example? there are presently laws in most countries which require the entire shark to be killed sold, not just the fin cut off, which was the reason for the concerns in the first place.", "Yes they are horrible, but it is ~~probably~~ horrible for the other animals too. Detest all you want but this is the truth of it.", "yes it is. people are prosecuted for it. sharks are endangered. so I guess your ok with people eating and hunting protected species", "No shit. Very disappointed.", "It’s a dumpster fire up here tbh. I’m just patiently waiting for the collapse of society so we can start rebuilding our healthcare, education, and economy. Until then, don’t look up North for good examples because we aren’t setting many ✌️", "The import and export of *detached* shark fins, yes, but not the import, export or fishing of whole sharks -- from which shark fin soup can still be made legally.", "No matter how shark fin is \"sourced\" it is highly problematic.", "The market for shark meat is much, much smaller than that for shark fins. Especially of those species preferably used for shark fin soup.\n\nApproximately 75 million sharks are kiilled each year for fins, only a ridiculously small percentage of them get used beside the fins.\n\nRules like those you describe will - if at all - only prevent a small fraction of that.", "She posted again that she is in Canada.\n\nThe op is wrong in the illegality of the product", "You are dense, plain and simple. But I'll attempt to humor you....is refusing to support foie gras practices anti French? Nope, noone would make that claim....yet here you are, literally pulling a parallel move....being said, she didn't have a problem with sharing food, she had a problem with sharing THAT food", "I feel like you didn’t read the comment you’re responding to…..\n\nWould you rather stub your toe or lose your foot?", "You don't understand. I detest your attitude because it's the enemy of improvement\n\nI'm vegetarian. Pointless, you are not vegan\n\nI separate my garbage. Pointless you still fly\n\nI refuse foie gras because it's so cruel. Pointless you still eat meat\n\n&#x200B;\n\nYou diss every small improvement anybody makes because only perfection is acceptable in your minded stupid view of the world.", "As if America ever listened to reason anyway.", "You did so well, there’s no way I wouldn’t have left the table the minute the first bowl of cruelty arrived.", "nah because it’s hypocrisy snd most time the things you “cut out” are things which aren’t important to you. if shark fin soup is not something part of your culture or that you enjoy it’s pretty easy to be rightous is about not eating it."]}