{"id": 5051, "submission_id": "zp6hnk", "title": "AITA for confronting my cousin’s boyfriend & causing them to leave the family vacation?", "selftext": "Edit: I need to clarify that my question is whether I’m the asshole for confronting him when he yelled at Ally. The family has already agreed not to mess with strangers anymore & I know I’m the asshole for violating his privacy. I appreciate the answers that I’m wrong for entering his room, but they don’t help answer my question. In the moment when I heard him cussing out Ally for my actions, my instinct was to confront him, and I’m inquiring if THAT makes me the AH.\n\nEvery year my family takes a weekend trip in December to the same place, ~3-4 hours from where we all live. Any given year there’s between 14-20+ of us. My mom foots the bill for the hotel for everyone. This year myself (25f) and my boyfriend (26m) split a connected room with my cousin Ally (21f) and her boyfriend Craig (21m). Most of us hadn’t met Craig yet before this trip.\n\nWe’re a generally loud, friendly bunch but we all have big personalities. All of our keys were programmed to open all of the rooms. This morning my mom made breakfast in the room we’d all chosen to congregate in & it was ready around 9. It’s normal for everyone to roll in as we wake up, but if you sleep late, you also may have someone pop in to mess with you. Around noon my brother (a child) went to the rooms where cousins were sleeping & poked at them saying “wake up” & left. Some did, some kept sleeping. We realized Ally was at breakfast but Craig wasn’t. I jokingly said I’d get him, went to their room, turned on the lights & said “good morning sunshine breakfast is ready when you are!” Then I left.\n\nThe door connecting our two rooms was closed when I went back to my room. I heard Craig yelling at Ally so I started listening, and he was cussing at her about me turning on the lights, calling me every name under the sun, etc., so I knocked on the door & said “hey buddy these walls aren’t as thick as you think they are.” He yelled back “good I hope you can hear me bitch, who the fuck do you think you are?”\n\nHonestly, I saw red. More words were exchanged. After, I went to the congregating room and told the family what happened. Next thing I knew, Ally’s dad was driving Craig home & Ally, her mom & brother were also leaving because they rode together. They were barely here 12 hours. Ally is pissed at me. It seems like her parents have taken Craig’s side. My mom & grandma are concerned that Craig has fooled them into thinking he’s Mr Nice Guy & that behind closed doors he’s mean to Ally (she has always been very shy and sweet and quiet). I don’t know what I think about that in particular, I just know I hate him & I’m too close to be objective. Especially because maybe our family games are normal & fun to me but totally absurd to an outsider. So please opine because if I’m in the wrong here I’ll own it and I could see it both ways. AITA?\n\nEdit 2: I was asked to add my following reply to one of the comments: \nWe didn’t wake him until noon, breakfast had been ready for 3 hours. We also had plans he was holding up. \n\nI also just found out that Ally’s parents actually took him home out of respect because they were displeased with his behavior as well. Apparently Ally’s dad wanted us to sit down and speak civilly (which I would have been so happy to do) about what happened, but Craig refused because he said he was too upset. I also learned Craig lied about when I came in the room and said I slammed all their doors/drawers and that I said other things I hadn’t.\nMy mother also learned he had broken a wine glass in the room the night prior, before any of this happened. No explanation given. Could’ve been an accident. We didn’t hear anything in our room. But odd.", "created_utc": 1671392583, "permalink": "/r/AmItheAsshole/comments/zp6hnk/aita_for_confronting_my_cousins_boyfriend_causing/", "score": 206, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think everyone sucks here—I’m likely the asshole for turning on the lights, but Craig verbally abusing Ally over it feels inexcusable to me.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Yes, some of your habits are... how to put it... a bit too much. If I were on this holiday with you, I'd be extremely weirded out if 20 people I don't know had the key of my room. And I'd be very pissed by a random stranger entering my room and demanding me to wake up. I may be resting (a vacation is for resting), I may be feeling unwell, I may be in the shower, I may be naked. Yours is extremely intrusive behavior.\n\nOn the other hand, Craig shouldn't have insulted Ally or you, so ESH.", "ESH, if Someone I don’t know comes into my private room to wake me up I’d be pissed.\n\nSure, he shouldn’t have called you names but you need to understand that not everyone is going to be ok with your family lack of boundaries.", "Why are you all allowing a child to walk in to adults' room like that? Have you never considered people having a morning quickie?\n\nIt is so very off that you all can open each other's rooms like that, and that you will mess with each other. Sounds like this was going to happen one way or another. So the kid wakes him up first with an undignified poke, and then you barge in and yell at him? \n\nThis doesn't sound cute or fun loving, but just mean spirited, and a disaster waiting to happen for the kid allowed to barge into rooms without warning. \n\nAnd he wasn't being mean to Ally, but rather bad-mouthing you, to which you joined in. Sounds like you're both in the wrong here, but no judgement because the dude also over-reacted a bit.", "ESH\n\nCraig definitely overreacted but someone had already gone in to wake them up. Craig had remained sleeping, your cousin came down. You overstepped by going in there and attempting to wake him up a second time.", "ESH. \n\nYou crossed a boundary then he jumped on it and totally blew this out of proportion", "ESH: jeez, have some boundaries to barging into peoples rooms and turning on the lights. That just weird at your age to be doing that. For Craig, he is an asshole for snapping like that, and how he spoke to ally. \n\nAlso, don’t confuse the fact. Craigs behavior is one thing. But the barging and not rooms is what created this issue.", "ESH… you have not met him before but it seems a little too close for comfort to barge in the room and turn on the lights. You never know if someone isn’t feeling well and if I was woken up like that by pretty much a stranger still, I would be upset too. But his reaction was uncalled for and he seems like an asshole too.", "It's rude to just enter someone's room and demand they wake up for breakfast", "ESH. YOu didn't know him to wake him up like that. You violated his privacy, and that is just rude. However, yelling and being verbally abusive is no excuse. You started this and bear some responsibility for what happened. In the future,  everyone having keycards only for their respective rooms might work better as well. The setup could make for another family blow-up.", "ESH\n\nHe was wrong for escalating things as far as he did. You were wrong for bothering him while he was sleeping.", "\"We’re a generally loud, friendly bunch but we all have big personalities.\" Let me translate: \"We're obnoxious assholes who refuse to accept that other people might like some peace and quiet.\" YTA", "What you did was rude, but his response was over the top, plus he vented his rage at Ally. NTA.", "I was about to judge E S H because startling people awake is really inconsiderate, but his reaction was completely out of line. I could understand him being annoyed, but cussing out your cousin and then calling you a b**** and yelling at both of you? That seems ridiculously hostile and violent. God, that's actually really worrisome, especially since he's only just met most of you. \n\nNTA and honestly, I would be concerned for your cousin's safety with him.", "YTA\n\nyou invaded his privacy, for all you knew he could have been undressed/undressing.\n\nyou woke him up.\n\nyou eavesdropped on his conversation with Ally, and even had the nerve to interrupt, as though you were in the right! \n\nCraig had every right to be mad.", "NTA, holy hell Craig is really a sensitive little snowflake. I mean you turned the freaking light on, you didn\\`t drop a bomb in his room. I get that some people don\\`t like being woken up but still nothing can justify that much unnecessary cursing and insulting.", "NTA.\n\nI get him not being fond of getting to being woken up that way, but you don't get to yell because of it. Also it was after 9AM. I myself like sleeping in late, but 9AM is *not* early in the slightest. You were all having breakfast and it would be rude to not want to include him. He could still have said \"I'm not hungry and still really tired, so I'm gonna skip it this time, but thanks anyway.\"\n\nJust a few things that stand out though:\n\n1. him yelling and cussing at your cousin, callling you all sorts of names\n2. him yelling and cussing at you\n3. her parenst actually taking *his* side over their own daughter's side\n4. considering most people haven't met him get me thinking they aren't together for *that long*. Not only that, but also he's younger than you, and yet he confidently acts like that??\n5. \"My mom & grandma are concerned that Craig has fooled them into thinking he’s Mr Nice Guy & that behind closed doors he’s mean to Ally\" I'm afraid they are spot on.\n\nCraig is a major AH, and Ally's parents are major AH's for allowing their daughter to be treated that way. Ally is NTA in my opinion because while she is angry at you for a wrong reason, she is basically in an abusive relationship with no one close helping her and probably being gaslit that Craig is an amazing guy who can do no wrong and that everyone who is against him is the bad guy, in this case you.\n\nI hope she gets out of that relationship, because it will only get worse...\n\nEdit: spelling", "He had already ignored other attempts to wake him up + his girlfriend waking up and getting ready next to him, and he was asleep past noon? And he lost his mind when someone came in and turned on the lights? NTA.", "YTA - you effed around and found out why not to poke a sleeping bear.  He was a rude as a subsidized guest perhaps but I'll forgive that because of your over-the-top behavior.  You'd have gotten worse from me.", "nta\n\nCraig sounds like he has serious anger issues.", "If I was in his position I’d feel utterly disrespected and would feel pissed too. What exactly gives you the right to dictate when he gets up? \n\nYTA", "Absolutely NTA. Craig sounds like a future wife beater.", "Nta he was a guest meeting his girlfriend's relatives and is not up and downstairs by noon? How rude. He was holding up plans that were made for the day. It should've been Ally getting him up. He sounds a nasty piece of work. Hopefully you won't have to deal with him again.", "YTA", "I think people are missing that if the family wanted privacy they wouldn’t have all the keys programmed to unlock all of the rooms. I think main reason is you heard how Craig verbally abuses your family member and now that his nice guy persona is exposed he got angry. NTA", "Based on you clarifying what you’re actually asking, NTA. The way you’ve described the way Craig was talking to you cousin was uncalled for, his reaction to you was even more out of line. Yes you were out of line for going into basically a strangers room and turning on all the lights but there were appropriate ways to talk to you about this.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEvery year my family takes a weekend trip in December to the same place, ~3-4 hours from where we all live. Any given year there’s between 14-20+ of us. My mom foots the bill for the hotel for everyone. This year myself (25f) and my boyfriend (26m) split a connected room with my cousin Ally (21f) and her boyfriend Craig (21m). Most of us hadn’t met Craig yet before this trip.\n\nWe’re a generally loud, friendly bunch but we all have big personalities. All of our keys were programmed to open all of the rooms. This morning my mom made breakfast in the room we’d all chosen to congregate in & it was ready around 9. It’s normal for everyone to roll in as we wake up, but if you sleep late, you also may have someone pop in to mess with you. Around noon my brother (a child) went to the rooms where cousins were sleeping & poked at them saying “wake up” & left. Some did, some kept sleeping. We realized Ally was at breakfast but Craig wasn’t. I jokingly said I’d get him, went to their room, turned on the lights & said “good morning sunshine breakfast is ready when you are!” Then I left.\n\nThe door connecting our two rooms was closed when I went back to my room. I heard Craig yelling at Ally so I started listening, and he was cussing at her about me turning on the lights, calling me every name under the sun, etc., so I knocked on the door & said “hey buddy these walls aren’t as thick as you think they are.” He yelled back “good I hope you can hear me bitch, who the fuck do you think you are?”\n\nHonestly, I saw red. More words were exchanged. After, I went to the congregating room and told the family what happened. Next thing I knew, Ally’s dad was driving Craig home & Ally, her mom & brother were also leaving because they rode together. They were barely here 12 hours. Ally is pissed at me. It seems like her parents have taken Craig’s side. My mom & grandma are concerned that Craig has fooled them into thinking he’s Mr Nice Guy & that behind closed doors he’s mean to Ally (she has always been very shy and sweet and quiet). I don’t know what I think about that in particular, I just know I hate him & I’m too close to be objective. Especially because maybe our family games are normal & fun to me but totally absurd to an outsider. So please opine because if I’m in the wrong here I’ll own it and I could see it both ways. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and he was being rude by staying in bed and not joining everyone.  His temper is dangerous and I'd worry about Alley too. \n\nAlley knew how everyone is on this vacation and should have warned him what happens if  a person tries to sleep in, but still no one deserves to be screamed at or cussed out.", "Don't invade someone else's privacy. It is rude. You did it twice. Once when you went in the room and again when you listened in/interrupted.", "NTA based on all your comments: he was still asleep at noon. You turned on the lights and said one sentence and left. He was yelling and cussing loud enough to hear through a shared wall/door. He lied about what you did (said you slammed stuff and yelled).\n\nIf this is his first time to meet the family, this is him on his best behavior. His best behavior is sleeping till noon, cussing, yelling and lying. \n\nI agree that you guys need to rethink how you approach new people, and you’ve accepted that. You stood up for your cousin and I would have done the same damn thing in the moment.", "NTA\nWe are the same as your family. \nBUT if someone says not to disturb them while sleeping we don't . \n\nThere was no need of cussing and screaming from bf", "Yes—I accept that I’m the asshole for turning on the lights. My question is whether I’m the asshole for confronting him cussing/yelling at Ally about me and causing them to leave.", "No one had gone in there to wake them up. Ally woke up on her own and came to breakfast. I was the first to make a wake up attempt.", "What boundary? Waking him up?", "This is sort of what I was thinking, too. This is what we always do but I could see how it might be seen as rude by someone else. In the past, new boyfriends/girlfriends/friends who joined our family trips have had a good sense of humor and joked back/pranked back so we were all taken aback by his reaction. Also, if he had an issue, he shouldn’t have yelled at her. He should have yelled at me (from the get-go). And if he had come to me civilly and said “hey I didn’t like that,” I would have apologized. We did it to everyone still sleeping at noon, not just him. We had plans and they were holding us up.", "You’re judgment is fine but for the record, we totally would have respected his request for something like that not to happen again if he had brought it to us civilly, even if through Ally because he was uncomfortable approaching directly.", "It’s still ESH. It’s crazy to go to someone’s room when you barely know them. \n\nCraig is obviously much more in the wrong, but the OP is still an AH.", "I accept that I am the asshole for waking him. My question is whether I’m the asshole for confronting him cussing at Ally. It seems that’s how you feel, and that’s fine. For the record, I didn’t want her to be punished for something he was angry at me about.", "OP walked in on Craig. for all she knew, he could have been naked or something. that was such an invasion of privacy.", "We didn’t wake him until noon, breakfast had been ready for 3 hours. We also had plans he was holding up. \n\nI also just found out that Ally’s parents actually took him home out of respect because they were displeased with his behavior as well. Apparently Ally’s dad wanted us to sit down and speak civilly (which I would have been so happy to do) about what happened, but Craig refused because he said he was too upset. I also learned Craig lied about when I came in the room and said I slammed all their doors/drawers and that I said other things I hadn’t.", "Those are signs he probably had a really bad night, perhaps a chronic sleep disorder.  One hallmark of the latter is poor emotional regulation and acute irritability.", "Or possibly chronic sleep issues, which can feed anger issues.", "So you think it’s OK for Craig to yell at his girlfriend? ESH.", "100%", "He was screaming at her loud enough for me to hear in another room. He gave up his privacy when he decided to yell at her loud enough for us to hear. I can’t violate his privacy by overhearing him. I just started listening to what he was saying when I heard the venom in his voice.", "Yes, you are.  You provoked the situation by violating his privacy and behaving like a boor.  You should never go into someone's room without permission or great cause.", ">Around noon my brother (a child) went to the rooms where cousins were sleeping & poked at them saying “wake up” & left.\n\nYou stated your brother went in there to wake up the cousins.\n\nAnd no, you weren't the first to make an attempt. Your cousin had that chance when she came down. If she didn't, it was for a reason.", "Yes? You don’t just go into someone’s room without permission???", ">In the past, new boyfriends/girlfriends/friends who joined our family trips have had a good sense of humor and joked back/pranked back so we were all taken aback by his reaction.\n\nHere's the thing: Did they actually enjoy it or did they just play along in the past to try and make a good impression?", "No one is going to defend his actions because he was over the line. But you should accept that this happened because of your actions, it doesn’t matter what your intentions were, it was you who thought it would be fine to prank a stranger.", "Don't you think it's a bit much for others to have to ask you for basic good manners after the fact instead of simply having them in the first place?\n\nI don't throw the term \"disrespect\" around lightly but that's exactly what it is.  Dangerous too.", "never in my life as an adult have I had to request someone not enter my locked bedroom. you were the first one to make an extremely unreasonable, privacy-violating, boundary-crossing move. you're a huge asshole. sounds like you come from a family of huge assholes. your behavior is disrespectful and not normal. he had no reason to expect you to respect any request after that.", "Don’t you think maybe you shouldn’t have even done it in the first place? What kind of attitude is this?", "But it's even crazier to yell at someone you don't know and call them a b****, especially when it's your girlfriend's family member. \n\nAnd it bothers me a lot that he was screaming and cussing at Ally when she did nothing at all. The way he felt so comfortable screaming at his girlfriend while in a house full of people he had only just met, and being so very hostile to OP, makes me think that this kind of violent behavior comes naturally to him and I would guess that acting like this is probably not out of character for him. I find that really concerning, but maybe that's just me.\n\nOP flipping on his lights was annoying for sure, but that totally pales in comparison to his over the top reaction.", "He was angry at her too. My guess is that she didn’t properly prepare him for how your fmaily interacts.\n\nSome people are okay with a loud, inclusive family treating them as part of the tribe. Others find people being familiar with literal strangers to be off putting and need time to adjust to more …involved family dynamic then they are used to.\n\nCraig definitely is the latter. That’s not an excuse  to berate someone. However, it is a reason. His personal boundaries weren’t considered by anyone in the family, including his girlfriend.", "No you're not TA he had every reason to get mad but I don't think calling a relative of your partner (not to mention one who you're just meeting and trying to be in the entire family's good graces who is also paying for the entire trip) such names because you were woken up", "yada yada yada... sispu ga", "You should add this as an edit to your OP. It will change the judgement for a lot of people.", "In that case I have to re-adjust my vote a bit. Ally's parents aren't the major AH's I thought they were, you are still NTA, especially when it was noun, Craig's AH- score just grew IMO. Really, not everyone would like that, but being civil isn't that difficult for normal people. Also, people in the comments say he might be an introvert, but newsflash, an introvert wouldn't have the confidence to yell like that to someone they barely know. *I'm* an introvert, it takes a lot of energy to *talk* to people who are basically strangers, let alone *yell.*", "He has rage issues and totally understandable to think that can be dangerous. His sleeping in till noon is rude and spoiling everyone's vacation.   Dont let him ruin future vacations with his antics.", "If that were the case, then Ally should have mentioned it when OP said she was going to wake him up.", "Was he cursing her or venting about OP?  The former would be completely wrong (unless he knew she sent OP); the latter perfectly understandable.  \n\nFrom the text, it seems he was cursing about OP to her and OP \"saw red\".", "Sounds like he was ranting about what a jerk OP was, which I don’t think rates assuming Craig is like some horrible abuser.", "You're saying OP is an AH for trying to intervene when Craig was screaming at Ally and berating her for something she didn't even do? What? That sounds like \"great cause\" to me and OP is not an AH for trying to stand up for Ally. \n\nYes, the prank was annoying, but Craig turned it into something else entirely.", "Her walking into a room to wake someone up is an invasion of privacy but absolutely does not warrant screaming, cursing, and being hostile.", "Why does Ally deserve to be punished for what I did?", "NTA - There was NO reason for him to curse and yell at Ally.", "We had 6 different rooms; my brother went into the other rooms, but he hadn’t gone to theirs because he thought they were with us. I don’t know if Ally tried to wake him up or not when she got up. As far as other people actually entering their room, I was the first", "You do if you were told go wake up him up AND he was holding up plans by not being up.", "This is a great question. I think the ones who pranked us back/actively participated in our jokes enjoyed it but I’d say on the flip side there had to be others who smiled and gritted their teeth and I hate that we probably upset them inadvertently", "Yes, we’ve decided not to mess with anyone new to family functions anymore.", "Certainly, and we’ve agreed not to do things like this to strangers in the future. But in the moment where the damage was already done, the appropriate response would have been civilly requesting privacy in the future. I’ve not once argued that I am in the right for going into the room.", "Fight fire with fire. Got it.", "Did you miss the part where I said “Craig is obviously much more in the wrong“?\n\nThis is not a zero – sum game. There can be more than one AH.  Craig is by far the bigger AH; but the OP is one too.", "LOL he’s an introvert in that he needs to get to know you before he cusses you to high heaven, I suppose", "Good point.  How long have they been together, I wonder.", "Certainly it would be much worse if he were actually cursing at the sister.  But Craig is still in the wrong for yelling at his girlfriend, regardless. And he’s doing it in the home of her family (their trip and they paid). And since he never met them before, he should’ve been on his best behavior. If this is his best behavior, then I think it’s a bad situation for the girlfriend.", "To clarify: he was cussing about me to Ally, calling me names, but directing his anger towards me at her. As in, he was angry with her for what I did & blaming her for it. She knew I was going to do it and didn’t stop me, but blaming her for something I did is still unacceptable because she has no control over my actions. I did not see red until he called me a bitch and asked who I thought I was. If he wanted to vent about me that’s all good, I would’ve been MORE than happy to speak civilly about it. What I was not okay with was Ally getting cussed at for it, so I knocked on the door to tell him to knock it off, and he started cussing at me. That’s when I saw red.", "The fact that he is yelling at his gf, alone makes him an AH. If he’s going to yell at anyone, he should’ve yelled at the OP. \n\nNumber two, he “called OP everything under the sun.” That’s still her brother. Craig should not be talking about OP’s brother in those terms.", "Berating her or venting?  OP says the curses were directed at OP.", "The hell it doesn't.  Someone doing that to me will get worse and deservedly so.", "I have a family similar to yours. My partner’s family is the exact opposite. I spent the first year of our relationship wondering if their parents hated me because they never initiated a hug. My partner spent the first year feeling the teasing by my cousins was personal and meant they didn’t want them around. It was complicated.\n\nHowever, the main point is that we were responsible for our own families. If my partner was upset that my parents were being too informal or intrusive they talked to me. If I wasn’t able to see what the problem was - because we only know the family dynamic we know - that sometimes turned into an argument. The same went for any issues I had with their family.\n\nIt would have been horrible if my parents barged in and said my partner’s issues were with them. It’s my job to prep my partner and advocate for them, just like my partner does for me. \n\nThe argument between your cousin and her bf may not have been completely about you. It could have been more about why she wasn’t supporting him and siding with the family instead. It could have also been about why she didn’t warn him that your family barges into stranger’s rooms.\n\nHowever, even if it was solely about your choice to walk in and why that bothered him, that’s still a communication issue between the two of them. If they are a couple then they need to decide together how to handle it, and she likely needs to be the one to tell the family what their boundaries are as a couple.\n\nIt’s not “punishment” to have an argument with a partner. Ally also needs to be able to navigate arguments herself. It would have been fine to stop the argument because you believed the behavior was unacceptable, but an argument about one partner’s family absolutely should be between partners.", "I was under the impression that he was berating \"U\" to his girlfriend, as is his right as she should have at least warned him that your family has poor boundaries with strangers... And then you burst in once again... once again the blatant disregard of their rooms boundaries, and while you did the right thing trying to redirect his righteous anger to the right target, he does not know U at all.  YTA in this situation.", "From your description, it sounds like was venting about *you*, not attacking her per se.  \n\nIf he was, then he's a total AH.", "And you shouldn't have. If Ally didn't try to wake him up, it was for a reason.\n\nDid you even ask Ally about him still being asleep or did you just go upstairs without her knowing?", "The only 'plan' was shared breakfast at that point. Didn't even bother checking with his gf why he wasn't there.", "Upset and made them extremely uncomfortable. Not everyone is extrovert like your family.And I'm quite afraid to ask you what kind of pranks your family play.\n\nFor introvert/shy/reserved people, your holiday sounds like a journey to hell.", "Lesson here is to stop doing this.", "A happy thought, but you've discovered your manners a bit too late.", "Did you ever apologize for barging into his room and try to de-escalate the situation at all?", ">the appropriate response would have been civilly requesting privacy in the future.\n\nIn normal circumstances, yes.  When someone's been startled from sleep, possibly sleep-deprived, possibly triggering fight-or-flight reactions and the internal emotional regulators aren't online yet?  That's what you can get.", "Why do you expect civility from someone when they are rightfully angry with you? I never understand this. \"Ah yes you have a complete right to be angry with me but if you show that you are angry in any way you are behaving inappropriately!\" Like?? Honestly, it sounds to me what you're really looking for is a way to deflect from your poor behavior by saying that he has also behaved badly in reaction to your poor behavior.", "Nope. Just usually a good idea to start from a place of being a decent human being. Maybe he'd still be an asshole, who knows. You're the one who posted, however, so this is your feedback.", "No, I didn't miss that part, but I think he is so much more in the wrong that it actually created an entirely different situation that has nothing to do with some silly prank. We can have different judgements, that is okay. We just see things differently. \n\nMaybe it's for the best that this whole situation occurred because it allowed Craig to show his true colors. Hopefully, the family will keep a close eye on him and keep Ally safe.", "Introverts don't cuss you to high heaven for being woken up at noun (get it, the lights aren't everyone's favourite though). That being said, EXTROverts don't cuss you to high heaven for being woken up at noun either. *Douchebags* cuss at you for that reason. My responce about the introvert thing was because people were apperently using it as an excuse for his behaviour.\n\nETA; I know that introverts can explode though, look at Tom Hanks (no idea wether or not ontrovert, but just an example). While he is the coolest guy in existence as in , wouldn't hurt a fly, never gets angry etc., a few months ago he exploded towards fans for pushing away his wife to get his authograph. In Craig's case that doesn't seem the right move to me.", "Yelling at her?  I agree.", "ESH in that case.", "But he was nonetheless cussing at *Ally* and taking his anger out on her.", "Ew.", "The sticky widget is he didn't take it on the jackass cousin of his partner who invaded his privacy, he took it out on his partner. Not cool.", "Ally knew I was going, yes. We were all sitting at the table when my aunt told me to go turn on his lights.", ">For introvert/shy/reserved people, your holiday sounds like a journey to hell.\n\nYup.  And this time they didn't get the passive, conflict-avoidant type of introvert who would grin and bear it, to her considerable surprise.  I have no sympathy for OP.", "That’s the general consensus among the family now.", "My knocking on the door & saying “hey buddy these walls aren’t as thick as you think they are” was my attempt at de-escalating. I thought he’d calm down if he knew others could hear him yelling.", "If he was startled awake wouldn’t I have gotten that reaction instantly, and not her getting it 20 minutes later? If it was instinctive it would have been right when I walked in. And although I don’t know his life story, he’s a college frat boy & I think if he had any sleep issues Ally would’ve given us a heads up when we were waking everyone. Also, perhaps just don’t join us on family vacation if you have a sleep disorder that’s going to require you to sleep past noon and disturb everyone’s plans.", "It’s still doesn’t preclude the OP from being an AH for going in and waking up someone whom he barely knew.", "Oh I agree with you I just made a poorly worded joke", "Also for calling the OP a bunch of names. He could’ve easily expressed that he was annoyed that the OP barged into the room. And again, shouldn’t there be an element of politeness when you’re first getting to know someone?  Like giving them the benefit of the doubt?\n\nYou can still tell your friends later how it was nuts.  But in the moment, I would just say “wow that was kind of crazy” or something. I wouldn’t go into a full-blown tirade.", "Yup, ESH in that case.", "Startling someone awake, especially when you're a stranger, can trigger fight-or-flight responses, especially in those with PTSD.  People have gotten unintentionally hurt for such things.  It's never a good idea.", "Yeah, sounds like he went beyond just venting.  ESH.", "Her sitting at the table doesn't necessarily mean she heard you. Did you directly talk to her about this or did she respond to you saying you were going up?", "Probably a good idea.\n\nYou need to remember these are new people that you do not know.\n\nAs far as you know, he could have some form of PTSD where being woken by lights getting turned on suddenly and you loudly announcing it was time to wake up could be triggering for him (or even the act of a stranger entering his bedroom when he was sleeping).\n\nNot saying it's the case here but it's a solid reason not to in the future.", "You mean deliberately further escalating, right? Because that's what you did.", "That does not sound like an apology. I think saying “I’m sorry” would have been more effective and welcome. ESH.", "Oops, sorry, non-English speaker here, didn't get the joke because of it :-)", "Sometimes reddit is just plain delusional.", "She was sitting next to me and laughed when my aunt told me to go turn on the lights. We were talking about her boyfriend at that moment. To be honest, I think your whole point here is that we shouldn’t turn on the lights/wake people up anymore, and I’ve already agreed with you on that. My question is whether I’m the asshole for redirecting his cussing towards me when he was punishing Ally for my actions. To the effect that you disagree with us waking him up, I hear you, I agree, and it wont happen anymore.", "That’s a really great point actually! Until it bit us in the ass we just never even thought of that possibility.", "OK ESH, including Ally for letting you guys go mess with her boyfriend.", "Why didn't Ally go wake him up instead?", "ESH. Going into someone’s room to wake them is rude and annoying. But going into a full name-calling rage about it is concerning and scary. \n\nI also do think you were in the wrong for jumping into an argument that didn’t include you. You don’t need to insert yourself into everything.", "YTA. Your entire family are the assholes. I sure as hell wouldn’t stay anywhere where people felt free to come in whenever the hell they felt like it.", "Info: Was Craig actively cursing at Ally or where his negative comments solely about you(OP).", "YTA - You burst in on him because he was criticizing YOU, not your cousin, and you only heard what he was saying because you were eavesdropping. You keep adding things that you think make you not the ah, but your family's lack of boundaries with strangers is not okay.", "just reading about Craig 🚩🚩🚩🚩 hope Ally leaves him.", "NTA. I mean, you shouldn’t have just gone into his room but since you’re asking if you’re T A for defending your cousin, NTA. \n\nCraig sounds like a prick who grossly overreacted (and appears to have an anger management issue). My guess is he and Ally won’t last, and your family will change their system and The Craig Incident will be referenced for years as a reason why (hopefully with a chuckle, and will hopefully lead to other newbies being on their best behavior). Definitely tell people in the future the time they need to be up by if they want to partake in the day’s activities (it’s not OK that his sleeping in was holding everyone up. And yes, other people sleep in but sounds like he was the only one who was a jerk about being asked to wake up)", "NTA. \n\nListen, I don't want to go on vacation with your family either, but at the same time...I can also see my mom 100% doing this on a family vacation. She does it now when I stay over, coming in at 7am to \"ask a question\" or because the dog misses me- the dog does not. \n\nSo it is annoying, and Craig has every right to tell you to leave, or ask Ally to tell the family not to come in the room again, or to request that their room not have a shared key. What he doesn't get to do is blow up and curse at Ally and then call you names when you step in. \n\nI think a lot of us have at least one family member that barges in to rooms, and it seems your whole family is that family member. It is okay to set boundaries about it and be annoyed, but he escalated really quickly and to a very high level, especially because this was a first offense and not something he repeatedly asked you all not to do. \n\nI know you are going to get a lot of E S H votes because PRIVACY but honestly, as someone who now brings my partner to holidays and knows at some point my mom will 100% come in without knocking- and we will correct her when/if she does it- if my partner responded like Craig did, I would absolutely be breaking up with him. You don't curse at people like that over something like this.", "NTA\n\nMost replies here are much to dramatic. You woke somebody with maybe a bit to much enthusiasm and most commenters here act like you broke his legs.\n\nProbably because 75% of Reddit users feel that interacting with humans is a threat. I mean most of them don’t answer the phone when they don‘t know the number.\n\nDon’t let them drag you down, you sound like a fun bunch!", "NTA.  Red flags with that guys response.", "NTA for sticking up for your cousin. I think people are missing the point that that’s what you’re asking. Sure, dick move to turn on the lights and wake him up. BUT. That does NOT give him the right to scream and berate your cousin because of something YOU did. Which you seem to understand, and I feel like your self awareness in the situation makes you not the asshole. Also, if he’s willing to scream at her surrounded by her family, your mom and grandma are right to be worried about how he’s treating her in private.\n\nEdit: spelling", "[removed]", "[removed]", "NTA . It was totally okay to stick up for yourself and speak to the dickwad how you did.", "YTA, why is it OK for you to go into his room to fuck with him to begin with!?!\n\nYou don't even know him yet, let alone well enough to do that! Everything that followed was started by that intrusion.", "YTA- knock on the dam door. Rude af to just let yourself in.", "NTA, but your mum should be asking for a refund from Ally's family and Craig needs to be banned.", "ESH.\n\nYou shouldn’t have gone into the room. You know that.\n\nHe shouldn’t have abused your family’s hospitality by holding everyone up. He also shouldn’t have yelled at your cousin as yelling is never the way to resolve an issue within a relationship.\n\nI know you don’t believe it in any way but your cousin is also at fault. She invited him into this environment. She lacks the ability to speak up to your family (and perhaps her partner) and didn’t prepare her boyfriend or your family about potential differences in boundaries.\n\nYou are right that no one deserves verbal abuse. At the same time your cousin made choices that led to this happening. She isn’t a child. She is an adult that needs to learn how to navigate adult relationships.\n\nAbsolutely support her and help her understand what is and isn’t healthy behavior from a partner. But also give her the respect of letting her find her voice without you stepping in because you believe the quiet one can’t be expected to speak up for herself", "Nta.  It's a \"home alone\" family. The family's obviously close and cuz shoulda warned him about shenanigans.", "Clearly a NTA situation.", "NTA his behavior isnt acceptable in any circumstance, your behavior is more of a clash in whats normal so even tho it would bother me im still saying NTA.", " NTA.  Yelling at Ally and cussing her out because of someone else’s actions shows that Craig is an asshole and you were right to confront him for talking to her like that. I can understand being upset about being woken in the manner he was, but his reaction is very telling.", "NTA\n\nHave Ally and her parents apologised to you after they realised Craig was lying?", "Your family reminds me of my own so I may be a bit biased here, but fuck Craig. Who does he think he is disrespecting your family over something so trivial if it had been my family some choice words would have been getting off easy. NTA whoop his ass next time", "I'm surprised by all the Y-T-A \n\nINFO: did Craig know that everyone could open everyone's rooms? It sounds like you guys had set plans, is this true and if so did Craig know about them? I'm also confused about how he was yelling at Ally if Ally was sitting beside you at the breakfast table and you went to wake him up?\n\nThe way it's written + comments makes it sound like he slept in super late when you guys needed to leave ar some point. If this is the case then I think it's super rude of him to sleep in. It's a family holiday, not him and his mates. There are certain expectations when family is involved and things are organised.\n\n100% NTA for passing on Craig's reaction to the family. Weird that they Ally's family all knew you were waking Craig up before you did it and they're now mad at you that you did it?", "NTA, people are stuck on you waking him up when that’s not what you’re asking about. He was an AH for going off on Ally for something you did.", "To address the actual question and the outcome thereof... NTA. You possibly saved your cousin from an abusive relationship. Yes he can be annoyed but if someone takes you on holiday it's common courtesy to follow their schedule. Helped your cousin dodge a possible artillery shell", "NTA for intervening. His behavior was over the top and absolutely inappropriate. And honestly, bordering abusive especially if it’s normal for him to behave like this towards her.", "In response to the actual question and not the entire situation: \n\nNTA \n\nI’m not the type of person to let someone else get dressed down for something I did, so I probably would have said something too. This also seems like a major overreaction to someone flipping the lights on to wake them up at noon. ESPECIALLY if you’re a first time guest.\n\nA “hey, I wasn’t comfortable with you coming into my room and waking me up, please respect my privacy” would have been more appropriate. Or even him asking Ally to relay that message. \n\nHe seems a little weird but 🤷🏼‍♀️🤷🏼‍♀️", "I think you must have missed the edits that go on to change the story after OP got tired of being told she was an asshole.", "Ya,  if anyone should be going in to wake him up it should have been Ally", "I’d generally agree with your second statement but my mom/aunt think he wanted me to hear him. My boyfriend and I had been talking in our room & know he could hear us, so he knew we were there, and he started yelling/cursing anyway. He also blatantly said to me that he wanted me to hear him. So I think his yelling at her about me where he knew I could hear him was an invitation. If you want privacy in an argument, be private about it.", "Nicely put. \n\nI would add that you did the right thing in making him aware that you could clearly hear him yelling and being a dick to Ally. \n\nNTA.", "If someone doesn't get up, you just don't go and make him wake up just because you want. Respect his need to sleep.", "Wasn’t eavesdropping. Has been explained elsewhere", "What if he didn't sleep well and was tired? What if he had PTSD and op triggered it? What if he had a sleeping disorder? Since we don't know how well OP knows Craig, OP shuldn't have risked a reaction. \n\nImagine that Craig had insomnia and had just fallen asleep. Or that certain noises wake him up because he had PTSD, or he is just someone who hs boundaries and did not expect anyone to invade his privacy. We all are at our most vulnerable when we are asleep.", "Hahah oh gosh but what if the dog does miss you? No I’m totally joking. I get it. It was rude. And I would have apologized given the chance. But in the moment, hearing the yelling, I just reacted. I even would have apologized after knocking on the door & telling him I could hear him, if he had then chilled out & said something like “shit I was just venting it’s not that deep,” I’m an adult. I can take being called a name or two for doing something rude. But it could have gone over so much more civilly.", "There is nothing wrong with sleeping until noon. Guess what? I sleep most weekends until 11 am because I get up so early during the weekdays, and I sleep so bad, that I need those resting hours. We don't know why he was sleeping.", "Thank you for answering the question—I’m fielding a lot of comments saying I’m TA for turning on the lights & like YES I agree with y’all I AM SORRY, hindsight is 20/20 but that just isn’t my question", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yes Craig knew. My mom had said to everyone when handing out keys “everyone’s keys open all of the rooms, so don’t expect any privacy on this trip,” it’s what we always do. We always congregate in one room (usually my mom’s) so everyone needs to be able to get into it, and the cousins like to be able to pop in & out/send each other to grab things by grabbing any available key/etc. & it helps us prevent mixing up the keys since they all look the same. But yeah, he knew. \n\nIt was after noon when I went in to wake him up & we did have plans for the day. \n\nSorry for the confusion—Ally was sitting next to me at breakfast but when she finished, she went back to their room. I had returned to my room by then which was connected. That’s when Craig yelled at her.", "You're 25 years old, you should know better not to invade someone's personal space because you think it's funny.", "I've gotten whiplash from them changing the story after they didn't get the answer they wanted.", "Sorry, but what have I changed? I’ve clarified points for those who have asked & I’ve agreed to being an asshole for going into the room.", "It's a moot point now. People get focused on one point of the post and forget to read it in its entirety and then they make up wild stories in their head and then their aunts cousins grandma had a friend that this happened to. So they decide to post judgement on their situation and not on what your request was. You were not wrong to confront him for yelling at your cousin for something you did. You owned up to it and you were just trying to save your cousin from being berated by her hopefully soon to ex. You now know the reason they left wasnt because of what you said to the BF. So I would either just move on and stop answering these fools or delete the post. \n\nBest wishes!! Happy Holidays", "You caused a problem, he lashed out and you responded back. Both of you are TA. \nThe “it was a prank bro” attitude doesn’t help, is not that you shouldn’t have defended yourself but you reacted equally as bas as he.", "Yes, you are.", "It seems to me that, if you start shit unprovoked, with someone who didn’t expect or knowingly sign up for it, you kind of lose the right to police how they respond to it.", "I hate to break it to you, but your family is the odd one here. Your families lack of boundaries is fine for you, but you can't do that to new people. \n\nMost people would never imagine a normal family doing what you did, so of course they would not think to have to pre tell you not to push into their room and harass them while they are sleeping.", "Yes, YTA. The argument was between them about what boundaries she allowed her family to overstep. You instigated the situation initially and then further inserted yourself. Not surprising, considering your family's massive lack of respect for boundaries. Then your \"de-escalation\" was to tell him you could hear him, not apologizing for upsetting him in the first place. The complete lack of self-awareness you and your family has is something that really needs to be addressed. People deserve privacy and space even and especially on a large family vacation like that.", "I hope you stretched before that reach", "That's such a stretch.  I think those are signs that he's an inconsiderate AH.", "In many households both are considered rude. Injecting yourself into a conversation, even if you can hear it it, especially if being held behind a closed door is rude to many people. Thus, Craig overreacted to your rude behavior.", "People deserve privacy. Hotel room walls are thin and adjoining rooms carry the sound even more. People deserve privacy, and you have no sense of it whatsoever. He was ranting about you not yelling at her and you trippled down by in ading his privacy again (3rd time by your family in how many hours?) And tried to escalate b/c someone was (loudly) calling you on your boundry stomping issues. Craig doesn't have to follow your schedule and be up when you want him to be up. No one does. You have no idea if he has sleep issues or other health problems, and you shouldn't have to be told b/c AGAIN PRIVACY.\n\nOr, he may just be an introvert, and your family is exhausting, and he needs rest and limited time to deal w/ all of you invasive people.\n\nI get thst this is the way some families work and they enjoy ot, but this is a nightmare secenariofor me and I wouldn't last 24 hours w/ a large group of people I don't know w/ the boundy issues you all have.", "I like to think the dog does miss me!\n\nAnd listen, I grew up with this family so I actually don’t think you were rude, you were treating him like family! If Craig doesn’t like being disturbed, he just tells you politely or asks his girlfriend to tell you all to stop. Not that hard at all, and can be done without yelling.", "[removed]", "Not because it’s funny. Because it was noon and he was holding everyone up still being in bed", "That's the way so many of these stories go, people start to get an asshole judgement and then all of a sudden the person to whom they were an asshole is a Nazi who kills kittens in their spare time.", ">We also had plans he was holding up.\n\nI also just found out that Ally’s parents actually took him home out of respect because they were displeased with his behavior as well. Apparently Ally’s dad wanted us to sit down and speak civilly (which I would have been so happy to do) about what happened, but Craig refused because he said he was too upset. I also learned Craig lied about when I came in the room and said I slammed all their doors/drawers and that I said other things I hadn’t. My mother also learned he had broken a wine glass in the room the night prior, before any of this happened. No explanation given. Could’ve been an accident. We didn’t hear anything in our room", "How was he holding up plans when you said other people were also still sleeping?\nWhy could the plans not have occurred without him?\nWhy was it you who went and woke him up and not his actual gf?", "Upvote for bringing the word \"boor\" back into my life!", "This exactly. NTA.", "Personal observation, sadly.", "Could be, sure.  But it also fits with what I've described and observed IRL.", "That isn’t true of all introverts. I’m extremely introverted, in the sense that I prefer quiet interactions and most often keep to myself. But it’s not due to lack of confidence, it’s a genuine preference. I will absolutely yell at someone who’s disrespecting my boundaries. Social interaction wears me out because it’s overstimulating, not because I feel shy and anxious.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Don't act like you don't know the simple solution: tell who he was there with that we are leaving for the days' events and if he's not awake he misses it. You know that's the right answer but you're trying to find a way out of what you did", "I'm honestly starting to question her version of how the BF reacted at this point and wouldn't be shocked if she just heard him call her a bitch through the door and she saw red.\n\nLike whenever people change their story this much they clearly wanted a certain answer and their honesty in the original story comes into question.", "These are additions given for context in response to a comment, not changes. I talked with my mom & she gave me additional details which I relayed here & showed me texts between her and my uncle.", "I'm honestly thinking it was more than just OP turning on the light and making the statement. OP repeatedly stated about how it's tradition they mess with new people and they usually prank them back.\n\nAfter he got upset, I think OP is downplaying how abrasively they entered the room.", "You: I admit I invaded his privacy, but I don’t understand why he’s mad at me for violating his personal space, it’s all his fault for not being nice to me.", "He's not holding up plans. Is he hiding the keys? Does he have the tickets to whatever activity they are doing? No? Then they can leave him at the house while they continue on with their day.", "Yes, this excuse about him holding up their plans really bothered me. Like what plans could they possibly have that a person asleep in a room is obstructing? Were they planning on having lunch in that room and he was holding it up?", "Since she knew you were going to disrespect him, I can see why he was angry with her as well. He is an AH for raising his voice, and the name calling is too much, but you and Ally (by allowing you to do that) are a bit more ah.", "It's her cousin and OP was being a jerk.", "Oh no sorry I don’t mean to imply that I think turning on his lights & going in was the right thing to do! I was just clarifying that was the reason we went to everyone’s rooms at that point. There were a lot of alternatives we just didn’t pick a good one", "Honestly I overlooked that detail and you’re right. I still don’t understand why he screamed at his partner rather than OP (or having a civil discussion ab it) but if this was purposefully done to annoy him, yikes.", "Ehhh OP's room and Aly/Craig's room had a connecting interior door. That slightly changes things since OP would have had access even without this weird \"20 people share keys to every room\" dynamic.", "With me. He had a right to be angry with me. Not my cousin.", "Idk about y’all but most families who go on vacation have a plan or a schedule of the activities they are gonna do for that day. OP even clarifies in the comments that his aunt told them to wake them up.", "OP clarified that Ally gave them permission to go mess with him so she's not innocent in this situation either.\n\nThey all sound not great.", "I'm taking everything OP says with a grain of salt because they're definitely downplaying their actions (so it's possibly the bf wasn't yelling at Ally, just loudly venting about what happened) but....OP also clarified that it was her, Ally (the gf) and the aunt who decided she should go wake him up like this.\n\nSo the GF isn't innocent in this either. It sounds like she knew her cousin was going to go prank him.", "I can’t believe it’s taken this long to think that hey maybe we should show respect for other people. Is it such a novel concept to you all that others deserve consideration?", "If you did trigger a PTSD type of reaction, then 20 minutes later it would definitely still be going on and aren't always instant. Those reactions can last for hours afterwards.\n\nAlso just because he's in a frat doesn't mean he couldn't have PTSD or something similar. You keep making excuses for your family's behavior that most people here have explained to you isn't okay.", "You hear an argument that’s centered around your actions and you thought inserting yourself would de-escalate it?", "That's an escalation, not de-escalating.", "...that is absolutely the worst desclation I've ever seen. Are you a cop?", "An apology would have been deescalating. What you did is not that.", "Yeah that was a great way to remind him that you dont Care about His privicy.", "He had every right to be angry with your cousin. Your cousin approved of your actions. Your cousin invited him in the first place. If your cousin can’t or doesn’t want to be an advocate for him when it comes to your family then their relationship isn’t going to work.\n\nThat’s a conversation that should happen without berating each other but it’s a valid conversation and concern.", "Idk about you but I would never think it’s okay to go in vacation with my partners family and sleep through half the day and make them wait and mess up their plans because I am a grown man who doesn’t wake up until after noon.", "She also clarified that Craig had slept until *noon* and he was holding up their plans for the day. So, Ally was probably wanting him to get up so they could spend their vacation doing something other than sitting around waiting for him to roll out of bed.\n\nEveryone agrees (including OP herself) that OP shouldn't have let herself into his room and turned on his lights, but Craig seems to be pretty inconsiderate himself, making everyone waste their entire morning waiting for him to get up and get going. The better solution would have been to just leave him sleeping at the house while they all went out to do their plans for the day without him.", "Agreeing like you weren’t just blaming it all on OP two seconds ago. Stfu", "Please stop mischaracterizing my replies in your comments. Not ONCE have I said Ally had anything to do with me waking him; only that she didn’t object nor did she actually have an opportunity to. You’re weaponizing my replies and twisting my words to draw your own conclusions & inadvertently victim blaming Ally for being in what may be a verbally abusive relationship. If your issue is with me for being an asshole, great. I was a dick and I reached Ally separately to apologize for any way my behavior negatively affected her. As the family has talked about the situation more details have come out & I’ve shared them here. But not a single one has incriminated Ally & im super over seeing her villainized in a situation she was an observer to.", "Hahahahahah oh my god I hate how funny this is because I know you’re insulting me but I laughed out loud. No, not a cop, hate cops. Wasn’t a solid thought process in the first place.", "Hearing him berate my cousin for my actions, I didn’t feel sorry for anyone but her.", "I’m not sure how fair it is to say my cousin agreed with my actions. She’s not confrontational so I think it’s more likely that she wasn’t comfortable asking me not to go do it and I should have expressly asked if Craig would be comfortable with our family antics", "You didn't redirect the cussing to him. You went in to pick a fight, and only made him angrier, resulting in the cousin going home, likely to a bigger tirade", "IDK about you but I would never imagine pranking and harassing new people as part of a weird family tradition where I admit that alot were probably uncomfortable and had to grit their teeth and just deal with it.\n\nThey're all assholes.", "Depends on jetlag/how long you were driving/how late you arrived.", ">So, Ally was probably wanting him to get up so they could spend their vacation doing something other than sitting around waiting for him to roll out of bed.\n\nThen Ally could have gone up and nicely woken him up.\n\nNo one is saying it would be wrong to wake him up, how they woke him up is the issue.\n\nOP has also stated that her cousin likely didn't want her to do this but was afraid to tell her no which is pretty telling of what OP and the rest of the family is like.\n\nSo either Ally is an asshole for going along with the joke or she wasn't able to stand up to her family when they told her they were going to go mess with her boyfriend.", "OP elaborated in a comment to me; ergo the change in opinion.", ">Not ONCE have I said Ally had anything to do with me waking him; only that she didn’t object nor did she actually have an opportunity to.\n\nReally? Because I asked you: \"[Did you directly talk to her about this or did she respond to you saying you were going up?](https://www.reddit.com/r/AmItheAsshole/comments/zp6hnk/comment/j0r5kl2/?utm_source=share&utm_medium=web2x&context=3)\"\n\nAnd you replied:\n\n>[She was sitting next to me and laughed when my aunt told me to go turn on the lights. We were talking about her boyfriend at that moment.](https://www.reddit.com/r/AmItheAsshole/comments/zp6hnk/comment/j0r6swg/?utm_source=share&utm_medium=web2x&context=3)\n\nYou then tried to backtrack about Ally laughing when this was being planned and attempted to say she was to shy to tell you not to. It's part of your changing story.", "No experience with PTSD, I see.", "Another issue is you being an asshole has made it more difficult to clarify if the cousins bf is an asshole, and gave him something to hide behind.\n\nYou may have thought stomping in and restarting an argument was 'protecting' your cousin, but you've either caused her more grief, or annoyed a man who didn't deserve it\n\nIf you had concerns the better plot was to knock, them apologise when the door was answered, or speak to you cousin in a private moment. You just acted on impulse and could be making things worse\n\nYTA", "Except your cousin instigated your actions?", ">She’s not confrontational so I think it’s more likely that she wasn’t comfortable asking me not to go do it\n\nThis says a lot about you and your family.\n\nLike you claim you were defending your cousin but you admit here she's basically afraid of asking a very simple, normal requests from you because it'll turn into a confrontation.\n\nI don't care how shy and introverted your cousin is, it's not normal for her to uncomfortable saying she'll go wake him up instead. That's a reaction to how you have all likely treated her in the past.", "Yes I agree with this. If he works Night Shift usually or was jet lagged then I would understand sleep schedule not lining up the first few days. OP didn’t say that though", "Again, everyone agrees that OP shouldn't have woken him up the way she did. Nobody is disputing that and that's not the actual issue. \n\nCraig's reaction is the issue. He was so out of line that the situation actually became something else entirely. Does that make sense? It's no longer about some dumb prank anymore, but rather it's about how comfortable he was screaming and cussing at his girlfriend and his girlfriend's cousin in a house full of people he had just met. That's very concerning, and my guess is this kind of behavior is not out of character for him. That's not something most people would so casually do (even if they were extremely annoyed), unless it's something they're *used* to doing. That's just my guess.", "I didn’t backtrack about her laughing. That still isn’t a reply from her. & I stand by my assumption that she would have avoided confrontation by telling me not to go wake him. It’s perfectly reasonable to think that a shy person might laugh along with something they don’t agree with. Especially if they’re nervous. There’ve been plenty of times I’m in a group & don’t necessarily agree with what’s being said but I just laugh along rather than challenging them. Perhaps she didn’t think I’d get up and do it. Perhaps she didn’t think he’d react negatively or didn’t think it was a big deal. Perhaps she didn’t find the nerve to speak up. I don’t know, and all of those things will be considerations for the future, but you’re not going to condemn her for failing to speak up and laughing along to a situation I created.", "Not everybody can be a Reddit armchair specialist in everything.", "Fair", "She didn’t instigate anything", "I’m not sure I agree. She’s been extremely shy and passive since literal birth. It was a fluid situation and I think it was on me to stop & ask her if it was okay, not on her, who I know is not confrontational, to stop me. If I’d taken a moment to consider I would have asked if it was okay. Again, that’s on me. I think the people blaming her are really unfair."]}