{"id": 5057, "submission_id": "zoyepz", "title": "AITA for taking my guitars back", "selftext": "Pardon the formatting, I'm on mobile\n\nSo when I (22f) was 16, my mom died from cancer. When I was close to 18 my dad remarried, and moved in all my step sisters before I actually ever met any of them (I stayed at friends a lot, my parents were together ish as in legally but my dad basically lived separate, either with his parents or on \"business trips\" which I've learned was code for with another woman and he was there maybe 2 days a week max) \n\nSo around the time they all moved in, I had around 20k in savings. Insane for an 18 ish year old I know but it was my mom's social security and also what she left me. Within 2 months, I was in the negative from things my dad said he'd \"pay me back for\" then never did. If I still had the texts I'd take it to court if I could, but one of his new daughters broke that phone. \n\nSo basically, today I went over in the middle of the night to my dad's (I moved out right after 18) and grabbed 2 of my 3 guitars. My dad bought me the third, and visibly gave it to one of my step sisters before I moved out so I didn't dare touch the 3rd since it was in her room. \n\nEver since then my phone is blowing up asking how dare I touch those guitars, because at this point she assumed they were hers. I was kicked out when I turned 18 and took maybe 2 backpacks of stuff with me... I bought those guitars myself, and said there was still a LOT (literally sent my dad a list) I'd like to grab from his house, but apparently those are hers now...  And they're the 2 things from the whole list I can find. \n\nAITA for grabbing things I haven't used in years but bought myself before my dad kicked me out? I understand she got used to having them, but her and her sister were behind me getting kicked out with the lies they told my dad back then. We're ok with each other now but not close by any means, and I don't wanna start drama but I want my stuff back.", "created_utc": 1671369383, "permalink": "/r/AmItheAsshole/comments/zoyepz/aita_for_taking_my_guitars_back/", "score": 90, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I took my guitars back home when my step sister got used to having them there\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - you should be able to get bank statements for that time and possibly show your dad how much he owes you. You may need to talk to a lawyer about what rights you have - verbal agreement is still an agreement, it's just harder to prove. Re the texts - depending in the phone /service they may be saved in the cloud - do a little digging.", "NTA. Take those guitars and yourself and get far away from that toxic family", "NTA- it's rightfully your stuff, you bought it/gifted to you, it's inherently yours", "NTA. You still should sue your father for his theft.", "NTA, but be careful how you handle this as they could file criminal charges since you broke in.", "Get all those guitars back", "NTA because your other option would have been to sue, at which point you'd also have gone after the money he basically tricked you out of.", "NTA but your dad is.  He \"stole\" your money when he broke his verbal contract with you to pay you back.  Make an appointment with an attorney and find out your options.  When you have your meeting with your dad, tell him your options to get your money back.", "Ok.  So you and dad are arguing over ownership of stuff.  He's already stolen $10k of your money.\n\nSo, all communication *must* be by text.  This creates a record that you can use in court if you have to.\n\nBut this is a double edged sword.  When your dad texts you, take some time before you respond.  In fact, write out your answer on a piece if paper first.  Don't let your emotions say things you might be sorry for later.\n\nIf dad calls, let it go to voicemail, then listen later.  If you're upset when talking, you might say things you'll regret.\n\nIf you can, mention the $10k via text, see if he'll admit to it.  If he does, there's a chance you'll get it back.\n\nI'm sorry your dad is being a dick about this.  He should be on your side and advocating for you, but instead he's hurting you.  It's OK to leave and go no contact with someone who actively hurts you.  And you can block the people who call you out for doing it.\n\nIt is not your job to make your biofather feel better.", "NTA\n\nIt's ok to want your stuff back but it has to be approached delicately. Especially since you left it for so long. Where I live it is considered abandoned property if its been longer that 6 months, so the home owner has rights to it.\n\nYou have to ask yourself if it is worth the drama. Maybe talk to your step sister and Dad and make an agreement that if she stops using it she will give you the chance to reclaim your stuff before getting rid of anything?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nPardon the formatting, I'm on mobile\n\nSo when I (22f) was 16, my mom died from cancer. When I was close to 18 my dad remarried, and moved in all my step sisters before I actually ever met any of them (I stayed at friends a lot, my parents were together ish as in legally but my dad basically lived separate, either with his parents or on \"business trips\" which I've learned was code for with another woman and he was there maybe 2 days a week max) \n\nSo around the time they all moved in, I had around 20k in savings. Insane for an 18 ish year old I know but it was my mom's social security and also what she left me. Within 2 months, I was in the negative from things my dad said he'd \"pay me back for\" then never did. If I still had the texts I'd take it to court if I could, but one of his new daughters broke that phone. \n\nSo basically, today I went over in the middle of the night to my dad's (I moved out right after 18) and grabbed 2 of my 3 guitars. My dad bought me the third, and visibly gave it to one of my step sisters before I moved out so I didn't dare touch the 3rd since it was in her room. \n\nEver since then my phone is blowing up asking how dare I touch those guitars, because at this point she assumed they were hers. I was kicked out when I turned 18 and took maybe 2 backpacks of stuff with me... I bought those guitars myself, and said there was still a LOT (literally sent my dad a list) I'd like to grab from his house, but apparently those are hers now...  And they're the 2 things from the whole list I can find. \n\nAITA for grabbing things I haven't used in years but bought myself before my dad kicked me out? I understand she got used to having them, but her and her sister were behind me getting kicked out with the lies they told my dad back then. We're ok with each other now but not close by any means, and I don't wanna start drama but I want my stuff back.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Sue that deadbeat!!!\nNTA", "I didn't break in, I have a key still. My dad gave me one for coming to get my things since all my mom's things are there too and they want that all out asap", "I've been talking with him about all of it since this all went down and I think he's gonna come over to talk about it soon, I've agreed to let her keep the 3rd that he bought and the accessories for everything as long as I can walk away with the 2 I bought. \nMy only question though, if I did provide a list of specific items I wanted moved to storage (he has a shed of mine/my mom's things) would that change the situation on the abandoned property thing?\n\nAlso as a quick edit: both guitars I took have had at least 3 strings broken for the past year and have just been collecting dust, not sure why now she supposedly cares about them", "Then you’re cool 😎", "Yes, if you had a plan for your items that you shared with him I belive that may change the time frame for abandoned property. \n\nI hope things work out for you", "Thank you! I really appreciate the help here"]}