{"id": 5072, "submission_id": "zp8xlc", "title": "AITA for asking a lady to take her service dog off the table.", "selftext": "Wife (F31) and I (M33) went out to eat at a local joint.  I like the food and beer at this place and its also somewhere that is not dog friendly.  I especially enjoy that the patio doesn't allow dogs.  I enjoy a good patio when the weather is nice and I can enjoy a few drinks.  More than once i've had dogs ruin a good time, so I seek out places that don't allow them anymore.  \n\nTodays trip to the restaurant was not what I had hoped.  We take a seat on the patio and I see that their is a dog a few tables over. It is medium sized and very furry.  I order my drink and also ask the server what is up with the dog.  He just says it is a service dog and there isn't much we can do so they let it in.  I get my drink and keep an eye on it.  Wife says to let it go and ignore it, I don't.  It barks once.  Then the owner (i'd guess a lady in her 20's) picks it up.  She puts it on the seat next to her.  Pretty sure its a health code violation to allow a dog on a restaurant seat.  Then the dog puts its paws on the table. Owner does not notice this.  \n\nI speak up, she is a few tables over so I i'm like \"Hey, get your dog off the table and off the seat\". She snaps back mind your business.  The dog starts barking at me.  I let her know without cussing that its gross to allow her dog on the table and seat, I also said service dogs don't bark at strangers.  We went back and forth arguing.  I tried to keep my cool and she got angry at me.  Finally I just left some cash with a decent tip and wife and I left.  So AITA?", "created_utc": 1671398936, "permalink": "/r/AmItheAsshole/comments/zp8xlc/aita_for_asking_a_lady_to_take_her_service_dog/", "score": 193, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for telling a lady to get her dog off the restaurant table.  This might make me the asshole because I engaged in a spirited discussion about her dog when I could have just let it go.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I assume US? Federal law states that dogs are indeed not allowed in shopping carts or on tables or whatever. Dogs must be well behaved, and they must perform a service for the disabled person (other than being cute/cuddling). So you can kick out a dog that is poorly behaved, even if it's really a service dog.\n\nHowever, you should have let the employees handle it. It's not for you to shout at her. ESH.", "I’m going NTA. Probably you could have handled it better, but I’ve seen what fake service dogs can do. At a previous job, they let in a “service dog,” and when the owner dropped the leash it knocked over a 80+ year old holocaust survivor (we were a Jewish nonprofit art gallery, and her work was being displayed). \n\nBetween the hospital and rehab, she was out for three months with thousands of dollars in hospital fees that she was somehow too nice to sue for. I know a dog at a table in a restaurant isn’t the same as my experience, but fake service dog owners deserve to be called out. Maybe if you embarrassed them enough at the restaurant they won’t put that dog in a position where it can hurt someone. Probably not, but I’m hoping. I myself have a well trained, non-service dog, and I would never put him in that position.", "I have no problem with your argument, but your execution was terrible. So ESH.", "NTA.  That’s not a real service dog.  So many people make these false claims now and nobody calls them on it.  That’s just someone bringing their pet into a restaurant.", "Okay, on the one hand, a properly trained service dog wouldn’t do any of those things, so that was clearly not a legit service dog. \n\nHowever, you sound pretty uptight and entitled. You would be well advised to remember that you can’t control what other people do, only how you react to it. For your inability to just enjoy yourself and not let other people ruin your day, and because you absolutely HAD to say something when not saying something was definitely an option, YTA.", "NTA - lady didn't have a service dog, she had a dog she claimed was one because she wants to take it everywhere. While you didn't need to start an argument over it, fake service dogs and their owners make it harder for people who actually need them", "YTA\n\nI want to take a moment… you say your wife asked you to let it go, and you didn’t. You then caused a BIG scene over something that was quite literally not affecting you. \n\nYour wife asking BEFORE you escalated everything tells me that you might do this kind of crap often. Beyond being rude to another customer, you humiliated your wife by public ally throwing a little tantrum and disrupting other people’s meals (say what you want, but a man yelling at someone across the room is a lot more annoying and disruptive than a service dog in a seat). \n\nYour emotional outbursts affect more than just you. Grow up and seek therapy for your anger issues before you continue to embarrass your wife.", "NTA fake service dogs and their owners suck. Glad you embarrassed them", "NTA as someone who’s had a service and also agrees with your views. That dog did not belong at on the table yes it was none of your business but some people are allergic to dogs and could sit at that table later. Also service dogs don’t bark and wouldn’t be so distracted like this they would sit on the floor next to the person they serve and watch their behavior not bark or act so distractedly.", "NTA - Fake service dogs and their entitled owners have ruined the whole concept of service animals.  This was not a service animal and the OP is NTA and those saying YTA just want to take their sweetums with them everywhere.", "NTA \n\nI hate these fake service dogs.", "NTA there is no way it was a service dog. They don't behave like that when properly trained. They sit next to the owner and are calm and silent if the owner is doing well. Did it have a vest on stating that it was a medical trained dog? The only time the dog is playful and allow itself to be distracted is when the vest is off and even then they would never just jump to sit at the table.", "YTA. You caused the whole scene, and you did it after your wife asked you not to.\n\nThat your wife asked you to let it go says a whole lot.", "YTA. While most definitely not a trained service dog, you really didn’t need to insert yourself. If you weren’t happy with the seating arrangements, you could have asked to be moved. Instead, you started an argument that your wife was already on edge about your behavior.", "YTA to your wife. I bet that was embarrassing. \n\nThe funny thing is, had you brought it back up with your server while the dog was on the table, then the restaurant actually COULD have done something about it.", "NTA. You are allowed to ask what service the dog provides. But a service animal should not bark if it's not alerting for the service it provides and no need for it to be on the table or chairs. I no longer go to a formerly favorite spot because the waitress picked up a customers dog and put it on a bar chair, while she had our silverware and napkins in her hand. The rules need to be changed so \"service dogs\" have to carry papers.", "Gonna say ESH. You’re acting like an entitled spoiled toddler, but having a dog on the table like that is against the law (in the US, at least), and it clearly wasn’t a legitamately trained service dog if it was barking in public. But really. She wasn’t affecting you and you’re a brat, let the staff handle it, it isn’t your place.", "YTA. You involved yourself in a situation that didn't involve you, and you were coming from a place of hate. Not acceptable behavior. If you saw an actual problem, bring it to the manager's attention; otherwise MYOB.", "YTA - why did you feel the need to get involved? If it was an issue the restaurant would have spoken up.", "YTA\n\nYou were literally looking for a reason to pick a fight… with a dog no less.\n\nYou are such an AH here. Maybe double check how much you drink? Or at least start dealing with the stuff you really care about before picking fights with a dog?", "[deleted]", "[deleted]", "YTA. It wasn't even close to you and was only bothering you because you couldn't mind your own fucking business. You were just determined to make a fuss over any slight \"misbehavior\" by the dog.", "Dude it was across the room and affected you in no reasonable way. You decided to let it get under your skin, and chose to embarrass your wife publicly. Instead of realizing it’s not your responsibility to say shit, you decided to make it about you and you alone. I can’t tell if you’re 33 or just 3. YTA.", "YTA. \n\nLiterally you were mad the dog was barking, mad the lady moved it to probably stop it barking, what did you want? For disabled people to never leave their homes to eat a meal? \n\nGo to therapy.", "YTA. The woman was a few tables over and wasn’t affecting you at all. You failed to mind your own business and caused an embarrassing scene.", "YTA - you “kept an eye on it”? Are you the dog police or something? She was definitely in the wrong for having her dog sitting at a table, but you didn’t need to get into a fight with the owner at all.", "YTA - The dog barked once and wasn’t at your table so I’m having a hard time understanding why you felt the need to insert yourself into the situation.", "YTA\n\n&#x200B;\n\nThe reasonable approach would be to call your waiter, cancel your order and leave. No tip needed, because THEY chose not to do something about the situation.\n\n&#x200B;\n\nNot to harass other guests, even if they missbehave.", "YTA. Unless the dog was bothering *you* then mind your business.\n\nYour wife told you beforehand to let it go, so clearly you're no stranger to being an ass in public.", "Yta\n\nThis was none of your business. \n\nIt wasn't your table.  It wasn't even the table next to you. And you saw this dog here before you got there. You need to more your own business and keep your mouth shut.", "OP, I’m not a fan of dogs. I’m severely allergic and have become fairly resentful of (many, not all) dog owners throughout my life for always feeling like they can bring their dog everywhere, and so many dismissing dog allergies like they don’t exist.\n\nI think YTA here though. Unless the dog was actually getting close to you or barking nonstop, you needed to just let this go.", "YTA  You don't like dogs anywhere near where you choose to eat, particularly on patios or so it seems.  Anyway....tough cookies.  Service dogs ARE allowed, by law, to be in most public areas, as some people rely on them greatly.  Now, what you describe might have been more of what has become popularly known as \"emotional support\" animals, which are not the same as service dogs.  Service animals ARE well and highly trained, and don't deserve your insults or wrath.  This lady, with the dog, behaved badly.  You are right....it is gross to have an animal up on a surface where people eat from.  However, you should have taken that up with the manager or asked to be moved to another location.  Just as bad as a badly behaved pet owner is in a restaurant or public area?  A badly behaved person who wrecks everyone else's experience by confronting and arguing with another patron with something that wasn't your business to handle like that!  You can't blame the dog, which is what your post was initially about, because dogs be dogs.  The owner's manners were problematic.  But your bad manners topped hers!", "YTA. Service dog or not you escalated an issue that needed no escalation. You spoke to your server. The dog barked once and you getting all aggressive (because yelling across a space is aggressive) made the dog bark more. Then after your little scene you embarrassed your wife even further by storming off like a toddler.", "The dog was not on your table. So this was none of your business. YTA.", "Yta. She's right, you could mind your business. You'll never be happy if you don't learn to live and let live.\nEdit: changing to esh", "YTA because you were extremely rude to your wife and ruined her time out with your childish behavior. I guess this isn't unusual, because she told you ahead of time to let it go, which you were not capable of doing.  I guess you either need therapy about your dog aversion or you need to accept that you are going to become a child when you see a dog and not sit down at a restaurant when you see one.", "YTA. Your poor wife was mortified. This was not at YOUR table. You sound like a busy body.", "YTA for not just listening to your wife ffs. If you had such a problem, get the owner. You were just looking for a reason to cause a fight.", "ESH.", "YTA. Not your table, not your business. It sounds like you don’t like dogs and were looking for a reason to make a fuss.", "YTA. This dog was at a separate table. \nNot at your table. \nNot even at the table next to your table.\nNot behind the bar mixing drinks. \nNot in the bathroom peeing on your leg.\nNot in the kitchen plating your food. \nThis didn’t affect you. \n\nBased on your wife’s comments before you even caused your scene, I’m sure you’ve embarrassed her like this many times before. Have some self control and some respect for your wife.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWife (F31) and I (M33) went out to eat at a local joint.  I like the food and beer at this place and its also somewhere that is not dog friendly.  I especially enjoy that the patio doesn't allow dogs.  I enjoy a good patio when the weather is nice and I can enjoy a few drinks.  More than once i've had dogs ruin a good time, so I seek out places that don't allow them anymore.  \n\nTodays trip to the restaurant was not what I had hoped.  We take a seat on the patio and I see that their is a dog a few tables over. It is medium sized and very furry.  I order my drink and also ask the server what is up with the dog.  He just says it is a service dog and there isn't much we can do so they let it in.  I get my drink and keep an eye on it.  Wife says to let it go and ignore it, I don't.  It barks once.  Then the owner (i'd guess a lady in her 20's) picks it up.  She puts it on the seat next to her.  Pretty sure its a health code violation to allow a dog on a restaurant seat.  Then the dog puts its paws on the table. Owner does not notice this.  \n\nI speak up, she is a few tables over so I i'm like \"Hey, get your dog off the table and off the seat\". She snaps back mind your business.  The dog starts barking at me.  I let her know without cussing that its gross to allow her dog on the table and seat, I also said service dogs don't bark at strangers.  We went back and forth arguing.  I tried to keep my cool and she got angry at me.  Finally I just left some cash with a decent tip and wife and I left.  So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA", "Service dogs are impeccably trained. Based on this behavior it is likely not a service dog but a pet. In the US, we need standards and identification for service  dogs to keep people from bringing untrained dogs into places they would ordinarily not be allowed.", "That was not a service animal. A support animal maybe. But not a service animal.", "ESH.\n\nThe way you handled it was poor. Quietly inform the staff and let them handle the irresponsible owner. You crossed a line with your behavior and escalated a situation unnecessarily.\n\nThat dog owner really sucks because that’s no service dog. People like that piss me off (I’m disabled and qualify for a service dog but haven’t taken that step yet.)\n\nWork on handling things with more maturity and calm going forward.", "Actually from the description, the dog was well behaved. It was the owner who got it onto the chair and the table.", "Some people need to be, and deserve to be, reprimanded when they’re doing something dumb like this. Nobody wants some rando’s dog all over where they’re about to be eating", "Yea this is where I’m at. Lots of little things annoy me, and I leave them be because *they literally don’t affect me* and I can’t see why OP would think it’s appropriate to call someone out for not following the rules in this case. Small-minded person just wants to feel important is my guess.", "A dog on a restaurant table is gross 🤢", "The vests are meaningless anymore - you can order them online.  And no, that dog was not a service dog.", "> You are allowed to ask what service the dog provides\n\nOP is allowed to ask whatever they want. Only staff are limited in what they may ask. Though it would still be incredibly rude for a random person to interrogate a person with a service animal like you suggest.", "Nah, they got employees so scared they don't do crap about actual issues. Which this is. Yes, OP should have gone to a manager, but odds are they would have done nothing except possibly move OP so he would not see. Lady should not get away with letting her nasty dog (that is not a service animal) on to a table", "Is a sash required in your country? I know the US does not require it. They simply require good behavior and that the dog is trained to perform a service related to your disability.", "For real. He’s picking a fight with a dog… literally watching and waiting for it to do something wrong.", "Service dogs are legally not permitted to misbehave on public. This is not a service dog. If it was a service dog, she can and should have been kicked out for violating the rules that permit service dogs in public spaces. They should never ever bark on public unless they are alerting to a medical emergency. And they are not permitted to sit at the table and out their feet on the table.", "Nope! Wrong. That's not an actual service dog. \n1. Service dogs are not supposed to EVER bark while working or in public unless alerting to a medical emergency. \n2. Service dogs would NEVER be allowed or permitted to sit at the table and put their feet on table. \n\nSource: Veterinary Technician and Professionak dog trainer thay trains service dogs. \n\nOP is NTA, and the lady with the dog is a giant asshole because she is breaking the laws with her fake ass service dogs and assholes like her ruin it for real service dogs.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "if a dog is barking in a restaurant, it is 1. not a trained service dog and 2. not well behaved.", "It's the same result, really. Whether you let the dog jump onto the table or put it there, it's getting its fur and germs all over the table.", "Who are you (or OP) to make that decision though? Also, OP wasn’t about to eat there. They had their own table.", "I want to point out that these situations hurt disabled people. This dog is clearly not a trained service animal. But what if another disabled person came WITH their service animal and this untrained animal acts up and disturbs the other dog into not tasking.  It can put the disabled person at risk for someone else’s desire to keep their dog close.", "[deleted]", "And? Doesn't change my response in the slightest.", ">Service dogs are legally not permitted to misbehave on public\n\nYes they are. They can however be asked to leave if they cannot be put under control.", "Of course it isn't a service dog lmao but very helpful info as background", "Boom.", "As long as the dog is helping with a disability or medical issue of some kind it technically still counts as a service dog even though it is not trained properly and has a bad handler.", "[deleted]", "The restaurant is at fault for not kicking the dog out.  Legally they can, and they should have. But, OP should have simply complained to the manager, and the waiter should have called the manager, and the AH handler shouldn’t have done it, and should have washed the dog, if it can’t handle someone shouting at the next table. That dog was under too much stress to be doing public access, it’s mean to the *dog*!", "Uh, I’m a person being bothered by what they’re doing. Do you need more than that? And what about the people that have to sit at her table after her? They probably wouldn’t want pet dander in their food either", "I’d agree, except that the person telling the story is clearly incredibly biased, so I wouldn’t judge OP as being a reliable narrator. Without an unbiased account, we have to assume that the dog is a legitimate service dog.", "Anyone can fake a sash.", "Yea shows you’re the ah", "If it behaves poorly or has a bad handler, then their access to public spaces can be revoked they can be asked tomlwave. \nIn order to be a service animal, the animal has to be trained to perform specific tasks related to a medical condition.", "A trained service dog won’t start barking just because someone at a nearby table is yelling.  A dog that cannot handle that isn’t ready to for public access.  One, isolated bark, yes,  that is acceptable, per ADA. But sustained barking is not, (unless an emergency with handler, of course), or if someone is actively interfering *with the dog*.  Neither is the case, here.  But, indeed, OP handled it really badly, as did the restaurant. So, ESH.", "Even one bark still doesn’t count as well behaved. Service dogs are trained not to react to stimuli that most dogs would react to.\n\nEdit: I realize now that the dog might’ve been alerting, but I still think it’s unhygienic to actually have the it on the table", "After a three year pandemic, I would certainly hope that the restaurant would be thoroughly cleaning tables after each guest, so I don’t think dander is the issue. \n\nI suspect the issue is that you are a confrontational crankypants like OP and based on that, you and I are unlikely to see eye to eye on this issue.", "You can buy a fake service dog letter, too. It's all a scam, preying on people who don't know the real laws.", "Do you walk around making sure strangers around you are following every little law?\n\nAnd it wasn't even illegal for the dog to be on the patio even if it wasn't a service dog. It was the *restaurant's* policy that dogs are not allowed on the patio.  OP should have taken it up with the restaurant staff if he had an issue.  His whole post reads as him itching to start a fight.", "They are still dogs not robots, they can do a single bark on occasion. Not to mention some of them can be trained to bark to alert their owner as a part of the service they are providing.", "And I suspect that you’re someone that thinks they should be able to do whatever they want, whenever they want, everybody else be damned, and how dare they express their discomfort when you do it. So yeah we probably won’t see eye to eye", "No and no one said it was a law but this just shows you’re very ignorant. But let me help you understand. What if a person allergic to dogs goes and dines there and is seated at that very table? Then what?", "I’m aware that some service dogs may use barks as alerts, but that doesn’t seem to be what happened in the post, which is what I was referring to", "Not at all. I am actually pathologically considerate of other peoples’ needs and preferences, to my own detriment at times. I just don’t condone confronting other people needlessly when I don’t have all the facts. But thank you for your comment. It says a lot more about you than it does about me.", "Uh, yeah.  There are a number of posts claiming this isn't a legal service dog including the response to my initial post.  \n\nIf they can't be on a patio with a dog due to allergies, then they eat in the dining room where dogs are not allowed. Again, dogs are allowed, by code, on restaurant patios. It is part of the premise of the story that they like this restaurant because it disallows dogs on the patio.", "Not needlessly.  This is an animal on a table and seat that another human will use to consume food and drink.  Use without the knowledge that the last patron licks their butt.  Oh you are soooooooooooo considerate aren't you?", "ITS A FUCKING NO PETS ALLOWED RESTAURANT. That dog was only allowed because it was claimed to be a service dog. A person allergic to dogs will go there thinking they are safe. And I meant AFTER the person and their dog leave. Like I said at THAT EXACT table.", "Said allergic patrons would magically not be allergic if it was a service dog?  Sorry, but the law protects people with service dogs over people with allergies and it's not like the restaurant has a lawyer on staff advising which \"service dogs\" to allow or refuse.\n\nOP doesn't like dogs. He was just being a dick, not trying to protect people with allergies.", "NTA.  As someone with a TRAINED service dog, what you saw was not a service dog.  The restaurant is having a MAJOR health code violation with that dog being on the chairs and table.  It’s fucking disgusting.", "NTA Animals in restaurants/around food service is gross, but a service dog is fine on the floor. On the table is beyond even for a service dog. So gross!", "NTA", "NTA. These fake “service” animals cause many issues for the legitimate ones who are necessary for the owners. I wish there was an actual registration required to help this not be such an issue.", "NTA. Real service dogs don’t sit in seats or on tables because it’s illegal- those are reserved for patrons only. SDs are allowed to accompany their handlers so long as they observe the law.", "ESH, that isn't a properly trained service dog but you sound absolutely pompous and entitled.", "NTA\n\nI love dogs and have been blessed to have them as family most of my life. Service animals are extremely important to their owner, and need to be allowed to do the job they are trained to do. \n\nBut, everyone also has the right to enjoy their chosen activity. The establishment has the responsibility to establish and enforce a policy with the best compromise for all patrons. Doesn't seem like this establishment did this well at all. This establishment was the ahe. The cat just wanted to enjoy one of his favorite eating establishments. \n\nAnd I just gotta say. Dogs butt on seat, next butt on seat is toddler who touches everything and hand continually in their mouth. Eww", "YTA, probably wasn't a legit service dog (which I hate that people do) but you purposefully went out of your way to cause a scene for no reason whatsoever.", "NTA. Sounds like you have a fear of dogs. Some people won’t like to hear this but some people need to be reminded harshly that their “emotional support animal” isn’t a service dog.", "100% YTA!!!", "YTA\n\nmind your own business", "You are 10000000% the a-hole", "NTA\n\nFor some reason employees in every job imaginable are ignorant of service dog laws (in the US) and afraid to confront an obvious fake because for some reason they're afraid if they ask the person to put they're dog back on the floor they'll get in trouble.  You're right in that dogs are not allowed in carts, on chairs, on tables. It sounds as if that was a fake and no you weren't out of line with what you said. You have the right to point out bad behavior from a supposed service dog because obviously the employees are going to just act as if it isn't happening. Here's the kicker, a real service dog handler would not allow that behavior from their service dog.", "NTA. Service dogs do actual work. A service dog would not act like this. People always try to get away with things and assume they won’t get called out. Heck no lol. You’re NTA.", "YTA because it sounds like the core issue here is that you were choosing to go after a confrontation to be a night for people who did not ask for your aid, at the expense of your wife's comfort.\n\nYour wife was out on a date with you, and rather than be present in the date with her, you were thinking about laws and what the owner of the restaurant would want and getting into a shouting match with some asshole at a restaurant. You were the asshole to your wife making this confrontation", ">i've had dogs ruin a good time\n\nOK, so if a dog isn't interacting with you directly then it should probably be fine.\n\n>I order my drink and also ask the server what is up with the dog. He just says it is a service dog and there isn't much we can do so they let it in\n\nOK so the the staff are already well aware...\n\n>their is a dog a few tables over ... It barks once ... the dog puts its paws on the table\n\nMhm. As annoying as that is, it was far away from you and not actually inconveniencing you or impacting anyone but the owners.\n\n>I speak up\n\nThat was squarely not your job. If you were actually concerned about the health risks, you could have easily just flagged a waiter to make them aware, so they could decide whether they wanted to talk to her or just sanitize more than usual once they left\n\n>he dog starts barking at me\n\nIt sounds like you ruined a good time, and the dog spoke up about it.", "YTA.", "YTA", "ESH. You humiliated your wife and caused more conflict than you would have if you'd just let it go.\n\nThe lady sucks for abusing the policy because she wanted to bring her pet, it is not a service animal. ESAs are bullshit. Putting her dog on the table is gross and unsanitary. Dog People™️ are the worst.", "ESH\nYTA for causing a scene at a restaurant \n\nDog owner is TA for sneaking her pet in as “service dog” when it is obviously not a true service dog.", "It was wrong of the person w the dog to do that. \nBut I’d be embarrassed to be your wife and see you talking to someone like that. AND she told you to let it go.\nIt’s the restaurant’s responsibility, not yours.", "Vests can be a helpful indicator of a service dog, but are not a legal requirement of one. A service dog can work “naked” in a plain collar and leash, if desired. Just fyi! :)", "It literally wasn’t a service dog.", "Not his table, not his problem.", "That's very cool, but was it his business to intervene on behalf of the owner of the restaurant, at the direct expense of his wife?", "It actually depends to be honest. There are many services in which a dog may be trained to bark. Honestly, from the discription the OP gave, it sounds like the dog may have been a diabetic alert dog, and it may have done a singular bark to alert that it may have sensed her blood sugar was low, so she brought it up closer to her to \"Smell\". The dog barking \"At him\" may have been the dog responding to the scent of her breath when she was telling him to mind his own business.\n\nIn this case, he definately TA. \n\nPeople have this horribly poorly informed idea of what a service dog is and what they do, to the point they may not understand why a chihuahua can be a diabetic alert dog, or even what Orbiting is for a PTSD Psychiatric dog. They may not even understand that sometimes a singular bark is an alert and IS A TRAINED RESPONSE.\n\nI am autistic and have a service dog and he is trained to first paw at my leg when he has sensed I am having a moment of crisis, as he can tell before I or others can see it. If I don't respond, he barks once in a very specific way that lets me know I Have to sit down NOW. If I don't have a chair to sit down on, I will sit against a wall even in the store, then he will lie over me and give me DPT. I have had people yell at me in stores or in restauraunts because they think my dog is untrained because they do not understand the services he does and why I need him or what the services I need look like. He is also trained in orbiting, and I cannot tell you how many times someone has grabbed my dog's leash in a store thinking they were \"helping me\" when he was doing his orbiting. Check yourself and your knowledge before assuming what a service dog does.", "If a man is shouting at the handler and the dog it’s kind of a stressful situation for both.", "That's why they aren't allowed on them.", "I'm going to say that you saying that hurts disabled people, as a disabled person with a Service dog.\n\nWhen reading the OP's post, I instantly knew the lady who had the dog most likely had a diabetic alert dog. These dogs are usually kept in a sling close to the owner's breath, but at a restauraunt may be on a chair close by, and may need table access if they alert . When they smell ketones on the breath of the diabetic person about to have an insulin issue, they bark once. If the diabetic person ignores them, they may bark more, maybe even multiple times to insist severity. \n\nWhat this read as was : Dog barked to alert possible ketones but was too far away that the owner brought the dog onto the chair to see if it would alert again. Dog proceeds to leverage itself on the table to get a better whif at owner's breath. Op does the dick thing and calls out a service dog doing a service cos he doesn't know what service dogs do. Owner rightfully tells him to mind his own business. The Yelling may have made the dog trigger a more serious alert and start a prolongued barking. It also says a bit that they're at a restauraunt, and was probably waiting for her meal, as she probably knew her insulin was low.\n\nOp is TA here.", "Of course. In this situation, the dog barking at a person multiple tables over is not barking for a trained service.", "I understand where you’re coming from, but your dog would be seated ON a chair at the table & then allowed to put its paw on the table without you noticing..?", "Is this how you treat every story here? It's possible for OP to be in the wrong and for the lady to not have a service animal. And from the sounds of it, it's not.", "Service dogs are not put up on seats next to their humans. They do not put their paws on tables. And they do not bark. This was clearly an eMotIOnal SUppOrt dOg.  Maybe ESH bc that other customer was obviously lying about their dog bc they were an entitled asshole.", "The narration sucks, however, it is FUCKING DISGUSTING for an animal to \\*sit on a seat and a table at a FUCKING restaurant.  An actual service dog would likely be sitting or laying at the owners feet.\n\nThe sounds like someone who didn’t want to leave their pet at home.  \n\n\n\\*edited because I absolutely meant SIT and not pee…", "I always love it when someone writes to me assuming I don’t also have a lived experience.", "I wish I could upvote this more. \nService dogs are trained in multiple ways depending on their job. But everyone assumes they are all the same. They are not, they are trained for a specific job, and alerting could be one. \nI know this dog could have been an emotional support dog, but there is no way to know for sure.", "This does not disagree with anything I just said.", "I highly doubt the dog was barking at him, though may have been looking at him because he was uneasy with him causing a stink. I posted this elsewhere, but this is what the scenario looked like to me, who IS familiar with what Service dogs do:\n\nDog barked to alert possible ketones but was too far away that the owner brought the dog onto the chair to see if it would alert again. Dog proceeds to leverage itself on the table to get a better whif at owner's breath. Op does the dick thing and calls out a service dog doing a service cos he doesn't know what service dogs do. Owner rightfully tells him to mind his own business. The Owner's breath and yelling back at him may have made the dog trigger a more serious alert and start a prolongued barking. \n\nThem arguing may have made the dog continue alerting. Yes, they are trained to prolongue bark if the owner does not take steps to alleviate the issue or command the dog to stop. Who knows why? but most likely it was her being tired of just another person who is an ass to her about her service dog and wanting to put him in his place first. I've been there a few times, where my dog is insistantly giving me his Alert chirp and I'm in the midst of a full blown meltdown/panic attack while also yelling at the person telling me my dog isn't a \"Service dog.\"", "yes, because Diabetic alert dogs need to be close by the owner's face to alert. At restauraunts, that may be in a chair. If they sense something, they may put their paw on the table and lean up to get a better smell. That's how they work.", "Absolutely. If someone writes how much they hate dogs the first half of their post, I’m going to assume that they’re not a reliable storyteller when it comes to the dog in the story.", "They very well may (bark and paw the table) if they are signaling an event of some kind.", "I don’t disagree that it probably wasn’t a service dog—but also want to point out that the server said it was, not the woman who had the dog. It very well may be an ESA, which does not hold the same standards as a service dog, but the server may not know the difference. Point is, the dog’s presence has no bearing on OP’s experience at all, other than he was annoyed by it.", "Did I miss where the dog peed?", "I agree with that as well—I would never want an animal to pee on the seat or the table. I didn’t see that it did that, which obviously is not in line with a service animal.", "A couple years ago, my husband and I were at a restaurant for dinner, and I saw, what I assume to be, a LEGITIMATE, service dog. It was laying by the owner's feet under the table. The only time I ever saw that dog even blink, was when they got up to leave after their meal. A legitimate service dog will not bark at other people, or get to get up on the seat or table. I also work at a hotel, that does not allow pets, but we HAVE to allow services animals or we are in violation of the ADA. BUT according to the ADA if the \"service animal\" is disruptive or a nuisance, we can most certainly kick out the animal. Can't kick out the owner though, have to give them the option to stay WITHOUT the animal. \n\nI'm giving OP a \"soft\" YTA. It clearly was not a service animal, but he should have said something to the staff, and not the owner, but I also understand the desire to call out a liar that claims their pet is a service animal.", "You are making an awful lot of assumptions about both parties in this situation.", "Not so. If the dog is that small that it needs a chair or table, which they don't because a dogs sense of smell is so incredible, hence, they smell your blood sugar, it can however sit in a sling that the owner is wearing.", "Exactly, like he laid out that he is the type of person to stare at a dog and be hypercritical of all of their behaviors because he was looking to make an issue because he doesn't like dogs. He's not a reliable narrator to say whether or not the dog was displaying appropriate behavior or not, because he was fixing to have a fight over the fact there was a dog even there cuz he doesn't like dogs", "Yup!  A dog doesn’t need to be on a seat or table to alert anyone.", "The dog didn't, people are just jumping to wild conjecture just as the poster did", "No, Just reading the situation as told from the eyes of someone who actually knows service dogs and knows people who hate dogs and hate service dogs around them. Op's barely given anything, and we know there's always two sides. If the Restauraunt verified it's a service dog, he should have minded his own business, period, and he didn't. End of story. From there, yes, I will assume it is a service dog, because most know how to weed out the fake ones in my experience.", "you're vastly overestimating the scent range of a medical alert dog, and sitting at a table with a dog in a sling on your chest at a restauraunt is unfeesable and uncomfortable.\n\nDogs DO have a more powerful sense of smell, but there is still a range. Even bloodhounds have to have their nose mostly to the ground to determine the different scents, and their direction incoming. You're basically saying that any medical alert dog can walk around like a normal dog and alert from any range and that's simply untrue. And with the proliferation of Keto diets out there, they have to be able to be close to differentiate ketones on their owners breath from those around them. They don't \"Smell your blood sugar\" they smell concentrations of Ketones that are emitted in breath. Basically the owner takes a sample of their saliva when they're at a near-crisis point, and this amount is used to train the dog to alert. The dog smells the level of ketones and alerts, they don't SMELL YOUR BLOOD. That's laughable.", "actually, what the op discribes sounds like the dog was a diabetic alert dog. They are trained to bark if they smell ketones on their owner's breath. She may have brought him closer/onto the table for him to make sure, and her telling him to stfu and the dog alerting pretty vocally afterwards to the smell of her breath when she was saying something may have also been what happened. Tbh, the op just sounds like someone not aware of what service dogs do nowadays and how many ways they are trained, Same as you if you didn't think Diabetic alert dog from his discription.", "You can't possibly know what the first bark was about.", "Precisely. I mean, most of these posts aren’t greatly reliable, but this one is pretty bad", "I honestly didn’t consider that. That actually makes a lot of sense", "Ok", "A person with lice, mites, crabs, bacterial infections, etc. might sit at a table as well. You’re much more likely to be affected by parasites or disease from being near people than dogs.", "Oh please. Lice don't live on dirty people. Crabs? Do you think they're sitting their bare genitals on the table? Bacterial infections? Are they bleeding and getting bodily fluids on the table? Doubt it.\n\nDogs are dirtier than people."]}