{"id": 513, "submission_id": "yi16i1", "title": "WIBTA if I ask my roommate to wash my dishes?", "selftext": "     I (20 nb) am a college student, and I live on campus with 2 roommates, G (20 f) and A (19 f). G and I roomed together last year and got along great, but this year A got thrown in with us out of the blue. \n     We'd heard really not great things about A, but there wasn't much we could do. For the most part we get along, and we found out that most of the bad stuff we heard was from a super biased perspective. A has some chronic medical conditions, and is currently sick. \n     I've sometimes used some of her cooking utensils after asking, and I wash them almost immediately after I'm finished with them. Last week before she was sick, she used my spatula to make herself some eggs. I wouldn't have a problem with it if she asked first and washed it by the end of the day, but neither of those happened. It finally got washed by G tonight because she was washing all the dishes in the sink. If I needed it I would have washed it, but I didn't have any need for it this week, and it was buried under other dishes that were there for just as long or longer, and I'm really squeamish with severable day old bits of food, which is why I wash any dishes I use within a few hours. This isn't the first occurrence either, at the beginning of the semester my only butter knife was missing for a week before I figured out someone had used it and left it in the sink. A also used my baking sheet, said she'd wash it that night, then left it in the sink for several days. \n     I know that her chronic conditions and sickness make it harder for her to do some stuff sometimes, but WIBTA if I ask her to wash my dishes in a more timely manner?", "created_utc": 1667192091, "permalink": "/r/AmItheAsshole/comments/yi16i1/wibta_if_i_ask_my_roommate_to_wash_my_dishes/", "score": 0, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My roommate is chronically ill and currently sick, which sometimes makes it harder for her to do daily activities. However, 3 times in the last few months, she has used my dishes without asking first, and proceeded to leave them in the sink for several days. I'm especially upset by this because I'm squeamish with several day old bits of food, and my dishes are often surrounded/buried by other dirty dishes that are not mine & I didn't use. \nI want to know if I'll be the asshole if I ask her to wash my dishes that she uses in a more timely manner, especially because some days she can't do much.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If she is well enough to use the cooking utensils, then she’s well enough to wash them. Tell her she’s welcome to use them as long as they are washed that day. If not, she will need to get her own. She is using her medical condition to be lazy and you need to speak up for yourself.", "You're NTA but you're also 20 years old in college and you gotta have the grit to speak up about your butter knife in this world friend.", "Actually you can say that. You should say that and she should wash them. But like you said she is sick and she can use that to start an argument.\n\nYou need to talk on very thin line. So she can see your concerns are about hygiene and these are your stuff...", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n     I (20 nb) am a college student, and I live on campus with 2 roommates, G (20 f) and A (19 f). G and I roomed together last year and got along great, but this year A got thrown in with us out of the blue. \n     We'd heard really not great things about A, but there wasn't much we could do. For the most part we get along, and we found out that most of the bad stuff we heard was from a super biased perspective. A has some chronic medical conditions, and is currently sick. \n     I've sometimes used some of her cooking utensils after asking, and I wash them almost immediately after I'm finished with them. Last week before she was sick, she used my spatula to make herself some eggs. I wouldn't have a problem with it if she asked first and washed it by the end of the day, but neither of those happened. It finally got washed by G tonight because she was washing all the dishes in the sink. If I needed it I would have washed it, but I didn't have any need for it this week, and it was buried under other dishes that were there for just as long or longer, and I'm really squeamish with severable day old bits of food, which is why I wash any dishes I use within a few hours. This isn't the first occurrence either, at the beginning of the semester my only butter knife was missing for a week before I figured out someone had used it and left it in the sink. A also used my baking sheet, said she'd wash it that night, then left it in the sink for several days. \n     I know that her chronic conditions and sickness make it harder for her to do some stuff sometimes, but WIBTA if I ask her to wash my dishes in a more timely manner?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*"]}