{"id": 5147, "submission_id": "zq1vcb", "title": "AITA for getting myself kicked out of Sunday School?", "selftext": "I am the drama this week. I (16F) got myself kicked out of Sunday school at my step-dad’s church this weekend.  My mom married Brad earlier this year.  He has 4 kids (12F, 10M, 9M, 7M) that are with him most of the time, and to say their family is religious is like the understatement of all time.  The daughter has to wear skirts all the time and can’t cut her hair and they’re all at church at least 3 times a week and have like family Bible time and stuff every day.  I wouldn’t care except that now that my mom and Brad are married they expect me to participate and that’s just not my bag.  I think it’s superstitious misogynistic nonsense and I always leave stuff at their church feeling icky. I tried to get my mom to let me go to my dad’s on Sundays to avoid conflict but that’s a nonstarter so far, so I try to avoid talking about it but Brad is like making it his personal mission to get me “saved” or something so the subject comes up regularly.\n\nI finally put my foot down about not wanting to go to church with them and it turned into a big argument and my mom asked me to just go and keep the peace for the younger kids because it’s something we do as a family. So, I go and mostly just read, but I don’t lie about why I’m there or my religion if someone asks me a question. It pisses Brad and my mom off, but I figure if they don’t like it they can let me stay home.\n\nThe problem is that the Sunday school teacher for my age group is a real piece of work and thinks we’re all stupid because we’re teenage girls. So he likes to go into a lot of biblical Greek translation stuff to make himself look smart.  The only thing is he’s almost always  totally wrong.  My dad sends me to private school and I took 2 years of Ancient Greek (taking Latin now) and I know he’s bullshitting people. So I brought an interlinear New Testament and a Koine Greek dictionary with me this week and when he got started I corrected him.  Not mean, but just like “Wow, that’s not what it says here at all, can you explain more?” and “Oh, that’s weird because that’s not how Brill defines that word.”\n\nDude was turning red by the end of it and asked me to stop interrupting, so I just shrugged and said I was trying to learn.  He told the pastor and the pastor told Brad that I’m not allowed to come to Sunday school anymore because I’m disrespectful.  So Brad and my mom are mad and want me to apologize for derailing class instead of just getting through quietly, but I don’t know.\n\nAITA?", "created_utc": 1671480033, "permalink": "/r/AmItheAsshole/comments/zq1vcb/aita_for_getting_myself_kicked_out_of_sunday/", "score": 33, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I did disrupt class for the other girls and make dude look bad on purpose, so that may have been an asshole move.  Also I am at their church even if unwillingly, so maybe I should just roll with it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nevangelicals are annoying. Tbh i think this is the best way to clap back at the BS churches push down people's throats. Good on you for checking their lies.", "NTA\n\nI wish there were more kids like you. We need more people to push back against people trying to abuse their power", "NTA - You’re my hero", "NTA.", "NTA - Brad is way out of line trying to force his religion on you and your mom is also TA for trying to coerce you into going to his church to keep the peace.  Can you talk to your father about it and ask him to intervene on your behalf?", "NTA, you didn't want to go and the guy is sexist. You got what you wanted, right? 2 birds, one stone.", "NTA. Some religious people just choose their ego over any thing else and refuse to listen to other people’s opinions. (I went to a religious school for 2 years filled with people like that) You didn’t really do anything wrong- ig except maybe interrupting was seen as rude. Anyways, personally I think Nta.", "NTA.\n\nYou proved that the purpose of the Sunday school \"lesson\" was not about learning. If it were, the teacher would have been happy to have a discussion with you. The adults who are trying to force you to attend and agree with something that you don't believe in don't respect your opinons yet expect that you should respect theirs. That's not how respect works.", "NTA at all and I'm proud of you tbh", "NTA - go live with your Dad, if at all possible. Forcing children to live by archaic religious laws is child abuse.", "NTA tell your dad that they are forcing you into religious indoctrination, his custody lawyer will have a field day.", "NTA and I applaud you. Effective.", "NTA- You are awesome. Keep questioning and always be true to yourself.", "NTA\n\nGood on you for standing up to the indoctrination. Disgusting behavior from your Mom and Brad for forcing you into something you've explicitly told them you want no part of. \n\nHad they just listened to you from the beginning, this entire situation could have been avoided. How does your Dad feel about this?", "Nta. That weird pompous dude teaching wrong, spreading misinformation. Big flaw when it comes to religion. Misinformation keeps being spread and spread", "NTA. Religion shouldn’t be forced on you when it appears it hasn’t been a major part of your life so far. Curious though, did you get to explain why you interrupted? Perhaps just not mentioned but I find it odd that no one seems concerned that a bunch of BS is being taught at Sunday school", "NTA - If you were really there to learn, they wouldn't have kicked you out.", "NTA got to question any religion that relys on misinformation. I once was “disinvited” to a church organization that tried to tell young children there were no dinosaurs and all museums were actively denying god by creating paper mache dinosaur bones. I definitely questioned the hell out of those lies.", "NTA and that was great!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am the drama this week. I (16F) got myself kicked out of Sunday school at my step-dad’s church this weekend.  My mom married Brad earlier this year.  He has 4 kids (12F, 10M, 9M, 7M) that are with him most of the time, and to say their family is religious is like the understatement of all time.  The daughter has to wear skirts all the time and can’t cut her hair and they’re all at church at least 3 times a week and have like family Bible time and stuff every day.  I wouldn’t care except that now that my mom and Brad are married they expect me to participate and that’s just not my bag.  I think it’s superstitious misogynistic nonsense and I always leave stuff at their church feeling icky. I tried to get my mom to let me go to my dad’s on Sundays to avoid conflict but that’s a nonstarter so far, so I try to avoid talking about it but Brad is like making it his personal mission to get me “saved” or something so the subject comes up regularly.\n\nI finally put my foot down about not wanting to go to church with them and it turned into a big argument and my mom asked me to just go and keep the peace for the younger kids because it’s something we do as a family. So, I go and mostly just read, but I don’t lie about why I’m there or my religion if someone asks me a question. It pisses Brad and my mom off, but I figure if they don’t like it they can let me stay home.\n\nThe problem is that the Sunday school teacher for my age group is a real piece of work and thinks we’re all stupid because we’re teenage girls. So he likes to go into a lot of biblical Greek translation stuff to make himself look smart.  The only thing is he’s almost always  totally wrong.  My dad sends me to private school and I took 2 years of Ancient Greek (taking Latin now) and I know he’s bullshitting people. So I brought an interlinear New Testament and a Koine Greek dictionary with me this week and when he got started I corrected him.  Not mean, but just like “Wow, that’s not what it says here at all, can you explain more?” and “Oh, that’s weird because that’s not how Brill defines that word.”\n\nDude was turning red by the end of it and asked me to stop interrupting, so I just shrugged and said I was trying to learn.  He told the pastor and the pastor told Brad that I’m not allowed to come to Sunday school anymore because I’m disrespectful.  So Brad and my mom are mad and want me to apologize for derailing class instead of just getting through quietly, but I don’t know.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, you badass! I agree with you about the misogyny, and what you did at Sunday school was perfection. \n\nBrad is way out of line, as is the church teacher. This church sounds like a damn cult. Good on you for thinking for yourself. \n\nThis internet stranger is proud of you!", "NTA - Congrats on getting kicked out of the cult!", "NTA. They kicked you out because they didn't want the other kids to find out they're full of crap.", "INFO \n\nIsn't 16 too old for Sunday school anyway?", "NTA. You’ve made your feelings about their religion very clear and they still made you go anyway. These are the consequences of their actions. It’s not like it’s even real school.", "NTA. At 16 your old enough to say I don't want to go to church. That's not family bonding. Your mom trying to force it to keep peace pretty much says it all. Any way you can stay at your dad's? Or run the second you turn 18. Really be petty and offer to teach the Sunday school teacher Ancient Greek.", "NTA. Education FTW.", "NTA.  OP can get your dad involved and revisit the custody arrangements as you are certainly old enough to have an opinion wrt the court.", "NTA - from personal experience I can tell you the worst way to ***\"save\"*** someone is to force them. If you need/want God you'll find Him yourself, if you don't, then you don't. This is coming from someone who was over-churched at a very young age (both my parents have backgrounds in theology, I only attended Christian parochial schools, went to church/chapel every day, etc.etc.) I don't attend anymore mostly because of hypocritical dingbats like your stepdad and the Sunday school teacher.\n\nBut the key here is you're trying to make this whole thing bearable by either offering compromises (voluntarily excluding yourself from \"something we do as a family\" so as not to ruin it for others) or by engaging in the lesson (let's be honest you were calling out your teacher, but I can't blame you for that if he's as incompetent as you say). They're just angry you're not believing their way which 1) isn't how faith works and 2) is controlling as fuck. \n\nTalk to your dad and see if he can help you get out of this because it sounds like an unhealthy environment for you, your education, and your psyche as an impressionable teen. Because the problem with \"keeping the peace\" or \"getting through quietly\" is once you accept that as your only option it will creep into other parts of your life. Again, I speak from experience. Please protect and maintain your voice. No one gets to tell you what or how to believe. Good luck.", "Nta\n\n\"I'm sorry that you don't actually know how to read what you are supposedly teaching.\"  Boom, solid apology to the AH lol. \n\nYour step dad in is in a cult, and if you show free will, then his kids might think they *gasp* actually have some choice in how they live their lives. \n\nYou have a solid option in your bank pocket though. If your dad is game, you are old enough where the courts will let you choose which parent you live with. Tell your mom, if she pushes the issue again, you'll tell a judge you want to live with your dad full time, and if she keeps pushing the issue, you'll just never talk to her again. \n\nOr... just stay in the house like a sleeper agent, letting your step siblings know that they have a choice in how they live their lives, and that just because their dad is in a cult, they can choose another way.", "ESH including you. Sometimes,in life, you gotta suck it up if it means keeping the peace.", "He doesn’t like it at all and said if it gets out of hand to let him know.  I’m spending the Christmas holiday with him this week and next week so we’re going to talk about changing up the living arrangement and I may just stay here after new years.", "If it's church doctrine BS, the folks there would approve of the BS...", "Not odd at all....They want the BS shoved down kid's throats because the BS fits their world view.  Churches like this exist for themselves.", "I explained to my mom and Brad, but they just said that was rude and Brad tried to make an argument about it being a different kind of Greek (it’s not).  I don’t think anyone at the church really cares, tbh.", "Everybody goes to Sunday school at this church, even the old people.  Idk, this is the first church I’ve been to", "Not really. A lot of churches have adult and older teen \"Sunday school\"/Bible studies for a couple of hours before their main service.", "Not really. A lot of protestant churches have Sunday School (aka youth groups) that go all the way through high school", "So OP should've just sat idly by when the teacher was giving false info to \"keep the peace\"? Are you serious? Nothing wrong with asking questions and correcting the instructor in a learning environment. This teacher and the pastor have big egos. If they really cared about her learning instead of indoctrination, they'd have not kicked her out.", "Nope. The parents can suck it up and deal with the \"congregation\" asking about her absence - to subjugate someone to the cultish indoctrination of church against their own wishes is abhorrent and draconian. Let the woman make her own choices regarding her spirituality.", "No. Not when it comes to personal integrity and religion. That shit doesn't need to be shoved down anyone's throats. You shouldn't have to dumb yourself down or not be true to yourself to \"keep the peace.\"", "The only person here who sucks is you", "The adults can suck it up, and not force op to go to their cult meetings to keep the peace. The adults in the situation can, you know, act like *adults* and realize this isn't something op wants or needs.", "I'm glad to hear you're being proactive about this. Unfortunately, it seems like your Mom is more interested in keeping Brad happy than listening to you. I'm sorry you have to deal with this. It sounds like Dad is a good support for you. Best of luck and Merry Christmas/Happy Holidays.", "True. Didn’t want to offend anyone by adding further to the last sentence 😆 I’m not religious so just about all of it is BS to me", "Latin student who knows literally nothing about Greek: at least for Latin there is “church Latin” which has some differences, dunno if something similar is the case for Greek", "Sounds like a cult.", "Eww", "Oh maybe it's a thing with all those christian spin-offs, then?\n\nI was raised catholic and CCD stops by like high school.", "There are some different versions of Greek but we covered Koine Greek along with Homeric Greek and Koine is what’s used in the New Testament.", "I wouldn’t be surprised, they believe in some super weird things that even my Baptist friend was like “what? *blinkblink* about when I told her.", "I was raised southern Baptist, so I can't speak for Catholics. I really don't think it matters what denomination of Christian you are anyway. The goal for any fundamentalist is to try and keep in you in church and classes throughout your whole life."]}