{"id": 5189, "submission_id": "zqelpn", "title": "AITA for making my parents choose between me and my ex/former friend?", "selftext": "I was best friends with Jen from preschool through 9th grade. Her home life was was pretty rough and she practically lived at my house. My parents called her the daughter they never had. \n\nWhen we were in 9th grade, I asked her out. It took some convincing but she eventually said yes. She broke up with me over text the day after our date. She barely went to school, didn’t text, and wasn’t at my house at all the next few weeks. \n\nShe eventually showed up at my house in the middle of the night. My parents took her in no questions asked then she left in the middle of the night a few weeks later. I admit I didn’t love having her around and didn’t make it easy on her but her leaving was hard on everybody. My parents had to go to therapy. \n\nLast year I moved out for college but I was still planning on coming to visit. A few months after I moved out, Jen showed up at my parents house pregnant and with a baby. They took her in again then called me and my brothers asking how we feel about her staying with them. My brothers were ok with it but I can’t forgive her for what she did a few years ago. \n\nMy parents let her stay anyways but said they had conditions on her staying with them like her going to therapy and either enrolling in college or getting a job. I told them I still wasn’t okay with it. We argued a bit and I told them I wouldn’t visit if she was living there.  \n\nShe’s still there and I held true to my word and I haven’t visited since. They’re trying to get me to come for Christmas but I won’t be there if Jen is living there. \n\nThey’re calling me petty and saying I need to forgive her but I think I have a right to be upset.", "created_utc": 1671511299, "permalink": "/r/AmItheAsshole/comments/zqelpn/aita_for_making_my_parents_choose_between_me_and/", "score": 430, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I won’t visit my parents unless they kick my former friend out but they consider her to be their daughter and won’t kick her out. They’re hurt that I won’t visit and that I’m making them choose between us.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "So, at 15 you were told \"no\" and then after bullying her, which you refer to as \"it took some convincing\", she \"eventually said yes\". \n\nYou had one single date, which you harassed her into agreeing to. Then you refer to her not wanting a second date - she also didn't want a first date, either, btw - as \"breaking up\" with you. \n\nShe then spent weeks avoiding you, which you still didn't pick up on. \n\nYou don't say how old you are now, but it's clear you still resent her for not wanting to date you. \n\nYTA", "Uhm . . . yes, you're the asshole.  You can't forgive her for what?  Not wanting to date you?  No one ever needs to apologize for not wanting to date someone.  And you only went on one date, after \"some convincing\"?  She doesn't owe you anything.  Your parents are trying to help her get her life turned around and you're snubbing her because of a bruised ego.  Time to let this go and be a bigger person.", "OK, let me unroll this for you:\n\n1. You had a friend who was in need of help / a safe space. Not only did you think it was appropriate to ask her out in a situation where she was somehow depending on you / your family, you also thought it was necessary to \"convince\" her when she initially refused. You are already pushing hard to be TA right there, but I'm giving you the benefit of young age here. You probably did not realise how abusive your behaviour was back then. I hope you do now.\n\n2. You went out for ONE date, and she \"broke up\" with you the next day? Let's rephrase that as \"she was not interested in a second date\" because, honestly, there was nothing to break up. Going on one date did not make you a couple. If you can't see that even years later, then clearly, you are taking another huge step to being TA.\n\n3. Your (former) friend, whom your parents have a deep relationship with, is in need of help, and your parents are willing to provide that for her. Not blindly, but based on the condition that she seeks professional help as well. If it hasn't been said before, let me the first so say: God bless them! I wish there were more people like your parents in this world! And yet, you resent their behaviour. Because of what? Because that girl did not want to date you? And not visiting is your way of \"punishing\" them? You asked for it, here it is: YTA.\n\nIf you don't want to go visit your parents, then don't go. You might be doing everyone a favour. But if you go, you might want to apologise to your friend for your behaviour in the past. Because, even though you called her a \"friend\" back then, you have not been one. Chances are that you have actually contributed to her leaving your parents' house in the middle of the night.", ">I can’t forgive her for what she did a few years ago\n\n... Checks notes... Only thing Jen has done is 'break up' with OP after they severely pressured/bullied her into a SINGLE date\n\nYTA", "YTA\n\n“It took some convincing but she eventually said yes.” You coerced her into dating you.\n\n“She broke up with me over text the day after our date.” Because you coerced her into dating you.\n\n“I admit I didn’t love having her around and didn’t make it easy on her.” I’m guessing that this summary hides A LOT and is as close as you’ll come to confessing you bullied her out of the home.\n\nYou don’t have to go home but I don’t think you have more of a right to be upset with her than she does with you.", "YTA - I think you might need therapy as well. Are you really being this mean, petty, and heartless because someone did not want to date you? Really? Is your ego that fragile? Also, you sound like a bully in this story. Your parents are saints but they may have dropped the ball on teaching you what it means to have compassion (as well as that “no” means “no”).", "Yta \n\nYou were this girls friend, refuge and safe space and you bullied her into dating you. \n\nWhen she realised she’d rather live in a ‘pretty rough’ situation than the uncomfortable one you out her in, you’ve got annoyed. \n\nWhen she’s needed help. You’ve again been abusive. \n\nNow you’re continuing it. \n\nGrow up. Apologise and realise she’s got no obligation to date you. Ever.", "She's not your ex. Any romantic relationship you had was in your head.\n\nYou're holding a grudge over nothing. \n\nYour family cares about her and want to help her. Too bad you didn't learn kindness from your family.\n\nYTA", "YTA \n\n>It took some convincing but she eventually said yes.\n\nSo you essentially harrassed her into going on a date with you\n\n>She broke up with me over text the day after our date.\n\nShe didn't break up with you, she refused to be harrassed into a second date\n\n>She barely went to school, didn’t text, and wasn’t at my house at all the next few weeks. \n\n>She eventually showed up at my house in the middle of the night.\n\nShe avoided you and only came to your house when she was obviously desperate and needed somewhere to go\n\n>she left in the middle of the night a few weeks later. I admit I didn’t love having her around and didn’t make it easy on her\n\nYou made this vulnerable girl miserable enough to leave in the middle of the night because she didn't want to date you\n\nSo what right do you have to be holding a grudge against her exactly??? Cause all I'm seeing is that she needs help and your parents are willing to help her, but you're still being petty about things from years ago that were your fault. If anyone should be angry, it should be her for how you treated her.", "YTA. She's a young girl in a bad situation. She found some adults she could trust, the parents of a friend, and everything was going well into said friend pressured her into dating when she clearly wasn't interested. Them she lost the friend, and support network when she established her boundaries only to reach back out years later.\n\nYou went on one fucking date. I get you probably had strong feelings. It happens when we're young and inexperienced, and yeah, it stings when they don't reciprocate. But you should be grown. Get over yourself.", "YTA.\n\nYou bullied her into dating you and then when she came back after a few weeks, hoping you'd be over it, you bullied her out of your house too. \n\nShe was what, 14, 15? And you're actually mad that a 14-15 year old girl didn't make perfect choices when she was treated badly by you in the place that she used to see as her safe haven and you turned it into another place of misery for her?\n\nAnd you're really not seeing things from her perspective either. Clearly she learned that if you feel you have to leave, forget your stuff, and leave when no one can stop you. Notice how she turned up in the middle of the night according to you and also LEFT in the middle of the night from your place?\n\nI can almost guarantee you that is because she was previously hurt trying to leave at other times by other people and the scars from that meant when you made her feel miserable in the place she used to feel safe, she didn't feel safe telling you she was leaving. Her trauma told her that you would hurt her if she did or not let her leave.\n\nSHE likely felt incredibly betrayed that her best friend didn't accept no for an answer then after weeks of space, still decided when she showed up, to act like a jerk to her for weeks. SHE was likely worried that you weren't going to ever stop or were going to escalate like the people in her home life. SHE must have felt miserable and rejected having her best friend turn on her so easily and must have felt so afraid that other people could do that too.\n\nYour parents are also seeing what you aren't: Jen's bad home life set her up to fail and make the mistakes and errors in judgement she has. And they want to set her up with actual stability, resources etc. because they are kind caring people and have known her since she was a young child and want her to succeed.\n\nMake it your hill to die on if you want, but you won't get what you want by doing so, you'll just hurt your parents and that gives them all the more reason to choose her over you when she's not the one giving them ultimatums.", "YTA. You’re such a massive asshole and haven’t matured AT ALL. Like you’ve spent no time reflecting on this poor girl’s life and that your immature choices forced her to leave the loving home she had with your family because you wanted to date her. \n\nIf I were your parents I’d choose her over you as well!", "Info: You say you didn't make it easy on her but what did you actually do?\n\nBecause it sounds like you bullied her until she ran away to escape you.", "YTA. Your house was a haven for Jen, and possibly one of the only safe places she had access to. Instead of just being her friend through those difficult times, you badgered her into a date that she clearly wasn't interested in. (Here's a hint, girls who are into you don't need \"convincing.\") When she got desperate enough to turn to your family despite your boorish behavior, you were still hung up on the rejection and gave her a hard time. This girl was in crisis, and you prioritized your romantic hopes and injured pride over her actual well-being.\n\nAnd now, many years later, you're still holding that grudge even though you're the one who wronged her in the first place. If you'd been less selfish towards Jen back in high school, things might have gone pretty differently for her.", "INFO: How is it a breakup after one date?", "YTA.\n\nIn 9th grade you pressured her into a date she never wanted, and then got pissed when she told you after the date that she still didn't feel that way for you.\n\nAnd you've held a years-long grudge over that.\n\nShe grew up rough, and had no safe place to fall except your parents, and you want to take that from her too, because your teenage crush wasn't reciprocated?\n\nI'm having trouble seeing where she ever did anything wrong to you. Have you considered letting go of this ancient teenage drama already?", "YTA.As you said her home life is rough.Your parents are also really sweet for taking her in but you’re mad at her for not wanting to date you??Seriously??You’re really petty dude.", "YTA, and a bad guy. You bullied this poor woman over your ego issues, and now want her dumped on the street.", "YTA. You were an entitled kid who got pissy when a girl rejected you, and you acted unkindly to get back at her. Now years later she clearly needs help and support, your parents are willing to give it to her, and you’re denying it bc you’re still bitter about being rejected and it might be awkward when you occasionally visit. Grow up.", "YTA, even ignoring the \"I admit I didn’t love having her around and didn’t make it easy on her\" which probably could be it's whole own thread that wouldnt look to good on your part, I think if your honest with yourself, you'd recognise your doing this almost entirely out of spite for being rejected in the past. If your whole family is ok with it and forgiven her for running away, you shouldnt really have a problem with her.\n\nYou have a right to be hurt from rejection (it sucks) and your not obligated to go for Christmas obviously but if you could find it in yourself to apologise, swallow the pride and head home, everyone, including yourself would probs be happier in the long run", "Ya'll went on one date after you convinced(bullied) her into it. I'll bet money she felt cornered and scared.\n\nYTA. She didnt do a damn thing to you. You are being petty.", "Look up \"nice guy\" and then look in the mirror. She was your friend and took solace in your home because her homelife was horrendous. She wasn't there for just you, it was for your family. She saw you as a friend and brother, you wanted more and were pissed when she didn't feel the same. Grow up. Just because you want to date someone doesn't mean they have to feel the same. YTA", "YTA\n\nAt 15 you wore her down to make her agree to date you - there is nothing ok about this. I feel sorry for her. You’re her best friend and have been for years, your parents see her as family and she probably thought the same, and had a safe escape from her awful home life - and then you spring this on her and she can’t say no outright because she owes you and now the whole friendship is tainted and she’s lost her safety and her best friend and her surrogate family. So since you won’t take no she agrees and gives it a chance of one date but can’t go on with that so dumps you. Was it cowardly? Maybe but she’s in a tough place and I don’t blame her\n\nShe avoids you for weeks - but then in the middle of the night shows up. What happened that meant she had no other options? To drive her from her house to yours at an unsociable hour? \n\nBut you - her former best friend - make it clear that even though your parents are happy to welcome her you are not. So she’s in this situation of being unwelcome - and by somebody she trusted for years.\n\nSo she leaves - because you drove her out. \n\nYou never really go into any of what she is experiencing but she’s young, she had a bad home life, and now she’s pregnant and she shows back up \n\nJust try and imagine how desperate she must have felt to come back to your parents. \n\nThroughout this post you don’t even seem concerned about how your parents feel, let alone Jen despite the fact she was your friend for so long. She has been through a lot and all you seem to care about is it hurt your feelings that she didn’t want to dare you. \n\nYTA", "YTA\n\nSounds like you were sexually harassing this vulnerable girl and she didn't feel safe so did a runner.\n\nYou are the problem", "YTA big time. A lot of the problem she's having now are because of what you did to her. She didn't have a stable home, and then when she thought she had a stable home she discovered she is in a worst situation - it's not a safe place at all: she either needs to put out or be homeless or be on the guard from a man who doesn't take no for an answer- every woman worst nightmare, and she isn't even 18. So her all childhood she was either in unstable condition or in constant threat of sexual violence - it doesn't have to be a rape in the ally, it can be constant bullying if you don't go on 'dates'. So you ruined what was left of her childhood, and now complaining she is a broken person, and again demanding she should become homeless because she didn't put out - because why only ruin a childhood if you can ruin her adulthood as well for not putting out. You are the problem. Jen could have flourished, you could have flourished, but you trapped her and your family life in your little control fantasy, taking her childhood and stability out of her life, living her more broken - childhood is when your foundation is built, you are a more rocky person if your foundation weren't built stable - and she got a second chance at stability (a miracle), and you took it from her.\n\nYou need to forgive her? No no no. She needs to forgive *you* for something that is unforgivable.\n\n\"and I held true to my word and I haven’t visited since.\" - Good. Every visit from you would just send her down another spiral your parents would have to deal with.\n\nSEEL THERAPY. You were 15 then but you're not 15 anymore. Grow up and learn from your mistakes instead of being a sexual predator.", "YTA. You can’t hold what she did at 14 against her. She was a kid in a very unstable home life. Your parents relationship with her isn’t about you. Grow up.", "YTA. Evaluate your life choices and perhaps think on seeing a therapist to help you get over 1 date...", "Sometimes things don’t work out. I think you need to let the past go, but you also don’t have to do something you’re uncomfortable with.\n\nWith that said, if you want to burn this bridge and you’re fine with it, go ahead, but you may not have a family to turn to in the future should you ever need anything, including help. You’re sabotaging yourself here, and you may end up losing your family over it.\n\nYTA.", "YTA. Obviously, there was something seriously bad going on in her life. I understand why you would feel out of your element when she probably wasn’t in a place to share the reality of her life. But, you have a chance now to grow as a person and accept that your parents are trying to throw Jen a life preserver. Take pride in your parents- they are good people.", "YTA\n\nShe had already a tough childhood, to the point she couldn't live in her own home. You asked her out at the age of 15, she didn't want to date you, so all your life you've harbored resentment for her. She couldn't live in her home at 15, so your parents took her in,but you bullied her to the point she had to leave from your home too. And now you're holding it against her, that she left your home because of your bullying at the age of 15. \n\nI hope your parents keep their promise to Jen and Jen keeps her side of the deal, too. And you need therapy to learn to deal with rejection, because how you deal with it is extremely unhealthy.", "You had to CONVINCE (harass) a girl to go on a date, she eventually did then advised she didn't want to go on anymore. So you 'didnt make it easy on her' (bullied/harassed her some more) You took away her safe place. But YOU  can't forgive HER for what she did??\n\n  Dude..... check yourself..... YTA. In fact, you're the reason young girls are scared.", "YTA and someone needs to call the cops on you", "Yta. And very icky.", "YTA - first, there is no 'breaking up' after one date. You went on a date and it didn't work out. By the sounds of it you didn't pick up on that so she had to spell it out to you and ended up avoiding you for a while. She didn't want to go on a date initially anyway, which should have been the end of that btw. She doesn't owe you anything. No is a complete sentence. You shouldn't ever 'convince' anyone to go on a date. Especially not someone who comes from an absuive relationship and probably doesn't know where else to go. \n\nAnd on top of that your parents said they saw her like a daughter. She came from a bad place. She didn't know where to go and came to your parents. I don't know what else happened, and yes all this might not be great but she needs help, preferably professional if your parents said she needs to go to therapy.   \nIf you can't get over rejection for so long then maybe it is for the best if you stay away. Because the only thing she ever did to you is rejecting you and not wanting a relationship. That is not something she needs to be forgiven for.", "So you harassed your 'friend' into a pity date and when she rejected you after said pity date you decided to attempt to remove the only real support system she has because your sensitive little feelings were hurt?\n\nGrow up mate and realise that she needs actual help and your parents, while not obligated, want to give her that help. If you are still holding a grudge for something that happened when you were 15 maybe you need professional help as well. \n\nYTA.", "Do you always pressure women in to going on dates with you and then make their lives difficult when they don’t want another date? YTA.", "What exactly can’t you forgive her for? Not having romantic feelings for you after you pressured her into going on a date? For leaving after you bullied her away? \n\nThis girl had a terrible home life, she found safety within your family (your parents reciprocated that love and basically adopted her into the family), and suddenly when you couldn’t pawn her into being with you, you made her life hell. So much so that YOU sent your parents to therapy. \n\nOP you sound like a classic bully who turns into a toddler when they don’t get what they want. Quit manipulating people to the point where it’s affecting other peoples relationships and well being. \n\nYTA.", "YTA and it is not your problem how your parents treat her.  You sound jealous & still pissed 4 years later about a romance that YOU wanted didn't work out.", "Your parents went to therapy bc of you. \n\nYTA", "So, you were friends and \"convince her\" to go on a date and she didn't like you, and 7 years later you are still a resentful creep, YTA. The girl doesn't look like she make the best decisions either but I think you are less than a loss for you parents.", "YTA", "esh\n\nyou gotta get over it, but it's completely reasonable for you to not really have wanted to take on this girl's problems and your parents never really set good boundaries nor gave you a choice", "NTA you are entitled to the way you feel. Why your parents even bothered to ask your feelings in this only to disregard them I cannot fathom. So this is the result and now they have to live with it.", "\nEdit: Changed to YTA after reading comments. If her only flaw was leaving BECAUSE of you, yes YTA.\n\nThey have a right to do what they want in their house. \n\nYou have a right to not visit. \n\nYou’re also entitled to your own feelings. \n\nAlthough I do believe there’s info missing about why she broke up with you and why she left the house and how exactly you didn’t make it easy on her. Would help if you shared that - INFO Needed.", "NTA. She didn’t owe you a relationship but your family is your family. You told them they weren’t comfortable with her being there and they still took her in. You don’t have to be around her or then if you don’t want to.", "NAH. \n\nShe doesn't suck for being in an apparently shitty situation. \n\nIt's their house, they can house whoever they want.\n\nYou don't have to interact with her if you don't want to.", "[deleted]", "NTA\n\nJust as you are not entitled to a romantic relationship with this girl, she is not entitled to your platonic company. You are setting healthy boundaries. Rejection stings and you need space to heal. And it's okay for you to need a long time to get over it; young love is the most difficult to move on from.\n\nYour parents have made their choices. They choose a stranger in need over their spurned son. I'm not saying they made a bad choice, but they need to grow up and accept the consequences of their actions. They can't expect their life to be a fairy tale when they choose sides.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI was best friends with Jen from preschool through 9th grade. Her home life was was pretty rough and she practically lived at my house. My parents called her the daughter they never had. \n\nWhen we were in 9th grade, I asked her out. It took some convincing but she eventually said yes. She broke up with me over text the day after our date. She barely went to school, didn’t text, and wasn’t at my house at all the next few weeks. \n\nShe eventually showed up at my house in the middle of the night. My parents took her in no questions asked then she left in the middle of the night a few weeks later. I admit I didn’t love having her around and didn’t make it easy on her but her leaving was hard on everybody. My parents had to go to therapy. \n\nLast year I moved out for college but I was still planning on coming to visit. A few months after I moved out, Jen showed up at my parents house pregnant and with a baby. They took her in again then called me and my brothers asking how we feel about her staying with them. My brothers were ok with it but I can’t forgive her for what she did a few years ago. \n\nMy parents let her stay anyways but said they had conditions on her staying with them like her going to therapy and either enrolling in college or getting a job. I told them I still wasn’t okay with it. We argued a bit and I told them I wouldn’t visit if she was living there.  \n\nShe’s still there and I held true to my word and I haven’t visited since. They’re trying to get me to come for Christmas but I won’t be there if Jen is living there. \n\nThey’re calling me petty and saying I need to forgive her but I think I have a right to be upset.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Dude, what? There's so many holes in this story it could be Swiss cheese. \nINFO: \n•What do you mean when you say that you had to \"convince\" her to go on a date with you?\n\n•How long did this \"convincing\" take? \n\n•What happened on this 1 date? \n\n•What did you do to her while she lived with you? \n\n•What are you actually pissed off about? That she didn't want to date you? It sounds like you were pissed when she moved in, and then you were pissed that she left. What is your actual issue with this girl?", "YTA, and I think Jen and your parents should be upset with *you*. After all, if you wouldn’t have acted the way you did, this situation wouldn’t be here in the first place.", "YTA.", "YTA, first for pressuring her into going out with you, secondly for then ruining your friendship when she didn’t fall madly in love with you, again for ruining her safe haven over your pathetic broken heart, and lastly for trying to force your family (who sound awesome btw) to cast her out because her not wanting to fuck you is somehow her wronging you. You’re not the asshole you’re four of them.", "YTA,  your parents have been through alot.  But your still putting them through more. You blame her for them going to therapy,  but the real reason they went to therapy is because of what YOU did. That caused thier pain. And yet you blame her. Your still causing your parents more pain. It seems to me that you have.....The preferred word to describe someone who doesn’t care about others’ feelings is “disregard.” We use it to show that someone has no care or respect for anything else that other people might feel. Even when presented with others’ feelings, they’ll often ignore them.\nThis I believe is you. You do not care about anyone else but you.", "YTA. \n\nIf I were your parents, I’d choose her too.", "You caused the initial dynamic by harassing her. You took away her safe place and people, which is likely why she left in the middle of the night. You are the one whose behavior in the past requires forgiveness, not her. YTA for asking them to kick out another person they love because you can't accept rejection.", "YTA\n\nYou harassed her into dating you, she didn’t like it, and broke up with you over text because you’d proven you’re not safe. You didn’t respect her “no”. \n\nThen, you made her uncomfortable in the house because you’re petty, and this poor kid who escaped a bad home life had to leave again to escape YOU.\n\nYou’re a bully.", "Your replies in the comments are not helping you. So yucky, ew. You need therapy bud.", "Pray tell how do any of these responses make sense to the question asked. In fact he is staying away from his victim would make him NTA as by the biased responses he is the devil incarnate! The confusion that him not going home when she is there makes him an arsehole!", "NTA", "YTA This sounds so pathetic that it’s embarrassing. What kind of grudge is this? She didn’t want you romantically (not then and not now) even after you bullied her into a date and then bullied her after for revenge in hurting your feelings that you were pushing onto her. You were a bad friend and a bad date. You need to move on and get a grip. Honestly if I was your parents or brothers I would ignore you until you got over yourself and stopped being petty, selfish and acting like you’re a victim.", "YTA You bullied a girl into dating you. She lived in your house and you made her feel unsafe. So she had to leave. Somehow you still think she did something bad to you.\n\nShe was keeping her distance to be save and to not lead you on. \n\nWhen she came back you bullied her for rejecting you. \n\nAnd now you make the whole thing about you.", "YTA\n\nyou're not the victim.", "You were 15. YTA. Have you not had a date since than?", "YTA when are you going to start taking responsibilities for your actions! You harassed her by pressuring her to go out with you. You made it uncomfortable for her to be in the house so she left because she didn't know how else to take it at that age. You made it difficult for her again when she decided to come back so she left again. Stop acting like she did all this out of the blue, you were the cause of it. Man up and accept your role in this entire ordeal.", "YTA. \"After some convincing\" \"I didn't make it easy on her\" nice guy™ vibes. Sounds like an easy choice on your parents part.", "ESH... Years ago you tried to date and it didn't go well that's a bummer and you should forgive her for that.\n\nShe sucks because he is clearly running to your family any time shit goes bad.\n\nYour parents suck because they won't draw any boundaries with her and seem to be open to being taken advantage of.", "Nta", "Thank you!", "Not only that but put her in an extremely uncomfortable position because not only did Jen probably value their friendship she also seemed to rely on OP’s parents an awful lot. \n\nBy turning him down Jen risked not having a safe place to stay.", "OP sounds like such a nice guy! Why wouldn't she date him? /s", "Add what is probably more than a dash of jealousy that she has a baby from another man, rather than holding on for the fairy tale romance with OP", "It also makes wonder what he did during that single date to make her avoid him for weeks like that. I hope I’m wrong but it sounds like he tried to do things to her she did not consent to.", "She put my family through a lot but still expects them to pick up the pieces whenever she fucks up.", "[removed]", "OP is still unquestionably the asshole, but it read to me like what Jen did that he's mad about was run away from his house, which somehow put OP's parents into therapy. Since she left because he was bullying her, OP's at fault for that, too. (Maybe I'm giving OP too much credit for caring about his parents?)", "[removed]", "Especially when \"what she did\" was just not wanting to be with an incel asshole.", "Ops parents asked for their feelings, probably in the hope that OP had grown up and realised they were holding a ridiculous grudge.\n\nNothing about ops incel manifesto comes off as remotely balanced or reasonable", "Let me guess, you are also an incel like OP.", "She went on one single date because op bullied her into it. They were not actually dating", "There wasn't a \"break up\". OP pressured her into going on ONE date with him. She did and didn't want to date him afterwards.", "I mean the women and the parents seems happy enough, so all the decent people are doing okay.", "How TF is knowing someone from the time they were 6YEARS OLD \"essentially a stranger\"?", "OP wouldn't know health relationship boundaries if they punched him in the face. But we can agree that he should stay the fuck away from this women, and probably all other decent people for that matter.", "Stranger? Theyve known Jen since she was probably 5 or 6 years old", "It doesn't sound like Jen actually wants OP as a 'platonic company'. Jen ran away from OP's home at the age of 15 due to OP's bullying, even though her homelife was obviously really bad. And she's hardly a 'stranger', they've known her since she was 6 years old, the parents call her the daughter they never had. That's not a stranger.", "Forgive what exactly? \"I forgive you for bruising my ego\"? What's wrong with coming back with reliable people in her life? Why the parents suck for helping someone they know?", "Yeah she’s always run to them when anything happens", "She isn't your ex, she's your harassment victim. You sound like an incel asshole.", "What has she done? You said your parents needed to attend therapy, so I’m curious what her unforgivable actions against the family are?", "She was a kid with a bad home life whom you romantically coerced and then bullied when your parents gave her a chance at safety and stability. 99% chance you’re a big part of why she left in the middle of the night.", "That’s called deflecting.\n\nYour post is about you feeling rejected at 14/15 and using that to make a young woman and baby homeless. YTA\n\nSince ninth grade - She has more of a relationship with your parents than you, and they feel care for her to the point they went to therapy and keep trying to help her. That’s kind and generous. \n\nDon’t look for tangents to make this sound bad on Jen. Clearly she had issues growing up and your parents knowingly want to help - not your business. And imho trying to tell anyone to be unkind cause you’re butthurt about a date in HS is bothersome beyond AH/not…it’s deeply troubling.\n\nLast guy I was sure I wouldn’t date was cause he used to ask me if he should be kind to friends and family. I couldn’t be with someone who needed reasons to be kind when it didn’t cost him at all to be kind. He never got it, and I’d imagine you wouldn’t have either.\n\nI hope you see it now. And I’m glad your parents don’t act (unkindly) based on your deeply held teenage angst.", "Gross. She was a kid you harassed into  a date, didn't want to go out after the one date, and you harassed her afterward. She has a bad family so when she rejected you, suddenly she's not allowed to have help? Grow up man. Let go. Or don't and stay away.", "And if you had gotten a chance with her this wouldn't be a problem? Would you rather she stay in an unsafe situation? Buy some salve for your bruised little ego and get over it.", "[removed]", "He cares about his parents but refuses tk acknowledge that the blame lies with him ultimately for bullying poor Jen into feeling she needed to leave in the middle of the night.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "How does she suck for going to someone for comfort that she trusted? OP even said his parents thought of her as a daughter and she didn’t have a good home life. \n\nHow are his parents being taken advantage of? Only things she did according to OP is not date him and leave in the middle of the night.", "She left in the middle of the night without a note or anything. All of her stuff was still at the house so my parents actually thought she was kidnapped at first. I also have a feeling that she stole some money but we don’t talk about that", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "She left because YOU treated her like crap. You said it yourself. How are you even blaming her for that? Would you want to stay at a place where someone’s constantly harassing you in some way? I know I wouldn’t.", "She put them through a lot, hey? By leaving in the middle of the night to get away from you when you \"didn't make it easy on her\"?\n\nIt's pretty clear that you don't see your obvious role in all this. The YTA flags are obvious to the rest of us.\n\nPerhaps you, also, should have joined your parents in therapy back then. It's not too late though, you could still go.", "yeah seems pretty clear why she ditched out….", "I'm getting incel vibes from OP.", "YTA. Youre upset because she broke up with you. When you asked her out, it seems like she wasnt on board so you had to \"convince\" her to give you an opportunity. Why couldnt you accept she didnt want you in that way INSTEAD OF TRYING TO CONVINCE (BULLY/FORCE) HER HAND? You ruined that friendship the moment you couldnt accept no for an answer. Now she needs help and you want the family to push her away. Way to be an AH.", "The incel force is strong with OP. YTA. Your parents are good people, their lives would likely be easier if they weren't but they still try do the right thing. You aren't making your family choose between you or her, you are choosing pettiness and ego over the family.", "YTA. Incel.\n\nShe didn't broke up with you, she said no after ONE date you forced onto her.", "YTA you bullied her into a date, bullied her out of your home once and now are trying to bully her again. You need to grow up and maybe go to therapy yourself", "YTA - \n\n>It took some convincing \n\nSo she said no and you didn’t take that no and kept pressing her and pressing her until she said yes\n\nYou realise since she spent so much time at your house, she probably felt forced to say yes otherwise you would stop her coming over right?\n\nDude you need therapy, it was years ago, you were what, 15?  It’s time to let it go, she didn’t even do anything wrong, she just didn’t want to date you anymore \n\nAnd you made her time at your house horrible enough she left in the middle of the night\n\nYou need therapy, like real therapy", "Yta", "She is not your ex..she is a girl you went on a date with. The only relationship in this situation is your parents love for this girl who they look at like a daughter. YTA.", "YTA. Do your parents know what you did to Jen? They would be so disappointed… And she didn’t “break up” with you, you forced her to a date she didn’t want and when she refused to see you again because she felt uncomfortable you took it out on her. You sound insufferable.", "YTA Just grow up.", "So your parents adopted a daughter and disowned a son, there I improved your title, YTA.  Two birds one stone good for your parents.", "YTA. You’re holding a grudge from your teenage years because this girl didn’t want to date you. Your parents have forgiven her so please stop suggesting that’s where your resentment comes from. Have you tried therapy?", "YTA- I know you also were a kid when the coercion occurred, I’m sorry you didn’t know better, no means no, and while your parents seem wonderful, they missed teaching an important rule to at least one of their sons… unfortunately it impacted someone else a lot. But, you’re an adult now so there is no more excuses. Grow up and move on. And it’s probably best you stay away, Jen deserves to feel safe for once in her life too.", "YTA. I would get banned if I explained this further.", "YTA 100% you badgered her into a date until she said yes just to stop you asking. She was never that into. She's not your ex. It was one unwanted date. Get over yourself. This girl clearly needs some help and for whatever reason her own parents aren't there for her. Your parents are stepping up because it's the right thing to do.", "yta. \nYour parents are only allowed to help her if there is some pussy in it for you? for real?\n I am insanely proud of your parents though for being the good people they clearly are and helping her in spite of their son making it very difficult for them.", "YTA- you got rejected when you were in grade NINE and you’re still holding on to that??? And she’s obviously in a dire, dire situation- try to find some compassion, my dude.", "YTA.  She's not an \"ex\", she a girl you bullied into going on one date with you when you were a teenager.  Your parents obviously saw her as an adopted daughter, and your \"romantic\" relationship with her should have no bearing on that.  Kudos to your parents for helping her out and taking her in when no one else would.", "YTA\n\n1 - You 'convinced' her to date you. If someone needs convincing, it's because they don't want to and you're just pressuring them. She probably viewed you as family since she lived with you and your own parents viewed her as a daughter. So you bullied your pseudo-sister into one date. AH points awarded here.\n\n2 - She didn't 'break up' with you. You weren't dating. You went on a single date. Then because you made her so uncomfortable and were so pushy, she left. Perfectly reasonable and entirely your fault. More AH points.\n\n3 - When she felt safe enough to come back, you bullied her again and 'didn't make it easy'. I imagine that hide the full extent of how you treated her. Then she left again because your house was no longer safe. Again, perfectly reasonable and entirely your fault. Even more AH points.\n\n4 - You are throwing a hissy fit because, after enough time to heal from what YOU put her through, she finally reconnects with people who were essentially her parents. She didn't put you or your family through anything, you did. Double AH points.\n\nYou bullied her into going on a date, made her safe space uncomfortable, bullied her when she got back and now you're upset that your parents are siding with her over you. You need help if you can't see why you're the AH. You pushed her into a date (why? Can you not accept no? Do you think you're entitled to it because you were nice to her? Maybe examine these feelings), then got upset that she left (you ruined her safe space, you were pushy. Why are you upset when she sets boundaries with you?) then bullied her for rejecting you when she returned (she didn't want to be there in the first place. You made her uncomfortable. Maybe learn more about the word 'no'), then finally, instead of being glad that your parents could connect with her again after you pushed her away (because you did. Would she have left if you hadn't pushed her to date you and bullied her when she returned? Who's fault is it really?), you're now upset that they don't choose they're creepy, pushy, can't-respect-boundaries-or-consent, bully of a son.", "From the title, I assumed you were NTA because I've been through something similar (so I thought) with my own mother. Was in a severely physical and emotionally abusive relationship and went to my mother for help getting out. She then turned around and contacted him behind my back, apologizing to him for me being dramatic, and telling him everything I said to her. It was devastating to me that she took his side over her own daughter. \n\nThen, after said assumption, I read your actual post. Holy fuck knuckle YTA.", "YTA dude. Your parents sound like incredibly lovely and caring people. Thank goodness Jen has such genuine love around her. She did not want to date you… you were kids. You need to move on and apologise to your parents", "So teenage you took advantage of your vulnerable friend by pressuring her into going out with you? Then when she broke up with you after the date she never wanted in the first place you bullied her? You continued to make her life miserable until she couldn't handle it anymore and ran away? Now that she's come back to your parents - apparently the only adults who ever cared for her - you've chucked your toys out of the pram and refuse to go see them while they're helping what is clearly a struggling young woman?\n\nDid I get that all right?\n\nYTA.\n\nI bet you think you're a Nice Guy too.", "YTA", "You say you are angry and unforgiving bcs of what she did to your parents. Are you entirely honest here? Also if your parents could forgive her so should you. Be the better person. \n\nAlso, if that’s not the reason but it’s got something to do with your bruised ego: this is an extremely unhealthy mindset. Do you generally feel anybody owes you dating/friendship/attention/sex? Don’t be this person. Look into getting help.\n\nYTA", "YTA. And Jen is NOT your ex. You went on one date. You never had a relationship other than friendship— which YOU ruined when YOU developed romantic feelings. She never returned those feelings. She had a great second family from age 3/4 to high school, and you ruined it.", "\n years ago you had a super close friend. She was basically family your parents were her rock.\n\nYou kept asking her out she just wanted to be friends but  you wouldn't leave her alone \" took some convincing\" so she said yes.\n\nThe date that she DIDN'T wanna go on shockingly didn't go well. She pulled away to give you some space and probally by sounds of you because you were being a D. She came back in the middle of the night to stay with your parents after some kinda of trauma ( a teenager needing a place to stay in the  middle of the night is clearly in a bad way )  by your own words you made it hard on her ( again because she didn't want to date you) which drove her away. This crushed your family because they love her.\n\nWithout any support she went on to struggle and got pregnant she came back to your parents for help as they are probally the only people I'm her life she can count on.\n\nYOU are now wondering if you are the A for refusing to viset your parents and emotionally blackmailing them because they love a girl EVEN THOUGH SHE DOESN'T WANNA SLEEP WITH YOU??\n\nAlso referring to her as your ex / friend is delotional you went on one date in high school that your coersed her into that's not an ex \nYTA\n\n\nPlease note for the future woman don't owe you their bodies.", "YTA. Let it go man and move on. She didn’t do anything to you but not like you back and you’re being a huge brat about it", "She didn't want to date you.   You insisted and forced the issue and \"convinced her\".  Then after a single date she def knows she doesn't want to be more than friends, and you spend YEARS Butthurt???\n\nGet over yourself.   Now.   Apologize.  Get some bloody therapy yourself.  And stop acting entitled to someone.   Grow up.  \n\nYTA.", "You were never her friend. YTA.", "YTA this is about more than you. Take a step back and look.", "YTA so it sounds like you pressured her to go on a date with you and didn't like the date, so she called it quits. It sounds like you made her uncomfortable and you're holding that against her?", "Yta. This is not ok. I'm sorry being rejected was so difficult for you. Your inability to get over it is indicative of a larger problem. Please explore that in therapy. Personality disorders are no joke", "This is such an odd reaction to me. you got all hissy over a single date that you refused to take no for.\nShe isn't your ex , not after one date, and you were a bully. Bully by a friend and you wonder why she left. 😒\n\n\nYTA", "YTA. You made this poor girls life hell because she doesn’t want to date you and now are throwing out ultimatums to your family about it. You have some serious growing up to do.", "YTA. She is not your ex. You went on one date when you were children. What she “did to you” was having autonomy and telling you the truth about not wanting to go out again. Women are allowed to not want to go out with you. It’s up to you how to process that in a healthy way and move on.", "YTA and an incel. Your parents sound amazing", "Ew, you are a morally dubious creep and YTA.", "YTA\n\nYou need professional help, but most of all, you need to grow up", "YTA. She isn’t your “ex”. One date is not a romantic relationship. You said it took some convincing, so it sounds like you coerced her. She probably felt obligated since she was staying at your parent’s house. You sound seriously entitled here. I’d chose her over you too.", "YTA.  Here's a tip...she didn't want the first date either.  Get over yourself.", "This was painful to read, YTA.", "YTA. You’re trying to push this girl out of the only loving family she’s ever known all because she didn’t want to date you when you were teenagers. Get a grip. \n\nThe fact she ‘took some convincing’ and the fact you haven’t even reflected on that over the years is very telling. She didn’t want that sort of relationship with you and I can’t imagine how uncomfortable and upset she must have been being forced to choose between dating someone she probably saw more like a brother, or losing her found family because you’re be such an asshole about her autonomy. You never should have put her in that position and not taking no for an answer is abhorrent. You were kids yet still punishing her for what was essentially your bad in the first place? It’s weird and bitter. ‘Didn’t make it easy for her’? Wtf dude, why? You were the AH then and you’re the AH now.\n\nIt sounds like Jen is family in all but blood and has been since she was a kid, let her and your parents be. Maybe there’s some jealousy around your parents loving and accepting her, maybe you’re still hung up on a rejection you deserved and should have absolutely moved on from by now. Either way, you need to realise the world does not revolve around you, so get some perspective and give out some big apologies. Stop making others lives miserable for your own fucked up reasons, and if you can’t do that then leave them alone and get ready to spend your life bitter and lonely with only yourself to blame.", "YTA! \nShe never wanted to go out with you and she isn’t your ex. Get over yourself and grow up dude.", "YTA.", "Stick to your threat and don't go. I'm positive everybody will have a better time without you in attendance, especially Jen. YTA.", "NTA it’s your family not hers. Not great behavior as a teen on your part but sadly we ALL do things we are not proud of. If they want you there then they have a choice to make and they can’t force you if you’re not comfortable or don’t want to go.", "You are definitely the asshole, YTA.\n\nBUT, it's not because you are asking your parents to choose.", "She's not even your ex??? You barely had one date ffs. Obviously YTA , she is living at your parents' house and it is their choice who they let in, you have zero say. Who knows what kind of home life she had growing up and who knows what she's been through.  Have a little empathy and grow up.", "For what SHE did!? YTA.\n\nEdit: i'm sorry if this breaks rules but...you had to \"convince\" her to go out with you?  Because she lived there she's fair game?  A simple \"no thank you\" should suffice...this actually makes me angry, \"finally convinced her\" that actually means relentless begging. Pathetic and selfish. She had (possibly) a chance for a stable home and your ego effed it up. I am disgusted.", "It was one date, how is that breaking up with you?Your reaction to all of this seems extreme over what is again one date.\n\nSo other than this girl's life being a dumpster fire and you having nice parents, what is the real story?", "Let me get this straight. You asked out your friend….pressured her in to saying yes….she then broke it off after one date (because she saw you as a friend, never more than that)….and you’re punishing her. \n\nYTA and you come off as extremely immature and childish.", "YTA.", "YTA, you need to move on", "YTA. Honestly, stay away from that house anyway. She’s obviously been through enough and even when she was in a safe space with your parents, she got bullied by you. You were both kids when the event happened for which you “can’t forgive her”. Grow tf up, apologize, and stay away from her.", "yta. You harassed her until she thought she had to say yes.  You took away her safe space and then you punished her for being harassed by being an asshat.  There is nothing for you to forgive her for,  You over stepped.  She didn't wanna date you.", "YTA. You pressured this girl, who was already vulnerable, into going on a date with you. Then it sounds like she felt unsafe in the new home your parents were trying to give her, so she left. She needed a safe place and you ruined that for her.\n\nIt sounds to me like YOU need to apologize to your parents. Do they know what happened? Did you tell them that you basically forced this girl to go out with you, and it was only after this that she left? If you haven’t told them that, why? Is it because you think your actions will reflect badly on you?", "This guy's such an asshole he used up all the asshole in the world and now nobody else can be an asshole  \n\n\nCongratulations, you've cornered the market", "You went on ONE date when you were kids, and she did NOTHING to deceive or harm you, so, yes, YTA.", "Was the therapist your parents used good? Did they help? If so you should schedule an appointment because you got some major issues. YTA.", "She never wanted to date you and you pressured her. YTA", "YTA but it also sounds like jen is using your family for their money. Sucks that your family is getting swindled.", "YTA.", "You clearly need some explanation as to why you're a really huge AH so let's go in order:\n\n- you'd been friends with this girl for a looooot of years.\n- she'd been relying on your family cause her home life was a disaster.\n- you developed feelings (I guess) and she didn't and you had to convince her -wtf dude- to go out with you when all she probably wanted was her best friend's support for her difficult life.\n- she rejected you and you admittedly made her miserable when she showed up at your parents' house in clear need of help.\n\nAnd now, after all those years you're still mad that she left in the middle of the night, probably because of you, and she \"sent your parents to therapy\"?\n\nJust admit you're still hung up on her rejection and move on, you're an adult now for god's sake.", "You forgot the part where OP \"didn't love having her around and didn't make it easy on her\", meaning that OP took a home life that could potentially have been stable and safe for a girl whose original home life seems anything but and turned it into a living hell for her. All because she turned down a second date after having been bullied into a first one.  \n\n\nOP, I disagree with your family. You don't need to forgive anything, because you have nothing to forgive. She did nothing wrong. What you need to do is beg and grovel and pray for forgiveness from both her and your family for everything *you've* done to make this girl's life a living hell. If you can't do that, keep staying away - it's better for everyone, especially that poor girl.", "There’s missing info here, which is what he texted/said back, or did to her, after she refused a second date. Whatever he did scared her enough to try and stay away until she was desperate enough to return to his parents. \n\nHard YTA.", "And asking her out made her using a safe space (sounds like the only one she really has) conditional on going out with him. That's really gross.", "YTA- what is it that she did that you can’t forgive? I’m very confused.", "We all know she said yes, because she was staying at OP’s parent’s house. I like his parents but OP, not so much.", "This is all true and this why shouldnt she be at his parents house living with them.", "I second this. One date, that's all. She wasn't interested, but you can't move on from that? Grow up.", "Yeah he put that poor girl in such an awkward position, (parents should have stepped in, and taken that off the table) and now he’s acting all bitter and calling her his ex after one date ? \n\nThat is not a good look at all.", "That's a very good question, wonder if OP will sit back and reflect on some comments here cause he needs to have a reality check.", "Can we even call it a date if one person was harassed into going? I’m going to call it a “harassment hangout”.  This incel definitely needs therapy after the harassment hangout that happened YEARS ago.", "I’m betting she disappeared because of how uncomfortable OP made her feel after she rejected his advances.  \n\nOP is the one who created the issues, not Jen. If anyone should be apologizing, it’s him.", "YTA\nI sense some exaggeration here, but I could be entirely wrong. And if she does fuck up a lot it's probably due to her horrible upbringing during her formative years where she missed out on a hell of a lot of proper parenting, if she got any at. She's obviously had nobody other than your family to model how to parent her own child.  How fortunate you came from a family that was loving enough to care for a kid that was not their own. Are there perhaps jealousy issues?\n\n As far as the rejection, you seriously need to get over it. We've all been rejected, cheated on, dumped, some left at the altar.  And we've all managed to get over it in our own ways and times. But your time is LONG over. \n\nThis is the most overused comment on Reddit, but in this case I think it's spot on. Go see a therapist. It can make or break your family and get to the root of your issues with this girl.\n\nIt sounds like YOU'RE the one making your parents choose between you and her.", "Your going to have to be more specific.  What we see is a girl looking for safety, that was driven away by a horny boy.  So she sought safety elsewhere.", "No, she didn't. Your parents were adults then and are adults now and are therefore entirely capable of deciding for themselves whether they were willing to take on the responsibility they've taken on. You're just salty as hell because because she didn't want to date you. The fact that you're brooding heavily over this like a b-movie villain years and years later proves she made the right decision in that situation.", "So just like any child with their parent, they’re there to support her regardless of the situation. You’re not her ex and she owed you nothing. Imagine being so self centred and entitled. Your parents have forgiven her and moved on. Build a bridge dude.", "I guess if she was banging you like you so desperately want, she wouldn’t be an issue.", "It sounds like you’re the reason she left so maybe if you would have never coerced her into dating you your family wouldn’t have had to go through a lot from her leaving.", "You put her through a lot, until she felt that she needed to leave and couldn't face saying why. All through what sounds like a really difficult and unstable time when an actual friend should have been supporting her. You have a chance to actually vaguely redeem yourself and be an adult but you're pissing that away too.", "YOU put your family through a lot. Everything that happened was because YOU pressured her into a date and made things hard for her. YOU are the reason she left. YOU fucked up. The only one who should be apologizing is YOU. YTA", "They, unike you, actually care about her. They're not just looking to get laid, they care about her as a person and are willing to help her when she needs it. Your family are good people. You, are not.", "Nice Guy ™", "r/niceguys", "This.  This.  This.", "That’s a pretty big jump.", "Yeah as much as I feel for Jen... she needs to find an actual stable situation. Even without the date part, stay with your newborn in the house of your former friend and by that indirectly causing a rift in the family is not gonna end well for her - is not her fault, but by \"picking her side\" it comes expectations and strings that even with all the best intentions from OPs parents I don't think will do any good. \n\n\nIs easier said than done, but the sooner she finds a place to herself the better will be for her and the baby.", "EXACTLY! \n\nOP definitely YTA", "Your username is cringe. She was never and will never be your ex. I’m embarrassed for you.", "i’m assuming you do the same, since you’re clearly super entitled. why do only you deserve her parents love? everybody in that house belongs to you huh?", "Because she has no one else to turn to. Who would you turn to if your life fell apart? She runs to them because they are safe, because they care about her and because they don’t abuse her like her family obviously did. Do you really begrudge a homeless pregnant woman with a small child a safe place to get back on her feet? Like think it through, objectively. YTA", "Yeah a 9th grader not going to school for weeks then showing up at a friend's house in the middle of the night?\n\nSomething was really, really wrong at home.  And his parents took her in because they recognized that.  If they've known her since preschool they've probably tried to be a stabilizing force for her for her whole life.\n\nThis poor kid.  Her safe haven was taken from her too by OP harassing her.", "Besides the vibe, nothing identifies op as a dude.", "Not necessarily. \nI’m not talking about brutal assault but seeing how he pressured her to date him and how she had to get away from him after 1 date, you gotta wonder if he didn’t try to force her into things she was not comfortable with.\nOP is clearly not the type of guy who can take no for an answer. The fact that he’s still that resentful and spiteful after all this time speaks volume.\nIt was only one date that she clearly was coerced into accepting and he calls her his ex.\nThe guy is delusional.", "I’m glad I found this because as I read everything I kept thinking “how bad is her home life that she keeps going back to OP’s house?”. I’d hardly call the home of a guy who pressured me into dating safe and stable.", "You realize this is domestic abuse victim behavior?", "Because she didn’t know how to tell the only caring supportive adults in her life that their son was sexually harassing her, so she left, before you escalated from harassment into abuse. You made her feel unsafe in the only safe place she had, and she chose to protect your reputation with your family. She didn’t put your parents through anything, you put your parents through a lot AND are continuing to do so by giving them grief for welcoming her back. Want to help your parents? Don’t go home for Christmas, but do send them a copy of this, surely you want them to understand your side of this and you explain it so eloquently here it really would be a shame for them to miss out on reading it. They’ll be so so proud of the man they raised.", "You need to rewrite the post and probably look for another subreddit. \n\nShe didn't do anything to you (her saying no to you is absolutely fine). In this comment you are claiming that she hurt your parents and is a bad influence on their lives. \n\nIf you really believe this you should talk to them about it. Still not sure why that means you wouldn't be willing to see her.\n\nIt just feels like there is a lot of information missing....", "She left in the middle of the night because you made staying there hell all because she wouldn’t date you", "She was a child with a terrible home life whose only safe space and people was your home and your family until you wanted to date her. That then made the entire situation uncomfortable, distressing and maybe even dangerous for her (just going off how angry, unreasonable and unforgiving you are still after growing up), so much so that she ran off leaving every thing behind. \n\nYTA. It's no doubt taken her a lot to ask for this help. Grow up. Let your parents take her in, apologize to her and go to therapy and try to be a better human being.", "Okay, listen up: you say they consider Jen their daughter, right? Well, when she left, she wasn't just a rude house guest, she was their child. They lost a child, that night.\n\nFor most parents, that would be absolutely devastating. And a lot of parents who do go through this, they never get a chance to see that child alive again.\n\nYour parents are lucky in that regard. They got to see her again. They got to know she's alive. They got a chance to make sure she stays alive and leads a good life.\n\nI implore you to consider: do you really wish that the immense relief and joy your parents are feeling at her safe return would turn into the same anger and resentment you have? Are your feelings of hurt really that important that you'd rather see them anxious and depressed, all over again, because they wouldn't know whether she was safe or not?", "You do realize she left because of you? Probably one of the only people she thought she could trust turned out to just be using her because he was attracted to her. I’m betting she realized your home was no longer safe when you were there. \n\nOP, you are the one who created the problem and are the one who should be apologizing", "OP’s parents call Jen “the daughter they never had”, so I think it’s safe to assume OP is their son", "OP said his parents referred to her as the \"daughter they never had,\" so I think it's safe to assume they only had boys.", "\"Nice guy\" doesn't really refer to what is between a person's legs.", "I'm not an english speaker so I really don't know, but isn't \"Guy\" and \"Dude\" gender neutral?", "If I called all first dates that I went on that didn’t result in a second date my ‘ex’ I’d have a good 50 or so ex partners. \n\nOP is being not-so-passive aggressive and making life difficult for everyone. YTA 100%", "Exactly what I thought. I wonder if she left not saying anything to the parents because she didn’t know how/want to explain that their son was giving her shit while she was there.\n\nEdit: typos", "Or this is the most positive OP could portray themselves and still doesn’t have a leg to stand on.", "English is weird. One guy is a male. \"You guys\" could be a combination of males and females, or even all females. A dude is a male, but my daughter and I actually call each other Dude sometimes... 🤷‍♀️", "English is weird and we use words outside of their actual meaning sometimes. “Guy” and “dude” mean male, but colloquially we use them gender neutrally in some situations. “Guys” is often gender neutral when addressing a group like “do you guys want to go to the movies?” “Dude” can be gender neutral when addressing someone “oh my god dude did you see that?” When describing a person to others, both “guy” and “dude” pretty much refer to male only, “going out with the guys” or like the commenter said “OP is a dude” both mean that the group/individual is all male. At least that’s my attempt at an explanation… lol.", "It depends on the context. If I say “some dude is messaging me”, that means a man. Same with “guy”. \n\nSometimes I will call my girl friends dude- like “omg dude look at this”.", "Dude is 100% gender neutral[https://media4.giphy.com/media/BK9aaiEzi1BUA/giphy.webp?cid=6c09b952b76736c67163b7c038b3e2866aeb74c63b1bccdd&rid=giphy.webp&ct=g](https://media4.giphy.com/media/BK9aaiEzi1BUA/giphy.webp?cid=6c09b952b76736c67163b7c038b3e2866aeb74c63b1bccdd&rid=giphy.webp&ct=g)", "Dude and guy both originally meant masculine, but in English you used to default to the masculine if gender was unknown so sometimes you might call a woman one of those terms. \n\nAs gender identity has become more of a well known thing and the default has shifted to more gender neutral terms dude has shifted meaning to be more gender neutral. Guy is still typically masculine.", "Yep.", "We’re way passed that."]}