{"id": 5192, "submission_id": "zql3ac", "title": "AITA for not answering my coworker's calls and messages during lunch and after hours?", "selftext": "My coworker has been calling and messaging when they know I'm taking my lunch and when I'm done for the day. When this happens and I see the notification, I don't answer anymore. I handed in my 2 weeks yesterday morning and I'm so over this place from burnout.\n\nMy coworker's messages all start with \"Hi\" or \"Are you available to call?\" with no context on what it entails. They never elaborate on their issue after that. They just go straight into calling me despite me not replying. Sometimes they don't even ask if I'm available and call me out of the blue.\n\nMy coworker said I was rude for not answering her calls and messages and that they all would have been very quick to address. She said because I was training her to take over my responsibilities, I should be more responsive and ensure that she learns everything before I leave. Since we don't have much time, I have to be more obliging and more of a team-player.\n\nMy other coworkers heard what happened and are saying that because I used to always go above and beyond and help everyone, I should continue doing that until I leave.\n\nContext: I used to do OT every day and whenever people reached out to me after my day was done, I would answer. This sort of expectation was set from the start when I was reprimanded for leaving on time during my training period. My manager said I \"wasn't a team-player\". This meant staying back an extra 3+ hours a day and responding to emails and messages on PTO.\n\nMy coworker is struggling to take over my responsibilities and has a lot of questions to ask but I don't want to answer then during my lunch break and after hours. AITA?\n\nEdit: I would be compensated after hours at a regular rate but not my lunch break.", "created_utc": 1671532365, "permalink": "/r/AmItheAsshole/comments/zql3ac/aita_for_not_answering_my_coworkers_calls_and/", "score": 671, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for not answering my coworker because they won't be getting all the help they could and they are currently struggling with the work\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \nYou aren't obliged to answer the calls. You are leaving because of burnout. Your employer should be training them and available for calls during  your downtime. Forward her calls to the boss.", "NTA, don't worry about this. What are they going to do, sack you. Just do your hours and if you have a leaving interview, let it all go there.", "NTA.  If you're not at work, you don't need to answer.  Period.", "NTA. If you aren't being paid you don't have to work.", "NTA. If your lunch breaks are unpaid, that is your time. Your job gets your attention for the majority of your daylight hours. During your break, you don’t exist to them (unless you want to, which like, weird). Put your phone in Do Not Disturb or turn it off entirely, feel the sun on your face, eat a bagel. I believe in you", "NTA... many people have an unhealthy relationship with work, and your coworker sounds like one of them...\n\nNone of this is your problem, especially now that you're leaving... and she shouldn't be stressing so much about this, its not her fault/problem either... its managements problem...", "NTA. I’m the only person currently in my department. I still don’t answer calls during my lunch or after my set work hours. If I’m doing OT that’s for me not for others", "NTA, they should respect your time more.", "Clearly nta, they can’t expect that. Just keep it this way. You owe them nothing", "Hard NTA\n\nIf you're not on the clock, you're not obliged to respond. Your soon-to-be-former workplace set toxic expectations and you're done meeting them. Good for you! I hope your next job respects your time more.", "NTA, if they expect you to work through lunch or after hours they need to get your agreement and compensate you accordingly.", "NTA, it’s your unpaid time you do what you want with it", "NTA - you don’t work for free. And you don’t need to answer work related phone calls or emails off the clock. \n\nDuring work hours,  maybe you should put together a training manual and hand it off to her. This way she’ll have a written reference to consult.", "Hard NTA\n\nAnd start your next job by NEVER TAKING CALLS OR EMAILS OUTSIDE OF WORK HOURS. \n\nTbh I have taken calls and emails outside of hours, but I was paid lots of money and it came with the turf. But I also had no push notifications so I never saw the emails, I had to open them if I felt like it! But again, I was paid a lot of money and only did it a bit. I had a life!", "Of course you're NTA.", "NTA - If you ain't being paid during lunch and outside of work hours then they can suck it - mute your phone, leave it in the car, fling it out the window.\n\nIf anyone approaches you during lunch then simply say \"I'm on lunch\", and if anyone feels obliged to be concerned, then they can help the new person.\n\nThey ever heard of work life balance?", "NTA", "Nta unless you're being paid overtime to work during your lunch break or after hours.\n\nYou're paid for your time.", "DEFINITELY NTA well this is just ridiculous you didn't have to do overtime and I am hoping you claimed for it. Now you choose not yo do overtime and they expect you to be available on your free time. You are contracted for a certain amount of hours if she cannot ask you the questions within your working hours I would be concerned about ger time management skills.\nHer lack of planning is not your emergency.", "NTA. Why aren’t they contacting you during work hours?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy coworker has been calling and messaging when they know I'm taking my lunch and when I'm done for the day. When this happens and I see the notification, I don't answer anymore. I handed in my 2 weeks yesterday morning and I'm so over this place from burnout. \n\nMy coworker's messages all start with \"Hi\" or \"Are you available to call?\" with no context on what it entails. They never elaborate on their issue after that. They just go straight into calling me despite me not replying. Sometimes they don't even ask if I'm available and call me out of the blue.  \n\nMy coworker said I was rude for not answering her calls and messages and that they all would have been very quick to address. She said because I was training her to take over my responsibilities, I should be more responsive and ensure that she learns everything before I leave. Since we don't have much time, I have to be more obliging and more of a team-player. \n\nMy other coworkers heard what happened and are saying that because I used to always go above and beyond and help everyone, I should continue doing that until I leave.\n\nContext: I used to do OT every day and whenever people reached out to me after my day was done, I would answer. This sort of expectation was set from the start when I was reprimanded for leaving on time during my training period. My manager said I \"wasn't a team-player\". This meant staying back an extra 3+ hours a day and responding to emails and messages on PTO.\n\nMy coworker is struggling to take over my responsibilities and has a lot of questions to ask but I don't want to answer then during my lunch break and after hours. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\nAt all.\nThis expectation that employees be available at all times... must stop.\n\nYou just clearly tell her. .. \"that is one of the reasons i resigned. You can do what you wish to do. But me? I am not available in my lunch break or out of hours... And that is how it is\"", "NTA\n\nAnswering work-related calls is work.  Work needs to be paid.  If you don't get paid, you don't have to work.  Simple as that.", "NTA. I'm glad you found a different job. This place sounds shitty. Are you the only person there who knows how to do your job? Either way, when you are off the clock you have no obligation to respond to anything. If they want you to be on-call, they should pay you to be on-call.", "NTA\n\nIdk where you are but where I am from we are not allowed to give any bad job references. We confirm start date and end date of employment and that's it. Check the laws in your area. Also we aren't legally obligated to work out notice period its just a courtesy. Just saying.", "NTA Ever notice being a \"team player\" doesn't go the other way. Set boundaries and maintain them.", "NTA. My line manager knows she can call and text me before work incase it is important for the day, evening not so much friendly yes! I think the workplace has boundary issues.", "NTA, you handed in your two weeks notice so they are free to demand whatever, but you are NOT on their team and what not. You are not obliged to do any work, including taking calls after hours or on your break.", "Even if you didn’t resign, there’s no obligation for you to answer calls on break or after work.\nNow that you’ve resigned you shouldn’t give a single flying fuck. If you were to drop dead tomorrow, the job will still get done by someone next in line.  \nDon’t burn anymore for a lost cause and give yourself some time to relax within those two weeks :) \nObvious NTA verdict for good measure", "NTA but you need to set a clear expectation with your boss and coworker about when you WILL make yourself available. \n\nIt may also help your coworker to hear that setting boundaries with the job is important to succeed in the role.", "NTA.  Your lunch breaks and time off are yours.  Too bad for the company that they didn't recognize that sooner.\n\nTo be totally fair, going that far above and beyond is not a good idea because it sets you up as a \"dedicated\" worker (read: someone who can be loaded up even more) which is bad in the long run because it creates an unbalanced workload on the team and then burnout.  That's not to say that you should never do anything extra at your next job, just be more careful that you don't end up being the \"dedicated\" \"responsible one.\"", "NTA\n\n&#x200B;\n\nYOU are right. Work during work hours, and block him outside of those.", "NTA going \"above and beyond\" is starting to look like wage theft. If it's \"small\" like this person said, it can't wait until you get back? \n\nUnless they want the same things happening to them on their lunch break, they should cut it out.", "NTA.\n\nThat's YOUR time. Advise the coworker to write down their questions so that they can be addressed while you're on the clock.  Tell them that this expectation of you working on your off time is part of the reason you're leaving and you're not going to go along with such a ridiculous expectation anymore.", "NTA.  I am my company's trainer/go-to/fount of wisdom(ha!) And one of the things that is understood is that if I am in the break room at lunch, my time is my own and questions can wait.  I also have \"zone of silence\" times where no one is allowed to interrupt me as I am hyper-focused on a project (short of fire or flood)\n\nI had to draw those hard lines but I was fortunate to have an employer who values me enough to respect those boundaries and enforces them. It isn't always perfect but it works for the most part \n\nYou weren't so fortunate.  Hopefully your next employer does better, but be sure to advocate for yourself.", "NTA. I hate it even when people just write “Hi” during work hours and just wait for me to respond when they want something. \n\nThe job never respected your time and you’re leaving anyway. Not your problem anymore (but depends if you want to burn all the bridges during your last two weeks).", "NTA\n\nWho cares what they think? You're leaving in 2 weeks and you'll never have to see those people again. You don't owe them anything. Especially when you are off the clock.\n\nIf you are leaving because you are burnt out, they didn't care for you very well. That environment sounds super toxic. The \"team player\" bs is just a way to manipulate you into doing more.", "NTA! Boundaries and self care (in other words, a lunch break!!) are very important to your mental health and well being. There is life outside of the job.", "NTA & check your local employment laws; if you're being forced to perform job duties during your lunch or on PTO then your local law may stipulate you must be compensated. Your trainee should be documenting their questions when you're unavailable & asking you when you are available. Stop being a team player & let them get used to you not being there; next you'll be posting how they call you after your last day to ask you questions about your job.", "NTA. You don’t owe her your free time but be generous and buy her a small lined note pad and tell her to write down all of her questions and “we will address them the next time we are working together”.  Who cares if these people think you’re an a-hole, you’ll be leaving soon.  Best of luck in your future endeavors!", "NTA\n\nYou have no obligation to work when you are not being paid for it.\n\nUnfortunately your workplace are now discovering the consequences of their actions after over working and taking advantage of you.\n\nDoes this mean you coworker is going to have a harder time taking over than if you put in the extra hours? Sure, but they would be having an even harder time if you had just quit outright, or were off for other reasons like illness. It turns out that maybe they should have been cross training their staff earlier just in case of a problem...\n\nWelcome to the cycle of the poorly managed business - sit back and watch as your replacement goes through exactly the same issues as you have before handing in her notice and doing exactly the same.", "My boss assigned me to train them and instructed me to do everything I could to make sure she can take over my work. My coworker said she might have to go to our boss to tell her how I'm not being a team-player.", "I'm worried this would affect my future job search if prospective employers ever call this place. My coworker said she might go to our boss to talk about my recent behavior.", "I would be compensated if I worked OT but not for my lunch break. Except now I just want to leave at regular hours.", "I have put together many detailed training manuals for her. She didn't think it was enough and wanted to record training, which I'm not comfortable with but I obliged. She's still struggling to take over (not a new hire).", "I plan on setting that expectation at my next job. I am paid if I work after hours, but only at a regular rate.", "I would be paid after hours but not during my lunch break. Would that make me TA?", "Your last sentence gave me a laugh. This is exactly what they did to employees who left.", "You aren't required to \"be a team player\" when you aren't at work. Work to live, don't live to work! I would jave cut that overtime and phones calls during non-working hours out right away. Can you afford to leave work earlier than your two weeks? Because if you can, it might be worth telling your boss you feel a flu coming on and might not be back to work before your notice is worked and he will have to train her himself. Your boss doesn't own you, you only work for him. Your life is your own.", "Guess what, you don't have to be a team player anymore.", "You are already on a notice period and leaving, presumably have a new job or plan. Let them. Who cares? If they’re going to give you a bad reference for this, they always were, because they’re just that toxic. No one expects a leaving employee on notice to “go above and beyond”. Most folks are pretty happy if you train anyone at all, keep up your work reasonably, and don’t sabotage stuff on your way out.", "So what? If the boss comes to you, tell them that you gave a 2 week notice as a courtesy, BECAUSE you're a team player but if they can't appreciate that, you can be done right now.", "I think training your replacement is kind of shitty since they can't seem to take care of you in the fiest place. Whack", "Sounds like they deserve each other", "What does she think your boss is gonna do, fire you from a job you already quit causing her to go from 2 weeks of training to none?", "You already put in your two weeks, what are they going to do to you?", "I'm not sure how wide ranging this rule is but I think in some areas the questions to past employers are really basic now because of situations like this.", "Wait...you don't already have a job to replace the one you're leaving?!  \n\nThat's unwise.", "You coworker sounds like an AH. Can you : have you explained to them why you are leaving, ie your burnout? Why can’t they save their questions for office hours?", "You already have a new job so that isn’t really relevant", "You are not being unreasonable. Do you have a HR person / department you can talk to?", "Then it’s not your problem to consult with her when you’re off clock. It’s your boss’s problem for putting someone in the position that sounds like she can’t handle. You should ask them if they’re so rah-rah team player why aren’t they stepping up to the team. Why are you expected to give up your time without compensation? \n\nWhat are they gonna do? Fire you? You already quit.", "Yeah except no one considers a call or an email working after hours. \n\nMake them pay you \n\nMine used to just give me extra time off. So I guess I did get paid. Lol\n\nGood luck", "After hours the yeah, they're paying for your time.", "Unfortunately, I can't afford to leave work earlier. My boss also has impossible standards because he makes us work while we're sick. It's part of \"being a team player\". In reality, it's because my boss cannot do our job and assigned me to train because he doesn't know how to train at all.", "This really depends on the company.  In the US, most large companies refuse to answer questions about previous employees other than dates of employment and final salary.  However, I do still hear about hiring companies asking very intrusive questions and this seems like the place that would try to blackball a former employee.", "I think OP was referring to the next job after the job she is leaving her current job for.", "I don't think it's my problem either since I'm leaving. My only concern is in the future, if any prospective employers call my former employer, they would not recommend me.\n\nAlso I would be compensated if I work OT (not during lunch) but I don't want to stay past regular hours.", "But they're not obligated to work overtime, especially if they're suffering from burnout.", "That's very unfortunate. Does your boss know that you can't afford to leave early? Because if he doesn't then you can tell him you will leave early if she doesn't stop calling you after work and during your break. You don't owe your boss anything, he clearly doesn't care about you at all.", "Then why is he the boss? You did the right thing by leaving such an embarrassing company", "They don't own you. If the boss can't do your job then you hold all the power here.  Because if you choose to be done today, that puts THEM in a bind.  Not the other way around.  \n\nYou could always offer to start at your new job sooner.", "NTA, but do you have any written documentation and guides on how to do your work? I know the feeling of being the only one who can do something and having to hand it over to someone else. It helps to have written stuff that they can be directed to. Technically with only 2 weeks notice you should really be almost coasting - at the beginning of two weeks giving your replacement the written guides and any access she needs, work through training demo with her and making her do practice herself, she should review the written stuff in time when she's not being directly trained, and the remainder of the two weeks she's doing the work while you just answer any questions not covered by the documentation or correct her, while you tidy up loose ends.  Depending on the job some of those questions might be time sensitive, but if they are, instead of messaging you to ask if she can call, she can more easily message you the question for you to identify if it's urgent or not \nand respond or ignore accordingly. This is where a culture of overworking affects everyone, if your coworker is also being expected to work overtime and through lunches it means she's trying to get things done and questions answered during times when you aren't available, so puts pressure on you to work those same times. The issue compounds itself.\n\nSet your boundaries, and stick to it. Explain to your coworker why you are doing this, that it's not an attempt to sabotage her, but you can't do this anymore. What are they going to do? Fire you?", "If you stay long enough at the next job, this previous job won't even matter that much.  The AH supervisor may not even be employed there at that point anymore, or the company may not continue to exist.", "You can always say you worked there but that it's not okay to call them.\n\nMany HR departments have a rule that they only verify that you were an employee and for how long.  Nothing more than that.  Because it opens them up to lawsuits if they defame you.\n\nOf course I'm not sure where you're from, but I was personal friends with HR at a former job and that was their policy.  To verify employment and length of employment. Nothing more.", "Right, but if they are working overtime then they should be working. If they're not working overtime then they shouldn't answer working calls.", "I do. I created many detailed written documentation and guides on how to do my work. I also recorded training videos (even though I am uncomfortable with the idea). The questions she asks are in the documentation which I have told her.", "I'm not working overtime. This always happens when I decide to leave during regular hours. People would reach out to me at 5:01pm.", "If you have no system to instant get an hour overtime for answering a work call after hours then never answer a work call after hours. You're exchanging your time for money- that's every job - if they are not paying you, they don't get your time, not a singular second.", "Let this be a lesson for all. You think you're doing great at \"team playing\" or being a good little worker and they don't reward you, they just expect the same grind, with the same pay. If you burn out, suddenly you're performing \"below your abilities\" or disrespecting the team.\nNTA. Stand up for yourself.", "If you don't,  what are they going to do? Fire you?\n\nNTA", "NTA, this is a *really* toxic work environment here. Your nonchalant boss wants to make sure everybody here is a “team-player”, but do you know what every good team has? A leader. I’m glad you’re getting out of there", "Dont worry and stay firm. \nWork your contracted hours and leave.\nHow about they be a team player and honour the contract they signed or, if they think they need you for more than originally thought, let’s renegotiate the contract. \nYou can’t agree on something and change your side of things afterwards!!", "NTA, talk to her though.  Tell her you have learned the hard way that you need a decompression time during work.  Lunch is yours.  Suggest she adopt that also.  You will help, but you need her to respect your break.  If she continues to ignore your boundary, ignore her calls, you’ll be out of there soon.", "NTA - respond when you are on the clock. No harm, no foul.", "NTA.  I no longer respond to calls, texts, or emails while at lunch or after I am off work.  If they pay me then different story.   I kinda want to reply..”At the sound of the tone you will be left all alone”.", "NTA you didn't sell your soul to them and maybe this just confirms your good to go. Best wishes for the new job.", "Nta. It is illegal to work off the clock.  You’re doing the right thing.", "Nta. It is illegal to work off the clock.  You’re doing the right thing.", "No that's not how it works anywhere. You put that notice in and the expectation is that you do the bare ass minimum as a courtesy then leave. \n\nYou don't go above and beyond for the place that burned you out. You shouldn't even be hitting the expected minimums for those 2 weeks.", "Nta.  Your time is yourmtime after end of your shift", "NTA. \"No I am not available for a call.\"", "NTA. You don't have to answer during lunch or when not on the clock. Doesn't matter if you've done it in the past. You're fine.", "NTA direct all questions to your boss. They should be a team player.\n\n“Trainee, you can ask me questions during such-and-such time. Part of being a team player is *you* taking the ball sometimes and not always throwing it at me, especially when I’m not in the game at the moment.”\n\n“Boss, here is a question you’d be best suited to answer.”\n\nScrew ‘em. The all-too-common useless lazy manager.", "What are they going to do?  Fire you?!?  LOL\n\nI'd start leaving 5 minutes early just to fuck with them even more.\n\nNTA", "NTA... what team? You're done :))", "NTA my current boss constantly texts after hours and weekends and it's burning me out. I'm salary but I don't make much money so it is really stressing me out! I think you can just send a note straight to the boss that the person you are training is not grasping the job and due to the many messages after hours and on your break you will only help her during work hours.\nI used to type up a document when I leave a job with a detailed instruction and list of job duties with links to locations of files or anything they need. I always send to boss and any replacement . You can do that too.", "Why can't these people send an email? You can answer it after your lunch or when you have a minute. NTA, but the people taking over for you need to get used to you not being there.", "Hey my old bosses did this to me too! You’ve handed your resignation, yes? It’s a bit tricky because you still want a good recommendation from them and don’t want to burn all bridges but clearly they’re trying to squeeze every single thing from you before you leave. \n\nI think it requires some strategy. Show extreme enthusiasm when handing over your stuff or teaching the new person. Spend your working time maybe writing short note forms on some of the must do’s and send them out via email and make sure the upper management know about it (you can cc them). Look super positive and motivated. \n\nThen during lunch, loudly and confidently announce how you’re trying to run some errands you’ve been meaning to do forever but haven’t because of the workload you’ve had previously. But mention how you’ll be back after lunch to answer any and all questions.\n\nWhen people text you to ask you if you’re free for a call etc, respond with “sorry, I’m currently tied up  with something but will answer any of your questions when I’m back in the office at x time” or “sorry, driving now”. Then don’t respond anymore. The point is, you’re not ignoring them. You’re just tied up. What can they do? \n\nWhen you’re back in the office, look apologetic and go “oh man, I’m so sorry, I was in the post office and it was my turn when you wanted to call me” (or make some other excuses). “I’m here now, how can I help you!”\n\nYou have… 2 weeks of notice? It’s not a long time and hopefully there’s just a few more days left.\n\nYes, this is office politics, but you have to get what you want too and take care of yourself. You obviously don’t want to break your back working for them anymore but at the same time you’ll want a good reference letter just in case. So you’ve got to keep up appearances. Best of luck! \n\nNTA.", "I don’t think so. I think because they’ve seen you go out of your way and above your responsibilities in your role. It is now expected of you. However what you do in your own time, you do not get paid for. & unfortunately you do not need to respond during those times. You’re not being unreasonable. \nThey just need to find answers elsewhere or wait for you upon your return.", "If it’s a quick thing that can be answered, then coworker should include it in the message so you can determine if it is quick, if to respond right away, if to continue ignoring.\n\nYou’re leaving because of the intolerable expectations on your time so…they’re going to expect even more from you during your last two weeks? Ha. NTA", "NTA work is for work hours. You aren’t obligated to go above and beyond.", "NTA  \n\n\nYou gotta leave work at work, not at home. Otherwise, you are being taken advantage of. It's your coworkers' problem if they wanna be, not yours.", "NTA - if they aren't paying you, you aren't working. what are they gonna do if you don't fully train your replacement? fire you?", "NTA. If you are doing work related things, you should be paid for it. I would sit down with the coworker who is taking over your responsibilities (while you are both being paid) and make sure they understand what to do though.", "NTA and you need to tell this coworker “I will answer any and all of your questions during regular work hours, and *plan* that anything that comes up during lunch or after hours will have to wait until the next day. It would also help if you just put your question in the text or email instead of asking if I can talk first. Also. I realize you are adapting to a new position, but I suggest you also set limits around your own availability so that you don’t burn out like I did.”", "NTA. It’s your time, not the company’s.", "NTA coworkers are not friends.", "NTA I put my work phone in flight mode when I'm on break or after hours. You can also set up that it sends a reply to any calls that you're not available. \n\nYour coworks get their answer and you're not bothered during your break. Works wonderfully.\n\nAs for your coworker: just set up a meeting time and he can prepare all his questions in advance and you go over them. During working hours of course.", "NTA\n\nYou said you were leaving because of burnout. I can only imagine how bad this place is. They clearly expect you to work when you are \"off the clock\" and on your own time. Bullying you with \"not a team player\" is bullshit and should be called \"making you work for free\"\n\nThe only thing I would advise would be to tell everyone you are available for anything they need between 9-5 or whatever your hours are, that's it, no more, no less. Remind them there is a reason you are leaving this job and you'd really appreciate if they could be team players and make your last 2 weeks go smoothly!", "NTA.\n\nIf you're not on the clock, you are on your own time", "NTA.  You've given your notice.  You're done. D O N E.  She needs to call her new supervisor with these questions.", "NTA. Wonder why you got burnout in that environment…", "NTA. \n\nBut you not answering calls is a sudden change for them. You're not obligated to take calls on break or outside regular hours. But until recently you were, and now you're suddenly not.  Have you actually told your coworker that you will only be available during X to Y hours and won't be accepting calls outside of that time frame? A simple *hey, I'm happy to answer your questions, but I'm no longer working for free during lunch and no longer working over time. I work from whatever time to whatever time, so reach out during that time frame. Thanks.* should get the message across. After you say that, yeah, feel free to ignore calls and remind them of your hours with your return their call (during working hours).", "“I am not available during off hours. Let’s schedule a meeting to go over any remaining questions or concerns you have. Can you put together a proactive list of questions we can address during that scheduled time” \n\nNTA", "Agree and from the sounds of it feels like the employer should hire **two** people for the role\n\nNeeding 3 plus extra hours every day to complete the workload clearly shows that the workload is just too much for a single person", "NTA- they realize this crappy behavior of theirs is why you decided to leave right?\n\nYeah they drove you off the team- you’re leaving. You’re quitting the team and they need to use this time to figure out how to manage without you. It’s not your job to train your replacement when you’re in the midst of freaking quitting.\n\nNo wonder you’re leaving.\n\nNTA- I wouldn’t do anything but the bare minimum of what you are required and even that I don’t know…I mean what are they gonna do, fire you?\n\nGood luck op, I’m sure wherever you end up working next will be better.", "It really does burn you out. I hope things get better for you! I actually already sent my document with detailed instructions and locations when I sent my notice. I tell her to refer to that but she's still not grasping the job. My boss knows this.", "Honestly what's he going to do... Fire you?\n\nYou are already leaving just grit your teeth and tell your coworkers they are more than welcome to pick up the slack.\n\nLeave that place, walk out that door with your head held high and both middle fingers even higher...", "I think your boss is likely to be the real asshole here, and is making your colleague into another one. You are leaving because you are burnt out and they deflect by saying you don't do enough. Hell, you've clearly done too much over the time you've been there to be in the current status, screw them", "So what if your coworker does tell the boss that you are not a team player.  You are leaving \"the team\".  This company doesn't own you.  The boss doesn't own you.  You don't owe your coworker your time on demand.", "Let her. You handed your notice. This guilt tripping cannot work for you anymore.", ">My coworker said she might have to go to our boss to tell her how I'm not being a team-player.\n\nWell what are they going to do ? Fire you ?\n\nIt's your down time, you're living you have no obligations to be a \"team player\" . I'm not from the US so it's true I don't know that mentality too much but I got burnet out when I was yuonger working totally illegal hours. You need to rest. Work on your time and that's it.", "At this point do you really care if your coworker tattles to your boss?  There is a reason you are leaving, and joining another team.  Set the boundary but not interrupting your unpaid lunch break.", "Who cares? You’re leaving. She can complain all she wants.", "What is your manager going to do? Fire you? NTA.", "So? What's he going to do, fire you?", "And what’s your boss gonna do? Fire you? Screw that. Let her.", "That isn’t your problem. It’s the company’s.", "What is he going to do about it, fire you?\n\nYou’re not answering calls because you’re not working and you don’t have a job where you’re expected and compensated to be oncall all the time, simple as that. It’s not a life or death emergency. They’ll be fine. And your coworkers should set an example and set their own boundaries", "Sounds like the \"not a team player\" mentality from the boss is exactly why you should go.\n\nTHEY need to train and ensure their new employee can handle the job responsibilities. Don't be manipulated by the company's failed inadequacy", "So? Working through your lunch and evening? Not part of the ‘all’ you ‘can do’.", "Oh no, you're not a team player with a team you have decided to leave because of how shitty they are. However will you live with yourself? Let her tell the boss. You're not slacking, you are doing everything you can and that is what you can, to work during work hours and leave when they end. It can't be done during work hours? Tough luck, they should've thought of that when they signed your contract with a 2 weeks notice. Or when you were getting a burn out because they can't structure their department properly. \n\nThey're just guilt tripping you with something they think is important to you. It shouldn't be important anymore. Keep reminding yourself there is a reason you chose to leave this company and your duty is first and foremost to your own well-being.", "My last 2 jobs didn't ask for references, and I'm not sure the job before those actually called my references. And legally speaking most employers don't say anything during a reference call past \"yes they worked here from x date to y date.\" Talking trash about a past employee can get employers into legal trouble. \n\nYou'll be fine. Do your bare minimum and leave with a smile. Your ex employer sounds very toxic. At this point they sound bitter so what does it matter if you piss em off now?", "Cut her off at the pass and go and talk to your boss yourself. Or email. Document everything.", "Since your boss is so toxic he would have something bad to say either way so just forget about them.", "Don’t  worry about that. They can’t ask about your performance. They can only confirm that you worked there when you said you did.", "Just leave. The boss can train her.", "During your exit interview let them know your fair market hourly rate for consultations & you'll be requiring payment upfront before assisting with their business needs after your last official day. See how well that goes over.", "Yes it does burn you out! I'd definitely mute her texts. Or reply with a copy of the doc and tell her the answer is in there . Time for her to help herself. \n\nGood luck on your new career", "NTA. I’m the only person currently in my department.", "> because he makes us work while we're sick\n\nno he cannot, grow a spine and just say no, what's he gonna do? fire you?", "\"hi, I am emailing you in response to questions a, b, and c. Please refer to the documentation and videos I have made, that we reviewed on dates x, y, and z. The materials are in [location].\"\n\nAnd CC your boss in this email. \n\nDon't be like me who forgot to do this and my replacement pretended I hadn't told them anything.\n\nWhen yo leave, send a separate email to boss, noting all the training you have done, where the files are, and what has been covered.\n\nCC HR and your bosses boss in that last email.", "Then tell her where to find it.  How does this person expect to do a job when she can't be bothered to view a video or find information you have documented?  Just leave this place already.  I know you say you can't afford it.  However, ot seems to be taking a toll on your mental health.", "I actually already sent an email to my boss noting where to find all the written guides and training after I gave my notice.", "Oh that's good that you've already done that.", "Coming from 2 years of severe nursing burnout from pandemic nursing....NTA \n\nI don't care what industry you are in; you are paid for a job. That salary is based off of a 40hr work week. A job that implies, expects, or demands more is essentially stealing from you because as you add hours to your week is lessens your hourly rate. \n\nIf your job is 9-5 m-f with a lunch.... then only work that 9-5 m-f .... turn off/ block ALL work related numbers when off the clock. Period. \n\n\"YOUR expectation does not alter MY availability\" \n\n\"My salary is modeled after a basic standard 40hr work week; if your expectation is more then those contractually agreed upon stipulations then we'll have to sit down and renegotiate my salary. Your hourly expectations ultimately alters my salary expectations. \"", "NTA NTA NTA. \n\nBlock her number. If she is not getting it then they better have a back up. Block", "\"Don't work when you're not being paid\" is also an important lesson to teach your coworker.  NTA", "NTA but honestly, what are they going to do? Fire you? You gave your two weeks. Put in your time and leave. Don’t answer your phone and stop caring so much.", "NTA.  They are the AH.  When the work day is over it is over.  People who are working on off hours should NOT send messages to people who are off.  That is rude.  It actually is the person working and sending messages that is creating a toxic work environment.", "You are absolutely NTA, but the question of how to effectively shut down these requests sounds like one you should send to Ask A Manager; you'll probably get more useful advice there than from AITA.", "NTA.  At this point - who cares what they think or what your boss thinks.  Do help during business hours but you are under no obligation to be a \"team player\" any longer and work any overtime or when you are off.\n\nIf this coworker runs to your boss to complain and your boss gives you a hard time, then I would just walk.  \n\nRemember, they need you way more than you need them.", "NTA... I reached my limits years ago. Now people know that I dont have my ringer on unless I'm expecting a call.  I check my phone when I have a moment and encourage people to text.", "I have a similar situation and what I do is set up an auto-reply. \"I'm on my lunch and will get back to you in about x minutes.\" Or after business hours. \"It's after business hours so if this issue isn't urgent I'll respond in the morning.\"\n\nIn my case I'm the emergency operations contact \nfor the business unit so I also do include my personal number as an emergency contact, but I've made sure to clearly communicate to my team what I consider an actual emergency (risk of or actual injury to people or critical equipment - emergency. Anything else - not emergency).", "In the US, there are literally laws regarding this. (Depending on if you’re hourly or exempt/salaried, of course.) My job makes us take annual trainings and one of them pertains to this issue. \n\nIf you’re hourly, you must be paid for all hours worked, even if they are outside of your scheduled working hours. Working includes answering texts or emails pertaining to your job. Your job must pay you for all hours worked, but you are subject to corrective action up to and including termination. \n\nYou’re NTA, and this is just nuts! Hope your next job is more life-friendly.", "NTA I am assuming you are an hourly employee, so when you punch out , you don't have to work unless compensated. . But if you are salary that changes everything and then  you should be answering calls and responding to emails.", "NTA you’re not on the clock you don’t owe them a phone call nor text", "Hardest NTA I can give. Ignore them all, do the barest minimum on the time you have left, or fuck all to compensate for all the times you've worked overtime, and try your hardest to set a healthy precedent on you new job. \n\nNo job/company is worth a burnout, and you deserve a healthy work/life balance! Best of luck", "NTA. You are training her. You’re showing her she’s not obligated to to work during lunch or after hours. That’s what caused you to be burned out. If she wants to go above and beyond that’s her choice, but others are required to do the same.", "NTA. Good riddance to that toxic work culture.", "NTA. When you are off the clock, that is your time - not the company's time, and they don't have rights to it. Them trying to manipulate and guilt you into overworking is disgusting, and that's great you have found another job. Ride out the remainder of the 2 weeks doing everything you can, while on the clock, to train your replacement. If they can't get fully trained in that time, that is not your problem. Reality is, they should have already had someone crosstrained anyway for if something happened to you, or you took a vacation.\n\nMake sure you set good boundaries from the start at your new job!", "NTA they're welcome to fire you if they don't like it.", "NTA..... what are they going to do? Fire you?", "NTA - You are not doing anything wrong. And I have been on both sides. It sucks to not know what to do and the only person who does is leaving. But that is not your fault, it's management.  You can only do what you can do, and like I have said in the past, when managers got angry over hiring a person late in the 2 weeks and getting upset for not over extending myself to train...\"Well, I can leave now\". The shock normally brings it down a couple notches.   \n\n\nUsing \"wasn't a team player\" as a way to guilt a person into working mass amounts of overtime, is just the worst. Sounds like that is the reason why you are leaving.", "NTA. Your (soon ex) boss/company is the problem and if you can afford\\* it, you could tell that your coworkers.\n\n\\* I guess most of your behaviour comes down to whether you need to keep a somewhat straight face to preserve future job chances at this or other companies. And that heavily depends on your country, sector, position, qualifictaion, etc.", "I'm being paid to be a team player.  If I'm not getting paid that stops!!!! (Even if it is because I don't want to work OT because I want quiet time off the job.)", "Nta, fuck em. The team player is manipulation used by shitty companies who are engag8ng in wage theft.", "Document, document, document.\n\nNTA", "It would be useful to know what country you’re from - but broadly NTA", "NTA. Train during hours, place her calls/texts on mute during lunch and after hours. And block her after you leave that place.", "NTA you're outta there.", "NTA - and a lot of people have stared putting up these types of boundaries- especially if not getting paid- was given the unfortunate name - quite quitting…", "NTA\n\nGreat way for the new person to address this is making a list of questions, concerns, needs when you are not available to address as soon as you are available. Training someone  to take over your responsibilities is a courtesy,  as is giving notice.  Your trainee needs to find additional resources for answers and needs for when you are gone.  No one should be reaching out to you outside of your stated hours.", "NTA. Be upfront about the issues with your current employer with the hiring managers at other positions you apply to. Don’t do extra OT and let your trainee complain all she wants to your STB former boss. Even if you were to grovel and snivel and do everything he wants you to do until the end of your employment there, he will still tank any reference call he gets on your behalf. People like that think you’re in the wrong for leaving under any circumstances. Knuckling under won’t save you, so don’t do it.", "If you are not being paid, ie lunch, you shouldn’t be working.  It’s a break for a reason:", "Nta. Jobs like that don't keep people long. If you're set for  8hrs between 9 and 5:30 then that's your hours. People need breaks to eat and reset and be able to go home and take care of themselves, family etc without work calling.", "NTA your trainee is learning WHY you are quiting. Let them learn it now, because it doesn't sound like your job wants to give a reasonable work load. Also, if you have a training binder they shouldn't be calling you.", "NTA.\nNo pay no work. After hours is after. Also, 2 weeks notice so what are they going to do, fire you?", "NTA. Once you are off the clock, you are off the clock. Don’t feel bad about not answering. In fact, I would let them know that you now have a recurring appointment right after work and won’t be able to check your phone or messages due to that. They don’t need to know that the appointment is you relaxing on your couch…", "NTA  \n\n\nyou are not getting payed, that means it is your time", "NTA, you should start putting together your consultant paperwork so it's ready to go once you leave, they're going to be calling.", "Lmao NTA, do these people not know that slavery is not legal? Good for you on leaving this horrendous place, knowing your worth and setting healthy boundaries is the way to go!", "NTA - When the day is over, it is over.  You are not responsible to answer their questions unless it was established you were working OT ahead of time", "NTA.  Once our work done, then it is done.  The idea of working PTO to do more work after hours is insane and has to be illegal.  They can either pay overtime or get over you leaving after your scheduled hours.  This behavior has led to your burn out.  You do not owe this company anything more than the basics since they have done nothing to show an appreciation for your efforts to date.", "Nta. This is why you are leaving.", "NTA OP, post this in r/antiwork as well.  When you start your new job, do not stay later than you have to, unless OT is paid time and a half or more.  Get a Google number and use that for any work related calls/messages for your new job.  Do not give out your personal number.  Now that you've handed in your notice, you owe nothing to anybody there.", "NTA. You’re leaving BECAUSE OF this behavior. You do not “owe” them anything, and you “owe” them even less since you’ve already handed in your two weeks. This is exit interview stuff now - “you should realize that you lost a trained employee, with all the associated expense and hassle, because you couldn’t curb this. You’re likely to lose my eventual replacement for the same reason.”", "NTA.\n\nPity you can't forward all of your co-worker's messages to your boss.", "Thank goodness you are leaving. This is the perfect example of a toxic workplace environment where everyone pressures and bullies their coworkers to work during their off hours and PTO and if you don’t you aren’t a “team player” or have a bad work ethic. You are absolutely not obligated to answer calls outside of work hours or on your lunch and frankly you shouldn’t be the only person that knows how to do your job if you are unable to train within a 2 week time frame as for most positions that is unrealistic. Do what you can, they will adjust when you are gone. Good luck at your new job!", "So what if she goes to your boss?  What are they going to do, fire you?  You've turned in your notice.  \n\nDon't know where you are but in the US, if you are paid hourly and your lunch is unpaid, she has no business bothering you during that time.  Same with calls/texts outside work hours.  I'd either restart my lunch break after every interruption until I had my full hour or I would put in for overtime.  Same for the after hours calls.  Then if you get called out about it, just innocently respond about the Department of Labor not being happy about the extra, non-compensated hours.  You are just trying to protect the company for an investigation of their labor practices, right?  (Sarcasm there!)", "So? I’m sure they already think you’re not a team player since you’ve quit the team. Do the bare minimum and live your best life. What are they gonna do, fire you? Then you get unemployment for the period between last day and new job.", "Teach her or what? Get in trouble, your leaving they can do nothing. Not a team player, say yes I am, I just don't play for your team\n\nNta", "That doesn’t include working outside of business hours. If she doesn’t pick up quickly or proficiently enough during her training time with you that’s not your problem", "What's your boss going to do? Fire you? You're already leaving.", "You have been a team player for long enough and its obvious your team/boss/etc didn't appreciate it. You're not being paid to be on call so work your regular shift and leave. You're done and its up to your boss to make sure the work can be done. \n\nDon't let them take advantage. You're leaving, you didn't and don't need to cater to that.", "At that point i would actively sabotage her training.", "You’re quitting the team, this threat of “you’re not a team player” is of zero consequence, it’s hilarious. Laugh at this then let it roll off like water from a duck’s back.\n\nYou’ve said you can’t afford to quit until your new job starts. Okay. Re-read your contract, do they owe you notice payment if they fire you? If yes, get fired, tell them you’re working contracted hours only and if they don’t like it they can fire you and pay you to leave! If they don’t pay notice for firing you, then what do you really owe them for working your notice in return? Probably nothing they can enforce if you walk away. Check local laws for if it’s illegal to withhold wages for time worked, then call your new job and ask if you can start early.\n\nOnce you’ve sorted yourself out, and I always advise sorting yourself out first, check with your conscience and decide if it’s worth telling the truth to your replacement. Keep it factual if you decide to do so.", "At the end of the two weeks, you're free. You don't need to be a team player anymore. You were the only one capable of training your replacement,  if not they wouldn't leave you to train her, why would they risk leaving the fresh meat with someone who is literally quitting because they can't take it anymore? They need you alot more than you need them.", ">My coworker said she might have to go to our boss to tell her how I'm not being a team-player.\n\nWhat's your boss going to do? Give you a bad evaluation in your next annual review? They can't even fire you because they need you to train your replacement. If your coworker threatens you with that again, say \"ok\" if you don't want to be confrontational, or laugh in their face if you're out of fucks.", "what are they going to do? Fire you?  LOL", "If you're not on the clock, your coworker can go ahead and say whatever she wants. Who cares at this point? You're checked out and you've put your notice in. If anything, get yourself fired so you can collect on unemployment. People are ridiculous, I would do exactly what you've been doing. Nta", "She's got 7.5 hours a day to ask these questions,  why do they come up when you are not working?", "Who cares if you're a team player on a team you've quit? You aren't a slave.", "i think i’m not mature enough to understand, but you’re quitting so why do they expect more than the minimum. that seems unrealistic", "Good thing that means diddly squat. You're leaving, what could they possibly do to you that you would care about if you refused?", "Lol honestly fuck that shit. What are they going to do, tell you to leave before your 2 weeks are up, thereby screwing themselves over further? I don't think so. Unless someone is dying, it can wait until after lunch.", "What are they gonna do… fire you?", "Being a team player only matters if you’re on the clock. If they want her trained for your role they need to have you do it during work hours and they need to take part in training her. I’d mute her number or block it in your position, expecting you do be at her beck and call is absolutely ridiculous, especially if you aren’t working during the times she reaches out.\n\nShe needs to learn some boundaries.", "Let her tattle. You've given your notice, what are they going to do? Fire you? I probably would've already told everyone at work that this kind of invasion into my personal time is exactly why I quit. NTA", "Train them in the time allotted, if it’s not enough let them know you can be hired as a consultant for X/hour after your last day of employment with them.", "If you are in the US you're fine because basically, all your former employer can do is verify dates of employment and whether or not you're rehirable (this won't matter for your next job it only would have mattered for your most recent job search.) If you are really worried just have a friend call, record the convo, and pretend they are a hiring manager if they talk shit you've got them by the balls.", "If you are asked for a reference, then make sure you to mention this and any reasonable employer/recruiter would absolutely understand. There is obviously a reason why you left this place, and in this case you are 100% right to do so, they sound truly horrible.", ">My coworker said she might go to our boss to talk about my recent behavior.\n\nThat type of threat doesn't really work when you have one foot out the door.", "I had that happen with one job. Even though I liked them, it wore thin pretty quick. I made sure to let them know that I wouldn't be able to answer any questions within working hours, no matter how urgent they thought it was (because new job), and after a while they got self sufficient. If you respond quickly, it'll always be easier (in their mind) to ask you than to look anything up themselves. \n\nNow, you already feel burned out so you might have to take a harder approach. Block their telephone numbers and let them know they can only contact you by email - then apply a filter that takes them out of your inbox so you choose when you want to look at the mails. Better yet, set up a disposable email account just for them. Any email that just says Hi goes in the bin - they have to write out the full description of the problem if they want your help. And definitely consider charging them for your time since you will no longer be a salaried employee - if they don't want to pay you, they clearly don't need your help enough to bother you when you don't work there anymore.", "If they are in the US they not supposed to be bothered while on a paid or unpaid break by law so, no they don’t have to respond.  If OP is asked why they didn’t respond just say they put their phone in DND while on break, as is their right. Let them bitch, they already gave notice.", "If they were team player they would have offered to learn what you", ">My other coworkers heard what happened and are saying that because I used to always go above and beyond and help everyone, I should continue doing that until I leave.\n\nBut this is why you are leaving. They don't seem to get it. What a toxic workplace. \n\nNTA", "You have leverage. \n\n“We have 2 options. I can train coworker during work hours, or you can say I’m not being a team player and let me go prior to my 2 weeks. You and I both understand how detrimental it will be to leave the department without adequate training, so of course my assumption is that you’d prefer me to continue to train during working hours.”", "That’s also kind of illegal in some places.", "> it's because my boss cannot do our job and assigned me to train because he doesn't know how to train at all\n\nThen be your own boss and offer to become a consultant for that training to happen.", ">In reality, it's because my boss cannot do our job and assigned me to train because he doesn't know how to train at all.\n\nYou have the power here. They need you.", "Gotta love living in a country where the norm is to be unionized.", "If your boss doesn't know what your job enrails and doesn't know how it should be done how do they know if you are doing it correctly?\n\nThe making you work whilst you're off sick is also illegal. That's your recovery time.\n\nIf they were team player they would have offered to learn what you do so they can support you when the workload is high with tight deadlines. Remind them they are not a team player as they've never bothered to do this.\n\nAny extra time work during any unpaid time should be reimbursed and that includes lunchtime if it is not a paid lunch (some places pay you for the lunchtime).", "Then you have the upper hand. You handed in your notice. Just ignore them. If anyone complains tell them to train the new hire instead, as doing what they asked is not \"being a team player\", it's \"willingly being enslaved\".", "You've already put in your two weeks' notice. He cannot train your replacement, so I doubt he'll \"fire\" you. Stick to your guns, don't answer that phone.", "I hope you get an exit interview! Also, you've already handed in your two weeks so your boss' standards have ceased to matter.", "You quit. You have already put in your two weeks. What are they going to do? Fire you?", "New employers will be really sympathetic if you bring this kind of thing up from the get go when they inevitably ask “why did you leave your last job?”\nIf you clearly explain valid reasons like this, it sets a really good precedent going forwards.", "And if you explain that you left the job due to not being respected on the job, and being forced to regularly work OT that you didn't want to work, they'll know what kind of working relationship you expect and decide whether or not you're a good fit for their company.", "Then you need to familiarise them with the magic words: RTFM", "OP: NTA. What are they going to do, fire you? You’ve already quit. When she tries this next, tell her “you have the documentation. I’m training you to be self-sufficient.”", "Exactly, I did this recently, I was just being honest at the time but it worked out really well, set a good standard from the start and stick to it. If they don’t hire you after that it’s because they do the same shit and you dodged a bullet.\n\nTo add, I left a job where I was getting irregular 4hr shifts, often being called in an hour before work, to total like 20 hours a week while being available 24/7. It was shit, and I said so. I now work 4 days 9 hours per day, regular shifts, for better money. Simply because I asked for it when I changed jobs, and I do actually put in solid work WHEN I’m on the clock which helps too.", "That’s the end of your responsibility right there and you are 1000% NTA for ghosting after doing all that and explaining your reasons. If they won’t hear you that’s on them. They’re going to miss you."]}