{"id": 5236, "submission_id": "zqzlr4", "title": "AITA for telling my MIL that she can rot?", "selftext": "My husband's (47M) family are very old school with the weird beliefs that women are meant to be mothers and stay at home and essentially serve their husband. I'm (26F) lucky that my husband doesn't believe in that at all, and I've been allowed to work for multiple years until I decided to leave work and be a SAHM. A few days ago, we were at my MIL’s house planning our Christmas dinner with a few other members of the family who had come to visit. MIL then asked me if I was going to make a small rice-based dish for my husband and his brother who literally will eat rice every single day and before I could say yes, my husband laughed and said no need, I think if she has to make rice one more day then she will drown me in basmati. He was laughing and it was obviously a joke, but I guess she didn't find it funny and said, “if she's a good wife she'll do what you want without complaining”. She was 100% serious. no one laughed and no one said anything, and we tried to change the topic.\n\nAbout an hour later I was talking to my SIL but when I turned to see my husband, I couldn't find him. So, I got up to look for him and I found him talking to his mom in the little room that they used for their office. She was talking very quietly but I heard her say “No. She is too spoiled, and she feels comfortable to insult you. Be a man and make her understand her position in your relationship.”. I was appalled and I walked in and asked what she was talking about, and she quickly went on a rant about how I was controlling my husband and making him less of a man. She then turned to my husband and said that he should take a stand. I got very upset and told her that she was an evil and disgusting person and that she was going to rot in hell for the way she thinks and the things that she says. She tried to argue back with me, but I had already turned and left. My husband was right behind me, and our entire ride home was silent and tense. I thought that my husband would fully agree with me but when we got into our bedroom, he said that he understands why I got angry, and he agrees that his mother was 100% wrong and the thing she was saying were messed up but that I shouldn't have said those things to her because she is old, and she was raised to think this way. I told him that her age is no excuse for saying what she did. He said “ok.” and left it at that but now I'm a bit confused. My SILs and BIL all agree with me, but my FIL is extremely upset. I know I'm right in my thought process, but should I not have said anything and just left it as it was?\n\n&#x200B;\n\nEdit: I just want to add that we are \"white\" and christian. This isn't a cultural thing. Im sorry if my post confused anyone.", "created_utc": 1671570192, "permalink": "/r/AmItheAsshole/comments/zqzlr4/aita_for_telling_my_mil_that_she_can_rot/", "score": 109, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be TAH because I could have kept my comments to myself due to her age and just distanced myself from her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Creepy af that your husband married a child, but at least he’s supportive. Generational differences do mean he’s more likely to let things like this slide.\n\nEdit: I retract any amount of praise I have for anyone here.", "NTA.\n\nHis mother is being abusive and manipulative towards your relationship. Your husband has been trained to enable and excuse her toxic behavior.\n\nYou should seriously question the red flags if he's not going to defend you.", "This is the perfect example of \"reactive abuse\", which is really just self-defense.\n\n- MIL pushes, husband attempts to deescalate.\n\n- MIL pushes again, and your husband pulls her aside.\n\n- MIL pushes AGAIN, and you react.\n\nEveryone tried to be nice about it at first, but when she didn't get the hint and **stop**, the reactions escalated.\n\nEverybody has their limits.\n\nIt sounds like your husband is just disappointed he couldn't deescalate the situation before it ended the way it did.\n\nNTA.\n\nYour MIL owes an apology to everyone for how she acted.", "NTA, just because someone is old doesn't give them the right to dictate terms of a relationship they are not part of. Its women like this who push other women into misery. Good job for standing up for yourself and saying what you wanted. Unless you are equal and bring something to the relationship, it becomes very one sided, controlled and toxic. Good that you got yourself a good husband who is onboard.", "NTA.  Old age is not an excuse for bad behavior.", "NTA\n\nMIL is out of line, and your husband should be sticking up for you against his family and letting them know what kind of behavior is acceptable.\n\nBut also, the fact that you were \"allowed\" to work makes my skin crawl. Are you sure your husband is really all that enlightened compared to his family?", "So OP was 19 when she married her 40 year old husband... A man she has known her whole life...\nFrom this post it sounds like your husband treats you well which is a relief but I would recommend OP does some research on grooming and how to watch out for power imbalances in relationships.", "Info - how long have you been with your husband?", ">and I've been allowed to work for multiple years\n\nIt's not the dark ages anymore, you shouldn't have to ask permission from your husband for anything.  \n\nNTA for telling her where to go. The further away the better.", "NTA.\n\nShe‘s a misogynistic AH and continued to provoke, discriminate and disrespect you. She sucks and got what was coming for her.\n\nFuck around and find out.", "NTA.\n\nAh, the ole, \"But she's set in her ways\" defense. It's crap. You can grow and become a better person at ANY AGE.\n\nDid you go over the top in your response (like the going to hell stuff)? Maybe a little, heat of the moment type stuff, but nothing I would call unprovoked. That may just be me and how I'd respond, so take that for what it's worth - I'm on your side here.", "Your MIL's views *obviously* suck (it will be hard to find anyone on here who disagrees with that). But the important thing is, your husband is on your side about that. He doesn't have the misogynistic expectations for your relationship that your MIL wants him to have. \n\nSo there was no reason to lash out. Your MIL's views aren't going to change. It would have been better to roll your eyes and ignore her rather than escalate the situation. That's why, even though ... well ... the friggin' patriarchy is the AH, I have to go with ESH.", "It’s interesting how MIL twisted a joke her son made into OP insulting him. Apparently, she didn’t even laugh about it - so how in the world was she offensive? It doesn’t make any sense.\n\nThere’s so much wrong with this family dynamic. Good luck, OP!", "ESH, (but I do understand your feelings.)  Perhaps saying hateful things to someone who has objectionable beliefs isn't the most productive way to address your differences of opinion.  You don't get to call someone a bad person for saying things you don't like when you yourself say even worse things to them.  I think it's good to discuss her stupid, outdated ideas, but only in mature and rational ways that won't, at least from her perspective, prove her accusations. Because that's exactly what you did--she accused you of being a terrible, disrespectful brat who only does and says what she wants, and then your own behavior proved she was right.  She may actually be wrong, but it's hard to argue that when it kinda looks like she's correct.  Your occupying the moral high ground isn't an excuse for you behaving the way you did, any more than her age gives her a pass for acting like she does.  Do better, so she can learn how to do better too.", "NTA! What a witch. For a minute there I thought she was going to ask your husband to beat you into your place", "Definitely NTA. MIL is out of line and it’s none of her business in the inter workings of your marriage. Yes, she old and think’s completely different coming from an older generation but that doesn’t give the right or the excuse to meddle and complain. Your husband should of shut her down immediately and walked away when she start this conversation all over again.", "Oof that age difference. I see from your other comments that you married at 19 and knew him most of your life… he was an adult when you were BORN. This is a massive red flag for abusive grooming. I would definitely look into that OP. \n\nYou weren’t “allowed” to work… that’s a problematic attitude to take. You chose to work and then chose to be a SAHM (at least I hope it was actually all your choice). \n\nYour MIL has a very outdated, misogynistic attitude toward women’s roles, and you likely won’t change that. Next time try this “I disagree with your views on gender roles at a fundamental level. Our relationship works well for us and we are happy, despite what you may think and it’s not your business.” Then if she presses it, refuse to engage with her: “I’m not going to fight you about this, it’s a waste of everyone’s energy” and then walk away. If she wants to berate her son about it that’s their business.", "i stopped reading when i saw your age, this is creepy", "ESH, you don’t need to conform to her gender roles. But, you did go nuclear and called her names, you ended up stepping down on her level. \n\nIt sounds like your husband supports you, this should have been something for him to manage, you intruded in their conversation and escalate it.", "[deleted]", "NTA", "ESH, while I still hold a more traditional view of marriage, I would never force it down on anyone. That being said walking into the conversation and interrupting and then blowing up is the wrong way to manage the situation.", "Soft YTA. Only because I don’t think it’s ever ok to say what you said, although it was justified. I don’t call people names or tell them they are going to hell. I just don’t. I would have told her that her thoughts on our relationship should be kept to herself and left my husband to deal with his mother.", "YTA. You used a sledge hammer to swat a fly. Your over reaction to the ridiculous counsel MIL was giving her bemused son makes me wonder if something else is really going on here. Perhaps you are not as confident of the roles you and your husband have chosen as you claim to be. Your husband, 21 years older than you “allowed” you to work for a few years before you became at SAHM? How indulgent of him!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband's (47M) family are very old school with the weird beliefs that women are meant to be mothers and stay at home and essentially serve their husband. I'm (26F) lucky that my husband doesn't believe in that at all, and I've been allowed to work for multiple years until I decided to leave work and be a SAHM. A few days ago, we were at my MIL’s house planning our Christmas dinner with a few other members of the family who had come to visit. MIL then asked me if I was going to make a small rice-based dish for my husband and his brother who literally will eat rice every single day and before I could say yes, my husband laughed and said no need, I think if she has to make rice one more day then she will drown me in basmati. He was laughing and it was obviously a joke, but I guess she didn't find it funny and said, “if she's a good wife she'll do what you want without complaining”. She was 100% serious. no one laughed and no one said anything, and we tried to change the topic.\n\nAbout an hour later I was talking to my SIL but when I turned to see my husband, I couldn't find him. So, I got up to look for him and I found him talking to his mom in the little room that they used for their office. She was talking very quietly but I heard her say “No. She is too spoiled, and she feels comfortable to insult you. Be a man and make her understand her position in your relationship.”. I was appalled and I walked in and asked what she was talking about, and she quickly went on a rant about how I was controlling my husband and making him less of a man. She then turned to my husband and said that he should take a stand. I got very upset and told her that she was an evil and disgusting person and that she was going to rot in hell for the way she thinks and the things that she says. She tried to argue back with me, but I had already turned and left. My husband was right behind me, and our entire ride home was silent and tense. I thought that my husband would fully agree with me but when we got into our bedroom, he said that he understands why I got angry, and he agrees that his mother was 100% wrong and the thing she was saying were messed up but that I shouldn't have said those things to her because she is old, and she was raised to think this way. I told him that her age is no excuse for saying what she did. He said “ok.” and left it at that but now I'm a bit confused. My SILs and BIL all agree with me, but my FIL is extremely upset. I know I'm right in my thought process, but should I not have said anything and just left it as it was?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "I think the \"Rot In Hell\" part is something You shouldn't have said just that small part but other than that NTA", "NTA. Reading your other thread in another subreddit makes me worry about you. Your husband is abusive and controlling and your choice to be a SAHM was not a choice since you were afraid of him. Please reach out to family or friends and tell them about your situation.", "NTA.", "NTA\n\nMIL,\n\nDon't expect an apology for being backwards. Turn around, join the 21st century. The water's fine.", "I think you should be conernced about the fact that a 40 year old married a 19 year old.", "Least of your worries. Leave the abuser.", "The 21 year age gap is a screaming red flag, but after 7 years maybe its working for you.  You've \"been allowed to work\" sounds a bit problematic though.\n\nThe real question is why your MIL is trying to control her son and make him less of a man.\n\n\"White Christian\" traditional roles for women is definitely a cultural thing.\n\n~~ESH - there were better ways to express your objections to your MIL's thinking - she is wrong but evil and rotting in hell should be reserved for more than a difference in opinion about gender roles.~~\n\nRevised to NTA and you should definitely leave the wife beater and his evil MIL.", "Nta. She was wrong but you could have just tild her to mind her business", "Sure old people were raised a certain way. But that also means they’ve had the longest time to change and educate themselves.\n\nIf they’re still a bigot after 70 years, it’s not because they were raised that way it’s because they ARE that way. \n\nNTA", "\"White and Christian\" are very much a cultural thing!! NTA, though.", "Nah you're good 😁✌️", "Half your age + 7", "I believe he was defending me in the room with his mom, I just didn't get to the conversation in time.", "Oh he also beats her and is super manipulative and controlling, but she’s okay with that. Even when he attacked her stomach while she was pregnant. he groomed her from her youth on top of that. But only the mil is problematic I guess.", "Look at OP’s other post.\nHe is much, much worse than his mother.", "Her husband beats her, btw. He also groomed her from childhood, so don’t be so flattering of him.", "Thank you! I've let her say so many things over the years but this was my breaking point.", "See her other post.", "He also beats her, including when she was pregnant. So there is that.", "We've been married for 7 years", "Her husband beats her and the mother in law supports that. I would have much stronger words for both of them.", "I agree with you that her views are never going to change. However she was absolutely correct in calling her MIL out on that. Silence only benefits the oppressor. MIL should be called out whenever she voices these opinions. She should not be comfortable in expressing them, even in her own home. It might not get her to change her views, but it will get her to shut up.\n\nNTA OP MIL can dish it but she cant take it and that's a her problem.", "The mother in law was actually advocating for her son to beat her into compliance. Check out her other post. There is no better for anyone here.", "That’s what she meant. See the other post.", "I understand your point of view. Thank you.", "Read her other post. This is so much worse.", "We're white so its not a cultural thing, more of a christian thing. But besides that, I agree. She's already reached out to my husband to ask what time we'll be there Christmas morning so she's trying to pretend nothing happened.", "The mil was advocating for her son to beat her.", "The mil wanted her son to beat her into submission.", "Her mother was advocating that her son beat her into submission. \n\nRead her other post, it gets so much worse.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Wow, so he's a fundamentalist \"Xtian\" asshole to boot. Not surprised from the mom's attitude.\n\nYeah. OP, you need to be running straight to a divorce attorney.", "Hold your ground and look after yourself. There's no excuse for bad behavior and a lot of things considered normal in the past is now illegal to say or do.", "Oof, yikes", "And together how long before thar?", "So you were married at 19 and he was 40???", "Where was beating mentioned?", "Calling her out on her views = one thing. Saying she can \"rot in hell\" is not that.", "Oh God, hadn't seen that. Well, the theory that OP was grommed is most likely correct", "See, this is why context matters.", "It’s always the uber religious families.", "Yep.", "Ive known him for most of my life. We live in a small town so its hard to not know pretty much everyone", "OOF", "Literally just yelled WHOA out loud.", "In her post on another forum. It’s so much worse.", "Thinking a woman should stay in the home = one thing. Calling OP \"spoiled\" (for what exactly??) and saying her husband needs to \"take a stand\" deserves being told to rot in hell. Can dish it but cant take it. Boo hoo for MIL", "Yeah, he knew her his entire life and beats her too, including while she was pregnant. But now that she “decided” to be a sahm, he’s mostly much nicer.  So that’s nice. /s", "Yeah, that’s why I responded to some comments here. The missing context makes everything so much worse, including that the mil clearly wanted her son to beat his wife into submission.", "Hey OP, I’m not sure if you’re familiar with grooming, but everyone who is will tell you that this is probably a case of it.\n\nPerhaps he’s just scared of MIL snapping you to your senses by showing you how little you matter to their family", "Oh JFC. He & his mom should both rot in hell.", "Considering they live in a small town where everyone knows each other, and saw this 40 year old man preying on a teen, I would think the whole town should go there.", "YTA. Not for what you said to your MIL, but for staying with a man who\n1) groomed you \n2) beat you \n3) abuses you verbally \n\nYou need to take your child/children, and get out. Unless you want to teach them that this behavior is ok.\n\nSomeone who hits you in the stomach is NOT a good husband.  NOT a good father.  Stop making excuses for his behavior, get out, and seek therapy.", "So he beats you and you're just... ok with that? Read up on internalized misogyny because you and your MIL are both the definition of it, just different ways.", "Your posts are terrifying, please get away from every person in that family INCLUDING AND ESPECIALLY YOUR ABUSIVE HUSBAND. If/ when you have children with this man, he will hurt your children too. Not maybe, he will, and it will be your job to protect your children from his abuse. I know it’s not easy, not by a long shot, but you owe it to yourself to live a life worth living.", "Nta she can say nasty things about you but when the shoe is on the other foot she can't take it . Also who defines what a man is anyway that's so gross people have to act a certain way to earn the title of being a man . Shame on her she was demasculating him . I don't understand why she cares so much about what goes on in YOUR household .", "Nta. You need to take a good long look at your marriage. MIL was encouraging him to hurt you and your husband still defended her. \n\nDo you want her to be your children's grandmother? How sure are you that your husband actually disagrees with was? Was he listening to her when she was speaking to him?", "How long you were with your husband? You’re very young.", "I agree w/ you but , rot in hell may have been a bit strong.  Question: you said you “were allowed to work “. What ?  What culture? How old is the MIL?", "*I just want to add that we are \"white\" and christian*\n\nWell as a Christian- a man shall leave his father and mother and become one with his wife.(Gen 2:24, Eph. 5:31).\n\nYour husband is married to you so only his opinion counts here. His mother needs to realize that he has a new family now and you two make your own rules. She needs to back all the way up and let you deal with your marriage.\n\nThere is also some sayings in the Bible about lying lips and controlling your tongue. You should ask your MIL why she persists into talking smack about one of God's creation (you). Does she think God would approve of her interference in your marriage?\n\nUPDATE-\n\nJust read you other post. Your MIL is the least of your worries. Your husband is not a stand up guy and you are a fool for staying with him, especially since there is a child in the picture. Do you want your daughter to grow up watching her mother being treated this way? You might not even live to see her grow up. Leave now!\n\nAnd there are passages in the Bible that tell a man how to treat his wife- your husband is not following any of that so I don't think that you can call him 'Christian' or a' good husband'.", "[removed]", "I mean you butted in on a conversation and didn't give anyone a chance for anything so who knows how it could have ended🤷‍♀️", "She wasn't even \"allowed\" to work since he beat her until she decided to be a sahm according to her other post.", "Oof, yeah I missed the age gap there.", "To clarify, the mom wanted her son to beat the wife into submission. Just like he did to convince her to be a sahm.\n\nRotting in hell is milder than what I would have unleashed on them.", "Well he started beating her less when she “chose” to stay at home", "They’re “christians”. Mil wants her son to beat his wife more than he already does. He hasn’t been beating on her much since she “chose” to be a sahm. Mil is disappointed.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Just for context, the mil was advocating that her son beat her to teach her her place. Which he does, just not as often as his mother likes.", "See her other post. Husband beats her and mil wants him to “punish” her more to keep her in line. He hasn’t been beating on her as much now that they have a kid and she stopped being so unruly as to work. So he’s a good person now /s", "All I needed was \"I'm allowed to work to know that OP's husband isn't the supportive guy she presents in this post.", "You seem to believe a lot of things just to justify why you are still with a man much too old for you and who use to beat you until you did what he wanted you to do.", "Where? Link?", "Where does it say that??", "I didn't read it that way, but if your interpretation is correct that would indeed be evil.    Where does OP say he beat her to convince her to be a SAHM?\n\nOH.  found it.  Well that is just terrible.    Thanks for pointing it out.", "Just because you’re white doesn’t mean you don’t have a culture.", "Yea I don't do anything more than read what's posted. Why is she staying with someone who beats her?", "You caught that too, huh?", "Right. I'm lucky my husband is nothing like that, I've been *allowed*, and that is exactly where I was like oh unreliable narrator cool", "https://www.reddit.com/r/offmychest/comments/zr0bx7/my_husband_hit_me_and_i_need_to_say_it/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "Look at the other post on her profile", "Because he knew her when she was a child and snatched her up the second he legally could. And beats her when she doesn’t want sex/goes to work/isn’t at his beck and call. He also beat her when she was pregnant. But he’s less violent now that she stays at home and doesn’t work, so he’s a wonderful father.", "I can't speak on any of this. These are some serious allegations IMO and I can't just go off what social media says.", "Why even bother with Reddit then? These are her own words, and she thinks he’s wonderful despite the verbal, physical, and mental abuse, so it’s not like we’re a jury verifying her story."]}