{"id": 5285, "submission_id": "zrcymp", "title": "AITA for not watching baby", "selftext": "so me 21(M) and my gf 20 (F) got into an argument tonight because our 7 month old baby fell off the bed onto the carpet. we have a crib in the room next to our bed because ive been trying to stop and unhealthy attachment pattern i see shes creating. \n  before i started playing i took four melatonin gummies and put baby in crib to play a couple games of apex before i went to sleep. this was at 10pm. i have to be at work at 6 am. \n\n  my gf took our son out of crib and put him on bed while i’m in the middle of playing so i didn’t notice he was close to the edge. after he fell he started crying so i picked him up and gave to gf to comfort him until he felt better. after i finished the round i went to change his diaper and he started crying I don’t know why but i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs. \n\n  i woke up an hour later to crying and tried to ignore it to go back to sleep but after 30 minutes it hadn’t stopped so i went upstairs to help. my gf was making her way downstairs and went outside as i was going up. i got him to sleep in under 10 minutes because of tricks i learned from research on guides and also trying out different things. (i just try to recreate the feeling of being in the womb because thats where baby’s come from so thats where they’d be most comfortable) \n\n  after he was asleep i went to get gf from outside and she is visibly upset. she grabs a throw over and goes downstairs. i follow and bring her a blanket. she was crying so i hugged her and after she calmed down she basically said it was my fault he fell and that i was ignoring her struggling to put him down for hours. but she was the one who took him out the crib and i’ve told her plenty times that the way she gets him to sleep is ineffective but she never listened. she’s currently upstairs and I’m downstairs . AITA?", "created_utc": 1671605609, "permalink": "/r/AmItheAsshole/comments/zrcymp/aita_for_not_watching_baby/", "score": 104, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i did not watch baby while playing apex. i could be the asshole because i knew he was on the bed and could’ve paid more attention to prevent fall\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "&#x200B;\n\n>my gf took our son out of crib and **put him on bed**\n\nand left???\n\n&#x200B;\n\n> **took four melatonin** gummies and put baby in crib\n\nand left???\n\n>i woke up an hour later to **crying** and **tried to ignore it**\n\n... dude what?\n\n&#x200B;\n\n> so i went upstairs to help. my gf was making her way downstairs and went outside\n\nshe left baby upstairs alone before you came?\n\n&#x200B;\n\nESH. None of you seems mature enough to have a child.", "ESH - except for this poor child.  I feel like you think you have a puppy or cat instead of an actual human being that they are responsible for.\n\n\"unhealthy attachment pattern i see she's creating\" - what?  Bonding and taking care of your child?\n\n\"so i picked him up and gave to gf to comfort him until he felt better\" - parenting at its finest - are you not capable of comforting your own child.  Do you not feel the natural need to want to do so or are you incapable?\n\n\" i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs\" - That is totally what a MAN does!   /s\n\nWelcome to having a child before you are emotionally ready or capable.", "ESH. Both of you are too immature and self-immersed in order to be proper parents!  You NEVER leave a 7 month old baby on the edge of a bed or even in the middle of it, without keeping a solid eye on them.  Babies roll and move and more have been injured by rolling right off the bed.  You cared more about your game playing than the safety of your baby!  You both behave badly, and you need to grow up because you brought a baby into the world.  That baby deserves two parents who put HIM first instead of themselves!  Grow the f up!", "Neither of you is fit to be a parent. ESH.", "This poor baby", "YTA. A 7 month old needing help to sleep is not an unhealthy attachment. What is unhealthy is the way you prioritize your video games over your child. Grow up.", "You two seem to be fighting over how to care for baby instead of both being present for baby. This battle over how to care for baby should not be about ego but rather anpbout whatever works at that time. And what works for you might not work for her. Babies can have more than one need. The bickering needs to stop.", "Y T A for 'unhealthy attachment pattern' alone. Your partner is teaching your child that they can rely on her for their needs. That's not unhealthy, that builds a secure and confident child! You should try it yourself so that your child knows they can rely on you too 🙄\nEdit: ESH, as your partner shouldn't have left the baby. You both need to take some parenting classes as soon as possible.", "ESH. \n\n>so me 21(M) and my gf 20 (F) got into an argument tonight because our 7 month old baby fell off the bed onto the carpet. we have a crib in the room next to our bed because ive been trying to stop and unhealthy attachment pattern i see shes creating.\n\nThe baby isn't in your bed (and co-sleeping is often safe), so I'm not sure how a crib in your room is creating an unhealthy attachment pattern.\n\n>before i started playing i took four melatonin gummies and put baby in crib to play a couple games of apex before i went to sleep. this was at 10pm. i have to be at work at 6 am. \n\nMelatonin works by turning off electronics. Why would you take it and then start gaming?\n\n>my gf took our son out of crib and put him on bed while i’m in the middle of playing so i didn’t notice he was close to the edge. \n\nWhy was no one watching him?\n\n>after he fell he started crying so i picked him up and gave to gf to comfort him until he felt better.\n\nYou say later that you're better at getting him to sleep, but you can't be bothered comforting your own kid? You're TA.\n\n> after i finished the round i went to change his diaper and he started crying \n\nOh. You couldn't be bothered because you were in the middle of the round. Major you're TA. \n\n>I don’t know why but i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs. \n\nProbably because you realizes he ruined your game, and it's gf's fault? /s\n\n\n>i woke up an hour later to crying and tried to ignore it to go back to sleep but after 30 minutes it hadn’t stopped so i went upstairs to help. \n\nDid anyone check for a concussion? Or maybe not try to ignore their kid? WTF? Also, love that you choose the word help instead of \"take responsibility for my own kid after leaving him to gf.\"\n\n\n>my gf was making her way downstairs and went outside as i was going up. i got him to sleep in under 10 minutes because of tricks i learned from research on guides and also trying out different things. (i just try to recreate the feeling of being in the womb because thats where baby’s come from so thats where they’d be most comfortable) \n\nToo bad you didn't try that when gaming was your first priority. \n\n>after he was asleep i went to get gf from outside and she is visibly upset. she grabs a throw over and goes downstairs. i follow and bring her a blanket. she was crying so i hugged her and after she calmed down she basically said it was my fault he fell and that i was ignoring her struggling to put him down for hours.\n\nYeah, maybe try to notice when the mother of your kid is struggling. Major difference for the life of your child in the future. Also, be faster to step in. And pay attention to your own damn kid if he's out of the crib. \n\n> but she was the one who took him out the crib and i’ve told her plenty times that the way she gets him to sleep is ineffective but she never listened. she’s currently upstairs and I’m downstairs . AITA?\n\nWell she didn't get him out while he was sleeping. She already said she was struggling. You ignored that, turned on the game, ignored him on the bed, handed him over instead of comforting him when you claim to be better at putting him to sleep, walked away and let him cry for another 1.5 hours, then bragged that you can get him down in 10 minutes and she never listens to you? Yes, you are TA.", "YTA: \n\nThings you did. \n\nA)Actively ignored your partner passing off the baby to you when she was exhausted after trying to get baby to sleep. \n\nB)Actively ignored the baby who literally fell off the bed. \n\nC)Handed the baby you were ignoring to the partner who needed a break to comfort when injured. \n\nD)continued to ignore baby. Multiple times. Doing nothing to help- at any point- with putting baby down to bed. \n\nE)completely left the room leaving your partner alone with crying baby to head downstairs. \n\nF)finally taking a shift/turn at putting down when she's at a breaking point and using it as an excuse to criticize your partner. \n\nE)pretending like your partner is horrible for taking a break (leaving baby in a crib to go outside) when you just randomly peace out and if ignore your baby and your partner whether or not baby is secure.", "You’re both assholes", "You are both TA.\n\nYour GF for taking a baby out of its crib, and not looking after him so he fell, and not telling you the baby was on the bed.\n\nYou for handing baby to the mother and nog comforting him, and ignoring crying.\n\nYou both need to get together and make a plan on who does what for the baby.\n\nAnd if your GF is have trouble with getting the baby to bed then you need to step up and stop her from taking him and lying him on the bed etc..\n\nSounds like you both need to learn a great deal. Good luck.", "YTA\n\nFor one extremely simple reason, you prioritized a video game over your child and partner. Additionally, you took melatonin I’m assuming to help you sleep better because she’s expected to wake up with baby all night long. When you are home instead of giving her a break and letting her rest you played a video game. It’s glaringly obvious that she’s struggling just by the information you provided! Not everyone is a pro at parenting, not everyone is a natural. That’s not even considered the fact hormones after pregnancy are completely out of wack, and she might even be struggling mental health issues on top of raising an infant. \n\nShe’s not completely without fault here but your priorities are glaringly obvious and the center of these issues. Log off the game and support your partner, having a kid means sacrifices, especially those first few years.", "ESH.  Your gf for leaving the baby alone and you for ignoring a crying baby.  Oh poor baby.", "YTA you both suck as parents.", "ESH. You both know your baby is a human and not a doll right?", "Woah, I get you might not have been ready to have a child. Many people aren’t when they discover that a child is on the way. That’s why babies take months to develop rather than, ya know, being instantly dropped from the sky by storks. That gives people time to get ready.\n\nI could go into how it seems like there’s resentment building between you and your GF and all that, but honestly, ESH (except the baby). You’re the adults. Time to adult up. Take parenting courses, go to couples counselling if needed, prioritise baby over video games… Idk, but you can’t keep going like this.", "ESH you shouldn’t be parents", "So while you work - she settles the baby... While you play videogames, she settles the baby... when you get frustrated with the baby crying after the diaper change - you put them in the cot crying - and she settles the baby... while you sleep - she settles the baby... and then late  in the night when she's burnt out, frustrated, exhausted, feeling resentful and angry - you finally swoop in, assist and settle the baby, yet it seems you feel superior at doing these things because you have done \"research\" and your way of doing everything is far, far better than hers... it sounds from what you say, that you feel very comfortable undermining the way she is doing things, and criticising her when she is doing what feels instinctive as a mother.\n\nTell me you want a divorce, because this is pretty much a blueprint for how to completely ruin your relationship.\n\nYou are young and I'm assuming this is your first child. So you have a lot to learn, not only about raising a child, but about how to support your partner and work as a team. \n\nI am confused that one minute you understand that a comforting, womb-like experience can help calm an upset baby, but in the same post you criticise your partner for her \"unhealthy\" close, secure attachment to the baby and her \"wrong\" way of comforting them.\n\nWord for the wise. Speak less. Listen more. Videogame less. Spend more time telling your wife that she is beautiful and a wonderful mother.\n\nYTA but it's not too late for you.", "Ohh I hope this is a troll post....it feels like one with all the trigger words/points\n\nYTA\n\n\nAnd then of course on the comments you dropped this crap..\n\n>i was not am not ready to have a child and have made that very clear but am trying to at least be a dad. i get frustrated sometimes because of the way my gf talks to me and treats me and im trying to not let it slip and have it redirect towards our kid\n\nso your parenting style is to stay as detached as possible from the child, and to criticize your girlfriend in hopes she too will stop bonding with the child too.... You literally attempting a form of verbal abuse to get her to neglect your child.....because she choose your child over you. Truly a shitty plan. Just leave the relationship at this point. Be a decent human being  and walk away.", "It's ESH you both behaved like bad but your young and still learning it's not a shame if you need held handling an infant parenting classes are good way and maybe therapy helps your girlfriend maybe it helps her to just talk about her feelings with a third party", "ESH. Your gf shouldn't get the baby out of the crib if she's going to leave him on his own. And you shouldn't ignore your crying baby.\nYou are both neglecting that poor kid, do better.", "Not only are you and your gf TA, but you are ENDANGERING your child. WTF is wrong with you? \n\nPlease get some help before your baby ends up serously hurt or worse!", "You both need professional support I think. Parent shaming isn’t gonna achieve much, but you two need to discuss your methods together and communicate properly, then possibly see a guidance counsellor for help and advice.", "I can’t get over the part where your baby falls on the ground and you’re just worried about finishing your video game. \n\nESH", "YTA and not ready to be a father. Since you already are - WAKE UP.\n\nStop playing games, start taking care of your baby, don't pass him to your gf every time he cries, don't call giving attention to the baby 'unhealthy attachment pattern', give attention to the baby all the time, don't get frustrated and leave him alone to go to sleep. Just be there for him he is a baby he needs someone all the time and not just your gf.", ">Too many words when \"child neglect\" would've sufficed.\n\nYTA", "ESH. Both of you contributed to a dangerous situation for your child who was left unattended on a bed and in general inattentive. To be clear, your girlfriend more so but I do understand why she may have thought you’d be aware of your child in the room with you. \n\nThere’s a lot of comments about it being smart to set a child safely down and walk away for a minute if you are truly overwhelmed. And yes, that is a very smart choice, 99% of the time. The 1% of the time I wouldn’t feel comfortable ignoring cries? After your baby has fallen. Your baby fell off the bed. You need to be paying extra attention to make sure he’s ok. If you don’t feel capable of sucking it up and dealing with the crying in that situation to ensure he’s ok, it was the time to reach out for help from a friend, family member etc. \n\nBabies who’ve fallen need to be monitored. This would be my exception to saying it’s safe to let them cry while you take a break.", "You’re getting your ass handed to you and probably rightfully so. That said, I’m 41 years old and my daughter is 21 so you can do the math and decide for yourself if I can relate. \n\nYour whole story sounds very familiar. \n\nY’all are kids raising kids. You’re not emotionally mature enough to do what you’ve signed up to do. Honestly - the only thing you can do about it at this point is to try your best. My therapist once told me “we all fuck our kids up in different ways” … so yes, you are fucking your kid up. But then I fucked up my oldest kid and my younger kids are also probably getting fucked up. It’s life. \n\nYour baby is not going to suffer long term consequences of rolling off the bed once. \n\nThat said, as a parent your kids needs now come before your wants. That is very very hard to do in your late teens/early twenties. As a baby their needs are greater and demanding. No you don’t get to finish your game. Before you know it they’ll be playing with you but for now, you have to set yourself aside and care for your child and be a partner for your girlfriend before you end up a weekend dad and your kid ends up a statistic.", "What is wrong with you both? Act like parents or give the baby up if you aren't going to care for it correctly.", "“I got him to sleep in under 10 minutes because of tricks I learned from research and guides and also trying out different things”\n\nNot wanting to rain on your parade here, but this has less to do with you having superior research and techniques than your gf, and more to do with the fact that you’d necked 4 melatonin gummies and had been asleep/resting for over an hour and a half so were more relaxed than your stressed and overwhelmed GF, whose emotions the baby was picking up on.\n\nIf she could swan off to chill for an hour and a half without even checking it was ok to do so whenever she felt like it, she would most likely be more relaxed too. But she can’t even put him right next to you for a few minutes when she’s stressed without worrying if you’re too engrossed in a game to actually bother parenting your own child! \n\nESH, you both need to communicate better, but you’re the bigger AH in this instance. Why on earth would you carry on gaming knowing your baby was on the bed next to you? Is a game really more important to you than his health and wellbeing? \n I totally get that having to stop mid game is annoying, but it’s nowhere near as bad as having your child die from an accident you could’ve prevented but didn’t because you were playing a computer game!", "You are both negligent. Kids having kids.", "YTA, but not just you, your girlfriend is too!", "ESH. You're going to get a lot of crap probably for mentioning playing video games. I don't see that as the problem here. Hopefully i remember everything here right...She sucked for not making sure you noticed she had taken him out of the crib. Then you sucked for just handing him over when he fell. You sucked again for taking off and leaving her when he cried later. She sucked for not communicating better. You suck for sounded so arrogant like you're better at getting him to sleep yet you left it to her a couple times. It all sounds so childish . Play your games, but just communicate with each other. You guys sound young, and I remember how hard it was to switch my mind frame to my want and needs not being the most important thing anymore. Now I'm watching my own daughter go through the same thing as a new parent at 21. Having a baby is difficult; you have to learn to talk to each other better.", "YTA, and it sounds like your S.O. is suffering from depression or sleep deprivation, trying to meet your child’s needs, since you aren’t. Look, dude, the thing about babies is that they aren’t spoiled. They cry to get urgent needs met and to communicate! Unhealthy attachment? Like, as in being able to feel secure that his parents will help him if he’s uncomfortable, lonely, hungry, or wet? Y’all both need help, but come on now. Your son is more important than Apex! Your S.O. sounds overwhelmed. Get it together. There is no scenario twist in which you are not the AH, for your negligence alone.", "ESH. Both of your are endangering your baby’s life and are not prepared to be parents. This is a massive commitment and you need to be ready to be physically and emotionally invested in the baby above everything else. If you aren’t prepared to do this, you may want to seriously consider adoption. It doesn’t sound like either of you want to be parents, and it doesn’t look like that baby will be okay in your care", "ESH, don't have kids at 21 you fool. What appalled me the most was how you decided to take 4 melatonin gummies with a baby in the house.", "ESH except the poor baby. You two should not be parents. This is an example of being way too young and immature. Holy shit.", "I feel sorry for this baby. Both of its parents are neglectful, immature people who have no business being parents.", "ESH. Wonderful, two young parents who have no interest in the responsibility that comes with having a child and who blame each other for the neglect of that child. Throw in physical abuse and you have my childhood. OP, babies are supposed to be attached to their parents. That's healthy. Neglect is not and it can end up with the baby being injured as likely happened when your son when he fell off the bed. When he was crying, did you check to see if he was hurt by the fall? No, you put him in his crib and left him there.", "Info: where do you live so we can contact CPS?", "YTA.\n\nYTA, YTA, YTA!\n\nDude, what the hell is wrong with you? You're a parent of an infant - YOU DON'T HAVE TIME TO BE GAMING, YOU CHILDISH NITWIT!\n\nWhen you two created a new life, that became your HIGHEST priority. That means that things like a social life, gaming, vegging out, de-stressing, chilling, or ANY OTHER LAID-BACK ACTIVITY are pretty much **gone**. \n\nYou're a parent. You get to have a life once that child is fully grown and able to \"adult\" successfully...but then, from your post it seems that you don't have that down, yourself, yet.\n\nGrow up, little man, and start being an adult. If you don't, then you will be yet another sad example of someone who can't understand why their life just flipped upside-down.", "YTA", "“I picked him up and gave to gf to comfort…”  And you couldn’t try to comfort him because…?”  Oh that’s right. Your stupid game was more important.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nso me 21(M) and my gf 20 (F) got into an argument tonight because our 7 month old baby fell off the bed onto the carpet. we have a crib in the room next to our bed because ive been trying to stop and unhealthy attachment pattern i see shes creating. before i started playing i took four melatonin gummies and put baby in crib to play a couple games of apex before i went to sleep. this was at 10pm. i have to be at work at 6 am. my gf took our son out of crib and put him on bed while i’m in the middle of playing so i didn’t notice he was close to the edge. after he fell he started crying so i picked him up and gave to gf to comfort him until he felt better. after i finished the round i went to change his diaper and he started crying I don’t know why but i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs. i woke up an hour later to crying and tried to ignore it to go back to sleep but after 30 minutes it hadn’t stopped so i went upstairs to help. my gf was making her way downstairs and went outside as i was going up. i got him to sleep in under 10 minutes because of tricks i learned from research on guides and also trying out different things. (i just try to recreate the feeling of being in the womb because thats where baby’s come from so thats where they’d be most comfortable) after he was asleep i went to get gf from outside and she is visibly upset. she grabs a throw over and goes downstairs. i follow and bring her a blanket. she was crying so i hugged her and after she calmed down she basically said it was my fault he fell and that i was ignoring her struggling to put him down for hours. but she was the one who took him out the crib and i’ve told her plenty times that the way she gets him to sleep is ineffective but she never listened. she’s currently upstairs and I’m downstairs . AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "ESH.  And let me be clear, the only reason she sucks too is because she left the baby on the bed.  You suck way more.  First, infants, being infants and not being able to do anything for themselves are supposed to be attached to their caregivers.  In other words, you don't want to be inconvenienced.  Stop checking out and leaving the mental load on your gf.  It's ok to take a break, but to say eh, screw it and leave him after he could of had a potential head injury, is not.   I suggest, while you are busy being all smug and looking up stuff, to look up some child development books,", "The only “unhealthy attachment” a baby that young can have is if there’s too little attachment. At that age, there’s no such thing as too much. Please familiarize yourself with the basics of attachment theory.", "YTA and your 7 month old is not capable of an “unhealthy attachment pattern” but you definitely are. What you just described is neglect.", "Who's parenting your girlfriend and you while all of this is going on? \n\nESH.", "ESH.. you two do not seem mature enough for the responsibilities of having a child.", "ESH\n\nBoth of you are terrible parents", "You left your child crying, tried to ignore it and go back to sleep, and the child is still crying 30 min later and THATS WHEN YOU DECIDED TO DO SOMETHING?! \n\nYTA. Yikes dude….", "ESH \n\nY’all obviously have no business raising a puppy let alone a human being, but the kid is here so you need to do better. \n\nYou gave up your right to a chill night with the Xbox when you put your sperm where it clearly had no business being. Your youth is OVER. Your a dad now. Get in dad-mode. Also - use SO MUCH birth control. Another kid will make your current situation 1000x harder. \n\nSign up for parenting classes and don’t take drugs - including sleep aids - unless you have communicated to you partner that you are doing so and they have agreed to be 100% in charge of the baby while you’re out cold/high.", "ESH-Does she work or is she a SAHM? I feel like there’s a lot missing to this story but overall it sounds like you both are immature to have a child. Please try and get some help from a parent or other family member.", "I pity young mothers. YTA and your empathy for your child is horrifyingly low. Maybe look into some actual child development research about meeting needs at such a young age.", "Esh - both of you need to sign up for a parenting class asap. This is why people say you should not be having babies until you are older. For while a small percentage are mature and can handle it. Unfortunately most cannot.", "YTA  \nunhealthy attachment pattern?! You're talking about a 7 month old and his parent, not a teenager and an inappropriate crush, babies need attachment to thrive  \nhaving said that, nothing wrong with a crib, it is indeed a safer place then an open bed  \n\n\nyou taking that much melatonin and starting gaming apparently means you're off the parent clock? I didn't know that was an option  \n\"after i finished the round i went to change his diaper and he started crying I don’t know why but i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs.\"  \nYou didn't think the crying meant something? it was just a frustration to you that you can leave behind upstairs? What if he was actually hurt falling of the bed? what if he needed something? what the hell man?!  \n\n\nyou let your overwhelmed wife and your crying baby struggle together for 30 mins before you went to \"help\" with your superior baby knowledge that your wife just refuses to listen to  \nYou sound like an insufferable, checked out father and husband", "ESH. How high was the bed?? A seventh month old calling should be a trip to the doctor to have him checked for injuries or a concussion. But you two just let him cry an cry and focus on your own trivial things...that's not responsible.", "Who's bright idea was it to have a baby because the both of you seem like you don't want to be f****** bothered with the baby. Both of you need to get your s*** together", "YTA  When I was a baby I rolled off a bed. I broke my leg and spent the next six months in a body cast.\n\nYou are not just an AH, you are negligent.  Seven month old babies do not have \"unhealthy attachments\".  Your baby is more important than your stupid game, and babies cry because they need something and have no other way to communicate.", "I just can't fathom how immature \"kids\" (even if they are legal adults) are having other kids these days. This is why most people under 30 shouldn't have kids.\n\nObviously YTA. You're neglecting your baby.", "YTA and I hope someone calls CPS on you because your baby is in danger.", "This is a dumpster fire. I just want you to know that my full grown dog just tripped, face planted into concrete, scraped his nose and paw pad, started crying and I picked his 100 lb ass up, carried him inside, patched him up, and am currently laying on the couch with him half in my lap comforting him… A DOG. \n\nI have since concluded that I, a 25f with no children (but many pets) am a better (human) parent than you guys are. \n\nSo in conclusion ESH and y’all need to get your shit together. Thanks for coming to my Ted Talk.", "Esh. That poor child. 😭", "ESH. You both sound unprepared for parenthood but you have a child now and need to grow up, like yesterday. \n\nYour baby's needs always come first, before your sleep and Apex. There is also no such thing as an unhealthy attachment for a 7-month-old. Where I live we have something called the \"reach out center for kids\" and perhaps you have something similar in your area. They often have social workers and/or offer courses about parenting. Perhaps you didn't have any positive role models and nurturing people in your life growing up but it's not too late to be one for your son. He deserves to grow up being safe and feeling loved and it's your job to give that to him. Get help.", "Nta, don’t listen to the people on here talking shit cause they probably don’t have kids", "YTA\n\nSays ‘don’t want baby to get bad habits’\nTakes 4 melatonins(which the body produces in response to darkness to prepare brain to sleep)\nThen process to play computer game with bright flashy lights totally defeating the melatonin.\nBut it’s the 7month old who has bad habits right?\nBad habits like wanting comfort when hurt.", "Ew you guys make me feel bad for that poor baby", "YTA Please please search for help raising your kid. You both sound utterly incapable of raising a child. You can’t put a baby on a bed, you can’t take four melatonin while caring for a kid and you certainly cannot ignore your crying kid. You’re in urgent need of help. You’re neglecting your kid and putting him in great danger. Please search for help. He deserves it.", "YTA and a terrible boyfriend and parent.", "YTA. Why did you procreate?", "YTA\n\nBad parenting all around. You don’t take 4 melatonin because you need to be able to wake up for the baby, or put him on the bed next to a dad that ignores his kid for a game, or keep ignoring him.", "YTA. Holy shit. Have you two considered maybe handing over parenting responsibilities to people more equipped?", "I hope CPS comes for the both of you soon. Poor baby.", "ESH - I see a visit from CPS in your future", "ESA. Why are children having children they are not ready to have.", "More melatonin does not mean more sleepy.\n\nESH.", "Typical gamer shit.  You’re both neglecting the kid with careless, absolutely brainless thoughtlessness. But go finish your round by all fucking means.  Ybta, but especially you,", "ESH and I’m worried for your kid.", "I’m absolutely horrified that you didn’t take your baby to the hospital after they fell. My niece fell off a bed and fractured her skull. She was three months old. Both of you should not be parents. Stop playing video games and actually look after this human! ESH", "Why did you have a child if you were just going to ignore it?\n\nYTA", "ESH except the baby. Next time wrap your dick or get an abortion, because neither of you have the maturity or mental capacity to be parents.", "YTA. Your infant son fell off of bed and injured himself and you handed him off to finish playing your video game? This beyond everything else makes you the asshole.", "I'm sorry, you gave four melatonin gummies to a BABY? What, he wasnt falling asleep fast enough for your convenience??? And then you tried to ignore the sound of your wife crying? And only got up to comfort her when she wouldn't shut up? And yeah, she is an idiot for leaving him unsupervised on the bed. ESH except the baby ofc, I hope the poor little thing has very good luck...", "NTA", "Dude your wife just had a kid and her body and hormones don’t just snap back to normal right when baby comes. It can take up to a year.", "> ive been trying to stop and unhealthy attachment pattern i see shes creating\n\nAlso this. I mean, seriously, what is wrong with OP? The baby is 7 MONTHS, he needs nothing more than attachment!!", "He left his seven month old crying for *half an hour* and ignored it.  This is neglect.   It's horrifying", "Sometimes if your baby has been crying for a long time, and you're feeling yourself getting very upset or frustrated, it's very good advice to put the baby down somewhere safe, step away and take a couple of minutes to breathe and be calm, and then go back in.\nChild health nurses in my country recommend this, because of things like shaken baby syndrome. It's necessary to step away sometimes.", "I get her leaving him alone if she felt she was at risk of hurting him. I'm not saying she was thinking that because I have no way of knowing, but it could be a factor.", "Did she leave?", "i was not am not ready to have a child and have made that very clear but am trying to at least be a dad. i get frustrated sometimes because of the way my gf talks to me and treats me and im trying to not let it slip and have it redirect towards our kid", "i did communicate i was going to play a couple rounds of apex before bed and i had my headset on", "should we throw him out?", "my ego does come out a little in my parenting style i do a lot of research and i always get criticized or critiqued for pretty much anything i do", ">Your partner is teaching your child that they can rely on her for their needs.\n\nYet, for at least 2 different situations, the partner left the baby completely alone....  \n\n\n> so i went upstairs to help. my gf was making her way downstairs\n\nshe left the baby before he even made it upstairs.\n\n&#x200B;\n\n>my gf took our son out of crib and put him on bed\n\nshe left.... that's not \"you can rely on me\", that's \"im putting you in the bed and leave\"\n\n&#x200B;\n\nthey both keep leaving a **seven** month old unsupervised.", "when i say unhealthy attachment pattern i mean he devolved a nasty sounding cough mixed with cry that sounds really concerning when its not. im trying to have him grow out of that and find a different cue to get attention", "Honestly, I am not sure I would advise co-sleeping as safe, to people who can both be there yet not notice the baby moving till they fell off the bed, while at least one of them was awake. Co-sleeping is also not recommended for people who use sleep aids- like melatonin. For this specific couple, I absolutely think that the crib is the safest place for this child to be at night. \n\nOP needs to get them both to a parenting class so they can communicate, and also learn if they are worried about getting up for work to turn off the video games and try to go to sleep. Reading a parenting book or a children first aid book instead of video gaming at bedtime would be much better for the whole family. The baby is going to be moving around a lot very soon, even walking and climbing, and the days of expecting the baby to stay where you left it are over. ESH", "how", ">YTA you both suck as parents.\n\nthat's a ESH then...", "can u elaborate why u feel that way", "i dont see how the second half correlates but yes i am naturally a detached person but have been working on improving. i dont criticize gf i barely say anything tbh it always comes out wrong because im blunt and it hurts her feelings", "its hard to talk to her man its always feelings and im more technical and it never gets anywhere", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "i think u misinterpreted a few points i took the melatonin and baby was crying upstairs while i was asleep. i dont know gf was crying until i came back downstairs never ignored her", "Yup! they both neglet their kid all the time it seems. I find it also horrifying how can they have so little care for a SEVEN month old baby.   \nIf I see a kid cry i rush to check if they are okay, even if it's not my baby. And I dont even like children. But cant let a kid that fell without checking if they are alright.", "I hope I'm reading it wrong but it seems like he put the baby in the crib without changing his diaper", "I’m on the fence here because when my eldest was born several pediatricians told us to let her cry for a while so her lungs could get stronger. Granted she was born with weak lungs and I would go running the second I heard her little cry at first but that advice followed me to the rest of my kids. Though I only let them cry for 5 to 10 minutes, NOT half an hour!", "Unless the baby just fell off the bed. Those cries could have been from pain.\n\nThe baby should have been taken to the ER to get checked out.\n\nBoth of them sound neglectful and incompetent.\n\nESH. Except the baby.", ">it's very good advice to put the baby down somewhere safe\n\nYou mean, like the crib the baby was in?\n\nI mean, I understand that she is not doing okay (and being with OP doesnt seem to contribute to her mental health).. But baby was safer in the crib than it would be next to a father that was with an headset playing", "At what point were you trying not to redirect your frustration to your kid? You literally ignored their crying for half the night going as far as to go downstairs to sleep so you wouldn’t have to hear it, and prioritizing a video game, because you think you know something about “attachment” (you don’t). Respond to your baby!", "you should’ve used protection then. it’s time to get ready. ESH since she clearly isn’t ready either.", "Maybe y’all should give the baby up for adoption\n\nIk the foster care system is a mess but I think babies are still wanted very quickly", "Maybe some family therapy would help. It seems like you and your gf need help communicating. And also based on your past comments you have some past trauma that you're confronting. This baby just wants to be held and loved. You're not going to teach him that he can just manipulate people. You're teaching him that his needs will be met. Babies at 7 months old just know that they need something and they cry to communicate that.", "Your child takes priority over video games.", "WTF. You put your headset on? So you could ignore your crying baby to play games? \n\nSounds like you just said “I don’t feel like being a parent right now, I need me time.” And did just that. \n\nParenting is nonstop, especially with a baby. You need to step up. \n\nYou like technical, so you should know that screens make it difficult for a baby to sleep. Having the baby see the flashing screen where he’s supposed to sleep is going to keep him up. Dark and white noise for baby sleep. \n\nAre you getting up at night when the baby wakes up? Do you get up with the baby in the morning? Do you tell your girlfriend to go relax for a while each day while you take care of the baby all in your own?", "Who cares what you communicated prior to the incident? The baby was crying and you decided to keep playing apex. Wtaf is wrong with you?", "OR you could both grow up, get some parenting classes, and start getting it into your minds that this baby has to come first from now on - that means before video games!", "I really do think that giving this child up for adoption or to a more-equipped family member would be in its best interest.", "Have you two considered parenting classes? Maybe an outside view will help you two.", "What research?  Honestly,  what and where are you \"researching\"?\n\nGood grief, you don't even seem to realize that it's neglect to ignore your kid in a crib with a wet diaper or while crying.", "Your research told you to game while the child is sleeping bc the blue lights, overactive video interface, and constant motion are good for sleeping babies? \n\nLike WTF. You’ve read a couple articles. You are by no means an expert on anything, clearly by this post. And if you continue to read and research you will find conflicting advice and realize not anything you read works for your baby. A lot of it is atrial and error. I am a bit repulsed by you getting on your high horse that you research things while you’re sitting there, playing video games and neglect your own child. \n\nYTA.", "I'm not sure she left. He picked up the baby and handed him to her, so I'm wondering if she was there or possibly in the bathroom. Either way, she was near enough he could pick up the baby and hand it off and go back to playing the game. Plus he ignored the baby in favor of the game and  I have a feeling he left out the bits where she said to watch the baby or etc. I think she came downstairs because the baby had been crying for an hour and a half and she was beginning to feel overwhelmed or in danger of hurting him.", "That is true. I wonder if the partner is suffering from postnatal depression? Anyway, I'll change my original verdict, thanks for the feedback", "She didn't leave the baby alone, she left him with his father on the bed.", "never was unsupervised for any of this were both in the same room for the beginning and she heard me coming up so she went down", "... have you taken him to a doctor? 7 months olds cannot manipulate you, if he has a cough, he needs medical attention", "You're an AH.\n\nYou can't just ignore your gf and baby when they are both crying. No wonder you didn't hear your gf ask you to watch the baby'  you ignore her when she cries too.\n Except to drag her back inside and tell her it's all her fault you ignore her.", "Have you seen a doctor with him? A 7 month old baby is not capable of manipulating you for “attention.”", "You're talking about 'attachment patterns' but then you're talking about a cough, so (and not to be rude, I'm sorry) I'm not sure if you're using the term correctly? \n\nThere are 3 attachment patterns: secure, insecure and avoidant. \n\nThe healthiest attachment pattern is 'secure' and you can help your baby to be securely attached by being there and responding appropriately to them all the time. \n\nThis helps children to feel safe, so they become confident, and learn self reliance at their own pace - eventually they won't depend on you. \n\nWhen you ignore children, they don't have the opportunity to feel cared for and safe, so they develop a different attachment style. And this is associated with lifelong poor relationships and a failure to thrive.", "Babies at the age need comfort. I don't even think they recommend sleep training until a year old.", "The child is 7 months old! Maybe instead of neglecting your child, you should take them to the doctor.", "because you both keep leaving a SEVEN MONTH OLD alone!!!", "You pick your crying baby off the floor and hand them off to her so you can continue playing video games? She’s probably struggling with postpartum and a million other things. Also wtf is unhealthy attachment patterns? The baby is completely dependent on the two of you.", "A seven month needs needs constant supervision and the more human contact the better.   When he cries,  it means he needs you.  It's not like construction noise or a train outside that you're supposed to be ignoring. You desperately need to talk to your doctor about resources to learn basic parenting skills.", "As a father of a 10 months old and a childcare worker: If your baby is crying get the fuck up, babies always have a reason to cry, even if you don‘t know it. And you NEVER leave a kid that age unsupervised. Where I live the law even demands for children under 3 to be permanently supervised. As in: if you leave the room, take it with you. Having a seperate room for the kid is fine as long as you get there fast enough as soon as you hear it. Everybody makes mistakes but you don‘t seem to care about leaving a baby alone. That‘s how you fuck kids up.", "You are a failure as a parent and as a partner.  You will ruin this child's life", "She just had a baby. Every organ in her body is readjusting. Cut her some slack mr. Intellectual who thinks babies can be operant conditioned not to cry.\n\nShe's upset because every time the baby cries you ignore it.", "> its always feelings and im more technical\n\nYou state multiple times in another comment thread that the reason you gave her the baby is because you were feeling passive-aggressive and you can't do anything when you don't feel calm. You can't invoke feelings when it's convenient for you and then pretend she's overly emotional and you're purely logical when that suits you.", "Okay, you're more technical. \n\nYour current technique is not working. A successful strategy for coparenting is to acknowledge emotions, and if they are 'negative' emotions, troubleshoot the situation together to build a better situation for everyone involved. \n\nYour partner is a human being. You both have emotions. You yourself said you feel frustration. So, you're not exempt from feelings. Her feelings are valid too.", "You almost killed your baby and then played Apex afterwards. Couldn’t have even been bothered to end the round and comfort him. Jesus my dad sucked and still wouldn’t have been this bad wtf lol", "Ah okay well happy to hear you're not medicating the baby or ignoring your wife crying. ESH still but less so. I read in the other comments you havent been looking after the baby for first 6 months of its life - why?.", "Who takes four melotonin gummies with an infant in the house? What if there's an emergency? Interrupted sleep is just part of the bargain of having a new baby. This is scary. Kids having kids.", "I agree that leaving a baby on the bed with a distracted, disinterested father was a silly move. \nPerhaps by putting baby near dad she was thinking she could force him to have to pay attention to baby so that she could have a minute.\nNot a particularly sensible call, but shes probably chronically sleep deprived and unsupported - not a recipe for clear headed decisions.", "Lol, you're so right but the fact you have to say this...", "She's the one who put the baby in danger. He put the baby in the crib. Baby was perfectly safe in the crib until gf moved him to the bed. That's squarely on her. He could have been watching TV, reading a book or any number of other things. SHE removed the baby from the crib. The baby then became HER responsibility to deal with since she's the one who relocated him/her. He communicated that he'd be playing a game. She chose to ignore that and left the baby on the bed essentially unattended. That was a dumbass thing to do. \n\nI think you're both out of line with how you're dealing with an infant but in this particular case, the problem squarely lays with the person who moved a baby to the bed and then walked away from it. That's gross negligence.\n\nESH\n\nGrow up. Both of you.", "i do not agree whatsoever", "a good idea", "Also, Im not \"blaming\" the partner, before anyone jumps on my throat.   \nThey both were wrong in several situations. Yeah, she might also be in some depression because they are both young, and seem to have zero clue about babies. They both keeping leaving the baby, she because she might not be okay (the crying outside), and him for going to do his things.   \n\n\nBut both should communicate about who is watching the baby, or even where the baby is.", ">she left him with his father on the bed.\n\nNope, she left it on the bed when the father was playing.. Different things.   \nHe had headset on, so, she didnt go to him saying to look out, she left baby on the bed. Leaving with someone who is aware of it, and leaving with someone who previously stated they were doing something, is not the same.  \n\n\nHe fucked up by not paying attention, she fucked up by keep leaving the baby without making sure the partner was aware. If you leave your kid near a fireplace and do not make sure your partner is aware of it, you are also at fault when baby becomes a McRib. they both are too immature to have a baby", ">nd she heard me coming up so she went down\n\nthat literally means unspervised and alone......\n\n&#x200B;\n\n>never was unsupervised\n\nhow did it fell then? Literally cuz there was no one supervising! She wasnt there and you were focused on your game....", "its like a burping cough not a real one. i dont know if it was serious since she said its a thing he does. shes only just moved in with my this month", "i wouldnt have been much help if i was being passive aggressive. a calm mind is a sound mind", "i know ive read about it and i know they can’t manipulate but whenever he crys he has this weird burp/ cough mix is it a big concern?", "homeboy FINISHED THE ROUND.  wow.", "Unless you address this now with parenting classes and therapy. OP, you can do better for your child.", "ive always been in our kids life since day 1. this is just our first apartment together", "and four of them nonetheless!  \nI guess if there was an emergency then the mom would have to fix it alone cuz OP was too sleepy and focused on Apex to help", "This is a matter of bad parenting, not kids having kids. I had my babies at 19 and 20 and I would never act this way. Then again, as the oldest of the cousins, I was pretty much responsible for all of them by the time I was 9, so I had a decade of experience under my belt by the time I had mine. \n\nSome young parents are great. Some older parents are shitty. It’s not really fair to judge parenting skills on age.", ">ot a particularly sensible call, but shes probably chronically sleep deprived and unsupported - not a recipe for clear headed decisions.\n\n100% agree. Im not here trying to say she is an horrible mom. I get that her decisions dont seem to be clear headed (I mean, she did go outside to cry, shows she is not doing okay).  \n\n\nSomeone was in another comment trying to twist my comments to say that im saying that moms should do more than dads and mysogny and shit, while I was just saying: she didnt do the best decisions.   \n\n\nthis is a clear esh and they both seem to be immature and far from prepared to be parents. This whole \"event\" seems bad decision after bad decision, after bad decision, after \\[...\\]", "The baby should be safe with its father no matter where it is in the room. Leaving an infant with its father is not putting it in danger. He admits he saw her do it, he knew the baby was in the bed with him and chose to ignore it for a game.", "yeah i think communication is where we dropped the ball", "You know your baby could have died if it fell wrong, right? They're not exactly known for being tough and resilient. What if your baby suffered permanent brain damage? What if your child landed on their neck and became permanently paralyzed? Would you still feel OK with it?\n\n\n\nIt's not like the baby just waltzed up knocking on your front door one day. The baby didn't ask to exist. The baby can't just go next door to a new set of parents when you two can't be bothered. It's a baby.\n\n\n\nYou should both seek outside help and resources. For god's sake, take that baby to a doctor already! So many conditions look like other conditions to an untrained eye. \n\n\n\nPeople tend to focus on possibilities that aren't ad serious, because they don't *want* their baby to be super sick. That doesn't make it true. Those bad possibilities are still there. This leads to parents missing serious/deadly problems until it's too late. It's not a game.", "You don’t seem to realize how serious this was. Your child could die from the neglect you both are showing. \n\nThere was a case in the news recently where an infant fell off of a bed and got stuck between two pieces of furniture-and died. \n\nYou both are unfit to be parents. Either you both pull your heads out of your asses and realize that the baby comes before both of you and what you “feel like” doing, and take a parenting class, or you need to look into adoption before your negligence kills this baby. \n\nWhat you both want means nothing now. Either step up and start being responsible parents or give this child up.\n\nESH", "Her leaving baby in the crib while she cries outside alone is probably not the worst decision. Especially because her partner can't be fracked to help her, pretends he can't hear or see her, and then parades around like he's the king of sleepytime after pacing out for hours while ignoring them both. \n\nLike if the worst thing lady does is leave the baby in the crib while she has a cry she gonna be fine (she can't leave baby with the OP because OP don't GAF and literally watches baby fall off beds and won't help until she's at the point of sobbing and standing on their stoop).", "The fact that you think leaving a baby with it's father is just as dangerous as leaving it near an open fire says a lot about what you expect from a mom vs a dad. It's his child, he has a legal duty to be aware of it.\n\nShe is not immature for leaving her baby in its father's care. He is wildly immature for caring more about a video game than his child.", "The baby being alone in its crib for literally one minute while the parents switch out is not neglect. People on here need to stop acting like it is wrong for a baby to ever be alone in a room. That baby was fine while the mom and dad switched out. \n\nThe baby being on the bed in the same room as sad is not unsupervised or neglectful on the moms end. She was under the impression that’s grown ass man knows to watch his own kid. That is 100% on OP.", "So for six months you've not been doing anything to care for baby overnights... Cause she has been living elsewhere with baby... \n\nAnd you know zero info about your baby, this cough, and babies that cry. \n\nI can't with you. AH.", "This could just be baby learning to make noises, or it could be something that actually requires attention. You and your partner are clearly struggling with baby and that sounds like colic. \n\nGo see your GP!", "Mother of three. Lots of babies around that age learn that they can make different sounds (including coughs) to get the attention of their caregivers. My middle child loved a good fake cough to make people look at him.", "You are being passive aggressive. \n\nYou watch the baby fall off the bed. And your response is to hand the crying, injured baby to your partner and walk out. That's passive aggressive.", "you say you’ve done a “lot of research” about babies but you don’t even know if a burping cough is a concern or not and you think that coughing is an unhealthy attachment pattern? you should’ve just gotten a plant", "Sounds like he's crying so hard he's sucking in air and then burps while crying.  The answer is to comfort him before he's crying so uncontrollably.", "Definitely see a doctor,  it might be reflux.", "Gots to see it through my boy /s", "Yeah but at your convenience. Why weren't you there from day 1? You had 9 months to prepare...", "Don't worry,  when your infant is in distress you can just put them in a crib and go to another part of the house where you don't hear them.  /s\n\nI'm REALLY wondering what the \"unhealthy\" attachment is, given all the developmentally awful things OP is doing to his child.", "Nope. She took the baby out of the crib. That's so on her. She could have just left the kid in the crib and then none of this shit would have happened. She made a shit decision. \n\nI live with a gamer. If the headset is on, he can't hear jack shit that I say. She knew what he was doing. He communicated it to her. If she needs his help, she has a mouth and can speak up. She didn't. She just moved the baby to the bed and LEFT. He's going to be facing a computer, with a headset on. He doesn't have eyes in the back of his head and he wouldn't hear anything. \n\nLeaving this infant with his father actually did end up being dangerous because she didn't leave the baby where it was (already) safe.", "You didn’t drop a ball you dropped the baby. 🤦🏼‍♀️", ">Her leaving baby in the crib while she cries outside alone is probably not the worst decision. Especially because her partner can't be fracked to help her, pretends he can't hear or see her, and then parades around like he's the king of sleepytime after pacing out for hours while ignoring them both.\n\nshe literally took the baby out of the crib, put on the bed and left tho...  \nbaby fell off the bed because: 1- she put it there and LEFT 2- he didnt pay attention at all to the baby. \n\nThey are both ah as parents. and they both keep leaving the baby unsupervised", "You are purposely twisting words to fit a narrative because that’s not at all what they said", ">The fact that you think leaving a baby with it's father is just as dangerous as leaving it near an open fire \n\nNot even what I said mate.  \nI said you cant leave a baby near a fireplace without making sure your partner is aware. \n\n&#x200B;\n\n> says a lot about what you expect from a mom vs a dad.\n\nwant some fries with your McReach?  \nI dont even put any expectation on mom vs dad, but as partners. \n\n\"If you leave your kid near a fireplace and do not make sure your partner is aware of it, you are also at fault when baby becomes a McRib.\"  \n\n\nso, I said \"partner\" and you went \"yup, they are saying moms needs to pay more attention than dads\"? Cmon, Guiness is not taking any new records for longest reach for a while now", "i do agree after reading through this i realize ive made a lot of mistakes tonight", ">The baby being alone in its crib for literally one minute while the parents switch out is not neglect.\n\nIt wasnt on the crib during the switch, nor it is said such.\n\n&#x200B;\n\n>The baby being on the bed in the same room as sad is not unsupervised or neglectful on the moms end.\n\nIt is when you put your baby next to someone who is not aware of it.\n\nIf the mom is sleeping, and father puts the baby next to her and \"is under the impression that a grown ass woman knows how to watch her own kid\", you will defend the father?  \nIt's negletful on BOTH ends. he was too focused on the game to notice the baby, she was too irresponsible to put the baby on the bed without making sure he was aware of it.   \n\n\nStop defending bad parenting. If one person puts a baby on a spot that accidents can happen, without being sure the other person is aware of it, it's bad parenting. Stop the whole \"mom vs dad\" bullshit to pull a \"poor woman\" card, this isnt about genders, it's about 2 people who are too immature to take care of a baby.  \n\n\nif someone is using a table, and you put a glass of water next to them without them knowing the glass is there, dont be blame only them if they move and knock the glass. One didnt pay attention, the other didnt even care to make sure the other knew it.", "it concerns me i think he’s choking thats why i want him to learn a different way if possible so ive been ignoring the cough and responding to different sounds but obviously i pat him on the back a little but wont pick him up if it’s a cough but pick him up for different sounds", "i didnt watch him fall off cmon man wth and shes better at making him feel better why wouldnt i give him to her", "i didnt look that one up i asked gf to ask doctor about it i never followed up though", ">Don't worry,  when your infant is in distress you can just put them in a crib and go to another part of the house where you don't hear them.  /s\n\nWhile it was not the best response in this situation, please don't denigrate this. It is actually recommended for when parents are overwhelmed. Make sure the baby is clean, fed, right temperature and safe (in a crib) and walk away for a short time to breathe and calm yourself. \n\nA short time crying in the crib without a parent comforting them is a \\*lot\\* less of a problem than a parent so stressed and overextended that they lose control of themselves.\n\nOh, and I had twins, and there were nights where I was so exhausted from the months of sleep deprivation that I could feel the moment that a parent snaps coming close and I DID put them in their cribs safely and walk away and sit just outside my house for a while. \n\nAgain not knowing what the days leading up to this incident were like I can't say if it was or was not the right response for the g/f to walk away in that moment, or if they had agreed that OP should take melatonin to get a nights sleep before work. \n\nBut the walking away when you are feeling that overwhelmed is HEALTHY.", "I'm not convinced she didn't ask OP to watch baby and OP just ignored her cause of the game. OP 'had their headphones on' and I'm guessing that's code for 'ignoring both the crying baby and my partner by cranking up the volume ridiculously so i can't hear anything said to me'", "She shouldn't have to tell him to watch his own child when she leaves the room they are all in.", "You think she's more at fault for leaving her child with its father then he is for ignoring it for a video game. Your misogyny is showing.", "Parenting an infant is really fucking hard. Even moreso when you're young. Keep learning from your mistakes, love that kid as much as possible, and make them your #1 priority. You'll do great.", "The mom went downstairs when she heard the dad was coming up. The OP states that in a comment. If a baby has been crying for hours and you cannot get them to stop the recommended thing to do is to set the baby down in a safe area and walk away. Moms need breaks from crying babies. It’s just the truth. Why would you assume that the mom didn’t set the baby in the crib or another safe place for the time it takes for her to switch out with the dad?\n\nSure, you can argue that the mom should have made sure that OP was in paying attention and aware that she had moved the kid before walking away. But seeing as OP was the one in the room with the kid when they were in the crib, he should have been more aware of the baby in the first place. Or made sure that mom knew that even though he was in that room he wasn’t going to be aware and she needed to plan to be on baby duty.", "For the love of god PLEASE talk to your doctor and ask for some recommendations on parenting books and resources. It doesn't sound like either of you has any idea what you're doing, you're just stabbing in the dark.", "He's not choking though. He's communicating. He's seeking you attention.", "You're better at making baby sleep, why didn't you put baby to bed? \n\nYour logic is basically \"she's worse at getting him to sleep so i let her put him to sleep repeatedly\" and \"she's better at comforting him so when he needs comfort i don't try, but hand him right off. He cries when I change his diaper so i leave\"... \n\nWhere is the logic of \"this is my baby so imma care for it\".", "This is called “weaponized incompetence” look it up. YTA for so many reasons.", "Why are YOU not asking the doctor about it?? Jesus pleesus, are you both just expecting the other one to parent at all times?", "YOU'RE HIS DAD, ASK THE DOCTOR YOURSELF!!", "Yes it is recommended when parents are overwhelmed, but that’s usually when babies are going through their purple crying phase up to 4 months. And it’s also told that when you do take a break, it be no more than FIVE MINUTES. because your baby needs your comfort and cues from your body (like a lower heart rate and calm breathing) to help regulate themselves. not thirty minutes of being ignored when there’s clearly something wrong. which in this case is probably everything considering neither parent seems to give a damn about their baby.", "That's absolutely not what happened here.   I'm not criticizing mum.  She's clearly overwhelmed. \n\nThis dude has repeatedly plunked his kid in the crib and ignored him even while crying and in need of basics like  diaper change.", ">OP 'had their headphones on'\n\n[https://www.reddit.com/r/AmItheAsshole/comments/zrcymp/comment/j12xex0/?utm\\_source=reddit&utm\\_medium=web2x&context=3](https://www.reddit.com/r/AmItheAsshole/comments/zrcymp/comment/j12xex0/?utm_source=reddit&utm_medium=web2x&context=3)  \n\n\nOP also said they were going to play. So, she KNEW he wouldnt hear a simple \"hey, look out for the baby\".. If you say \"hey, im going to take a shower\" and they say in a normal voice when the water is running \"stove is on\", you will not hear. They both F'd up", ">She shouldn't have to tell him to watch his own child when she leaves the room they are all in.\n\nShe also shouldnt take it out of the crib, put on the bed and leave tho....  \nIt's same as turning the oven on and leaving... Yes, people in the kitchen should pay attention, but you shouldnt take of the safety of something and leave", ">You think she's more at fault for leaving her child with its father then he is for ignoring it for a video game.\n\nNope, I think they both fucked up. You are the one trying to reach for it, for some weird reason. Im just saying she wasnt innocent on this.", "thanks for the advice i was laying here for the past 3 hours wondering what was wrong with me. i will mention parenting classes work on communicating and be more attentive", "there was no logic i should cut out my emotions i see they hinder my perception", "It's his baby, not an oven. She should be able to leave the baby with its father without wondering if he will take care of them.", "Try to take the same parenting class with her so you both have the same tools. It'll also be helpful for you both to discuss how you were raised, what you liked about that and what you'd like to change. If you're both on the same page or at least in the same book when it comes to parenting styles, it won't feel like you're fighting against each other as much.", "What emotions? You mention being frustrated by the baby crying. \n\nBabies crying non stop is frustrating. \n\nThat's also why your gf was crying, as a matter of fact. \n\nThe issue is your 'logic and the way you behave around it' not your feelings. Feelings are fine. Behaviors are choices. Your choice is not to help with things you're good at, not to try at things you aren't good at, and to completely ignore anyone who is crying. None of those are problems with your feelings.", "Wow. \n\nThere is absolutely a time and a place for being logical and curbing emotions in order to get stuff done. \n\nThis is not it. \n\nIf you baby is crying, and you hand off to your gf as 'she's better at soothing him' then ..you're free. She's burdened with more parenting than you. \n\nAlso, you're going to be annoyed when your child grows up and isn't interested in spending time with you.", ">She should be able to leave the baby with its father without wondering if he will take care of them.\n\nYes, if you know the father KNOWS the baby was put there. He was playing and with headset, knowing the baby was in the crib, she left baby in the bed and expect him to magically know the baby was taken out of the crib?\n\nDamn, people go hard to try to make her look innocent after she just randomly took baby out of crib and left.if she wasnt planning on staying there, why taking it out of the crib in the first place? especially knowing he was not paying attention at all?\n\n&#x200B;\n\n>It's his baby\n\nTHEIR baby, and she also keeps leaving it unsupervised.  \nI mean, after all that drama, she left baby alone upstairs cuz she heard OP coming up? OP could go up for something completly different OR even she could have misheard, and left the baby alone... cmon, this is Bad Parents 101", "i used to get beat for crying. its hard for me to sympathize with it"]}