{"id": 5285, "submission_id": "zrcymp", "title": "AITA for not watching baby", "selftext": "so me 21(M) and my gf 20 (F) got into an argument tonight because our 7 month old baby fell off the bed onto the carpet. we have a crib in the room next to our bed because ive been trying to stop and unhealthy attachment pattern i see shes creating. \n  before i started playing i took four melatonin gummies and put baby in crib to play a couple games of apex before i went to sleep. this was at 10pm. i have to be at work at 6 am. \n\n  my gf took our son out of crib and put him on bed while i’m in the middle of playing so i didn’t notice he was close to the edge. after he fell he started crying so i picked him up and gave to gf to comfort him until he felt better. after i finished the round i went to change his diaper and he started crying I don’t know why but i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs. \n\n  i woke up an hour later to crying and tried to ignore it to go back to sleep but after 30 minutes it hadn’t stopped so i went upstairs to help. my gf was making her way downstairs and went outside as i was going up. i got him to sleep in under 10 minutes because of tricks i learned from research on guides and also trying out different things. (i just try to recreate the feeling of being in the womb because thats where baby’s come from so thats where they’d be most comfortable) \n\n  after he was asleep i went to get gf from outside and she is visibly upset. she grabs a throw over and goes downstairs. i follow and bring her a blanket. she was crying so i hugged her and after she calmed down she basically said it was my fault he fell and that i was ignoring her struggling to put him down for hours. but she was the one who took him out the crib and i’ve told her plenty times that the way she gets him to sleep is ineffective but she never listened. she’s currently upstairs and I’m downstairs . AITA?", "created_utc": 1671605609, "permalink": "/r/AmItheAsshole/comments/zrcymp/aita_for_not_watching_baby/", "score": 905, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i did not watch baby while playing apex. i could be the asshole because i knew he was on the bed and could’ve paid more attention to prevent fall\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "&#x200B;\n\n>my gf took our son out of crib and **put him on bed**\n\nand left???\n\n&#x200B;\n\n> **took four melatonin** gummies and put baby in crib\n\nand left???\n\n>i woke up an hour later to **crying** and **tried to ignore it**\n\n... dude what?\n\n&#x200B;\n\n> so i went upstairs to help. my gf was making her way downstairs and went outside\n\nshe left baby upstairs alone before you came?\n\n&#x200B;\n\nESH. None of you seems mature enough to have a child.", "ESH - except for this poor child.  I feel like you think you have a puppy or cat instead of an actual human being that they are responsible for.\n\n\"unhealthy attachment pattern i see she's creating\" - what?  Bonding and taking care of your child?\n\n\"so i picked him up and gave to gf to comfort him until he felt better\" - parenting at its finest - are you not capable of comforting your own child.  Do you not feel the natural need to want to do so or are you incapable?\n\n\" i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs\" - That is totally what a MAN does!   /s\n\nWelcome to having a child before you are emotionally ready or capable.", "ESH. Both of you are too immature and self-immersed in order to be proper parents!  You NEVER leave a 7 month old baby on the edge of a bed or even in the middle of it, without keeping a solid eye on them.  Babies roll and move and more have been injured by rolling right off the bed.  You cared more about your game playing than the safety of your baby!  You both behave badly, and you need to grow up because you brought a baby into the world.  That baby deserves two parents who put HIM first instead of themselves!  Grow the f up!", "Neither of you is fit to be a parent. ESH.", "This poor baby", "YTA. A 7 month old needing help to sleep is not an unhealthy attachment. What is unhealthy is the way you prioritize your video games over your child. Grow up.", "You two seem to be fighting over how to care for baby instead of both being present for baby. This battle over how to care for baby should not be about ego but rather anpbout whatever works at that time. And what works for you might not work for her. Babies can have more than one need. The bickering needs to stop.", "Y T A for 'unhealthy attachment pattern' alone. Your partner is teaching your child that they can rely on her for their needs. That's not unhealthy, that builds a secure and confident child! You should try it yourself so that your child knows they can rely on you too 🙄\nEdit: ESH, as your partner shouldn't have left the baby. You both need to take some parenting classes as soon as possible.", "ESH. \n\n>so me 21(M) and my gf 20 (F) got into an argument tonight because our 7 month old baby fell off the bed onto the carpet. we have a crib in the room next to our bed because ive been trying to stop and unhealthy attachment pattern i see shes creating.\n\nThe baby isn't in your bed (and co-sleeping is often safe), so I'm not sure how a crib in your room is creating an unhealthy attachment pattern.\n\n>before i started playing i took four melatonin gummies and put baby in crib to play a couple games of apex before i went to sleep. this was at 10pm. i have to be at work at 6 am. \n\nMelatonin works by turning off electronics. Why would you take it and then start gaming?\n\n>my gf took our son out of crib and put him on bed while i’m in the middle of playing so i didn’t notice he was close to the edge. \n\nWhy was no one watching him?\n\n>after he fell he started crying so i picked him up and gave to gf to comfort him until he felt better.\n\nYou say later that you're better at getting him to sleep, but you can't be bothered comforting your own kid? You're TA.\n\n> after i finished the round i went to change his diaper and he started crying \n\nOh. You couldn't be bothered because you were in the middle of the round. Major you're TA. \n\n>I don’t know why but i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs. \n\nProbably because you realizes he ruined your game, and it's gf's fault? /s\n\n\n>i woke up an hour later to crying and tried to ignore it to go back to sleep but after 30 minutes it hadn’t stopped so i went upstairs to help. \n\nDid anyone check for a concussion? Or maybe not try to ignore their kid? WTF? Also, love that you choose the word help instead of \"take responsibility for my own kid after leaving him to gf.\"\n\n\n>my gf was making her way downstairs and went outside as i was going up. i got him to sleep in under 10 minutes because of tricks i learned from research on guides and also trying out different things. (i just try to recreate the feeling of being in the womb because thats where baby’s come from so thats where they’d be most comfortable) \n\nToo bad you didn't try that when gaming was your first priority. \n\n>after he was asleep i went to get gf from outside and she is visibly upset. she grabs a throw over and goes downstairs. i follow and bring her a blanket. she was crying so i hugged her and after she calmed down she basically said it was my fault he fell and that i was ignoring her struggling to put him down for hours.\n\nYeah, maybe try to notice when the mother of your kid is struggling. Major difference for the life of your child in the future. Also, be faster to step in. And pay attention to your own damn kid if he's out of the crib. \n\n> but she was the one who took him out the crib and i’ve told her plenty times that the way she gets him to sleep is ineffective but she never listened. she’s currently upstairs and I’m downstairs . AITA?\n\nWell she didn't get him out while he was sleeping. She already said she was struggling. You ignored that, turned on the game, ignored him on the bed, handed him over instead of comforting him when you claim to be better at putting him to sleep, walked away and let him cry for another 1.5 hours, then bragged that you can get him down in 10 minutes and she never listens to you? Yes, you are TA.", "YTA: \n\nThings you did. \n\nA)Actively ignored your partner passing off the baby to you when she was exhausted after trying to get baby to sleep. \n\nB)Actively ignored the baby who literally fell off the bed. \n\nC)Handed the baby you were ignoring to the partner who needed a break to comfort when injured. \n\nD)continued to ignore baby. Multiple times. Doing nothing to help- at any point- with putting baby down to bed. \n\nE)completely left the room leaving your partner alone with crying baby to head downstairs. \n\nF)finally taking a shift/turn at putting down when she's at a breaking point and using it as an excuse to criticize your partner. \n\nE)pretending like your partner is horrible for taking a break (leaving baby in a crib to go outside) when you just randomly peace out and if ignore your baby and your partner whether or not baby is secure.", "You’re both assholes", "You are both TA.\n\nYour GF for taking a baby out of its crib, and not looking after him so he fell, and not telling you the baby was on the bed.\n\nYou for handing baby to the mother and nog comforting him, and ignoring crying.\n\nYou both need to get together and make a plan on who does what for the baby.\n\nAnd if your GF is have trouble with getting the baby to bed then you need to step up and stop her from taking him and lying him on the bed etc..\n\nSounds like you both need to learn a great deal. Good luck.", "YTA\n\nFor one extremely simple reason, you prioritized a video game over your child and partner. Additionally, you took melatonin I’m assuming to help you sleep better because she’s expected to wake up with baby all night long. When you are home instead of giving her a break and letting her rest you played a video game. It’s glaringly obvious that she’s struggling just by the information you provided! Not everyone is a pro at parenting, not everyone is a natural. That’s not even considered the fact hormones after pregnancy are completely out of wack, and she might even be struggling mental health issues on top of raising an infant. \n\nShe’s not completely without fault here but your priorities are glaringly obvious and the center of these issues. Log off the game and support your partner, having a kid means sacrifices, especially those first few years.", "ESH.  Your gf for leaving the baby alone and you for ignoring a crying baby.  Oh poor baby.", "YTA you both suck as parents.", "ESH. You both know your baby is a human and not a doll right?", "Woah, I get you might not have been ready to have a child. Many people aren’t when they discover that a child is on the way. That’s why babies take months to develop rather than, ya know, being instantly dropped from the sky by storks. That gives people time to get ready.\n\nI could go into how it seems like there’s resentment building between you and your GF and all that, but honestly, ESH (except the baby). You’re the adults. Time to adult up. Take parenting courses, go to couples counselling if needed, prioritise baby over video games… Idk, but you can’t keep going like this.", "ESH you shouldn’t be parents", "So while you work - she settles the baby... While you play videogames, she settles the baby... when you get frustrated with the baby crying after the diaper change - you put them in the cot crying - and she settles the baby... while you sleep - she settles the baby... and then late  in the night when she's burnt out, frustrated, exhausted, feeling resentful and angry - you finally swoop in, assist and settle the baby, yet it seems you feel superior at doing these things because you have done \"research\" and your way of doing everything is far, far better than hers... it sounds from what you say, that you feel very comfortable undermining the way she is doing things, and criticising her when she is doing what feels instinctive as a mother.\n\nTell me you want a divorce, because this is pretty much a blueprint for how to completely ruin your relationship.\n\nYou are young and I'm assuming this is your first child. So you have a lot to learn, not only about raising a child, but about how to support your partner and work as a team. \n\nI am confused that one minute you understand that a comforting, womb-like experience can help calm an upset baby, but in the same post you criticise your partner for her \"unhealthy\" close, secure attachment to the baby and her \"wrong\" way of comforting them.\n\nWord for the wise. Speak less. Listen more. Videogame less. Spend more time telling your wife that she is beautiful and a wonderful mother.\n\nYTA but it's not too late for you.", "Ohh I hope this is a troll post....it feels like one with all the trigger words/points\n\nYTA\n\n\nAnd then of course on the comments you dropped this crap..\n\n>i was not am not ready to have a child and have made that very clear but am trying to at least be a dad. i get frustrated sometimes because of the way my gf talks to me and treats me and im trying to not let it slip and have it redirect towards our kid\n\nso your parenting style is to stay as detached as possible from the child, and to criticize your girlfriend in hopes she too will stop bonding with the child too.... You literally attempting a form of verbal abuse to get her to neglect your child.....because she choose your child over you. Truly a shitty plan. Just leave the relationship at this point. Be a decent human being  and walk away.", "It's ESH you both behaved like bad but your young and still learning it's not a shame if you need held handling an infant parenting classes are good way and maybe therapy helps your girlfriend maybe it helps her to just talk about her feelings with a third party", "ESH. Your gf shouldn't get the baby out of the crib if she's going to leave him on his own. And you shouldn't ignore your crying baby.\nYou are both neglecting that poor kid, do better.", "Not only are you and your gf TA, but you are ENDANGERING your child. WTF is wrong with you? \n\nPlease get some help before your baby ends up serously hurt or worse!", "You both need professional support I think. Parent shaming isn’t gonna achieve much, but you two need to discuss your methods together and communicate properly, then possibly see a guidance counsellor for help and advice.", "I can’t get over the part where your baby falls on the ground and you’re just worried about finishing your video game. \n\nESH", "YTA and not ready to be a father. Since you already are - WAKE UP.\n\nStop playing games, start taking care of your baby, don't pass him to your gf every time he cries, don't call giving attention to the baby 'unhealthy attachment pattern', give attention to the baby all the time, don't get frustrated and leave him alone to go to sleep. Just be there for him he is a baby he needs someone all the time and not just your gf.", ">Too many words when \"child neglect\" would've sufficed.\n\nYTA", "ESH. Both of you contributed to a dangerous situation for your child who was left unattended on a bed and in general inattentive. To be clear, your girlfriend more so but I do understand why she may have thought you’d be aware of your child in the room with you. \n\nThere’s a lot of comments about it being smart to set a child safely down and walk away for a minute if you are truly overwhelmed. And yes, that is a very smart choice, 99% of the time. The 1% of the time I wouldn’t feel comfortable ignoring cries? After your baby has fallen. Your baby fell off the bed. You need to be paying extra attention to make sure he’s ok. If you don’t feel capable of sucking it up and dealing with the crying in that situation to ensure he’s ok, it was the time to reach out for help from a friend, family member etc. \n\nBabies who’ve fallen need to be monitored. This would be my exception to saying it’s safe to let them cry while you take a break.", "You’re getting your ass handed to you and probably rightfully so. That said, I’m 41 years old and my daughter is 21 so you can do the math and decide for yourself if I can relate. \n\nYour whole story sounds very familiar. \n\nY’all are kids raising kids. You’re not emotionally mature enough to do what you’ve signed up to do. Honestly - the only thing you can do about it at this point is to try your best. My therapist once told me “we all fuck our kids up in different ways” … so yes, you are fucking your kid up. But then my parents fucked me up in their own way but tried their best, I fucked up my oldest kid but she’s alright and my younger kids are also probably getting fucked up. It’s life. \n\nYour baby is not going to suffer long term consequences of rolling off the bed once. \n\nThat said, as a parent your kids needs now come before your wants. That is very very hard to do in your late teens/early twenties. As a baby their needs are greater and demanding. No you don’t get to finish your game. Before you know it they’ll be playing with you but for now, you have to set yourself aside and care for your child and be a partner for your girlfriend before you end up a weekend dad and your kid ends up a statistic.", "What is wrong with you both? Act like parents or give the baby up if you aren't going to care for it correctly.", "“I got him to sleep in under 10 minutes because of tricks I learned from research and guides and also trying out different things”\n\nNot wanting to rain on your parade here, but this has less to do with you having superior research and techniques than your gf, and more to do with the fact that you’d necked 4 melatonin gummies and had been asleep/resting for over an hour and a half so were more relaxed than your stressed and overwhelmed GF, whose emotions the baby was picking up on.\n\nIf she could swan off to chill for an hour and a half without even checking it was ok to do so whenever she felt like it, she would most likely be more relaxed too. But she can’t even put him right next to you for a few minutes when she’s stressed without worrying if you’re too engrossed in a game to actually bother parenting your own child! \n\nESH, you both need to communicate better, but you’re the bigger AH in this instance. Why on earth would you carry on gaming knowing your baby was on the bed next to you? Is a game really more important to you than his health and wellbeing? \n I totally get that having to stop mid game is annoying, but it’s nowhere near as bad as having your child die from an accident you could’ve prevented but didn’t because you were playing a computer game!", "You are both negligent. Kids having kids.", "YTA, but not just you, your girlfriend is too!", "ESH. You're going to get a lot of crap probably for mentioning playing video games. I don't see that as the problem here. Hopefully i remember everything here right...She sucked for not making sure you noticed she had taken him out of the crib. Then you sucked for just handing him over when he fell. You sucked again for taking off and leaving her when he cried later. She sucked for not communicating better. You suck for sounded so arrogant like you're better at getting him to sleep yet you left it to her a couple times. It all sounds so childish . Play your games, but just communicate with each other. You guys sound young, and I remember how hard it was to switch my mind frame to my want and needs not being the most important thing anymore. Now I'm watching my own daughter go through the same thing as a new parent at 21. Having a baby is difficult; you have to learn to talk to each other better.", "YTA, and it sounds like your S.O. is suffering from depression or sleep deprivation, trying to meet your child’s needs, since you aren’t. Look, dude, the thing about babies is that they aren’t spoiled. They cry to get urgent needs met and to communicate! Unhealthy attachment? Like, as in being able to feel secure that his parents will help him if he’s uncomfortable, lonely, hungry, or wet? Y’all both need help, but come on now. Your son is more important than Apex! Your S.O. sounds overwhelmed. Get it together. There is no scenario twist in which you are not the AH, for your negligence alone.", "ESH. Both of your are endangering your baby’s life and are not prepared to be parents. This is a massive commitment and you need to be ready to be physically and emotionally invested in the baby above everything else. If you aren’t prepared to do this, you may want to seriously consider adoption. It doesn’t sound like either of you want to be parents, and it doesn’t look like that baby will be okay in your care", "ESH, don't have kids at 21 you fool. What appalled me the most was how you decided to take 4 melatonin gummies with a baby in the house.", "ESH except the poor baby. You two should not be parents. This is an example of being way too young and immature. Holy shit.", "I feel sorry for this baby. Both of its parents are neglectful, immature people who have no business being parents.", "ESH. Wonderful, two young parents who have no interest in the responsibility that comes with having a child and who blame each other for the neglect of that child. Throw in physical abuse and you have my childhood. OP, babies are supposed to be attached to their parents. That's healthy. Neglect is not and it can end up with the baby being injured as likely happened when your son when he fell off the bed. When he was crying, did you check to see if he was hurt by the fall? No, you put him in his crib and left him there.", "Info: where do you live so we can contact CPS?", "YTA.\n\nYTA, YTA, YTA!\n\nDude, what the hell is wrong with you? You're a parent of an infant - YOU DON'T HAVE TIME TO BE GAMING, YOU CHILDISH NITWIT!\n\nWhen you two created a new life, that became your HIGHEST priority. That means that things like a social life, gaming, vegging out, de-stressing, chilling, or ANY OTHER LAID-BACK ACTIVITY are pretty much **gone**. \n\nYou're a parent. You get to have a life once that child is fully grown and able to \"adult\" successfully...but then, from your post it seems that you don't have that down, yourself, yet.\n\nGrow up, little man, and start being an adult. If you don't, then you will be yet another sad example of someone who can't understand why their life just flipped upside-down.", "YTA", "“I picked him up and gave to gf to comfort…”  And you couldn’t try to comfort him because…?”  Oh that’s right. Your stupid game was more important.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nso me 21(M) and my gf 20 (F) got into an argument tonight because our 7 month old baby fell off the bed onto the carpet. we have a crib in the room next to our bed because ive been trying to stop and unhealthy attachment pattern i see shes creating. before i started playing i took four melatonin gummies and put baby in crib to play a couple games of apex before i went to sleep. this was at 10pm. i have to be at work at 6 am. my gf took our son out of crib and put him on bed while i’m in the middle of playing so i didn’t notice he was close to the edge. after he fell he started crying so i picked him up and gave to gf to comfort him until he felt better. after i finished the round i went to change his diaper and he started crying I don’t know why but i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs. i woke up an hour later to crying and tried to ignore it to go back to sleep but after 30 minutes it hadn’t stopped so i went upstairs to help. my gf was making her way downstairs and went outside as i was going up. i got him to sleep in under 10 minutes because of tricks i learned from research on guides and also trying out different things. (i just try to recreate the feeling of being in the womb because thats where baby’s come from so thats where they’d be most comfortable) after he was asleep i went to get gf from outside and she is visibly upset. she grabs a throw over and goes downstairs. i follow and bring her a blanket. she was crying so i hugged her and after she calmed down she basically said it was my fault he fell and that i was ignoring her struggling to put him down for hours. but she was the one who took him out the crib and i’ve told her plenty times that the way she gets him to sleep is ineffective but she never listened. she’s currently upstairs and I’m downstairs . AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "ESH.  And let me be clear, the only reason she sucks too is because she left the baby on the bed.  You suck way more.  First, infants, being infants and not being able to do anything for themselves are supposed to be attached to their caregivers.  In other words, you don't want to be inconvenienced.  Stop checking out and leaving the mental load on your gf.  It's ok to take a break, but to say eh, screw it and leave him after he could of had a potential head injury, is not.   I suggest, while you are busy being all smug and looking up stuff, to look up some child development books,", "The only “unhealthy attachment” a baby that young can have is if there’s too little attachment. At that age, there’s no such thing as too much. Please familiarize yourself with the basics of attachment theory.", "YTA and your 7 month old is not capable of an “unhealthy attachment pattern” but you definitely are. What you just described is neglect.", "Who's parenting your girlfriend and you while all of this is going on? \n\nESH.", "ESH.. you two do not seem mature enough for the responsibilities of having a child.", "ESH\n\nBoth of you are terrible parents", "You left your child crying, tried to ignore it and go back to sleep, and the child is still crying 30 min later and THATS WHEN YOU DECIDED TO DO SOMETHING?! \n\nYTA. Yikes dude….", "ESH \n\nY’all obviously have no business raising a puppy let alone a human being, but the kid is here so you need to do better. \n\nYou gave up your right to a chill night with the Xbox when you put your sperm where it clearly had no business being. Your youth is OVER. Your a dad now. Get in dad-mode. Also - use SO MUCH birth control. Another kid will make your current situation 1000x harder. \n\nSign up for parenting classes and don’t take drugs - including sleep aids - unless you have communicated to you partner that you are doing so and they have agreed to be 100% in charge of the baby while you’re out cold/high.", "ESH-Does she work or is she a SAHM? I feel like there’s a lot missing to this story but overall it sounds like you both are immature to have a child. Please try and get some help from a parent or other family member.", "I pity young mothers. YTA and your empathy for your child is horrifyingly low. Maybe look into some actual child development research about meeting needs at such a young age.", "Esh - both of you need to sign up for a parenting class asap. This is why people say you should not be having babies until you are older. For while a small percentage are mature and can handle it. Unfortunately most cannot.", "YTA  \nunhealthy attachment pattern?! You're talking about a 7 month old and his parent, not a teenager and an inappropriate crush, babies need attachment to thrive  \nhaving said that, nothing wrong with a crib, it is indeed a safer place then an open bed  \n\n\nyou taking that much melatonin and starting gaming apparently means you're off the parent clock? I didn't know that was an option  \n\"after i finished the round i went to change his diaper and he started crying I don’t know why but i got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs.\"  \nYou didn't think the crying meant something? it was just a frustration to you that you can leave behind upstairs? What if he was actually hurt falling of the bed? what if he needed something? what the hell man?!  \n\n\nyou let your overwhelmed wife and your crying baby struggle together for 30 mins before you went to \"help\" with your superior baby knowledge that your wife just refuses to listen to  \nYou sound like an insufferable, checked out father and husband", "ESH. How high was the bed?? A seventh month old calling should be a trip to the doctor to have him checked for injuries or a concussion. But you two just let him cry an cry and focus on your own trivial things...that's not responsible.", "Who's bright idea was it to have a baby because the both of you seem like you don't want to be f****** bothered with the baby. Both of you need to get your s*** together", "YTA  When I was a baby I rolled off a bed. I broke my leg and spent the next six months in a body cast.\n\nYou are not just an AH, you are negligent.  Seven month old babies do not have \"unhealthy attachments\".  Your baby is more important than your stupid game, and babies cry because they need something and have no other way to communicate.", "I just can't fathom how immature \"kids\" (even if they are legal adults) are having other kids these days. This is why most people under 30 shouldn't have kids.\n\nObviously YTA. You're neglecting your baby.", "YTA and I hope someone calls CPS on you because your baby is in danger.", "This is a dumpster fire. I just want you to know that my full grown dog just tripped, face planted into concrete, scraped his nose and paw pad, started crying and I picked his 100 lb ass up, carried him inside, patched him up, and am currently laying on the couch with him half in my lap comforting him… A DOG. \n\nI have since concluded that I, a 25f with no children (but many pets) am a better (human) parent than you guys are. \n\nSo in conclusion ESH and y’all need to get your shit together. Thanks for coming to my Ted Talk.", "Esh. That poor child. 😭", "ESH. You both sound unprepared for parenthood but you have a child now and need to grow up, like yesterday. \n\nYour baby's needs always come first, before your sleep and Apex. There is also no such thing as an unhealthy attachment for a 7-month-old. Where I live we have something called the \"reach out center for kids\" and perhaps you have something similar in your area. They often have social workers and/or offer courses about parenting. Perhaps you didn't have any positive role models and nurturing people in your life growing up but it's not too late to be one for your son. He deserves to grow up being safe and feeling loved and it's your job to give that to him. Get help.", "Nta, don’t listen to the people on here talking shit cause they probably don’t have kids", "YTA\n\nSays ‘don’t want baby to get bad habits’\nTakes 4 melatonins(which the body produces in response to darkness to prepare brain to sleep)\nThen process to play computer game with bright flashy lights totally defeating the melatonin.\nBut it’s the 7month old who has bad habits right?\nBad habits like wanting comfort when hurt.", "Ew you guys make me feel bad for that poor baby", "YTA Please please search for help raising your kid. You both sound utterly incapable of raising a child. You can’t put a baby on a bed, you can’t take four melatonin while caring for a kid and you certainly cannot ignore your crying kid. You’re in urgent need of help. You’re neglecting your kid and putting him in great danger. Please search for help. He deserves it.", "YTA and a terrible boyfriend and parent.", "YTA. Why did you procreate?", "YTA\n\nBad parenting all around. You don’t take 4 melatonin because you need to be able to wake up for the baby, or put him on the bed next to a dad that ignores his kid for a game, or keep ignoring him.", "YTA. Holy shit. Have you two considered maybe handing over parenting responsibilities to people more equipped?", "I hope CPS comes for the both of you soon. Poor baby.", "ESH - I see a visit from CPS in your future", "ESA. Why are children having children they are not ready to have.", "More melatonin does not mean more sleepy.\n\nESH.", "Typical gamer shit.  You’re both neglecting the kid with careless, absolutely brainless thoughtlessness. But go finish your round by all fucking means.  Ybta, but especially you,", "ESH and I’m worried for your kid.", "I’m absolutely horrified that you didn’t take your baby to the hospital after they fell. My niece fell off a bed and fractured her skull. She was three months old. Both of you should not be parents. Stop playing video games and actually look after this human! ESH", "Why did you have a child if you were just going to ignore it?\n\nYTA", "ESH except the baby. Next time wrap your dick or get an abortion, because neither of you have the maturity or mental capacity to be parents.", "YTA. Your infant son fell off of bed and injured himself and you handed him off to finish playing your video game? This beyond everything else makes you the asshole.", "I'm sorry, you gave four melatonin gummies to a BABY? What, he wasnt falling asleep fast enough for your convenience??? And then you tried to ignore the sound of your wife crying? And only got up to comfort her when she wouldn't shut up? And yeah, she is an idiot for leaving him unsupervised on the bed. ESH except the baby ofc, I hope the poor little thing has very good luck...", "NTA", "Dude your wife just had a kid and her body and hormones don’t just snap back to normal right when baby comes. It can take up to a year.", "> ive been trying to stop and unhealthy attachment pattern i see shes creating\n\nAlso this. I mean, seriously, what is wrong with OP? The baby is 7 MONTHS, he needs nothing more than attachment!!", "He left his seven month old crying for *half an hour* and ignored it.  This is neglect.   It's horrifying", "Sometimes if your baby has been crying for a long time, and you're feeling yourself getting very upset or frustrated, it's very good advice to put the baby down somewhere safe, step away and take a couple of minutes to breathe and be calm, and then go back in.\nChild health nurses in my country recommend this, because of things like shaken baby syndrome. It's necessary to step away sometimes.", "I get her leaving him alone if she felt she was at risk of hurting him. I'm not saying she was thinking that because I have no way of knowing, but it could be a factor.", "Did she leave?", "i was not am not ready to have a child and have made that very clear but am trying to at least be a dad. i get frustrated sometimes because of the way my gf talks to me and treats me and im trying to not let it slip and have it redirect towards our kid", "i did communicate i was going to play a couple rounds of apex before bed and i had my headset on", "should we throw him out?", "my ego does come out a little in my parenting style i do a lot of research and i always get criticized or critiqued for pretty much anything i do", ">Your partner is teaching your child that they can rely on her for their needs.\n\nYet, for at least 2 different situations, the partner left the baby completely alone....  \n\n\n> so i went upstairs to help. my gf was making her way downstairs\n\nshe left the baby before he even made it upstairs.\n\n&#x200B;\n\n>my gf took our son out of crib and put him on bed\n\nshe left.... that's not \"you can rely on me\", that's \"im putting you in the bed and leave\"\n\n&#x200B;\n\nthey both keep leaving a **seven** month old unsupervised.", "when i say unhealthy attachment pattern i mean he devolved a nasty sounding cough mixed with cry that sounds really concerning when its not. im trying to have him grow out of that and find a different cue to get attention", "Honestly, I am not sure I would advise co-sleeping as safe, to people who can both be there yet not notice the baby moving till they fell off the bed, while at least one of them was awake. Co-sleeping is also not recommended for people who use sleep aids- like melatonin. For this specific couple, I absolutely think that the crib is the safest place for this child to be at night. \n\nOP needs to get them both to a parenting class so they can communicate, and also learn if they are worried about getting up for work to turn off the video games and try to go to sleep. Reading a parenting book or a children first aid book instead of video gaming at bedtime would be much better for the whole family. The baby is going to be moving around a lot very soon, even walking and climbing, and the days of expecting the baby to stay where you left it are over. ESH", "how", ">YTA you both suck as parents.\n\nthat's a ESH then...", "can u elaborate why u feel that way", "i dont see how the second half correlates but yes i am naturally a detached person but have been working on improving. i dont criticize gf i barely say anything tbh it always comes out wrong because im blunt and it hurts her feelings", "its hard to talk to her man its always feelings and im more technical and it never gets anywhere", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "i think u misinterpreted a few points i took the melatonin and baby was crying upstairs while i was asleep. i dont know gf was crying until i came back downstairs never ignored her", "Yup! they both neglet their kid all the time it seems. I find it also horrifying how can they have so little care for a SEVEN month old baby.   \nIf I see a kid cry i rush to check if they are okay, even if it's not my baby. And I dont even like children. But cant let a kid that fell without checking if they are alright.", "I hope I'm reading it wrong but it seems like he put the baby in the crib without changing his diaper", "I’m on the fence here because when my eldest was born several pediatricians told us to let her cry for a while so her lungs could get stronger. Granted she was born with weak lungs and I would go running the second I heard her little cry at first but that advice followed me to the rest of my kids. Though I only let them cry for 5 to 10 minutes, NOT half an hour!", "Unless the baby just fell off the bed. Those cries could have been from pain.\n\nThe baby should have been taken to the ER to get checked out.\n\nBoth of them sound neglectful and incompetent.\n\nESH. Except the baby.", ">it's very good advice to put the baby down somewhere safe\n\nYou mean, like the crib the baby was in?\n\nI mean, I understand that she is not doing okay (and being with OP doesnt seem to contribute to her mental health).. But baby was safer in the crib than it would be next to a father that was with an headset playing", "At what point were you trying not to redirect your frustration to your kid? You literally ignored their crying for half the night going as far as to go downstairs to sleep so you wouldn’t have to hear it, and prioritizing a video game, because you think you know something about “attachment” (you don’t). Respond to your baby!", "you should’ve used protection then. it’s time to get ready. ESH since she clearly isn’t ready either.", "Maybe y’all should give the baby up for adoption\n\nIk the foster care system is a mess but I think babies are still wanted very quickly", "Maybe some family therapy would help. It seems like you and your gf need help communicating. And also based on your past comments you have some past trauma that you're confronting. This baby just wants to be held and loved. You're not going to teach him that he can just manipulate people. You're teaching him that his needs will be met. Babies at 7 months old just know that they need something and they cry to communicate that.", "Your child takes priority over video games.", "WTF. You put your headset on? So you could ignore your crying baby to play games? \n\nSounds like you just said “I don’t feel like being a parent right now, I need me time.” And did just that. \n\nParenting is nonstop, especially with a baby. You need to step up. \n\nYou like technical, so you should know that screens make it difficult for a baby to sleep. Having the baby see the flashing screen where he’s supposed to sleep is going to keep him up. Dark and white noise for baby sleep. \n\nAre you getting up at night when the baby wakes up? Do you get up with the baby in the morning? Do you tell your girlfriend to go relax for a while each day while you take care of the baby all in your own?", "Who cares what you communicated prior to the incident? The baby was crying and you decided to keep playing apex. Wtaf is wrong with you?", "OR you could both grow up, get some parenting classes, and start getting it into your minds that this baby has to come first from now on - that means before video games!", "I really do think that giving this child up for adoption or to a more-equipped family member would be in its best interest.", "Have you two considered parenting classes? Maybe an outside view will help you two.", "What research?  Honestly,  what and where are you \"researching\"?\n\nGood grief, you don't even seem to realize that it's neglect to ignore your kid in a crib with a wet diaper or while crying.", "Your research told you to game while the child is sleeping bc the blue lights, overactive video interface, and constant motion are good for sleeping babies? \n\nLike WTF. You’ve read a couple articles. You are by no means an expert on anything, clearly by this post. And if you continue to read and research you will find conflicting advice and realize not anything you read works for your baby. A lot of it is atrial and error. I am a bit repulsed by you getting on your high horse that you research things while you’re sitting there, playing video games and neglect your own child. \n\nYTA.", "I'm not sure she left. He picked up the baby and handed him to her, so I'm wondering if she was there or possibly in the bathroom. Either way, she was near enough he could pick up the baby and hand it off and go back to playing the game. Plus he ignored the baby in favor of the game and  I have a feeling he left out the bits where she said to watch the baby or etc. I think she came downstairs because the baby had been crying for an hour and a half and she was beginning to feel overwhelmed or in danger of hurting him.", "That is true. I wonder if the partner is suffering from postnatal depression? Anyway, I'll change my original verdict, thanks for the feedback", "She didn't leave the baby alone, she left him with his father on the bed.", "never was unsupervised for any of this were both in the same room for the beginning and she heard me coming up so she went down", "... have you taken him to a doctor? 7 months olds cannot manipulate you, if he has a cough, he needs medical attention", "You're an AH.\n\nYou can't just ignore your gf and baby when they are both crying. No wonder you didn't hear your gf ask you to watch the baby'  you ignore her when she cries too.\n Except to drag her back inside and tell her it's all her fault you ignore her.", "Have you seen a doctor with him? A 7 month old baby is not capable of manipulating you for “attention.”", "You're talking about 'attachment patterns' but then you're talking about a cough, so (and not to be rude, I'm sorry) I'm not sure if you're using the term correctly? \n\nThere are 3 attachment patterns: secure, insecure and avoidant. \n\nThe healthiest attachment pattern is 'secure' and you can help your baby to be securely attached by being there and responding appropriately to them all the time. \n\nThis helps children to feel safe, so they become confident, and learn self reliance at their own pace - eventually they won't depend on you. \n\nWhen you ignore children, they don't have the opportunity to feel cared for and safe, so they develop a different attachment style. And this is associated with lifelong poor relationships and a failure to thrive.", "Babies at the age need comfort. I don't even think they recommend sleep training until a year old.", "The child is 7 months old! Maybe instead of neglecting your child, you should take them to the doctor.", "because you both keep leaving a SEVEN MONTH OLD alone!!!", "You pick your crying baby off the floor and hand them off to her so you can continue playing video games? She’s probably struggling with postpartum and a million other things. Also wtf is unhealthy attachment patterns? The baby is completely dependent on the two of you.", "A seven month needs needs constant supervision and the more human contact the better.   When he cries,  it means he needs you.  It's not like construction noise or a train outside that you're supposed to be ignoring. You desperately need to talk to your doctor about resources to learn basic parenting skills.", "As a father of a 10 months old and a childcare worker: If your baby is crying get the fuck up, babies always have a reason to cry, even if you don‘t know it. And you NEVER leave a kid that age unsupervised. Where I live the law even demands for children under 3 to be permanently supervised. As in: if you leave the room, take it with you. Having a seperate room for the kid is fine as long as you get there fast enough as soon as you hear it. Everybody makes mistakes but you don‘t seem to care about leaving a baby alone. That‘s how you fuck kids up.", "You are a failure as a parent and as a partner.  You will ruin this child's life", "She just had a baby. Every organ in her body is readjusting. Cut her some slack mr. Intellectual who thinks babies can be operant conditioned not to cry.\n\nShe's upset because every time the baby cries you ignore it.", "> its always feelings and im more technical\n\nYou state multiple times in another comment thread that the reason you gave her the baby is because you were feeling passive-aggressive and you can't do anything when you don't feel calm. You can't invoke feelings when it's convenient for you and then pretend she's overly emotional and you're purely logical when that suits you.", "Okay, you're more technical. \n\nYour current technique is not working. A successful strategy for coparenting is to acknowledge emotions, and if they are 'negative' emotions, troubleshoot the situation together to build a better situation for everyone involved. \n\nYour partner is a human being. You both have emotions. You yourself said you feel frustration. So, you're not exempt from feelings. Her feelings are valid too.", "You almost killed your baby and then played Apex afterwards. Couldn’t have even been bothered to end the round and comfort him. Jesus my dad sucked and still wouldn’t have been this bad wtf lol", "Ah okay well happy to hear you're not medicating the baby or ignoring your wife crying. ESH still but less so. I read in the other comments you havent been looking after the baby for first 6 months of its life - why?.", "Who takes four melotonin gummies with an infant in the house? What if there's an emergency? Interrupted sleep is just part of the bargain of having a new baby. This is scary. Kids having kids.", "I agree that leaving a baby on the bed with a distracted, disinterested father was a silly move. \nPerhaps by putting baby near dad she was thinking she could force him to have to pay attention to baby so that she could have a minute.\nNot a particularly sensible call, but shes probably chronically sleep deprived and unsupported - not a recipe for clear headed decisions.", "Lol, you're so right but the fact you have to say this...", "She's the one who put the baby in danger. He put the baby in the crib. Baby was perfectly safe in the crib until gf moved him to the bed. That's squarely on her. He could have been watching TV, reading a book or any number of other things. SHE removed the baby from the crib. The baby then became HER responsibility to deal with since she's the one who relocated him/her. He communicated that he'd be playing a game. She chose to ignore that and left the baby on the bed essentially unattended. That was a dumbass thing to do. \n\nI think you're both out of line with how you're dealing with an infant but in this particular case, the problem squarely lays with the person who moved a baby to the bed and then walked away from it. That's gross negligence.\n\nESH\n\nGrow up. Both of you.", "i do not agree whatsoever", "a good idea", "Also, Im not \"blaming\" the partner, before anyone jumps on my throat.   \nThey both were wrong in several situations. Yeah, she might also be in some depression because they are both young, and seem to have zero clue about babies. They both keeping leaving the baby, she because she might not be okay (the crying outside), and him for going to do his things.   \n\n\nBut both should communicate about who is watching the baby, or even where the baby is.", ">she left him with his father on the bed.\n\nNope, she left it on the bed when the father was playing.. Different things.   \nHe had headset on, so, she didnt go to him saying to look out, she left baby on the bed. Leaving with someone who is aware of it, and leaving with someone who previously stated they were doing something, is not the same.  \n\n\nHe fucked up by not paying attention, she fucked up by keep leaving the baby without making sure the partner was aware. If you leave your kid near a fireplace and do not make sure your partner is aware of it, you are also at fault when baby becomes a McRib. they both are too immature to have a baby", ">nd she heard me coming up so she went down\n\nthat literally means unspervised and alone......\n\n&#x200B;\n\n>never was unsupervised\n\nhow did it fell then? Literally cuz there was no one supervising! She wasnt there and you were focused on your game....", "its like a burping cough not a real one. i dont know if it was serious since she said its a thing he does. shes only just moved in with my this month", "i wouldnt have been much help if i was being passive aggressive. a calm mind is a sound mind", "i know ive read about it and i know they can’t manipulate but whenever he crys he has this weird burp/ cough mix is it a big concern?", "homeboy FINISHED THE ROUND.  wow.", "Unless you address this now with parenting classes and therapy. OP, you can do better for your child.", "ive always been in our kids life since day 1. this is just our first apartment together", "and four of them nonetheless!  \nI guess if there was an emergency then the mom would have to fix it alone cuz OP was too sleepy and focused on Apex to help", "This is a matter of bad parenting, not kids having kids. I had my babies at 19 and 20 and I would never act this way. Then again, as the oldest of the cousins, I was pretty much responsible for all of them by the time I was 9, so I had a decade of experience under my belt by the time I had mine. \n\nSome young parents are great. Some older parents are shitty. It’s not really fair to judge parenting skills on age.", ">ot a particularly sensible call, but shes probably chronically sleep deprived and unsupported - not a recipe for clear headed decisions.\n\n100% agree. Im not here trying to say she is an horrible mom. I get that her decisions dont seem to be clear headed (I mean, she did go outside to cry, shows she is not doing okay).  \n\n\nSomeone was in another comment trying to twist my comments to say that im saying that moms should do more than dads and mysogny and shit, while I was just saying: she didnt do the best decisions.   \n\n\nthis is a clear esh and they both seem to be immature and far from prepared to be parents. This whole \"event\" seems bad decision after bad decision, after bad decision, after \\[...\\]", "The baby should be safe with its father no matter where it is in the room. Leaving an infant with its father is not putting it in danger. He admits he saw her do it, he knew the baby was in the bed with him and chose to ignore it for a game.", "yeah i think communication is where we dropped the ball", "You know your baby could have died if it fell wrong, right? They're not exactly known for being tough and resilient. What if your baby suffered permanent brain damage? What if your child landed on their neck and became permanently paralyzed? Would you still feel OK with it?\n\n\n\nIt's not like the baby just waltzed up knocking on your front door one day. The baby didn't ask to exist. The baby can't just go next door to a new set of parents when you two can't be bothered. It's a baby.\n\n\n\nYou should both seek outside help and resources. For god's sake, take that baby to a doctor already! So many conditions look like other conditions to an untrained eye. \n\n\n\nPeople tend to focus on possibilities that aren't ad serious, because they don't *want* their baby to be super sick. That doesn't make it true. Those bad possibilities are still there. This leads to parents missing serious/deadly problems until it's too late. It's not a game.", "You don’t seem to realize how serious this was. Your child could die from the neglect you both are showing. \n\nThere was a case in the news recently where an infant fell off of a bed and got stuck between two pieces of furniture-and died. \n\nYou both are unfit to be parents. Either you both pull your heads out of your asses and realize that the baby comes before both of you and what you “feel like” doing, and take a parenting class, or you need to look into adoption before your negligence kills this baby. \n\nWhat you both want means nothing now. Either step up and start being responsible parents or give this child up.\n\nESH", "Her leaving baby in the crib while she cries outside alone is probably not the worst decision. Especially because her partner can't be fracked to help her, pretends he can't hear or see her, and then parades around like he's the king of sleepytime after pacing out for hours while ignoring them both. \n\nLike if the worst thing lady does is leave the baby in the crib while she has a cry she gonna be fine (she can't leave baby with the OP because OP don't GAF and literally watches baby fall off beds and won't help until she's at the point of sobbing and standing on their stoop).", "The fact that you think leaving a baby with it's father is just as dangerous as leaving it near an open fire says a lot about what you expect from a mom vs a dad. It's his child, he has a legal duty to be aware of it.\n\nShe is not immature for leaving her baby in its father's care. He is wildly immature for caring more about a video game than his child.", "The baby being alone in its crib for literally one minute while the parents switch out is not neglect. People on here need to stop acting like it is wrong for a baby to ever be alone in a room. That baby was fine while the mom and dad switched out. \n\nThe baby being on the bed in the same room as sad is not unsupervised or neglectful on the moms end. She was under the impression that’s grown ass man knows to watch his own kid. That is 100% on OP.", "So for six months you've not been doing anything to care for baby overnights... Cause she has been living elsewhere with baby... \n\nAnd you know zero info about your baby, this cough, and babies that cry. \n\nI can't with you. AH.", "This could just be baby learning to make noises, or it could be something that actually requires attention. You and your partner are clearly struggling with baby and that sounds like colic. \n\nGo see your GP!", "Mother of three. Lots of babies around that age learn that they can make different sounds (including coughs) to get the attention of their caregivers. My middle child loved a good fake cough to make people look at him.", "You are being passive aggressive. \n\nYou watch the baby fall off the bed. And your response is to hand the crying, injured baby to your partner and walk out. That's passive aggressive.", "you say you’ve done a “lot of research” about babies but you don’t even know if a burping cough is a concern or not and you think that coughing is an unhealthy attachment pattern? you should’ve just gotten a plant", "Sounds like he's crying so hard he's sucking in air and then burps while crying.  The answer is to comfort him before he's crying so uncontrollably.", "Definitely see a doctor,  it might be reflux.", "Gots to see it through my boy /s", "Yeah but at your convenience. Why weren't you there from day 1? You had 9 months to prepare...", "Don't worry,  when your infant is in distress you can just put them in a crib and go to another part of the house where you don't hear them.  /s\n\nI'm REALLY wondering what the \"unhealthy\" attachment is, given all the developmentally awful things OP is doing to his child.", "Nope. She took the baby out of the crib. That's so on her. She could have just left the kid in the crib and then none of this shit would have happened. She made a shit decision. \n\nI live with a gamer. If the headset is on, he can't hear jack shit that I say. She knew what he was doing. He communicated it to her. If she needs his help, she has a mouth and can speak up. She didn't. She just moved the baby to the bed and LEFT. He's going to be facing a computer, with a headset on. He doesn't have eyes in the back of his head and he wouldn't hear anything. \n\nLeaving this infant with his father actually did end up being dangerous because she didn't leave the baby where it was (already) safe.", "You didn’t drop a ball you dropped the baby. 🤦🏼‍♀️", ">Her leaving baby in the crib while she cries outside alone is probably not the worst decision. Especially because her partner can't be fracked to help her, pretends he can't hear or see her, and then parades around like he's the king of sleepytime after pacing out for hours while ignoring them both.\n\nshe literally took the baby out of the crib, put on the bed and left tho...  \nbaby fell off the bed because: 1- she put it there and LEFT 2- he didnt pay attention at all to the baby. \n\nThey are both ah as parents. and they both keep leaving the baby unsupervised", "You are purposely twisting words to fit a narrative because that’s not at all what they said", ">The fact that you think leaving a baby with it's father is just as dangerous as leaving it near an open fire \n\nNot even what I said mate.  \nI said you cant leave a baby near a fireplace without making sure your partner is aware. \n\n&#x200B;\n\n> says a lot about what you expect from a mom vs a dad.\n\nwant some fries with your McReach?  \nI dont even put any expectation on mom vs dad, but as partners. \n\n\"If you leave your kid near a fireplace and do not make sure your partner is aware of it, you are also at fault when baby becomes a McRib.\"  \n\n\nso, I said \"partner\" and you went \"yup, they are saying moms needs to pay more attention than dads\"? Cmon, Guiness is not taking any new records for longest reach for a while now", "i do agree after reading through this i realize ive made a lot of mistakes tonight", ">The baby being alone in its crib for literally one minute while the parents switch out is not neglect.\n\nIt wasnt on the crib during the switch, nor it is said such.\n\n&#x200B;\n\n>The baby being on the bed in the same room as sad is not unsupervised or neglectful on the moms end.\n\nIt is when you put your baby next to someone who is not aware of it.\n\nIf the mom is sleeping, and father puts the baby next to her and \"is under the impression that a grown ass woman knows how to watch her own kid\", you will defend the father?  \nIt's negletful on BOTH ends. he was too focused on the game to notice the baby, she was too irresponsible to put the baby on the bed without making sure he was aware of it.   \n\n\nStop defending bad parenting. If one person puts a baby on a spot that accidents can happen, without being sure the other person is aware of it, it's bad parenting. Stop the whole \"mom vs dad\" bullshit to pull a \"poor woman\" card, this isnt about genders, it's about 2 people who are too immature to take care of a baby.  \n\n\nif someone is using a table, and you put a glass of water next to them without them knowing the glass is there, dont be blame only them if they move and knock the glass. One didnt pay attention, the other didnt even care to make sure the other knew it.", "it concerns me i think he’s choking thats why i want him to learn a different way if possible so ive been ignoring the cough and responding to different sounds but obviously i pat him on the back a little but wont pick him up if it’s a cough but pick him up for different sounds", "i didnt watch him fall off cmon man wth and shes better at making him feel better why wouldnt i give him to her", "i didnt look that one up i asked gf to ask doctor about it i never followed up though", ">Don't worry,  when your infant is in distress you can just put them in a crib and go to another part of the house where you don't hear them.  /s\n\nWhile it was not the best response in this situation, please don't denigrate this. It is actually recommended for when parents are overwhelmed. Make sure the baby is clean, fed, right temperature and safe (in a crib) and walk away for a short time to breathe and calm yourself. \n\nA short time crying in the crib without a parent comforting them is a \\*lot\\* less of a problem than a parent so stressed and overextended that they lose control of themselves.\n\nOh, and I had twins, and there were nights where I was so exhausted from the months of sleep deprivation that I could feel the moment that a parent snaps coming close and I DID put them in their cribs safely and walk away and sit just outside my house for a while. \n\nAgain not knowing what the days leading up to this incident were like I can't say if it was or was not the right response for the g/f to walk away in that moment, or if they had agreed that OP should take melatonin to get a nights sleep before work. \n\nBut the walking away when you are feeling that overwhelmed is HEALTHY.", "I'm not convinced she didn't ask OP to watch baby and OP just ignored her cause of the game. OP 'had their headphones on' and I'm guessing that's code for 'ignoring both the crying baby and my partner by cranking up the volume ridiculously so i can't hear anything said to me'", "She shouldn't have to tell him to watch his own child when she leaves the room they are all in.", "You think she's more at fault for leaving her child with its father then he is for ignoring it for a video game. Your misogyny is showing.", "Parenting an infant is really fucking hard. Even moreso when you're young. Keep learning from your mistakes, love that kid as much as possible, and make them your #1 priority. You'll do great.", "The mom went downstairs when she heard the dad was coming up. The OP states that in a comment. If a baby has been crying for hours and you cannot get them to stop the recommended thing to do is to set the baby down in a safe area and walk away. Moms need breaks from crying babies. It’s just the truth. Why would you assume that the mom didn’t set the baby in the crib or another safe place for the time it takes for her to switch out with the dad?\n\nSure, you can argue that the mom should have made sure that OP was in paying attention and aware that she had moved the kid before walking away. But seeing as OP was the one in the room with the kid when they were in the crib, he should have been more aware of the baby in the first place. Or made sure that mom knew that even though he was in that room he wasn’t going to be aware and she needed to plan to be on baby duty.", "For the love of god PLEASE talk to your doctor and ask for some recommendations on parenting books and resources. It doesn't sound like either of you has any idea what you're doing, you're just stabbing in the dark.", "He's not choking though. He's communicating. He's seeking you attention.", "You're better at making baby sleep, why didn't you put baby to bed? \n\nYour logic is basically \"she's worse at getting him to sleep so i let her put him to sleep repeatedly\" and \"she's better at comforting him so when he needs comfort i don't try, but hand him right off. He cries when I change his diaper so i leave\"... \n\nWhere is the logic of \"this is my baby so imma care for it\".", "This is called “weaponized incompetence” look it up. YTA for so many reasons.", "Why are YOU not asking the doctor about it?? Jesus pleesus, are you both just expecting the other one to parent at all times?", "YOU'RE HIS DAD, ASK THE DOCTOR YOURSELF!!", "Yes it is recommended when parents are overwhelmed, but that’s usually when babies are going through their purple crying phase up to 4 months. And it’s also told that when you do take a break, it be no more than FIVE MINUTES. because your baby needs your comfort and cues from your body (like a lower heart rate and calm breathing) to help regulate themselves. not thirty minutes of being ignored when there’s clearly something wrong. which in this case is probably everything considering neither parent seems to give a damn about their baby.", "That's absolutely not what happened here.   I'm not criticizing mum.  She's clearly overwhelmed. \n\nThis dude has repeatedly plunked his kid in the crib and ignored him even while crying and in need of basics like  diaper change.", ">OP 'had their headphones on'\n\n[https://www.reddit.com/r/AmItheAsshole/comments/zrcymp/comment/j12xex0/?utm\\_source=reddit&utm\\_medium=web2x&context=3](https://www.reddit.com/r/AmItheAsshole/comments/zrcymp/comment/j12xex0/?utm_source=reddit&utm_medium=web2x&context=3)  \n\n\nOP also said they were going to play. So, she KNEW he wouldnt hear a simple \"hey, look out for the baby\".. If you say \"hey, im going to take a shower\" and they say in a normal voice when the water is running \"stove is on\", you will not hear. They both F'd up", ">She shouldn't have to tell him to watch his own child when she leaves the room they are all in.\n\nShe also shouldnt take it out of the crib, put on the bed and leave tho....  \nIt's same as turning the oven on and leaving... Yes, people in the kitchen should pay attention, but you shouldnt take of the safety of something and leave", ">You think she's more at fault for leaving her child with its father then he is for ignoring it for a video game.\n\nNope, I think they both fucked up. You are the one trying to reach for it, for some weird reason. Im just saying she wasnt innocent on this.", "thanks for the advice i was laying here for the past 3 hours wondering what was wrong with me. i will mention parenting classes work on communicating and be more attentive", "there was no logic i should cut out my emotions i see they hinder my perception", "It's his baby, not an oven. She should be able to leave the baby with its father without wondering if he will take care of them.", "Try to take the same parenting class with her so you both have the same tools. It'll also be helpful for you both to discuss how you were raised, what you liked about that and what you'd like to change. If you're both on the same page or at least in the same book when it comes to parenting styles, it won't feel like you're fighting against each other as much.", "What emotions? You mention being frustrated by the baby crying. \n\nBabies crying non stop is frustrating. \n\nThat's also why your gf was crying, as a matter of fact. \n\nThe issue is your 'logic and the way you behave around it' not your feelings. Feelings are fine. Behaviors are choices. Your choice is not to help with things you're good at, not to try at things you aren't good at, and to completely ignore anyone who is crying. None of those are problems with your feelings.", "Wow. \n\nThere is absolutely a time and a place for being logical and curbing emotions in order to get stuff done. \n\nThis is not it. \n\nIf you baby is crying, and you hand off to your gf as 'she's better at soothing him' then ..you're free. She's burdened with more parenting than you. \n\nAlso, you're going to be annoyed when your child grows up and isn't interested in spending time with you.", ">She should be able to leave the baby with its father without wondering if he will take care of them.\n\nYes, if you know the father KNOWS the baby was put there. He was playing and with headset, knowing the baby was in the crib, she left baby in the bed and expect him to magically know the baby was taken out of the crib?\n\nDamn, people go hard to try to make her look innocent after she just randomly took baby out of crib and left.if she wasnt planning on staying there, why taking it out of the crib in the first place? especially knowing he was not paying attention at all?\n\n&#x200B;\n\n>It's his baby\n\nTHEIR baby, and she also keeps leaving it unsupervised.  \nI mean, after all that drama, she left baby alone upstairs cuz she heard OP coming up? OP could go up for something completly different OR even she could have misheard, and left the baby alone... cmon, this is Bad Parents 101", "i used to get beat for crying. its hard for me to sympathize with it", "ESH\n\nYou both are wildly irresponsible and I fear for your baby’s safety.\n\nHer for taking the baby out of the crib, putting him somewhere precarious and leaving without even telling you.\n\nYou for literally everything else. You got frustrated with your crying baby so you left him with a dirty diaper and went to sleep in another room? Seriously?\n\nYou picked your crying baby up OFF THE FLOOR, handed him off to someone else to deal with while you finished your game? SERIOUSLY??", "ESH - YOUR CHILD FELL OFF THE BED AND YOU PUT HIM IN HIS CRIB AND LEFT???? Are you Fxxking serious? No idea what kind of injuries the baby might have sustained, hence the crying,, but let me get annoyed and leave the room. Then an hour later he is still crying?? Neither of you considered maybe the baby should be taken to an ER to have checked to ensure the baby wasn't injured in the fall? Then you both just go downstairs to argue .... This child needs better from you both.", "ESH. the way u typed this makes it sound like you dont give a fuck and are only gna show her the results to prove a point. NEITHER OF YOU SHOULD HAVE HAD A BABY. YOU BOTH SOUND INCREDIBLY IMMATURE AND ARE NOT PARENTING A 7-MONTH OLD AS YOU SHOULD BE.", "YTA. Why take sleep aids and then dump adrenalin and dopamine into your system? I'd get banned if I said what I really thought about you doing this while having an infant at home.\n\nYou've a kid,hang up the controller for a while ok, some people are capable of managing gaming and parenting,  you are not one of them.\n\nI'm sorry dude, but you're wrong in literally everything. There's not one thing in your entire OP where you're right about anything.", "YTA. Your approach to what you call an \"unhealthy attachment pattern\" and your \"got him to sleep in under 10 minutes\" part is what makes you the asshole.\n\nThis reads as though you fancy yourself a parenting expert, but you're leaving your girlfriend to care for this baby for the entire night (sleeping on the couch, taking melatonin, only going up after 30 minutes of crying) plus to deal with the entire bedtime routine (10 pm is likely way too late, but ymmv) so that you can play video games.\n\nI can't speak to whether you're a daycare family, or if your gf works, but either way, you're expecting her to do the lion's share of childcare while you're both home, without support, and judging her while she does it. That part makes you an asshole.", "What in the actual f**k did I just read. Yta.", "Please give your baby up for apron to a couple who wants one. You're clearly not ready to be parents,  in any kind of way. ESH except the poor baby.", "YTA with a lot of buts....\n\nA lot of people here are really harsh, I get why, they are making lots of good points you should take into account, but I don't think that's what you need to hear right now. \n\nYou both are making mistakes here, but you are still so young, I don't think anyone could expect you guys to already know how to parent. However there is no excuse not to learn now. Having a baby is such a gigantic change, it's not gonna be easy. I would advise you to find a young parent group nearby maybe. Even online maybe? It might be easier to learn from people who went through the same thing, had the same struggles as young parents. Really just find some support, try to learn as much as possible and communicate with your GF. Communication is hard but you can learn, be as clear as possible in your communication about baby, and emotion wise, start small.\n\nI don't care if this gets me downvoted in to oblivion but I just wish you the best and I hope you learn!", "Somebody call cps please this baby is not safe.", "A 7 month old falling off the bed, and crying inconsolably for over an hour is a MEDICAL EMERGENCY. That baby fell the equivalent of 2-3 times it’s height. So, basically off a second story building. You are both neglectful, and not only giant assholes, but should probably have your any taken by CPS until y’all get it together. I truly hope someone reports you.", "Oh my goodness that poor baby", "Esh. Both parents are too self centered to be good parents.", "**YTA**. \n\nThat's a baby who can't take care of themselves, there is no \"unhealthy attachment\", the baby literally needs their parents for EVERYTHING at this stage in their development. How could you ignore a crying baby for 30 minutes? They're communicating a need, you're their PARENT.  ***DO BETTER.***", "Why do you have children if you do not want to take care of it?\n\n7months old cannot have a ”unhealthy attachments style” what you are doing is childabuse.", "ESH. I truly don't understand not glancing over at your own child or being aware of what's happening around you in the same room because you're too focused on a game. Stuff like this can end up in random brain injuries or worse. You both need to be more careful especially if the baby is moving around now. \n\nYou're going to be in for a surprise when your baby is old enough to get out of their own crib.", "ESH. You both sound awful and very inmature. Poor baby, stop ignoring your kid.", "YTA\n\nPlease don't have any more children and go take some parenting classes. You don't know nearly as much as you think you do.\n An infant having an unhealthy attachment to their parent is not a thing.\nYou choose to play a video game over carrying for your child.  You need to re-evaluate your priorities cuz it shouldn't be gaming", "ESH\n\nNeither of you sounds like a fit parent.", "Yta, please give this child up to someone who can cares for them.", "This is an example of children raising children.", "ESH. That poor baby", "I don’t even know what else to say to all of this other than YTA.", "YTA…right now you seem to be young parents who are trying to get a grip on, bring new parents of course.  But if you two don’t get together, talk and discuss things, I fear for that child if yours.  You are both parents now.  Baby comes first.  Video games are now when you can.  You make sure baby is ok and in moms care before you take sleep gummies.  Mom does not put baby from a safe place to an unsafe place without telling dad.  Time for you all to grow up and talk about expectations, reality and needs of each other.", "ESH. Except your innocent baby.", "YTA…right now you seem to be young parents who are trying to get a grip on, bring new parents of course.  But if you two don’t get together, talk and discuss things, I fear for that child if yours.  You are both parents now.  Baby comes first.  Video games are now when you can.  You make sure baby is ok and in moms care before you take sleep gummies.  Mom does not put baby from a safe place to an unsafe place without telling dad.  Time for you all to grow up and talk about expectations, reality and needs of each other.", "ESH", "give that baby up for adoption frfr", "ESH. Y’all both need to grow up and communicate better.", "Oh god this poor kid is crewed. You’re both fucking awful YTA", "What unhealthy pattern did you see?", "ESH. You both need to grow the fuck up", "YTA \n\nYou have no business having a child. You are no where mature enough to try and raise another human life.", "YTA- listen here… at one point in your life you’re going to realize how bad of a parent you are. You chose games over your baby and SO. Does your gf get to take 4 melatonins and play hours of apex? I doubt it. Yes, she shouldn’t have left the baby on the bed but she trusted you to watch the baby like a father would. Your girlfriend had to walk away because the crying was getting to her but the person she was suppose to count on never came. You literally got up and left to sleep somewhere else while she had to deal with the baby. I don’t care that you had to work. You and your gf are supposed to be a team.", "Omg that poor child.. ESH. Please watch some parenting videos and read some book.", "ESH, for the neglect you have both demonstrated, which others have enumerated. You are more of the AH, though, for also neglecting your partner, and for the extremely immature way you have been responding to the entirely reasonable criticism people have been giving you in this post.", "ESH\n\nWhy did y’all even have a child?", "Jfc... Where are your parents??\n\nYTA", "We need to call CPS. ESH", "YTA. You lost me at ‘unhealthy Attachment patterns’. Babies need their Mum. You are such an arsehole.", " You seem so selfish and uncaring and oblivious and completely uninterested in being a good father or a good partner.\n\nYTA", "ESH. God neither of you should be parents. She shouldn’t have left the baby unattended on the bed with out making sure you were watching and you. You are a real piece of work though. You handed the baby over so you could keep gaming? Disgusting. Then you went downstairs and abandoned her with a crying baby, who by the way needs to see a doctor for the fall. \n\nNeither of you are fit to be parents at this time. If there’s a responsible family member who he three of you can live with I highly recommend moving in with someone who can make sure you two learn how to parent. I know this seems harsh but you two really played a dangerous game that night.", "Seems to me you have an unhealthy lack of attachment to your child.", "Kids raising kids.... this is why American is gonna be f**ked", "ESH - you are grossly irresponsible for gaming and ignoring your crying baby, but she is also grossly irresponsible for trying to make baby sleep in the bed, and leaving baby in the bed unattended. There are TONS of articles about why crib sleeping is best - but that doesn’t get you off the hook. You need to set aside gaming for a bit and focus on your literal infant.", "“i’ve told her plenty of times that the way she puts him to sleeep is ineffective….”   YTA.\n\nObviously, you’re very “effective” at not only putting yourself to sleep and completely avoiding your responsibilities as a parent while endangering the child.", "ESH. You both sound exhausted and resentful of each other. This is what happens when kids have kids.\n\nYou BOTH need to be more responsible when it comes to the baby (not “it”) and you BOTH need to communicate better. \n\nWork out a schedule of whose turn it is to put baby to bed or wake with baby in the middle of the night so you each get a full nights sleep sometimes. Talk to each other calmly about how you feel, and if someone feels the arrangement is unfair, write things down. You need to work this stuff out with your girlfriend calmly or this entire relationship is going to crash and burn, and your child will suffer.", "ESH\nYou both should take some parenting classes.", "you and your gf shouldn’t be parents. ESH but your son deserves better", "ESH. Neither of you are fit to be a parent and you are openly admitting to neglecting your infant child. Please put him up for adoption or actually pay attention next time!", "Poor baby. \nBeing a young parent is hard but this is clearly neglect on both of your faults. \n\nThere is nothing unhealthy about NOT ignoring your 7 month old baby. The cry it out method is unhealthy, especially this young. \n\nBoth of you should look into parenting classes and counseling, not because anything is wrong, but because you now both have a child to be BETTER for. \nBetter than fine. \n\nBecause you did not turn out fine if you can't do better.", "YTA!! Neither of you seem to.understand the responsibility or maturity required to look after a baby!! Please speak to your health worker or your parents about guidance and help! Before it's too late!! \n\nParenting is 24/7 especially between birth and school age !! \n\nPut down the controls of your game \n\nYou are both clearly overwhelmed and need to speak to someone!! \n\nYour wants and needs are secondary to your child from birth........... end of!!", "Okay, it’s time to make some changes for the health of your relationship and the child. \n\nYou are going to be sleep deprived, that’s just the way it is. \n\nYou need to be more present with managing the baby and caring for it and your partner. That means cutting out the gummy‘s and the video games, unless they’re not home and you can nap. (spoiler: that’s not going to happen.)\n\nNever, ever put a baby on a bed without a wall of  pillows fencing him/her in, and I shouldn’t have to say this, but NEVER leave them alone on the bed.\n\nYou’ll have to leave your video games until everything else is taken care of, you need to make sure your partner is supported and getting rest, the baby is comfortable and safe, and with everything else is taken care of (all the dishes washed, all the laundry, folded), and you have any energy left you can play video games. This is because you are raising a little person, and they need you to focus on them, not yourself. \n\nBeing a good parent means recognizing that your needs come third, after the baby and your partner. It’s an adjustment, but you can do it.", "ESH - Yous are both leaving a BABY unattended and not communicating with each other. This is neglect. Both of yous are just assuming the other will do it. Stop it or put the baby up for adoption.", "So hard to follow this one…but I am going to go with ESH based on not having basic parenting skills. Everything in your post screams this. But also because it sounds like you are trying to “recreate the womb” for a 7-month old baby. If that means you are swaddling a 7-month old, please for the love of his STOP. And take a parenting class.", "Info: your baby had a fall and was inconsolable for a long time and you didn't think something might be wrong?", "When CPS ultimately takes this child (hopefully before it’s too late) you’ll probably hear the term “depraved indifference” at the hearing.", "ESH and no doxxing, but someone needs to contact child protective services. This baby is not safe.", "ESH except the baby. You adults aren’t talking like adults for one. Two, I get that games are fun, I’m a gamer myself, but games are NOT AND NEVER should be more important to you then your child (which is how this story reads). Take care of your child before something really bad happens to them. You both need parenting classes", "Neither one of you sound like you’re actually looking after your child only when it’s convenient maybe you should both take a parenting course and how to help look after your child", "YTA. It's time to grow up, son. I get that you want to play video games and decompress but you're a parent now. Your girlfriend and  child should come first. It's obvious that she's asking for help and you're too busy patting yourself on the back for all the tricks you learned to listen. \n\nI'm not saying you can't play video games or decompress in other ways but if it's causing you to ignore the humans you're supposed to love most then you have a problem.", "ESH. Please, both you- take some parenting classes.", "ESH here.\n\nYour GF for knowing you were zoning towards bedtime, and purposely put the child on the bed with you.\n\nYou for not realizing that you need to change your habits since you have an infant.", "My goodness you’re not ready to parent. Take some classes together. And for everyone’s sake, if you want another kid, don’t have another kid until you’re actually ready, more mature, and financially stable. ESH.", "ESH. Neither of you are looking after this baby correctly. There is some serious neglect going on here.", "Esh", "YTA for leaving your kid to cry for thirty fucking minutes. You both suck because neither of you seem to realise baby comes first: before games, before your own nap, before anything else.", "YTA - CPS will be round soon and then you won’t need to worry about your kid interrupting you drug taking or gaming ever again.", "Take that bay to the doctor-to make sure it is ok, you immature AH’s", "YTA, and also criminal in the neglect of your child. JFC.", "So you're fully admitting to child neglect ON REDDIT. \n\nHoly CPS case... at least I hope there's one before this kid ends up in an infant casket! ESH. Neither of you are parents, you're children pretending to be!", "ESH\n\nFor being a pair of neglectful gobshites. Did it not occur to either of you to bring the baby to the hospital??\n\nFor the love of god, don't have anymore.", "ESH", "ESH. You and your girlfriend are parenting this child as individuals, not as partners. As a result, your child's care is hit and miss, and he is suffering for it. Y'all need to get on the same page and work out a routine for bedtime and a division of labor during the rest of the day.\n\nAlso, your girlfriend needs to stop putting the kid on the bed and walking away.", "ESH. You really should look into giving that baby up for adoption. You two are NOT ready to be parents AT ALL!", "YTA for taking 4 melatonin gummies when you have a 7month old. I’m not even getting into everything else because I’m so mad and sad for your child.", "Oh my god. This poor baby. Reading your comments are sickening. That poor baby had a weird cough you say? And you haven’t followed through about it? You don’t comfort your baby because you don’t want them to have an attachment? You call your baby it? \nAnd you’re reasoning is you don’t empathize with your baby when they’re crying is because you got beat as a child for crying? Dude. Please just give this baby to someone who will actually love and care for them. Please for the love of god. My heart breaks for this poor baby.", "Why yes, YTA", "ESH. Y’all sound like horrible, negligent parents.", "Jesus fucking christ, neither one of you should have that baby. \n\nESH", "Both AHs, and neglectful.", "ESH \n\nY'all. Repeat after me. \n\nMake. A. Plan. With. Your. Partner. \n\nDon't assume everything is communicated, if you're going to put your kid in the crib so you can game a bit that's okay, parents need breaks, I'm assuming it was night time. Healthy habits need to be formed around sleep. However. You need to communicate that to your partner like \"hey we're winding down, I'm in the room with them, but I'm playing a game and have taken my melatonin\" \nAnd if she's going to take him out of the crib to smh put your mobile baby on the bed, then she needs to announce it, and make a plan is she watching him, are you watching him? Does he need a diaper change, or to be fed? Why was he out of bed in the first place? \n\nOverall the struggles y'all had tonight we're due to y'all not communicating. This is on both of you. \nCommunicate and get your shit together for the sake and safety of your kid.", "Sounds like your gf is dealing with postpartum depression. Please help more and work on being consistent with one another and the little one: ESH. Get in the same page and stop ignoring your child when they are crying.", "YTA, I pity your baby. You shouldn't be trusted with a hamster.", "YTA. This is why kids shouldn't have kids.", "He fell off the bed. He kept crying. OMG! That baby should have been taken to an ER. YTA. Big time.", "Yikes.. is it too late to give it up for adoption?", "I get sometimes you have to let babies cry it out but both of you are AH.  You don’t take shit to sleep when you have an infant.  You don’t take a baby leave him in a bed, then leave the room.  There are so many nopes on this post.  You both need to communicate and come up with a parenting plan that you stick to, and just so you are aware, babies WILL cry when something is wrong so ignoring  extended periods of crying is neglectful.", "ESH and I feel sick after reading this.", "YTA.   I’d highly recommend reading some books on kids brains “the whole brain child” is a great one.  And please take a parenting class.   You’re off to a rough start here if you think you can take a shit ton of melatonin and game while ignoring your crying baby.   \n\nBut you’re young and have lots of time to learn.   You baby only gets to be a child once.   Do right by him.   It will change his whole life.   And yours.", "I'm going with YTA. I was thinking E S H but honestly, I think your girlfriend is just at her breaking point. She is sleep deprived and it sounds like she does 90% of the parenting while you game or go enjoy a nice, long sleep. \n\n> i got him to sleep in under 10 minutes because of tricks i learned from research on guides and also trying out different things.\n\nIf you're so great at it, why didn't you help beforehand? \n\n>after she calmed down she basically said it was my fault he fell and that i was ignoring her struggling to put him down for hours. but she was the one who took him out the crib and i’ve told her plenty times that the way she gets him to sleep is ineffective but she never listened.\n\nSo what I'm guessing happened here is that she was trying to get him down for hours. She probably had him in the crib, in her arms, on the bed, etc. She tried everything while you sat on your ass playing your video game. \n\nYou say she's creating an \"unhealthy attachment\" which is literally *impossible* to do with a baby. You cannot love them too much. She probably doesn't like hearing him cry while you are okay to plop him in the crib and let him cry it out a bit. (ETA: if he is making a coughing/burping sound while crying then he needs to see a doctor. He is not \"manipulating\" you for attention)\n\nYou guys both need to take a parenting class. But you, especially, need to step up as a parent. Stop gaming. You can do that when your kid is older. Right now you should be spending your free time with your kid and/or girlfriend.\n\nETA: You left something VERY important out which is that your girlfriend just moved in a month ago. So she has been caring for your kid for SIX MONTHS by herself. Taking all the middle of the night shifts. She moved in with you so you could help and instead you game and then abandon her by running downstairs to sleep. You are a huge AH.", "ESH but OP probably the most since even from his post attempting to present himself well he is clearly failing here. Please OP take a parenting class. It’s clear you do not understand child development or age appropriate needs at all. And your GF needs to talk to her doctor about if she has PPD or just a really unsupportive partner.", "ESH definitely. You can't criticize the \"unhealthy attachment pattern\" if your answer to the problem is just playing video games and ignoring that the baby is crying. More than attachment issues this sounds like pure neglect. It's dangerous to let the baby alone in the bed, yes, but you could have noticed, not taking melatonin if you have to take care of a small baby is mad obvious. It seems like you left her alone with the child hours already when you finally decided to help and she left him alone too for being frustrated. I'm not justifying any of you two tho, it seems like you both have a lot of issues to adress and need to be *way* more mature. \nBut after all, I hope you can get help and be a better a father, your baby needs you.", "Info \n\nWhy did u have a kid so young? \n\nDude is too busy playing Apex to worry about a baby. \n\nWife takes kid out of crib and leaves it on the bed with an absentee husband.", "ESH and y'all need to learn to parent fast. First of all cribs that attach to the bed aren't safe. Taking that many melatonin gummies with a child in the mix is not smart. It sounds like both you and your partner need some parenting classes and therapy. Please look into resources around you like the WIC office.", "> ive been trying to stop and unhealthy attachment pattern (sic)\n\nYou've been doing what now?\n\nWhat is this 'unhealthy attachment pattern'? Please explain *exactly* what you mean.", "YTA your GF is overwhelmed and you are playing video games and taking  melatonin. you should alternate shifts if she is SAHM then when you get home you get the kid until 10pm and she gets to sleep uninterrupted until then. Then you get to sleep uninterrupted until 5am while she is the waking parent. Babies sleep on a 3 hour cycle, Adults sleep on a 4 hour cycle so it can be very hard on the adults when they don't get at least 1 full sleep cycle.", "This is child neglect and you shouldn't be left alone with a child. I'm absolutely disgusted. yta.", "Due wtf. YTA. I'm actually surprised that you were even clever enough to nut into the right hole.", "Also yta for not letting your 7 month old have a HEALTHY attachment to its parents. Go on a parenting course, learn some up to date parenting before you damage that child for good. If I knew where you were I would be reporting you for child endangerment.", "Both of you are assholes. \nSome people shouldn’t have kids.", "You sure got priorities. And none of them are your baby. YTA.", "Why did you have your child?", "having a hard time with a judgment because I feel so flipping sad for your child.\n\nYTA/ESH Everyone sucks but the baby, who deserves better.", "you're unfit to be a father", "INFO: Do you dislike your baby?", "You pair have no business being parents.\n\nSome of the stuff I read here scares the shit out of me.", "YTA. I know you're young and this isn't probably what you want to be doing atm, but turn off your video games and be a parent. Both of you are at fault here.", "INFO: please tell me you took your child to the hospital for a check up. Or to their doctor. Some medical professional, please! As other commenters have stated, infants *die* from head trauma. Like????", "ESH. Both of you suck and seem too immature to have a baby. Also, read a book and catch up on some grammar instead of playing apex for hours.", "“I just try to recreate the feeling of being in the womb because that’s where babies come from.”\n\nLol did you mansplain babies to us?", "ESH\n\nYou both need to communicate\n\nYou treating her parenting ideas as \"unhealthy\" is not going to help the relationship.  Co-sleeping and attachment parenting can be very helpful but you can not leave a baby that young to sleep alone on a bed.  There are safe sleep guidelines.  \n\nYou can't take that much Melatonin and expect to be a responsible parent ready to respond", "ESH. Can we call DCF on him? Throw out the gummies and the video games before your child gets hurt.", "ESH \n\nYou both suck in this situation.", "Anyone who opposes teaching real sex education and providing birth control to teens needs to read this post. ESH", "YTA.   \n\nIf you were talking about a cat or a dog, I'd tell you to rehome it. Since we're talking about your child, an actual human being you created, I'll just tell you to please take some parenting classes immediately. Don't wait. You have no idea what you're doing.", "Both of you should not have a child wtf", "I'm only in the first paragraph and it's just so toxic. YTA", "Wow this is awful. \n\nYou need to learn how to care for your child if you want it to have any chance at a normal life. \n\nAnd if not, you're actually a selfish asshole.", "It is dangerous to leave a baby alone.", "There's so many things wrong here. \n\nThis guy was not ready to be caring for a baby. How can you ignore your partner with your child after they literally just rolled off the bed? \n\nI notice he said carpeted floor as if that means no harm done  but this baby is 7 MONTHS OLD. This baby could literally die from so many \"small\" incidents still, it's scary to think he was lacking concern here as much as it seems. \n\nAnd im sure mom is so overwhelmed because he baby fell off the bed and she feels no support from her partner. \n\nAlso can I just say again that the baby is 7 months old? Why are you making a point to put your baby in a crib to ignore them just to try and break attachment already? This is the age that attachment isn't unhealthy, this baby needs to be able to trust its parents are around to keep it safe. \n\nThis is overall unsettling tto see how the dad handled the situation. I get there is a time and place to let your baby cry it out and take a break. \n\nThis was not one of those times\n\nEdit to add YTA although idek how truly sum up all the issues here because I know I can't take all blame off of mom but dad is seriously lacking in some parenting skills here", "Y’all need to put this baby up for adoption. Y’all are neglecting this baby. ESH. it deserves better", "You should go to jail. Both of you.\nYou do drugs while your baby is home, next to you. The baby falls and she “comforts him”. There is so many red flags in your post I won’t even go into listing them all.\n\nYou’re both so irresponsible, hopefully someone will notice and reports you both to the police. \n\nNot only YTA, also a criminal.", "ESH - Unhealthy attachment? You don't seem to have formed an attachment to your kid yourself.\n\nCall CPS and put your child up for adoption. He'll be better off. You're hurting him, you're neglecting him.  \n\nAnd get a vasectomy, you don't deserve kids.", "Such a sad read. I feel for that baby. So many things wrong here.", "Honestly, GF going downstairs and outside is understandable if she had already spent hours before trying to get the baby to sleep and needed to collect herself. Parents are advised that it's okay to walk away from the kid for a little bit if they're getting overwhelmed. We don't know if that's the case here, but that's the only reason why it would be appropriate.", "Also I don't have kids, but what in God's name is the \"trying to stop an unhealthy attachment I see in her?\"", "Well, he also considers alcohol to help him study... So what can you expect... Poor child.", "I don’t think it’s fair to blame the GF for the first point — he said it himself that he knew the baby was on the bed, but didn’t pay attention", "Yeah obviously that's why you don't have kids fresh out of highschool.", "Nah, they're clearly not even ready for a puppy or any living thing for that matter. If this is how they treat an infant, there's no telling how they'd treat an animal since it's \"just a dog\".", "Please don't suggest a baby animal.", "The ironic thing is ignoring your baby while they cry leads to insecure attachment.", "I agree but I think his gf is probably losing her mind. She is probably sleep deprived and not thinking straight. There were times when my daughter was young where I was hallucinating from sleep deprivation so I can see why she would do something like that.", "H) Not taking a baby to hospital after it fell off the bed. Baby could have multiple fractures!", "I would leave. This is just one night out of 7 months. I shudder to think of what the GF had to put up with post partum. She is probably still severely sleep deprived because I doubt this jackass helped with any of the nighttime feedings or diaper changes while she was still recovering. OP is a major asshole.", ">you prioritized a video game over your child \n\nOP, you're not going to get to the end of your life and wish you had played more video games. Kids grow up so fast and we do so many things that distract us from that.", "I cannot believe that their baby fell off a bed and no one thought to take them to the hospital?? I don’t know much about babies but I know that they can get hurt very easily and their bodies are very fragile. That’s just neglectful.", ">Melatonin works by turning off electronics\n\nscientist here.\n\nmelatonin does not have a magic remote controll for your TV\n\ni think the confusion comes from the fact that our bodies produce melatonin when we aren't exposed to blue light.\n\nscreens produce blue light, so it fucks with melatonn PRODUCTION..but if he took extra melatonin, his body will react to it the same way, blue light or not. that's involved in the production, but not the metabolization of, melatonin", "Exactly. I knew he was AH when I read that. Like good job creating job security for me (I’m a therapist). But sheesh ESH.", ">your partner shouldn't have left the baby\n\nI respectfully disagree with this comment.  She'd been trying to get him back to sleep for over 30 minutes and was obviously frustrated and upset herself to the point of tears.    Baby is safe in his crib, even if he's crying.  If she needed a moment away from the screaming infant, there's nothing wrong with that.\n\nBabies are frustrating.  There's a reason they warn people against shaking them.  I will never find fault with a mother who has reached her breaking point and, instead of harming herself or her child, puts the baby down in a safe spot to take a moment to regroup.", "i mean she cause him to fall (taking him outta the crib and not watching him or making sure op knew he was there) so in my head it makes sense she should fix it", ">You're going to get a lot of crap probably for mentioning playing video games. I don't see that as the problem here.\n\nIt may not be the only problem but it likely is a problem for his girlfriend. When the kid is awake, he needs attention. Putting him in his crib and ignoring him to game is not okay.", "i mean i would have handed him off too after her fell-she put him on the bed didnt watch him so he fell and she has to fix it consequences for your actions", "And genuinely harmful, as my 28yo therapy-ridden ass can attest to. My dad used to pull this shit all the time, and the abandonment issues are real.", "Depending on the baby and the reason for crying, this could be entirely appropriate. OP doesn’t give nearly enough info to make a case for that, though.", "Sounds like you don't have kids.  7 month olds cry when they are tired and have trouble falling asleep.  If you overdo it and soothe them too much, they don't learn to self-sooth and can't sleep without your help.  It creates a horrible cycle, where you constantly have to help them fall asleep everytime they wake up during the night and they aren't able to transition from one sleep cycle to the next.\n\nOP is an asshole for his overall attitude towards his kid and for playing video games instead of paying attention, but he isn't wrong about getting the kid into a crib and letting them cry until they sleep (assuming no poo, kid is not sick or otherwise injured, etc.).", "well the reccomendation to prevent shaken baby syndrome is to put them somewhere safe and let them cry it out.\n\nyou are allowed to take a bit to collect yourself.\n\nhowever I do think you're right...this comes with the HUGE caveat that you are sure the baby is in a safe and secure location.", "wrong if the baby is blue crying it's ok to leave a crying infant alone, they need to understand and learn it's ok not to be held all the time. so long as the baby is safe, clean diaper and fed a crying infant is ok to leave somewhat alone esp if sleep training", "I think the gf was trying to put them to sleep during that time and got frustrated and went to cry.\n\nSo I think someone was with the baby but she got frustrated and left for a little, then that’s when Op went and took care of the baby.\n\nShe’s still wrong for just ditching the baby with Op for some reason. Did they even change the baby diaper?", "That line really stood out to me. What on earth? OP sucks and needs to parent his baby. Omg what did I just read.", "It sounds like the mom is letting the baby sleep with them in their bed and he wants the baby to sleep in the crib.", "I’m all for setting the baby down for a few minutes when you’re frustrated. This dude set the baby down, grabbed a blanket, and left with no intention of coming back though.", "Not alot of people reliz3 the baby was alone for 30 minutes mom was there. It's not like the baby was alone. And after half an hour dad stepped in. Sometimes  nothing is wro g they are just cranky and crying mabey they wanted daddy and his way of putting them to sleep.", "You need to either grow up fast or nope out of this situation and just send a support check every month\n\n\nHaving an absentee dad will always be better than having a resentful, emotionally detached dad.", "If you’re not ready then give the baby up for adoption.", "Get rid of your games.  Seriously.  They are done for this portion of your life.  You can revisit them once your son has more independence.\n\nYou need to get your sh\\*t together and **not do the bare minimum**.  When your kid is crying for attention, you don't ignore him and play your game.  You suck it up, turn off the game right then and there, and go take care of him.  How dare you put your games over the wellbeing of your son?  \n\nWhat you CAN do is after your wife is well rested and you significantly contributed on ALL the chores, you can request 1 day that works for you BOTH and she takes care of your son 100% for 2 hours, unless an emergency comes up, in which case you eject from your games and help!  Sucks?  Oh well!  Life isn't fair, but it's good if you get control of it.   And in return, you do the same for her so she can still have a life or get rested or whatever.", "Jesus crist.... really dude?", "Dude, just accept the fact that you may be in the wrong here. You don't throw out the kid, bro - you work on yourselves so that you can provide the best possible care for the human being that has no choice of being your child because you love them and want them to have the best life you can provide. No parent is perfect and everyone has different ways they want to raise their children but you need to at least try to educate yourselves and truly work on communicating better with GF - for the sake for the innocent child in your home, not for yourselves. \n\nGo buy some parenting books, or borrow them from your local library, and read them *together.* Then, *discuss* what you read together and figure out a compromise on a parenting style for the 2 of you. Also, you can contact your pediatrician and discuss the difficulties going on at home. They can provide you with other resources, such as classes or programs, on how to manage your infant's care together. They can also help you guys understand how you should be comforting your infant and maybe even explain what are unhealthy vs healthy 'attachment styles.' \n\nAlso, don't ever take *four* melatonin gummies when you have a child in your home, whether it is yours or not. That child is relying on you to keep them safe because they don't understand how to themselves yet. If they were having a medical emergency in the middle of the night you need to be alert enough to be able to be ready to perform life saving measures such as the Heimlich or CPR while you wait for paramedics. If you need to take 4 melatonin gummies at night the you need to see a doctor about that - there is no reason you should be taking so many and can be unintentionally permanently damaging your ability to sleep.", "You’re actually giving away how little you do for parenting here. Everyone who’s been through it knows that “the book” methods frequently don’t work, and even the thing that “always” works will sometimes fail. You’re far too confident in your methods for me to believe you’re an involved parent. Parenting humbles you and you seem to have avoided that.", "You do a lot of research but you literally picked up your baby after he fell off the bed, gave him to your clearly exhausted partner, and went back to gaming without checking to see if he was okay or giving a single fuck about it???? \n\nWhat “research” are you doing?? You’re being critiqued because you’re a bad parent!", "For creating a child when you’re clearly nowhere near ready to have one", "You are both neglecting a helpless baby. Please either take some damn parenting classes or give this baby up to better parents if you cannot meet its needs. \n\nESH. This post is horrible.", "You should call CPS so they can explain it to you.", "yeah. im surprised there isnt an older family member helping them out as they don't seem to be ready to look after a baby", "I said often safe, not always, because I agree with you. However, he claimed an unhealthy attachment by putting a crib in their room, which is 100% safe and just a really shitty excuse on his part.", "Cosleeping (when referring to room sharing) is safe… bed sharing is not.", "I’m an anxious mom so I’ve taken my son to the clinic when he has fallen backwards from sitting onto a blanket and doctors I have seen have said often babies are pretty resilient and are generally okay if a fall is less than 3ft.. that being said if your baby was crying after a fall for 30+ minutes and could not be consoled… uh fuck yeah you need to get then checked out.", "you can leave a baby in the crib unsupervised.", "Retired child psychologist here. This comment *really* concerns me as you are trying to address an issue that you clearly do not understand in ways that will damage your child. Your child is way too young to have any control over their behavior, including asking for attention! Every time your baby indicates they need something, *they need something*. Don’t try to alter your baby’s cues, you need to learn what they are and how to respond to them every time. \n\nPlease take a parenting class. You do not understand what your baby is actually capable of, which means you don’t understand how fragile it is, which means you cannot possibly be meeting your kid’s basic needs. \n\nAnd for the love of all that is good you need to take your baby to the doctor if you are concerned about the noises! You don’t know what the hell is going on but you think you know how to address it? \n\nYou have a lot of learning to do. YTA.", "you think a 7 MONTH OLD IS MANIPULATING YOU?!!? what???", "You're an asshole and an abuser. Literally. How fucked up are you that you think your infant son is emotionally manipulating you?\n\n&#x200B;\n\nHonestly sounds like you're hoping the kid dies so you can go back to playing Apex without him bothering you. \n\n&#x200B;\n\nGet some help. Parenting books, therapy, all of it. Otherwise you're gonna end up A: killing your kid(And believe me the investigation that follows will get you in jail- especially with this post.) B: End up fucking up that kid's entire life. Ruining him because you can't handle the responsibility and are acting like a child yourself.", "Why on earth would you think a cough (that sounds like reflux, but go to a doctor) is a sign of an attachment problem? I’m skeptical of all this “research” you say you’ve done.", "WTF is wrong with you?", "Yes, a baby in distress may sound like that. So most likely your baby is in distress, and you what?... You get away from him?! You are teaching him that crying is not OK, that he should turn off his emotions. T-H-E-R-A-P-Y  N-O-W for you and your partner!!  \nSo I'm reading your sentence again and you talk of a concerning cough? What are you ducking doing on AITA instead of going to the doctor's office?!", "Reread your post and come back to us when you figure out all the places you both went wrong.", "1. You are both more concerned with what the other is doing wrong than you are about the health and happiness of your defenseless child.\n\n2. Reading a few articles and/or books does not make you an expert any more than her carrying the baby for 9 months makes her an expert on babies. Babies are hard to care for. Hard to keep alive, even. You should both be sharing your knowledge and positive experiences to help each other do better. Not constantly criticizing each other for not doing things your way.\n\n3. I have friends who game and have babies. You know what they do? They hold their baby in their lap or keep the crib/playpen in an area within sight of the tv, so that no matter how involved they are in their game, their child won’t have to be injured or upset in order to get their help and attention. They also don’t wear headphones covering both ears, because they know (as you should) that babies cry to let us know they need something. \n\nWhere I live it’s illegal to ride a bicycle (or drive a car) with both ears covered by headphones, in case an emergency vehicle comes around and needs all of us to get out of their way. You should really have the same mindset for parenting, and leave one ear open at all times for your child.\n\n4. You gf is still in the throes of post partum. In all your “research” I hope you researched that!!! PPD can affect women (and men btw) for up to 2 years after birth. Especially when the relationship and/or living situation adds extra stress. I’d highly recommend you both seek out therapy and make sure PPD isn’t exacerbating your troubles at home. The therapy should continue even if there is no PPD, btw.\n\n5. It is rather vicious of you to take sleep meds and move downstairs to sleep, purposefully ignoring your partner and baby, and forcing her to care for the infant all alone, all night long. Only shitty parents value their sleep over their child. Period. \n\nAfter reading your other comments, it sounds like you two are in literal competition over who knows what to do and does it right. It also sounds like you need to take that baby to a pediatrician and rule out GERD for the coughing/burping thing. Could easily be reflux and if so there are ways to help. Otherwise it probably means your poor baby has been crying for a ridiculously long time and is actually having a hard time breathing because they are literally THAT upset and scared. You mentioned that you got beat for crying as a kid . . . . . Do you really want to make your own kid feel the way you felt growing up? Mental and emotional abuse is just as bad and is usually already there before the physical abuse starts. Don’t become your own father dude.\n\nCrying in an of itself is not manipulation. Yes some people do learn to use it that way when they don’t get their way. Your infant is not one of those people. If they cry, it’s because THEY NEED YOU. Get up and help immediately next time. And maybe don’t take so much damn melatonin when you know you need to be able to jump out of bed at a moments notice for your baby.", "Walk away now before you ruin your gfs and baby's life. Pay child support, and keep your \"research\" to yourself. Blunt and hurts her feelings is narcissist code for \"I'm actually just a flaming asshole.\" Damn I wish we could call cps through this post.", "Well, whatever is in your head is freaking stupid. Tell me you have no kids without telling me you have no kids.\n\nIt doesn’t matter who caused him to fall (and they are both to blame). There is no reason he couldn’t try to comfort his own child. I swear, some people should never breed.", "Dad was there to watch.", "I say this with love and respect OP-PLEASE get into therapy.  It will help you SO MUCH.", ">If I see a kid cry i rush to check if they are okay\n\nPlease do not do this, first check to see if there is a visible adult who is managing the situation. There is nothing more annoying than managing a tantruming child by ignoring the tantrum, for another adult to interrupt and give the child attention.", "So you said you don't have kids, leaving a child in the crib is called self soothing. You let them cry. I had a problem when sharing custody,  the other parental figure let my kid co-sleep. OP doesn't co sleep they had an argument he slept somewhere else because of said argument. IMHO as a 34(f) mom 30 minutes isn't neglectful. An hour is neglectful. Besides sometimes you have to walk away, so mom is okay for walking away. They literally tell you that in the hospital to prevent shaken baby syndrome.", "Eh. If my husband is with my daughter I'll let him tey and comfort her. Especially if it's his turn at night. Otherwise both parents aren't getting any sleep.", "Not after the baby fell off the bed. I wouldn’t leave my son to CIO for 30 minutes after something like that.", "Self soothing isn't appropriate when your baby just fell and doesn't stop crying. Considering the baby could actually be hurt would be priority over teaching it to self soothe and retreating to another room.", "Like I tell my dad every time he spouts that nonsense, that is old, outdated, and debunked advice. The only cry that has been proven to strengthen the lungs is the very first one so that they open up and get air in.", "In another room, so there won't be any issues with attachment ... to a literal baby 🥸", "The baby had just fallen off the bed. I wouldn’t let my baby cry for 30 minutes after something that like that .", "Ugh I hate when people say stuff like this. OP lives in TX where abortion is illegal and sexual education is not the greatest. We don’t know how the child came to be conceived.\n\nIt doesn’t excuse them both being shitty parents, but it’s really not the “gotcha” you think it is.", "This is such a gross manipulative answer from OP, wow. It’s classic really.", ">Your research told you to game while the child is sleeping bc the blue lights, overactive video interface, and constant motion are good for sleeping babies? \n\nHe also takes four melatonin gummies and then immediately starts doing activities that will bring his melatonin levels down. Don't think this dude has more than 3 brain cells really", "I read that as he thought the crib would solve the unhealthy attachment, but he also said the unhealthy attachment is something to do with a cough, which makes me think acid reflux more than anything to do with attachment but I do think if switching to the crib was his idea that it may have been the only good idea he has had so far. Too many people don’t get rid of their multiple blankets and pillows when co-sleeping. \nI tried both and the crib worked best for us, had it right by my bed. Till the kid started climbing out of it anyway.", "Yup, I’m convinced she told him she was nipping to the loo or similar and to keep an eye on baby for those few minutes.", "i didn't say you couldnt, it's not what mom did tho....", ">never was unsupervised for any of this\n\nSo you just watched him roll off the bed and did nothing?", "i dont want kids anyway im just saying consequences for your actions", "and he thought the baby was in the crib??? she should have MADE SURE he knew baby was on the bed and not in crib anymore", "the baby was most likely fine depending on how high the bed is carpet vs hardwood babies are pretty resilient", "\"melatonin\" gummies, he says...\n\n...riiiiiight...", ">kids having kids\n\n>(21m) (20f)\n\nNope. Very immature adults.", "A person who communicates with the other parent on what is going on and confirms who has \"baby duty\" that night.", "That applied when you leave the baby in a safe place, not a place where they can faceplant themselves on the floor tho. \nMom was NOT okay for walking away without being sure the baby was safe.\n(hint: leaving baby next to a unaware , irresponsible, distracted father does not qualify as safe)", "Leaving a child in the crib isn’t self soothing. It’s something they learn to do by first having parents that soothe them and develop a healthy attachment where they know mom or dad will be there if they need them.", "I've done 2 hours with my husband. He got our fussy daughter for 2 hours while I tried to sleep. Then I took over for 2 hours. We didn't \"neglect\" our child because a parent was with them. For me to rush in when he was trying to comfort and soothe her would have ruined amd reset any progress (I've done it before and you have to start all over again). It also shows lack of trust and faith in the other parent and their abilities.", "I did say assuming the kid is not injured.  We have no info on how high the bed is, how they fell, if they appeared injured, was there a bump on their head, etc.  \n\nOP said the baby was soothed by his girlfriend (ugh, he really is a crappy dad overall. He can comfort his own kid after a fall, it’s like the very least a parent can do) and felt better, so I am operating on the assumption the fall was not very serious. Agree with you it would be a different story if the kid is showing any signs of injury, or if the crying was out of the ordinary (again, sounds like it is kind of normal because the baby hasn’t fully transitioned to his own crib and needs to be comforted at night).", "I did say assuming the kid is ***not injured***. OP said the baby was soothed by his GF and felt better, so I am operating on the assumption the fall was not very serious.\n\n Agree with you it would be a different story if the kid is showing any signs of injury, or if the crying was out of the ordinary (again, sounds like it is kind of normal because the baby hasn’t fully transitioned to his own crib and needs to be comforted at night).", "Thank you! Letting them “cry it out” spanned generations in my family and pediatricians still spout this nonsense despite AAP recommendations and mountains of research proving it’s detrimental to baby’s development.", "Thank you for letting me know! I can tell my girls to ignore that with any future grandkids of mine! I appreciate it, sincerely!", "That’s the vibe I get. She maybe needed a break where the baby was spending quality time with daddy but she didn’t have the energy or capacity to explain to him that she needed him to parent while she took a break. \n\nYou can’t be too attached to a baby. Babies need strong attachment bonds and a shit ton of attention. The fact that OP is ignoring baby to play video games and then taking FOUR melatonin gummies so he can’t be useful overnight makes me feel like gf is probably pretty exhausted from not having a coparent.", "Wouldn't leaving the baby in the safety of the crib have actually let her \"have a minute\"?", "None of those excuses are valid, except from in the very unlikely case that she she was raped and forced to keep the baby. They have no excuse for not using protection. \n\nIt’s also worth mentioning that either one of them could’ve picked up a book or gone online to learn about sexual health at any point.", "Then you’re and idiot who is letting their dad pride take priority over the child’s health and well-being. You and your girlfriend are not equipped to be parents and you even admitted you weren’t ready. Stop being selfish and consider what’s best for the child cause it ain’t you or your girlfriend.", "But why did she remove the baby from the safety of the crib?", "you complained they \"both\" keep leaving a seven month baby unsupervised, not mum did it, the only thing he did correct was leaving baby in the crib whilst he was absent.", "Sounds like GERD to me. Definitely see a doctor.", "Jesus fuck dude; you and your girlfriend are not prepared to be parents. Give the baby to an adoption agency.", "Consequences for whose actions?  Picking up the child and handing him to his mother so you can get back to your game is not a consequence. It is, however, poor parenting.  This is something to discuss between the adults, but both parents have to play a part in taking care of their child when hurt or upset.", "He said he didn’t know the baby was close to the edge, not that he didn’t know the baby was there at all.", "Are we saying it’s okay to neglect our potentially injured/ at the least upset and crying baby bc they’re resilient? This guy didn’t even check on the baby? Just passed it to its mom, put his earphones on, and said he told her he was playing apex. Damn the bar is in actual hell if we think that OP’s self described actions are okay for a dad of an infant.", "Wtf?", "Yeah I’m not sure why she didn’t put the baby on a play mat in the fathers line of vision assuming there’s no hazards around.  This is just a ridiculous situation, not worried about the well-being of the baby just about the fact she’s mad at him about something he doesn’t think was wrong 🤦🏻‍♀️", "I just didn’t get the sense from OP that he actually checked to make sure the baby was ok after the fall. Although maybe gf did when OP handed the baby off. They both suck and it makes me so mad that people like this can have kids and others struggle.", "Keep being willing to learn for your grandkids! I'm sure there will be changes to recommended practices even within the next few years. Hell, there were changes between my 3y old being born and my 6 month old.", "He probably has a habit of \"ignoring it\" and probably just ignored her communicating she needed a break.", "Exactly. I was next to the edge of a bed with her when I realized my ex MIL gave me alcohol sanitizing wipes to clean the baby instead of actual baby wipes and just assumed they were the same (I lived an hour away and forgot to pack some. In fact, I even asked her to just get me a damp paper towel instead). \n\nIn the 2 seconds it took me to turn around and tell her the obvious reasons why I couldn't use alcohol wipes on my kids poopy tush, my then 6 month old flipped herself over and rolled off the bed. I was devastated, cleaned her up best as I could and immediately rushed her to the hospital. \n\nThank God nothing bad happened and she turned out to be perfectly fine... I spent the night sleeping on a floor mat next to her play yard in the living room instead of our respective seperate crib and bed because I wanted to be next to her in a dimly lit room so I could look in on her immediately and ascertain if she was OK.\n\nI'm not trying to be sanctimonious but it immediately stuck out to me how OP's first instinct WASN'T TO TAKE THE BABY TO THE DAMN HOSPITAL. YTA for that alone!! 2 years, much older and bigger than your 7 month old have DIED falling off furniture!", "He probably was out of the crib for a while because he wouldn’t settle. But OP was too self-involved to notice. Seven months old babies aren’t in the crib unless they sleep.", "..if you read the post, mom left baby more than once.....", "she still saw op not paying attention and decided it was ok to leave the baby on the bed and leave still on her in my opinion", "I'm guessing he's one of the asholes who think if you pick up a baby it'll be spoiled.\n\nGod this is horrible that poor baby.", "both probably addicted to video games.", "She put the parent on the bed with the DAD!!  I highly doubt she just tossed the baby there and left.   It’s not unreasonable to expect the father to keep their kid alive. \n\nMy guess is mom is fed up with dad gaming and being lazy and is trying to get him to help more.", "Only tonight, huh?", "He said he didn’t notice the baby was close to the edge, not that he didn’t know the baby was there. A sleeping person is different than someone not paying enough attention. In this case, he should have paused the game or at least positioned himself to keep the kid safe.", "You’re basically trying to train your baby like you would a dog.  You do realize that right?  Giving treats, or attention in this case, for one specific behavior you want to cultivate (the non-cough noises) and basically ignoring him when he does the other.  That’s not how you raise a human being dude.", "are you serious dude....have you done even one second of research on how to care for a baby?", "Why don’t  you pick him up?", "Parent of the year award goes to this guy!! Dude..... there are so many things wrong with EVERYTHING that you've said in this entire post. So you've only looked up things that you can use to your advantage to manipulate your partner into doing all of the actual parenting.  Then youre wondering why youre getting backlash when you say something? Seems like you're only \"researching\" things that you need a convenient answer for. Parenting isn't convenient for you, just like buying some fucking rubbers wasn't convenient either, right? Did you guys even get the baby checked out after that, or was the carpet good enough of a soft landing spot that you didnt care to? (Once again OP would have been inconvenienced) You need some therapy, for real.", "You are terrifying.", "You’re already giving your child daddy issues. Step up and parent! And show empathy! You should have taken that child to the ER.", "So you were in the same room with your back turned to an infant on a bed, distracted by games and were wearing headphones. Is that about right?", "You should have called the dr right away your baby could have a concussion or be injured and you just handed the baby off to your gf and didn’t even care that he fell?????? You’re crazy. It’s a much bigger deal than you think- a baby falling off a bed could be nothing but it could also be detrimental", "This baby was NOT safe. It fell off the dang bed. Babies die from head trauma from falling off the bed, couch, counter ect. What he did is neglect at best, and should that child die- negligent homicide. There is a difference between putting a well cared for child in their crib for a few minutes to collect yourself because they have been crying… that is not this situation.", "The amount of people that don't understand about getting kids to self soothe in this thread and then thinking they have superior parenting skills is staggering.", "I understand exactly where you are coming from and I have had to do the same with my babes and still do at times.\n\nBut realistically speaking, based on this post alone, does OP seem like someone who is actually doing their due diligence before just effing off and ignoring the baby?", "This. \"An unhealthy attachment\"... At 7 months??? What did I just read?", "If he already had agreed upon plans to take time to game? YES SHE FUCKING DOES. She was on \"baby duty\" you do not get off \"baby duty\" until another person fully acknowldges and takes over.  You also don't just move the baby next to the other parent who is busy and walk away WITHOUT CONFIRMATION that said other parent is taking over baby duties. \n\nMy husband and I are both gamers. I'm currently on baby duty watching my 21 month old play with her dolls and blocks (and scrolling reddit) while he is playing assassins creed. I'm going to get my time to game this afternoon while he chases her around the house after her nap. We have communicated and planned our gaming time. I make sure he is at a pausing place if I need the bathroom. When our daughter was an infant, she would go in playpen or crib if I had to go to the bathroom and he wasn't available (at work). Leaving your child in an unsafe place (bed or unsupervised on the floor) is shit parenting if the other parent isnt aware they have taken over baby duty.", "Nope. If she didn't confirm that the person who was on \"scheduled me time\" was aware that he was taking over baby duty, then she is 100% at fault. Same thing if she was the one gaming and he left the baby on the bed with her and walked away. If he didn't confirm taking over baby duty, then how can he be held responsible?", "What THEY did is neglect.  Mom took the baby out of the crib, put it on the bed and left.  They both sound horrible, not just OP.", "Come on apex was definitely the priority not the baby", "THIS. Any infant under 12 mos of age that has a FALL no matter from what height, needs to be taken to the ER (im saying this based on the time OP stated this incident occurred) to get checked out. This infant could've had closed head trauma. What if it has a concussion? This is horrible. This is 1000% neglect. You should be turned into cps for this shit. My heart hurts for this child. If you and your gf are unable to take care or deal with your child, maybe you should look up getting your baby adopted.", ">   I'm not criticizing mum.  She's clearly overwhelmed.\n\nWhat the fuck, the mom is not doing any better than the guy is doing here", "Few questions:\nWas she in the room with you, when you were playing? \nDid you check on him while he was in the crib?\n\nWhat’s about the crib and the coughing thing? I don’t get the connection!", "Do you not know that a woman or mother can do no wrong? its always only the man thats wrong even if both are wrong.", "The baby was safe in the crib--the mother took the baby from safety and put it on a bed with no rails.  Why did she do that?  Neither of these people is a good parent in any sense of the word.", "So sneaking the baby on to the bed while the guy obviously neither saw nor heard her doing it is apparently his fault? What the fuck is wrong with you? How can you blame the guy for literally not having eyes in the back of his head?\n\nBoth of these parents are shit but you can't possibly blame him for that single occurrence.", "I agree with this. Have discussions on how you plan to raise your child. Look through reddit parenting forums and honestly, AITA posts involving babies and children. Use these posts as conversation starters and scenarios of what to do. \n\nThe other day there was a post about a 5 year old wanting to sleep with the mom. The dad didn't want the 5 year old to co-sleep and the mom was okay with it. My husband and I talked over this post to \"get ahead of the situation\" of if we will allow our daughter to sleep with us when she is older or offer different ways to comfort her. \n\nI like r/parenting because there's a decent amount of stories that give you ideas of gentle parenting vs permissive. Every child and parent is different. There are a lot of wrong ways to parent, but there is no 100% RIGHT way. A lot of the techniques right now will probably cone out in 20 years with research saying how it could harm children too because we didn't \"parent right\".", "ESH and this is fucked up\n\nThis baby is YOUR responsibility. You don't get to play games or get distracted while watching a child. \n\nJust from your speech pattern I can see you think calming your kid down when they are crying is equivalent to pampering him. I know you're young and propably not that ready to be a parent but need to grow the hell up and be a responsible adult. \n\ni feel for this neglected baby, honestly", "ESH. Your both have no business being parents, holy cow.", "YTA\n\nOne, for having a child when you are basically a child yourself\n\nTwo, you have not learned from a guide how to put your baby to sleep. They probably have a concussion\n\nThree, you ignored the baby crying\n\nFour, wtf takes sleeping meds( that is what those gummy melatonin are) when you are supposed to watch a baby\n\nFive, you both are idiots. That poor baby.", "ESH. Use a condom/bc if you don't want to be a parent. Neither of you are fit to be parents. Take the baby to the hospital and get some parenting classes under your belt. \n\nYou both are horrible", "yta.\n\nyou should not have a kid.", "YTA for becoming parents. The baby is NTA", "ESH you're both negligent and need to do better as parents. You're GF was TA for taking him out of the crib and setting him on the bed, then leaving knowing you were engrossed in your video game. You were TA for being so engrossed in your video game when you have an infant that your GF couldn't even get your attention. Your GF was TA for not waiting and getting a legit acknowledgment from you that you knew the baby was on the bed and that she was walking out and you needed to watch him. You were both TA for just dumping him in the crib without really making sure he wasn't injured after falling off the bed. And you are both completely negligent when your baby was crying nonstop after falling off the bed and you literally just ignored him. He could have been seriously injured by hurting his neck or head. It doesn't take much to hurt them. And you just ignored his inconsolable crying! WTF is wrong with you???? WTF is wrong with your GF???? Grow the F up and start being responsible parents and actually act like you care about your son.", "YTA for using melatonin as an excuse to play video games rather than parent. Either you put the baby to bed your way or she does her way. You do not get to dictate her methods. And if you don't like her putting the baby next to you, pay enough attention that you can call her out on it before she has time to walk away. Otherwise you pick up the baby immediately and put them back in the bed she removed it from and ensure the child is back asleep immediately. Do not walk away while the baby is crying. Your wife expects to see you putting in some effort to sleep-train your baby. Do it and prove you are right. Get the baby into a sleep routine by being the one who handles it consistently. Or be quiet and let your wife do it her way.\n\nIn no case should you ever be so lost in video games that your baby can fall off something while next to you.", "Yes!!! Your both AH for having a kid you clearly aren’t ready for!! Get a grip! This is a child’s life we’re talking about here!! Grow up and take care of that baby.", "ESH. When you have a baby, say goodbye to getting enough sleep and sya good bye to all your gaming. You can't game with a baby around because they will interrupt you and you can't just make them wait until you're done because they're too young to understand. \n\nYour girlfriend shouldn't have left the baby on the edge and not tell you the baby is now with you. \n\nAnd you waited 30 minutes before you responded to your baby crying? Dude. I hope your GF was with him the whole time before giving up before you finally came.", "NAH \n\nNew mom weighing in. This started at 10pm. At 7 months  baby should be sleeping by then. Leaving baby to cry it out for 30 mins (assuming baby has been fed, diaper changed) is not neglect as others say. Sounds like you and your gf have different views on parenting. She doesn't want him to cry at all and will take him out of crib, delaying his sleep and learning to self soothe. Whereas you are trying to get him to fall asleep on his own. \n\nYour gf sounds overwhelmed and needs a break. Baby crying is distressing for her. But NEVER leave a baby on an elevated surface unattended. You 2 need to get on the same page for sleep routine. If he is crying and you want to try your method, tell her you'll watch him until he falls asleep so she can turn off her brain and relax. You being downstairs playing video games while she struggles with him crying upstairs isn't going to help her adopt your sleep routine for him. Best of luck to you and your family. Communicate with each other  and remember, youre a team. Dont pit yourselves against each other. I remember an old reddit post which stated: \"it's you and her against the baby.\" Hope that helps when you find yourselves getting frustrated with each other.", "I don’t understand why she would take your son out of his crib, put him on the bed, and *leave*. I’m assuming you play Apex with a headset on. She had to know you weren’t aware that she had moved the baby. That’s on her. She should have either left him in the crib or at the very least communicated with you that she was moving him to the bed.\n\nI think you two just have different parenting styles at this point, so better communication with each other and picking a lane so your son has some consistency would probably help. You could have been more attentive, but I seriously don’t understand why she moved the baby without telling you or watching him on the bed. But y’all need to get it together. ESH", "Nurse here. IF YOUR SEVEN MONTH OLD CHILD FALLS OFF A BED THEY *NEED* TO GO TO THE HOSPITAL OR YOUR PHYSICIAN TO BE ASSESSED. I worked in the trauma room and emergency department of one of Ontario’s largest/busiest emerg departments for almost a decade. Babies and infants do tend to be very resilient, HOWEVER; signs of a head injury are not always readily apparent to someone who is not medical. Often, early signs head trauma in a baby with bleeding in their brain can present as IRRITABILITY AKA CRYING AND INABILITY TO SETTLE. If your infant vomits, seems difficult to rouse, or has unequal pupils these are very bad signs and a medical emergency. They can *die* from bleeding in their brain. You probably won’t even read this, but if you do PLEASE take your baby in to be assessed. Symptoms sometimes don’t arise until up to 48 hours. You posted this 11 hours ago, please do the right thing.\n\nESH only because I have to put a rating, in reality I just hope this baby is ok.\n\nEdit: changed some medical terms to layman to make it easier to understand just in case.", "YTA. And mom is an aH. What is WRONG with you all? The baby FELL OFF THE BED. Nowhere do you say \"we called the Dr/help line/nurseline and they said\". That alone is ridiculous. THEN, after FALLING, the poor baby is left, repeatedly, because neither of you can \"handle\" the crying?! I fear for this child.", "You have a child and you couldn’t stop playing your game to help tend to him? Your baby falls and you just pick him up and give them to your gf? It sounds like you didn’t even make sure the baby was ok, you just gave him to your wife so you could finish your game. It’s her fault the baby fell, but that doesn’t make you not an asshole. \n\nYou know it takes you less than 10 minutes to get the baby to sleep and instead of going upstairs you let your gf try for 30 minutes? And you know her way of helping him isn’t effective but she’s still sleeping upstairs with the baby? Obviously the cries wake you up no matter what, so why aren’t YOU there so you can silence them faster? Obviously this baby was an accident, but you really should put it up for adoption if your gf is too stupid to not know that you SHOULDNT PUT A BABY ON THE EDGE OF A BED AND LEAVE IT UNATTENDED, and if youre too unbothered to care when the baby cries or falls if it interferes with your sleep or gaming. ESH. Find the baby a home where it’s not going to be raised by two children", "ESH\n\nIf baby was sleeping, why were you playing video games in the same room? If they were awake, you should play with the baby. You don't whack them in a crib and leave them to get on with it whilst you game, especially at 7 months old.\n\nYour GF shouldn't have put the baby on the bed, then left the room without making sure you were aware that she was doing so, as that is unsafe. \n\nYour baby was probably crying when you went to change him because he'd not long fallen off of the bed and might have still been in pain/upset. Also, why did you pass him to your GF to comfort?! Most parents' immediate reaction to their crying and possibly hurt infant is to pick them up and cuddle them whilst checking that they are alright! I mean, I game (as does my husband), and I would have sacked off whatever match I was in and checked on my baby\n\nIt sounds like you two aren't on the same page when it comes to parenting. You need to sit down and discuss things, from sleeping places and routines, who does the night feeds on a given night, and make sure you both get some you time to stop you both feeling overwhelmed. If bedtime is taking too long, and/or the other parent is getting stressed, you need to switch so the stressed parent can calm down.\n\n I mean, my husband and I have a rule that if bedtime is taking 30 minutes or longer with our 3yo, then we switch. And keep switching every 30-60 mins until he's settled. We do shifts with the baby so that we both get some sleep. When he gets older and is reliably waking once a night, we will alternate nights. \n\nYou two need to be a team. To do that, you need to communicate. Be open and honest with each other. Divy up chores, figure out patterns (e.g. husband bathes the baby whilst I play with the toddler. Once bath time is over, I take the baby upstairs and do his bedtime routine whilst husband puts the toddler to bed. I then go downstairs and tidy the living room/kitchen. When he comes downstairs, we will watch TV, or one of us will game whilst the other plays on their phone or reads. I might draw. When we go to bed, we make sure we know who is getting up with the baby in the night. Sometimes, one of us might do one of the wake ups even if it isn't their turn if they're awake and the other is fast asleep). Our system isn't perfect (we both get frustrated at times; it's natural with small kids), but we talk to one another and try to work through our issues.\n\nApologise to your girlfriend (whether you feel like you're in the wrong or not) and then try to discuss how you can move forward so your sons needs are met and you both don't feel overwhelmed.", "Listen here man, the comments are pretty harsh about neglect and being unsuited for parenthood. \n\nThey're not wrong in that there were many things that should have been done otherwise. You need to look past the harsh comments and take a good hard look at how you can do better.\n\nHere are some pointers to start with:\n\n1) Never leave a baby unsupervised. Taking a piss at night, while the baby is in the crib? That's fine. Going outside with mom for what might turn into a long debate/argument/fight? Big no-no.\n\n2) Talk with your partner. It can be really hard to find common ground sometimes, but one of you needs to bend for the sake of the child. If you're convinced she won't budge, consider taking one for the team - for your kid's sake.\n\n3) Prioritize. There's nothing wrong with getting some gaming done, but it must NOT be at the cost of your baby's wellbeing.\n\n4) Forgive yourself and your GF. You're very young, and you have a lot to learn. You're gonna make mistakes, like everyone else. Make sure to learn from these mistakes, forgive yourselves and do better.\n\n\nESH, but talk with your GF and figure out how to be there for your baby - even if it means compromises for either of you.\n\nGood luck man, and do your best to raise a proper human being, you can do it.", "Both of you are AH for having a baby so young while y'all are obviously immature.", "I hope CPS takes your baby away. YTA. Fucking child abuser.", "[removed]", "ESH. You both sound horrifically selfish and should not be raising a child. I feel so bad for your son.", "YTA hope somebody calls CPS on your ass", "So did the baby ever wake up from his nap? ESH!! A confusion on a baby can be dangerous!! You didn’t see how he fell, I would’ve gone to the doctor and please have a vasectomy.", "ESH. She sucks for leaving the baby on the bed. You suck for not caring enough about your son to stop playing a stupid game. You got frustrated changing his diaper so you choose to ignore him? Straight up neglect. If neither of you are going to choose to be parents please give your baby a chance to have someone who will.", "Please put this child up for adoption and let some adults raise it.", "Get parenting classes ASAP. They will be free through your local government or associated nonprofits.", "Did you take your baby to the doctor!? There could be brain damage!!! At least your gf is trying! wtf!?!!! YTA. Quit your video game addiction and RAISE YOUR CHILD", "[removed]", "ESH, man", "ESH. Grow up man. You’re a father now and need to prioritise your baby over your game🙄 be more attentive towards your baby and your gf. She may has postpartum depression.Being parents are hard and both of you are feeling overwhelm. Don’t neglect your baby. Maybe ask for help from your family members", "ESH. I hope this child gets a good home and isn't lost in the system after its taken away for neglect", "Not only are you an asshole, you’re both fucking criminals. I feel so bad for your child.", "ESH you both need to take a safe sleep practices training, im in ECE and this is all just….what??? YOU CANT SPOIL A BABY and YOU NEED TO BE THERE/ADVOCATE FOR THE SAFE SLEEP PRACTICES. your kid can’t talk, your gf is probably exhausted and cutting corners because you game/sleep throughout the bedtime routine and are nowhere to be found. if you know you can get the baby down in 10 minutes why is she doing the bedtime routine? you could’ve put the baby down and gone to sleep. you’re both putting your kid in danger. please get some classes for the sake of your kid and gf, i’d recommend safe sleep practices & prevention is better than treatment.", "ESH - you both need to work together and communicate. Couples have a tendency to either become closer through adversity, or separate. \n\nMy two cents... pull her close (emotionally), and make sure she's well supported. More often than not, it's reciprocated (assuming she loves you), this will help the relationship's communication, and smooth out those rough edges, allowing you both to be better parents.", "Please use condoms, none of us need any of your genes around.\n\nESH.", "Dude out here praising himself for his  hacks while he intentionally ignores the baby, refuses to help with the baby's care, and doesn't lift a finger to comfort or you know... check for injuries after falling!!\n\nYou both sound like hideously incompetent parents. \n\nyou are both probably going to injure your child, or kill him, since he already got injured and neither of you thought to get the kid checked out medically.\n\nWhy have a child if NEITHER OF YOU are interested in being parents? Hope to the High Heavens that you two are using contraceptives now. \n\nPlease give up this child if you both don't want it and you refuse to become better parents.  He deserve to be with parents who cares if he lives or dies, and his wellbeing and health.  You're going to cause lifelong damage if you keep this level of disgusting incompetence and inattention going. \n\nYTA", "About 15 years ago, I knew a girl about your age whose baby fell off the bed and into a wastebasket. The kid died of positional asphyxia and the mom had had some wine and didn't wake up. Her life was fucking wrecked after this, she had extreme mental health issues from killing her baby by being negligent like you.\n\nYTA.", "I’m not going to criticize OP for seeking a break playing video games but I will criticize the type of game you’re playing which is an online competitive game you can’t pause. You have major responsibilities in taking care of a baby so the baby should always be priority. Play a single player game you can pause so it doesn’t have to compete with your dad duties. Also never ever take that many sleeping aids with a baby in the house, you would be completely useless in an emergency - YTA.", "ESH. Like it or not you're parents now. That baby is 7 months old, it could have been seriously injured from falling off a bed, even onto carpet. You and your partner need some help before something worse happens. Please reach out for some.", "YTA- you both are. You don’t seem able to care your your kid….", "ESH. Also, why are you taking four melatonin gummies? Smaller amounts of melatonin work better than large amounts. \n\nhttps://nwim.org/melatonin-why-less-is-more/", "So let me get this straight. You have decided your girlfriend has created unhealthy attachment patterns so you decided to take 4 melatonin gummies and play a video game. Why didn’t you help her?  He then fell off the bed you gave the baby to the girlfriend and went back to playing the game once again why don’t you help. If you are reading so much and you know so much why aren’t you putting the title guy to bed every night and helping out more.", "YTA. You’re actually an AH and so is your gf. You’re both neglectful parents. \n\nDO BETTER.", "YTA. Neither of you seem mature enough to take care of a kid. You ignored it’s crying for 30 minutes? You handed it to your partner when it was crying so you could finish a game? That’s your kid. Seriously, learn to be a better parent.", "ESH\n\n\"Melatonin\" so you can game... No one is buying it.\n\nThat poor baby is gonna have one hell of a rough time he didn't ask for", "YTA for ignoring a crying baby after a potential injury especially. I am a pediatric intensive care nurse and have seen babies with intracranial hemorrhages after falls as you describe. Yes, very likely all is fine but there’s a chance that it’s not and the baby could have been in pain and irritable.", "I feel so sorry for this child. You are both AH. Grow up and be parents", "YTA. You’re a father now, you have responsibility! Baby is crying and you’re in the best online match you’ve ever had - what comes first? OF COURSE THE BABY! And it’s pretty clear that the baby is also overwhelming your girlfriend, so you should help her instead of gaming\n\nYou’re a father now, you won’t have time for games anymore. Protip: if you really want to play games, play things where you can pause", "YTA. Your son could have been seriously injured and you want to play the blame game about who’s fault it was. Grow up, put down the video game controller and help care for your child.", "ESH. Take your baby to a hospital to have its head examined please FFS. He could have a concussion and you assholes put him to bed… Jesus.", "YTA, both of you.\n\nHow do I call CPS on a post? You guys need parenting classes asap or your baby taken away to a safer environment.", "“unhealthy attachment pattern”? you mean your child’s understanding that his needs will be met? hard esh you both are neglecting your child", "ESH and that poor baby is in the middle of it, with so many mixed signals and neglect that child is on its way to an unhappy childhood.", "sweet lord, that kid is being neglected so hard by the two of you but then again, you're children having children...\n\nESH, please get an adult to help you before something horrible happens.", "YTA. This whole post reads as you boasting about being superior and more knowledgeable than your GF but it sounds like she’s the one who actually takes on the bulk of the parenting responsibility while you play video games, sleep and largely ignore your child, only stepping in to tell your gf that she’s doing it wrong.", "YTA\n\nIt is impossible to spoil a baby. That shit you trying to do is why we have a generation of mean ass boomers. \"I didn't get comforted when I was a baby and I turned out fine and I didn't comfort my children  when they were babies.\" And also, \"I don't understand why my kids don't come around or let me have alone time with my grandchild.\"", "I am really hoping this is a made-up story because if not, CPS needs to come get that baby. You are TA, your gf is TA and that baby is endangered.", "YTA and shouldn’t be a parent", "You are absolutely the asshole. that baby needs love, attention and good care. You both neglect that poor baby so much, you shouldn't be parents tbh. Lame", "ESH. Neither of you are mature enough to be parents. You both need to get your shit together.", "Bro why the fuck did you two idiots have a baby? Neither of you seem into it. Guess what? Can’t abort it now, dumbass.", "All I can phantom is that neither of them are mature enough to be parents sp good luck to thst child", "ESH!! My heart breaks for this baby! The 2 of you need to get your shit together because right now this ain’t it! Do you have a grandparent who can take the baby for a few days? The 2 of you suck at parenting right now and you really need help otherwise something worse than the baby falling off the bed could happen!!", "You pretty much full blown admitted to neglect by ignoring your baby’s cries and not even noticing him on the edge of your bed. Also acting like you have no blame in the situation by just telling GF that she’s ineffective is a shit take. \n\nYTA and frankly I’m terrified to know what “tricks” put him to sleep so quickly", "ESH, both of you are responsible for watching your own kid", "YTA. You decided to take sedatives and ignore your child who clearly needed something. Below age 2 or so, children are not capable of manipulation. Their brains aren't developed enough for it. Bonus asshole points for (at best) ignoring the mother of your child who is definitely struggling mentally", "I’m not even diving into any of this because enough comments have already addressed why ESH. But PLEASE continue to put baby down and walk away when you are frustrated. Shaken Baby Syndrome is real, horrific, and only take a few seconds in the heat of anger.", "ESH\n\n&#x200B;\n\nShe was an Ah to put him in an unsafe situation and leave. him falling is HER fault.\n\n&#x200B;\n\nBut you are an AH for this: \"after he fell he started crying so i picked him up and gave to gf to comfort him until he felt better\" .. What a shitty parent you are. Amd for that: \" got a little frustrated so i set him back in his crib, grabbed a blanket and went to sleep downstairs. i woke up an hour later to crying and tried to ignore it to go back to sleep but after 30 minutes it hadn’t stopped\"", "I say this as a mandated reporter, if I knew who you were I’d report both of you to CPS. Do better, or risk losing your baby.\n\nETA: ESH", "INFO: Have you or GF taken any parenting classes or are you connected to any infant- parent support programs? \n\nWould you be interested in this? It's not that you're young, it's that this is your first baby and that is always hard. Having other new parents to connect to, and access to experts is a healthy. You'll learn that you're not alone in not having every answer.\n\nIf you want, PM me and I would help you locate free resources.", "It sounds like the attachment issue is co sleeping, as many people normally have the crib near their bed. Co sleeping is dangerous.", "ESH: you both fucking suck. What unhealthy patterns you dummy? Caring for a baby that cries? In all of your research have you read a human development book? Have you read the studies on long term effects of the cry it out method? You’re an idiot, to be honest.", "ESH. You both sound like terrible parents! Please find help, do parenting classes, and grow up!", "YTA and so is your girlfriend. Some people are just not meant to be parents.", "ESH and I feel bad for that baby", "YTA \n\nI hope a competent adult steps in to care for this baby", "ESH \n\nYall are both children not ready for this", "OP listen to me. My friends 7 month old rolled off bed and her head was hairline fractured in three places. Please take baby to ER! Especially since they kept crying. If not, and you want to neglect your babies needs I’ll adopt your baby. I have a six month old, what’s one more. YTA.", "Wow, there are so many things wrong with this story it’s hard to know where to begin\n\nI think you are both major assholes and neglectful of your child. It seems you’re both incredibly immature to have children but thought it would be fun to “try” until it happened \n\nI would suggest you give the child up for adoption so this poor kid can grow up in a family that truly wants it and loves it.", "Both of you are assholes. Don't have a fucking child if you can't spend time with your baby. E S H is too light for you. YTA", "Wrap it up next time my dude. You both suck. The kid didn’t ask to be here. \n\nHe’s your responsibility so put down the damn video game and spend some time with your kid.", "YTA there's no such thing as an unhealthy attachment pattern with a 7 month old...thats a myth. Both of you sound irresponsible as well.", "100% YTA \n\nYou're a father now. You are a parent. You are equally as responsible for your childs wellbeing as your girlfriend is. It is a team effort and it seems to me like she's playing the game alone while you sit on the bench and hop in when it's convenient to you. \n\nShe's tired and trying and you couldn't even give her the respect enough to take on your equal part of the responsibilities. Step up and be a good dad and partner and take care of your child.", "Your question is wrong. Is shouldn't be \"AITA for not watching baby\" it shoukd be \"AITA for not parenting my infant\"\n\nYTA", "Bro you’re trying to quantify how you’ve researched good habits while at the same time playing video games in the same room as a kid who is in a crib. Cut that bullshit out. You’re doing the bare minimum. It’s 10 pm, put the kid to sleep.\n\nYTA, you need to put more effort into your kid", "Yta to infinity. \"Unhealthy attachment\"??? Its a BABY, they're SUPPOSED TO BE CLOSE TO YOU. Do you even know anything about babies other than making them? This poor child, I feel so so sorry for him. He's going to be neglected to within an inch of his life with parents like you two. Please, for the love of fuck, use all the birth control and don't inflict your horrific \"parenting\" on another defenceless child.", "ESH\n\nBoth of you should be actively parenting. You prioritized playing a game over maintaining situational awareness of your child. She was wrong to take the baby out of a safe place then walk away assuming you would watch him instead of communicating directly. Bad decisions all around.\n\nAs for the sleep issue, if you’re better at getting baby to sleep then why didn’t you do that from the start? Also GF should learn and apply the same techniques you do since her way is inefficient but it sounds like pride is getting in the way.\n\nBoth of you have a lot of maturing to do.", "ESH your baby deserved better, more competent parents that prioritize his needs.", "ESH\n\nSeveral lines of this made me wish I could call CPS\n\nFor instance your GF left the baby on a bed unattended ( unless she asked you to watch him then it is on you 100 percent)\n\nYou saw your baby fall paused your game long enough to pass him to your GF then went right back to it without  making sure he was okay a baby that small falling off a bed could need to go to the hospital that's not a whoopsie back to the game thing\n\nYou heard your baby crying and ignored him  for 30 minutes not knowing if your GF had him or not \n\nYour GF DIDNT have him and was going outside to get away from his crying !\n\nIf you guys are over whelmed it is OKAY it happens to new parents but SEEK HELP before your baby gets seriously hurt.\n\n\nAlso BTW you are extra the A for quoting a bunch of parenting stuff you read judging your GF for not doing it AND clearly leaving most of the baby minding to her ..... Not willing to do it?? Shut up about it it's harder then it looks.", "Are you sure either of you even want that child? ESH", "Neither of you are capable of being parents.", "You're both AH. You guys clearly weren't ready to have a child and should have never had one. There is a huge lack of communication between you two as well.", "ESH \nYOU DONT LEAVE A 7 MONTH OLD BABY UNSUPERVISED FOR MORE THAN AN HOUR WHILE THEY ARE SCREAMING!!!!!\n\n\nYour GF shouldn't be removing your baby from the crib to put them on the bed and then leave without confirming you were watching it!!!\n\nShe has every right, in fact its encouraged, to step out of the room for about 10 minutes or so to calm down if the baby is SAFELY IN THEIR CRIB OR PLAYPEN. Not entirely out of the house, though. Same goes for you! When the frustration arose during the diaper change, you should have finished changing him then stepped out for a minute or two to chill out.\n\nBabies are going to cry. Thats literally their only way to communicate their needs! Its grating, its irritating, its anxiety inducing...but you do what you need to do and learn to cope in a way that doesn't hurt your child. Welcome to parenthood!\n\nY'all both need to sign up for parenting classes, for real!", "ESH you and your gf are clearly struggling with a new baby, but this is inadequate parenting. You need to get some help and parenting mentoring ASAP. The way you judge and criticize your gf is not helping anything.", "ESH except that poor baby. You two are not communicating and your son is not getting the attention or safe environment that he deserves. There's a difference between teaching a baby to sleep comfortably in the crib and ignoring crying for an hour and a half after the baby's had a FALL.  \n\n\nYou need parenting classes at the very least.", "He started crying when you tried to change his diaper so you just?? Left him in a dirty diaper??? Please tell me that’s just poor wording", "YTA. Take that baby to the emergency department NOW! The crying could very well be a head injury. Stop playing video games and pretending like YouTube videos are good parenting advice. Oy!", "Did either of you bother to ensure the 7 month old wasn’t injured? You DO realize babies falling from ANY height can easily break a bone, develop a concussion, break a rib? \nYou say he cried for an extended time frame after he fell - yet you and she assumed he was okay? \nYBTAH- never put a baby on a bed and leave them unsupervised and NEVER assume if a baby falls that they are okay with confirming it!", "Dude get off the fucking game and go be a parent.\nYTA", "Maybe you guys aren’t ready to be parents…", "I’m gonna say NTA bc OP put the baby in his crib. He was fine. Gf takes baby out of crib (for whatever reason) and puts him on the edge of a bed next to someone who isn’t paying attention and assumes the baby is still in his crib. Not really that hard to decide whose fault that is. Lmao at people who are acting like melatonin gets you high when it isn’t even truly proven to work in helping you sleep. Also no idea why everyone is just assuming that OP left the dirty diaper on the baby?", "Sounds like gf is suffering through postpartum challenges (depression and/or anxiety) and you’re a child who wasn’t ready for a child. From your description neither of you were ready for this responsibility. \n\nYTA for ignoring and removing yourself from the situation because you didn’t want your sleep disturbed. Also, as someone who used to game before having kids, you seem to not understand that gaming is a privilege you get to do after you’ve delivered on your obligations as a parent. You don’t get to game while there is still stuff to be done. If everyone in the house is asleep then you can but if kids wake up you better stop playing and tend to your duty. You’re a dad now. Fucking act like one.\n\nEdited to fix typos", "ESH. I have a 2 1/2 year-old and a two month old and this whole thing just made me cringe.", "This is why forcing people to have children who really shouldn't be having them is a bad idea. Kids deserve better, and people deserve choice", "Your poor baby. Neither if you are responsible enough or have enough common sense to be parents", "this is why kids shouldnt have kids", "YTA. “Unhealthy attachment?” Four gummies? Crib so you could play video games? Dude, someone should call childrens aid on the both of you.", "ESH. You and your GF need a visit from CPS.", "You're a HUGE FUCKING ASSHOLE. \n\nRead what you wrote. Read it aloud. You think video games are more important than your infant who literally depends on you and your gf to survive. \n\nPlease do not create anymore humans, you're a fucking joke.", "bye. neither of you were ready for a child. ESH.", "You’re both assholes and shouldn’t have a child. What the fuck are you guys even doing? Why is she leaving her son on the bed knowing full well he could fall, knowing you’re busy? Why are you ‘finishing the round’ of Apex when your son needs help? Why are you ignoring him crying? \n\nJesus man.", "I'm terrified the baby got hurt when falling off the bed, the guy changed the diaper it cried harder, he got frustrated and just put it in bed? YTA and I'm worried for that baby.", ">\n\n>so i went upstairs to help. my gf was making her way downstairs and went outside\n\n>she left baby upstairs alone before you came?\n\nThis is actually the absolute best thing she could have done. Do you have kids? Do you understand the feelings of frustration, anger, despair and fatigue that can be overwhelming when a baby won't stop crying and you've tried everything you can think of and you're at your wits end and you just want the crying to stop. Do you know how dangerous thise feelings can be? Putting the baby down in a safe place like a crib and walking away to get yourself together is 100% the best thing to do.", "Absolutely. I was two lines in when I thought “And this is why 20 year olds shouldn’t be having babies”. Omg", "I wish somehow that no one under the age of 25 was able to become a parent. I say this as someone who had my first at 24. Babies shouldn't be raising babies, and the world would be a better place if every person who becomes a parent had a fully developed brain of their own first. \n\nI realize there is no way to make this a reality nor should anyone try to make it so. It would just be nice if thats how the world worked.", "My thoughts exactly. It’s obvious neither parent wants to be or is prepared to be a parent", "they're 20-21 yrs old, that explains a whole lot chief 😭", "liiiiiiiiterally came here to say this. There is so much immaturity from both sides it's ridiculous.", "This post gave me so much anxiety and PTSD flash backs to my first born and her father. Literally made me sick to even read it.", "Also adding to this acting like you’re amazing cos you researched on line. Mum might feel pretty down your little one doesn’t go to sleep as easily with her as you so don’t be a knob about it. \nAlso I don’t think parenting is as easy as just researching then that just works every single time. What might work for one, not the other and some might go down easier for a few months then not other months.", "He put the baby in a safe place to play video games. The mother took the baby out and left. That’s on her. Also him taking melatonin to help sleep isn’t a bad thing. I do think he messed up (badly) when he ignored the baby crying for half an hour but taking melatonin in itself isn’t bad. The mother also left when the baby was crying rather than trying to help. So this is definitely an ESH and I’d say she’s a bit more TA but he’s definitely an ahole for trying to ignore the child crying", "Ugh for real. I’m not a parent but this whole story sucks (especially taking a little baby out of a crib and putting it on a bed without making sure someone was actually present / awake to support him like ???? What did she think would happen) I hope this person’s child doesn’t get any more hurt than it already is! Some people shouldn’t be parents.", "Seriously? His child FELL OFF a bed and he couldn't even leave the game he was playing to comfort him? That's a massive problem.", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I’m shocked he didn’t seem concerned that THE BABY ROLLED OFF THE BED! Then he continued to ignore the crying. I would be so distraught if my infant fell any distance and then continued to cry like that.", "When we had the post recently about a mother letting her baby cry in another room for 30-60 mins while she had breakfast/did her morning routine, this sub overwhelming found the father TA for not being OK and complaining about that.\n\nThere is so much gender bias here that it's a little bit gross.\n\nNevertheless I agree these kids shouldn't have a kid :(", "A couple minutes to collect yourself is not the same thing as video games and melatonin gummies in the other end of the house", "It depends on height/severity and the doctor I suppose. I called the doctors line when mine fell the first time and they don't suggest them bringing them in without certain symptoms cause they don't scan them unless absolutely necessary.", "When you put a baby to bed you are leaving them unsupervised if they are safe in crib. Leaving baby on the bed is not safe however and mum should not be doing that its fine if she is there and awake but not asleep or walking away. Its also recommended if you are overwhelmed to put baby in crib make sure all needs are met and take a 5min break where you can hear them or better with a baby monitor.", "What first got me is that they’re accusing a 7 month old of having an unhealthy attachment that needs to be broken. Wtf?!?  And it didn’t get any better from there", "They could be trying to sleep train the kid. It doesn’t sound like it but a half hour isn’t that bad depending on how you’re doing the sleep training.", "CIO has been proven by numerous psychological reports that it is harmful. But you can't soothe them too much anymore than extra cuddling or picking your child up all the time will \"spoil them\"\n\nhttps://www.bellybelly.com.au/baby-sleep/cry-it-out/", "Sounds like you aren't up to date on latest best practices. Infantd do not have the capacity to self soothe, this is harmful info that gets passed around incessantly. Babies need their caregiver to soothe them, this is critical for a secure attachment.", "Co sleeping (room sharing) is actually suggested for the first 6 months (or a year?) as a way to prevent SIDs as well.", "Who takes melatonin to sleep and then starts gaming??  Video games are the number one reason people cannot get sleep.", "Four is actually better in this instance, though I doubt OP knows that. A sleep therapy expert once told me that less melatonin is actually better and more effective. If you have too much in your system, it starts to flush out too early and actually causes night waking and worse sleep. Most adults take too much. \nStill, ESH.", "Lots of people, melatonin isn't some hard drug and it doesn't keep you asleep through a crying baby, your brain produces melatonin naturally, you're just giving it a boost.", "I have a two month old baby. I would absolutely NEVER take any medicine that would make me drowsy while caring for a child. That poor kid.", "Y'know, I  finally put my finger on why this is bothering me.  I took melatonin before I had a baby, but I didn't need it for a long time after giving birth because I was so sleep deprived taking care of a baby that I could fall asleep easily without it.  If this guy can't sleep without melatonin and he has a seven month old baby, then he's gotta be pushing all the nighttime work onto his girlfriend regularly.  And then complaining that she's doing it wrong.  Even if he's  right (and it sounds like he is) she's not going to take his opinion seriously when she's slerp deprived and doing all the work.", "My thought too", "Letting a baby cry for 30 minutes, when a baby is learning to transition to a crib, is not CIO.   Letting a baby cry it out is not intervening for the night ***at all*** (absent an emergency).  Giving them a chance to learn how to self-soothe and transition from one sleep cycle to the next without your immediate intervention is not CIO.  \n\nWe need to stop equating letting a baby cry for any amount of time with CIO.", "A 7 month old ***definitely*** has the capacity to self soothe.  At that age, most healthy children should be able to sleep on their own through the night (both of mine certainly were).  We have like a dozen different baby books (and 2 kids under 3) - all advocating different methods on how best to sleep train, and going over what the most common practices are - and I assure you ***none*** of them say a 7 month old lacks the capacity to self soothe.  \n\n It sounds like you are getting the \"latest best practices\" from reddit.", "Literally nothing wrong with the baby sleeping in another room, in a crib.", "To be fair, he didn’t say how many mg each gummy was. I take one 10mg melatonin pill every night and it’s not enough to keep me asleep the whole way through the night. But typically melatonin comes in 1-5mg pills or gummies. So he might not have been that dosed up in the first place. But also, too much melatonin has the opposite effect and stops you from sleeping. \n\nI agree these two both seem far too immature to have a child and they’re both assholes. I just wanted to set the record straight on melatonin use.", "My teenage self would never have taken melatonin, left a baby unattended on a bed for thirty seconds, or ignored a crying baby. I agree with you. It's not just about age. I think maybe these two lack mentoring and/or aptitude.", "That's why he's up to *four* of them", "This. There are a lot of methods of sleep training and teaching babies to self soothe that mean they're going to be left alone/not in a parent's arms and allowed to cry for short amounts of time. These are NOT CIO.  \n\n\nCheck-and-console is letting the baby cry for 1 minute, then returning and rubbing their back or similar and speaking soothingly but not picking them up, then once they're calm repeating the same thing for increasingly longer and longer periods of time. This technique worked best with my kids. They never got past five minutes.  \n\n\nThere's also routine fading, where you do the rocking and snuggling and other sleep associations, but increasingly reduce the amount of time you do it until it disappears. These are only a couple of examples.  \n\n\nCIO is just straight up not responding to your kid, even if it takes hours.", "I'm not talking 30 mins. I'm talking longer than that.  I actually know when someone refers to CIO they're taking about the Ferber method,  which isn't cool at all. \n\nAnd if you want to let your kid go all night and cry for periods of off and on, cool.  You do you.  \n\nBut if you CHOOSE to let your kid cry (quite stressfully I might add) for the upwards of an hour, 2, and so on,  guess what? That's damaging as all get out and isn't teaching the kid to \"self-soothe\". \n\nSome kids,  especially those who might have sensory processing disorders or those on the spectrum (but might be more subtle in presenting that you can catch) can't always self soothe. You think they're going to just naturally pick up oh,  I need to calm myself down? No,  they just pass out from exhaustion and stress overload.", "Please. What someone writes in a book is not relevant. Here is a referenced, peer reviewed article from a scientific source, written by a PhD researcher (and professor) which was easily found with a quick search.\n\nhttps://www.psychologytoday.com/us/blog/moral-landscapes/201112/dangers-crying-it-out", "Sleeping? Fine. Crying? Nope.", "OP probably thinks “unhealthy attachment” = holding the baby when he cries.", "Nice.  That article is about crying it out, which as I stated above, involves letting a baby cry for the ***entire night.***  Also it is from 2011, so it is outdated.\n\nHere is also something I also found with a quick search - from the same website, and from last year: [https://www.psychologytoday.com/us/blog/the-shameless-psychiatrist/202109/children-and-sleep-leave-them-alone](https://www.psychologytoday.com/us/blog/the-shameless-psychiatrist/202109/children-and-sleep-leave-them-alone)\n\n\"Once they are old enough to sleep through the night (at 6 months or so depending on your child), not reacting when they cry immediately but letting them learn to self-soothe is a great technique for creating independent sleepers.\"\n\nGlad we both agree now that the current research shows that a healthy 7 month old has the capacity to self sooth .", "I understand that (and FYI I think they are both  truly awful parents) but if the mother saw the bf with his headphones on and engrossed in some game after taking some gummies and needed a few minutes to herself she should have left the baby in the crib.  FYI I also think that when the baby fell of of the bed that the game should have been turned off and both parents focused on their child.", "I came here to say this. The walking away part was the only part that was a good strategy. But ... It should be brief. ESH.", "This, thank you. While I don't recommend it as a normal parenting method when a parent is feeling overwhelmed this is way preferable to what I've seen happen.", "Yeah, a *short* time is ok. Time enough for the parent to catch their breath and recenter themselves. \n\nIt’s not time to chow down on sleep aids and play video games, or just walk away and leave a kid crying for 30+ minutes. \n\nNeither of these people are doing a good job.", "As a parent of a baby that had colic, holy crap it is unnerving.  And it was my 1st kid.   \n   \nNot a specific comment on OP and his baby momma, there are a couple troubling things with them.  I wouldn't say call CPS level troubling.", "Right like theres so many sleep training methods one of which is cry it out where you make sure they safe and let them cry themselves to sleep. Personally i couldn’t do it i hate leaving my daughter crying, but it is a health professional approved method. I also assumed he put baby in crib asleep not awake crying maybe im wrong there though.\n\nEDIT: cry it out is actually unsafe pointed out by another user so i retract my saying its a valid method to use to leave baby to cry if they are safe.", "I can almost guarantee that child will have reactive attachment disorder… so sad because most of the time RAD is preventable.", "You both need some parenting classes and some therapy based on your comments. Please. For the sake of your baby", "If the baby's crib is by the bed it's safe to assume she probably got up when he first started crying and checked on him, OP says she was exiting around the time he was going up after about 30 minutes of him ignoring the cries so are we just going to assume she was sleeping beside the baby and then sitting there ignoring him for 30 minutes before going outside?", "\"Cry it out\" has been found to be incredibly harmful to development. I believe it's talked about in The Boy Who Was Raised As A Dog by Dr Bruce Perry (though it's been a few years since I read it, so I may be thinking of another book.) It is NOT appropriate to use the \"cry it out\" method because it has been proven to cause serious and lasting damage. Plenty of horrific things used to be \"health professional approved\". Sometimes, doctors are spouting hypothesis as fact because the research simply doesn't exist."]}