{"id": 5331, "submission_id": "zs6kmk", "title": "AITA for agreeing to a meal share agreement but refusing to cook when it was my turn", "selftext": "I live with three housemates, lets call them \"Hannah\" \"Stacey\" and \"Meg.\n\nWe are all usually home Monday-Thursday, and it was suggested that to save money and have a communal event, that we share dinner those nights each of us taking turn to cook.  \n\nStacey is gluten free and vegetarian (the sort that eats fish and eggs and stuff, but not red meat or chicken) Hannah is also gluten free, I'm allergic to potatoes and tomatoes. When I raise we've got a few dietary requirements to consider Stacey agrees the no tomato thing will be a bit limiting, but is still encouraging saying \"half of us are gluten free, most things these days are vegetarian and how hard is it just not to eat a potato?\"  \n I explain that potato is often used as a filler or an ingredient and you need to check for it.\n\nWe decide to go ahead.\n\nMonday Stacey makes potato bake with salad. She seems surprised I won't even try the potato bake, and doesn't seem to really get that being allergic to potatoes means I can't eat potato bake even if it's \"organic\" \"gluten free\" \"home made\" and \"really yummy. The salad is literally just lettuce and cucumber without dressing.\n\nTuesday Meg makes crumbed fish and chips of the \"buy in a bag and chuck it in the oven variety.\" She remembered the no potato thing and got some microwaveable vegetables for me instead of chips, but when I asked her if the fish contained potato I got a blank stare and a \"uh... it's fish, the box said gluten free?\" So I fished the box out of the bin and it contained potato flakes. I remind everyone again about checking ingredients.\n\nWednesday Hannah makes gluten free pasta bake. It's not a tomato based sauce. I ask if she's checked the ingredients of the gluten free pasta and... nope. It has potato. There is literally only two ingredients in this pasta, chickpea and potato. She feels really bad and offers to make me something else, but I say it's fine and I'll just have cereal.\n\nBut, it really isn't fine, because I haven't really had a meal any night. Individually, everything was understandable, but three nights in a row was just too much. So Thursday morning I message everyone saying it's not working out, I don't want to do the meal share and I won't be cooking that night. I say I'm happy for them to still do the meal share, but that including me is just too difficult and it will be easier for all if I arrange for myself.\n\nHannah gets it, but thinks I should have given everyone a second chance and that I at least should have seen out my turn to cook. She said \"gluten free is easy because it says it on the box, but having to read ingredients isn't normal.\" Stacey thinks I'm a straight up AH who didn't appreciate that she made a meal from scratch and then refused to cook for her because I \"didn't like what she made.\" Meg doesn't care, but wouldn't take sides.", "created_utc": 1671668694, "permalink": "/r/AmItheAsshole/comments/zs6kmk/aita_for_agreeing_to_a_meal_share_agreement_but/", "score": 106, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the AH because even though I couldn't eat the meals, the other three still took the time to cook for me and I didn't cook for them, which I get from their point of view might not be fair.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but you guys really are the nightmare blunt rotation of communal cooking", "NTA. You gave them warning so they had time to find/arrange alternative.  You didn't even do to them what they were doing to you (making food you can eat and they can't).", "NTA. You would think GF people would understand what's it's like to have a dietary restriction!  Each subsequent person should have taken extra precaution considering what happened the previous night. \n\nYou should have taken your turn and made a hamburgers with buns!", "NTA. \n\nIf you agree to cook for someone and you know of a dietary requirement. Then you meet that dietary requirement no ifs no buts.", "NTA, your roommates are wack. You made the proper decision by saying you won't participate anymore. It's not impossible to avoid potato and I can't believe how much they're struggling with it.", "NTA\n\nYou don't dislike tomatoes and potatoes, you're allergic to them.    That's entirely different and for you, having to read ingredients is just a normal part of keeping yourself safe.", "NTA. They failed to take your allergy into account every single night. That sucks and you don't owe them anything.\n\nHowever, you do still have to live with them. And the idea is still a nice one. In the interest of household harmony, wouldn't it be nice to cook tonight and use the opportunity to show them what to look for and what kinds of meals will work for everyone's needs?", "NTA.  They sound exhausting, good luck with the rest of your lease.", "NTA for being irritated on the situation, but you may have shot yourself in the foot with your response. Cancelling on Thursday morning with a message instead of confronting it more assertively doesn't really make you an AH but it cuts out the chance for a better long-term solution. Maybe chat with them about trying again and come up with a fair plan for a response if someone screws up an allergy?", "NTA and it sounds like rotational group cooking just isn't going to work for your household. Specific dietary requirements don't mix well with people who can't remember them and who don't want to read labels.\n\nYou can still have a communal meal though, just everybody makes their own dish.", "I think NTA but would be open to a second chance. \n\nIt is 3 mistakes in a row but for 3 different people. The first one was silly made potatoes, but the last two were a bit more understandable, i would not have thought to check pasta or fish for potatoes ingredients. \n\nIf they refuse to check going forward def. drop out, but if they agree to check I would give it another try.", "NTA. I can't imagine it would be much fun to eat gluten-free, potato-free, tomato-free, veggetarian meals four days a week. Most gluten free items (that are mimicking their gluten counterparts) are made with potato. Hanna and Meg sound like they aren't the problem. Stacey sound clueless.", "NTA and you cooking solo is probably the best and safest bet for everyone.", "Why don’t you at least cook for your night so they can get an understanding of what you eat and it might help give them ideas about what to make on nights they cook?\nA second chance mightn’t hurt and maybe have a sign up about everyone’s dietary requirements on the fridge so no one forgets.", "NTA. The arrangement isn't working for you and could potentially make you sick. You don't have to keep doing it.", "NTA", "Sigh, NTA. I am allergic to legumes, so as soon as I read “gluten free” and “potato allergy” I knew where this was going. It is not that hard to look at the ingredients and choose accordingly. It is, however, very difficult to accommodate a potato allergy with a gluten free diet.", "Ugh, those people. Don't agree to cook for people with allergies if you can't handle *reading a fucking ingredient list*!\n\nNTA\n\ne: also I just noticed that Stacey was the one saying how hard is it not to eat a potato and then *literally makes a potato bake* like wtf\n\ne2: if you'd been able to eat even 1 of the meals I'd have said to take your turn cooking before bailing, but 3 failures means you didn't get to participate anyway so you owe nothing lol", "NTA\n\nBut, the petty part of me says buy rye bread, since that says rye on the package but probably contains gluten. And maybe sprinkle bacon on everything, because who doesn't like bacon? It's gluten free...\n\nIt is hard to believe people with that many food restrictions think reading labels is weird.", "Could of even handled a little better but NTA. There’s a huge difference between not liking certain foods and being allergic to them! They’re not taking your allergies into consideration. For the room mate that said “reading the labels isn’t normal” is a ridiculous excuse! She clearly reads the labels to make sure it’s food she can eat. You’re better off cooking for yourself.", "Nta but I think I would have done my one night and then told them you dont think it would work", "NTA. You are allergic. It is not a matter of taste, it’s a matter of your health. If you do decide to continue like a lot of people are pressuring you to, make sure that everybody understands that. That means no cross contamination, no “oh I’m sorry I didn’t look at the ingredients, that’s weird”, and no guilt tripping when you won’t eat what they make. They’ve broken your trust to an extent and they have to earn it back. Cancelling in the morning isn’t a big deal, they literally have all day to find other dinner plans. I don’t understand why everybody in the comments is so upset about that. The roomate who’s still upset that you didn’t eat her potato bake needs to really understand that she could harm you with ANY potato’s. I’m sorry this is going on, I hope somehow the situation resolves and everything goes back to normal. Best of luck!", "Why did you even agree to this knowing all your restrictions?", "NTA - although I would agree with Hannah with seeing out your turn (perhaps showing them how things taste without potato or tomato will help them understand) and giving 1 last chance (with a back up meal JIC)\nStacey is an AH for not respecting allergies, it’s not a preference", "NTA, but sometimes you have to decide whether standing on principle is worth causing drama in your household. In my opinion, at least cooking for one night -- while not your obligation -- would be a wise course of action to placate your housemates and help keep your home drama-free.", "NTA", "NTA. Ignorance that \"gluten free\" doesn't equal \"Potato free\" isn't a valid excuse for everyone's failure to make an acceptable meal when they were all aware of everyone's dietary preference/restrictions. \n\nBut your roommate's suggestion to make the meal for them one time is reasonable. Yes they failed, but consider that, if the rotation started with you, you would've had to cook once anyway. You shouldn't take advantage on your good luck in establishing the pecking order on who cooks. \n\nIt also would be smart for you to give them a second chance to get it right. You presumably want to maintain a good relationship with your roommates and communal cooking is a great way to do that. Giving them a second chance only costs you having a backup plan on meals, which IMO isn't a huge deal if it means they may learn to cook appropriately and save you time 3 days a week.", "I NFO: Do Stacy and Hannah actually have celiac desease or other gluten allergies or intolerance, or are they \"gluten free\" because it's kinda fashionable these days?\n\nEither way, with the host of dietary restrictions (voluntarily or not) between all of you, sharing meals was probably not be the best idea in the first place, so NTA I guess?", "NTA", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI live with three housemates, lets call them \"Hannah\" \"Stacey\" and \"Meg.\n\nWe are all usually home Monday-Thursday, and it was suggested that to save money and have a communal event, that we share dinner those nights each of us taking turn to cook.  \n\nStacey is gluten free and vegetarian (the sort that eats fish and eggs and stuff, but not red meat or chicken) Hannah is also gluten free, I'm allergic to potatoes and tomatoes. When I raise we've got a few dietary requirements to consider Stacey agrees the no tomato thing will be a bit limiting, but is still encouraging saying \"half of us are gluten free, most things these days are vegetarian and how hard is it just not to eat a potato?\"  \n I explain that potato is often used as a filler or an ingredient and you need to check for it.\n\nWe decide to go ahead.\n\nMonday Stacey makes potato bake with salad. She seems surprised I won't even try the potato bake, and doesn't seem to really get that being allergic to potatoes means I can't eat potato bake even if it's \"organic\" \"gluten free\" \"home made\" and \"really yummy. The salad is literally just lettuce and cucumber without dressing.\n\nTuesday Meg makes crumbed fish and chips of the \"buy in a bag and chuck it in the oven variety.\" She remembered the no potato thing and got some microwaveable vegetables for me instead of chips, but when I asked her if the fish contained potato I got a blank stare and a \"uh... it's fish, the box said gluten free?\" So I fished the box out of the bin and it contained potato flakes. I remind everyone again about checking ingredients.\n\nWednesday Hannah makes gluten free pasta bake. It's not a tomato based sauce. I ask if she's checked the ingredients of the gluten free pasta and... nope. It has potato. There is literally only two ingredients in this pasta, chickpea and potato. She feels really bad and offers to make me something else, but I say it's fine and I'll just have cereal.\n\nBut, it really isn't fine, because I haven't really had a meal any night. Individually, everything was understandable, but three nights in a row was just too much. So Thursday morning I message everyone saying it's not working out, I don't want to do the meal share and I won't be cooking that night. I say I'm happy for them to still do the meal share, but that including me is just too difficult and it will be easier for all if I arrange for myself.\n\nHannah gets it, but thinks I should have given everyone a second chance and that I at least should have seen out my turn to cook. She said \"gluten free is easy because it says it on the box, but having to read ingredients isn't normal.\" Stacey thinks I'm a straight up AH who didn't appreciate that she made a meal from scratch and then refused to cook for her because I \"didn't like what she made.\" Meg doesn't care, but wouldn't take sides.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Stacey has to be a little bit special not to understand how allergies work....", "NTA  for not participating.  But this entire situation wasn’t handled well.  \n\nThis could be such a great situation for everyone and so easy to make work. I hope you’ll consider giving it another try.  You just all sit down on the weekend (or a group chat) and make a meal plan. Tell everyone what you’re making on your cooking day and ask if it works for all. That way you can ensure there’s no dietary issues and everyone isn’t cooking the same thing. \n\nThere are lots of options that meet all dietary requirements if everyone is willing to make real and not processed food…. \n\nI can think of lots of meals that meet all requirements fairly easily……for example, Tofu and veg stir fry on rice, roasted salmon and salad, pan- fried cod and sweet potato fries, shrimp and grits, veg omelette with green salad, asparagus and mushroom risotto, couscous salad, veg fajitas (with regular or gf wrap options-freeze extra wraps for next time) veggie burgers (with regular and gf bun options),……", "NTA. And Stacey is gonna kill you with her ignorance if you eat her food.", "I'm going against the grain and saying YWBTA to not cook. They are learning, and you agreed to it.  Thay being said, if you forget to check for gluten and other things YWNBTA.  Use this as a teaching opportunity.", "NTA but I probably would have cooked this one time anyway. You're already going to be making yourself dinner and showing them that you can cook good food around your restrictions could open the possibility to trying again.\n\nStacy is definitely the VIP AH here for pretending not to understand what an allergy is.", "First of all, I feel terrible for you. Being allergic to two of my favorite things on the planet. Second, NTA, I think the food sharing thing may not be right for you.", "NTA at all, they didn’t follow your dietary restrictions so I think it’s completely reasonable to back out of the meal sharing plan. You weren’t obligated to do the meal share anyways and you barely ate anything they cooked for the three previous nights. They weren’t used to checking ingredients and you want dinner that you can actually eat. Trying to cook together when the three of you all have different dietary restrictions is just unlikely to work out. \n\nPurely for your comfort and benefit though, if you want to maintain a good relationship with them given that you are house mates and are bound to interact at least until your lease is up, I would suggest perhaps cook a low-effort meal to “make up” for your turn, and involve them in making sure everyone’s dietary restrictions (especially yours) are being met. And emphasize the consequences of you accidentally consuming potatoes. \n\nThat way, hopefully they will understand that if they are cooking food for someone else, it’s their responsibility to adhere to other’s dietary restrictions as well. If they still have a hard time understanding that, or show that this was due to something personal against you, have a conversation with them if you feel up to it, or just maintain a respectable distance and avoid their cooking.", "NTA because the agreement wasn't actually enacted. They made food that you could not eat, because their dietary restrictions were important, but your allergy was not.\n\nJust make it clear that it's dead in the water and that's the end of the discussion because they didn't put in the fucking effort.", "NTA. \n\n\nMy partner and I regularly host gatherings, and where I do all the shopping and the overwhelming lion’s share of the cooking.  One frequent guest figured out - eventually - that anything soy sets off inflammatory and gut bacteria reactions, which has all kinds of unpleasant effects; this means not only no soy sauce, but no soy products at all, including soy lecithin, which is in almost everything as a preservative among other things (for example, the brand of stock I use, there’s no soy in any of their flavors *except* turkey, so for Thanksgiving I had to go with another brand for making the extra gravy). So I check the ingredients rigorously, to make sure there is no soy (the upside is that I usually make things from scratch, which is a lot healthier). \n\nOne other frequent guest is a (I don’t know the word, they don’t eat mammals but will eat poultry and seafood), and so if I’m barbecuing, I always make sure there’s an option for them. \n\nAnother one has tomato issues, but can handle red sauce in limited amounts, so I control for that. \n\nAnd an infrequent guest is full vegan, so I actually make them RSVP for real, if I’m preparing something specific for them. \n\n\nYou told them your dietary issues ahead of time, they either ignored it, or weren’t rigorous in checking the ingredients. If you decided to opt out, since you haven’t been able to eat anything they’ve made this whole week, that sounds perfectly reasonable to me, since it also sounds like it won’t get better over time.", "NTA \n\nMake chicken Alfredo and then act surprised that they won't eat your meal. This meal-share was destined to fail.", "NTA and I'm here as a fellow person with a potato allergy! Honestly, it's a weird one and people look at me like I'm an alien when I tell them. It's rare, but there are lots of us on the Internet! People just dont realise how much potatoes are used in... everything. I just tell them sweet potatoes are better! And that's how they learn they're a completely different plant group.", "You’re NTA. However I am petty and would have cooked a meal full of gluten and meat based dishes, to really drive my point", "NTA. Petty me says to cook something they can't eat, then tell them you didn't check the box because they established that it wasn't necessary. \n\nThe truth is that you have *actual dietary restrictions* and they have, from what you've written, strong dietary preferences (I think one GF *might* have an intolerance, but you haven't said specifically). But their attitude towards your intolerance is quite indicative that they don't understand that not only are your food requirements not optional, they are health harming if not followed. You told them what was required, gave them specific guidance, and they failed to follow through. You do not *owe* them a meal because they never provided you with one.", "NTA you could have cooked or tried but most likely you’ll struggle because potato is used as a gluten substitute a lot", "NTA. For everyone saying to give them a second chance- why would you think they take it seriously? One person still openly says it’s stupid after purposely making potatoes, another still says reading ingredients isn’t normal. That’s not giving me confidence that they’ll read ingredients. If they were apologetic & took some responsibility, sure try again. But they’re not.", "NTA. Y’all are too many restrictions to be meal sharing. Eat what you enjoy.", "Nta , it literally takes 2 minutes to read ingredients on a box and this is from someome who had multiple allergies that ruled my life for a few years.", "NTA, but I recommend the app Fig. You put in your allergies, food intolerances, dietary restrictions, etc and you scan the barcodes of different ingredients. Might help your roommates if you decide to give this another try. Could also help you save time if you don’t want to read every label at the grocery store.", "NTA,  you don't say if the GF people are GF due to allergies or just a choice.  It sounds like they are not allergic, otherwise they would find it normal to label read.   You are allergic to tomatoes and potatoes.  I'd never give them a second chance, especially after saying label reading isn't normal.  Plus telling them multiple times about your allergies, they are only upset that you didn't take your turn, not that they could have caused you issues.", "NTA, and they claim gluten free, but don't read ingredients? Not everything is clearly marked, so as someone with celiac I always do a full read, and especially if I am cooking for others who also have allergies or restrictions. But even with that logic, that first night? Literally a potato dish. Wtf. Like, you have no idea how many people I know just assume soy sauce is gf because its soy based. But wheat flour is a main ingredient(stabilizes during fermentation). Its easy for people unaware to make mistakes, which is why its always encouraged to read ingredients. Always.", "Esh. My only hope is that it is unlikely your weak genes will not reproduce because there is no man in the world able to put up with your collective neuroses", "Nah, but i think giving them a week to see what they haveto do to adhere would have been reasonable", "Gentle YTA\n\nI get that it was hard for them to find items you could eat, but you did make the agreement and they TRIED to make foods you could eat (at least the last two did). You should make the meal you owe them OR give them money for what they paid for your portion since you won't be reciprocating. Also if you all want to save money- then just cook for yourselves in bulk. This obviously isn't working and short of you giving them a list of acceptable items, its just not going to work", "Mild YTA. I have a friend with deadly nightshade allergies so no chilli, peppers, potatoes or aubergine. Eating out with them can be interesting as so many foods are ruled though thankfully \"only\" the chilli will cause anaphylaxis. Rest just make her very ill. Catering for allergies/intolerances for such staple food binders is very hard. Edited to add so leaving agreement makes sense. \n\nWhere the mild comes in is I would have seen out your committment to feed them that one meal. By cancelling at very last minute, you let them down. Yes, you hadn't had a decent meal but one aside they had tried and spent money/time.", "YT A for not cooking for at least one night. Even tho their meals sucked; you need to take your turn to cook. It could be a great opportunity to show them how easy and delicious it is to make a potato free meal. Then after you’ve cooked it would be fair for you to decide to not be a part of the meal share anymore. NTA for wanting to not deal with that, I have severe food restrictions and I’ve pretty much settled on the fact that only I can make food for my self", "NTA but also possibly NAH. Well except Stacy which is a pretty self centred reaction.\n\nPeople learn from situations like this. Yes it was 3 days in a row, but it was one time per person. To be realistic all of you should be double checking ingredient lists, not just for yourselves but for each other.\n\nMaybe you could try meal planning together? That way the cook decides, the crew reviews, and proceed with any required adjustments. Otherwise, your compromise is just fine and you don’t need to do anything you don’t want to.", "Great comment. I have no notes.", "😂", "This! I found the GF comment about reading labels for ingredients being weird to be so odd. I’m gf and read labels on everything because not everything gluten free is labeled as gluten free, a lot of times items are just naturally that way. Also gluten hides in different names so… I always read the dang label!", "Honestly, I think it’s just not a good plan to share cooking so often with moderately conflicting dietary needs. They can still have housemate bonding by eating separately made meals together. If the housemates throw a fit about OP eating separately, they are being unreasonable. Also OP does not owe more notice — he’s had no dinner for 3 days without any notice.", "Exactly! My various housemates have done this and it’s always super nice to have company (but you still eat what you like).", "Huh. I just made fish tacos with corn tortillas, black beans and cilantro-lime rice which fits the bill.", "Not so hard if you avoid processed foods or don't focus on western foods. I'm making a vegan split pea soup tonight. I make plenty of vegan curries and stir fries.", "Honestly, I don’t think that OP was that enthused about the meal share concept in the first place. It sounded much more a way of going with the flow than something he in particular wanted. And gluten-, potato-, tomato-free pescatarian is a fairly restrictive diet to cook within. I think it would be easier and better for him to meal prep and they all sit down to eat their respective meals at the same time. They can do house meals for special occasions or weekly rather than every day", "This is the way", "That’s what I was thinking - fixing something that isn’t gluten free etc but claiming “oh well it wasn’t bread so it should be gluten free” \n\nBut no I don’t actually recommend it", "> although I would agree with Hannah with seeing out your turn\n\nWhy? 3 nights of OP not being able to eat the meals means OP owes nothing", "Disagree. None of the three roommates were even remotely concerned about placating OP. Why should she have to worry about placating them?", "I don't know if Hannah is actually a coeliac, but Stacey isn't because she's \"mostly gluten free\" because she thinks it's healthier, but eats it sometimes for a treat. Hannah is much stricter and doesn't eat it at all.", "> but YTA for cancelling morning of your turn to cook.\n\nNone of them made a meal that OP could eat so they effectively cancelled on her 0 minutes before mealtime and she had to adapt. Everyone else has a full day to prepare. NTA", "> YTA for cancelling morning of your turn to cook. \n\nStrongly disagree. OP could not eat *any* of the meals, so the only 3 sharing are the other 3 roommates, so they can just loop back to the start.\n\nOP owes nothing.", "They literally did not try. They have multiple food restrictions and they refuse to read labels? That is the most basic of basic. I have no food restrictions but my friend is vegetarian and whenever I get anything that I’m anticipating she will eat (dinner or snacks for when we hang out) I read the label because there’s random meat stuff in a lot of things. I could not imagine having to get food for someone who can’t eat gluten, potatoes, tomatoes, or meat and just grabbing stuff off the shelf without thinking about it.", "OP unable to eat all 3 meals = only 3 people were meal sharing = OP owes nothing", "> By cancelling at very last minute, you let them down. Yes, you hadn't had a decent meal but one aside they had tried and spent money/time.\n\nOP cancelled a solid 8 hours before, that’s nowhere near “last minute”. And they still managed to share among 3 people so they didn’t actually spend any additional money on OP’s portion since they wouldn’t have made any less food. \n\nWhat you’re asking for is someone _who didn’t benefit at all_ feed her roommates for free.\n\nThe one roommate tried to feed OP, who can’t eat potatoes, a potato casserole.", "This surprised me as well to be honest because I thought the same thing. Stacey isn't totally gluten free, she avoids it because she thinks it's unhealthy but eats it sometimes, but Hannah seems pretty strict with not eating it. Hannah did remember to check everything else, but not the pasta. It did say \"gluten free pasta made from chickpeas\" on the front of box, but then the actual ingredients were on the side and listed chickpeas and potato.", "Yeah the comment that reading ingredients is weird really tells me they are gluten free because they choose to be. A family friend of mine is gluten free because she’s so allergic to gluten it could kill her if she doesn’t have her EpiPen. The amount of things that contain gluten is astonishing when you start to check to make sure things are gluten free.", "Ah, thanks for the reply. \n\nNeedless to say, Stacey is wrong.\n\nEditing my original comment so my NTA is visible to the judgement bot.", "But they did, she even says the one girl realized she shouldn't have done potatoes and went and got her veggies. The next one made a bake and didn't use tomatoes because she knows the allergy. Both people didn't realize potatoes were in the food because MOST ppl who aren't allergic aren't going to think potatoes are hidden in fish or a veggie pasta. So they did try.", "They made an agreement each would cook a meal. Two people actually tried to make meals for her to eat. They considered her. Reading for ingredients when you aren't use to it takes some effort. She should hold up her end and make one meal and that's it.", "Same day is last minute if people working/studying 9-5pm and expecting an evening meal. She didn't benefit but two of the three spent money and time trying to be compliant.", "Stacy doesn’t really sound like she fully understands dietary restrictions and choices are different for everyone. Just because she’s “gluten free” but still sometimes eats gluten doesn’t mean you’re “potato/tomato free” but still sometimes eat potatoes or tomatoes. NTA", "I was going to say, there are people who really CAN'T have gluten, and there are the faddists...  who have no respect for allergies, and can't be bothered to read ingredients lists.  Because reading is hard, and it's not like those things will kill them.", "> They made an agreement each would cook a meal.\n\nThat each would cook a meal for the 4 of them to share. The other 3 all failed to provide a meal for OP."]}