{"id": 5335, "submission_id": "zs9zgr", "title": "AITA for telling my friend nobody in the real world will take him seriously?", "selftext": "So my(24F) best friend since middle school (24M)is MAJORLY into goth/alternative stuff and has been since he was very young. He dresses in all black, mainly listens to edgy metal/emo music (MCR is especially his favorite) and he talks about these things a lot. He is also heavily involved in fandom culture and he has a tendency to hyperfixate on kids shows his current fixation being some show called \"The Owl House\"(Hes autistic btw)Now i'll admit that when I first met him, my kid mind thought he was the coolest dude but since im not y'know, mentally 12, I can't help but find his behavior cringy now. We're both about to be in our mid 20s and he still dresses and acts like an edgy teenager. Just the other day I was talking to him on the phone and he started to excitedly talk about some band he started listening to and I said \"Dude do you not feel even a LITTLE embarassed?\" And he asked what I meant so I told him that nobody in the real world would take him seriously because he looks and acts like a teenager and that it was time to actually start acting like an adult. He went quiet after that and he hung up on me and ended up blocking me on pretty much all social media.\n\n\nDon't get me wrong, hes a nice guy. He has a job that he works hard at, he helps his parents out around the house (he still lives with them because ofcourse he does🙄) and hes a really smart person. He was always one of the best students in our grade. I just think that if he grew up a little he would get very far in life and I figured I needed to be the one to motivate him to do that being his best friend. Aita?", "created_utc": 1671677426, "permalink": "/r/AmItheAsshole/comments/zs9zgr/aita_for_telling_my_friend_nobody_in_the_real/", "score": 202, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because I may have taken it too far  by asking him if he felt embarassed.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You realise most OG MCR fans are in their mid- to -late- 30s now, right?\n\nThey live in the real world. They have 6 six figure jobs and mortgages and errything. \n\nAnd they still listen to MCR.", "YTA and quite frankly a horrible friend. Friends accept each other for who they are. I’m still confused how you had to go from him being excited about an interest (music) to disrespecting the hell out of him for being himself. He has a job, who gives a shit if he lives at home! One of the smartest things you can do, if it’s healthy, is lice at home. Rent is outrageous. Food is outrageous. Cost of living as a whole is outrageous. \n\nTo be honest this entire post comes off like you’re projecting. I’m sorry that you’re not happy with your life but there’s zero acceptable reason to put others dkwn", "Who the hell are you to pick apart your best friend for what he likes. Who are *you* to tell him that he should be embarrassed? If he’s happy, what’s in this for you?\n\nYou aren’t embarrassed for telling other people to be ashamed of who they are? If not, you should be. This isn’t motivation. You’re just an asshole and a bad friend.\n\nYTA.", "INFO:\n\nWhy do you hold such disdain for someone you claim to be friends with?", "YTA. Yes you are the biggest asshole here.\n\nFirst of all you have absolutely no right to tell people to act \"normal\" or \"grow up\" because you think they're not. And so what your friend still live with their parents? From what I read he have his life pretty well, who are you here to judge or look down at him anyway? \n\nAnd plus he have autistic, it means he have trouble to understand other peoples, and the fact he was exciting to tell you about the new things he found and love, this show how much he likes to befriend you. And that's how you treat him back?", "YTA, stop hanging out with him he deserved better than you as a friend. Since you are a terrible one.", "YTA. You do know that for some people this is just their style right? And since when is liking a certain band not allowed because of age? MCR isn’t even geared towards kids or teens. \n\nYou sound judgy and I hope he finds a better friend. Because you definitely aren’t one if this is how you see him.", "YTA and a killjoy. No one appointed you the “real world” police. If you feel you can’t respect this person, don’t be friends with them… you’re not being “helpful” by being needlessly cruel (and wrong) to them.", "YTA and you’re ableist. “i’m…not mentally 12” “if he grew up…” etc. you’re a horrible friend and person, and the way you think of him and speak to him is downright cruel. get it together and assess your own faults in disliking him for being autistic. it’s disgusting on your part.", "This can't be real. No one is this awful to someone they call a friend. \n\nIf it is true, I'm glad he ended this toxic relationship. He deserves people around him who like him for who he is, not people who judge him.\n\nYTA", "YTA. The real world hates shallow people like you. Don’t be his “friend” if you’re THAT bothered.", "YTA. You sound like an ableist boomer are you sure you're closer to his age? It's okay to enjoy fandom culture. It's okay to hyperfixate on interests (this is a very neurodivergent thing to do). It's okay to dress like a goth teen or have piercings or sleeve tattoos or any of the other things the boomers have told us isn't okay as an adult. IF he finds people who don't take him seriously because of that (oh wait, he already found you...), he may not care or he may just find someone who takes him for who he is. Not everyone is the same and that's okay.\n\nAdditionally before you shit on him for living at home, maybe take a sec to look up current statistics of gen Z living with their parents. It's quite high, but for a reason. Housing and rent prices are so high in so many areas that a lot cannot afford it.", "Yes you are the Ahole there’s nothing wrong with being goth/alternative at any age I’m 25 almost about to be 26 and I just now started dressing goth and alternative after hiding my true personality around everyone else", "YTA.\n\nIt sounds like you really look down on the guy. If that's the case, why are you even friends with him?\n\n> I figured I needed to be the one to motivate him\n\nBy talking down to him, embarrassing him and making him feel like he's so pathetic that nobody will ever take him seriously? That's not motivational at all. \n\nOP, do you notice that you're the one who's embarrassed of him and doesn't take him seriously? Yet you claim to be his \"best friend\"", "YTA. I know plenty of extremely successful adults who dress however they want and have childlike interests. I hope he realizes that he needs better friends ASAP.", "YTA \n\nIn my experience the people not being taken serious in “the real world” are people who judge others on their interests and preferences. \n\nYou’re the one that needs to grow up a bit more and get out of that mindset before you start working with colleagues with all different kinds of interests", "YTA, providing unasked for, judgmental, and incorrect advice is always an asshole thing to do.", "YTA- \"Growing up\" and \"Being succesful\" doesn't mean you have to give up all the things you love. Do you know how many Elder Goths I know that are 40+ and are successful in life by any measure, but are still wandering around in their blackest blacks and still passionate about music (or a variety of things you're supposed to \"grow out of\"). I'm only Goth-adjacent, so I'm not even talking about myself. But I got to tell you, they're out there living their best life, while you seem miserable in the real world. Stop trying to change your friend. Let him enjoy things even though they aren't things you enjoy. Go find something you can be passionate about.", "YTA - OP why don’t you grow up and realize in the “real world” no one gives a shit, except for people who have nothing better to do than judge others + act like a savior and it seems like you’re that person (because ofcourse you are 🙄)", "Yta. I stopped reading when you mentioned he’s autistic. So weird to shit on someone’s special interest like that. Be respectful.", "YTA. \n\nYou were prompted to say this because he “excitedly talked about a band he started listening to”??\n\nLiterally every adult I have ever met in my entire life talks excitedly about bands they like.", "YTA for your attitude alone.", "YTA. I'm 33 and a research assistant at a major hospital and I was wearing my Sailor Moon sweater today. I regularly wear nerdy stuff to work. Although I'm not actively doing it now, I'm a cosplayer. My older sibling plays bass, is active in the black/death metal scene, is working towards a degree in social work and interns at a hospice care center. I go to the alternative clubs, dressed alternatively, that my sibling preforms at. There's no age limit for dressing alt. If anything, I make more money to put towards my fashion sense.", "YTA. Just because The Owl House is for kids doesn't mean adults can't watch it", "YTA\n\nHow about instead of imposing your own values and beliefs onto someone else you try staying the fuck in your own lane?\n\nHe’s allowed to have his own interests, hobbies, likes and dislikes just like everyone else on this planet.", "YTA. That was seriously mean. Like, you should really feel a lot of shame kind of mean. I hope you can reread this with a different perspective and see how unnecessarily cruel you were to someone who didn’t deserve that. The world is mean enough, you didn’t need to dog pile.", "Yeah YTA.\n\n With friends like you who needs enemies.", "YTA.\n\nBeing an adult means you get to decide what your life looks like. It means you get to decide what matters to you.\n\nIf he is working, has interests and activities, and helps his family he isn’t a deadbeat.\n\nHe enjoys what he enjoys, and doesn’t just do what everyone else does. I work with high level tech people who have alternative fashions and tattoos. My lawyer friend has rainbow hair and was just made partner. \n\nIf anything you are more immature, for caring so much about what other judgmental people think. For thinking adulthood looks the same for everyone. Like it’s a cookie cutter costume you buy at a beige outlet store. Living as someone who is different in a conservative area is brave. Refusing to change things they like just because other people laugh at them takes guts. \n\nAre you really looking to “help” him? Or were you too much of a coward to hang out with your nerdy friend and risk being judged by others?\n\nAlso Owl House is a cute and fun show so, your loss.", "YTA you sound upright and ableist tbh. He’s just vibing and there are tons of people who’d be better friends that you.  Like I truly can’t believe you wrote this with your whole chest thinking you’re in the right. Sounds like the mindset of someone who had to be married by 23 and will divorce before 30", "YTA\n\nI’m almost 40 and think The Owl House is a great show with a positive message. Don’t be judgy and pretentious. It costs nothing to be kind, especially to someone you consider a friend.", "YTA for not allowing him to feel like himself - I can understand having immaturity with a friendly topic, but if is acting immature during a serious matter, then it could be appropriate to say something, and even then more politely then the way you phrased your words.", "YTA. Your opinion was not asked for. Let people live.", "YTA. Do you even like him?", "“Don't get me wrong, hes a nice guy. He has a job that he works hard at, he helps his parents out around the house (he still lives with them because ofcourse he does🙄)”\n\nYTA for this alone.", "YTA but you did him a favor, just not in the way you think. You obviously look down on him and think you're better than him, your post just oozes a condescending superiority complex. Since that's the case it's better you showed your real thoughts on him so he can find some friends who truly like him for him. And you can move on to find some friends you think are worthy of you or whatever your issue is.", "YTA! And you think that you’re better than him?? Lol I bet you everything I have that you are not….", "Im glad he blocked you on everything like you said he’s smart why would he have a friend that looks down on him YTA", "People have the right to enjoy what they enjoy as long as it doesn't harm anyone. In this case, seems like the most your friend is harming is your ego because he's happy just by being him. \nYTA.", "YTA, it's perfectly acceptable for adults to have hobbies and interests that aren't a mortgage", "YTA. Why aren't people allowed to be who they are? Maybe go talk to the people in their 30s that are like that but don't have a job and don't help their parents out. Your ex friend sounds cool af", "Apologize but don’t ever expect forgiveness, YTA and he deserves better.", "YTA - man I wish I had that enthusiasm about basically anything in life. \n\nWe’re in such a rush to grow up and have people take us seriously - why??? Whhhhyyy??? \n\nIt’s not that exciting having all your crap together and being boring picking out matching plates and crap. Now I wish I could do things like your friend (who is by all means still very young) and I’m worried about people calling me cringy. \n\nAnd the reason I was forced to put aside my childish fun hobbies and interests? I had boring friends who thought we should be sophisticated and accomplished. And you know what? It was boring then and it’s boring now. Be wild, free,  never grow up in your heart and banish people who try to force you into a box.", "YTA and saying no one will take him seriously just isn't true. \n\nYes he'll probably get people staring at him and his life choices and fashion sense is not something I'd chose for myself, but it's his life and if it makes him happy, then who are you to try to guilt him into feeling embarrassed about it\n\nEspecially if you've been friends with him for years and he feels he can open up to you, it must be soul crushing for him to hear his friend, someone he thought he could trust, embarrass him like that\n\nAs an extra the comment about living with is parents just screams entitled. The entire world is struggling at the moment with prices going up, still living with parents when he has a job he works hard at (by your own admission) is nothing to be ashamed of. By the sound of it he's doing his best and probably saving up whilst saving a bit of money by living at home. I really don't see the problem here", "YTA- you know it says more about you than him when you belittle someone who's just living the life that makes them happy. It's apparent that you are not happy so you have to pee in everyone's cheerios. Grow up. Be a better friend because you come off as a hateful wretch.", "Info: When did enjoying music become something only teenagers do?", "Oh no. A person has interests and is involved in a subculture. They definitely won't be able to be a functioning member of society, despite how common it is to be into things and still function.\n\nYou're not a friend, you're a drain on everyone else's energy. Your friend might have interests that you consider childish, but at least *he* doesn't feel the need to trash everyone else's interests. \n\nYTA.", "Oh my sweet Summer child, if you think “edgy Emo teens into “kids shows” as adults” can’t get professional jobs I have some disturbing news for you about the IT industry, the design industry, the film industry and the engineering industry… \n\nHeck, I’m a 40yo goth chick who LOVES The Owl House, is covered in cartoon tattoos and piercings and I’m making well into six figures in Transport logistics and no one there gives a shit. \n\nJust because you only see professionalism as being a dry-ass 9-5 desk jockey office job doesn’t make it the truth for so many other professions. \n\nYTA", "Imagine talking with your friend about something you're excited about and them dropping \"damn why are you such a failure, this why nobody is taking you seriously, grow the fuck up\" on you out of the blue. Yeah, not a good look, is it?\n\nYTA. Big time.", "YTA\n\nCelebrate diversity and stop being so narrow minded.   \nDo you know who Gary Numan is? He's most famous for \"Cars\" but he influenced NIN, who influenced him right back. Gary Numan has been making music since the late 70's and he's now 64- he's a Goth Daddy and he's totally killing it. He looks fabulous and he has the energy and fitness to put on an amazing performance that rivals people 40 years younger than him. The people that go to his shows have a wide range of ages, but many are in their 50's and 60's, and there are a lot of goths in the crowd. It's fantastic.    \nAlso see: Noel Fielding.", "Love that when you said he loved The Owl House, you felt the need to like, explain that by saying he's autistic. Love the implications there, especially with \"I'm not mentally 12\" right after. You're such a cool, open-minded, mature person. Like - wow. So above those childish, losers who watch cartoons and have autism. \\*Wow\\*.\n\nYTA. YOU'RE  embarrassed by him. YOU'RE the one finding him cringy. YOU'RE the one who wouldn't hire him. And YOU'RE the single person on this hellscape of a planet who somehow thinks a 24 year old still living with their parents, especially in THIS economy, is cause to roll your eyes and think less of them. Utterly bizarre. Please say rage-bait.", "YTA and have no idea what you’re talking about. I’m pushing 40 and most of my friends still have an “alternative style” and a good amount of them are doing more than well for themselves.", "YTA I have friends in their ‘30s & ‘40s who are goth. Your friend sounds like my kind of people. I’m not goth, but I get excited about bands and shows like he does.", "YTA. Glad he blocked you, it's weird that you concern yourself with something that doesn't affect you or harm literally anyone. You could've just been a good friend and listened (you could've even gently and kindly changed the subject) but you chose to be mean and combative instead. He doesn't need you in his life and I'm glad he realized that.", "YTA. Adults do whatever the fuck they want, and find their tribe.", "He sounds like one of my brothers. That brother was an engineer at Apple working on iTunes for over 20 years until he died.\n\nHe never stopped wearing black or talking about weird bands that he loved.\n\nHis looks and interest in obscure music got him the job.\n\nI'm not sure if you consider Apple a real world company, but he made a good living and, more importantly, was happy.\n\nYTA", "INFO I would love to know what music you listen to", "YTA\n\nWhat do you mean by of course he does when living by with his parents? Using 🙄\n\nLet him be who he wants to be! Let him wear what he wants to wear! Simple as that. \n\nI wouldn’t want a friend like you and honestly good for him blocking you.", "YTA. Friends don't look down on each other and certainly don't talk to each other the way you did to him. He deserves better than you.", "If this is real, YTA. You're very judgemental about things that aren't your business.", "YTA and a seriously terrible friend.\n\nLet’s set the fact he’s Autistic aside for a minute and just focus on the fact you’re being unsupportive and judgement in general. It sounds like the one that should be embarrassed is you. Judging someone by how they look, dress, or are interested in is shallow and childish. You say you know this person well, then why are you narrowing down their personality to appearance. \n\nLet’s bring back the fact they’re Autistic. DO YOU KNOW HOW HARD IT IS TO BE OPEN? As someone on the spectrum it can be immensely difficult to open up and have conversations with people because you fear you’re dumb, stupid, oversharing, or boring them. This person felt comfortable enough to be themselves around you and you ruined it. That in itself is absolutely heartbreaking. Our brains don’t work in an ABC123 pattern. He will now constantly second guess sharing his interest with you, or even others. What you broke won’t be repaired, even if he unblocked you and opens back up, he will forever second guess sharing with you. \n\nAll of that is worth it just because you think his appearance is immature? My husband wears Star Wars graphic tees and is the biggest nerd, some might call that immature, but he’s a successful adult. He’ll talk to me for hours about the next video game coming out, and while I’m not necessarily interested, I listen, because it makes him so happy to talk about. Because having a friend, or partner, means accepting them for them. Interests and appearance included.", "YTA ; There's no need to look down on him for being different, alternative, and unashamedly enjoying the things he does. Also, inflation and the housing market is shit right now and idk about you but even the shittiest apartments are almost impossible to afford as a single person, so it's pretty unfair to look down on him for living with his parents. You said he's a hard worker and he's incredibly smart, he may need some more time but he can figure it out. And if not, there's plenty of people who are plenty happy living with their parents if theyre understanding and loving enough... Stop acting like just because you're no longer in your teens you're now an authority on \"adulthood\" and try to tear the people that you're supposed to uplift and love down to what you think is appropriate.", "YTA. \nThe dude enjoys things. Anybody that focuses on the superficial probably won't take him seriously. But those people don't really matter, kinda like you.", "Do him a favor and ghost him.  He doesn’t need “friends” like you.", "YTA. Hes a functioning adult and has stuff he likes. Just because you dont like them doesnt mean hes less than. Living at home at at 24 is NORMAL. Not everyone has to leave at 18. He has his own style and things that makes him happy and confident. Take your insecurities somewhere else dude", "You weren't his best friend. He's better off without you, and I don't mean that as a dig but as an objective truth. You do not support who he is or who he will always be. YTA.", "YTA. As a punk rock emo kid…I’m still a punk rock emo kid at 34. Your idea of adult isn’t everyone’s idea of how an adult should be. Normal is boring, conforming sucks. I doubt he’s embarrassed, he’s just realizing your not a good enough friend to keep in touch with. And seriously with rent prices/house prices I don’t blame him for living with his parents. I finally moved out for good at 26, shits expensive and high school doesn’t teach credit and budgeting. Most people fail a few times before finally getting it right.", "Holy shit are YTA. Just because \"Emo\" was a phase for you doesn't mean it is for everyone. For some, THAT'S WHO THEY ARE. Nice way to shit on your friend.", "Not only are YTA your judgmental and rude.", "YTA. It doesn’t even matter that he’s autistic. Don’t yuck someone else’s yum.", "YTA. You clearly don't like your 'friend' and you really didn't need to make it his problem or be mean, sheesh. Just back off and leave him alone. Nobody asked your opinion and it's a mean-spirited one.", "YTA \n\n“And I still don't have the right look\nAnd I still have the same three friends\nAnd I'm pretty much the same as I was back then\nHigh school never ends!”\n\n-bowling for soup, high school never ends\n\nHe is who he is and he’s comfortable with that, I’d say he’s probably a lot further in police than most people. Most of us lose who we are and what we want to be with age because of the opinions of people like you. I only hope your ex best friend doesn’t take what you said to heart, because he’ll be a far better person and go a lot further in life if he remains true to himself and continues to hold what he loves dear to him.", "YTA. It sounds like your friend knows what he likes, and isn't ashamed of it. Is it possible that you actually feel jealous of him?\n\nAs for the rest... I'm heavily alt as well, and am currently having a lot of success in the childcare industry despite visible facial and cartilage piercings. Living with your parents as a young adult, especially with housing the prices they are today, is a good financial decision if there's no rush to get away from them or burden on your parents for you staying there.\n\nThirdly... Even if he was into kid's shows, there's no big deal, but I've also watched a bit of the Owl House, and it goes into some serious topics, such as different forms of abuse and manipulation. Not exactly \"childish\", I'd say.\n\nHe sounds like a cool dude to hang out with. Why do you need to go and cramp his style? Glad he recognized he didn't need that kind of judgement in his life.", "YTA\n\n YOUR tastes are not the centre of the universe. So  glad he blocked you. Now you can be happy with your adult taste and adult activities and your independent living. \n\nHe doesn't have to be attractive to you, not suit your tastes. You sound so full of yourself. Hope you get a grip and learn how to see beyond yourself. \n\nImagine someone living at home with his parents, probably sharing a nice healthy relationship with them offends you!! So laughable. You truly sound like a kid trying to say all the cool things you'll do as an adult without actually experiencing it. Really hope you learn something from this.", "No one appointed you the arbiter of presentability.\n\n&#x200B;\n\nWhether or not his attitude/perspective on life will help or hinder him, that isn't for you to decide for his future employers. Your job as a friend is to help and support, not point out any and all potential details that could maybe possibly cause some issue somewhere down the line. \n\n&#x200B;\n\nAnd even if it were all true (it's not) then how on earth is raining shit on his band constructive, in any universe? How is derision and condescension what you thought would be considered *help?*\n\n&#x200B;\n\nYTA and one of you does need to grow up. And it ain't the one who you thought.", "YTA- hi, it’s me- the nearly 40 year old emo/goth. With my successful 20 year career.. I dunno about no one taking me seriously 😒 \nSeriously though, you don’t deserve your friend. You’re the one who needs to grow up.", "YTA. Open Tiktok, you’re so outdated.", "YTA. Who are you to tell someone how to live their life?", "Hahaha, fuck your option. Where do you think all the money that supports fandom comes from? Grown ass adults with grown ass jobs. Where do you think the money to support comic cons comes from? Grown ass adults with grown ass jobs. Where do you think the money to support artists comes from? Grown ass adults with grown ass jobs. \n\nDon’t yuck someone’s yum just because you’re bitter, miserable, and forgot what fun or joy was when you sold your soul to a billionaire. Of course YTA. \n\nAlso, Owl House is fucking great! \n\nSincerely, a middle aged nerd", "Yta.  The world is full of a lot of people, with a lot of different personalities.  Just let him be himself, and stfu.", "YTA You had concerns, fine, but you should have brought them up in a *mature* fashion. For someone who is worried about another person's maturity level, you're showing some seriously bad decision making.  I'm autistic.  We have passions, and we often act younger than our ages because of it.  You were his friend, you were supposed to be *safe*, unlike 70-98% of other people (depending on how social he is) who, trust you me, find ways to tell us every single day that we're wrong in some way.  He thought you accepted him for who he was, but you showed very clearly that you did not.  What could have been a sincere and caring conversation instead looks like it may be the end of your friendship.  Do you know how hard it is for autistic people to make and maintain friends?  He's likely heartbroken and blaming himself, just for being who he is.  Seriously OP, I am so disappointed in you.", "YTA. Of course you are. Where’s the norm of what the real world is? Are you the ruler and we weren’t informed? Your ex friend should be glad you had that call. His world is better without you.", "YTA very judgmental and a terrible friend", "YTA", "YTA. Why should he be embarrassed? He’s true to himself. He likes what he likes and being emo or goth is pretty popular. It’s not like he’s the only one. You sound really uptight and judgey.", "YTA. If I could afford to dress in the alt/goth/emo kid clothes I had in highschool, I would. They're fun, they're things I enjoy. Emo/punk/metal music is awesome. It's his aesthetic, it makes him happy. Youre acting like the bully all the alt kids growing up hated. Just because you don't like it doesn't mean he has to stop liking it.", "YTA, goth/alt is super \"in\" right now for all ages. I'm 21 and dress that way and have a job and go to college and am plenty respected, thank you very much.", "YTA Don’t yuck his yum, sounds like he has a job and helps his folks; what’s the problem here?", "YTA\n\nIf you're both 24, the world isn't taking either of you seriously.", "YTA and a bad friend. It sounds like you really look down on him and have a very scornful attitude towards him. He’s better off finding people who will support his interests.", "Be civil. Be civil. Be civil. Be civil. You are the worst YTA", "YTA. You were a safe space for him to express his excitement to, and now you will be the reason he hesitates before sharing with anyone else.", "YTA, don’t try to embarrass the man because of what he does, it’s his choice", "YTA and kinda mean.", "YTA.  Yikes.  Poor guy if his best friend treats him that way.  It reminds me of the meme where some lady was married to a guy who made fun of her coffee cup collection and when she divorced him, her next boyfriend made her shelves to display them.", "YTA. I’m two decades older than you, OP, and have slightly more experience in the adult world. There’s a whole world out here that allows people to just be people. Stop pretending to try to be an adult and just let people be themselves.", "YTA… lol you know how old MCR is right? A lot of their fans are the same age. My husband wears mostly all black and has tattoos and gages and snakebite lip rings lol. We own our home and he makes damn good money as a shipping manager. \nProfessional isn’t one look.", "YTA and extremely judgmental. You aren’t his mom so stop trying to be. If he wants help or advice he’ll ask you but don’t force it on him. \n\nAlso, MCR is awesome. I’ll hang out with your friend since he’s apparently embarrassing you.", "YTA. OP rules have changed a lot. I work in an office full of people making 6 figures salaries. One has tattoos, full arm sleeves. My other co-worker has magenta hair. Another is full on pin up girl all the time, she has a popular instagram account as a side hustle. We’re not a tech firm or creative. It’s a defense contracting company. Those firms were once the most conservative, but reality is they had to relax their rules or they wouldn’t be able to recruit people they needed. He’s not harming anyone. So stop trying to impose your personal viewpoint on him.", "YTA. And you’re an awful friend and you sound insufferable", "YTA. \n\nJust say you want to be a boring adult and feel like shit about not having any interests and go. Like seriously get a fucking grip.", "YTA. You're bullying someone you call a friend because you don't understand his interests and disapprove that he's not been so completely beaten down by \"professional\" culture that he's dead inside and bullying others for keeping their identity.\n\n\"Acting like an adult\" is some of the stupidest shit to ever come from anyone's mouth. As an adult, we mostly have no clue wtf we're doing, and those of us that have some identity outside of work, work culture, and deepthroating the bosses boot are *worlds* happier, objectively, than our \"professional\" peers. \n\nI say that as someone with a very professional laboratory job, I attend research conferences, the whole song and dance. Without *any* reservation, I can say the people obsessed with professionalism are always spotted from a mile because they're *miserable* people who have the emotional range of a turnip and are, somehow, less interesting than one.", "YTA. you sound boring, meanspirited, and like a total killjoy. he deserves better friends, and maybe it’s for the best that he blocked you; i honestly don’t quite understand why you’ve continued to hang out with him if you judge him so harshly for hobbies and his way of self-expression that’s ultimately harmless and inconsequential.\n\nthis post particularly stuck out to me as an autistic person.  not only does it feel so unnecessarily and almost comically cruel of you to treat him the way you have and speak about him in this post, but my god man, have a heart.\n\ngrowing up is realizing that adults can do whatever the hell they want and recognizing what’s important to you. it’s learning what finds you joy and where you want to spend your time. he’s clearly fulfilled that, i’m not sure if you’ve done that yet, as you sound bitter and kind of boring.", "YTA. Wow. With friends like you, who needs enemies?", "YTA Me and all my friends who are currently 21 all love goth fashion, watch cartoons and listen to weird music. You can enjoy these at any age", "The Owl House is a banger. 21 yr old here", "I hope this isn’t real, because YTA. What kind of person berates their friend like that? \n\nYou’re very judgmental about things that literally don’t matter, let him listen to whatever band and be excited about it - at least he finds joy in things unlike you. I hope he finds some likeminded friends (they are out there, adults don’t just stop having fun like you seem to believe). \n\nIf you want to put yourself in a little “adult” box where you can’t enjoy things because of the rules you’re applying, go for it but don’t expect other people to do the same thing.", "The message maybe wasn't a bad one. The delivery was YTA. That's not how you help a friend.  Apologize.", "YTA. \n\nThat was cruel. It sounds like your friend knows who he is and is comfortable with himself. It’s too bad you’re so insecure.", "YTA. This is so very judgmental, let your friends enjoy things. For the record, I am 31 and still very much in touch with my emo side and taken seriously in the “real world” or whatever. Just let people have fun.", "YTA. You know what’s not mature? Being mean to a supposed friend when they are talking about something they love. Grow up, dude.", "YTA. Nobody should take you seriously.", "YTA. dude you're fucking insufferable. I hope your friend realizes what a waste of time you are and finds someone who isn't mentally a 12 year old participating in cringe culture and incapable of understanding that people are allowed to have interests and personalities that you think are \"cringe\". sounds like you're a terrible friend and have been for many years", "Yta let him live his life n u live yours but I don’t see how your life is better than his. You hurt his feelings for no reason", "I'm in my mid 30s and I wear cat ears every day.  No one blinks an eye, unless its to compliment them.  I still watch anime and obsess over all kinds of shows.  Just admit you're an ass who shamed your friend for liking things.  I'm really glad he blocked you, he doesn't need an immature child who complains about things being 'cringe' in his life.", "YTA. It’s not his fault you’re boring with zero passions. Be nicer.", "Did you actually call him your “best friend”? Then totally disparage pretty much everything about him? If you are embarrassed by him that is on you, don’t try and pretend you said those things to help him. YTA", "YTA\nWith friends like you who needs enemies.", "Yup, YTA. \n\nFor a so-called \"best friend,\" you're very dismissive and cruel about the things that he loves! \n\nIf anything, your whole \"too cool for school, omg it's *soooo laaaaame* to be excited or actually *like* things\" might come off as more \"high school\" and immature sounding. \n\nIf this were a situation where your friend is trying to get some kind of conservative office job and kept getting rejected because he showed up in a band tee and spent the whole interview talking about his hobbies -- and he asked you for advice on why his job search wasn't going well -- then it would make sense for you to say something like \"well, Friend, maybe you'd have more luck if you wear a suit and talk more about your work history instead of the Owl House.\" \n\nBut that's not at all the case here, you basically told him \"you're dumb and the things that you like are dumb\" so it's no wonder he's blocked you. (I know you're sitting there saying \"But that's not what I said! That's not what I meant!\" .... Yes OP, yes it is.) \n\nYou owe your friend a BIG, sincere apology here OP. And maybe try watching some Owl House, it's a great show!", "YTA. You were not trying to help him. So what, he has interests that aren’t “adult enough to you”. Plenty of adults watch “kid’s shows”. You said it yourself, he’s intellegent, hardworking, and helps his parents around the house. Don’t think we missed your derogatory comment about him living at home. In this housing market, living at home if your parents are happy to have you is a smart idea. \n\nInstead, you tried to bully him into fitting your idea of what an adult should be. Why did you make it your personal responsibility to tell him how cringy he was? Guess what, you’re both mid 20s and he has a job. That means he’s IN the real world and he’s still the way he is. You, however, seem to be still stuck in high school bullying the goth kids.", "Clearly your friend is more mature than you think because he knew to just block you and move on rather than to engage with an AH. \n\nYTA - also living with your parents at 24 is extremely common and honestly smart to save up. And being excited about a band shows that you’re a fun person. I’d rather be friends with him any day than you.", "YTA. He's gotten along just fine dressing, behaving, and expressing his interests. Who are you to say anything about the \"real world\" when you've barely experienced it yourself. Stop judging someone for being their authentic self. He should drop you as a friend.", "YTA. You clearly also don't know snakes from dildos about the \"real world\" .", " You’re a tone deaf asshole clearly. Nice job on being a friend", "as a fellow autistic person, i sincerely hope you get an oddly specific case of flesh-eating bacteria in your genitals for xmas. and i'm being nice here because someone with the wits & personality of week-old roadkill is not worth getting banned over.\n\nYTA", "OP, i listen to those very same bands. i attend concerts. music is quite literally a thing i have playing almost constantly. \n\nscooby doo is also my favorite show of all time. \n\ni am 22. \n\njust because someone has interests that aren’t ‘adult’ ‘professional’ does not mean they’re childish. how about YOU grow up and find a hobby instead of tearing apart everything that makes up your friend", "GOD what an asshole. The guy was trying to share something with his best friend, something he was excited about, and you shit all over him for no reason except for some weird sense of superiority. What the fuck have you done with your life that’s so special? Are you married? Do you own your own home? You certainly don’t have a best friend anymore, so what have you done? Grow up. You’re 24 and it’s high time you realize you are NOT the person who gets to decide what other people enjoy. Go do something with your life. \n\nYTA.", "OP, YTA. And you could learn from some of these \"kids shows\". To quote Steven Universe, \n\" You know, if you just let everyone be whoever they are, maybe you could let yourself be whoever you are too.\"\nGirl, you're a year older than me. You're too old to be taking your insecurities out on other people. It's really immature. Leave it in high school, please. Life is too short to not enjoy things.", "I think you need to apologize. Clearly you have outgrown the “friendship”. People change, no big deal. Also, please step down from your high horse. The only one that should be embarrassed here is you op! When you criticize and judge someone for being themselves, that makes you TAH, big time. Not to mention, him being autistic is irrelevant to everything you said in this post. \n\nSide note- I’m 29 years young and still listen to mcr, and so do my children 🤘🏻", "YTA\nAs someone with autism, you need to be careful with how you say this things. And you in this case did AN AWFUL JOB. \nDo you care about him at all? \nDo you search about autistic behavior? \nIt seems that no, you haven’t.\n\nIF MY BEST FRIEND told me that, OF COURSE I’LL BE MAD. \n\nI am 22 and still watch a lot of Disney movies, a lot of Disney series AND THE OWL HOUSE IS NOT THAT BAD, BUT YOU ARE THE ONLY ONE WHO CARES!!! My own friends watch with me those movies because they know that I can be childish as well as I can be pretty mature for other things. \n\nThere are a lot of Disney Adults, and I am sure that there are plenty of emo adults too. You do not need to be autistic to understand him, you just CHOSE not to. \n\nIf you don’t want him in your life, that’s okay, but you don’t have to be cruel.", "YTA\n\nAnd you're ableist as fuck.\n\nYou live your cookie cutter life, always doing what other people have told you.\n\nLet him be him, and support him, or get out of his life.\n\nOh, I'm so pissed at you!  Who do you think you are?", "YTA\n\nI’m 28 and still dress like a punk, still love MCR, and The Owl House is an amazing wholesome show. I also get taken seriously in my professional life. \n\nYour friend will find his place in the world where he is appreciated for who he is, no box needed.", "YTA. He literally did not ask for your opinion.", "YTA\nYou failed to explain how any of his behaviors/styles had anything to do with you.", "YTA and you know it. The dude is passionate about shit. Why is that a problem and why are you belittling him? Proud of him for blocking someone who’s judgmental and unsupportive.", "YTA...he AUTISTIC of course he will be \"acting younger\" even though the way you describe your friend is extremely Ableist. My partner has autism and sometimes acts immature and the world takes them seriously. So who are you to say what you did. You are the one that needs to grow up  and maybe your friend will stay away from your toxic behavior.", "Because you’re not, like, mentally 12…. More like mean 13. Sheez….. with friends like this, who needs enemies… YTA.", "YTA so much. “Best friend” my ass.", "Hey there! I dress on a rotation of goth, pirate, or wannabe 80s rockstar - sometimes a combo of all 3! I’m a big fandom person because it’s nice to meet people who love something as much as you! People still take me seriously and I’ve had a fulfilling life. Admit you’re envious of not having passions like your friend. \n\nYTA.\n\nAnd Sidenote: who gives a shit if he lives with his parents? People do what they have to and some families like being around each other.", "Huge YTA YTA YTA YTA YTA", "YTA. I didn't need to read the post to know that\n Your username gave it away, and reading the post simply confirmed it.\nYour friend deserves better than whatever it is you think you have offered in terms of being a real friend.", "Yta he’s not hurting anyone, he has passion.  But you can do permanent damage to him if you continue to treat him that way. He deserves better can I be his friend? I’m 30 dress goth adjacent (stupid work dress codes) listen to heavy metal and get stupidly excited about my interests.", "YTA YTA YTA YTA YTA YTA. Stop raining on his black parade because you’re jealous you can’t find happiness in things like music and shows like you used to. You miserable f**k", "Wow, YTA.\n\nNot everyone decides to become a boring arsehole when they grow up.", "YTA.\nI have blue hair, wear fishnet stockings/short skirts/hail satan shit/crop tops/etc. I am a big titty goth girl. \nI am (27F) and make over $100,000 annually as a market analyst. \nYou are factually incorrect and a shitty friend.", "I can’t help but laugh. My best friend in middle school was very similar to this (besides being autistic) and now we are married. We never dated in middle school or high high school. We actually were in totally different “crowds” but in college we ran into one another again and it was basically love at first second sight lol. \n    I’m not asking you to date him or anything but at the same time I am telling you when you have known someone for so long it’s easy to forget the silly isms they have done. Look past the Ninja Turtles and look beyond.", "YTA. From what I've read, I'm pretty sure you're NOT his friend. I'd definitely hate to be your friend if that's how you treat people.", "YTA you sound like a jerk who couldn’t understand how someone could have a interesting, non main stream hobby. He might be living with his parents for many reasons- saving for a house, unadorned housing in his area, needing help because of his autism, assisting his parent, or he prefers not to live alone.", "I have so MUCH I could say but YTA", "I mean this completely genuinely: you sound less mature than your friend. \n\nNeeding to perform “maturity” by hiding your interests and assimilating to the mainstream culture around you is not a sign of adulthood, it’s a sign of teenage-hood. As you get older, you become more comfortable with who you are and the fact that not everyone will like or relate to you, and you also become okay with this. Not everyone needs to like you, bc you’re secure in who you are.\n\nThe idea that certain hobbies are only for children, certain interests are only for children, is usually one that middle schoolers and high schoolers have when they are trying to prove that they’re no longer kids.\n\nYou’re also a bad friend, and not just in the obvious way of being unsupportive and cruel. As someone’s friend, you should be their safe space to talk about things that excite them, their experiences, whatever it is, without worrying about embarrassment or judgment. And beyond that he’s autistic, he felt comfortable enough around you to be himself and not mask or perform socially, and all you did was tell him he should have been hiding himself instead. *You* were the one who broke social convention here, not your friend. You’ve told them that all of that trust they thought your friendship had was a lie and that you don’t respect him. \n\nI’d be horribly embarrassed if I were you\n\nYTA\n\n\nEdited to add: Also, for the record, living with your parents at 24 is a perfectly reasonable thing to do. It’s the norm in many cultures, there’s a housing crisis right now (in the US at least), and it’s a great way to save money. That’s a ridiculous and arbitrary way to judge his adulthood.", "You lost the case at \"he has a job he works hard at.\" YTA", "YTA just because his life wouldn’t make you happy doesn’t mean it doesn’t make him happy. He didn’t even ask you for advice. Like the saying goes, “with friends like you, who needs enemies?”", "Fuck you.", "NTA. I can tell you  bc are for your friend and want what’s best for him. And you’re right - at some point you do have to grow up…even just a little. \n\nObviously no one will agree with me on this, but oh well. Lol.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my(24F) best friend since middle school (24M)is MAJORLY into goth/alternative stuff and has been since he was very young. He dresses in all black, mainly listens to edgy metal/emo music (MCR is especially his favorite) and he talks about these things a lot. He is also heavily involved in fandom culture and he has a tendency to hyperfixate on kids shows his current fixation being some show called \"The Owl House\"(Hes autistic btw)Now i'll admit that when I first met him, my kid mind thought he was the coolest dude but since im not y'know, mentally 12, I can't help but find his behavior cringy now. We're both about to be in our mid 20s and he still dresses and acts like an edgy teenager. Just the other day I was talking to him on the phone and he started to excitedly talk about some band he started listening to and I said \"Dude do you not feel even a LITTLE embarassed?\" And he asked what I meant so I told him that nobody in the real world would take him seriously because he looks and acts like a teenager and that it was time to actually start acting like an adult. He went quiet after that and he hung up on me and ended up blocking me on pretty much all social media.\n\n\nDon't get me wrong, hes a nice guy. He has a job that he works hard at, he helps his parents out around the house (he still lives with them because ofcourse he does🙄) and hes a really smart person. He was always one of the best students in our grade. I just think that if he grew up a little he would get very far in life and I figured I needed to be the one to motivate him to do that being his best friend. Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. I bet you think a \"real\" job is nose to the grindstone 60+ hours a week in the hopes that your boss might one day recognize your efforts. You probably vote republican and think anyone that doesn't wear a suit to work, pomades their hair, and sucks up to everyone is a failure.\n\nYour \"friend\" deserves sooooo much better than you and I am glad, FOR HIM, that you showed your true colors. He sounds like a cool dude who is comfortable with himself and is making his way in the world in a way that brings him joy. Maybe you should take a lesson from him instead of being a judgemental asshat.", "YTA. You don’t sound like a friend.", "YTA\nYour friend has a job, helps his parents (and presumably has a positive relationship with them) and has some interests you find immature.\nI'm 41, about to move in with my parents, love cartoons and middle grade books and star wars and star trek. And have a solid career. By your standards, I must also be immature.\nI've found my people. \nHopefully your finds his people, which you have clearly demonstrated you are not.\nI applaud your friend for cutting you out. That takes serious guts and makes me think he might have been questioning your sincerity and compatibility as a friend.", "Get over yourself. I'm in my thirties and the Owl House is great! He sounds pretty damn cool to me. Do him a favour and stay out of his life.\n\n>he still lives with them because ofcourse he does🙄\n\nWho needs your judgmental toxicity in their life, when they could instead enjoy things/aesthetics/fandoms they love? Check yourself.\n\nETA YTA, big time.", "YTA. Let people enjoy things.", "YTA If anyone is cringy here it’s you and your judgemental attitude.", "I live at home and I am 35. YTA, I hope he finds friends who appreciate him as he is, and I hope you do some self reflecting because you sound very nasty.", "You’re a horrible friend omg", "YTA. Even thought The Owl House is a kids tv show it has some dark moment. I mean the 95% of the show takes place on A CORPSE FOR CHRIST SAKE!", "He’s comfortable being himself, a lot of people admire that and often wish they were that confident. He sounds awesome. \n\nHe didn’t ask for your advice and it clearly wasn’t welcome nor was it necessary. You were an AH for no reason.\n\nYTA.", "Dude, I’m in my 40’s and have always been a somewhat ‘quirky’ dresser. It doesn’t stop me from being a decent person. As you say, your friend sounds like a really great guy, plus he has a job he works hard at and helps his parents. What the hell is wrong with you to dictate how he has to be?! If he’s happy and involved with his hobbies, what harm is he doing? He’s clearly able to exist in the ‘real world’ so keep your narrow mind to yourself. YTA if it wasn’t clear already!", "YTA, good for him he blocked your ass. He’s doing perfectly fine as is and sounds like he’s happy so what’s the issue? Let him be and stop being so bitter. Life is a lot better if you love without worrying about something as stupid as being “cringe”.", "Yta because of course you are 🙄", "I feel bad for him because this was probably a pretty big hit to his self esteem. There are plenty of adult goths out there. Just because you want to conform to something that fits a common mold doesn’t mean everyone should have to. And early 20s is not an embarrassing age to be living at home in this economy. Are you aware of the current average cost of rent? I have one of those professional jobs you think your friend should be striving for, and I live in a rural PA town, and I couldn’t afford our rent on my own. It’s not exactly a cake walk out there right now. \n\nYou’re the one who should be embarrassed. YTA", "Excuse me?\n\n> he still lives with them because ofcourse he does🙄\n\nWhat do you mean by this? What's wrong with that? He helps his parents out. He works. Saving money in the mean time. He doesn't need your judgment. He's enjoying himself isn't he? He's happy with the things he likes?\n\nMind your buisness. He is in the real world already. I see grown adults still gush over new things that they find awesome like new bands and new hobbies. \n\n> Just the other day I was talking to him on the phone and he started to excitedly talk about some band he started listening to and I said \"Dude do you not feel even a LITTLE embarassed?\"\n\nIt's so awesome he can still get excited about new things he finds!\n\nIt is fine if his style isn't your style. If his taste don't match yours. But it doesn't make your hobbies and more \"grown\" than his. \n\nHe trusted you with this side of his that could GET happy about these things. And you shut him down for it.\n\nYTA\n\nI hope he can find another person to be that vulnerable with again who won't judge him for being him", "So he started telling you about a band he likes and you asked if he's *embarrassed?* About what? Listening to music? What do *you* listen to, crackling fireplace remixes?\n\nAlso, so what if he still lives at home? He's 24, he's saving money. He's helping his parents out. Is he not allowed to *enjoy* things? You sound like someone who thinks people over thirty have no hobbies or life. YTA. He doesn't need your brand of *friendship*.\n\n(btw I'm 31 and Owl House is amazing. Take your own advice and grow up)", "There are no words to express how much of an AH you are. I had a “best friend” like you once and comments like that about my interests *crushed* me. She was never really my best friend because best friends don’t do shit like that. You’re not a best friends you’re a bully disguised as a friend. YTA", "YTA.  Are you being his best friend?", "YTA You sounds like a 12 year old explaining what they think adults are supposed to be like. Or a boomer.", "i have an autistic son and i always worry he will have friends like you. people who don’t accept him or put down his interests. i’m a 23 year old female and you sound dumb and like you’re the immature one. i have plenty of friends that listen to music i stopped listening to 😂 it literally doesn’t affect me whatsoever, i don’t care what they listen to. i’ve listened to taylor swift since i was 12 years old. does that make me any less of a mom, or an adult? You need to re-evaluate yourself and how you treat your friends. this is embarrassing for you girly you should be ashamed", "You're not his friend.\n\nI am the mom of autistic kids.  I used to worry about like... When they would hyperfixate on stuff seemingly out of their age range.\n\nBut... So do I? \n\nI like anime and kid shows.  I like Legos (used to put little sets together while on calls at work).  Some of my best times have been playing games or watching said shows with my kids.\n\nI couldn't care less anymore.  My kids are HAPPY.\n\nAnd if they had someone in their life belittling them for their preferences, for who they were I would be SO angry... And talk to them about how they feel about how their supposed friend talks to them.  Maybe show them they deserve better.\n\nAlso, for the record I'm in my 40s, have a black bleeding to peacock green hair coloring with high shaved sides.  I'm taken seriously.\n\nLittle jerks like you aren't at my age.  \n\nYTA", "Dude, do you not feel a little embarrassed for obsessing over what other people think about your friend?\n\nHe works hard, passionately pursues his hobbies, and lives as his authentic self. That dude is going to go further as an adult who thinks maturity has more to do with how you dress than how you conduct yourself. And the best part: He is going to have a blast while doing it.\n\nOne of my direct reports complained to me recently about how she was passed over for a promotion for another employee, and her case was “I show up looking professional every day while he sits around in the same 5 polo shirts with a hoodie on top, looking like a slob, leaders don’t act like that.”\n\nWhat she didn’t realize is that he brought in about twice the revenue she did the past year and doesn’t require the hand holding that she does. You remind me a lot of her.\n\nYTA", "You're all sorts of judgemental aren't you? YTA", "YTA.\nHe's a really nice guy who has a job and helps his parents, and you decide to humiliate and degrade him when he calls you to share his love of music with you. You're a snob. And you just lost a friend. He, however, dropped some toxic weight. All the best to him.", "YTA. People who try to take someone down a peg when they’re talking about something they’re excited about are the WORST. You sound very unhappy and you should probably focus inward instead of judging other people. \n\nHow did you type this out and still decide to post it?", "YTA. As a person who has odd interests, he deserves better. I had a friend that tried to 'fix' me, and what I like. All that came of it was years of toxicity and shame. He isn't hurting anyone, and majority of people only really care about that fact. Does he dress outside of status quo? Yes. But as his friend, you should be excited for him to be happy. I can talk about my characters, and explain some niche internet topics, but I am taken seriously in my job. People like talking to me, even when I go on tangents about how computers work or about how China's economy is failing. In the real world, people are a lot more tolerant than you think.", "I get the vibe that you find your friend’s confidence and comfort in himself may be triggering because I suspect your self-consciousness may be high.  \n\nYTA.  I’m afraid you are in a glass house throwing the stone of immaturity at your friend.  Grow up.", "Yta. Okay what's your personality then? Do you even like anything?", "It’s clear you two have grown apart and no longer should be friends.\n\nAccept that and move on. You don’t try and force someone in an image you think is ideal", "OP sounds like you're mega jealous of this guy for being his true self and being happy. \n\nWhat happened to you in these 10 years for you to be so bitter? Stuck in a unhappy relationship? Tied down to a dead end job?", "YTA My take of this is that it seems like over time, you both developed different personalities that eventually, over time, drifted apart due to lack of common interests. That's normal and actually happens probably with 99% of someone's high school friends. Most of those separations happen mutually and gradually with time, except it sounds like your friend was blindsided by you being needlessly cruel to him. I've had a friend who likes ICP and Slipknot, etc since high school. I listen to George Strait, country always have. He joined the Army, got out, has a regular civilian job now but still wears the same stuff he used to, listens to the same stuff too, except now he drives a hearse as his cruising car. We're still friends and even if I don't understand exactly why he likes the things he likes, I never tried to make him feel bad about it or try to change. If he did, he wouldn't be the same person that I was friends with. If you didn't want to still be friends with him, you could have intentionally drifted apart  gently bc you have different interests now and lives. Instead, you chose to ridicule him. That's not something a friend does to another friend. He deserves better", "YTA. So you criticize your friend because he doesn’t like “mainstream” stuff.", "Eewww YTA. I hope he finds a better friend because you’re not it.", "YTA and a pretty bad friend. I know you have a whole 24 years of life experience but I’ll clue you in on a little secret, the world is full of adults that act like your friend. Adults are into all sorts of things, they are called hobbies or interests, sometimes grownups even find other grownups that share those same interests and become friends. What I find immature is a person belittling a “friend” for incredibly superficial reasons.\n\nI think it’s great that your friend is secure enough to be himself. Maybe you should give it a try instead of criticizing them.", "yta and a giant fuck you from someone aka me who is autistic and has similar interests as him and has found a long term partner.", "YTA. He needs better friends.", "YTA and a terrible friend. And probably picking him apart for having the confidence to be himself because you’re insecure in yourself.", "Yta, don’t need enemies with a friend like you.", "Wow major YTA\n\nYour best friend needs a new best friend that's not you.", "Sure sounds like you are TA.", "YTA you obviously have an issue with your friends nuerodivergence. Go be boring and miserable far away from him and think about why you feel comfortable shitting all over your friend.", "YTA. Why do you get to decide what an adult should act and dress like? I mean, he is an adult. So anyway he acts is technically acting like an adult. Just because you have a picture in your head of what is “normal” doesn’t mean it’s accurate. You’re holding him to imaginary expectations that don’t really exist. Maybe you should stop worrying about him needing to fit in a certain mold and start trying to be a better friend.", "YTA. Dude, you're not acting like a friend in any way, shape or form. He's better off without you in his life; growing up does not equal \"crush everything about yourself and be miserable\".", "Yta and really educate yourself on ASD. You shat on his special subject dude, so what if he lives at home change is difficult especially on the spectrum, self care and at home tasks can be impossible some days. He has support where he is, he can choose to move if or when he's ready.", "With friends like you, who needs enemies? \nYTA", "The kids show thing is kinda creepy, but everything else I don't get the issue? YTA", "YTA, I'm in my mid 30s Love watching the owl house and various other \"childrens media\" will happily talk your ear off about whatever interest happens to have caught my fancy and so far haven't had any issues about people not taking me seriously just because of my interests.", "YTA. Also, umm it’s wrong to be excited about finding a new band to listen to? Hell I am in my late 30’s and still talk about new music. Your friend has a job, yes he may still live at home, but he’s only 24 and rent is expensive, maybe he’s saving up to move, so there’s nothing wrong with that.", "Who needs enemies with friends like you? YTA", "Is he your best friend, tho? Because it sounds like you hate him. YTA.", "I can't believe you are actually wondering if yta or not. You are. What he likes has nothing to do with you. I'm glad he blocked you and hope he doesn't bring you back into his life.", "YTA for how you talk about your “best friend”. \n\nAnd also because I’m in my 30s and I’m goth and still dress like I am. I get many compliments when I go out, people will still interact normally with me and I’m the second highest paid employee at my job. A good friend of mine and my husband is also VERY goth. He owns his own business and is highly praised around town for it (automobile restoration and customs). As far as I’m aware nobody has ever dismissed him either based on his aesthetic.\n So I’d say your point about the world not taking him seriously is probably incorrect.", "It was never a phase, it's a lifestyle. 😤\n\nPeople are allowed to like things. That includes things meant for \"kids\". I'm a 30 year old woman who loves Pokemon, comic books, video games l, and metal/emo bands AND I have a successful job and own a house. \n\nI know that's shocking to you, but it is possible to have alternative styles and interests and still be a successful adult.\n\nAnd also, most people live with their parents these days. It's not a mark of shame or a sign of failure.\n\nGet over yourself. Be a better friend. YTA", "YTA and as someone who works in tech, surrounded by goths, punks, nerds, and geeks of all ages and kinds who are well respected and make well into the six figures… You’re 1000% wrong that people won’t take him seriously.", "YTA, you sound like a horrible insensitive person. His life will be much better without you in it.", "You're the one that should be embarrassed of yourself. He is unapologetically himself and happy. He is kind and helps others and works hard by your own post.\n\nYou are unhappy with yourself to the point you're belittling someone you wrongly call friend you are not his friend. You're a bully.\n\nYta", "YTA", "YTA. You fighting in the comments really proves how wrong you are. If he doesn’t align with your life then leave him out of it. Don’t bully him.", "Looks like you have some growing up to do. YTA", "YTA. Big time.\n\nAs an autistic person who is into all the stuff your so called friend is, it would hurt me MAJORLY if one of my friends said that while info dumping. Also, a person's interests has no impact on how well they can work, think, interact with people, ect. The only issue I would see is a job not liking their employees dressing alt. Everyone has their own interests, and just because they're not something like woodworking, crafts, gardening, baking, or other \"adult\" interests, doesn't make them any less cool.", "You’re totally the AH! You know he’s autistic and seem to be aware that individuals who are autistic hyperfixate on special interests. But you think he should be embarrassed by that? Wow, I’m actually hanging out with my autistic child right now and I hope he never runs into anyone that intolerant.", "I've always wondered why we limit our entire personalities to age limits. Oh, you're 20 now so you can't like the same bands. You're not a teenager, you can't watch these shows or read these books. PLEASE. Liberate yourself! There is no reason why he can't enjoy the same things he did when he was younger. If you find it cringey then that's your problem. He's clearly very comfortable with who he is, you should take a page out of his book and stop caring about what other people think.\n\nYTA and you have a LOT of maturing to do.", "YTA. There are plenty of people who dress alt and are involved in fandom and who are happy and independent adults. Like dude, you’re on *reddit.* There are countless subs of people deep into diff subcultures. You’re acting incredibly judgmental and it comes off ableist", "YTA. I have found in life that people who are hyper-focused on being the adultiest adult to ever adult and snub anything they find \"childish\" to have been called childish themselves at some point in their life.", "YTA. Let people be happy. It’s cringy to you? Then don’t frickin do it. He seems happier than you tbh, he’s being himself and you’re stuck on… well hating him for it? Get over yourself.", "Oh honey no. In the real world, no one gives a shit what people look like. And the people who do give a shit, are usually seen as the A’s. I’m a regulated healthcare professional with blue hair and an arm full of tattoos. The people I work with care about the quality of my work, not what I look like. I dress probably similar to your friend, and the people I work with couldn’t give two shits. \n\nIn fact, I think people like your friend, who live as their authentic selves, are some of the coolest people out there. Not giving a crap about someone’s opinion of you is probably the most metal thing ever, and it’s something a lot of us struggle with. So the fact that your friend can do it with seemingly few issues is kinda cool. \n\nYTA. Time to grow up sweetheart, your worldview isn’t the only worldview out there. Your friend is just fine how he is. You said he got good grades in school and is at a job that presumably doesn’t care about what he looks like. I think he’s doing just fine. Time to stop being so judgey and try and figure out what’s missing in your life that you felt the need to tear someone else down. It’s not a cute look.", "Major YTA and a scummy friend at that. It’s called passion for something. Sorry he apparently isn’t perfect in your eyes, but even then who are you anyways? There’s communities that have lifelong fans and that’s fine. From your post alone it shows how much disdain you have for this poor guy and how lowly you think of him. Just because you don’t like or understand his interests doesn’t give you the right to bash on his, plus it’s not like he’s harming anyone so what if he’s “cringy”.", "YTA\n\nnot every 24 y/o has the privilege to move at early but at least they’re allowed to have their own interests\n\nyou’re also a bully for just being mad and mean at what makes someone else happy", "YTA. One of the many beauties of being an adult is not giving a shit about what other people think about you/hobbies. I’d argue he is mentally more mature than you as he is able to be his true self shamelessly, y’ know, like an adult.", "YTA. The entire world is literally obsessed with Wednesday right now , sounds like your friend is currently trending.", "\"Do not pity the dead, Harry. Pity the living, and above all those who live without love.\"\n\n- Albus Dumbledore\n\nI'm 52 and a complete Potter nerd. Didn't even start reading the books until almost 30.\n\nYTA.", "YTA. Who the fuck are you to tell him what to like? I hope he is able to find better friends.", "YTA and a shit friend.", "YTA\nHeads up that my former best friend made me feel stupid for everything that I enjoyed - calling me names and saying the same shit you’re saying to your “friend” - and I nearly killed myself", "YTA hate to break it to you but I know people who still enjoy music they discovered in high school and they are in their 40s, 50s and 60s. It is very very normal to not change those things. It's also very normal to change. \n\nEveryone is different. Stop assuming everyone will follow the sane trajectory in life. It's just not how it works.", "Oh my sweet summer child...I am almost 10 years older than you and, do you know when I knew that I had actually matured? It was when I finally started giving zero f$ks about other people's opinions about me and I unapologetically started being myself. Your ex-friend (because your friendship is over after this) is already there, however, you still have a long way to go. YTA.", "Yes, you are the asshole. Don’t yuck his yum. He isn’t hurting anyone. You aren’t his friend.", "YTA. I have managed with people just like you described, and they were all high-performing. Yiu can’t judge someone based on outward appearance.", "Wow judgy mcjudgerson. Literally none of that affects you or anyone negatively. If you don’t like it, don’t hang out with him. \n\nYTA, signed a 35 year old (successful and thriving) Alternative/Goth gal.", "major yta. like what is ur problem.", "I think this sub was made for you 😳 Yes, you are most certainly the asshole", "uhm.. \"friend\"? seems far from. if you aren't supportive of your friend or any of his interests, u shouldn't be around him. definitely ta.", "I seriously cannot believe that you didn't realize you were in the wrong when you typed this out. YTA. He deserves new and better friends.", "Curious:  Did you ever friendzone him?", "That’s what he’s in to. He’s not hurting anyone. You’re the one with the problem", "YTA\nWhen I turned 40, I had a mid life crisis. I went emo/goth. I got multiple piercings, heaps of tattoos and my favourite store when I lived in the US at that time, was Hot Topic. I went to numerous MCR and Green Day concerts. I’m 56 now. While I no longer dress goth, I do however love MCR and Green Day. I’m flying from Western Australia across to Sydney in March to see MCR.\nSo quit judging you so-called friend. Are you perfect? Probably not. He works, he lives at home and is autistic.", "I don’t think you understand the actual meaning of the word friend, much less best.  Because you are not a friend to this person.  YTA.", "YTA. Girl he's autistic, he's probably already copped it for years, he doesn't need it from you.\n\nAdults find their people. I'm autistic, and I got super into kpop towards the end of high school and I was the only person in my school who liked it. But when I went to uni, I found a whole host of other people who like it too. I've found people who share a lot of my interests, actually.\n\nNone of this has presented any barriers in my day to day life, but you know what did? Being belittled for my interests. It crippled my already poor social skills.\n\nAnd I see that comment about him living with his parents. I didn't move out of my mum's house until I was 23, and in this economy, can you blame him? People are living with their parents for longer, and moving back in with their parents.\n\nHe seems quite happy to do him. Get over yourself.", "You are not his best friend. You find him cringy and embarrassing, and you actively judge him and tear him down when given half a chance. Even if he has literally no other friends, you are still not his best friend, because a friend like you is worse than nobody at all. He has done the exact right thing in blocking you.\n\nYTA.", "You. Are. The Asshole.", "YTA, your the biggest asshole ever and i’m glad he blocked you everywhere. he’ll find someone that actually cares and respects who he is. what’s the problem with him living with his parents at 24? it’s incredibly common for young people to live with their parents because getting a place is much harder now then it was back then.", "YTA. I have friend who is 50. She has been an alternative goth type person as long as I've known her. She is happy and we all love her. She is not neuro typical, and it's going great for her. She has had great jobs that she loves and great friends and an amazing partner, none of whom tell her to grow up and become normal. \n\nYou bullied your best friend. He thought he could trust you. You insulted him to his face (over the phone, same thing 🤷‍♀️). I doubt he'll ever trust you again, sorry.", "YTA. maybe you should find friends you actually like and stop being mean to people you supposedly like.", "YTA. One of the great joys and privileges in life is to be so trusted by another person that they are totally, unabashedly themselves around you. You had that and then lost it by shaming him. \n\nY’all are at an age when you’re figuring out who you are, and it’s natural for a lot of friendships to dwindle as you make your way towards the people you with whom you now share more interests. \n\nBut please. Be kind to each other along the way. Love your friend for who he is, don’t shame him for it. Even if you are growing apart. \n\n“When you find people who not only tolerate your quirks but celebrate them with glad cries of ‘Me too!’ be sure to cherish them. Because those weirdos are your tribe.” - AJ Downey", "Bruh. I’m 42, own a business, have a kid, and still dress like a goth chick. I’m basically a grownup professional goth and plenty of people take me seriously.  Chill and let your friend live his life. \n\nYTA", "What’s cringey about being enthusiastic about a band he’s discovered?  Seriously??", "First of all screw you The owl House is an amazing show. and second YTA.", "YTA. Let people enjoy things, something is wrong that you want to purposely hurt this person. End the friendship maybe if you cannot be capable of BEING a friend.", "I’m 29F, always loved alt music and fashion. I also love watching cartoons. I lived with my parents until I was 22. I now live with my equally edgy, 33M partner and sometimes we watch cartoons together. Despite these apparent fatal flaws, we are doing very well for ourselves.\n\nYTA for participating in exclusionary and judgemental behaviour. If he’s happy, so what? Enjoying different music, fashion styles, or shows isn’t hurting anybody else.", "YTA. People with autism have different interests typically than other neurologically typical people. Having weird special interests is very common for autistic people. So whether you did it intentionally or not, you claiming his weird interests are embarrassing was your way of saying his autism was embarrassing.", "YTA, OP. I’m 24 years old working a job in tech, and I’ve been in the emo punk/metal scene for as long as I can remember.", "YTA this reads like a bully trying to justify their actions-and a jealous 1 at that. Afraid to be yourself because you are going to get judged like you judged your best friend.  No one needs a friend like you. \n\nLearn some things about autism-mentally 12-SERIOUSLY?!? And lots of young adults still live with their parents. He has a job and helps out around the house. He has interests that make him happy. Who are you to decide what in and isn't acceptable in \"the real world\"?", "When you grow up a little more you’ll be embarrassed that you weren’t kind.", "This has to be satire. This is such a gross thing to do, I refuse to believe you have that little self awareness.", "YTA. Majorly. You’re a bad friend /:", "Yta!\n\nIf you're his friend, why would you rain all over his excitement?? That's a terrible thing to do! There's billions of people on this planet, what's great is they're all different and unique. I happen to love alt-styles, I've got vibrant turquoise hair and love all kinds of styles, fashions, and interests, including goth, how someone presents themselves has nothing to do with their capabilities as a human being, both on a personality level, and professional. Generally the people who own who they are, and be who they want to be, should be taken more seriously, they have the balls to be true to themselves. He's got every right to cut you off as a friend, friends don't expect their friends to be someone they're not.\n\nAlso, how does his style affect you personally? You aren't being forced to wear something you don't want to wear, god forbid you have to listen to your friend talk about something that excites him. Let him live his life, and express himself how he wants to, and go continue being the awful person that you feel society expects you to be. \n\nI hope you step on a lego", "???????? Let people live dude. YTA. Why do you care so bad about what someone else enjoys and how they dress? So lame. You’re the one who needs to grow up.", "YTA \n\n\n>He dresses in all black,\n\nSo do I,  what's the issue here?\n\n\n>he has a tendency to hyperfixate on kids shows\n\nI love dragon ball and animaniacs, so what?\n\n\n>he started to excitedly talk about some band he started listening \n\nHaven't you ever listened to something for the first time and be excited about it? If you haven't,  you need to live a little bit more and get out of your shell. \n\n>He has a job that he works hard at, he helps his parents out around the house (he still lives with them because ofcourse he does🙄) and hes a really smart person.\n\nMaybe he lives woth them because is the more convenient way for everyone.  Why is this such an issue? I love living with my parents,  I'm still independent,  pay rent and bills and we look after each other.  \n\n\n>if he grew up a little he would get very far in life and I figured I needed to be the one to motivate him to do that being his best friend.\n\nWho died and made you the big a$$hole???", "INFO\nwhy did you even post here if you aren’t accepting what people are telling you?", "YTA You are not his friend. You're just judgemental and bitter.", "Life Pro Tip, having hobbies and things that you enjoy is life is priceless. He is employed, helps out his parents, and is secure enough with himself to dress in a way that makes him happy, sounds like he’s winning to me.", "YTA, wtf? You didn’t say a single nice thing about him in this entire post, why are you even friends? \n\nEven if he didn’t have autism, he has a right to enjoy things without risking judgment from others, especially his best friend.", "You didn't 'motivate' him you just insulted him, there's a big difference YTA", "YTA, Others have summed up why.\n\nLove,  \nYour friendly neighborhood 50+ year-old goth with a 75+ goth dad (we call him Goth Grandpa)", "YTA. You just described my boyfriend. People have the choice and right to be who they are. I hope he finds new friends.", "YTA why do you think adults have to be boring and not enjoy things?", "Omg\n\nYta. Yta. Yta.\n\nYour friend was trusting you with his big enthusiasm and enjoyment of a thing (which is like a autistic love language btw.) You shamed him... to motivate him to hide himself. That is so toxic.\n\nIt is also ableist. Not everyone has to be like everyone else. Diversity is a good thing.", "Is your friend hurting anyone with his choices? Is it directly effecting you? No? Then why do you care. Now more than ever fashion has been all over the map, people have access to so many things to like, why be so cruel to him because he likes what he likes? It’s not offensive or anything. You sound like you are just embarrassed he doesn’t try to fit in like I assume you do. Not everyone wants to be vanilla.\n\nYTA and a bad friend", "Wow what an ablest Asshole. \nYTA \n\nAutistic people fixate\nAutistic people can be inflexible in thinking and dressing. \n\nMaking fun of an autistic person who may not ever be able to live on their own is an Asshole thing to do. \nMaking fun of an autistic person for having different likes then you, that my dear is “cringy”\n\nYou my dear are super “cringy” for making fun of a disabled person.\n\nMaybe for Christmas you can ask Santa for some empathy..,", "YTA \n\nNothing he’s doing is hurting anyone. He divulges in the things that make him happy. That doesn’t make him childish and he doesn’t need to “grow up”. You do. It’s extremely childish and judgmental to tear someone down for their passions. \n\nYou sound like a terrible friend. You made him feel ashamed for being him. That’s gross. The way you worded this post makes you sound so conceited and mean. \n\nIf he even wants to talk to you after this. Apologize, profusely.", "He has a job, he's apparently a good son, and from your description, he sounds like he's happy.  He wasn't asking you for help or advice, so why did you offer it?  You need to really ask yourself why you felt the need to do this; it wasn't because you wanted to be kind nor helpful.\n\nYTA", "You already know YTA here. As a parent of an adult with autism I know how important it is for him to have friends. But if any of his friends treated him as bad as you do your \"friend,\" I'd  make sure he'd have no contact with you ever again. Life can be challenging enough for people with no disabilities. People with autism don't need jerks in their lives tearing them down to make yourself feel better.", "Yta. Yeah he needs to grow up start insulting and judging his friends just like you, the only real adult in the whole world.", "YTA. So you think you have some kind of moral and social superiority because you’re, at best, boring, and at worst, a really huge judgmental stick in the mud? Is what he likes hurting you in some way? Is it actively hurting him? The answer to both of those is no. I hope he finds a better best friend.", "YTA. I turn 26 next month. I’m autistic and I have adhd. The Owl House is a FANTASTIC show. And I would not be friends with you after that phone call. That would have broken my heart to have someone I thought accepted my quirks be so judgmental. \n\nI’m so proud of him for blocking you. He knows that he doesn’t need anyone in his life that looks down on them for… (checks notes) loving and being excited about things that make them happy???\n\nYou’re not cool for finding things cringe either ya know.", "To the op. I get it. You care about them and don’t want to see him waste his talent.  Unfortunately, There is no situation where anyone from the outside looking in , doesn’t call YTA.  I wouldn’t call big YTA, but it’s not your place.  Life will go on and you 2 will drift apart little by little. Just remember it’s choice.", "YTA.  You’re the one who should be embarrassed.", "Totally TAH.\n\nWhile simultaneously saying that he’s nice to be around and he’s a cool guy, you also seem like you’re belittling him. You overall seem like a judgmental person. I wouldn’t want to be friends with you if I knew that you were so picky about how your friends should dress and act. You seem more embarrassed on his behalf.\n\nThe world will pick you apart for everything you got, that’s why nobody cares about social stereotypes and standards anymore. He’s just doing what makes him happy. If being like everybody else makes you look good but doesn’t make you feel good what’s the point? I’d proudly look crazy if it made me feel like the best thing in the world.", "YTA and a horrible friend. I'm so glad that he's blocked you! He'll be so much happier only talking to people who are actually his friends. Stop bullying people you say are your \"best friend\".", "YTA, hugely!\n\nWTF? According to you:\n\n> hes a nice guy. He has a job that he works hard at, he helps his parents out around the house\n\nAnd this wasn't a problem until\n\n>(he still lives with them because ofcourse he does🙄)\n\nAnd the problem is why? Your friend has an arrangement with his parents to live there and support them. Then you say\n\n>I just think that if he grew up a little he would get very far in life\n\nGuess who needs to grow up?\n\n>(Hes autistic btw)\n\nThus making you a bigger AH than you ever thought you were. Need I say more?", "YTA. Why does he have to stop listening to music and find new awesome bands? How in the world does that make him immature?\n\nI’m 37, I still love punk and ska music and if someone told me about this new awesome band they found I’d be all for listening to them. I also still have my piercings, tattoos, dye my hair and pretty much stick to dark clothing, i love Harry Potter, and cartoons. \n\nKeeping all that in mind, I work in an office as a manager and guess what? one cares about what I look like, that I wear dark clothing, or what my music preferences are. All my work and coworkers care about is if my job is getting done or not. \n\nYou sound very high and mighty. Might want to get off your pedestal and come back down to earth. Blocking you might not have been a bad idea.", "I already judged you elsewhere (spoiler Y T A), but I thought I'd pass on a bit of advice. If someone enjoys something let them enjoy it. Music, cartoons, whatever. \n\nI'm in the latter half of my 30's and barreling right towards 40, and I am just now learning to not apologize for getting excited over things I enjoy.  I gained that little tic because of people like you who do nothing more that suck the joy out of other people's lives because you replaced your interests and hobbies with the BS idea of what being a grown up is.\n\nYou mocked him for enjoying a style of music, and you've made snide comments about him enjoying a popular cartoon that has a pretty sizable adult following. Unless he's planning on selling his soul to corporate, none of those hobbies will keep him from advancing in his chosen career. And even in corporate it won't matter much. \n\nHaving a shitty personality and the interpersonal skills of a pissed off honey badger will harm your career growth though! So you might want to be extra careful at work, cuz if you treat your friends this badly, I'm guessing your co-workers probably want to launch you out of there with a catapult.", "He sounds like he's happy, though.\n\nAre you?\n\nYTA.", "YTA, after going through this, he's going to be very reluctant to unmask around people again, if he even does.", "I’m almost 70 and am proud to be an “elder goth.”  Of course I don’t dress that way in professional environments, but I’ve been to local goth clubs where I’m not the oldest one there.  YTA", "MAAAAJOR YTA what happened to make u such a sad and bitter person OP", "Hey! \n\nSpeaking from experience, a moment like this is exactly the moment that can lead someone down a very dark road in their lives.\n\nI’ve been in your friend’s position in some way my whole life. Except at 34F I’ve more opportunities to be let down, more “friends” who’ve tried to help me and implied that who I am in the world is some how wrong and problematic.\n\n\nI am trying so hard not to lose my shine, and to still find joy in the things that make me happy.\n\nThere comes a point where the risk of hurt is too insurmountable and you decide it’s easier to go away than face it. And once you reach that point, everything tastes a little less sweet.\n\nI can tell you the reason I feel this way isn’t because of the bullies and people at work. It’s because of friends and family just like you.\n\nThey were all saying what you’ve said out of love, out of some misplaced sense of obligation - and often out of some weird displacement of their own unhappiness.\n\n I have carried those words with me like a wound that has never healed. I’ve internalised it, I’ve fought like hell to become what they want me to be. And year after year I have continued to be torn apart by the narrative I’ve created in my head. Until it becomes this voice that tells me that I am broken and I am worthless.\n\nLuckily for me…\n\nWhen it’s happened I’ve been able to retreat into my safe spaces, I read stories, I watch the movies I’ve loved since I was a child. I return to my love of art and music, and I remember that I am surrounded by beautiful people who create marvellous things, and care so deeply about their passions and the world around them.\n\nAnd in what feels like 99.9% of the time, they are the people like your friend… If they’ve been given a chance to thrive.\n\nIn the end, I’ve somehow managed to hold onto my “kid mind.” I’ve managed to create a space for myself that includes a family I feel safe around and don’t isolate myself from when I’m hurt. But the space is a lot smaller than it should be because of people I thought were my friends. \n\nYou’re young. You’ve been taught by your experience that blending in is the only path to happiness. It’s not. It only takes you to a place when you spend so long pretending to be what you think people want to be that you’ve forgotten how to be happiest as yourself.\n\nYou have a chance to learn and grow and help save a life by admitting your worldview is self-centred and flawed. Your friends joys and interests are just as valid as yours.\n\nHe doesn’t need you to tear him down, he needs you to build him up. \n\nJust remember that you’ve pulled the rug out from his feet. He thought you were an ally. You made him feel attacked.  He might react out of anger and pain, and in that case, you might need to address this in his terms. \n\nYTA. But you have a chance not to be", "YTA how dare someone enjoys something. You are so mature for saying he's a joke because he actually shows he's interests instead of acting like he doesn't care about anything.", "YTA. Part of becoming an adult is realizing that  you shouldn't care what others think about your fandoms, preferences, etc.  Sounds like your friend figured that out, which is why he blocked you. You are the one who needs to grow up. Stew on that. You're worried about what others will think, but you need to accept that YOU are those judgy \"other people\" at this point.\n\nSigned, a 40 year old boring lawyer and mother who likes cringey shit, too. Aka a grownass adult.", "YTA and how dare you insult MCR! Do you know\nHow long people who were fans of them waited for them to get back together?? I’m literally about to be 28 and I still rock my MCR shirt loud and proud. You’re just a hater. Let him enjoy what he enjoys.", "YTA and not really acting like a friend.", "YTA. Big time. 200000000%. Your (ex) friend is way cooler than you will ever be. He’s comfortable in his own skin and not trying to conform. You’re the one still acting immature. When you’re in you’re 30s you’re gonna cringe so hard at 24 year old you and your actions.", "I was abused by my \"best friend\" for 8 years.\n\nOne of her favorite tactics was to pick apart everything I liked and make me feel like crap about it, among other things.\n\nI am very similar to your \"friend\" here -- great grades, alternative, wears a lot of black, involved in fandom culture, absolutely *loves* The Owl House.\n\nI am not embarrassed of who I am, and your \"friend\" shouldn't be either.\n\nFirstly, you are making fun of someone's interests. Who are you to decide what's \"cool\" and \"mature?\" Do you define someone's worth as a human being by what shows they like to watch? By what music they listen to?\n\nSecondly, you said \"He's autistic\" and \"I'm not mentally 12\" in the same paragraph. This is disgusting behavior.\n\nYTA. I hope he realizes how awful you are and cuts you off for good.", "YTA. You insulted someone that's supposedly your friend? Damn.\n\nLook, I'm older than you - plenty of people I know are still into anime or cartoons/kid shows, tons are into music of specific genres and will happily gush about them to anyone that listens, and some of them have aesthetic styles that defy the \"norm.\" People take them seriously just fine.\n\nThe only one not taking your friend seriously right now is *you*. *You* are the problem, not his interests, and by insulting him and his behavior, you have proved that you aren't a very good friend. Evaluate your biases before asking the internet to pick apart exactly how much of a jerk you were, it'll save you some time. :/\n\nEspecially when you've admitted in a comment that you already *know* YTA for what you said/how you said it.", "YTA. If he's autistic then the way he is makes perfect sense. Autistic individuals don't think or feel like you do. Him wanting to tell you all about the things he's into is him wanting to share with you. He's opening up to you because he feels comfortable to. He will probably never do that again now. You owe him an apology. If he's not affecting your life... then let him be happy.", "YTA, so what? He likes what he like, and you apparently like nothing, also you're both 24, that's not THAT grown up. In fact I can honestly I'd be more inclined to hang out and be friends with someone who is passionate about something and has cool and interesting hobbies, and doesn't care what people think. Rather than someone like you, who just criticizes and judges people for having a different life and different likes and interests.\n\nThere is absolutely nothing wrong with living with your parents at the age of 24, I did. In fact I think that's more normal than you realize. Also for many cultures it's weird or even inappropriate if you move out unless you're married.\n\nSo maybe you should chill out, apologize to your friend and tell them how much of a judgemental AH you are, and stop judging and looking down on people who are, frankly, just living their lives how they want.", "So he holds down a job and is very smart. Sounds like he's being taken seriously?", "YTA. I'm 34 and into The Owl House and still dress goth. I was also an edgy teen who was forced to change what they wore in their 20s. I still feel like I missed out on the best of who I could've been with a little acceptance.\n\nYou deserved to be hung up on. You deserved to be blocked, especially if this wasn't your first time criticizing the things he likes.", "YTA. \n\nImagine thinking that having a different taste in music or fashion means you’re acting like a teenager. You literally talk about how the dude is motivated, has a job, diligent, smart etc and ridicule him on something so superficial. \n\nEven look at the emoji you use because he still lives with his parents. Get off your high horse.\n\nSeems like he’s not the one that needs to act like an adult.", "YTA\n\nOp, I’m really not understanding the problem. He has a job and enjoys his hobbies. Why do you see a need to tear him down like this? it’s really sad that people enjoying themselves makes you so upset and jealous. \n\nBtw, have you seen The Owl House? It is much more than a “kids show”.", "That’s not motivating, YTA. \n\nHoney, you need to learn a thing. I’m the same age as you and guess what, I still appreciate and watch “kid” shows, because I refuse to let people like you, dull my sparkle. He is blocking you, because he is refusing to let you dull his goth sparkle. \n\nGo watch a “kids show” and tell me you can find a show in your age range that has a solid storyline that doesn’t get out of hand. As much as I enjoyed Ricerdale for the throwback to my childhood, I’ll watch Gravity Falls over it any day. Why? Because Gravity Falls has a solid storyline and can be watched by both a young and older audience. \n\nHow about Avatar The Last Airbender. One of the best animated shows of all time. Solid storyline and great fillers. Guess what, my mom in her 40’s likes it, but I digress. \n\nYour ex friend has a unique personality. There’s nothing wrong with that and clearly his job takes him seriously enough to keep him there so why are you complaining? \n\nAlso, why are people constantly pushing for kids to hurry up and move out? In this economy and housing market? How about no. Clearly your sparkle died a long time ago, I hope he forever keeps his and rocks on into a beautiful life without you. Once again, YTA.", "YTA\n\nApparently around 52% of young adults still live with their parents in the US. It's the most effective way to save money, not to mention, with the increasing cost of living, it helps to save your folks money too. \n\nAlso, neither metal, nor emo are goth. Goth is goth. Not that being passionate about either of the other genres is bad, but wearing black does not make a person goth, being a part of the goth subculture, and listening to goth music is what makes a person goth. Go check out r/goth and r/GothFashion There's plenty of adults who are passionate about the bands they listen to, wear more than a lot of black, and some of us even have wild hair styles, deathhawks, bats nests, etc, some folk wear tons of makeup when they're out and about too, doesn't stop any of us from being adults.\n\nIf anything, you sound somewhat jealous of your former friends ability to keep touch with youthful passions. It sounds like you became a gumpy old man in your early 20's, an extraordinary feat, given that you're not old, nor are you apparently a man.", "YTA he’s a nice guy who works hard and helps at his parent’s place because he lives there. \n\nSo you are embarrassed by how he dresses?", "YTA and obviously pretty immature yourself. Do you seriously think being interested in music has any bearing on how someone is treated in the world? Clearly you’ve got your own insecurities regarding what others think.", "Oh my lord I genuinely cannot believe you’re ASKING if you’re the asshole. Your best friend is excited about something and your first response is to shame him and attack his interests? You’re not only an asshole, you’re an absolutely terrible friend. He deserves so much better", "My dude, I have a coworker who's is like 60, has tattoos up to his neck, plays in a rock band on his free time and he's still the most badass environmental inspector we've got. Dude's out there closing illegal mining ops in the middle of the amazon, where helicopters need to be bulletproof.\nI'm not nearly as badass since I'm a newbie, but I'm 36, my hair is pink and I rock my anime tees and nobody in the office cares. Some of them enjoy animes too, and they watch them with their kids.\n\nYTA. You've taken a sad, sad turn in your life and got rid of the simple silly things that used to make you happy just to 'fit in\" and now you want everyone as miserable as you. Don't be this person.", "YTA just for how you talk about your friend in this post. What you said to him is a cherry on the asshole sundae.", "YTA. His joy in life and the things he enjoys is just that. It doesn’t hurt you to be nice because he finds joy in his fandoms…also. The Owl House is freaking awesome. Try finding joy in your life. Something that may seem silly to someone else and then I hope someone tells you how dumb it is cause that hurts. You are a bad friend, OP.", "But, you didn’t motivate him, did you? No. You insulted and attacked him. Have you asked him what his goals are? What he wants to do and be as he gets older? What’s his dream job? What does he want out of life? \n\nIt sounds like you’re the one that’s embarrassed because you think his actions rub off on you. That’s a you problem, not a him problem. If you want to motivate him, then find out what his goals are and help him see a path to achieving them. That’s motivation. Ridiculing him for the things he likes and takes comfort in is cruel. \n\nYTA", "YTA, who needs enemies when they’ve got a “best friend” like you", "Dude, he sounds very mature. He knows what he likes, doesn't feel the need to conform to societal norms, and is open about sharing his interests. \n\nWhat *is* immature is judging other people for their life and likes. You sound like you never progressed past your teenage years if you think you're so cool for being a dick towards someone for being their authentic self. You have the same vibes as the people who would mock me for being openly queer and alt/goth in school.\n\nIf you go through life with that attitude, it's you who nobody will take seriously. \n\nYTA", "YTA YTA YTA YTA\n\nBRO WTF. Did you not at all read anything you just typed to yourself. You just dissected, strung out, drained and diced your friend into tiny pieces.  I'm 20(f) still heavily scene and death core, also autistic, and live with my parents. You may not take then seriously, but I promise you there is a while world out there that will cherish, support, adore and take them seriously. Seriously dude. You're the one that should grow up. Gimme ya friend I'll talk about bands with them jeez", "WTF??? Why do YOU care what he's into and what people think of him if HE'S good with things the way they are???\n\nYTA", "YTA, what kind of friend treats someone like that. SMH", "Ppl took trump seriously when he was president...your friend will be fine\n\nYTA", "YTA. You say you’re best friends, but it doesn’t sound like you actually like him anymore. He got excited about a band. Guess what. People DECADES older than you STILL enjoy bands and may get excited about them. He didn’t ask your advice, and if you were actually trying to help him (unsolicited), you wouldn’t have humiliated him by asking if he was embarrassed ABOUT HIS INTERESTS. Friends accept that they may not share all the same interests. Friends don’t shame each other for their interests. You need to learn to be a better friend.", "yes youare the AH here on so many levels.  the guy is autistic, he jas a job, he enjoys what he enjoys.  if anything, it sounds like you are jealous that your friend is enjoying their life and you are living a miserable life.", "YTA, how did you manage to type that out and not recognize how mean that was?", "YTA. I'm in my 30s, and still dress like an \"emo kid\" because that fashion doesn't really have an age limit (and I'm an OG emo kid). I also really like the show The Owl House. I know I'm not the target demographic, but watching something wholesome is just really nice and since my job is in pop culture, it's important to keep up with at least some trends like it. I also nerd out about new bands and my longtime favorite band on social media and to my friends. There's nothing wrong with living with your parents at 24 either - a lot of people do that. Please get over yourself and consider how snotty and rude you are to someone who is supposed to be your best friend.", "YTA. “You’re an adult, you’re supposed to be boring, miserable, listen to whatever is on the billboard top 100, and take up golf as your hobby or no one takes you seriously. I think you’re weird and I judge everything about you.” You sound fun.", "Sounds like you grew up to be a judgemental ahole. YTA.", "YTA I’m 22 and autistic how fucking dare you. I’m not mentally 12 I hyperfixate on kpop what is wrong with having special interests? At least we have a fun personality.", "YTA.\n\nAs a 25 year old who watches The Owl House, it's not an autistic thing. There's a growing culture of adults interested in animation, fandoms, and generally \"nerdy\" stuff. And let people enjoy the fashion they want to enjoy.\n\nYou sound like this girl I knew in high school. I told her about anime conventions and she said there's something wrong with adults and teenagers who dress up in costume.\n\nAND SHE WAS A THEATER KID what even\n\nShe just came off as a snob who thinks she's better than other people because her interests are more common/recognized in society\n\nYou give the same vibe. Judgy as hell.", "YTA and a terrible friend. Full stop.", "Lmao bro, I'm in my 30s and wear Jojo Siwa bows and I'm currently in Hannah Montana PJ pants. My hair hasn't been a \"normal\" color since I was 20. Plenty of people take me seriously, and I've had several high ranking positions at several jobs. YTA", "YTA - \n\nFYI I'm 32, my favourite band is MCR and I work at an IT company like an \"adult\" who are you to judge what he likes or not?", "If I was in his shoes, I wouldn't give a shit, and in my opinion, judging him off his lifestyle if he ain't hurting nobody, is kinda childish, people in the \"real world\" would take him seriously. but I see you're intentions, NAH.", "I like honest friends NTA", "It could have been done in a better manner but you’re hearts in the right place", "I’m 34 and have a 6 figure job and listen to MCR and talk about them a lot", "Can confirm. I'm 33 (in two weeks) and I've been into MCR since Bullets. I have a partner, kids, car, home, not a 6 figure job but I run my own business and all in all, doing pretty well for myself. I've never not been taken seriously in my professional life and I still listen to bullets and three cheers quite often (not really a fan of the music after three cheers)", "32 here with a 6 figure job and so excited to see MCR next March when they’re in Australia!", "your accidental typo is hilarious, that one of the smartest things to do if healthy is lice at home 😂", "Sounds like OP is jealous because friend lives their authentic self, and OP doesn't, because growing up = conforming.", "I admit that I took it too far with the comment but I was just being realistic. If he ever tried to get into a professional job, the manager would probably be dismissive of him. Its sad but thats just how the world works.", "I have zero disdain for him. I just find it concerning that he doesn't seem to have changed much in over ten years. I wonder if he went through some trauma that I never knew about in that time because I heard that people tend to \"stay\" in the same time frame when they were traumatized", "Ironically, OP’s the one who needs to grow up a bit. Obsessing about what people can and can’t like according to arbitrary things like age is very childish. CS Lewis said it better than I can:\n\n“Critics who treat 'adult' as a term of approval, instead of as a merely descriptive term, cannot be adult themselves. To be concerned about being grown up, to admire the grown up because it is grown up, to blush at the suspicion of being childish; these things are the marks of childhood and adolescence…”\n\nI’m a goth in my 40s with many similar friends who have good, responsible jobs. OP, you need to widen your horizons beyond your small-town mentality, and recognise that you don’t know as much about the real world as you think you do. \n\nYou also owe your friend a huge apology, but he’s under no obligation to accept it.", "I was just trying to help him...", "I'm 27 and I saw MCR live this year. Damn near everyone in the arena was mid 20s to late 30s. A sold out arena tour sounds like an awful lot of people from the \"real world\" who are getting on just fine. OP is a huge asshole, and their friend will find other people who aren't.", "You'd be surprised at how awful people can be.  I feel like people with ASD get to see the worst side of people far too often.", "I had a “best friend” like OP, it’s very unfortunate but people like this do exist", "Unfortunately many posts on AITA prove this can be the case.  People like this are the ones who cause that \"AITA if I stop being friends with someone even though I seem to be their only one\" which used to show up a lot.  They've gotten stricter on rule 11 so they don't show up as much but it used to be a common one.", "Oh i believe it. I have met people and been “friends” with people like OP. It’s awful.", "Idk. Did you see the one from earlier who was so exhausted from every man falling in love with her, constantly told her best friend that the friend's husband only married her as second best, and couldn't understand why the friend's husband got upset when she told everyone at a dinner party that nobody ever thought the husband would even date the friend since he was so in love with OP (like all men).\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/zrtx1w/aita_for_joking_that_my_best_friend_wasnt_her/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "I disagree, i think OP sounds exactly like the edgy teenager they think their friend is. “Oh my god your interests are so cringey! Nobody is going to think this is cool anymore!”\n\n\nYTA. OP, adults don’t get bent-out-of-shape about people having different tastes and not living up to your personal definition of cool. This has high school energy all over it.", "Also there’s nothing wrong with still living with your parents I live in one of my parents houses and I will until they pass away 🤷🏻‍♀️ if he has a job and is supporting him self that’s great and plus also housing rather it’s renting or owning is still extremely expensive I technically own my house but the title is in my moms name I pay for the bills,property tax, and maintenance", "The most successful person I know is a total fiend for Disney stuff, you know what I did about it? I flew across the world with her and her partner for a week in Disney World.\n\nGive me more people with anything in their life that they are enthusiastic about, they are the best people.", "I don't think he does. At all.", "There *is* a problem here. It's called OP.", "Right?! My thoughts exactly. She’s gonna be shocked at how many people are wearing black or using cartoon characters as avatars in any given IT Or Creative Department. Good forbid she learns that those people are also (gasp!) into music and bands.", "Right??? I work in the software industry and like 90% of us are some flavor of weird and/or neurodivergent.", "💕 Just a total sidebar - I am so so sick of professionalism being defined as this very thin sliver of white collared, old white men with no humor, compassion, emotion or interest. Defined in such a way that people exhibiting historically feminine traits, for example, would instantly fall outside of the definition. \n\nOP is a good example, but on the definition of maturity. Don’t define positive words by reference to yourself and then judge people who fall outside of your definition. GAWWWWWD.", "Owl House is a great show. I feel like everyone should love it.", "I know... the Cleveland orchestra (the height of culture,  oddly one of the premier world class orchestras, the elite of grown up) is doing a show with all the music from final fantasy series.  ALSO MTG depends on the huge amounts of cash middle age adults drop on trading cards. And let us not go into the huge focus of multiple movie studios doing children's books, comics and making millions. FUCK DISNEY LOVES ADULTS WHO LOVE THEM AND SPEND TONS.", "seriously though. sounds like OP is only his ‘friend’ to have a punching bag for her own insecurities around not fitting in or not being where she wants in her career", "Apparently my 24 yo son didn’t get the memo about not living with me at his age 🙄", ">He’ll talk to me for hours about the next video game coming out, and while I’m not necessarily interested, I listen, because it makes him so happy to talk about. Because having a friend, or partner, means accepting them for them. Interests and appearance included.\n\nSaaaaame. And honestly, my partner does this for me too - I'll talk about pokemon or art or one of my other interests, and he listens and validates my thoughts and feelings *because he loves me*. \n\nOP, YTA and also part of the larger issues that cause ND folks to mask. **You shit on your friend and proved you are not safe to unmask around**", "Also to add- your friend is EMO, not goth.\nThere’s a difference.", "i’m a “goth/alternative” 22 year old in a field with people primarily older than me. guess what? people still take my seriously. op is a major AH.", "Kinda is putting it nicely", "Yeah but its a fast food job. He can easily do better than that.", "Tell that to the Executive Vice President of IT who works at the same Fortune 500 company I do, who came on stage at our Christmas party with a lightsaber and has had painted nails in every meeting.\n\nYour idea of how the world works sounds very much like an ignorant kid.\n\nOh and in case it wasn't clear, YTA", "No that’s not how the world works. That’s your judgmental side talking.", "Literally not how the world works.  Im an engineer with purple hair who clearly vibes anime culture.  I got a whole real person job.  He can too", "You’re not being realistic.\n\nYou’re being an asshole.\n\nYou ridicule and chastise this kid as if you’re his mother. Why don’t you just worry about *you* and let him be who he is? Maybe he needs to cut ties with you. I’m sure he can find much better friends.", "No, it's really \\*not\\* how the world works, and I know gothy people in their 40s and 50s who are quite succesful. You \\*think\\* you know how the world works but your view of the world is incredibly narrow. I've worked with and for dozens of different companies and at plenty of places someone like your friend would be perfectly welcome.", "That's not how the world works, goths can have professional jobs, you're just judgmental.", "You’re 24.  You have no idea how the world works.  I understand you think you’re helping him but YTA here.", "YTA . I work a professional job. My boss and I used to nerdgasm to each other about bands, goth fashion, make up, and a whole bunch of other things. I wear almost all black and have a tendency towards the 'edgy' side of music. I'm 31 and doing fine. People take me seriously enough. \n\nIf you don't want to hear about their interests and support them. Maybe the friendship isn't for you.", "You’re being a massive jerk wad. Hi, I’m autistic, have adhd, still an emo kid at heart, love my music and will nerd out with anyone who mentions my fav bands. God forbid someone mentions hockey  around me because I am a font  if hockey info and I love to share! \n\nOh yeah, and I’m a GM, run my family’s shop, do all the orders, delegate, do not only management work, but CSR work, on top of taking care of my house, helping my parents, and helping my boyfriend with his house. I also do concert and sport photography, and hobby photography and manage to be a pretty successful human.  \nSo as someone with autism, adhd, a professional job, from the bottom of my emo heart, go find a band you love, and put your energy into that instead of being a cruel human.", ">I was just being realistic.\n\nYou made fun of him for his special interest, knowing full well he's autistic. \n\nThere are plenty of real world jobs where the only thing that matters is that you can get the job done.  Life and professional experience will teach you that.", "For what exactly though? For wearing black? The colour of professionalism?\n\nOr for the bands he likes? Cos in the real world, when you grow up, no one at work cares if you like the same bands as them.\n\nIf someone's super into a band you say 'oh that's cool' and move on with your day.", "Are YOU in a “professional job”?", "You haven't worked a professional job, have you? \n\n\nProfessional jobs aren't just limited to small cubicles in tall buildings. Professional jobs aren't just limited to strict bible sales.\n\n\n\nI think much worse of judgemental coworkers than I ever would of someone who just dresses different. Get a hobby, you must be bored if this is so important to you.", "> I was just being realistic.\n\nNo, you were being a self-righteous AH.\n\n> If he ever tried to get into a professional job, the manager would probably be dismissive of him. Its sad but thats just how the world works.\n\nYou are the one dismissing him though. It's not how the world works, it's just how you work.", "not only is this an.. unintelligent comment, it’s wrong. you should see what i wear in a professional setting- dark colors/goth/alt. all of the people that interviewed me cared about my personality and experience, not what i wore. i even have facial piercings!! the horror, right?", "Chiming in as a 30+ year old, that is absolutely not how the world works outside of maybe the most rigid and corporate workplaces (and even those places are much more relaxed than they were in the past). \n\nPlus, this may be a shocker, people can behave differently at work and when they're around their (supposed) friends if they feel it's necessary. \n\nI don't know why so many people younger than me insist that adulthood has to look one way for everyone, I promise you are free to like things that are childish or uncool and still call yourself an adult.", "My husband has a very similar style to him, is covered in tattoos and piercings, and is in a management position with the company he works at, and is STILL moving up and getting promoted. He’s not here for me to ask him for sure, but I guarantee you none of these things would be factors in him not hiring him.\n\nSuck a fart.", "LOL. YTA, majorly.\nI have red hair, a septum piercing, and I might get more of those. I have a great job. \nAre you sure you’re not just jealous of him? He’s proud of who he is and staying true to himself. \n\nWhat if he doesn’t *want* a professional job? Your argument would be completely invalid lol\nReevaluate yourself, and be a better friend in the future to others.", "No. You were being mean. You’re coming up with hypothetical situations where he’d fail in order to justify your opinion. It’s sad that you’re that narrow minded. \n\nGood employers know how to assess potential employees who will be assets to their business, they don’t just look at how a person dresses or what their hobbies are.", "Has he tried to get into a “professional job” and is mystified as to why he hasn’t been hired and then come to you for advice? And then you carefully and considerately did your best to frame your constructive tips in a way that won’t hurt his feelings? No? You’re a bad friend.", "That's not how the world works though. I have had PROFESSIONAL jobs where I got hired with dyed hair, tattoos showing and my black clothing. Your just an asshole.", "You are not being “realistic”. I know plenty of goth/emo people that work high profile, well paying professional jobs.  Just because YOU are judging them doesn’t mean everyone else in the world does.", "I have managers report to me. Thats not how the world works. YTA.", "I'm friends with multiple people who are goth as adults. They have professional jobs. YTA.", "He just needs to take some \"From Goth2Boss\" courses.\n\n^(Remember the name.)", "YTA and a HUGE ONE - You are in no position to tell someone what is appropriate or isn’t. I’ve worked in corporate America for years now.I’ve seen people who are goth hold important leadership positions. His appearance has nothing to do with his ability. I hope he never talks to you again", "As an autistic person with lilac hair and tattoos who is a stock broker it's very much not how big kid jobs work", "People like you are why affirmative action is necessary YTA", "You don’t know any IT people, do you? Goths fit right in.", "All my alt friends are much older than him, and dress alt at their jobs. Tell me more about this \"real world\" did I spell that right?", "What a sad and boring place the world would be if everyone forced themselves into the mold of what you think an adult should be. \n\nYou should be proud of your friend for being true to themselves regardless of what others might think.  Instead YTA and have probably lost a friend due to your narrow and closed mind.", "Or consider this: he likes who he is and doesn’t want to change.", "The fact that your even thinking of that says two things\n\n1) You're not all that close to him\n\n2) You're incredibly self absorbed and probably took one psych course and think you're an expert.\n\n\nDon't be friends with people who you don't like.", "So you decided the treatment was to traumatize him?", "I like how the first jump from still liking something from hs is they must be traumatized", "An autistic person who doesn't like change? Stop the presses! /s", "Man you really are an asshole", "Examples of how he still acts like a teenager and why is it a problem he still lives with his parents? It’s normal in some cultures/family’s to live with parents in young adulthood. Did you ask him why he loves with his parents? \n\nTalking excitedly about music is normal and not a teenager thing.", "Seeing that you are his best friend and you think he is an embarrassment, have you ever considered that you might be a source of trauma?", "so now you are apyschologist ? or do you just take tings out of your ass", "What is actually wrong with how he acts? You’ve given a lot of examples of what he *likes* but no actual problems. For examples, is he difficult to relate to because he hasn’t shouldered any responsibilities and doesn’t face the same hardships as you do? Or, does him living with his parents embarrass you somehow? Have you felt pressured to giving up the enthusiasms you had when you were younger, and feel jealous that he hasn’t felt those pressures? Name the specific feelings and the root of them. Then you can better recognize whether there is actually anything wrong with him, or if you’ve simply grown apart and nobody is to blame. But get right with yourself on it before you judge him.", "All you're doing is making it very clear that you know absolutely nothing about Autism. He has special interests and probably hyperfixations and there's nothing wrong with that. His brain works differently than yours does, but there's nothing wrong with him. There's lots of Autistic people who are very similar. The best thing you could do for him is to leave him alone, he deserves someone who accepts him for who he is and not an ableist asshole.", "Why people think that the taste for rock music is going to disappear as you get older?? Im 43 and I love that music MCR is one of the bands i listen to and thats my music since i was a teenager. I dont dress the same but keep using only black and even when im not people can tell what im into. So the music you like doesn't define your maturity, let him be, thats what frienship means, respecting their beliefs and whatever they like. He is not hurting you YTA", ">I just find it concerning that he doesn't seem to have changed much\n\nI find your personality concerning... 🤷‍♀️ YTA Next time you feel the need to unsolicitedly judge someone, stand in front of a mirror! \n\nHopefully he will cut you off for good, he sounds pretty great, he deserves better friends. He has a job so his style and behaviour obviously don't prevent him from getting a job and he isn't hurting anyone with her music taste, wardrobe preferences, dislike of change etc.. Unlike you, who hurt someone you claim as a friend for absolutely no reason. The one who should grow up is you.", "YTA. Who belittles their “best friend” like that. That’s disgusting behavior. If anyone has any growing up to do, it’s you.", "God yes. CS Lewis can be horribly problematic, but DAMN does he hit the nail on the head when he’s right.", "Help him what? Slough off any self esteem that might have been weighing him down? /s", "By being a judgmental asshole? Lol no you weren’t. You were being a bully.", "Every adult, job having, living alone friend I have dresses like a clown and we're all either watching TOH, or losing it over Genshin, or DND. We all talk about our favorite goofy ass shit ll the time.\n\nYou think 'adult' means 'joyless and dressing boring' that's a you issue to deal with. If you want that for you, great, but that's still a you issue.", "lmao no you werent", "You weren't helping him by being extraordinarily judgemental. You're the type to not let people be who they are. Have you seen the prices of housing? You judging him for still living with his parents is a complete AH move. I wouldn't want you as a friend, either!\n\nYou've pretty much ruined this friendship. I'm sure you're proud of yourself. I'm also wondering if you're deflecting your issues on him. He's happy with himself. He enjoys his hobbies. He's excited about various topics. You might not be, and only you would know how happy/unhappy you are. To me, you seem miserable, and you want others to feel the same way.\n\nOh, and before you say anything, I still wear my Dr. Martens, listen to grunge, various heavy metal bands, have a son that loves the same music, still lives with me (21), and I'm a self-published author. I also am in IT. \n\nYTA, and you have a lot to think about.", "You are just trying to help? From what? Help him stop being happy and stop being himself? Just so you can feel you are a better person? Well, good for you", "He didn't ask for your help and you're wrong", "You were trying to help yourself. He is comfortable. You are not. You want to alleviate your own discomfort by pressuring him to behave in a way that makes you more comfortable and him less comfortable.", "In what way were youbtrying to help him? You shit talked the things that he enjoys, the clothes he likes to wear, and the music he likes to listen to. You told him that he should be embarrased about the harmless things that he enjoys and more importantly you made it clear that you were embarrassed to be his friend. How is any if that suppossed to help him? You are trying to shame him into being something he is not. You're not just an AH, you're a bad friend.", "How is telling him \"Of course you live in your parents' house\". What is that supposed to mean? Many people our age *cannot afford* to live on their own or do it to help their parents, which it seems your \"friend\" is doing. You sound like the one that needs helped, not him.", "Your brand of \"help\" is severely outdated", "It doesn't sound like you were trying to help him, it sounds like you were trying to fix him so you'd feel less embarrassment and animosity towards him.", "No, you were being an ableist asshole. Glad he’s realized you’re not his friend and blocked you. YTA.", "Did he need help? Why did you decide he needed it when he didn’t ask?", "You berated a 24 year old who lives with his parents AND HELPS THEM OUT. That's an ideal situation for people who haven't left the nest. It would be fair game if he was a complete bum who didn't have a job and didn't do chores but he sounds lovely. Not only that, you insulted his taste in television and implied it was due to his autism. Glad to see he blocked you. YTA", "Mid 20s. I am so jealous you saw them live. That is awesome! Still rock out to their music when baby shark isn't on", "Also 27, still a goth and still heavily into MCR I'm so jealous you got to see them live!", "I'm 45 and I'm seeing them next year with my 49 year old sister, 21 year old nibling and their 22 year old friend.", "Nice! Wish I could’ve gone 😭\n\nOne of my old coworkers and his gf went and they’re in their mid 20’s, I’m 18 but like my entire friend group from hs and college would see MCR if we had the money, also we all love the owl house too, banger fantasy show with LGBTQ representation too\n\n@ OP: YTA", "People in high school were far more offended by my being a Freddie Mercury fan than they were by my best friend being one. I'm ASD and she's neurotypical, we were both equally deeply obsessed, but I was the one who got relentlessly picked on. Make it make sense.", "Can confirm.", "I'm glad that's past tense you deserve better <3", "She", "MCR and The Owl House is literally my friend group lmao, and we’re 18-20 y/os (also my college learning community since we’re all fruity nerds)", "[Noel Fielding](https://youtu.be/HhtLwlKBJpM) can help you go from Goth to Boss!", "I'm friends with several of them!", "Maybe in more liberal cities but we live in a conservative town that has the exact mindset im talking about.", "Definitely the horror. You should honestly just quit your job and hide in a cave so nobody has to see your horrible goth attire! /s", "I admit that what I said was an AH move but I doubt he would be traumatized. We were both bullied hard and he has had way worst said to him.", "Haha, Dennis Leary reference", "I'm 41 and still front a rock band. 😂", "I can't, because it never does. I'm sorry, friend, I know the pain.  It doesn't matter what your special interest is, it's like sharks who smell blood in the water.", "Ah yes, you are correct.", "I was looking for this!", "He was my literal first thought when I read this post 🤣", "You said he has a job, he can always leave your town if they're all like you", "\n\nNow, assuming the job has a dress code, sure. That’s one thing. Everyone needs to conform to that at any job. But for the rest of it? It wouldn’t be an an issue in the rural, middle of nowhere, conservative town. \n\nHe may be known as the weird goth dude at his professional job, but that still means he’d get the job.", "He has a job, and you are showing your own mindset. Don't blame your mindset on the city you live in.", "So the main point is you’re conservative and you expect everyone else to conform?", "Hey, very pre-op trans guy over here in a town where the mullets flow as freely as those tacky trump flags (yes there are some who have that in their yards.) \n\nI have a lot of the same interests as your ‘friend’, which let’s be frank you don’t actually like judging by all the garbage you just spewed at him and on here, and these facts have NEVER stopped me from being hired.\n\nBe honest, you don’t actually care about his future or how people in the ‘real world’ think of him. YOU’RE the one who has a problem with his life style and interest and you want to make it HIS problem.\n\nYou didn’t come here seeking any valid criticism on your character and actually feel bad for what you did, you just wanted to find more people who agree that you should belittle people for just existing.\nYou should be ashamed. Apologize to this guy and leave him tf alone so he can decide if you’re someone he wants in his life.", "Edit: he has a job, he sounds like he’s just more secure in his personality and it threatens you. I have dyed hair and autism and have held a job for many years. It’s just you, no one cares", "i’m a flamboyant goth of a gay dude pierced up to the gills and have a great professional job with a solid network of similarly alternative colleagues. and, yes, also autistic. you’re TA here, and a jerk in general. if you were genuinely concerned you would try and support him in finding a career path that builds off of his skills and interests.\n\ni read your description of him and immediate thought of a few dozen librarians & academics i know. why are you so intent on bringing him down? you sound incredibly insecure and are taking it out on him.", "Lol I don’t even live in a city (very rural country) and he’s definitely still get a job around here. I really doubt it friend. You’re just trying to die on this hill so people won’t think you’re an ass.", "I live in a rural conservative area and people still don’t care. If your friend has a job and hasn’t voiced concerns to you about public perception, sounds like it’s a You Problem completely.", "Literally live in a conservative town, I'm very obviously goth with a professional job. I'm planning on moving to a more liberal city, but just assuring you that it is possible. Also, just because you're susceptible to peer pressure and being a cultural sheep doesn't mean your friend has to be, too.", "Well at least he makes money so he can leave you to rot.", "And you are a part of the problem that presents itself in those backwards ass ways of viewing the world.", "I know a guy in DC, very into all the stuff you mentioned, makes enough they no longer take SS out his checks. So yeah.", "Nope, even then. Grew up in rural/conservative area with population around 2000 and I’ve been working since I was 9, “real jobs” since 18. Worked at a bank in the early 2000s with facial piercing in same area and it was fine. The world is much more accepting of your former (I hope, for their sake!) friend.", "So you bully him more. The more you say the more of an asshole you are.", "See how you're the one dismissing him? This is your general view of him, so this wouldn't be the first time you treated him this way, it would come across in your everyday behaviour. \n\n> We were both bullied hard and he has had way worst said to him.\n\nIt tends to be very traumatizing when you are bullied by the people closest to you, such as a best friend.", "And that justified your action? Because he been bullied worst before, so he must be used to it and should not care", "It’s worse when it’s your supposed best friend.", "It is so much worse to have someone you trust and care for say something like that. I’m glad he’s secure enough in who he is, so he can stand up for himself.", "Yes, but you were supposed to be different.  It probably hurts a lot worse.", "It's one thing when the bullying comes from bullies. It's another thing especially when it comes from a close friend. And if he's autistic, well, he might just fixate on this moment for a while regardless if you apologize or not.", "How would you feel if your best friend tore you apart at the seams?", "Glad to oblige!", "Me too, and I couldn't believe no one else had posted it! Too good.", "So one day he can move away and leave 1950 behind.", "Adding onto this. Also a trans guy with these interests, all my friends are my age or slightly older with these interests, we all work real world adult jobs. My experience so far has been people in the real world enjoy real authenticity from others, and the people who don’t have their own issues to deal with.\n\nSounds like OP just doesn’t like his ‘friend’.", "He was beat up and called homophobic slurs. I don't think my offhanded comment is anywhere on that level", "Just because it's you don't think it's \"anywhere on that level\" doesn't make you correct. YOU BULLIED HIM FOR WHAT HE LIKES.", "you’re right, but not for the reason you think. getting shit on by people who claim to care about you cuts so much deeper.", "Well as you're supposed to be his friend and attacked him and the things he enjoys you could easily hurt him more and do damage like make him not like himself and the things he enjoys.", "So he was assaulted and called slurs for being who he wants to be.\n\nYet you turn around and tell him that he should be embarrassed about who he is.\n\nYou’re a shit friend.", "If he was treated that poorly in the past but still stays true to himself, then he's the most manly and mature person I've heard of. You should be glad that he's happy with the way he is despite how he was treated. YTA.", "Dude, you were his FRIEND. That's a whole new level of hurt those bullies could never manage and you don't give a damn.", "You’re not helping, jackass.", "Things people I thought were my friends said cut way deeper than people who barely knew me but bullied me. The thought process is, \"Wow if even the people who know me hate me then I must really be worthless.\"\n\nYou're a bigger asshole than those bullies.", "This right here, OP. I was bullied the entirety of my school years but you want to know what I impacted me the most? What I remember the most? When my own family ridiculed me for things I loved/really enjoyed. I stopped speaking to them for MONTHS after because I didn’t want to be bullied by my own family when I was already the outcast in school. Essentially that’s you just did. My family learned and regretted what they did and now I am free to ‘nerd out’ whenever I want. Do better. YTA. 100%", "Say it louder for the people in the back"]}