{"id": 535, "submission_id": "yhz7io", "title": "AITA for ditching a concert I didn't want to go to with a childhood friend to see another childhood friend for the first time", "selftext": "I (F19 at the time) had planned to go to a concert with my friend Rebecca (F19), around the same time our mutual friend Jason (M19), came home from his Mormon mission after two years. \nAfter some deliberation I decided that spending time with Jason was more important than going to a country concert that I didn’t even really want to go to in the first place. \nRebecca decided to go to the concert without me which was all fine until I found out she took her mom with her using my ticket that I paid over $400 for (she bought the tickets so they were all in her name but I sent her money to pay for my ticket) \nAfter the concert was over I messaged Rebecca to say that there was no rush on paying me back for the ticket but that the total amount was $400 (I had also already paid for the hotel but I let her off on that). \nShe then told me that I forfeited the right to the ticket when I left her hanging and that she had to bring her mom so she didn’t have to miss the concert. \nI had tried to sell the ticket a week or two before the event but wasn’t able to. I told her that if no one bought it I’d take the hit. But her mom used the ticket so I told her that her mom should have to pay for the ticket. \nRebecca disagreed because I said I was ok taking the loss if I couldn’t get anyone to buy the ticket. \nSo am I the asshole?", "created_utc": 1667186042, "permalink": "/r/AmItheAsshole/comments/yhz7io/aita_for_ditching_a_concert_i_didnt_want_to_go_to/", "score": 3, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I didn’t go to a concert with my friend after we had plans to go together because I thought seeing my other friend after a long time was more important. This might make me the asshole because I went back on our plans.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA \n\nHer mom didn't buy the ticket. You didn't sell the ticket. You said you'd take the hit for the ticket, so you take the hit for the ticket. \n\nHer mom doesn't have to buy the ticket because her mom didn't agree to go on the basis she was paying $400 for it. If you'd found someone to pay for it, her mom wouldn't have gone.\n\nIf you wanted to do something else with the ticket it was on you to make that happen with Rebecca.", "YTA. No one bought it. No one was going to buy it. You’re not entitled to your money back when you canceled so last minute and left your friend hanging. $400 plus hotel $$ is a crazy amount to spend on something you don’t even really feel like doing but that’s neither here nor there.\n\nETA: you say that she had to take her mom or else she couldn’t go… did you agree to be the one driving you both to the show? Because that doubly makes YTA.", "I mean, yeah, yta on this one. It is the equivalent of no one buying the ticket. Your friend just took her mom so she wouldn't have to go alone. You'll have to take the loss on this one because, by your own words, you ditched. Doesn't matter if you think your other friend is more important, you still bailed on plans you already made. Why even buy a ticket if you didn't want to go in the first place?  Take it as a learning experience and 1, be more honest from the get go next time or 2, don't bail on plans you've already made especially when travel is involved.", "Hmm, i think im leaning towards YTA. One you paid for the ticket and didn't turn up, so you have to take the loss of it, if you managed to find someone to sell the ticket to, then that's when you get your money back, but you didn't, so yeah, YTA.", "YTA because you ditched your friend when you had plans to go to the concert together. You are also TA for trying to get her to pay for a ticket that you couldn't sell after you ditched your friend.\n\nYour friend that came home from the mission is going to be home for a while and you could have waited to see that friend in order to go to the concert, but you chose not to because you wanted to go to the big party they throw when a mormon comes home from their mission.", "YTA if you think she should pay you back. You ditched her and if you didn't want to go from the beginning, why make the plan? Too bad if someone else used it. You broke your promise so she made due. Also YTA for breaking your promise. Don't promise if you don't intend to go. That this guy showing up was your excuse to ditch. You were planning to ditch her long before he showed up. Maybe she will smarten up and ditch you as a friend.", "YTA", "YTA. You told her you’d take the hit if you couldn’t sell it, and you couldn’t.", "YTA- for the simple fact that you said you would do something and you bailed. You are not a reliable friend", "You're not the AH for ditching, but I think you have no right to demand compensation for a ticket you were unable to sell.  YTA for that.", "I’m leaning towards ESH. It wasn’t really cool to abandon your plans somewhat close to the concert, but from the sounds of it, you had communicated your intention to do so at least a week in advance.\n\nYou did say you’d take the hit on the ticket if you couldn’t sell it in time, but that shouldn’t mean that your friend gets to use it without even asking you if she can, since you paid for it. Not really sure how others in this thread are perfectly fine with your friend basically using your money without even having the decency to ask you, just because you cancelled your plans.\n\nMy real question is, why in the world would you pay $400 for a ticket + a hotel to a concert you didn’t even want to go to? That’s an insanely high money and time commitment for something you weren’t very interested in in the first place.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (F19 at the time) had planned to go to a concert with my friend Rebecca (F19), around the same time our mutual friend Jason (M19), came home from his Mormon mission after two years. \nAfter some deliberation I decided that spending time with Jason was more important than going to a country concert that I didn’t even really want to go to in the first place. \nRebecca decided to go to the concert without me which was all fine until I found out she took her mom with her using my ticket that I paid over $400 for (she bought the tickets so they were all in her name but I sent her money to pay for my ticket) \nAfter the concert was over I messaged Rebecca to say that there was no rush on paying me back for the ticket but that the total amount was $400 (I had also already paid for the hotel but I let her off on that). \nShe then told me that I forfeited the right to the ticket when I left her hanging and that she had to bring her mom so she didn’t have to miss the concert. \nI had tried to sell the ticket a week or two before the event but wasn’t able to. I told her that if no one bought it I’d take the hit. But her mom used the ticket so I told her that her mom should have to pay for the ticket. \nRebecca disagreed because I said I was ok taking the loss if I couldn’t get anyone to buy the ticket. \nSo am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "How long of a notice did you give her that you weren't going to the concert?", "YTA, 100%.", "NTA\nI feel like there’s more to this story but I don’t think you’re the AH.  Rebecca didn’t own the ticket to give away since you paid her for it and her Mom should have paid to use it.  It’s basically stealing since it wasn’t theirs to use", "INFO, what were you planning to do with the ticket? And more importantly, did you tell Rebecca about your plans for the ticket? Another is when did you notice Rebecca that you're not going? If it's D-1 then I believe it'll be a whole different matter.\n\nFor now, I'm going with ESH. TA for Rebecca for taking the ticket without asking you first. And gentle YTA for you because well, if Rebecca was truly a dear childhood friend, surely you would've known her parents well, I'm not saying that the right move was to just gift her mother the ticket outrightly, while I see no problem in that, I'd believe not everyone would be okay with that, it is a nice gift for a friend, no? Also depending on when you cancelled the plans with Rebecca, you'd be even more of YTA if it was a day or so before the concert.\n\nI believe a good move would've been to communicate it directly, *before* the concert of what you wanted to do with the ticket to Rebecca. Perhaps a discounted ticket for the mother. And really, if you didn't want to go why not just tell Rebecca directly? No need for this fiasco to even happen in the first place.", "No, sorry when I said “couldn’t go” I should have said didn’t want to. She was the one driving and just didn’t want to go alone"]}