{"id": 5354, "submission_id": "zsg9qk", "title": "AITA for offering my brothers a place to stay and calling CPS on my parents?", "selftext": "I (28M) have been low contact with my family for a very long time, practically since I started college a decade ago, the only exception is my brother, let's call him Alexis (15M), who I've been writing letters to practically since I left, he's always been my baby boy and we were very close in those first few years of his life. \n\nA few weeks ago I got a call from him panicked out of his arse, apparently he's been left home alone with our youngest brother Jon (5M), for almost five months now. This isn't out of character for my parents, they've never been the most attentive, but I used to believe it was on me, they had me when they themselves were kids you see, and I figured they resented me for it, I realise now they just suck. It broke my heart he didn't have the courage to tell me sooner but I told him they'd always be welcomed at our home.\n\nMy parents' house is pretty close to our house, so I offered to pick my brothers up for a brotherly bonding sleepover, Alexis texted my parents for permission, just to make sure we weren't as likely to be accused of kidnapping and after they said yes I drove and picked them up, (I would have probably gone and stayed there or at least dropped off stuff regularly if they had said no).\n\nI got to meet my babiest brother!  He settled down surprisingly easy, my daughter is around his age which definitely helped. \nMe and Alexis got to have a few moments alone while he was settling down in the guest room and he just broke down, he was so exhausted and stressed from having to be an adult and care for Jon for so long. I couldn't be prouder of him but I'm so so sad and angry that he hasn't gotten to enjoy his first year of Highschool at all because of this.\n\nI asked a friend of mine who works with CPS what could be done and she recommended I keep them in my care with my parents permission and report the whole situation. So I did.\n\nTook CPS a bit to step in but there's finally been some movement, my brothers had to go back to my parents house for a bit. I've been told they either have to go to another adult in our family, which will have to be me, since our aunt's and uncles are back in our home country or go into the system, which I refuse to allow. That's where where at for now, dealing with all that.\n\nI thought I was doing the right thing but recently some of my friends from college are telling me I acted without thinking and could ruin my brothers lives as well as our parents'. And 2 of my aunt's have even come to visit and absolutely berated me for putting all of this on my parents, I've also gotten countless calls from family back in our home country calling me a selfish bastard.  I understand my parents have struggled a lot in their lives and I can see how my actions may absolutely ruin their lives but I can't just do nothing, still all this talk and especially my college friends have me anxious and confused so... Am I The Asshole?", "created_utc": 1671695706, "permalink": "/r/AmItheAsshole/comments/zsg9qk/aita_for_offering_my_brothers_a_place_to_stay_and/", "score": 2106, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I removed my baby brothers from my parents house and called CPS on said parents. Comments have led me to realise this could genuinely ruin my parents life quite literally forever, while they have not been the best parents I'm not sure ruining their lives like that is the right thing to do.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nI want to make sure I read this right. They left 15 year old to take care of a 5 year old for 5 months.\n\nI’m pretty anti calling CPS, but that is firmly in the it’s time to call CPS zone", "Hard NTA.\n\nA 15 year old should not be home alone with a 5 year old for 2 nights let alone 5 months. CPS should have been involved 4.5 months ago. Your brother is incredible BUT he should never have been in that position.\n\nYou did not ruin anyone's life. Your parents made a choice to leave a young teen in charge of a young child without adult supervision indefinitely. That was a choice and choices have consequences. Their consequence will likely be losing custody of their sons. \n\nFor your friends - tell them their attitude is the reason child abuse perpetuates. For your Aunts, ask them where they were and why they weren't helping your brother? Ask them why they think a 15 year old should be the sole caretaker for a 5 year old when both have been abandoned by their parents? Ask your family members back home if they plan on moving their to live in the home to care for both boys since your parents are clearly unwilling to.\n\nYou absolutely did the right thing.", "NTA Ignore those auntie assholes and other problematic adults. It doesn't matter if they have money you do not leave a 15 year old and a 5 year old ALONE for months. The parents will be lucky if they don't get a charge from the state for child abandonment and abuse.\n\nEdit: Where TF were these aunts these past 5 months? Not living and checking on the kids I assume.", "NTA 5 months? Fuck your family and fuck your college friends and fuck your parents, take your brothers in and good luck.", "Five months. 5. Your parents abandoned a 5 year old to a 15 year olds care for five months. Maybe you could have asked your parents to sign over temporary guardianship of the two to you, but if you didn't do something you would have been the AH.\n\nBoth of your brothers deserve to have stability in their lives. NTA- for calling CPS. There might have been \"better\" actions you could have taken but given what you were facing you've done your best.", "NTA, 1. Thank you so much for stepping up for your brothers and that Alex knows he can count on you. And thank you for relieving him of the stress so he can be a child and enjoy high school. \n2. Your parents should be jailed for this. This is child neglect and it’s abuse. Your brothers shouldn’t have to go through. 3. Your family and friends who tell you, you were wrong are clearly child abusive themselves. I’d reconsider those friendships because children should always come first. 4. CPS was the best to call, and I hope for your brothers’ sake they give them to you, because they stand a better chance.", "You did exactly the right thing. ANYTHING could have happened to those boys. You gave them a place of love and safety, which is exactly what your brother knew you would do; that's why he called you. Ignore friends and family who have berated you; the only people who are A H in this situation are your parents. If they get it trouble, so be it. They abandoned their children for 5 months. God forbid there had been an accident/break in/house fire etc and they'd been injured or killed, people's opinions would be extremely different. It's down to you that they're safe and well. You're a great brother and an amazing man to step up like this. Even as a stranger, I'm so proud of you- your brothers will never forget this. NTA NTA NTA", "NTA. You are an amazing big brother and you're doing a wonderful job.", "NTA. If your parents are really doing their best, they will be cleared. But if not, that's on them. I want to drill down on the really important part here:\n\n\\>   I've been told they either have to go to another adult in our family, which will have to be me, since our aunt's and uncles are back in our home country or go into the system, which I refuse to allow. \n\nThat's really bad. \n\nIn terms of CPS, that means that immediate safety concerns have been identified by the investigator. CPS is not just saying your parents are bad parents, they are saying that if your siblings are left there, they are concerned harm will come to them. CPS has basically said they are confident that if they take this in front of a judge, they are confident the judge will order removal of the children from your parents' home temporarily. This removal is likely just for a few days, depending on jurisdiction, unless CPS and the courts are concerned your parents will not or cannot address the safety concerns.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (28M) have been low contact with my family for a very long time, practically since I started college a decade ago, the only exception is my brother, let's call him Alexis (15M), who I've been writing letters to practically since I left, he's always been my baby boy and we were very close in those first few years of his life. \n\nA few weeks ago I got a call from him panicked out of his arse, apparently he's been left home alone with our youngest brother Jon (5M), for almost five months now. This isn't out of character for my parents, they've never been the most attentive, but I used to believe it was on me, they had me when they themselves were kids you see, and I figured they resented me for it, I realise now they just suck. It broke my heart he didn't have the courage to tell me sooner but I told him they'd always be welcomed at our home.\n\nMy parents' house is pretty close to our house, so I offered to pick my brothers up for a brotherly bonding sleepover, Alexis texted my parents for permission, just to make sure we weren't as likely to be accused of kidnapping and after they said yes I drove and picked them up, (I would have probably gone and stayed there or at least dropped off stuff regularly if they had said no).\n\nI got to meet my babiest brother!  He settled down surprisingly easy, my daughter is around his age which definitely helped. \nMe and Alexis got to have a few moments alone while he was settling down in the guest room and he just broke down, he was so exhausted and stressed from having to be an adult and care for Jon for so long. I couldn't be prouder of him but I'm so so sad and angry that he hasn't gotten to enjoy his first year of Highschool at all because of this.\n\nI asked a friend of mine who works with CPS what could be done and she recommended I keep them in my care with my parents permission and report the whole situation. So I did.\n\nTook CPS a bit to step in but there's finally been some movement, my brothers had to go back to my parents house for a bit. I've been told they either have to go to another adult in our family, which will have to be me, since our aunt's and uncles are back in our home country or go into the system, which I refuse to allow. That's where where at for now, dealing with all that.\n\nI thought I was doing the right thing but recently some of my friends from college are telling me I acted without thinking and could ruin my brothers lives as well as our parents'. And 2 of my aunt's have even come to visit and absolutely berated me for putting all of this on my parents, I've also gotten countless calls from family back in our home country calling me a selfish bastard.  I understand my parents have struggled a lot in their lives and I can see how my actions may absolutely ruin their lives but I can't just do nothing, still all this talk and especially my college friends have me anxious and confused so... Am I The Asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta you are stepping up for you brothers. Your parents and everyone who are saying you are, are assholes. Keep being the best brother for them", "NTA, never think you're TA when it comes to protecting your s=younger siblings and doing what's in their best interest. You did the right thing by calling CPS. Going L/N/C with any relatives or friends is probably best because you probably saved your brothers from a terrible situation. No high schooler should be subjected to parentification. I'm so glad your brothers are with you now.", "NTA. Where were your parents for five months to leave their son who isn’t old enough to legally drive to be responsible for a child? They do not deserve to have kids, and I note they’re not among the people calling you the AH in this. The ones calling you selfish, ask them how are you less selfish than the people who abandoned their kids?", "NTA but your parents are. Leaving a 15 year old for months to look after a 5 year old is child negligence and abuse bundled into one. Not sure what they were so busy with to go for months doing whatever shit they were upto. They don't deserve to have or keep kids as they dont have a single parenting bone in their body. Tell all of those relatives who call to get stuffed and to mind their own business as none of them were there for you when you or brothers needed them. So their opinion or advise is worth nothing as its easy to complain but a lot difficult to step into and take care of the situation.", "NTA", "NTA. You’re the hero they needed", "NTA. Leaving two children alone for 5 days is awful, 5 months is positively criminal.", "NTA you're a good brother.", "NTA former foster mom here. I totally understand the guilt. But you are doing the right thing to protect these kids. Those who don't know the whole story won't  understand. I've had people lecture me about \"stealing\" a foster kid from their parents, when that kid a) begged the state to take them out of their parent's abusive  home. B) got to choose my home from several options and c) had hundreds of nightmares that their abusive parents might somehow \"get\" them again and only felt safe enough to sleep if I was within earshot,  preferably sleeping on the hallway floor in front of their bedroom.\n\nMy point is strangers and college students and uninformed relatives might not understand you are doing the right thing,  but you are. They also won't have any idea what you and your brothers have been through. I hope you can get them some trauma-informed therapist. Good luck, you good man.", "Vehemently NTA. Any time doubt tries to creep in, or the silence of the night gives way to the voices of those who would say you've done wrong, I want you to focus on one thing: the memory of your brother breaking down. \n\nI'm sure the look on his face, as he cried from relief and exhaustion, is forever etched into your memory. The poor kid probably shook once he was finally safe to fall apart. You likely recognize the pain in his eyes, because it's no different than the eyes you saw in the mirror when you were his age. \n\nYour parents neglect is different this time, because you're in the position to be the kind of person you needed to intervene back when you were your brothers age.\n\nRemember those things, and never doubt yourself again. Your brothers need you.", "NTA. You are an incredible person for caring about your siblings. Your college friends (who are presumably educated and should know better) are useless immoral gutter trash for suggesting you abandon a 15yr old and a small child who have already been abandoned by all the other adults they should have been able to trust. You may well have saved your siblings lives. Never regret having the courage to be what was needed when every one else was a coward. That's the problem with your \"family\". Your courage to do right by these children highlights their failures as the adults to do right by you. Rather than face their own disgusting behavior, its more convenient to make you doubt yours. You did the right thing, and now they are faced with the shame of their inaction.", "NTA Your parents are in another country! They're not part of this conversation and their stance is based on nothing but, \"Respect your elders no matter what. RAR!\" I dunno what the fuck is wrong with your friends. How are you ruining your siblings' lives? Why shouldn't your parents' lives be ruined? Get new friends!", "His friends wouldn't step up because they wouldn't want to be responsible.", "My aunts dont live in the country, i dont believe they knew of the situation but I'm not entirely sure, from what i can see in my mum's social media she hasn't been shy about posting herself with friends and out of state. I assume they're just not fully aware of the story as they only have heard my parents side and dont know the full story. (I dont know it either, but my baby brothers where left alone for five months and i believe thats quite enought to raise concern).", "One of them could have gotten sick or injured, and it could have been a disaster. If Alexis was out of commission that’s no one who was looking out for him beyond OP, no one to take care of their brother who is utterly dependent.", "I don't have the full story as to my parents since i haven't been in contact with them in months, but from what i've seen on social media and what Alex has told me, our parents recently came into some money and have been visiting friends out of state, something of the sort.   \nMy aunts and stuff, who have been calling me selfish i believe don't have the full context, as they have recieved information from my parents.", "I would tell the family making noise the truth. I very much doubt at all that they knew or realised that your parent/s went off in July and didn't come back. I bet she told 15 that she was going for a few days and then just didn't come back. I'd guess she's done shorter trips out more than once. \n\n\"Just to make everyone aware , (name), my mother, left 15m and 5m at home. Alone. She left them in (July/August). If you fail to see the problem I want no further contact with you.\"\n\n\nCollege can be gone back to. They might be able to offer suggestions once you explain the situation. There are funds?/benefit schemes I think you can access for the boys. Not entirely sure as I'm not US based but I've seen them mentioned before in posts where similar things have happened. \n\nYou got this.", "NTA.\n\nLeaving two children alone for months to fend for themselves is not okay. You were completely right to step in and call CPS.", "NTA", "Nta. Your family are delusional. You aren't ruining anything, your parents are. Unless they work with children, even if both children are removed what difference will it make given they've been gone. Regardless of the reason it's not acceptable for your siblings to have been left for so long & thank God they have you.", "NTA. Your parents neglected your brothers, leaving a 15 year old in charge for five months. What would your “family & friends” be saying if something god forbid happened and your brothers died? Because it has happened. Neglect kills. Your parents couldn’t give a hoot about any of you. I worked child protection for seven years and you did the right thing. If your parents want to see their kids again they did to do a lot of work. Make sure social workers are aware of your history with them too. One thing I’ll leave you with, feel proud of yourself because your 15 year old brother trusted you enough to reach out. You keeping in contact with him means he had a safety net.", "NTA. Your parents are supposed to be taking care of and providing for your younger brothers. They haven’t. You did the right thing to protect them.", "NTA\n\n>And 2 of my aunt's have even come to visit and absolutely berated me for putting all of this on my parents, I've also gotten countless calls from family back in our home country calling me a selfish bastard\n\nWTF? So who should be responsible then? Putting all of this on your parents...Its your brother fault then? The neighbours, for not calling CPS earlier?\n\nYour parents are the only ones who should be taking care of your youngest brother. There is absolutely no excuse to leave your kids alone for a whole day, let alone 5 months. A 15 year old is no equipped to be a father. What your parents did is extremely irresponsible and stupid. Not only they should lose their kids, they should be facing criminal charges.\n\n&#x200B;\n\n>some of my friends from college are telling me I acted without thinking and could ruin my brothers lives as well as our parents\n\nRuining your brothers lives? What could be worse than they are already experiencing? They are already alone, and you are not going to let them live on the streets. Your college friends clearly shouldnt be in college...Im amazed by the stupidity.", "NTA your a wonderful brother and the boys are lucky to have you. Tell your family the boys were left alone for five months.", "NTA. Your friends are saying child abandonment and neglect is worse than your siblings living with you? Yeah right, they are trying to say your parebts shouldn't be punished for this! Also your aunts. This family seriously needs to be blocked and these friends should know a lot less about you.\n\nYou did the right thing.", "NTA \n\nInfo: why are your friends from college ok with literal child abuse? \n\nA 15 year old was left alone with a 5 year old. For 5 months. If even one single person in my life was ok with that and berated me for stepping in they would be out of my life so fast.", "NTA, wtf is wrong with your friends. You saved your brothers. Now get everyone into therapy!", "NTA. Leaving your brothers there and ignoring the problem would be ruining their lives. Your parents are just facing consequences for their actions", "NTA. Your aunts and other relatives can kind of be forgiven because they're likely only getting your parents side. Your college friends are complete AHs and need to be supportive or GTFA", "Your only mistake was not calling CPS while the kids were home alone, that would be faster to get them to your care NTA", "NTA\n\nYour parents are endangering your two brothers lifes! You are giving them a chance at a more normal child/teenhood. For sure, the whole process was bound to create rifts abd resentment in the family, but your brothers security is way more important than others bruised feelings.", "NTA, why isn’t the rest of your family not concerned about your brothers well-being?", "NTA, those that say you did the wrong thing ARE the AH and you should not give them the pleasure of your company.", "NTA. How can you possibly think you're TA here? Your parents belong in jail!", "It making them wonder if their shitty siblings", "One trope I don't get is \"people have been lied to and not corrected and I am enduring hostility rather than correcting them, this is horrible\"air your parents disgusting dirty laundry. They got some money so they abandoned their children to treat themselves? They belong in prison.", "NTA who cares if you ruin your parents lives they've already ruined the early parts of yours and already repeating the cycle and ruining your brothers' lives.  I fail to see how YOU ruin your brothers' lives with your so called \"selfish\" actions.", "NTA. How can your friends and relatives even be mad at you? Your parents left your two minor brothers alone for 5 months.", "NTA.  I personally have some trauma from CPS involvement as a kid but I think calling CPS in this case is absolutely necessary.   The fact that your extended family and some of your friends are saying you could ruin your parents' lives and they think that is more important than the incredibly unsafe situation that they put your brother's in speaks volumes. Your parents shouldn't even Ben allowed further custody of your siblings and should be forced to pay you child support IMO", "100% NTA.\n\n5 months? WTAF? I wish your brother would have told you sooner. You did absolutely right by them. You took them in. You called the proper people. Your parents' mistakes are on them. You did what you did to protect your brothers. I hope they are eventually removed from your parents and put into your care. Then, you know they will be well taken care of.", "Leaving children alone for 5 months should be enough to send your parents to prison. The major AH here is the justice system wherever you live", "NTA.  You are definitely doing the right thing here. Your brothers need you, to f-ing hell with absolutely anybody who says differently.", "NTA. Pretty sure leaving your children alone for *five months* is considered child abandonment. Like legally, they are considered to have abandoned their kids at that point. So far beyond the realm of \"okay\" and definitely the time to call CPS.", "NTA they abandoned their children", "NTA they abandoned a 15 year old and 5 month old, here in the UK That's illegal and both children would have been taken from them and they would be prosecuted for neglect. \n\nStay strong, you're doing the right thing for your brothers. Be your own sibling family.", "INFO: Do you mean he's been alone with 5M for five consecutive months with no parental supervision at all? Or do you mean that he has been forced to take over care as soon as he's home for the past five months?\n\nEither way NTA but the wording is vague.", "  Nta!!!! You did the right thing!   Ignore those calls and texts they’re all enablers", "NTA!!!! What you did is right. Leaving a 15 year old with a 5 year old for even a week is irresponsible. It actually hurt to read this and I feel bad for our brother. I hope he has a better life now where he's allowed to be a kid.", "NTA. I wonder why they even sent them back. I would've thought that's long enough for abandonment charges.", "NTA \n\nYour parents abandoned a 5 yo and 15 yo for months. CPS absolutely needs to be involved.", "NTA. Why didn't they just have them stay with you from the start?? \n\nIt's crazy that they were abandoned for so long and sad that your brother was too afraid reach out for help sooner.", "NTA. You did the right thing. Continue to look after them. You won’t ruin their lives. You have improved it drastically.", "\"friends\" told you what you did was wrong? They are not your friends. You're a good person and a real life hero. \n\nNta.", "Nta. 5 months??? I’m glad your brother felt he could tell you.", "NTA.  you did the right thing.  change your number. block everybody. tell your aunts to get lost or you will get a restraining order against them.", "Let's backtrack a bit here.   Are your parents working,  stopping in, caretaking?  I'm just confused as to how anyone would think you could be TA?  \n\nYou can't just leave a 15yo in charge of a house.  There are a ton of really good child endangerment laws for the exact purpose of not allowing this conduct.   \n\nNTA", "NTA\n\nWho leaves a 15 yo home alone to care for a 5yo.\n\nThat’s super irresponsible of them, you did the right thing.", "Lol there’s no way this is real. Absolutely no way. Literal children left home alone for 5 months and grown ass adults worried about other adults lives being ruined?", "NTA its inexcusable that they were left alone that long. As far as family and friends making you feel bad just remind them that they have their own business to concern themselves with instead of interfering with yours,", "nta, they basically left their teen son alone for almost half a year with almost a baby! Oh hell no!", "You did not ruin their lives. They are experiencing the consequences of their actions. All you did was give your siblings security, and any responsible parent should be grateful AF that their children are safe and with a family member.\n\nNTA, OP. Not even remotely TA.", "NTA \n\nYour parents were already ruining the lives of their children.", "NTA. How in the world do your friends think taking a parenting burden off a 15 year old and providing a safe home for him and a 5 year old would be considered ruining their lives? Turn a deaf ear to your complaining family. They've surely done similar things in their past. Just because \"This is always how we've done things\" doesn't make it ok that those things happened.", "NTA. You are being a good older sibling and saving your brothers from what is *literally* child abandonment.\n\nAlso OP: take it from one parentified and neglected older sibling to another: Please get yourself and your brothers some therapy if you're not already. Neglect is abuse just like physical or emotional abuse, and it's just as harmful.", " *berated me for putting all of this on my parents*  \nSo they berated you for putting parenting on your parents. Nice.  \n\n\nYou are not ruining your parents lives. Your parents, however, are in the process of ruining the lives of two of their children. You did the absolute right thing OP. As you saw, your 15 year old brother is breaking from the stress of being parentified. He needed you to step in, which luckily you did.   \n\n\nAnyone calling you selfish for protecting your brothers is an AH and I would recommend you go NC instead of LC with them. The selfish people here are your parents who had children they had no interest in raising and your family for supporting them in that.", ">I thought I was doing the right thing but recently some of my friends from college are telling me I acted without thinking and could ruin my brothers lives as well as our parents'. And 2 of my aunt's have even come to visit and absolutely berated me for putting all of this on my parents, I've also gotten countless calls from family back in our home country calling me a selfish bastard. I understand my parents have struggled a lot in their lives and I can see how my actions may absolutely ruin their lives but I can't just do nothing, still all this talk and especially my college friends have me anxious and confused so... Am I The Asshole?\n\nNaaah fam, you're a hero my friend. Your parents are completely negligent and breaking the law. They deserve to face consequences for leaving a FIVE YEAR OLD nevermind a 15 year old. You did the absolute right thing. Imagine your 15 year old brother trying to stay in school while he continues to care for a very young child. THAT was ruining his life.\n\nYour parents are assholes, regardless of their struggles. When you have kids, you have to work your shit out and figure out how to care for them. NTA", "NTA\n\nYou're a good brother. None of this was ok on your parents end. A 15 year old can't be responsible for a 5 year old for 5 months. That's insane.", "Definetly NTA like for real what else should you do, just take care of the kids but without the ability of doing the things that a legal guardian can do, that is just not sustainable and if the parents came home again they would probably leave again eventually or just not care yk like idk what you could've done different", "This. My god. Your parents made some horrible choices and cps is the way. Their actions have far reaching consequences. The kids probably need therapy and to learn what a normal relationship looks like. Good luck to you.", "Exactly. NTA. OPs parents ruined their own lives by making awful, cruel choices and ditching their kids. OP is just picking up after them, so that the two kids will be safe and cared for. Which is far more important than the parents egos. Whatever consequences they face will be well deserved and brought on by their own actions.", "Couldn't have said it better.", "I can understand the 15 year old for a week or 2. But him and a 5 year old. No, not even a weekend.", "Screen shot EVERYTHING!!  \n\nHard NTA!!  Your brother is amazing to have survived for as long as he did before breaking down and calling for help. I don't know of a single place in the United States where it is legal for parents to leave a 15-year-old in charge of a 5-year-old for more than 12 hours maximum! There may be some places, but I am not aware of them. If they do allow for longer than 12 hours, they sure as heck don't allow 5 months. That is child abandonment, that is reckless endangerment, that is the illegal everywhere that I know of in the US.\n\nTrust me, far more harm is being done to your brothers by being left in that situation then could ever be done to them by you taking them in.\n\nI am glad they have you, and my prayers for nothing but the best are with you them and your family. I truly hope that the state throws the book at your parents.", "Absolutely, in the UK where I live, your parents would be prosecuted and potentially go to prison for child abandonment and neglect. You are 100% doing the right thing protecting your brother's.", "Maybe sell it to your parents as \"look if they take the kids away from you, you don't have to worry about them and can do as you please. Like you are already doing.\"", "Talking of making cruel choices; why do they have kids only every double digit years? Is it so they have a fresh child to neglect? 28, 15, 5…..\n\nOP you are a good man. A good brother. You are not to blame for anything.\n\nNTA", "Yeah that sounds like a drug binge.", "NTA. Your parents ABANDONED your brothers for 5 months.  That's insane.  WTF is wrong with your college friends?  Are they braindead?  Do they think it's OK to leave a freshman in highschool in charge of a child for 5 months?  Is that their definition of good parenting? I mean I can see family who are out of country getting it wrong, family is weird.... But people who have not stake in the issue?", "Info: Where were they for 5 months?! do your parents have legal residential status? Did you ask them for legal guardianship and inform them you'd contact CPS if they don't voluntarily give it?\n\nNTA for stepping in and doing something. Nothing excuses neglecting kids.\n\nI ask the above because it really depends how I would think to handle the situation. If say they were illegal and had some insane situation kept them away - I would get their permission to take my siblings in without calling in authorities as a first option. I would definitely call it in if given no other option to remove my siblings from that environment. I would basically check that there's no way to get them out, because calling in authorities does have a long-term permanent effect (including employabiity etc.) - if there is a chance they can correct course or step aside from your lives I would usually opt for that given they are not doing the job.", "Hard NTA. Five months?! That’s complete abandonment. Parents don’t get to justify shitty parenting just because they had a hard childhood. They chose to be parents, so they should parent. Your brothers should be with you. Your friends also suck.", "NTA- you did the right thing and are continuing to do it. Keep taking care of your brothers, since your parents do not seem to understand that is their job as parents.", "NTA.\nThis situation is worthy of CPS.\nIf you are offered guardianship and you are able to take them in, do so.", "NTA. Your parents abandoned two children for **months**. They brought this on themselves, and deserve every ounce of misery they receive as consequence.", "NTA child protection opened a file, investigated and decided the children were unsafe in the home.\nThat shows you did the right thing.\nThe people saying you shouldn’t have called are telling you that you should have left your siblings in an unsafe environment.", "NTA. Where the hell have your parents been for five months?", "I am confused, how did you \"ruin brothers' lives\"?  You basically saved them from neglect.\n\nYou did the RIGHT thing and are protecting two innocent CHILDREN!\n\nStay strong.  Ignore your \"friends\" who obviously don't understand what it is to put a child first and block you extended family if needed.\n\nGreat Job Big Bro!\n\nNTA", "How did the 15y provide food and pay the bills for five months? There are some serious missing details in this story. Where did the 5y stay when the 15y was at school? How did they get to and from school and other places?", "What the actual fuck?\n\nNTA\n\nOK - my upbringing normalized my parents leaving us 4 kids at home alone for up to a week or so at a time, starting when us two oldest were about 12 and 13 (youngest 2 were 4 and 5).\n\nworked out fine.\n\nbut, even by my standards, 5 months, or even a few weeks, is way waaaaaay over the line.\n\nYou aren't ruining anything for your parents, they've done it to themselves.  You're being an amazing big brother, dude, seriously.  As one big brother to another, you're the hero here.", "NTA\n\n??? Where have your parents been? Are the travelling? Working? Partying? \n\nYour goal is to help your brothers, Thankyou", "NTA. You were absolutely right. Your parents abandoned a minor child to watch their other minor child. It’s neglect all around. As for the rest of your family, ask them why they’re not helping watch the kids if they’re so concerned.", "Kids first. Always. Always pisses me off when other family have to put their 2 cents in when they weren't present during the whole damn affair. Do right by your brothers. Your parents are adults and can figure their own shit out.", "NTA.\n\nKudos on you for stepping up to help your family.  Well done.", "NTA at all. A 15 yo should in no case be taking care of a 5 yo for 5 MONTHS. You are a great person and a brother OP.", "Nta you could have called the cops the day they stayed with you and reported them to the police for abandoning their children for the last 5 months and instead of CPS they would have had to deal with the cops first.", "Hard NTA. Who the fuck just leaves their underage kids to fend for themselves , for months no less? That's right, abusive ahs do. And who the fuck defends such ahs? Similar ahs or hypocrites or both. Your parents deserve jail time for what they did to you all. You have every right to tell those aunts to fuck off. Might also get new, better friends too.", "It's not your actions ruining all of their lives. It's THEIR actions causing all this.  NTA.  Quit making excuses for them, everyone struggles sometime in their lives for various reasons.  They made a 15 year old kid responsible for a 5 year old kid for almost 5 months.   That is abandonment and they don't deserve any children.  How could ANYONE support that?", "Totally NTA. In California, many people who interact frequently with children are mandatory reporters of child abuse. If a teacher, clergy member, scouting leader, or sports coach was aware that your younger brother was taking care of your youngest brother by himself, they would have had to report it to CPS. You clearly understand why. Parental neglect hurt you, and it sounds like it has been even worse for your brother.  \n\n\nAnyone who hasn't lived your life won't understand. Ignore them.", "NTA at all, you should not be second guessing yourself. Your parents left a 15 year old in charge of his 5 year old brother for 5 months!! Five!!!! They abandoned their kids, you did want you had to do.", "NTA\n\nYour parents left your 15 yr old & 5 yr old brothers alone for 5 months? They've ruined their own lives by their irresponsibility. Your have nothing to feel guilty about. This may be the wake up call your parents need to get their act together", "Your parents abandoned their children. You cared for them and reported the abandonment. There is no universe in which you are the asshole. NTA", "NTA. Keep advocating for your brother's", "\"Friends from college\"? Say that again, Friends from college\"? Unbelievable.  With friends like that, your brothers sure dint need any enemies. \"5 months\"? Say it again, 5 MONTHS HOME ALONE.\nYou ABSOLUTELY DID THE RIGHT THING. Your brothers are VERY LUCKY to have a loving, caring sister like you.\nNo, CPS shouldn't be called in every case. But this is not one of those cases.", "NTA.  Your parents left your 15 yr old brother alone with his 5 yr old brother for 5 months!  5 months - that's abandonment!  Did the 15 year go to school during this time - how could he if he was taking care of a 5 yr old?\n\nYour parents are the ones responsible for ruining their lives - not you.  Not only should your parents lose custody of your 2 brothers, they should probably go to jail.", "NTA. I think your relatives are more concerned about family shame and reputation than the actual situation.  \n\nIn what world is it okay for a 15 year old to be stuck caring for a 5 year old for months on end?? There’s much less sympathy for this situation given that they had you when they were young, and could have made other choices if they weren’t able or prepared to have more children… but they did. \n\nAs for your relatives berating you from their home country, there are differing standards here than theirs. It’s not acceptable here to leave minor children alone for months on end. Your parents could have also made different choices for childcare inc. Taking their youngest with them back to the home country for this extended visit while placing their middle child with you.", "By the way, I would call anyone a big time AH if they didn't call CPS in a case like this. Even a total stranger.", "NTA. Yes. It should be on your parents. They’re the ones who had kids.", "NTA", "NTA. anyone who thinks abandoning a child to raise another child for months on end is okay is an asshole", "How exactly are you selfish when your parents abandoned two underage children for months on end and had no intention of changing their ways?", "You did the right thing and don’t let ANYONE tell you otherwise, just hang up the phone every time someone starts to tell you that you are wrong.  You’re a great older brother to step in and care for your younger brothers, they will be much better off with you than your neglectful parents.  I’m sending you big hugs from a big sister to a very good big brother!!  This probably doesn’t mean much, but I’m proud of you for being so good to your little brothers.  Get them into therapy ASAP once they are in your custody.  If you celebrate the holidays maybe get them a couple gifts if you can to include them.  Wishing all of you the best of luck!!", "NTA. Your parents abandoned your brothers. Even if they kept in touch, even if they made their whereabouts known, they left 2 children to fend for themselves for months. They are not fit parents.", "NTA - a lot of people hate cps for their own reasons.  Cps exists to protect children and it's the mechanism you use to do it legally.  If cps thought they were safe, they would be left as they were.  It's obviously not safe to abandon a 5 year old to a 15 year olds care.  The 5 year old could fucking die.  How to drive?  How to get food?  School?  The list goes on.", "NTA... They were alone for 5 months?!?!?!?! That is not safe and not okay. Def should have called CPS. Your home is safer for the boys... And the parents ARE neglecting them. You aren't going to ruin their lives.. I would have done it anonymously tho", "NTA and you know this....you saw what the abandonment did to them. You are doing good here, keep it up. Make a plan though: what do you wish these 2 amazing guys would have? Go for it!!", "I csn't believe your brothers were left alone for 4+ months and cps sent them back to the parents.\n\nNTA", "NTA. Whatever your parents issues nothing has been done to change. The kids are being neglected.", "Nta. Your friends don’t sound like the brightest in the bunch. 🙄 I mean, do ANY of those people have any common sense? For 5 months your parents have been mia, & no one sees an issue with that?! Please, do not second guess yourself! You’re being the only responsible adult in your brothers lives right now. Keep doing what you’re doing! ☺️👍🏻❣️", "NTA, nor are your brothers. Everyone else is, though.", "NTA!\n\nYour brother called you for help and you're doing what your parents still refuse to do: act like responsible parents!\n\nGood luck!", "NTA, and great job on stepping up, it takes guts that i'm not sure i'd have if it were me. family/friends either don't know the full picture or are AH themselves", "NTA But I would go scorched earth on those friends and family members that think leaving 15yr old alone with 5 yr old for 5MONTHS is ok !!\n\nYou didn’t do anything bad for your brother , on contrary you showed him safe space and someone to lean on.\n\nI really don’t care about your parents cuz after all this yrs and three kids they still didn’t fully grew up, so what they had you when they were 16, they could play that card maybe till their 20th bday but not after!\nI had my son little bit after my 20th birthday and I knew full well how to behave a how to take care my kid…\n\nMaybe now they will realize, finally, consequences of their actions, but I doubt it, this is just how they are, and sooner to realize that so better.\n\nYou just take care of those boys and don’t mind anyone tell you anything else!", "NTA. How are you the selfish one. Your parents literally abandoned their children.", "Definitely not the asshole", "I think you could have handled it differently and you probably would have if you were educated on the corruption and outside agendas and possible other dangers that come into play when you involve outside entities like CPS. There are other monsters aka things that can harm your family beyond neglectful parents, that you and your family may have less control over. That you may or may not have opened the door to. As an adoptee in adoptee circles, I have heard horror stories. I personally would have involved cps a lot later…and only as a last resort after calling upon your family to resolve this together and seeking resources to assist everyone figuring out the safest remedy.", "The only thing that would be \"ruined\" by your personal actions would be your parents' social standing as they're already ruining their two kid's lives with their neglect. NTA and good for you.", "You are NOT an ass!  You and your brother have stepped up!  Good for you!", "NTA, who in their right mind would leave a 15-year-old to take care of a 5-year-old? The 15-year-old needs to go to school then who's taking care of the 5-year-old? The parents brought it on themselves and tell the rest of their family go stick it. Where did they go for 5 months? If they don't have money it can't be vacation if it's for a job, why didn't they bring them? The whole situation is weird but yes not only called CPS but the cops also for child abandonment.", "NTA. Your parents abandoned their children for five months. You did the only thing you could to protect your brothers.", "NTA\n\nPlease continue to do what is in the best interest of your brothers. Staying with your parents is not in their best interest.", "NTA.  You stepped in to take care of your brothers.  Your parents left a 5-year-old with his 15-year-old brother for 5 months...5 months.  A teenager should not have to deal with their parent's inability to parent properly.  If they needed help with the kids, they could have asked you or anyone else in the family.", "So uh, you remember why you went NC with them now. You are NTA and you did the right thing. Give that brother of yours a childhood! He'll be so grateful and I'm sure he'll pay it back in ways you never imagined.", "NTA, Your \"friends from college\" are talking out of their butts and the random family calling you \"selfish\" have a lot of nerve sticking up for people who abandoned 2 underage kids. \n\nKeep looking out for your brothers. Your parents lives or feelings are fully irrelevant.", "NTA. They neglected their children for five months. You did what was best for the kids.", "In rural China, adulthood is reached well before 15yrs of age. It's incredible how different cultures vary in maturity.", "I think the aunts are just mad OP outed the parents as terrible parents", "While I mostly agree with you - minding the 5 year old for a few days alone is no big deal, generally.\n\nAt that age, my sister and I were capable of taking care of ourselves and our little sisters for a few days perfectly well.\n\nWhich we did a lot.", "Why do people on here think teenagers can't be left alone for a day or 2. You can legally watch babies at 12. I agree with the rest of your comment but I'll never understand the mentality that your kids need constant supervision well into their teens.", "OP. what your parents did is disturbing and terrifying. Your parents should never be allowed to be alone with children again. Block family from back home and get better friends.", "CPS is an imperfect solution, but cases like this are literally why it exists. OP made the right call", "God, thank you, your words have been so kind, so reassuring in a way the rest of them can't be, thank you, knowing someone understands the stress of all the external people judging what they don't understand is so so calming. Have a good life kind commenter.", ">If your parents are really doing their best, they will be cleared. \n\nThat's not how anything works. If THIS is their best, they will lose custody of their kids, probably permanently. Abandoning your children for FIVE MONTHS is potentially prison time, not a slap on the wrist.", "I clearly have a lot of research to do, it's been a bit of a stressful whirlwind so I haven't sat down, I'll have to look into what happens with cases like this. And general CPS actions lol. \nShould my parents be unable to address the safety concerns properly, do you think the boys would be removed permanently from our parents house?", "A lot of replies have been very reassuring, but this one really made me think, I was so worried I'd ruined my parents I didn't even stop to consider that I shouldn't care for that, there's a reason I'm LC with them, and I need to put my brothers first kid, god, they're kids, they're kids, they're so fucking young, Alex looked so small when I picked them up, I could see him just relax as we got farther from that house, Jon did too, but I think he's still too young to really understand the situation.\nAnd then when he was finally in a place where he could let go, where his baby brother couldn't see him he just broke, it was the moment I knew I couldn't look this over, I had been pissed since before but my boy was sobbing, fucking shaking so hard and he just, melted into my arms and clinged to me the second I hugged him, he told me this morning it was the first hug he had in months if not years, I just about broke right there, he's my boy, my baby brother, the absolute light of my life. I should have been there sooner, I should have saved him so much pain.", "They've been practically home alone for five months, Alex says my parents would come by once or twice a month and he started panicking since they haven't come by this month, that's why he called me, It scares me to think if they had just shown up once he wouldn't have called and would have let it continue.", "My parents have been, basically on holiday, probably a drug binge, they had been stopping by occasionally (once or twice a month). I believe my family doesn't really understand the situation, seeing as they heard the story from my parents first and they live so far away, if they do, this whole neglecting your kids thing is probably something a lot of them do.", "The main friend who has been vocal has a lot of trauma with the system, she told me she'd rather have to raise a kid at 15 than go into foster care. I'm not sure what the rest of them have to it but I think that at least explains the main issue here.", "I'm not full on the details of where they were, Alex told me theyd drop by once or twice a month for a couple days then leave again. From looking at their public social media theyre visiting friends, someone pointed out it sounds like a drug binge, but they have no history that i know of (to be fair ive only ever called them about 5 times a year ever since i moved out for college so who knows what has changed in the past decade).   \nMy parents do have legal status, we moved here about 13 years ago through legal channels and all four of us have a legal citizenship (Jon was born here). \n\nI didn't call my parents first, ill admit thats a big mistake on my part, i was concerned i could be accused of kidnapping. Ishould have asked to be transferred legal guardianship, it would have been the most straightfowrward course of action. I doubt theyd be able to get their act together, they did it on a small scale when i was 17-18 and it seems to me like they have been gradually building up to this.", "I genuinely need to step away from these friends, one of them has some trauma from being in the system so I understand her point of view, it's what got me to overthink my actions in the first place. My husband's been wonderful and talked me through a lot of the doubt, he was in the system for about two years because his parents were unable to take care of him and his sisters, and he's convinced me I'm absolutely in the right.", "My parents would drop by \"once or twice a month\" from what Alex told me, leave him some money, id assume they were paying the bills remotely as he didn't bring that up, auto pay is a thing. I'm not equipped with the full story mainly because i didnt want to force him into talking about something so stressful, but from what ive gathered, my parents have been away for weeks at a time doing whatever it is they do, they come by for a couple of days and live in the house, then leave again. Part of the reason he even called me was because they hadn't dropped by for the month and he was scared he'd run out of money. Alex was not paying the bills, he was not paying for the food, at least monetarily, they were covered. They did this with me on a smaller scale too, dad would have \"buissness trips\" and take mum with him, theyd leave me more money than i knew what to do with, and leave for three days to a week.", "Fair if you don't believe it, I honestly just don't believe my family have the full story, because I cant see any other reason for their thoughts, being so far from us there's no way in hell they know the full story, I'm not sure what my parents are even saying to them. I've been focusing on the boys, but I'll need to pay a visit to my aunt who is still in the country and talk soon.", "I beileve this is very temporary and they'll be officially out of their care asap, theres just certain steps they have to take and since my aunts are in town there is another adult who can watch them temporarily. Hopefully the whole thing ends soon I really want the boys to be safe and in my life if possible.", "Cool story bro", "NTA 5 months? Fuck your family and fuck your college friends and fuck your parents,", "That makes me sad for you. My kids are 15 and 11 and I would never leave them for a few days alone.", "What country does your family originate from?", "Glad it is helpful! It is very stressful to do the right thing, the hard thing,  and then be blamed and judged for it! It's one of the worst stresses there is.  But you gotta shrug it off. The kids know, and you know. Nobody else's opinion matters. It always helped me to imagine being a lighthouse. The waves keep bashing it, but you are the safe still place, lighting those little boats home.", "CPS is, in general, completely overwhelmed. They don’t do anything unless a situation is extremely serious and sometimes not even then due to lack of resources. If they ordered immediate removal they consider the situation potentially life threatening. \n\nDon’t hesitate to correct meddling family. Your parents didn’t leave your 15yo brother to care for your 5yo brother for an evening. They straight up abandoned the kids. They deserve whatever fallout happens.", "Even a 15 year old shouldn't be left for \"a week or two\" under most circumstances, but it would be unlikely to have serious consequences. But leaving a 5 year old in the custody of a 15 year old for more than a single day babysitting job is outlandish and illegal in the United States.", "I stayed home for a week at 15 when I was a kid, but:\n\n1. It was just me, my brothers went with my parents (I opted to stay home and work).\n2. My aunt lived a 5 minute walk down the road.\n\nThat poor kid was in charge of a 5-year-old, not an easy task at the best of times, and had ZERO backup.  Absolutely heartless and irresponsible.", "CPS should've been called long ago. Your poor brothers.", "Yea but they're not going into foster care, you want to take them right?", "Well I think first and foremost don't look at this as a police record type authorities - talk to CPS and your parents. Suggest they transfer guardianship to you etc. I think normally there would be intermediate steps anyway. You blared the alarm, but it doesn't mean there's a fire if your parents and family don't turn it into one (a s\\*\\*tshow).\n\nYour parents and family need to put aside any personal offence/shame/feelings and see it simply:\n\nYour siblings do not deserve this. Your parents will now have the space and time to do as they please and what they need to without worry. Your brothers will be cared for. If everyone supports this process, and nothing crazy happens - it will pass and the case can be closed with everyone's best interest in play.\n\nRepeat until it sinks in or they can F off cause CPS would likely support you here. NTA - good luck. They are lucky to have you now.", "Thank you for cleaning that up?", "I think this is overly harsh - none of these young people should have to deal with this kind of bs.", "You sound like a helicopter parent, why haven't you raised them to be able to take care of themselves for a couple days by 15?", "Definitely doing this, probably gonna post in the mass family group we have on FB and the group chat as well as tell whoever's called me, I don't want to be associated with them if they believe this is okay.", "You'd be pretty much totally wrong.\n\nThere is no law, so far as I know, dictating the minimum age for leaving children alone.  Not in Canada, Not in the UK, and, evidently, not in Kentucky.  couldn't find anywhere that mandates 15 is too young.\n\nThe important point is whether or not it put them at actual risk.  So, really, it would be a case by case thing, but 12 hours isn't an issue.", "I'm half-mexican, half-colombian, I lived in México until i was 14. These aunts are colombian tho.", "It is pretty odd lol, I understand the gap between me and Alex, they were 16 when they had me, so waiting after that is understandable I think. Not sure abt Jon tho, we were already LC before he was born and I didn't actually get to meet him until now, I'd assume they wanted a new toddler for family postcards, or something.", "Honestly that's what I'm thinking, it'd be ironic because when I was a kid they were aggressive catholic and hated anyone who consumed anything, 10 years can change people though and it's the only logical explanation I can see for that.", "At 15, you can be alone for a week, no problem.\n\nAnd, no, living a 15 year old alone for a day is not illegal.  there's no minimum age to leave unsupervised children alone.  the qualifier is risk, not age.", "Yeah, around the time I turned 15, I didn't want to go on vacation with my parents anymore, because I was working and needed to make money for buying stupid teenager shit.\n\nSo they'd stock up the fridge, give me $200 for other food or takeout, and go away for a week. But also, I wasn't taking care of a sibling.", "I'm taking them in 100%. Shes a bit irrational in all honesty, her main belief is that i will not be taking them in because id be unable to adopt them, which is true, id be unable to adopt them because as far as i understand if a parent still wants the kid, no matter how unfit they are to care for them, you cannot adopt the kid. This is stupid and nonsensical and im definitely reconsidering my friendships lol.", "NTA. I’m former CPS. 98% of the time I read “call CPS” in this sub, my eyes roll back into my skull. \n\nThis is the 2%. You’re a good person for intervening.", "INFO; How did a 15 year old take care of a 5 year old for 5 months, on his own??? At that age, he doesn't drive or doesn't have access to a car and likely doesn't have a job.\n\n1. So how did he get groceries for them?\n\n2. Who watched the kid when the 15year old was at school?\n\n4. How did the the kid get there?\n\n5. How did no one notice that your parents haven't been around in FIVE MONTHS?\n\n6. Why did your brother not say anything for to you for five months?\n\nI'm sorry, but this whole post sounds very fishy at this point.", "NTA... So your allegedly adult friends think is fine to leave a 5 years old child with a 15 years old high schooler for 5 months? Get away from those people. They are as bad as your parents .", "NTA at all, 5 months is so long to be alone with a baby. Isn’t is also illegal since he’s a minor?", "Ignore everyone giving you flak for this. You are absolutely doing the right thing.\n\nNTA", "NTA!!! You're taking care of your siblings. And the way you talk about them is so sweet! \"I got to meet my babiest brother!\" You're a great brother and I'm glad your siblings have you to watch over and take care of them.", "How are you ruining their lives? Your friends are not very bright. Do they believe a 15 year old taking care of a 5 year old with neglectful parents hasn’t already damaged their lives? NTA", "> I couldn't be prouder of him but I'm so so sad and angry that he hasn't gotten to enjoy his first year of Highschool at all because of this.\n\nU have a good heart OP. Never loose that. \n\n\nNTA", "NTA. They left a 15 year old to look after a 5 years old, with no timeframe for when they would come back. It was only 5 months because your brother was brave enough to call you. Absolutely criminal neglect", "NTA - It's disturbing that you have so many people in your life defending your negligent parents.  They left your two minor siblings alone for 5 months!\n\nBlock anyone giving you a hard time about this.  You are doing the right thing.  You are doing what's best for your brothers, that's all that matters.  Everything else is just noise that you can block.", "NTA!!\n\nThank you for stepping in! You absolutely 100% did the right thing.", "I literally don’t care what is going on in their lives there is no damn excuse to leave a 15 year old on charge of a small child alone for almost half a year. What if something happened and they couldn’t get in touch with the parents what if both got sick or literally anything else happened. He’s a child it’s not his job to carry that weight on top of school and any other responsibilities. This is exactly the kind of shituation we have cps and DCF for. Thank you for stepping up and being a great brother.\n\nNTA. You are a wonderful human being.", "NTA. Leaving a teenager and 5 year old alone for MONTHS is insane. There’s no excuse for it. None. That’s abandonment and neglect.", "NTA you need to watch out for your brothers or no one will. Obviously your parents are going to. Now if you got a phone call from your brother and then you just called CPS and ignored your brothers he would be an a****** but you were trying to step up and help your siblings I have a better life.", "NTA. And no one else is qualified to tell you that you are when they aren't contributing to help. Do they want to adopt 2 children for free? No? Well they aren't part of the solution, are they?\n\nIn fact, they are definitely a part of the problem if they think your parents should be given a pass after they failed on being decent parents to you and continue to do so with your much younger siblings.\n\nLet it be clear, your siblings weren't just neglected, they were abandoned for 5 months. \n\nThey don't get to accuse you of ruining anyone's lives when you are the only one there to do anything to stop the neglect and abuse. They don't get to tell you that what you are doing is wrong or terrible when they aren't doing anything to help.\n\nYour siblings didn't choose to be abandoned. Your parents did. So until the other adults start behaving responsibly, they don't get to tell you, an adult who is trying to fix the issue, that you are wrong.", "NTA. NTA at all. By god, I feel so sorry for your brother. I cannot imagine the stress of being in that situation. This is beyond parentification. Beyond neglect. Beyond abandonment. What your parents did it's just.... This is just pure evil. \n\nOnce you get custody of your brothers, please see about reaching out to a lawyer in order to open a civil case against your parents in order to get financial compensation. Put that money into a trust for Alexis and Jon so that they have it for whatever needs they have. \n\nAnd please see about getting Alexis in to see a therapist ASAP. \n\nI am so sorry you're all going through this and I hope things get better soon.", "NTA.  You are doing right by your brothers.  You are not ruining your brothers' lives, you are saving them.  The ones berating you should have stepped up.   Your parents abandoned them", "NTA!!!!!! TAKE YOUR BROTHERS IN AND KEEP THEM!!! Shame on your \"parents\" that's not parenting, that's just breeding", "NTA. I’m not clear on why everyone so worried about “ruining” your parents’ lives and no one apparently cares that they are ruining your brothers’ lives? Why do your parents matter so much more than their children? Also, sounds like your parents are doing an excellent job of ruining their own lives.  That’s happened whatever you choose to do.", "None of these other people, friends, family, understand the situation the way you do. Looking in from outside is so different than living it. OP, keep doing what you're doing. NTA.", "NTA. How will this ruin their lives? Sounds like they don’t want to have custody of their kids so it should be a win win.", "Hard NTA for reasons everybody else has said. Something had to give; better the grown adults than the kids. I cannot believe your family and friends aren't in your corner here. Unreal.", "NTA. Who cares about your parents lives, what about your brothers'? Protect them at all costs. OP", "NTA you’re protecting your brothers as you should if your aunts really cared they would’ve stepped in a long time ago", "NTA\n\nYou didn’t “put this on your parents”\n\nThey made the choice to neglect and abuse their children and are now facing the consequences of doing so. \n\nYou absolutely did the right thing! Your brothers are lucky to have a brother like you.", "NTA. Alexis is 15! Caring full time for a 5 year old sibling. For five months! How were bills being paid? How were the kids getting groceries? I am not sure how things run where you are, but here high school kids (15 year olds) and kindergarten/first graders (5-6) actually have different start times at school. So how was your brother handling that? You absolutely did the right thing and you can tell everyone worried about your parents, \"where the hell were you when these two children were left home alone for 5 months?\"", "NTA. 5 days is too long. 5 months is absolutely abhorrent. You know your NTA because CPS doesn't just take kids away. They are mostly a source of help and guidance so families can stay together. If the kids are being taken away, then it's really bad. You did the right thing, and anyone who says differently is a foolish AH", "NTA- I don’t understand your college friends- what was their suggestion? Do nothing? \n\nAnd unless your family members are offering solutions I would ignore them too. \n\nYour parents were abandoning their children. You have my fabricated this and CpS would only do something if it was warranted.  \n\nI really hope you, or your noisey aunts, are stepping up to look after your 5 year bro though.", "NTA. You didn't call CPS over something Petty. You took charge and helped your siblings, and had to go through CPS to ensure that they would have a safe and bright future. You have done nothing wrong", "NTA. i wish i'd had a brother like you.", "NTA and anyone who thinks it's OK for 2 children to be left alone for 5 months needs their heads examined. Your parents don't get a pass for having you young. What is their excuse now? If they wanted to party, they should have stopped with you. This situation is EXACTLY why we have CPS. This gets the kids in a safe home and makes your parents pay money toward that safe home, so it doesn't come 100% out of pocket.", "NTA. Family doesn’t get a free pass when it comes to neglect/abuse/being in the wrong. You’re doing everything right. If you ruffle feathers of your parents or family that’s on them, not you. It’s completely okay to cut them out unless they make significant changes in their lives and choices.", "NTA- Leaving your children for months on end is highly irresponsible and your extended family has clearly been enabling this behavior for years. Additionally, your college friends aren't considering the well being of your underage siblings.", "Some additional information since I realise I've left some questions, not answering all of them because I value the boys' privacy and if Alexis was barely comfortable telling me, then I'm not telling the internet.\n\n_How were they paying the bills?\n_I don't know the details, but Alex didn't have to worry about it, auto pay exists, I'm assuming that's the solution here.\n\n_How did they get groceries/the money for them?\n_Our parents would drop by every so often, once or twice a month, and leave him money. They live in a pretty closed neighbourhood and have a few smaller shops nearby, Alex and Jon would usually walk to the stores since it was a fine walking distance even for a toddler. This is something they have a history of doing, from when I was 17 to when I moved out for college they would occasionally leave on business trips and leave me with more money than I knew what to do with and a young Alex for a few days at a time. I thought this behaviour stopped, clearly it didn't, I really regret leaving when I did, maybe I could stopped this if I hadn't ran off as soon as I could.\n\n_How did Alex go to school?\n_Not sure on this one, he hasn't told me much about this and seems closed off on the subject. I'm assuming either he didn't go to school, or he left Jon somewhere or with someone who he's not comfortable with. This is greatly concerning.\n\n_Did people not notice your parents were missing?\n_Proably, Alex was never asked from what I know, not much info on this either, sorry.", "NTA, you are Amazing!", ">I thought I was doing the right thing but recently some of my friends from college are telling me I acted without thinking and could ruin my brothers lives as well as our parents'\n\nOP your friends are horrible enabling people or just anti-'guvment' idiots. This was child abandonment and major abuse. You did the absolute correct thing. Good on you, NTA", "Doesn't the post say the youngest brother is 5 *months* instead of years?  Like, it seems like they popped out a kid, dropped it on Op's brother, and disappeared!\n\nIs there a clarification comment or something, because man, that's wild.\n\nNTA of course.", "Agreed!", "Question, as someone who is anti calling CPS, can I please have your input? I recently called CPS after a relative told me their parent tried to strangle them. It has been stressful for the kids but relieving to have someone finally listen to them and take steps to help them. I know in this case, CPS is absolutely warranted. What cases are they not warranted? I feel like it's a very extreme option to take, so why would anyone want to unless it was the last given option?", "“ sleeping on the hallway floor”… you are an incredible person. Thank you for what you’re doing for the kiddos in your care.", "Doing what I wanted someone to do for me is, I think the best course of action here.", "Thank you for saving me a lot of typing. 🥹\n\nNTA OP.", "Bruh they should not be allowed to procreate anymore,  and with how outrageous they act I wouldn't put it past them trying one more time.  Jon will need to learn how to take care of kids, too, right?", "5M means 5 year old male.", "Some people have a worldview that if you aren’t raising your kids the exact way they want, then it is abuse and the government should get involved. \n\nI’m a mandatory reporter at work if certain things occur in my presence or are admitted to me, it’s a whole big detailed list of when and how I am required. I’ve had to report before. \n\nBefore reporting you should make sure you are reporting for actual abuse as defined in your locality, not for reporting things you culturally or morally disagree with. You should be reporting suspected abuse, not suspected moral outrage", "And you’re a fantastic brother. Wishing you all of the best in life!", "In the jurisdiction where I was a CPS investigator, it takes six months to establish abandonment rather than simply neglect. Severing parental rights from ANY parent is challenging. \n\nI was allowing for philosophical doubt. I don't have any reason to doubt OP's account at all, I'm just pointing out that if you report someone to CPS and they are cleared, you still haven't harmed them.", "You can also try and convince your parents or a judge to give you permanent guardianship,  \"so the state doesn't take the kids away\". It is less of an ego blow to the parents than terminating their rights and adopting the kids, and less hassle too.  Try to find a lawyer to help, maybe a pro bono lawyer. This process can usually be done without CPS involvement, and CPS is usually thrilled to get a case which costs them $$ , off the books. It's an agreement between you and their parents to voluntarily give up custody to you. \n\nIt's not as fool-proof as adoption, because the parents can keep challenging it. But they sound so neglectful and disorganized that its hard to imagine them mounting a successful case.", "depending on jurisdiction, permanent removal usually takes six to twelve months. It can take two years if the judge is sympathetic to the birth parents and allows them some extensions and second chances. What you can expect is numerous opportunities for the birth parent to try and do right, and sadly, in a number of cases, failing to do so.", "I just want you to know you are kind of my hero for what you are doing.\n\nNTA\n\nYeah, stop caring about ruining your parents lives. Besides, you aren't the one doing it. They are when they decided to think of themselves before their children and acted so irresponsibly.\n\nI would think about seeing a lawyer and getting custody of your siblings and payments from your parents. Don't know if it is a thing but you should look into it.", "That's you.  I'm not sad about it.  For us - it was actually pretty fun.\n\nWe were raised to be able to cook and handle stuff, and it's not like we didn't have access to help in case of an emergency.", "It makes me sad for your kids that they are not trusted and able to be independent! Yes, kids need their parents, but they also need space to grow up!", "Thank you, I'll see if this can be done, it genuinely feels like a better option to get my brothers safe as fast as possible.", "There is a huge spectrum between helicopter and negligent. They stay at home for a few hours when need be. They can both cook a few things. Do chores \n\nWe also live in a country where family is much different than the US, for example. Kids tend to leave at home at least until finishing uni. Teens also aren't expected to get jobs.", "Keep us all updated, you've got a whole bunch of redditors outraged on your behalf :) \n\nHave a good Christmas dude.", "Hell yeah", "Where the f were they for 5 months? How did the 15 yr old pay bills, cook, clean mind the child and attend school?", "Hypocrisy is a hell of a thing", "Thank you, I will, I'm going to visit my visiting aunt tonight. Will also be talking to CPS and my parents soon to see if I can just get custody transferred since it'd be the most streamlined way of getting them in my care. \nI'm hopefully gonna get my brothers some nice presents, perhaps if my parents decide to show up I can talk face to face with them too, but mainly it'll be me, my husband, our kids, my brothers and my aunt this Christmas, unless she defends my parents after she knows the full story.", "I still don't know where they've been fully, their social media looks like theyve been out visiting friends, not sure on that at all though. They would drop by once or twice a month according to Alexis, leave him with some money and stay for a few days then leave again. He didnt mention bills, but id assume they were probably on auto pay, my parents arent hurting for money at all. I absolutely believe him on this, when i was 17 and 18 they would leave alex with me for a few days at a time, and leave me with more money than i knew what to do with, i shouldn't have expected them to be responsible after that.", "OP? Your friends from college are likely doing the whole privileged idiocy reaction “never call the police or CPS because they ruin lives”.  I’ve seen it a lot lately more lately from the younger crowds. They either had good lives and don’t understand m, or they had bad lives and have resorted to magical thinking. \n\nThey think that calling CPS/the police will only end badly, and that it’s better for kids to be beaten or neglected with their parents than be taken away. \n\nJust ignore them. And stop taking to them.", "Something to also consider with this is \"calling cps is bad\" is generally an issue of \"sometimes the foster system is worse than where they are\". While seperation can be inherently harmful to children on some level, the children are already separated from their parents. And you're willing to kinship foster so they won't be \"in the system\" in the dangerous sense.", "Whoa, whoa, whoa.   \nA 15 year old left in charge of a 5 month old for around 5 months, and there's even a question in anyone's mind that you're in the wrong?\nIs your entire family on drugs?   \nNTA. Definitely NTA.", "Nta I been in your shoes trust me CPS was the best it could get your family the help they need", "NTA. NTA. NTA. Holy shit NTA.\n\nThe line for calling CPS is when the child asked for help. Period. Anyone who is giving you shit are trash and don't care about those boys. Get custody of them if you can and disown the toxic family.", "You are amazing!!! Hard NTA😘😘", "NOPE!! You're looking out for your sibling's best interest where your parents have never done. NTA and you're a great big brother for taking them in!", "Your parents deserve to have their lives ruined, because they are awful people, NTA, and thank god your brothers have you.", "I don't understand exactly how this all works, but I imagine that calling CPS makes things easier for you and your siblings. If you are the legal guardian then you are possibly able to do important things that your parents are supposed to be taking care of. This could come into play in medical settings or enrolling in schools etc. If parental consent is needed for something immediately necessary, and you don't know how to get in touch with your parents, that could be really bad. So, if going through CPS results in you having more rights as their guardians, then that was not only the right thing to do but also the smart thing to do. Leaving your 15 year old and 5 year old alone for 5 months and checking in randomly every month is abuse. Anyone who tells you differently is gaslighting you and you don't need to defend your actions to them or even speak to them. If they aren't offering anything helpful, tell them to kick rocks.", "NTA - also, get new friends", "NTA\nThey left their underage children alone for 5 MONTHS. The people who are saying your going to ruin your parents lives you should seriously consider if you want them in your life because they would rather have your siblings in the custody of your neglectful parents. \nYou are doing a great thing by not only taking them in but by reporting your parents because they should never have custody of a child ever again.", "NTA.\n\nThey did decide to have 3 kids. I get messing up as teens even if I don’t codon what they put you trough but now? What is the excuse to left two kids home alone for 5 month? \n\nEverything that happened was their fault. Good luck with the cps things. You did the right things you saved your siblings. Also there was a risk to go in the system only if you have decided not to keep them. But this isn’t happening.", "NTA - having a 15 year old care for a 5 month old for 5 months does not qualify as  \"inattentive\",  its neglect.  How anyone can state that what you did is selfish is beyond comprehension.  You didnt ruin your brother's life...my guess is you saved it.", "They were gone for 5 months and left a kid (the 15 year old) to take care of another kid?\n\nWhere I'm from, they wouldn't get a second chance, especially if you testified they did the same to you. \n\nYou're not ruining the kids' lives. Imagine if an accident or an emergency happened. A 15 year old is not mentally equipped to deal with a house fire, someone breaking into the house, or an injury. Nor is the 15 year old able to consent to emergency surgery or services. \n\nThis is abandonment and neglect, plain and simple. \n\nThe people insulting you clearly still live in the stone age when people regarded kids as property and didn't care if kids died. \n\nNTA. \n\nAlso, what the crap are your parents doing where they have kids, then abandon them for 5 months?", "Their reactions are just weird!!! You did good. So NTA.", "NTA\n\nYour friends are saying your brother's would be better off in a house alone, raising themselves?  JFC, you need better fiends.  \n\nWho cares about your parents?  They don't deserve a thought.  I hope their lives are ruined.  That would be Karma.", "Sadly, I've met worse parents than yours. That said, you stepping in now MIGHT be able to mitigate some of the damage already done to the 15yo, and minimize it for the 5yo. But there will be damage. Get them both into therapy asap so they can work thru their experiences and feelings about them.", "NTA please keep doing what yoire doing and give your brothers a good home! You and your wife are excellent people, thank you for helping them!", "NTA...get a lawyer and get those kids to you.   Block all the haters, you are doing the right thing.", "Very brave of your college friends to call you 'selfish' when their stake in the situation is very low and yours is so high. You've done the legally correct thing knowing you'll be asked to take them in and you're willing to take them in. I honestly don't see how anyone would be saying anything other than 'how can I help?'.\n\n&#x200B;\n\nIt's so interesting how we want to give other kids the childhood we didn't have. Your brothers are lucky to have you.\n\nETA. NTA obviously", "NTA. Where the hell have they been for the last 5 months?", "NTA they left a fifteen year old home alone for five months.", "NTA", "NTA, F your parents and your extended family, how come they didnt say anything when your brothers were alone. Hope your parents step in jail some time.", "You are a good brother, and you’re doing the right thing. Your 15 yr old brother is a good brother and he did the right thing. NTA.", "NTA you did the right thing. If it wasn’t a problem CPS wouldn’t have said the kids need to be taken out of the home. That was neglect and your parents should be in jail for abandoning their chirldren", "NTA. You are absolutely doing the right thing. Your friends at college don't have relevant life experience to comment, and your extended family have normalised your parents ' behaviour so they don't have to feel guilt over not stepping in to help themselves, but your parents had stopped providing parental care for their children.", "NTA.\n\nYou were the ONLY person who stepped up.  You actually helped out your brother instead of offering empty, useless platitudes.  The people who are caring you selfish couldn't even be bothered to show up.\n\nScrew them.\n\nYour parents don't deserve your thoughts or sympathies.  Your brothers deserve the love you gave them which is worth so much more than the egg and a sperm their donors gave.", "Same, I would be loath to involve them, but this was WAY past necessary.\n\nNTA. And make sure everything is cool with your spouse / partner if you are taking your brothers in long term.", "They’re parents, for the second and third time they have dependents. If they came into money they should be using it for the benefit of the family as a whole rather than going off for months almost completely radio silent. Family holiday (Alex no doubt the babysitter though), something new to replace a broken or worn down piece of equipment or something. Even if it‘s just paying off the mortgage or bills.", "Would you like to hear another, sir?", "Perfect post", "Absolutely- OP saved those kids.", "Oh fer crap....of course it does.  Apologies for my fart-riddled brain.  XD", "Thank you for your response, that clarified it perfectly for me! It was my first time dealing w CPS thankfully, and yeah i can see how that would be misused now.", "The whole point of CPS is for them to be the objective deciders on if it’s actual abuse or just “moral outrage” and frankly we can not and should not trust the average Joe to make that differentiation.\n\nMy dad emotionally, verbally, and financially abused me my whole life. Yet I’m still often told that forcing us to stand with our noses in the corner for 12+ hours without being allowed to go to the bathroom or eat or drink anything isn’t abuse. Many people think examples like that were just me not agreeing with my dads parenting style. He never got physical with me, but he did throw my sister across the room when she spoke back to him, she’s been told so many times that that wasn’t physical abuse that she’s actually been convinced that she’s the one who was overreacting for these instances.\n\nOn the other hand, the parents of my brothers friends firmly believe that making your kids do chores is abuse. They genuinely feel that because farmers can’t make their kids work the farms here (forced child labour is child abuse by our local laws), that means making your kids do the dishes once a week is tantamount to full blown abuse. \n\nThe average person is not equipped to know if something is abuse or not. That is literally why things like CPS exist.", "Direct copy from the US Department of Health and Human Services \n\n\"States in collaboration with the Department of Health and Human Services have formulated some guidelines to assist parents who are making this decision:\n\nAges 7 and under: Cannot be left alone at home during any period of the time. This includes leaving them unattended in the cars, backyards and playgrounds. This is a vulnerable age and their would be a high risk to their safety;\nAges 8 to 10: are permitted to be home alone only during daylight and early morning hours for no later than 1 and ½ hours;\nAges 11 to 12: can be left alone during the day for up to 3 hours but not late at night;\nAges 13 to 15: are permitted to be left unsupervised, but not overnight and;\nAges 16 to 17: can be left unsupervised for up to 2 days. \"\n\n\nYou can bet your bippy that CPS will indeed follow these guidelines. And just because a 15-year-old can be left unsupervised for a day, but not overnight. CPS and the Department of Health  and Human Services would not consider it okay for that 15-year-old to be left in charge of a 5 year old for weeks at a time without adult supervision being very directly and Hands-On involved.\n\nYes, CPS at least in my state would make charges of abandonment, and reckless endangerment. Because very few people especially in the legal system would expect a 5 year old and a 15 year old to always make smart intelligent choices that would not lead to something going wrong. In the eyes of CPS, Health and Human Services, and many Family Court Lawyers and judges, if there is not an adult on hand if something goes catastrophically wrong, it is the responsibility of the adult that things went wrong.", "That is really selfish. \n\nYour brothers are fortunate to have you. You have no need to feel bad or guilty for your actions. Tell the people complaining that until they have worn your shoes or those of your two brothers and experienced the pain they have no right to talk.", "It wasn’t really a huge brain fart on your part. When talking about infants, (number)m does mean how many months old they are. If you’re a parent then it makes complete sense you thought that’s how they meant it rather than thinking it meant their gender.\n\nIn this case the M does seem to mean the gender rather than the age, but I don’t want you feeling dumb for that one lol", "If it makes you feel better I usually read it as months as well, I'm always going back to reread and correct my brain lol", "Cps/cws has a bad  reputation but in California a lot of these agencies are trying more progressive practices… from providing housing And job training… is system perfect? no… but neglect and abuse is worse…we all heard of horror stories of the 90s and early 2000s but the system is changing and leaning towards kinship", "Your aunts berated you for \"putting this all on your parents?\" It IS all on your parents. Because they're the parents\n\nNTA.", "NTA. The friends who said it could ruin your brothers' and parents' life...WHAT?\n\n1) Boo fucking hoo to the parents. Nobody asked them to have more kids they can abandon. If their lives get ruined... serves them right.\n\n2) Your brothers were without adult supervision for 5 months. Anything after this is a significant improvement to their living situation. Especially because they will have a consistent figure (you) in their life.\n\n\nWishing you the best of luck OP, I hope everything works out.", "NTA, and I'm very proud of you since you seem to come from a large family of AHs.", "FIVE MONTHS?! NTA, and this is more than a CPS complaint, that is grounds for criminal charges.", "NTA. They abandoned 2 minor children for 5 months.", "NTA Why do these cases always end up with a relative whining about ruining the adult's lives? What about the kids? You totally did the right thing, your brother has been very brave, but I can't imagine the stress that put him through. What if one of them had got sick or hurt? 15 year olds should be concentrating on being 15, not be a stand in parent because mum and dad are off on an extended jolly. You've been the best possible thing for your siblings, a responsible adult with their needs in mind", "You're a great brother. Alexis is a great brother. Please hug him and tell him it's neither his fault nor his responsibility but he managed to keep this up for five months and this is incredible. Please feel hugged too, OP.\nI'm so sorry for both of you and I hope the 3 of you can start all over.\nNTA. And for all the relatives shittalking, ask them why nobody of them cares for your boys? So they just can f off", "NTA. Your brothers lives were already being ruined by your parents. Your parents clearly don’t want to have kids so you aren’t ruining theirs. I care less about criminal charges than I do about the abuse and neglect your siblings are living in. What would happen if someone got sick or injured? CPS would be called on the parents then, but one of them could die in the process. \n\nFar better to have a supportive sibling than a negligent parent.", "NTA. Just for ease I might have given your parents an ultimatum, give up the kids to you or you’d call CPS but you DID THE RIGHT THING stepping in and making sure they are taken care of.", "How are you the asshole for finally giving these kids some semblance of normalcy? Babies can't raise babies.\nNTA.", "NTA", "NTA. You are a great brother. \n\nYour family on the other hand and those friends are all AH.", "You stepped in and rescued your 15 and 5 year old brothers. Your parents were absent for five months. Case closed. They are the assholes!", "NTA", "NTA your brother’s lives were ruined when your parents kept leaving them alone for months!", "NTA OP! Ruining your brothers lives? Trust me that's far from the truth, and I don't know if your foster system is the same as mine was but I was a foster kid, I had all kinds of amazing benefits that helped me become the man I am today, I learned finances, the system helped me buy my first car, I got a basically free ride to college, and they help me even now with food if I need, and if I ever struggle with rent I just have to let my caseworker know and they'll pitch in. Idk but based on context this sounds like a much better situation for them than their current one", "NTA you are a hero to those kids. Save them from your abusive and negligent parents. Stop telling your business to your ‘friends’ and ‘relatives’ because they are of no help and don’t care about your siblings. Their opinions don’t matter at all. Keep doing what you’re doing and save those kids!", "If money isn’t a problem I don’t get why they didn’t at least hire a nanny? Your brother is a superstar and so are you! Hope everything gets better now. NTA", "Absolutely never ever ever one for trying to protect children!!! Nta!!!!!!! You're parents and anyone defending them are tho!!!! You did what you had to do to protect your siblings!!!! If they don't want their lives ruined or looked down on then they should be better parents. It somehow always amazes me when people do crappy things then get mad at whoever makes their abusive parenting or whatever it is public because they \"made them look bad and ruined their reputation \". No, they did that themselves by being bad people. You're the only solid stable adult in these boys lives right now and they need you!!! Pls update as soon as possible!!!!\nPs. They,especially the older one, will need therapy to deal with all the trauma of having to raise a 5 yr old alone for so long. Also, where the hell have your parents been for 5 freaking months!?!?!?!", "NTA", "nta. They ABANDONED two children for months?! No way.  You did right to get them out of there.", "I’m blown away that CPS sent them back", "100 percent. They completely skipped out on their parental responsibilities. A 15 year old may be equipped to babysit short term, but is not equipped to be a full time parent. Not to mention that it had to be tough for the 15 year old to engage normally in school etc. \nplus. I might add that it is usually a legal requirement to report abuse and neglect. So most likely OP had a legal duty to report.", "And what would've happened if one of them had an emergency? How is the 15yo now going to get help? Probably call 911 which in turn would've gotten CPS involved except it would've been way worse and your parents would definitely have been thrown in jail for child neglect and child abuse. \n\nWhat is 15yo had an accident and was left unconscious or worse, does 5yo know what to do? Would he have been at a mental stage in his life to know to call 911? \n\nOh my sweet lord OP you are so far from TA here you're practically a saint. You're these boys Guardian Angel and you don't even know it. \n\nRemember that when you stand up for what is right, everyone who was too cowardly to stand up will call you out for going against the grain. It's the reason why whistle-blowers go into witness protection. And I'm sorry to word it this way, but you're the whistle blower for what your parents have been doing to your family, your brothers. You finally are putting an end to their madness and that's not an easy thing to do. \n\nJust picture your brothers, years from now, as happy healthy functioning adults, living their amazing lives. Going to college. Getting married. Having families of their own one day. And remember that your actions today are what is going to allow them to have these lives. Please take a moment to acknowledge your bravery, your courage, and that your're a god damn hero for stepping in and doing what needed to be done.", "The problem with this line of thinking is that it allows and in fact almost guarantees ever increasing government overreach into private lives. It creates a one size fits all society, where the civil and criminal enforcement arms of the State are apt to go wild and where the opinions of bureaucrats and law enforcement matter more than the opinion of society at large.\n\nAt CPS it matters more what Sally at CPS thinks, then it does what actually exists in statutory law or caselaw.\n\nIf you are unsure, and a mandatory reporter, go ahead and report it. If you are unsure, and not a mandatory reporter, Id stay out of it. The thing is, if you are actually trying to be open to different approaches and cultures and ways of doing things, you probably wont be that unsure", "those aren't laws, so my point about legalities stands.\n\n[https://worldpopulationreview.com/state-rankings/age-a-child-can-be-left-home-alone-by-state](https://worldpopulationreview.com/state-rankings/age-a-child-can-be-left-home-alone-by-state)\n\n39 States have no law about it.  Kansas says as young as 6.", "> If you are unsure, and not a mandatory reporter, I’d stay out of it.\n\nAs someone who needed those who were unsure to actually report it so I could have had help in my abusive home, I sincerely hope one day you realize how many innocent children have suffered over the years because of your mentality. And although I usually hope the best for people, I do hope you end up feeling a lot of guilt about how many children remain victimized because of people like you pushing this mentality.\n\nThere are some areas where government **should** matter more than “the opinion of society at large.” Possible cases of child abuse are one of those areas. Society has historically enabled abusers to keep the peace and its been proven over and over and over again that “the opinion of society at large” is usually not a healthy one for children and victims.", "Wow, please update us later if you can or want to. How did a C 15 year old manage school while caring for  a 5 yr old?", "How do they have money ? I assumed inherited if they’ve always had money but don’t seem to work?", "Since they're not hurting for money at all, i'd suggest to find a lawyer and make sure they financially support them while they're in your care. If it's possible without them having any kind of rights it would help you give them the best care you can and maybe help with college etc...", "Well, if we are going to get personal.\n\nI'm sorry for what occurred to you as a child. But that is what happened to you in particular, and we frankly have to look at the societal level. I could certainly be wrong, but you don't become right because of the abuse you in particular suffered. What happened to you in particular is not that relevant to which one of us is right about this.\n \nThere are also plenty of families and children who have been damaged by an overactive CPS and LEO enforcement apparatus. There is very little way to eliminate all opportunities for error. And there is also the very real possibility that a child will feel undergo intense trauma from the government's actions in a dependency case.\n\nWe live in a democratic society. Well I am assuming that we both do. In a democratic society, the opinions of the society should be the foundational principle that directs government action, not the beliefs of unelected bureaucrats and LEOs.", ">They either had good lives and don’t understand m, or they had bad lives and have resorted to magical thinking.\n\nThere are genuine reasons to not call CPS, but it's dependent on the situation. Because the process takes time it can put the child in danger while CPS is doing their process, leading to increased violence against the child during that period. And if the parents are the kind to play the system they may be good at faking stability, it may lead to increased danger with no action from CPS.\n\nThis is the perspective coming my partner/friends who are educators and therefore mandatory reporters.\n\nPlease don't take this to mean one should never report, just that weighing the pros/cons isn't an outlandish thing to do.", "I'm not entirely sure, he's been cagey at best about it and it worries me, my best guess is that he either hasn't been attending and my parents perhaps covered for him or he's been leaving the five year old somewhere or with someone he's not comfortable with. It's very concerning but I don't want to push him too hard right now.", "The solution to people having misused CPS is to hold CPS more accountable for not causing damage while trying to help. They are responsible for implementing good systems and checks to make sure the report is substantial before they impede on the child’s home life. The solution is not to tell people they shouldn’t report the things they think are happening just because they don’t know don’t know for sure.", "Oh, no, totally not arguing that everyone should report every little thing to CPS. Just that people who don’t know the full situation and have “CPS  is bad” mentality, shouldn’t be telling others what to do. \n\nIn this case, OP’s friends know fuck all about the details and how it is affecting the kid and the reality of the situation. They just sing their little “CPS is bad” song and go on with their lives.", "I don't know if you have a lot of experience in legal or law enforcement. But that is basically impossible. Life is too variable and perception too up to the individual and too much will always ultimately comedown to the beliefs and opinions of the bureaucrats and the law enforcement officers.\n\nAnd I didn't say don't report if you don't know for sure, I said be sure on what legally counts as abuse and then report suspected abuse.", "Based on what you've written, NTA. \n\nBut I'm wondering why your friends and family are supporting your parents. It's just so weird to me that anyone could think abandoning children is okay. Do your parents have a different version of what happened? Or are there massive holes in the 15 year-old's story? \n\nAlso, not saying this in any way justifies your parent's neglect, but the fact that your brother won't tell you what he's been doing for 5 months is highly concerning and you're going to need to get to the bottom of it.", "NTA", "NTA. None of them were there. They don’t *know* how bad the situation is. It’s too abstract to them.", "NTA. your depemdemts are your priority which due to your parents incompetence now include your two brothers. If I were you I would cut all the toxic friends and family members out of the situation and ghost them. may your family find much joy and thrive together. You don’t owe your parents anything they sound like horrible people. You made the best decision do you and your brothers. Your their best chance at a normal life.", "How, in any world or reality, could you be TA? Seriously, I'm asking how? Because I can't understand how anyone could think so. \n\nUnless they hate children, I suppose.\n\n So I guess anyone who thinks you are, hate children and wish them harm. Be sure to tell them that.", "Crapballs, I was on the fence about leaving my 17 and 15 year old alone for a week. (I was only going 2 hours away) and after lots of convincing left them and called multiple times a day. Plus my bil only lives 5 minutes from us so they werent completely alone. No way 15 and 5 for 5 months. I hate cps but they were needed in this case", ">putting all of this on my parents, \n\nI can't think of anyone else you should put this on, and there are 8 billion people for me to choose from.\n\nNTA", "Your friends sound like idiots if they think it's better to leave a 15 year old to parent a 5 year old than call cps. You absolutely made the right choice. In a lot of professions it would be required (mandated reporting). NTA", ">he's been left home alone with our youngest brother Jon (5M), for almost five months now\n\nWhich of your family think this is ok?", "5 months is a long time, might have been a 14 year old they left in charged of a 4 year old.", "Do not feel bad for going to college. If you hadn't you wouldn't be in a position to help your brothers NOW. You'd have been trapped into being the sahp for them and never able to escape them. DO NOT feel guilty that you went to school and now have a stable life. You wouldn't have your husband or your 2 beautiful kids. Do not ever blame yourself. This is ALL on your parents and anyone else that knew the situation but did nothing.", "You *are* his hero and protector, even if you may not always feel like it.\n\n>I should have been there sooner, I should have saved him so much pain.\n\n^ This breaks my heart, because you don't deserve to carry that kind of mental and emotional pain. What matters is what you're doing now.\n\nI want you to extend yourself the same amount of love I know you hold for Alex, and here's why: \n\n>I was so worried I'd ruined my parents I didn't even stop to consider that I shouldn't care\n\nThis speaks volumes, but not in condemnation. You were raised in an abusive home. You didn't grow up learning what most of society considered \"normal.\" Instead, you were learning how to survive.\n\nThat fear of ruining things for your parents was purposefully instilled. Silence empowers the abuser, so they use things like shame and guilt to make sure their victims feel powerless and stay quiet. Even adults fall prey to that kind of manipulation. What chance did you as an innocent child have?\n\nIn case you just thought \"but I'm an adult, I should have seen it and known better,\" I want to preemptively try and tell you why it isn't that easy. I'm sure this will get long, but I want to try my best to get my message across. \n\nMy husband appeared to have a happy and loving family from the outside, but I saw little red flags early on. It was only after he saw how my parents and I interacted that something in him clicked. When we got in my car to leave, he just kept mumbling about it, almost like he was in shock. That moment was a catalyst.\n\nAs he shared stories over time, he came to realize how unhealthy his family dynamic was. He was isolated and controlled. The first time he didn't immediately capitulate, things went off the rails. *Fast.* \n\nThe attempts to manipulate were well done, but my husband saw through them by then. It ended with me at the police station, asking an officer at what point I should come to them for help. He told me we were well past that point.\n\nIt's been 10 years without any contact. My husband is now 38. That means he was 27/28 before he realized how bad things were. He had an idea, but he had always told himself he must be wrong. It wasn't until an outside voice told him he wasn't wrong that he finally saw it all for what it was. It wasn't an easy journey for him. He admitted that he knew he was really struggling, but he couldn't figure out why. That's what toxic and abusive people create in their victims\n\nSometimes it's easier to see a bit of ourselves in others. I'm hoping you'll read my husband's story and give yourself a break, because you've been victimized by your family, too. Be patient and show yourself the kindness your parents didn't. \n\nIf you haven't tried therapy before, it's really worth considering. Being validated by a professional really helped my husband. It's helped me as well over the years, so I'm a huge proponent.\n\nSorry, I know this got ridiculously long. I just wanted to be your cheerleader for a moment. I know difficulties lie ahead, but you're strong. I know you'll do all you can, and Alex knows that too. I'm rooting for you ❤️", "Hopefully your parents will do the right thing and just sign over custody since they don't want to be parents anyway.", "Exactly.", "As someone who came from an abusive household and knew a lot of of others who were in the same situation, this was the exact reason we never called cps and the ones who did got fucked over.", "NTA. I know it's hard to go against your family, even when they are estranged. But you did the right thing by calling CPS. You saw a bad situation and called the experts to make a determination. \n\nIf you're able to, take in your brothers. You definitely don't want them in the system.", "NTA\n\nYou are doing absolutely the right thing.  You are putting **the children's lives first**.  It's great that your 15 year old brother was mature enough to act like an adult for 5 months.  But absolutely horrific that he was forced to because of absolute negligence on your \"parent's\" part.\n\nI don't see how you will ruin your brother's lives.  Your \"parents\" did that.  By basically vanishing for 5 months at a time.  On a regular basis.\n\nHonestly, **IT SHOULD RUIN YOUR PARENT'S LIVES**.  That is an extreme case of child neglect, if I ever heard one.  If they get permanently booted from the US, cry me a river.  Clearly they are unable to raise children in the US.", "Absolutely NTA. You’re a friggin hero honestly.", "IMO, there is no story that could justify the parents actions.\n\nNTA", "How did you come out of that household so kind and loving? You absolutely did the right thing. Understand that you cannot ruin your parents’ lives. They did that to themselves. Those poor boys. That is absolutely heartbreaking. You are their hero. NTA in any universe.", "OP, first of all you are an amazing person & a great brother. you are a fucking hero (to me & your brothers) for taking them in, loving them & bc alex knew he could call you. the part about him breaking down when he was finally, finally somewhere actually safe just broke me. that poor baby, idk how he made it for 5 months caring for a young child at his age. he’s amazing too (& much more resilient than he should have ever needed to be). as for your parents, who gives a shit if their lives are ruined by THEIR ACTIONS? this is child abuse & neglect, they deserve it! you are NTA. your dumbass friends & family members should be cut out of yours & your brothers lives if they think this is anything resembling okay & that YOU are the bad one in this situation. your brothers need you. you did a wonderful thing. you saved them from what could have turned into an even more tragic situation. anything could have happened to those boys. thank you for being the one grownup they can trust. i want to hug the 3 of you so badly.", "Here I was taking care of a newborn when I was in 3rd grade... the life of an immigrant. \n\nIdk if you're an AH tbh. It was too long to read but at least you're letting the kids live with you while calling out the parents.", "NTA, they left a teenager alone with his much younger brother for five fucking months! Nothing you or the system does will harm him that way, in fact it's just the opposite. Whatever friends are telling you that shouldn't be taken seriously ever!", "Find out from CPS if you can get a guardian ad litem to represent the children. This is a lawyer appointed by the court to look out for the children’s interests and rights. Generally the cost is borne by the parents.", "NTA.  Excellent brother", "Absolutely NTA. You did the right thing. NEVER question that, regardless of what extent we’d family from another country say. Those 2 are lucky to have you. A lot of kids aren’t so lucky and fall through the cracks. If CPS is removing them, they have their reasons.", "NTA but a very good sibling. Bless you.!", "NTA I'm just hearing a lot of people who could've stepped and didn't, blaming you for something they should've sorted out themselves. You did the right thing for your siblings. It may not go the way everyone expects but no one else was stepping up.", "NTA.\n\nThey were leaving children alone for months at a time!!!!!! In no world is that okay.", "NTA and wtf is wrong with your college friends? Your brothers are being abused and parents need to suffer the consequences.", "NTA. You put the safety of your brothers first. If your parents haven’t done anything seriously wrong then CPS will let you know that and things will return to normal. At the very least it will be documented that you were concerned if the neglect continues it will be taken more seriously next time.", "This brought tears to my eyes. You are such a good person.", "I think you're right.  They're furious only because They Look Bad.  Not because they you know, did horrible things to their own children.  \n\nI truly wish I had a dime for every AITA post where some true AHs get angry because They Look Bad.  If they don't want to look bad, maybe don't do bad things?  That's just crazy talk.", "My point was that a teen should not HAVE to be responsible for the care and wellbeing of a kindergartener for a prolonged period of time.", "Honestly, fuck your parents. They deserve whatever consequence they get.  I have a 15-year-old son and I can't imagine doing that to him. I'm so glad your baby brother reached out to you.  Please get therapy for them.  They've been through some trauma.", "Yeah, I wouldn't either. Not because they couldn't or they don't have the skill to do so but because I don't feel it is right to leave the older ones responsible for the younger ones for a prolonged period of time. 12 hrs babysitting occassionally? Sure.", "Exactly. Plus I live in a place where you need a car to do anything, shops are far away, not many delivery options. Not to mention in case of emergency!", "And hopefully they start using actual contraception, or better yet, seek out sterilization surgery, if they don't want to actually raise the kids they create.", "Not a lawyer and you didn’t say country but I’m pretty sure that’s criminal. NTA obviously.", "Hard NTA I would have understood in an emergency for a few days. Worst case they had to go out of the country and it takes them 2 weeks to come back. That's it. Anything beyond that is firmly in call CPS territory. It's been 5 months your friends and family are delusional if they think that's okay in any way.", "NTA you’re trying to do the right thing for your brothers. And it seems you’re the only one who is. They’re lucky to have you. Hope CPS puts them in your care. If your parents don’t want to be decent parents they need to stop making children.", "NTA", "NTA! Where tf do parents disappear to for FIVE MONTHS?!? I couldn’t imagine being away from my babies for that long. Let alone making my middle child watch him for that time! Did they send money? How did they get groceries? I imagine someone would have noticed a 15 year old coming into a grocery store for five months with a 5 year old but I could be wrong especially if it’s not a small town. Yikes! I hope for all things above and below they get things worked out and those babies in your care!! Thank you so much for looking out for them!!", "Op you are absolutely the farthest from ah as you can get so NTA. \n\nDepending on where you live you can go right to the local courthouse and file for emergency custody on grounds of child abandonment and skip cps all together. But since they have already been involved I'm not sure how that would work now. But since they are in your care currently you may still be able to file for that, or at the very least temporary custody then full (Depending on the laws in your area). But I'd fight tooth and nail to never send them back to your parents or any other relatives since they seem to think this treatment is ok. I'd be willing to bet shorter trips have been done in the past for a few years at least if they decided to skip out for this long now. I wish you all the best and healing for you/them but especially for your youngest brother since he's not even old enough to understand what's going on really. You may want to think about getting them both into therapy as well, which could greatly help your case in court to keep them but more importantly help their mental health during this process.", "They ruined their own lives when they left a baby with a teenager FOR FIVE MONTHS. What if alexis couldn't take care of the baby and something would happened? Time for your parents to accept that they are not capable to take care of children. Save your brothers.", "I wouldn’t feel comfortable as a fifteen year old (not 15 now) staying home for ONE night with just a five year old, let alone FIVE MONTHS.", "I can’t imagine that is any other zone.", "I've officially spoken with my aunt, and I have more of the picture now, apparently my parents told the family that Alex was lying and I was just being irresponsible and not corroborating the story. Despite the fact that CPS looked into it and agreed with me. My aunt is quite alarmed by this and has started telling some of the family about this, hopefully they're reasonable like she has been. \n\nI also got to hang out with the boys more, it's so good to finally see them more relaxed, I want them removed from that house asap tho. My aunt has hinted that she'd like to take custody but I'm committed to getting them in my care. Her living outside the country is a big reason for this, my brothers deserve some sort of stability, and they can't get that by moving to another country where they're comfortable with the language, neither of them speak Spanish and Alex can only understand it, I can't make them leave like that.", "NTA", "NTA I'm sorry but fuck your friends. Parentification is a form of abuse which can literally affect your brain development. Your brother's life was forever changed when your parents chose to abuse him. They are literally saying you should have  left him in an abusive situation because what your parents life might be ruined? Good I hope it is.", "NTA", "Yeah, if there was any chance of these kids having to go to foster homes, that MIGHT be one thing (we can get into a whole debate about when to remove kids vs when it's okay to provide support for a child caregiver) but OP is a legal adult who is already raising a child in a presumably stable home and wants to take his brothers. There is almost no way they won't land with him.", "CPS showed up at my house after my therapist called when I was 15. They looked at my injuries and said they were just checking in, and they weren't going to remove me from the home. My stepdad listened to the conversation from the other side of the door. Less than a week later I was in urgent care with a broken wrist. So yeah, I can vouch for the being fucked over."]}