{"id": 5355, "submission_id": "zshjx9", "title": "AITA for not saying “please” or “thank you” to my mom to teach her a lesson ?", "selftext": "\nMy mom (50F) is… somewhat of a Karen. She has a very entitled attitude about many things she does, and me and my little brother (19M) call her out a lot on it, and sometimes we get extremely embarrassed about the way she speaks or acts. Some examples include, but aren’t limited to: cutting in line, calling out very loudly to waiters, being very annoyed when the service isn’t quick enough (even when the place is packed), and some others that don’t come to mind atm. To her credit, when we call her out, she usually protests a little bit but then calms down, and otherwise she’s a good mom. \n\n\nHowever, she has this… habit. She can never say please AND thank you. Sometimes she doesn’t say either! And she does it so condescendingly. Per example, instead of saying “Can I have some bread please ? [gives bread] thank you!” She will say “can I have some bread ? Thanks.” BEFORE the person hands her the bread. Or she’ll just outright say “can I have some bread”, and when given bread will not say anything. My little brother and I cannot stand when she does that, ESPECIALLY to waiters. We’re kinda used to it, even though when she does that I tell her “you’re making my ears bleed” lol. \n\n\nAnyways, we’re on vacation atm, and since we eat all the time together I’ve seen her do this for about half a week now, so I thought I’d give her a taste of her own medicine. I’ve stopped saying both. I’ll just go to her and ask her something without saying please or thanks (with a demanding tone), and to her credit, she hadn’t noticed it at first. \n\n\nThis morning I told her “pass me the salt” and she looked at me and said “why have you been so rude lately?” And I innocently said “what do you mean, mom?”, holding back a grin. She said “you haven’t been saying please or thank you, it’s very demeaning.” AHA. I looked at her and said, “but…. Don’t you do that all the time?”. She looked at me with a frown and I started grinning. My brother started laughing and she didn’t say a word. My stepdad came to me later saying that I was a butthole for doing this to my mom just to teach her a lesson. He said that me being rude made her think something was wrong, and not that I was just being petty. That we’re on vacation, not here to fight, and that she doesn’t want to have to be careful about everything she says in front of her 22 year old daughter when she’s 50, and it’s hard to change bad habits.\n\n\nNow I feel bad because she’s been kinda pouting and I didn’t think she’d take it that bad.\n\nSo Reddit, AITA?", "created_utc": 1671700147, "permalink": "/r/AmItheAsshole/comments/zshjx9/aita_for_not_saying_please_or_thank_you_to_my_mom/", "score": 22, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I stopped saying please and thank you to my mom to teach her a lesson \n(2) we’re on vacation, it may have not been the time and place to do so and my mom is mad at me for worrying about my well-being when I was just being petty. She’s also sad that I would do a scheme to “antagonise” her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - You just very succinctly proved your point. The more upset she felt being spoken to like that, the more she should consider how it might make others feel", "NTA\n\nStick with it. It seems like your mom isn't a bad person but has bad manners and bad habits. Showing her how it feels to be spoken to rudely without knowing why is a good lesson. It sucks that a 22 year old has to teach a 50 year old lessons in manners, but it seems like it's working. Maybe have a honest chat with her now about how she is making people feel by being rude, and how it makes you feel when she's rude to people.", ">He said that me being rude made her think something was wrong, and not that I was just being petty.\n\nDing! Ding! Ding! That was the whole point.  He got it but dismissed it, what a shame.\n\nYou are NTA.  You showed her what she looked like, and she didn't like it, so there is hope.  Have a talk with her when step dad isn't around, let her know that is what she is like and you know she has it in her to be better than that.", "Being rude isn’t a bad habit it’s a personality trait. NTA.", "Nope I love this. Be petty.", "NTA but this is one of those things you are usually taught very early and that’s why you say it without even thinking. It becomes ingrained. I was taught a different language until I was about 4 but the only words I consistently remember are please/thank you/love you and I still use non-English when saying please/thank you and are not even aware of it.\nSounds like she was never taught so it’s not automatic for her. \n\nShe can pout. You embarrassed her and she’ll get over it and try to remember, but don’t be surprised if she doesn’t remember half the time.", "NTA", "NTA", "NTA - seriously you are not a child anymore and sometimes older people, especially mom and dads, can be taught a lesson as well. \n\nI had it the hard way with my mom too. I am 30 and my mom began to fully respect me just a couple years ago after we had a huge fight over bad habit from her herself. \n\nParents need also to respect that, when we get older, we start to see that they are not perfect anymore and step down from their podest. \n\nIt is a change in life that is totally normal and you and your mom have to deal with. \n\nYes you are still her daughter but grown up. And she has to act like this as well!", "NTA has your mother even made an effort to try and change, saying it's hard when she hasn't tried Vs having tired but being such an uncompromising butt hole you can possibly learn to treat people with basic respect and manners are too very different things.\nShe should at least try.", "NTA", "An easy NTA. Funny how when you match people's energy and hold a mirror up to them they get all offended \n\nHer own medicine must taste pretty sour", "ESH\n\nBeing rude is being rude. I personally feel like we should try to be kinder to everyone, even when they are not. And while I understand that it's a difficult situation and my suggestion itself can be hard, I often have to remind myself, I don't personally believe in throwing out proper manners because your Mother cannot behave herself.\n\nPersonally I feel like you are looking for reasons, if she says, \"Pass the bread, thanks\", she's still saying thank you. If that isn't enough maybe the problem is you.\n\nI also don't think starting fights on a vacation is a wise use of your time either. You're 19, you should be old enough to know better.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nMy mom (50F) is… somewhat of a Karen. She has a very entitled attitude about many things she does, and me and my little brother (19M) call her out a lot on it, and sometimes we get extremely embarrassed about the way she speaks or acts. Some examples include, but aren’t limited to: cutting in line, calling out very loudly to waiters, being very annoyed when the service isn’t quick enough (even when the place is packed), and some others that don’t come to mind atm. To her credit, when we call her out, she usually protests a little bit but then calms down, and otherwise she’s a good mom. \n\n\nHowever, she has this… habit. She can never say please AND thank you. Sometimes she doesn’t say either! And she does it so condescendingly. Per example, instead of saying “Can I have some bread please ? [gives bread] thank you!” She will say “can I have some bread ? Thanks.” BEFORE the person hands her the bread. Or she’ll just outright say “can I have some bread”, and when given bread will not say anything. My little brother and I cannot stand when she does that, ESPECIALLY to waiters. We’re kinda used to it, even though when she does that I tell her “you’re making my ears bleed” lol. \n\n\nAnyways, we’re on vacation atm, and since we eat all the time together I’ve seen her do this for about half a week now, so I thought I’d give her a taste of her own medicine. I’ve stopped saying both. I’ll just go to her and ask her something without saying please or thanks (with a demanding tone), and to her credit, she hadn’t noticed it at first. \n\n\nThis morning I told her “pass me the salt” and she looked at me and said “why have you been so rude lately?” And I innocently said “what do you mean, mom?”, holding back a grin. She said “you haven’t been saying please or thank you, it’s very demeaning.” AHA. I looked at her and said, “but…. Don’t you do that all the time?”. She looked at me with a frown and I started grinning. My brother started laughing and she didn’t say a word. My stepdad came to me later saying that I was a butthole for doing this to my mom just to teach her a lesson. He said that me being rude made her think something was wrong, and not that I was just being petty. That we’re on vacation, not here to fight, and that she doesn’t want to have to be careful about everything she says in front of her 22 year old daughter when she’s 50, and it’s hard to change bad habits.\n\n\nNow I feel bad because she’s been kinda pouting and I didn’t think she’d take it that bad.\n\nSo Reddit, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Definitely NTA", "NTA She needs to get it through her head that the unsettling, unpleasant feeling she has when it is done to her is the very same feeling everyone else has when she does it to them.\n\nMaking her think about how that kind of language has a negative affect on people was the point. She should feel bad. That is how she should learn the lesson -- by extrapolating from that and realizing that (gasp) maybe others feel the same way. Treating her as if her feelings are special and different, so she needs to be treated with kid gloves while at the same time being given a pass for her own behavior is how how to make her increasingly worse over time.", "ESH you are being as rude as she is.", "NTA. She knows it’s rude. She should be putting forth a better example", "YTA. If we’re talking about manners, then its more rude to point out your perception of somebody else’s lack of manners than the supposed lack of manners. To an adult.", "NTA - Working food service and retail I used to see mothers who caused scenes made their children very uncomfortable. I always felt bad for their offspring, so *please* keep doing what you're doing and *thank you* for helping stick up for service employees.", "NTA. She doesn't want to have to watch her words but expects everyone else to. That is an unreasonable expectation and she shouldn't feel entitled to it", "NTA What's good for the goose is good for the gander. She's too old to learn how to say please and thank you? Cool! Nobody has to say it to her then.", ">You're 19, you should be old enough to know better.\n\nBull. Op is 19 and does know better which is why they are doing exactly what is right.", "Found the mother", "No, they are starting shit on a family vacation over the most petty of nonsense. They are no better than their Mother.\n\nYou must be a child too.", "Found the unoriginal commenter.", "found the chicken who blocked me because they hated being disagreed with"]}