{"id": 5367, "submission_id": "zsmcrq", "title": "AITA for telling my aunt I will stick to the curfew my toxic mom made till either I become independent or she takes me in?", "selftext": "After my aunt, Linda, heard about how my mom set a curfew for us at 6 pm and if we don't stick to it we would have no dinner, she sat me down in private and told me that my mom is very sick and she's only been placating her/not taking her seriously so they could still be close. She said I was old enough (17 and a half) to start standing up to her now. \n\nI was silent because most of our family members have been telling me similar things like your mom's sick since I was 13 but nobody took actual actions to shield us from her wrath. They'd pretend not to hear her screaming and wait till it's over before coming up to smooth things out (we live in the same appartment complex.) \n\nI asked Linda \"when I stand up to my mom and I face consequences as a result of that, would you take me in?\" She deflected and said I'm old enough to take responsability for myself. I insisted she gives an answer about whether she'll help in any way and she said she can't promise me anything. \n\nI asked her whether she realizes I'm the one who wants to stand up to mom the most but that I literally depend on her right now to stay alive since she won't allow me to work during summers and have no savings whatsoever to my name? \n\nLinda said it's not that exaggerated I could stay in a shelter and there are food banks, I'll survive. I'm just a coward and too scared to stand up to her. I told her I am sticking to the curfew with everything I have until I become independent or she takes me in. \n\nShe got angry and said she knew what I was doing, that I was guilting her into taking care of me and I was being ungrateful for her kind intentions. She said it didn't have to be all or nothing and she's helping the way she knows how. \n\nI told her she's easing her own conscience by doing this and has nothing to do with helping and got up and slammed the door behind me. \n\nAfter that several of my family members came to me and advised me to not be so \"unreasonable\" and \"thorny\" and push away people who actually care. I teared up and went out to the library and now I don't know if I'm at fault for being so defensive about this issue. AITA?", "created_utc": 1671716538, "permalink": "/r/AmItheAsshole/comments/zsmcrq/aita_for_telling_my_aunt_i_will_stick_to_the/", "score": 33, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my aunt I'm sticking to mom's insane curfew until either I become independent or she takes me in. I might be the AH because other family members kept insisting she was just trying to help and I acted thorny and unreasonable.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your aunt is naive to think that she is helping by saying this. You are doing what’s best to maintain your safety and health. Shelters and food banks should not have to be your safety net at 17. \nNow you do need to start making a plan to get out and make your own money cause your mother isn’t gonna get magically less crazy when you are 18. At that point you risk getting kicked out. Also do you have younger siblings? Not getting food as a punishment is abuse, if you are in a country with decent child protective services it may be time to gather evidence and report her.", "NTA. Your Aunt Linda is a real piece of work. I think you are the one who was seeing the situation clearly and I'm so sorry that your family is unwilling to support or defend you. You are completely in the right here and she is definitely just trying to ease her conscience without offering you any real help or way out. It's terrible that you've had to go through this but you are clearly strong and intelligent and I believe you will overcome your upbringing and be a wonderful success. Good luck and be safe.", "NTA. \n\nYou’re doing what you can to survive. If your family really had a problem with your situation they would change it.", "NTA. Your aunt is as toxic and abusive as your mom.", "NTA. She shouldn’t be pressuring you to take risks like that when the alternative is shelters and food banks.", "NTA\n\nYou're the one who has to live with the consequences if you anger your mother.  And you need a plan and support system if you're going to defy her.  \n\nSomeone telling you to live in a shelter and eat from food banks, when you are legally underage, and offering no support, is not being \"kind.\"  You need an adult to act as your guardian until you are 18, and support to get your papers together, driver's license, some savings, down payment for an apartment, etc.  You are right about this making your aunt feel better without actually providing support.\n\nI'd suggest that you talk to a counselor or trusted teacher about resources to help you.", "Oh christ NTA\n\nIf your aunt wants to help you, even if she can’t afford to take you in, she should be helping you strategize and make an exit plan, not pressuring you to blow your life up when you don’t have the resources to put it back together.\n\nYou know best how to manage your abuser and stay safe while you still need to live with your mother.", "NTA, and good on you for calling out her hollow exhortations.", "Nta. But please make some moves for self reliance.. your aunt just showed you that if ypu mom passed she wouldnt help care for you.", "NTA. I think it *could* be helpful that your aunt is letting you know your mother is unwell, rather than let you go on thinking your mother's behavior is normal. But *her* telling you what choices to make is just her trying to manipulate you.\n\nI'm sorry you're in a tough situation, but it sounds like you've doing a very reasonable cost/benefit analysis - you know your mother is wrong, but you also know you aren't financially independent.\n\nIt doesn't sound like you actually said anything mean to your aunt, all you've done is not do exactly as she instructed, so NTA.", "NTA. Do what you need to do to get yourself ready to leave. Gather your documents and put them somewhere safe. Finish school. Get a job and save some money. Tell your aunt that she needs to mind her own business if she isn’t willing to help.", "NTA. You're doing what you have to do to survive and my heart goes out to you. Good for you to recognize hypocrisy when you hear it, and for speaking out.", "NTA. Most shelters have similar curfews, and food banks can be unreliable. She is pushing you to do something that only you will face the consequences for, so she (or your other family) doesn't get to decide.", "NTA. The adults who have been too cowardly to stand up to your mom expect you, a dependent minor, to do it? I'd call them all out for the hypocrites they are and tell them that, as soon as you can afford it, you'll be cutting contact with all of them because none of them have ever been there when you needed them.", "Holy Hades NTA. Someone who calls a minor dealing with an abusive guardian \"unreasonable\" or \"thorny\" is not only deflecting their own guilt, but also emotionally abusive.", "NTA.  Everyone else sucks except for you and your siblings.  You are stuck between a rock and a hard place.  \n\nYour family has enabled your mother's behavior by turning a blind eye towards it.  Your aunt basically telling you to leave one bad situation for another is horrible.  \n\nOnce you turn 18, your mother holds less control over you.  When you can, get a job, save up money, and find a more stable living situation.  Get away from your hoffibly toxic family.\n\nEDIT:  Should have used NTA instead of what I initially used.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAfter my aunt, Linda, heard about how my mom set a curfew for us at 6 pm and if we don't stick to it we would have no dinner, she sat me down in private and told me that my mom is very sick and she's only been placating her/not taking her seriously so they could still be close. She said I was old enough (17 and a half) to start standing up to her now. \n\nI was silent because most of our family members have been telling me similar things like your mom's sick since I was 13 but nobody took actual actions to shield us from her wrath. They'd pretend not to hear her screaming and wait till it's over before coming up to smooth things out (we live in the same appartment complex.) \n\nI asked Linda \"when I stand up to my mom and I face consequences as a result of that, would you take me in?\" She deflected and said I'm old enough to take responsability for myself. I insisted she gives an answer about whether she'll help in any way and she said she can't promise me anything. \n\nI asked her whether she realizes I'm the one who wants to stand up to mom the most but that I literally depend on her right now to stay alive since she won't allow me to work during summers and have no savings whatsoever to my name? \n\nLinda said it's not that exaggerated I could stay in a shelter and there are food banks, I'll survive. I'm just a coward and too scared to stand up to her. I told her I am sticking to the curfew with everything I have until I become independent or she takes me in. \n\nShe got angry and said she knew what I was doing, that I was guilting her into taking care of me and I was being ungrateful for her kind intentions. She said it didn't have to be all or nothing and she's helping the way she knows how. \n\nI told her she's easing her own conscience by doing this and has nothing to do with helping and got up and slammed the door behind me. \n\nAfter that several of my family members came to me and advised me to not be so \"unreasonable\" and \"thorny\" and push away people who actually care. I teared up and went out to the library and now I don't know if I'm at fault for being so defensive about this issue. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. If she's not going to help you, she doesn't get a say.", "NTA. Ignore or cut off contact with your aunt for a while. She is trying to het a rise out of you or get you to be homeless. She says you should stand up for yourself because she is not in this situation.", "Your extended family knew that you and your siblings going to bed empty stomach multiple times and they didn't interfere? They didn't talked with your mom and helped feeding you?\n\nYour mom not allowing you to work isn't an unknown fact. So they all knew that you can't buy food and other things and they let it happen.\n\nI would be more angry about that and calling their bs out in this interaction. Your mom is sick, that can be explained, what was your aunt and other family members reasoning?", "NTA - If they aren't going to provide you with somewhere to live, or a way to sort your mother out, you're going to have to grin and bear it. Become independent, save your siblings if you can, but it's the end for your mother and I'm sorry. This has happened to many people, and I'm sorry it's happening to you", "NTA.\n\nBut neither is your aunt.\nYou're the victim of financial abuse and domestic abuse. Your mother's actions towards you are unreasonable. I hope you can see this.\n\nI know it's never as simple as just leaving or standing up to her. That's how abuse works and how it controls you.\n\nYou need to seek out support networks to help you take the steps to exit. It's not about relying on family to take you in because they're not always able to. But it's about reaching out and having an action plan in place. Speaking to services and getting accommodation lined up, speaking to job agencies about finding you work so you can financially support yourself. Having all that in place so when you do confront your mum and the worse case scenario happens where she kicks you out, you're already prepared.\n\nI wish you the best of luck and please know that you're worth more than how you're being made to feel in your own home.", "Thank you 😢", "Don't use ESH if you explicitly don't think the OP is the AH.", "Aunt is definitely an AH. She's telling OP to risk homelessness and poverty to stand up to their mum. Called OP a coward for not doing so despite the aunt and other relatives not standing up to the mum when they don't face those same risks if they do. She's hypocritical and selfish"]}