{"id": 5377, "submission_id": "zsoic7", "title": "AITA for altering my mums wedding dress?", "selftext": "This story involves me (27f) my sister A (31f) and my mum (60f). \n\nI’m getting married next year to my wonderful fiancé, we are very happy and exited. My mum has a beautiful wedding dress that I have always loved, and so has A. We have both always said we would love to wear it one day, and mum has always said we both could. \n\nA is single, she really wants to find someone, get married and have a family and I want that for her too, I want her to be happy and she will be an amazing mum. I know she is happy for me getting married, but she privately said to my mum how difficult she was finding it that I was getting married before her. \n\nSo I ask mum if I can wear her dress (A was there), she says yes as she had said all along I could. However I am a lot shorter than my mum and sister, I also have a bigger bust. So the dress needs to be altered to fit me. I spoke to a seamstress and asked if it could be done in a reversible way. She said the bust could be taken back in, as she will out in a panel (or something similar) but even if the hem is turned up and pinned, wearing it all day will likely damage it, she doesn’t think it can be let back down. \n\nI rang mum after to check if this was ok, and she said yes. So I went ahead and told the seamstress to do it. Well clearly mum told A about it, because she rang me up screaming at me that I had ruined the dress and that she was promised it by mum, I’m a horrible sister, being selfish and stealing this from her. She finished the call by telling me not to contact her and hung up, I was so shocked I didn’t say anything, but have been carrying on and off the last 2 days. she’s said she won’t come to Christmas is I’m there. \n\nI don’t want to cause problems with my family. I’m sorry my sister is sad about the dress, but I don’t know what else I could have done, she was there when I asked about the dress and didn’t say anything, it was obvious it would need to be shortened, and it’s still mums dress and she gave it the green light. \n\nEveryone is pissed at me because my sister has pulled out of Christmas, my fiancé says I did nothing wrong. Am I TA here?\n\nEdit: wow the comments are split! But this has made me realise ultimately I have f**ed up on this. I rang the seamstress to ask if she has started working in the dress yet (this all happened in the last 2 weeks) and she hasn’t, so I told her to stop, don’t do anything to the dress yet. I’m going to ring my sister, hopefully she picks up, and let her know that nothing has happened yet and hopefully talk it through with her and apologise for not calling her when I called mum. I’ll update when I have tried to talk to her.", "created_utc": 1671722444, "permalink": "/r/AmItheAsshole/comments/zsoic7/aita_for_altering_my_mums_wedding_dress/", "score": 221, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be TA as my sister always wanted to wear the dress too, and now it’s been altered in a way that she can’t in the future.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH. I do understand her being upset though. If she’d gotten to wear it first, it sounds like you would have been able to wear it easily after her; but due to the alterations needed, she can’t wear it after you. \n\nBut if I were the mother in this situation and both of my daughters wanted to wear the dress but allowing one to do so would require alterations that can’t be undone, I don’t think I’d let either of them wear it.", "INFO\nWhy didnt you talk to your sister? The „mom said okay“ sounds childish. This has always been between your sister and you.", "ESH\nYour sister is being very dramatic and not offering constructive solutions. But neither are you. You should have checked with your sister (since you know she wants the dress, too), explained the situation and worked out something that works for both of you. (Maybe there's another family heirloom that can go to her? Alterations that can be done to replace the skirt that you would at least partially pay for?)\nEven if there's nothing to be done, just going ahead with what you want without even talking to her is an AH move.", "YTA.\n\nI am short and I know how altering  hems work. Wearing it for one day would do nothing to the hem, it could be let back down 100%. But you chose to cut it making it irreversible.", "NAH. I can sympathize with the sister albeit she shouldn't have been rude towards you. You knew she wanted the dress too, even if she isn't engaged at moment she might be in the future, and now you've altered it in a way it probably won't be usable for her.\n\nBut also you have an opinion of a seamstress, so I understand why you'd have gone with that. Maybe keep the dress and in the future reach out to other seamstress to get their opinion on what could be done to the dress? I would have gone with multiple seamstress opinions from the beginning tbh, just to see if there was anything else that could be done to the hem or the skirt of the dress to make it reversible.", "YTA\n\n&#x200B;\n\n\"I don’t want to cause problems with my family.\"  Sure does not look like that was ANY priority when you knowingly hurt your sister.\n\n&#x200B;\n\nYou and your mom are AHs. And you lost the relationship to your sister over it. There is a good reason you did NOT talk to your sister before ruining rhe dress KNOWING she would not be able to use it after that; ou KNEW it woud hurt her, and she would not gree ... but you wanted it MORE Than the relationship with your sister,\n\n&#x200B;\n\n\"Everyone is pissed at me because my sister has pulled out of Christmas,\" .. she likely has not pulle dout of christmas, but ended the relationship with you. NO MORE family time, from now on it is either her OR you.\n\n&#x200B;\n\nCLEAR YTA", "Unfortunately YTA because of this:\n\n>My mum has a beautiful wedding dress that I have always loved, and so has A. We have both always said we would love to wear it one day\n\nSo, you KNEW your sister wanted to wear it. But only checked with your mom about the irreversible alterations. What were you thinking? Of COURSE you should've asked your sister too. And no, the dress needing to be permanently shortened is not \"obvious.\" I'm no tailor, I have no idea what goes into adjusting wedding dresses. If you ask me they're all long af. I don't know what's reversible or not.\n\nIf I were you I would tell the seamstress to hold off if it isn't too late. You and your sister need to have a discussion about this together and patch things up. It's not fair if you're the only one who gets to wear the dress simply because you got to the altar first.", "YTA.  As a seamstress, I can tell you that the chances are low that wearing a dress with a deep (temporary) hem for a day would ruin it.  It would have been reversible.  You apparently didn't even try that option, you just chopped off the bottom irrevocably.  That's pretty selfish, since you and your sister both wanted to wear the dress.", "Could you wear the dress for the ceremony only with reversible alterations made then wear another dress for the reception? It's not uncommon for brides to switch dresses at their wedding. \n\nYTA for knowing how much the dress meant to your sister, how hard a time she's having with you getting married first and then decided to completely ignore her and not reach out to her about the dress before making alterations. The dress might be in your mom's ownership, but if you care about your sister's feelings, why wouldn't you include her in the conversation about altering the dress?", "YTA\n\nYou seem very self involved. In your position, I would halt the irreversible alterations to your mother’s wedding dress until you come to an amicable agreement with your sister.", "YTA, you knew the dress was important to both you. Calling your mum was a way of avoiding a difficult conversation with your sister.", "ESH because others’ feelings really weren’t considered all-round. OP didn’t really appreciate sister’s feelings and sister isn’t either. No contact is harsh, but she’s really caught up in wanting to get married herself.  Your relationship is ruined because of a dress. Surely the TWO OF YOU could have come to a solution TOGETHER. Sorry. Sounds awful", "NTA. The dress currently belongs to your mother, not your sister. Your mother said the alterations are fine. There you go.\n\nYour sister is clearly in a bad place emotionally. It sounds like she's wrapped much of her self-worth up in the possibility of a man, instead if investing it on the reality of her own personal growth.\n\nIt was never just the dress. She's mad at you for having what she wants, and if it wasn't the dress it would be something else...you took her dream venue, you had the same wedding cake design she dreamed of, you named your kid something way too close to a name she's always loved, etc.\n\nBesides that, she can still wear the dress someday. It won't be exactly the same, but oh well, women come in four billion different shapes and it would always have to be changed for her in some way. It might come down to adding decoration at the bottom or something, but I'm sure someone is creative enough to make it work.\n\nHowever, it sounds like her desperation is causing personality issues that may be driving suitors away. I don't think she can expect to wear the dress until she learns to love and value herself as-is...self-love really does look wonderful on a person.", "YTA- you have big golden child vibes", "Your mom is the asshole for setting up this shitty dynamic where she made you the golden child and tells you about your sister’s secrets and allows you to destroy something meant for both of you. YTA for enabling your mom’s favoritism. \n\nHonestly, it sounds like your sister should just cut you all off.", "NAH. Technically. Although you knew the dress was prosmied to the both of you. That's why you asked if it could be altered in a reversible way. So it would've been the tactful thing to do to ring your sister and tell her what the seamstress said before going ahead. Or even ask another seamstress for a second opinion. I'm not too knowledgeable about sewing but I think it's possible (but a much bigger job) to undo the skirt part at the waist, pull the whole thing up and restitch. Again, I'm not too sure and surely the pattern/style could not make this possible for some dresses, but I would've still asked a few more seamstresses to be sure. Whatever the case is, your sister could've had a chance to either give her blessing in advance if you talked to her, or tell her in time that she's not okay with this. It might've been obvious to you that the dress needed to be altered permanently, but if might not have been for her.\nI do feel that she is quite distasteful for her reaction though. She's not even engaged,  and the dress was given to you. For you to wear it, it needs to be altered. That's not your fault. And she could've said something when you were given the dress, along the lines of \"please do everything you can to preserve it in a way that I can wear it too later\" . And holding a grudge about it seems childish. As beautiful it might be and as important it might be for the both of you, in the end it's just a dress.\nYour mom also could've though about this before handing the dress to you, and knowing she promised it to the both of you, could've had a discussion with you two about how to make sure you both can enjoy it.\n\nIn general all I see here is something that was supposed to bring you three closer and be a nice family thing, and instead it turned into this bitter, unpleasant mess. I don't think I'd even want to wear that dress now.", "ESH, but mostly you and your mom.\n\nJust because your mom said you could do it doesn't make it right.   You could have shopped around and checked a few other seamstresses/tailors to see if they could suggest a way to alter the dress in a reversible way.  And you could have talked to your sister first too.   If she had just assumed she could use the dress it would be one thing, but you said your mom had actually promised it to  her as well--that makes her expectation reasonable.\n\nAnd your mom promised the dress to both of you, then agreed to allow you to change it in a way to make it unusable to your sister.  It's not unreasonable to expect that her promise would include a good faith effort to make sure it is usable for both of you, which she clearly failed to do.", "INFO: did you talk to your sister before the seamstress made the cut? you said you talked to your mom, but did you also clear it with your sister since you were both promised it?", "NTA\n\nIt's obvious that you'll have to alter the dress unless you and your mother have the exact same body. You mum said it was ok to alter. \nBy not allowing you to alter it your sister is saying she has priority over you. She's doing the same to you as she perceives you are doing to her.\n\nUnfortunately for her your wedding has come first and you need the dress to fit, and your mother has agreed. Your sister will just have to make do. Her insecurity about her younger sister getting married first seems to be exacerbating the issue. But that's her problem, not yours.", "NAH - I don’t think you’re the asshole for wearing your Mom’s dress but I understand why your sister is upset and I think this likely could have been avoided if you handled it with some tact.  \n\nBased on your telling, everyone thought that alterations could likely be reversed and when you realized they couldn’t you only spoke with your Mom about it.  Your sister is then told that her dream dress she’s wanted to wear her entire life has now been irrevocably altered and tough luck because you happened to get married first.  I just think it would have been nice to give her the heads up before the alterations were made and it may have softened her reaction.", "I’m stuck between NAH and ESH\n\nyou say your mom told you both you could wear it, how would you feel if your sister got married before you and altered the dress in a way that meant you would never be able to wear it?\n\nOf course she’s upset. Wearing your moms dress is clearly important to both of you but you are going to be the only one able to actually wear it just because you got lucky and are getting married before her. It’s not exactly fair. \n\nI’m not saying you shouldn’t wear it, but I’d be devastated if my mom promised me I could wear her dress and one of my sisters altered it so much that I couldn’t. So I have a hard time calling her TA for being upset and angry about the fact that something your mom promised her is no longer happening just because she hasn’t found a partner yet", "Nta \n\nIn the same way a panel can be put back in, a panel can be added to lengthen again. \n\nIt might not be perfect, but that’s the way the cookie crumbles\n\nI think this is more about your sister feeling that she’s not following the life pathway she wanted.", "NTA. \n\nAsk to have the bottom length saved so that it can be reattached, in hopes that it's not noticeable when reattached. \n\nIt sounds like your sister is feeling an internal clock of her own design, which is unfortunately a \"normal\" feeling in women. \n\nI hope she works through her emotions and I'm sorry for the rift that was caused.", "YTA", "YTA. 1. You didn't talk to your sister. You know you should have 2. You didn't talk to another seamstress/tailor, you know you should have 3. There was no guarantee the dress would be ruined w/ the turned up hem, the was a chance it would have been ok or only slightly damaged. You didn't go w/ that option. Why? Why make it permanent if there was even the slightest chance the other option would work?\n\nThese 3 things indicate there is more going on here and makes me think this is a missing reasons post. \n\nYou are really adamant about your sister being jealous of you getting married first. How is that actually relevant to what you did? Your emphasis on your sister's jealousy makes me believe this is FAR more about your sense of entitlement and your dismissal of your sister's rational feelings of anger. You are trying really hard to lead people to conclude  \"She's just jealous b/c she doesn't have a man. She's so desperate\" along w/ \"I deserve to do what I want b/ c she can't even get a man\". To me these are pretty unsophisticated tells. \n\nFYI - your fiance's opinion is irrelevant. I'm sure he doesn't understand the depth of hurt you sister is feeling and I'm also sure he fell for your \"She's just jealous\" BS.", "NTA she can always have the skirt altered and wear it at a tea length. Maybe if she had a wedding planned I'd feel different but she may never wear the thing", "NTA. You asked your Mum first and got the OK.", "NTA. You tried to make it so it can be reversed, which is above and beyond. It's not your fault, or even your sisters, that you're getting married first. While your sister can have her feelings, taking it out on you and then being manipulative is unfair. If anything your sister should be mad at your mom. While it's nice that she offered the dress to both of you, your mom had to realize that alterations had  to be made. However, this does not mean your sister still can't wear the dress, perhaps it can be altered again to be a knee length dress, or even T-length. I understand that it's traditional to wear a floor length gown for a wedding, but there are other options. \n\nIf your sister doesn't want to come to Christmas, that's on her and frankly, your mom needs to have a conversation with her about this more so than you do.", "NTA\n\nAnyone who's angry with you because of your sister's choice is in the wrong.   You asked your mother, you asked your seamstress to make reversible changes, and to the best of her ability to do so, she did.   The fact that your sister is being a drama queen is not your fault.", "NTA You are different sizes, so it need to be altered. I would imagine it can be altered again when it is your sister's turn. Perhaps a new bottom is added and you could help with the cost? To me it really sounds like she is upset you are getting married first and she is taking it out on this issue.", "NTA. Gotta say tho, if my whole fam was taking sister’s side, I personally wouldn’t go to Christmas.", "NTA - your not going to prevent yourself from altering a dress so that you can wear it in the eventuality that your sister finds a mate and get's married. That's absolutely ridiculous! There are ways to have the dress altered back or she can simply find a new one.\n\nEither way, it is your day and your doing the bare minimal alterations to fit your body type. If you were to have let's say completely altered and changed the dress (such as in the movie 21 dresses) I would completely understand the sister's frustration. However even then, your mom gave you permission and it's your day.\n\nI think the real issue here is the fact her sister is getting married before her and that she feels she is lacking in life, or is a tad envious or jealous. It happens but it's nothing to ruin a family relationship over.", "NTA, the dress belongs to your mom and she cleared it. Your sister knew you were gonna wear it and knows your size difference, what did she think you would do? They can likely re alter the dress if A ever wears it. Maybe you could offer to pay for alterations when A gets married to calm her down? \n\nIn any case congrats on your wedding!! It's so lovely that you're wearing your mom's dress, it's going to be amazing and so special!!", "NTA I don’t get why people are saying YTA it’s obvious that both girls wanted to wear the dress at their wedding. It just happened that op is getting married first it’s the mums dress if she said it’s ok it’s ok. I don’t see why op should go without her dream dress just because her older sister has not been lucky enough to find a man to marry her. I just ask that you try and be understanding of your sisters feelings how would you feel if it was the over way around and your older sister was the who was permanently altering the dress so she could wear it and then you wouldn’t be able to.", "People still wear their mom's dresses!?!\n\nNAH", "No, NTA. I think your sister has a lot of issues she may need professional help for to get into a good head space. Your mom is the owner of the dress, she said it was ok, therefore you are good to go. Yes, it may mean that your sister will not be able to wear the dress and that sucks for her. It's up to you do decide what to do. And you will have to live with that decision for the rest of your life. Again, NTA, you did nothing wrong. But if it upsets your sister this much, is that dress really worth the trouble? Can you not have a copy made? Or tell her you will have the copy made for her when she gets married down the line? Or something? I think it may be worth thinking on how to solve this...", "NTA. Have a wonderful wedding.", "NTA yet, \n\ncall the seamstress and tell her to stop alterations. Get a 2nd opinion. And a 3rd. Show that you’re trying to salvage the dress for your sister. This may not even be about the dress but that you’re getting married first and she wants to pick a fight. \n\nIs the dress more important than your relationship with your sister ?", "[deleted]", "NTA. The greenlight your mum gave you is more than enough. Sister is being jealous and very entitled.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis story involves me (27f) my sister A (31f) and my mum (60f). \n\nI’m getting married next year to my wonderful fiancé, we are very happy and exited. My mum has a beautiful wedding dress that I have always loved, and so has A. We have both always said we would love to wear it one day, and mum has always said we both could. \n\nA is single, she really wants to find someone, get married and have a family and I want that for her too, I want her to be happy and she will be an amazing mum. I know she is happy for me getting married, but she privately said to my mum how difficult she was finding it that I was getting married before her. \n\nSo I ask mum if I can wear her dress (A was there), she says yes as she had said all along I could. However I am a lot shorter than my mum and sister, I also have a bigger bust. So the dress needs to be altered to fit me. I spoke to a seamstress and asked if it could be done in a reversible way. She said the bust could be taken back in, as she will out in a panel (or something similar) but even if the hem is turned up and pinned, wearing it all day will likely damage it, she doesn’t think it can be let back down. \n\nI rang mum after to check if this was ok, and she said yes. So I went ahead and told the seamstress to do it. Well clearly mum told A about it, because she rang me up screaming at me that I had ruined the dress and that she was promised it by mum, I’m a horrible sister, being selfish and stealing this from her. She finished the call by telling me not to contact her and hung up, I was so shocked I didn’t say anything, but have been carrying on and off the last 2 days. she’s said she won’t come to Christmas is I’m there. \n\nI don’t want to cause problems with my family. I’m sorry my sister is sad about the dress, but I don’t know what else I could have done, she was there when I asked about the dress and didn’t say anything, it was obvious it would need to be shortened, and it’s still mums dress and she gave it the green light. \n\nEveryone is pissed at me because my sister has pulled out of Christmas, my fiancé says I did nothing wrong. Am I TA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I think I have to go with NTA. But your mom kind of is for promising the dress to both of you when you don’t have similar body types. Alterations are inevitable. Your sister is being wildly unfair. You aren’t stealing anything from her - she isn’t in a relationship and she isn’t getting married. You are. Are you supposed to put your life on hold until she finds that person? That’s unreasonable. Unfortunately I think a whole lot is going on in your sister’s mind right now that it isn’t just about the dress - it’s the fact that her younger sister is hitting these milestones before her.", "This is the plot of a movie....is it 27 Dresses? I think it's 27 Dresses.", "Isn’t this the plot of 27 dresses?", "INFO when you rang your mum to ask about the alterations how clear were you that the bust could be undone but the hem length could not?", "Agreed. I think YTA unintentionally, but I think in this situation once you learned irreversible damage would be done you ideally should have talked to your sister about it rather than just your mum. \n\nAs much as you have the “right” to alter the dress because you’re getting married first, knowing that your sister *also* really wanted to wear the dress AND feels sad about not being on the way to marriage before her younger sister this was a somewhat easily avoidable situation.", "Agree.", "Her sister was present for the conversation.", "So her mother couldn’t make a decision about her own dress?  As soon as OP’s sister said that she wanted a go on it - regardless of not having a relationship - that was set in stone?  She has to take no responsibility at all for her Christmas-ending tantrum?\n\nThe dress wasn’t RUINED, OP chose alterations which are reversible, and isn’t it just as easy to say that OP’s sister wanted the dress MORE than the relationship with her sister?\n\nCLEAR NTA", "This is a great idea!\n\nIf wearing the dress all day would mean the skirt is damaged and not able to lengthen it later OP should just wear it for the ceremony and get another dress for the reception to minimize the damage so it can be lengthened for sister later", ">YTA for knowing how much the dress meant to your sister, how hard a time she's having with you getting married first and then decided to completely ignore her and not reach out to her about the dress before making alterations\n\n\nWhat bullshit is this? If Op asked for the dress (in front of her sister), did her sister not also know how much it meant to op?\n\nWhy is she having a hard time that Op is getting married first? Her business?\n\nIf this was a responsibility, will she want to carry it first? What makes her entitled to marry first?\n\nOp decided to ignore her completely- how? \nAnd not reach out about the dress- why? Is the dress hers?", "Wtf? OP had the courtesy to *ask* her mother (the owner of the dress) before making any alterations, AND even did her best to get alterations that could be *reversed*. The rest of your comment reads like how dare OP not prioritize her sisters feelings over her own. 😂", "Nah, I hope OP doesn’t listen to you. Her sister may never get married. Then what, nobody deserves to enjoy the dress because the older sister is jealous? Maybe that temper of hers is the reason she is single.", "My thoughts exactly", "Oh yes, how *dare* OP consider her desires for *her* wedding over her sisters feelings.", "It IS OP's problem, because she seems to want her sister in her wedding and in her life.", "The cut off part cannot be reattached without being horribly noticeable.  Like, unwearably ugly.  Also, some length would be lost.", "People are saying YTA precisely *because* both girls wanted to wear the dress and not only that, but both girls were promised the opportunity to wear the dress by their mother. Perhaps they didn’t know a decade ago what goes into wedding dress alterations, but that was probably not a great move in hindsight because it’s created the situation that exists now.", "Some have been worn for generations.", "It is unlikely this can be solved. Too late for that.", "But without some of the fmily.\n\n&#x200B;\n\nSister will not come, and some others will follow her lead.", "I think when mum promises both girls that they get to wear the dress, not first come first serve, it gets dicey. Sure, it belongs to her and she okay’d this. But you can’t promise both of your children that they get to wear the dress then agree to irreversible alterations and expect the one who now can’t wear the dress to not be upset.", "She was there when she asked about the dress like „can i wear it?“. This was nothing new.\nThat does not mean she heard the part about cutting the dress etc.", "No, OP chose alterations that aren’t reversible. Perhaps that was the only way the alterations could be done, so it was less of a choice, but whether or not that was the case it seems pretty clear that it would have been a kind thing to do to speak to her sister about it first before agreeing to the alterations. \n\nOPs mother can absolutely make a decision about her own dress. Unfortunately, she made a bad one in which she promised the dress to both daughters and now both daughters can’t wear it. The ideal scenario here would have been, if it was determined, that any needed alternations would be irreversible and keep one sister or the other from wearing it, they should have agreed to not wear the dress or figure out a new way to incorporate it into their own respective dresses.", "The hem alterations are NOT reversible. The dress is too short for sister now, because the bottom was chopped off instead of hemmed, so it can't be lengthened.", "IT IS irreversibele, so the dress is ruined.\n\n&#x200B;\n\nAnd: this is not about the dress, but about mom and OP going behind sister's back.\n\n&#x200B;\n\nTHis will cause family drama, and many will boycot the wedding: Sister will be the foremost to do that. \n\n&#x200B;\n\nNothing wrong with that.", "Sounds like OP went ahead and had it chopped off.  YTA for not looping in your sister, getting a second opinion, or doing a deep temporary hem, which would have at least offered better odds of her being able to wear it.  Maybe there was no way to avoid some issues, but it seems like you and your mom made no attempt to balance your needs and your sister’s. Is her response disproportionate?  Yup.  But you also seem all shocked pikachu face that she would be hurt that you made permanent alterations without talking to her.  Saying that she knew you were going to wear the dress is disingenuous.  That does not mean that she knew that you were going to make permanent alterations that would make it hard if not impossible for her to wear the dress too.", "Let me rephrase then:\n\nDoes OP want to have a relationship with their sister? \n\nIf the answer is no, then sure, none of what the sister's feeling or wanting matters because the sister doesn't matter to OP. OP is entitled to do what she wants with her mom's permission with the dress. What OP is not entitled to by doing all that, is a relationship with her sister. So OP being all upset that her sister is mad at her, won't talk to her anymore and won't attend Christmas or OPs wedding, is OP feeling entitled to a relationship with her sister despite proving to OPs sister she doesnt value the sisters wants and feelings. \n\nIf the answer is yes, then it is OPs responsibility to hold value in her sister's feelings and wants. To find a compromise so that everyone can be happy and feel valued and special. \n\nNow regarding the whole \"my sister was there when I first asked mom, she had the opportunity to speak up then\" part. OPs sister knows that OP knows how much the dress matters to OPs sister too. Part of valuing a relationship with someone is valuing their feelings enough to directly include them in the conversation. Most people will not speak up in those situations because they aren't being asked and they know they don't have any entitlement to an opinion. In other words, her sister knew she wasn't entitled to an opinion on whether OP could wear the dress or not, so she didn't say anything. That doesn't mean she didn't want to. It means she thought her sister, OP, cared enough that OP might ask her directly.", "Why ask? \n\nBecause whether or not the dress belongs to their mother and was given to OP, she knows that sister also wanted to wear it and their mother promised it to her as well. So when she found out that it would need to be irrnversably altered and thus not likely able to be worn by her sister, the kind thing to do would have been to call her up and explain the situation to prevent this exact thing from occurring.", "Honestly? Kinda. \n\nThat’s a fair thing to do when, as a parent, you promise something to both of your children without realizing that allowing one of them to wear it will prevent the other from wearing it. Is it the only option? No. But it does negate any feelings of jealousy and competition that have been stoked between your children, which is something you should try to do as a parent. \n\nAlso, super unkind and gross to say “your reaction to something that hurt you is why no one will love you”.", "I'm impressed more than anything.", "They are family, it is never too late.", "[deleted]", "IT is, wen OP's siter choses to have it that way.", "Sister is just reacting to a situation that is difficult for her. Have some compassion man. If everyone would give up that easily, it would be a sad world.", "YTA do what can be reversible and pin up the length. Where the dress for the wedding and pictures then change into another dress for the reception. That way the dress won’t be damaged and your sister can wear it.", "I’ll go with ESH, you mentioned how much are both you and your sister love the dress, so it’s not a secret that she might actually want to wear it as well when she gets married I feel that you were being a little bit obtuse. But at the same time, I understand you asked for permission from your mom and she gave you the green light. Which I don’t think she should’ve done knowing that your sister would want to wear it as well, and the modification would make that impossible.\n\nOP at the end I would just give the dress back and hopefully find the dress of your dreams somewhere, to be honest it sounds like less of a headache, then dealing with this mess created. Either both of you get new dresses or maybe you guys can take a piece of the dress (with fair compromise and permission) and alter it to your own dress that you pick.", "No dress is worth damaging your relationship with your sister and casting a cloud over your wedding day. It's a joyful occasion and you are the lucky gal. Be gracious. Do what you must to show you care about your sisters feelings. Congratulations on the upcoming marriage!", "YTA\n\nThe hem could have easily been pinned and then let back down after. You knew how much it meant to your sister, but you went ahead and took it from her anyway.", "INFO: what is the style of the skirt on the dress? \n\nSometimes, rather than shortening from the bottom, it can be (difficult but) possible to shorten it from the waist and hide the folded fabric in the flare of the skirt, making it easier to lengthen again and preventing damage to a rehemmed bottom.\n\nAlternatively, fold and tack the skirt an inch or so off the ground and add a lace band around the bottom to touch the floor.", "NAH. I get all points of view, and all the emotions attached to them. Might be easier to just get your own dress and let her have mom's. Then nobody gets any opinions about it. Get your own dress, plan your wedding and be happy.", "Short girl here. I wonder if you could have it gathered at the sides and front and back to shorten it. It would look a bit like Cinderellas dress in the 70s. Then after the wedding it could be released to the original length again.", "YTA, my mom and her sister both wanted to wear her mom's wedding dress. My mom got married first and didn't alter the dress at all, it didn't fit her perfectly but it more about the meaning of the dress than the fit. She wore a different dress for the reception. My aunt did make alterations to the dress but it was after my mom had already used it. But it sounds like from your edit that you're not actually altering the dress without your sister's permission so for that you are N T A after all.", "No judgment but I really suggest you talk to another seamstress. While I am in no way skilled enough to alter a wedding dress as a sewer none of this makes sense to me. Adjusting the bust is way more likely to permanently ruin the dress. \n\nAlso either she needs to cut fabric to hem the dress or she doesn't. I can't imagine how wearing the dress for a day would destroy the hem. The only way you would really permanently destroy something is by cutting it. Maybe depending on the fabric the stitches of the hem would make holes that would still be visible after it is undone. But again that would permanently alter it through tailoring, not by wear.\n\nGoing back to the bust it is way easier to make things smaller than bigger. Is it possible she wanted to make the panel from fabric from the skirt? Because even if she makes a new panel to increase the bust size if the fabric is different it is going to stand out. Again even if the dress is a basic white satin the whole process of added this panel with new fabric to match is more difficult than doing a temporary hem.", "NAH. What you could do is wear the dress for just the wedding with the temporary alterations and get a reception dress that you use for most of the pictures and the reception.", "Maybe you literally split the dress and use parts of it for a veil or dress so both of you can have it", "You need a different seamstress - it is absolutely possible to hem most garments so the hem can be let back out. NAH, though, since you had permission from the dress owner", "Reddit will never cease to amaze me.  If OP's sister had written this, she'd be called the AH for having a screaming tantrum over a dress when she's not even seeing anyone.", "no judgement because honestly i have no idea, but could you panel the bottom and JUST wear it for the ceremony and some pictures so that the hem isn’t ruined and it can be let down for your sister before you change into a different dress for the reception (as many brides do anyway), that way you can wear the dress in some way and your sister can as well? I appreciate that money wise this might not be doable", "NAH. Lots of feelings and little discussion of compromise that could solve this. Involve sister in discussion, and take the dress to more than one seamstress to get opinions if you have to.\n\nSome options that may work, possibly using multiple suggestions to really make it work (depending on the cut of the gown and just how much shorter you are than her):\n\nDon’t cut it, hem it and let it back out after the wedding - a little steam will help with the new sewing holes, if not, worst case scenario you just add some lace at the bottom to cover them for sister. It will still be beautiful and sentimental, and sis gets to add her own touch picking out lace. \n\nYou wear the dress a little too long for your ceremony & photos, then change into another outfit for the reception.\n\nAdd a bigger hoop or petticoats to lift the hem from the ground for you.\n\nYou wear higher heels than you normally would and she wears shorter heels/flats when it’s her turn.", "YTA\n\nRight now it sounds like a shared heirloom, so I think you can’t make choices that will affect both of you without mutual approval.", "Your Mom, although the owner of the dress, isn’t going to wear it again. \n\nYour sister, who you knew would wear the dress again, wasn’t even consulted before the alterations were made. \n\nYTA", "YTA. you *did* ruin the dress for her, whether intentional or not, that makes you the AH.", "So, if your sister never gets married, what will become of the dress?", "Also, I'd get a second opinion.  How fragile is the dress that wearing it would damage it?  If the problem is, say, stains at the hem, can't a ribbon guard be basted on and taken off after?\n\nOr why not alter the length at the waist if the hem is to fragile?", "seamstress here! (I alter wedding gowns, make custom ones, and make historically accurate clothing) There is no way one day with a temporary hem could hurt this dress like that, unless the dress is already damaged or compromised in someway. (time isn’t kind to textiles; it wouldn’t have necessarily been anything anyone did, age and gravity are just heartless aholes) If it’s that fragile, then NO ONE should be wearing that gown at all. If one day of wear with a temp hem will ruin it, then one day of wear in general will ruin it too. If the concern is the hem dragging the ground and ruining the fabric to the point it can’t be let out again without showing off the damage too, add a ribbon band at the bottom that can be removed. If it has a train, then have the tailor/seamstress sew in an additional new piece of temporarily lining onto of the existing lining, (it doesn’t need to go all the way up the skirt, just cover the part of the train that drags the ground, but if you want to be really safe, go up a little further.) Sew it into the lining layer only, not the fabric that everyone sees or you’ll have weird thread lines on the dress. This temporary lining piece will protect the upturned hem and train from fraying/damaging the fabric and from staining, Problem solved! After the wedding, send the dress back to the tailor, have them remove the stitches and the temp lining, then either have them steam/press it or send it to a dry cleaner and have them do it. If your seamstress is good, no one will ever be able to tell it was hemmed and then let down at all. \nNo matter what you do, I highly recommend you go to a different seamstress/tailor, yours either doesn’t know what they’re talking about, becuase if they did they would know that there are soo many ways to make this work. Or, they know it’s doable, know it’s going to take a little extra work/time and little more thinking, and they just don’t want to have to do it, but also don’t want to lose your business. Or they’re worried that if they tell you it can be done but it’ll cost more, that you’ll walk away and they’ll lose your business. \nThis is absolutely doable, just requires a little more work and potentially a little creativity, but it IS doable! It will cost a little more, because it will take more work to do. Please, go get a second and even a third opinion before you let ANYONE go near your moms gown with scissors or a seam ripper. You’re NTA, but I do think you have been mislead by your tailor. \n(Edit for spelling/grammar and attempt to curb word vomit)", "YTA and this post makes me glad I don’t have sisters. Y’all sound so selfish towards each other. You really should be ashamed", "Based on your edit, you sound like an amazing sister. I'm feeling a little teary, as a matter of fact, to read something so wholesome here. It makes a nice change. Best wishes to your family, and hugs to your sister. I hope she can make peace with her troubles. NTA", "YTA for not talking to your sister -- I think you knew it would be a hard convo and a hard sell.", "ESH it sounds like your sister had an emotional reaction to the dress and where her life is. You should talk to the seamstress about pinning the bottom wearing it for the ceremony, taking pictures and then changing to another dress and see if it saves the dress so your sister can wear it for her future wedding", "It was an unrealistic promise to make by your mother to begin with. Hopefully you can work out a compromise", "NAH. But, talk to another seamstress and see if the dress can be shortened from the waist without cutting the excess material. Or even just get different opinions about how to alter it. Fwiw, I'd want to know why she thinks it would ruin the hem even if it's turned under. If it's because it will brush the floor, have her hem it slightly shorter so it's not touching the floor at all as you walk.", "YTA you knew all along it meant for you both to wear and your sister always made clear she would want to wear it, and now you made it impossible for her to have her dream dress. You could have wear a huge shoe to make you taller, you could wear a second dress after the ceremony, there was other ways.", "Is wearing the dress worth hurting your relationship with your sis?", "Nta.  The sister might never get married.  The dress can be shortened to a shorter dress if she does, or the skirt can be altered into a tiered skirts.  First come first serve.", "NTA. What does your sister expect you to do? Not wear the dress so maybe she can wear it one day? It’s a disappointment to sister for sure but sister is acting childish and jealous. And there’s always a way to tailor the dress to fit your sister later. A good seamstress can redesign the skirt and add to the length. Expecting 2 daughters to wear mom’s dress with no changes is unrealistic.", "I don’t understand how she’s the bag guy here???\n\nSister is single with no husband anywhere in sight, so why doesn’t she get to have her dream wedding dress if she’s actually getting married??", "Nta. I think you’re being very considerate of your sister and I think she’s being a little unreasonable since a wedding is not in her immediate future and may never be. And if she does get married, depending on the groom, the venue and her preferences at that time, she may decide not to wear the dress. Can the dress be shortened and then an underskirt designed to lengthen the dress later for your sister?", "NTA\n\nIs it possible for her to add material to the bottom if it is hemmed? That way, y'all both still get THE dress, but it would be a little different for each of you.\n\nAnother possibility, you wear the dress for your wedding and then she gets it and has a christening gown made from it for her future children. This way you both get it for a significant life milestone.", "[removed]", "YTA for pulling this crap and then acting all innocent. You KNEW your sister wanted to wear that dress.", "NTA. \n\nI might be in the minority here but I say do the alterations.. \n\nGranted the dress can't be let down.. but lace or other fabric can be. So the dress will be even more special with each Brides additions. \n\nThis is so beyond ridiculous. Anndddd, what if the older sister never marries. What a stupid argument to have.. 🤦🏼‍♀️", "NTA.  Only one of you can wear it and there isn't enough reason for you to step aside so that she's that one.  She's not engaged or even dating, so it may be a long time until she marries (if she ever does).  You don't need to save it for her just in case that happens.", "Nah.  Find a way to comprise.  Talk to the seamstress with your sister.  If it can he hemmed up and the main concern is damage from wearing it all day wear the dress for the wedding and change for the reception.  You could also discuss putting a second layer underneath after you wear it.  It will still be the same dress but layered at the bottom.", "I'm actually going to to NTA here. I was going to say NAH because your sisters sadness is valid, but I think she has a lot of feelings around weddings and dresses that while also valid are blinding her a little. I think you are trying to do what you can to preserve the dress. The bust can be adjusted, you aren't altering the look, just the length. That is kind of an expectation when you get a dress.\n\nI imagine she always thought she'd get married first and since she's taller it would have been fine, and then when it was your turn you could alter it and it wouldn't impact her at all. The cards didn't work out that way and she's struggling. I think that's fair. She's expressed it's hard for her to see you being married first, and that's a valid feeling but not one that she should be taking out on you. What I don't find fair is her taking out those hard feelings about her own life on you, and now others, by being pretty dramatic.", "NTA, it was your mothers dress and you called to confirm that you can alter it. She said yes. I don’t know why everyone is freaking out over a dress when the sister doesn’t even have a boyfriend. I find it hard to believe it can’t be altered again for the sister.", "NTA but this is not about the dress. Even if you forego entirely the dress and choose to buy a new dress, the problem will still be there.  One day you will say you got X venue for the reception and she will throw a gigantic tantrum saying \"oh, I dreamed to have my wedding there since I was a little girl, you are stealing that for me\", then you choose other venue and next she is upset because you chosed the rickrolling song for the fisrt dance and she goes \"I hate you, I always pictured my wedding with the rickrolling song as first dance, you are stealing that from me\" and so on. She feels resentment and hate but it´s her problem, it´s out of your control.  you can´t help to marry first than her, it just happened.  It´s up to her to deal with her negative emotions and purge them out of her system", "NTA - Wouldn't even bother talking to your sister again, just be glad she's gone", "NTA.  Can you have a different skirt made to attach to the bodice of your moms dress?  Then after the ceremony the original skirt can be added back.", "Your not the ah! Please continue with getting the dress fitted! Your mom said you can she’s the dress owner and whatever she says goes. I feel like your sister is trying to ruin your big day because your getting married first. The dress could sit up for years or not used at all. Your sister won’t find a husband over night and should be happy that your able to wear it.", "NTA, not sure why you are getting hate. It is very easy to increase the length if your sister ever gets married. You have done nothing wrong here.", "NAH/NTA\n\nTo expect you to wear a WEDDING dress and not have it altered to your body is ridiculous. Your sister is allowed to have all the feelings, but she is not allowed to make you the villain as a result. I don’t understand all the Y T A responses, what do people expect you to do, wear an ill-fitting dress to spare your sister’s feelings? Also, what if she never gets married, who will be the asshole then?", "**NTA** \n\nAs both of you have different body types only one of you can really wear the dress  \n\nAs it stands it is your *Mother’s” dress and she gave you permission to alter it. \n\nYou even did your best to ask for alterations that could be reversed. \n\nGiven that your sister does not even have a BF much less a wedding date - it appears to me to be very selfish of her to criticize and “punish” you for customizing your mothers dress for your own upcoming wedding", "NTA. I thought it was going g to be like that movie 27 Dresses where the sister butchered the deceased mom's wedding dress. You aren't doing anything wrong. Maybe you can be extra careful with the hem.", "NAH - she's jealous of you getting married, and upset at the thought of the dress being changed before she can wear it, I understand it, even though she's being dramatic about it.  You asked and your mom said yes, it's her dress, and A knew you were going to get to wear it first. \n\nI think you made the right call though, stopping the irreversible alterations.  Maybe it's worth getting a second opinion about the hem?", "You have a wedding date set and your sister doesn’t even have a boyfriend, but she gets to dictate that her needs come first? So you don’t get to wear the dress and she might never get married so the dress will hang in the closet for a total of 60 years until maybe you have a daughter who can wear it. You should get a second opinion from another seamstress and just wear it to the ceremony and change for the reception. But you should shop for a dress that is special to you. Your sister is going to be upset that your bust is bigger than hers and the dress won’t look the same on her anyway.", "Yeah, I'm hung up on the comment below calling OP TA when the truth is either it's OP asking her sister to give up the dress *or* it's her sister asking HER to give up the dress. So either there are no assholes here or ESH because it's an equivalent ask from each. \n\nSeems like the best solution might be for neither of them to wear it and just get their own.", "That doesn't mean she didn't want to. It means she thought her sister, OP, cared enough that OP might ask her directly.", "As she was there when I asked my mum and they are 5 inches taller than me. Honestly I just didn’t think to call her, I now know that I screwed up massively on this, Im trying to fix this and have edited the post with more info.", "She never said she had the dress cut though. It says a temporary hem.", "“ You apparently didn't even try that option, you just chopped off the bottom irrevocably”\n\nWhere are you getting this? OP said she called the seamstress and cancelled the alterations before any were made…so it wasn’t chopped.", "tell me you didn't read the whole thread with out telling me and you cant even manage to edit your answer to correct yourself🤔😒", "A reeeeeally high pair of heels would do the trick.", "the sister isn't even dating anyone. why should she get a claim on the dress if there's no wedding, not even a relationship, in sight??", "The dress hasn't been touched. You need to apologize to OP", "Thank you so much for the detail in your comment. Between you and several other seamstress that have commented on here, I definitely need to take it to someone else. I know basically nothing about clothing alterations so just took the seamstress word for it, and that’s on me, thankfully she hadn’t started yet! \n\nThe dress is made of silk and it’s ball gown style, it’s does have a bit of a train, it’s also got off the shoulder straps and not big puffy sleeves like most dresses from the 80’s. There are some silk roses on the dress that match the headband and veil. \n\nI say it’s obvious it needs to be shortened is because my mum and sister are 5”6 and I’m 5”1 so there is a big height difference. \n\nStill trying to get hold of my sister as I said in my edit", "Of course it is about the dress tf. \"If it wasn't the dress it would be something else\" you're just imagining things at this point, she doesn't want the dress she dreamed of being altered to a point that it would look ridiculous on her. And no, she can't wear it anyways bc wedding dresses are really specific, if it was meant to be long it will look weird not being as long as it should. And almost all wedding gowns are maxi, depending on the height difference between the sister's it wouldn't even look like a wedding dress anymore. And really? Adding decorations to the bottom?? Tacky, especially bc people would already know how the dress was suppose to look.", "Right? I also sew and if the hem is to fragile to alter, then alter the length of the dress at the *waist*.  Then the hem stays the hem.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Woah, that’s a bit harsh! Yeah I’m not happy with being screamed at down the phone but I love my sister and wouldn’t do anything intentionally to hurt her. Hence why I am now trying to fix this whole mess", "I'm glad that the seamstress hasn't started and this situation if salvageable. If you value your relationship with your sister, which it sounds like you do, don't try to convince her to be okay with any non-reversible alterations. She has the right to be deeply hurt that you didn't think of her when you went ahead with changes that would prevent her from ever be able to wear this dress for her own wedding.", "She probably didn’t realise that taking the hem up would be an irreversible alteration. I didn’t immediately think it would. But I guess that’s because I’m thinking of dresses when I was a kid where my mum let the hem down after they’d been worn for a couple of years without issue. But I realise now that with a wedding dress. where the hem would drag on the ground, that trying to let the hem down could result in a mark or damage where the higher hem was. (Assuming that’s what the seamstress meant?)\n\nPerhaps you can take your sister along with you to the seamstress so you can discuss options? Maybe, as another commenter suggested, you could have the hem taken up but only wear it for the ceremony (on carpet) and then change for the reception. Possibly wearing it for just a short period, and being careful about where, might may cause as much obvious damage? I’m assuming you can’t go tea length? And avoid the ground altogether!", "Wrong.  Seamstress told her a temporary hem would probably not work, so she told seamstress to go ahead and cut it off after talking to her mom.", "Calling the seamstress is in the EDIT which was not part of the original post.  The original post said she told the seamstress to cut the hem off.  Perhaps you could look up what the word \"edit\" means.", "OP told the seamstress to cut the dress to make it shorter.   From the update I just read above, it looks like OP just called the seamstress in the last few hours, and seamstress had luckily not cut the hem yet (and now the work is on hold).  But OP absolutely intended originally that the dress be irrevocably cut off.  I have zero need to \"correct myself\" about anything.", "That is a good compromise. I also wonder if a band of lace could be appliquéd to the bottom later to cover any damage? OP should discuss that with the seamstress.", "You're right but that would make her a asshole tho. Being an asshole is not about who's right or wrong. People who don't have sympathy for others (in this case the sister) are assholes", "Let me give you a tip on maintaining relationships with people: you need to hold value in their feelings. \n\nOP can do whatever she wants to. But she can't be surprised and feel entitled to a relationship with her sister when she does something that she knows will hurt her sister. There's consequences to every choice we make in life. If OP wants the dress of her dreams and her mom gives her permission she has every right to prioritize herself. But the consequence is losing a relationship with her sister. That's OPs choice to make.", "OK? So maybe OPs sister will never get married. OP making reversible alterations and wearing it for half the time is a compromise so both sisters have the opportunity to wear the dress. They both would have the opportunity to enjoy the dress in that situation not neither of them.\n\nOPs sister being upset and wanting to remove herself from a relationship with OP is a 100% valid feeling she is fully entitled to feel and act on. It's not \"having a temper\", it's someone valuing their feelings enough to remove themselves from a relationship where the other person did something that would knowingly hurt them without discussing it first. \n\nIf your SO cheated on you would you stay with them after? No, they intentional did something that they knew would hurt you and didn't even bother to talk to you first. It's completely reasonable to cut someone out of your life that intentionally hurts you without at least discussing it first and trying to find a compromise. \n\nYou sound like someone who's been told your whole life your feelings are not valid and don't have value by the people who should have valued them. It's not \"having a temper\" to be hurt by other people's actions. It's called being human.", "I don’t see why this is such an outlandish idea when were specifically talking about a dress that was promised to both sisters. Like yes, if you value your relationship with your sister and are considering doing irreparable damage to an item that means a lot to both of you, yes it would be nice to consider her feelings too. How would it not be?", "With a dress that isn't hers? Yes, exactly.", "Yes exactly. You don’t get act like an ass just because it’s your wedding. Don’t know if you are aware of that or not", "apologize to OP? this sub is for judging lmao", "She didn't know it when she wrote the post and when I commented, in her head it was a done deal. My comment was based on the post. I'm glad she was able to stop ruining the dress in time.\nYou need to stop giving orders like that.", "No problem! If you’ve got any questions or need advice with this, let me know! I’m more than happy to help! Make sure when you go to be measured/fitted for the alterations that you’re wearing the shoes and undergarments you intend to wear the day of your wedding, it’ll help with hemming and making sure everything fits just right!", "Believe it or not, 6 inches won’t be hard to do this with at all! The shape of the gown will be helpful too, the biggest problem your tailor will run into is dealing with the crinoline (the stiff netting underneath) just because it’s slippery and is better off done by hand.", "I agree that the situation is a problem for OP because of her sister’s reaction, but OP is NTA. A situation can be perfectly fair even if it causes resentment and jealousy because that’s just how life turns out sometimes. Unfortunately there is no outcome where both sisters get to wear the dress and I don’t see why the sister should get priority, especially as there is no immediate prospect of her wearing it", "I did not know that. That's unfortunate.", "But her mom told her afterwards and she called her sister to tell her to not contact her. She should've tried to discuss with her sister before she freaked out. So they would've been able to come to some sort of compromise. I mean I've got a couple ideas off the top of my head that allow both of them to wear it. But instead of her being rational, she freaked, and thankfully even tho time has passed nothing has been to done to the dress yet. Her concern should've been making sure the dress was left in a condition that was wearable for her also not a hissy fit. I get being angry but as they say don't bite your nose to spite your face.", "This is how hems were kept safe in historical dress since they wore the same thing frequently. They applied some sort of braiding or trim to the bottom that could easily be removed to save the more expensive fabric and make it more easily altered with changing trends. \n\nThe same should theoretically be possible with the dress.", "No, OP edited to say that they haven't done anything yet.", "I mean if we follow your logic, then obviously the sister doesn't give a fuck about OP either because she's asking her not to use the dress by demanding that she not alter it. I don't really see how OP is TA here but her sister is not. Neither of them should wear the dress tbh.", "Reddit doesn’t care about that. With any slight or familial obligation the only advice is go NC 🙄", "Oh, I'm judging you, you can count on that.", "You should apologize for jumping to conclusions. Nothing in her original post indicated the dress was cut.", "\"Unfortunately there is no outcome where both sisters get to wear the dress! .. But there could have been anoutcome where they discussed it instead of the AH pulling a fast one and then trying to guilt the other into keeping the peace.\n\n&#x200B;\n\nThe Message OP is sending is: IKNOW, but I will still do it. So fuck off, and keep the peace.", "So all of that is fine is everyone involved agrees with the process. OP’s sister clearly did not and instead of OP talking to her about it and trying to find a solution before agreeing to the changes, OP went ahead with them. It’s fine if her wedding being how she wants is more important than her sisters feelings, but it’s also fine if sister feels put out by that. Whether or not random people on Reddit think her response is too extreme is irrelevant, because it’s already her response and how strongly she feels about the situation. \n\nMaybe she can still wear it in some drastically altered form, maybe she can’t. We don’t know the specifics. Regardless, I don’t see how anyone can argue with the idea that the objectively kinder thing to do would be to communicate with sister before making these permanent changes.", "If you were told than an action was already being undergone that did irreversible damage to an object you cherish, would your first reaction be “I know this thing is already happening, but let me reach out to my sister who didn’t have the courage to tell me herself to discuss how that thing could not happen the way it’s already happening and instead brainstorm something else when the seamstress already had the dress”? Genuinely? You wouldn’t think “wow this is already happening and I don’t have much choice in changing it because I wasn’t asked”?", "After it was decided that the alterations would happen. That's the key part. Sister was told *after* OP said to *permanently* alter the dress so it wouldn't fit the sister by being too short. \n\nThe bust is able to be taken in but the only solution to make it shorter for OP means it won't fit the sister who is taller.\n\n OP told mum \"gonna change the dress\" mum told sister, sister got hurt realized OP doesn't care if she can wear the dress still so told OP \"fuck that shit have the dress but it's clear you don't care enough to tell me that you're going to make it impossible for me to wear it as well so I am dropping the rope of the relationship\"", "No, OP edited to say the seamstress hasn’t done anything yet. OP fully requested that the alterations be made and it is just lucky that the seamstress hasn’t gotten around to starting it over the last 2 weeks.", "OPs sister didn't demand OP not to use the dress or not to alter it. There are compromises that no one decided to discuss together and explore whether they will work or not. \n\nI do agree with you about if neither of them can wear it without causing the other person not to be able to wear it, neither of them should. \n\nBoth people can be TA here but intentionally doing something you know would hurt the other person and doing it anyway without discussing it first does make YTA", "I hope you didn't forget to harass everyone who said Y T A.", "They don't need to apologize for not being psychic.", "You should apologize for harassing people.\n\nThe comment wasn't even cruel or offensive! \n\nBut thanks for the laugh!", "My first reaction would b omg no! I need to c if I can change her mind. Not I'm gunna scream at her and possibly convince her to do the opposite of what I want out of spite. I'm an adult. Not 12. So no, I wouldn't react like that. I would not hit someones line acting a dang on fool and then expect them to do anything that benefits me. And I didn't c it as lack of courage, it seemed like oversight. She said that their is a noticable body difference in her and her sister. So why it wasn't brought up when she asked mom for the dress is beyond me. Sister, mom, op all could've and should've said something then. Like you're way shorter than me so what are you thinking about for hems? Or what about the bust? Have you talked to seamstresses about what options you have that will still allow me to use the dress? Etc.  And her sister was hella dramatic about it.", "The original comment says that it sounds like OP had it chopped off, I was merely pointing out that that's not the case.", "It seems pretty clear that OP can't wear the dress at all without alterations. You can't squish boobs into a dress that's too small for them. My vote is NAH and I think neither of them should wear it.", "hurting her and then guilting her for ending contact is not going to cut it."]}