{"id": 538, "submission_id": "yhhiv0", "title": "AITA for telling my roommate she can't host so many movie nights in our room?", "selftext": "Hello, I need advice on if I'm actually in the wrong or not. I (18F) live with my roommate we'll call her Alice (18F), in college. Alice is aro-ace, this will be important. She has a projector and likes to host movie nights in our room when I'm not there. \n\nRecently I had two shitty nights and every time I've come back there's been 5+ people in my room past 11 pm. Yesterday after they cleared out I asked my roommate to not host so many especially when she is aware I'll be coming back. She said okay and went to join her friends in the hall.\n\nMy boyfriend(18M)stayed in my room late that night to comfort me. When my roommate came back she saw us and said \"I don't understand how you asked me to not host so many movie nights when you didn't even ask me if he could stay the night\" to which me and him said he wasn't and we were waiting for her to get back so he could leave.\n\nAfter he left she said she wanted to talk. She told me, whenever me and him cuddle, dance while we talk (a weird thing we do), or just show PDA to each other it makes her uncomfortable. She said she's not sure if it's due to her being aro-ace. Also saying that she doesn't want him over as often, he's normally over 5-6 times a week. While she either has her friends in our room for similar amounts of time (alittle less) or stands with our door open talking to them, whenever I'm trying to sleep. Also claiming that because they aren't friends it feels like he's a stranger in her room. And that she hoped they would become friends yet she said every time he's here, he's here for me. Which I thought was normal and that they shouldn't be like friends but more acquaintances.\n\nI felt like she kinda attacked me after I brought up movie nights. Like she wanted to get back at me. Though she said she's felt like this previously. I had asked in the past if he made her uncomfortable and she said no. So I'm confused about how to fix her issue or if I should just keep living the way I have been? Or if I'm even in the wrong here. So AITA?\n\nEdit: My bf doesn't spend the night, and 5-6 is a highball. Like last week he was over 4 times. I just gave a higher number cause I wanted opinions but he normally isnt over that many times a week.", "created_utc": 1667144834, "permalink": "/r/AmItheAsshole/comments/yhhiv0/aita_for_telling_my_roommate_she_cant_host_so/", "score": 19, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) bring my bf over a lot, and ask for less movie nights. (2) to my roommate I may be acting hypocritical.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH you both have people over too many times a week", "ESH - I think you both need to talk your boundaries out or consider not rooming together. While he doesn't spend the night, that's 5-6 days where your roommate feels it's not her home. Flip side, nights she hosts these movie nights, you don't feel like it yours either. \n\nThis is at breaking point and only you yet can decide if you can salvage it", "ESH. You are both having visitors in a shared room too often. I am certain that your dorm has lounges where she could host movie nights and that there are other places on campus where you could hang out with your boyfriend most of the time. Stop trying to use a shared room that's mainly for sleeping like it's your private studio apartment, and take most of your socializing somewhere else.", "Why do American colleges make students share rooms? I would be extremely uncomfortable with this and choose to live off campus to avoid it", "NAH  However, your boyfriend is coming over a lot. You can be together in other places and if he's over that often you are  monopolizing the room.", "Nta I'm also ace, and I see people cuddleing and being affectionate.  Cause, you know, life.  There's a difference between having 1 person over during the day and 5 to 6 people at night.  If she has 5 to 6 people in her movie group, why don't they all rotate who hosts??", "ESH. \n\nIts not just her space and its not just your space. It's both of your guys spaces, and if one or the other don't want people hanging out there at certain times, both have to respect that.", "YTA.\n\nYou have boyfriend over without telling your roommate but got upset that she has people over without telling you.", "Nah.  You spoke up about an issue with your roommate and she did too.  You both have valid points.  You both have been inconsiderate to each other.  This is part of dorm life.  You have a roommate and you both have to be considerate of each other.", "ESH. Tone down the pda and be respectful. And she should not be having social events in your room without asking. Sounds like you both should abstain from having visitors until you can come to an agreement", "info - can she have movie nights as often as you have your bf over?", "NAH. \n\nSo you both complained to each other, and now you have to sit down and come up with some new roommate agreements. \n\n1. How many times can your boyfriend be over a week, and what does \"over\" mean? For example, if she comes home and he is there, but leaves within 15-20 minutes of her getting there, that doesn't count. But if he is there overnight or for a full evening when she is there, that counts. \n2. What is a time when no one should have people over? For example, by midnight, the room is all cleared out and it is just the two of you, and you agree to no noise (aka, no standing with the door open chatting with friends, no taking phone calls). \n3. However many times your boyfriend can be over a week is how many times she can have friends over, again with a time limit (midnight, people go home). \n4. And then how do you two communicate when the plans need to change because you or her are having a bad day- can you two agree that if either of you have people over and the other person says \"please, today was tough\" you will cancel, so long as this isn't like a weekly thing. \n\nI think her bringing all that up with your boyfriend was not well timed. I don't think they made it up, but you saying something about her guests made her decide to tell you. That's okay, it happens. \n\nSo reset/set some boundaries about how often you can each have people over.", "NAH\n\nStop looking at it as \"she's getting back at me\" you two need to just express what makes you uncomfortable without judgment.", "Esh, you two need to set boundaries, find compromises or not live together.", "i'm also aro ace - and you're totally NTA.\ni also would have asked her not to have so many movie nights. i mean... there's a huge difference between your BF and a bunch of people...", "NAH\n\ni think you two just have to talk with other when someone is coming home, it’s not that difficult", "NAH - you guys need to communicate more and learn each other’s boundaries. This will help you have a better living situation.", "NAH. I would have said everyone sucks, but it looks like you have open lines of communication and are willing to talk about it and compromise. \n\nThe situation sucks because you both have people over way too much for a shared room. To date, you've both been treating the space as you would if no one else were there.\n\nMovie nights in a shared dorm room are frankly ridiculous, but if your roommate is really invested in them, they should be rotated among the group so your roommate hosts no more than once a week. As far as your boyfriend being over, subjecting someone else to PDA is rude and gross. Try to find a compromise on the number of days he spends with you vs. at his place. It's hard to relax when someone else is in your space.", "Yes and no.  It does seem like your setting expectations for your roommate that don't apply to you.  You can ask her to reduce the amount of people maybe but you don't get to put restrictions up when you have bf 5 to 6 times a night.", "ESH I don't understand why you are both sharing a room since you both like people over...get a single room", "NTA and tbh, I think it’s weird af that your roommate’s sexual orientation should dictate how **you** live your life. If she was lactose intolerant would she also be upset at you eating cheese in front of her?  \n\nI also think it’s SUPER weird that she wants to be friends with your bf and expected that to happen just bc you’re roommates. Of course he’s just there for you, he’s your boyfriend? You are roommates. Not life partners. You share 4 walls. At the bare minimum, all you owe one another is common respect, cordiality and decency. You do not, at all, have to be friends. \n\nLet’s say every Wednesday night, nobody is over in your room. Thursdays and fridays, she can have her movie gatherings, Monday-tuesdays, Bae comes over, the weekends can be a rotating deal to be fair. “Curfew” is at 10pm. Get an erase board calendar, and the last weekend of every month, you write out plans for the next month.\n\nOnce the year is over, hopefully you’ll have found somebody more your own speed to live with. And hopefully she’s found a single for herself.", "Your boyfriend is staying over 5-6 out of 7 nights a week? And you know that your roommate is aro-ace on top of that? YTA.", "NAH.\n\nYou two need to come up with rules that apply to *both* of you equitably. So sit down with your roommate during a calm period and figure something out: movie nights X times a week, visitors (romantic or otherwise) Y times a week, no visitors after 11:00 PM, and/or whatever works for *both* of you.", "NTA. I’m AroAce. You are in your room. Not in public. She will have to learn to deal with PDA. The world doesn’t conform to what we want. Cuddling, dancing or any other socially acceptable PDA is something that we deal with. I assume you and your boyfriend are fully clothed while this is happening?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHello, I need advice on if I'm actually in the wrong or not. I (18F) live with my roommate we'll call her Alice (18F), in college. Alice is aro-ace, this will be important. She has a projector and likes to host movie nights in our room when I'm not there. \n\nRecently I had two shitty nights and every time I've come back there's been 5+ people in my room past 11 pm. Yesterday after they cleared out I asked my roommate to not host so many especially when she is aware I'll be coming back. She said okay and went to join her friends in the hall.\n\nMy boyfriend(18M)stayed in my room late that night to comfort me. When my roommate came back she saw us and said \"I don't understand how you asked me to not host so many movie nights when you didn't even ask me if he could stay the night\" to which me and him said he wasn't and we were waiting for her to get back so he could leave.\n\nAfter he left she said she wanted to talk. She told me, whenever me and him cuddle, dance while we talk (a weird thing we do), or just show PDA to each other it makes her uncomfortable. She said she's not sure if it's due to her being aro-ace. Also saying that she doesn't want him over as often, he's normally over 5-6 times a week. While she either has her friends in our room for similar amounts of time (alittle less) or stands with our door open talking to them, whenever I'm trying to sleep. Also claiming that because they aren't friends it feels like he's a stranger in her room. And that she hoped they would become friends yet she said every time he's here, he's here for me. Which I thought was normal and that they shouldn't be like friends but more acquaintances.\n\nI felt like she kinda attacked me after I brought up movie nights. Like she wanted to get back at me. Though she said she's felt like this previously. I had asked in the past if he made her uncomfortable and she said no. So I'm confused about how to fix her issue or if I should just keep living the way I have been? Or if I'm even in the wrong here. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Are you talking about a shared bedroom?  This living situation is alien to me as someone from the UK. At a UK university it would be normal to have friends/partners round every day in the shared areas , but no one shares bedrooms in the UK so it might be different where you are", "You don't get to limit who she has over while you make out with your boyfriend in the same room you're trying to tell her she can't watch movies with her friends in. Get over it or stop being a hypocrite then you'll actually have some ground to work on.", "INFO There's such a wide range in \"roommate\" setups, it's kind of hard to be consistent in judgement.  To give an example, I went to college at a residential college, if you didn't meet one of three specific exemptions you lived in a school owned dorm.  Residence advisors, shared gang bathrooms(one six-holer, six splasher per floor of 20-30 rooms), each room had two students, no divider walls between beds etc.  A dorm built after I graduated is suite-style, each residence suite is a 4 pack of individual bedrooms opening onto a communal living room type room and there's a 2hole2splash bathroom off the living room.  \n\nThis really sounds like a college dorm to me, rather than an apartment, and in this case the college policies are going to have as much sway as actual propriety.  IF you college is set up like mine was, there's a plethora of other options for them to congregate, it does not need to be in the individual rooms.  Every dorm had a lobby and a lounge, for example.  Student union had rooms that were able to be reserved for student groups and organizations, be they official, unofficial, or just pickup.\n\nVisitors/guests need to be agreed upon by both roommates, this is where you and your roomie seem to be butting heads.  \n\nI lean towards-ESH in this.  Like so many posts in this sub, you need to communicate.  You're potentially an ahole for having bf over all the time.  Additionally, it's not clear, does he spend the night?  you're 100% the ahole if so.  Roomie is also potentially an ahole for having people over so often, especially if it's crossing into quiet hours and disturbing you.  \n\n&#x200B;\n\nI'm not even going to touch on the aro-ace and triggering behaviors, other than to say that if the conflict cannot be resolved with communication, perhaps these roommates should be seeking different living arrangements?\n\nTL;DR COMMUNICATION IS KEY!!  TALK TO YOU FRIGGIN ROOMMATES PEOPLE!!  Come to an agreement about visitors and significant others BEFORE the situations arise.  If you want to be able to live without compromise, don't live with roommates.", "It's during times when she isn't here", "Will do! It's just going to be a change of habit. Thank you for replying", "We're forced to live on campus our first year ;-;", "That's what I had offered for him to be over less but she didn't give a me defined answer", "Oh well obviously \"because, life ya, know?\" What a thoughtless argument.", "I do tell her, and she does sometimes too. It's a issue both ways", "I didn't tell her to just stop entirely, just not so many.", "Thank you", "I agree, this is why I ask constantly about if she was uncomfortable cause the last thing I want to do was make her uncomfortable in her own \"home\" if you can call a dorm that", "He doesn't spend the night and I high balled cause it depends on the week. I should have been more specific", "Getting single rooms here is basically impossible", "Not sure what their roommate being aro-ace has to do with it.  Asexuality is their sexual orientation, if they're that sex repulsed they can't be around other people showing normal amounts of PDA then that's something they need to work through for their own sake.", "There's a big difference between one or five people", "He's not spending the night, just coming over during the day.", "Thank you will definitely try", "Yes, fully clothed PDA, I have shame lol", "I'm in the USA in college/University so yes we share a room", "And she probably isn't there because she knows the home is not hers when he is", "I was too, but I got my own room 😁", "She told you he was over too much. It means he's in your room too often and you need to have him over less. It's really pretty cut and dry.", "Why are you mad. They’re just saying stuff happens, and that the roommate can only do so much to control other peoples behaviour for their own comfort.", "He might as well be moving in if he's over that many nights...", "Yeah, the whole \"dorm\" thing isn't really fair because people can't just live normally and have to make weird bargains and compromises.", "Doesn't matter that he doesn't spend the night.  Why can you have a guest but your roommate isn't?  Like I said you can request fewer people but you can't tell her what schedule to keep when your bf is over that much.", "Someone can have things they need to work through, and they can also clearly communicate those things, as in this case. If you’re sharing the same bedroom as them, and are doing things that they find triggering deliberately, that’s an AH move. If you don’t want to help support someone in their evolution (fair enough) the next best thing would be to put in a request to switch rooms.", "Spending time with one PDA couple can be way more annoying than spending time with 5 people quietly eating popcorn and watching a movie.", "That is still a fuckton. Spend half the week at his place, so your roommate can have the spot to herself to have friends. Then have him over 3 days a week. Talk through boundaries and run having people over by each other. In this case, it sounds like you were out of the room when she initiated her plans. If she knew you were having a bad week and you needed to be supported by your boyfriend, maybe she would not have had them over.", "Then you have nothing to worry about. Your boyfriend isn’t staying the night, he is visiting. You could switch it up and visit him to shut her up though. \n\nEither way, you two need to set a curfew where everyone is out unless they are sleeping there by a certain time.", "Name checks out", "Right but my point is that them being aro-ace is not relevant to the issue. If this was someone gay with a straight roommate and they felt uncomfortable with the straight-sex PDA for whatever reason, them being gay isn't the relevant factor, their discomfort is.", "sorry, but i'm also aro ace and if i had problems with people being all PDA and loving around me, that's MY issue. can't expect people to change their way of living because i'm uncomfortable. if they straight up make love while she's there OK, but cuddling? c'mon.", "Yeah I think that's different for different people. I'm just introverted, and would hate if I came home to five people in my room.", "It depends on the week sometimes he is over less than 3 its just a range. I tried to highball instead of lowball.", "Yours doesn’t. No chance you’re sentient.", "It’s literally relevant because OP said in the post their roommate thinks they could be uncomfortable because they are aro-ace… “she’s not sure if…”", "Yeah IDK. When I was in college dorms, I was the loud one with the friends who’d be coming in and out. My roommate was the one with the boyfriend. As much boisterousness as me and my friends brought into the room, I had to deal with waking up to a 3rd person sleeping in the room feet away from me, or a guy sitting at her desk when I walked out of our shower in a towel, or the toilet seat up in the middle of the night. It’s more intimate trespassing.", "I always make sure he's gone when she showers, and he barely has spent the night."]}