{"id": 5397, "submission_id": "zsv0qw", "title": "AITA for getting into an argument over someone reclining their seat on an airplane?", "selftext": "I (26 female bodied human) just got off a ~4 hour flight.\n\nIt was pretty packed with holiday travel, and my bag took up all the space under the seat in front of me, so I was sitting with my knees against the seat in front of me.\nThe older lady (60ish?) in front of me starts trying to recline her seat, and her seat kept hitting my knees.\nThe first few times, she kind of peered and glared at me.\nFinally, she turns around and is like \"Do you mind?!\" or something like that. \nI said my knees were there, and she was crushing them every time she reclined, and when she tried to insist on reclining anyway, I added that it was rude to recline on planes anyway when there's so little space.\n\nI wasn't trying to be rude or start an argument, but the seats were quite cramped, and I wasn't kicking her on purpose or anything, that's just where my knees were (I have long legs), and I had tried stretching them out in the aisle, but stopped because people kept nearly tripping and bumping into me.\n\nLady starts getting upset, and ends up telling me \"You're everything that's wrong with the world these days\".\nI was pretty peeved at that, and called her an \"Entitled B****\" in response.\n\nShe gets really pissed and goes to complain to a flight attendant.\nI try to explain that I didn't start any trouble, she got upset because my legs were in the way and she kept hitting them trying to recline, yet expected me to move somehow anyway. \nThe lady acts like I'm the problem, and like I'm the one who started it because I called her a name, even though she had prefaced that with her comment.\n\nSo wondering here... Was I the asshole? I thought it was typically plane etiquette to not recline, or minimize reclining, as there's limited space.\nI do recline sometimes, if I'm on a really long flight, but always check behind me first, and if I was literally hitting someone by reclining, I'd feel bad, but idk. Thoughts?\n\nEdit: I'm not so tall that I need extra room, I had plenty of room until the last started reclining. She was trying to recline pretty far back so it was getting pretty cramped and I had nowhere else to put my legs.\nI thought the space under the seat in front of you was for bags anyway?\n\nEdit: My bag wasn't so huge that it was cramped or anything. The seating had limited enough room that just sitting normally, my knees were not touching the seat in front of me, but when the person started to recline, it hit them.\nI didn't have any choice here with booking, or what order to board in, this was a connecting flight, and my airline rebooked me on this flight (which was full) after a delay on their end caused me to miss my original connection.", "created_utc": 1671738466, "permalink": "/r/AmItheAsshole/comments/zsv0qw/aita_for_getting_into_an_argument_over_someone/", "score": 39, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I got into an argument with an older woman who was expecting me to move out of the way so she could recline her seat on an airplane, even though she was hitting my knees every time she tried to recline.\nShe said I was \"everything wrong with the world\", so I called her an \"entitled bitch\" in response.\n\nShould I have just let her recline? Or let it go?  Was I in the wrong for thinking it's rude to recline on a plane, especially if you're really infringing on the person behind you's space?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I'm 6'1\" and generally have enough room for my knees, even with a small backpack under the seat in front of me.  The person in front of me can generally recline, but it ain't comfy.  So I'm not sure why there wasn't enough space, although you didn't say how tall your woman-shaped body was.\n\nIf she kept banging into your knees, she should've stopped.  There simply wasn't room.  And she sure as hell shouldn't have been yelling at you, that would've been a good time for \\*you\\* to call the flight attendant.\n\nNTA.", "NTA. Until the Department of Transportation mandates more space in between seats, we all have to realize that flying may be an uncomfortable experience. That means you don't recline into the person behind you. \n\nYes, I will absolutely die on this hill. (Yes, I have gotten flight attendants involved and they have all been on my side.) No, I do not respect contrary opinions. \n\nFor those who say \"well, the seat reclines,\" that's not sufficient. Just because the seat reclines does mean that you get to use the feature under all circumstances.", "NTA\n\nIf someone buys a seat and that seat was designed to recline, I wouldn't say that's entitlement. Your handling of it with escalation was not right.\n\nBut let's be clear on who the AH actually is: the airlines who configure these planes to pack people in them like sardines. And then they put seats that can recline in that mix. SMH", "Flight will be the death of us all.", "Info - what did the flight attendant say/do?", "INFO: If your bag hadn’t been taking up all of the space under the seat in front of you, would you have been able to stretch out your legs and put your feet there?", "NTA. To all the people saying that you had too much luggage, you don’t know that. It depends on when your “zone” is called & how much luggage other people have brought. I have seen people get on planes with large back packs, totes & shopping bags, just one person with all those bags. End result? No room for my one bag except under the seat in front as the bins are crammed. As for reclining, people can be assholes about that. I recline a bit but have had people fully recline then get snotty when I bumped their seat while trying to get out to use the washroom. It is a jungle up there in the skies and a little consideration goes a long way.", "NTA - I’d honestly just forget about it. The woman sounds like she was just looking for trouble.  I can’t understand why she would keep trying when you explained that your knees were there. I think reclining is only really acceptable on long haul flights as there is usually more leg room.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26 woman bodied human) just got off a ~4 hour flight.\n\nIt was pretty packed with holiday travel, and my bag took up all the space under the seat in front of me, so I was sitting with my knees against the seat in front of me.\nThe older lady (60ish?) in front of me starts trying to recline her seat, and her seat kept hitting my knees.\nThe first few times, she kind of peered and glared at me.\nFinally, she turns around and is like \"Do you mind?!\" or something like that. \nI said my knees were there, and she was crushing them every time she reclined, and when she tried to tell me to move anyway, I said that it was rude to recline on planes anyway when there's so little space.\n\nI wasn't trying to be rude or start an argument, but the seats were quite cramped, and I wasn't kicking her on purpose or anything, that's just where my knees were (I have long legs), and I had tried stretching them out in the aisle, but stopped because people kept nearly tripping and bumping into me.\n\nLady starts getting upset, and ends up telling me \"You're everything that's wrong with the world these days\".\nI was pretty peeved at that, and called her an \"Entitled B****\" in response.\n\nShe gets really pissed and goes to complain to a flight attendant.\nI try to explain that I didn't start any trouble, she got upset because my legs were in the way and she kept hitting them trying to recline, yet expected me to move somehow anyway. \nThe lady acts like I'm the problem, and like I'm the one who started it because I called her a name, even though she had prefaced that with her comment.\n\nSo wondering here... Was I the asshole? I thought it was typically plane etiquette to not recline, or minimize reclining, as there's limited space.\nI do recline sometimes, but always check behind me first, and if I was literally hitting someone by reclining, I'd feel bad, but idk. Thoughts?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Unfortunately it has (unfairly) become rude to recline on airplanes because there is just no room anymore unless you're seriously petite. Everyone is uncomfortable, so that lady was acting entitled. And yes, that space is very often used for bags, idk why are people are mad at you for that.\n\nThe real asshole here is airlines who have crammed even more seats onto planes so no one has room to be comfortable anymore.", "ESH. She has the right to recline, there is no secret law stating otherwise. Yes it was rude of her to keep hitting your knees but there was no reason to cuss at her. You also stated that you were squished because you brought a giant ass bag and stored it by your feet instead of the overhead a bit further away.", "NTA. \n\nAs much as it sucks, the reality is that seats recline, and so you can't stop someone from doing it. However, if your literal body is in the way, well then guess they don't get to recline. \n\nI have been on planes, particularly the back row, where normal sized people- varying heights and weight, but no out super tall or super big- had their knees touching the seat in front of them. If the people tried to recline, they hit those knees and the knees had nowhere to go. \n\nIt is the holidays, meaning flights are full and bags can't all go in overhead bins. Yours was in an appropriate storage space, but it meant you were a little cramped. Again, fine. Your knees exist, and cannot be moved, whereas a seat doesn't have to recline. The end.", "NTA. Your cussing at her was appropriate. She was entitled", "NTA and what you called her was apt for the situation. Wish you let her recline and kept your legs on top of her head and possibly took off the shoes. Would have been the last time she would ever want to recline the seat.", "NTA\n\nIt sounds like you were just sitting normally, which didn't allow the seat to recline. This is on the airline, not you. You are not obligated to stretch your legs to accommodate the reclining seat.", "INFO: Was there space to put your bag in the overhead compartment?", "Mostly NTA.  Now that the airlines cram in so many rows of seats, it is common courtesy not to recline.  You know you're screwing over the person behind you when you do.  This lady has probably been reclining seats since the 70s, so in her mind it is still normal (and it was, until probably 20 years ago or so).  \n\nAirlines are not going to take seats off of planes, because that would mean less money and more expensive flights. The only solution here is to remove the ability to recline seats on airplanes.  If people can't use it responsibly (i.e., when there is no one seated behind you), then just take it away.  \n\nEven OP admits she uses it \"on really long flights\".  Even if you check behind you and it doesn't look like you are hitting someone, you are still taking away the 1 ince of free space they have to actually move their legs on a long flight. So OP, you are still a bit of a hypocritical asshole here.", "NTA, she got upset b/c you didn’t allow her the typical conveniences she probably has received before due to old age. \n\nAnyway. You were in the right to say something after her trying to squash you with her seat even though clearly the plane is quite cramped and yes it is proper plane etiquette to look behind you before reclining.", "ESH. \n\nNormal plane etiquette is that you get a seat that fits you and doesn’t infringe on others space. It’s totally normal to recline your seat on a plane and I would consider that part of their space. This means if you’re spilling into the seat next to you - buy another seat. If your legs are too long - buy one of the seats with extra leg room. \n\nYou both escalated unnecessarily and were just downright rude.", "YTA. You travelled with a bag that doesn't zip, so you couldn't store it properly. People should be allowed to recline their seats. Flying sucks, but you made the situation worse **and** you were rude about it. Def the AH here.", "YTA. If you had just put your luggage overhead this entire problem wouldn't have happened.", "There is no rule, and airlines sell seats with extra legroom which you didn't decide to purchase. You felt entitled to someone else's seat which has a recline button that you didn't pay for but they did. YTA", "I do think you are TA, if the seat can recline you have the right to do that, if you need extra space pay for extra space seats.\n\nOf course it is nice to get the person who is in the back approval’s but its not the lady’s fault that you had no space under the seat..", "ESH. 1. You had way too much luggage so you put that under her seat so you couldn't stretch your legs. Lady was a bit rude reclining her seat. But it was for only 4 hours, not 40, so get a grip, ok?\n\nAlso: what do you mean by \"woman bodied human\"?", "NTA, I travel 14 hour flights and don’t recline unless im sure the person behind me has reclined and is comfortable as well, I expect the same from the person infront of me", "YTA - so the reason your knees were up ion the air is because you had an oversized bag on the ground under you where your legs normally go?\n\nI have flown with people who are over 6ft and have long legs, this has never been an issue that their knees are up high and the person in front of them hits their legs when they recline.\n\nSo I'm assuming you felt entitled to have an oversized bag take up all your floor and leg space sintead of putting it in the overhead which made the woman not able to recline her seat.\n\nHARD YTA", "NTA.  The seat pitch on all airplanes now is ridiculously tiny to the point where if you are a child, your knees will hit the seat in front of you.  The airlines need to solve this issue by at least doubling seat pitch AND fixing seats so that they are impossible to recline!", "NTA, it’s not your fault the airline doesn’t leave enough room and you explained there was nowhere for your legs.", "ESH\n\nSo let me start off with she had every right to recline her chair, there is no etiquette not to do this on planes. Some people may consider it rude, but at the end of the day it’s their seat to do with as they please. \n\nIf you have long legs why didn’t you plan ahead and book extra leg room, or bring a smaller bag that would have given you leg room? This part is why I don’t think you’re completely innocent here.\n\nNow, was she wrong to hit your knees over and over? Yeah absolutely, sometimes tall people are behind you and you don’t recline, she had every right to be irritated about it, but shouldn’t have snapped like that. \n\nI mean really people, most seats recline like 6in or less (if you’re in economy which it sounds like you were).", "There is no etiquette not to recline, unfortunately.\n\nLets do this step by step:\n\nYou didn‘t have enough space bc you brought so much luggage that your spot was packed, knowing that you have long legs: YTA\n\nExplaining her your situation: NTA\n\nExpecting her to accomodate your situation: YTA as you knew that this would happen with all the lugagge etc\n\nAs you made a sitation where she only can accept, no matter what: YTA\n\nHer, making a scene: you are NTA\n\nYou calling her bitch: NTA as it was just a response\n\nSo, it‘s 3 YTA and 3 NTA from my pov.\n\n\nIn dubio pro reo: NTA\nBut PLEASE bring less luggage and book a seat with extra space in the future.", "Air travel is awful. You made it worse. Calling someone a bitch inside a cramped plane where everyone's on edge to begin with is a terrible idea. YTA", "YTA\n\nIf I want to recline my seat, I get to.  If you need more room, buy a better seat or put your bag up.  If you don't like people in front of you, sit in a bulkhead row.", "YTA", "NTA. I don’t understand why she would keep trying to recline after the first time she hit you…did she think your legs would magically get smaller?", "NTA. But, unrelated, what does \"woman-bodied\" person mean? If you're using that language in an attempt to avoid transphobia, you might want to reconsider. You can just say you're a woman. There's nothing transphobic about just saying what you are. Saying you're \"woman-bodied\" centers womanhood on a specific type of body, which actually reads kind of exclusive of trans women.", "I will say ESH cause you definitely could have handled it differently and planned better but she was also being an AH.\n\nI do have to say though, I'm surprised by how many people are saying there is no etiquette concerning reclining your seat.  Everyone I know that travels (myself included) has always understood that you only ever recline your seat if the one behind you is empty or if you check with the person behind you.  It's not anyones fault that the airlines make seats that are too small AND recline but as rational adults its fairly common practice to just not recline.", "YTA!!\n\nUntil airlines stop having the reclining feature on their seats, people do have the right to recline. \n\nYou having your bags where your feet should be is solely your problem.  You should’ve found a way to ship your fragile items or had them packed in a way that they could’ve gone in the overhead storage. In the end though, it’s all on you. \n\nPeople have the right to recline without being insulted because YOU messed up.", "Esh, She has a right to recline, you have a right to have your legs with you in your seat. You could have stayed calm and called the air hosts yourself first. She could have not tried reclining so far. The airline is at fault here, but this woman seems to be a bigger asshole", "YTA. There is a reason larger carry ons are supposed to go in the overhead bins, so you have leg room. \n\nAlso, you must be hugely tall (sarcasm, you’ve said you’re not) because my 6’1 bf sat behind me on our last crowded flight and I was able to recline without causing him any issues.\n\nWhat kind of fancy plane was this with deep reclining seats? Every plane I’ve ever been on, the seats literally only recline like 3 inches. That’s not enough to cause issues, sorry. \n\nI’ve never heard of anyone considering it typical plane etiquette not to recline. Everyone I know reclines on flights. Literally everyone. Including you apparently… so if you can do it, you’re either an AH for breaking etiquette, or for expecting other people not to do something that you deem acceptable for yourself. \n\nI think the woman reacted pretty strongly but it sounds like YOU were being an entitled AH too. \n\nHappy holidays", "ESH. It’s polite to ask before reclining, but it’s also not your place to tell her she can’t do it. It’s her right, if you don’t have enough leg space in a standard seat then you need to buy a seat with extra space. And your luggage is not her problem, you should’ve just put it in the overhead compartment. Sounds like you were both rude but the whole situation was your fault and you were the one escalating it further so you are the bigger AH here. I understand your frustration since I’m very tall and have to fly a lot, but you were unreasonable here.", "YTA. We purchase our seat. We sit in the seat we purchased. The seat will recline a very few inches. She paid for the priveledge of reclining that seat.\n\nIf you needed more leg room, you should have paid for it.", "Yta \n\nI want to say nta because airlines helped cause this but you had plenty of ways to not escalate this and you didn't take them.", "ESH\n\nYou should have boarded the plane earlier to make sure you would get your bag into an overhead compartment, so that you'd have enough leg room.", "NTA, she was being rude and entitled.", "NTA.  Etiquette say not to recline your seat unless the person behind you has reclined theirs.  And both in the overhead bins and under the seat in front of you are were you are supposed to put your carry-on so just ignore anybody saying you shouldn't have a bag there. You were starting to get a little out of line with your comments but the old lady was way more out of line.", "Esh but she started it. \n\nHer complaining that your legs were hitting her when she reclined was the initial ah move. Then she upped it when she insulted you. You could hav e gone with something classy like, “there’s no need to be ugly ma’am,” and equally shamed her without name calling. \n\nShe totally had it coming though. \n\nAnd yes, the space under the seat in front of you is for storing a small bag. Like a purse, not a full blown carryon bag.", "NTA.  What did the flight attendant do?", "The airline industry is the asshole really. There isn't one god damned part of flying that is comfortable. They keep squeezing us into tighter spots while taking away things like food, non extra checked luggage and Wi-fi. If America ever switches to high speed train I will give those fuckers a big middle finger and never come back.", "NTA - I think they should get rid of the recline to be honest as it causes so many problems and arguments.\n\nThe person behind always suffers as they will be unable to put their tray down.\n\nThe only think I would say you did wrong was call her an entitled bitch. You should have called the flight attendant over.", "The seats are made to recline. If you need extra space, pay for extra space. And pack lighter. your bag was so big your feet couldn’t be put down and your knees were up? That sounds like a you problem. YTA", "YTA. You created the issue for yourself because you have a false belief that it's proper etiquette for no one to recline on planes. You thought someone was acting entitled for doing something they're literally entitled to do. The older lady could've handled the situation with more patience, but they were justifiably upset, and you should've moved your bag to an overhead bin once they were, not doubled down on your bad choice. You placed your convenience over others' and thought they were obligated to accommodate you after you'd done so.", "NTA. Sure, you shouldn’t have called her a name but she was being inconsiderate and entitled. If your knees were in the way it’s because there was nowhere else for them to go!!", "NTA. As someone who has flown a ton in the last year (probably 30 times at least) airplanes are cramped. People saying you “should have put your bag in the overhead” are missing the fact that you’re allowed an overhead carry on AND a bag that can be set on the floor under the seat. The bins could have also been full. It happens on every flight i’ve been on. You’re allowed to recline, so long as you’re being respectful about it. If i reclined and hit someone, I would immediately put my seat back upright; not try several more times and get pissy. She was being very rude. You were just trying to be comfortable as well.", "When they serve food or drinks, if the person ahead of me reclines, their seat is covering my tray. I have had fellow travelers refuse to put their seat up so I could eat, because they weren't comfortable if they did.  Nothing like a 10 hour flight with nothing to eat, poor though the food may be.\n\nI avoid reclining unless the person behind me is reclined and asleep and I put my seat up when asked. For those of us traveling in steerage, we're in it together.", "I don't recline my seat if there is someone sitting behind me, including long transatlantic flights.   It's rude to make someone suffer for your comfort.", "This is the only way to be all kinds of nice, polite, considerate, not an a hole etc,. I travel and have never understood people who recline when an actual person is behind them 🤔", "I don't believe for a second that the flight attendants agree with you that someone cannot recline their seat. Perhaps during take off/ landing, or during turbulence, but the idea that a flight attendant will tell someone they cannot recline their seat is bullshit. \n\nMaybe someone who's a flight attendant here can chime in..", "Unless there is no one behind you, reclining your seat in economy is a total and complete asshole move.", "She basically just tried to smooth things over, and said the lady had the right to recline, even after I explained she was hitting my knees and I couldn't put them anywhere else without stretching my legs into the aisle.\nI DID put my legs out into the aisle for part of the flight, but people kept nearly tripping over them, and I felt bad so I stopped.", "Its a danger to have bags on the ground. Especially one that is so oversized OP has to put their knees to the seat in front of her.", "The overhead compartments around me were all really packed. I would have had to put the bag pretty far away from me, and it had a few fragile things in it, AND doesn't zip closed so I didn't feel comfortable putting it in an overhead compartment.", "Presumably, OP's legs aren't always too long on every flight, or OP would've mentioned it.  If the airlines changed the pitch on my seat, how am I even gonna know that I need to get a new seat until I'm actually seated?  This seems like a high bar.\n\n(I generally have a couple inches of room for my knees, and the person in front of my can recline, although it's never comfortable for me.  Is it comfortable for anyone, unless you're all sleeping on a red-eye?)", "Not to mention OP created the situation by not storing her luggage overhead.", "That's the problem though.  The only seats with nearly adequate leg room are literally first class.  And many airplanes don't even have a first class section.  But you expect 300+ people on every flight to all buy a first class ticket?  This problem was started by the greedy airlines and can ONLY be solved by the greedy airlines.", "Hard no. Plane seats shouldn’t even be able to recline unless it’s a long haul flight. They’ve shrunk seat sizes so much that reclining means making the person behind you uncomfortable at best and in pain at worst. It’s an asshole move, especially when the person behind you is literally telling you it’s hurting them.", "Unless you book a seat that explicitly has no storage, I think most women expect to have space for their purse under the seat in front of them, and most women are not willing to have their purse (and they often don’t zip) stored where they can’t keep an eye on it.", "They probably had their roller bag up there already 🙄", "Just because you can doesn’t mean you should.", "What? I’m 6’5’’ and my knees are pressed directly against the seat in front of me at all times.", "Nope.  I’m a tall woman with long legs when people have reclined my knees are in the way and prevent them from fully reclining. Meanwhile my knees get bruised and sore and I have no way of moving them out of the way unless I want to move them to the side in front of whoever is sitting beside me", "OP would have not been able to have an oversized bag as hand luggage. It would have been the recommended size which should be able to go under the seat in front of them. Which would reduce the amount of leg room. \n\nI am 5 foot 3 and sometimes I feel massively cramped on flights. It is rude that the lady in front kept trying to recline and hurting OP.\n\nYou need to wind your neck in.", "I'm a 5'4\" woman and I've ended up with bruised knees on a flight from someone reclining into them. The only carry-on I ever have is a laptop case. Glad you haven't had that experience but it happens.", "Idk she did say she was everything that was wrong with the world...calling someone a bitch in response is not probably a great idea but totally understandable", "This is absolutely right. On a plane, keep your head down and don't stir things up. You're probably only there for a couple of hours.\n\nYTA to OP.", "Why", "I say that because I was born into a female body, and don't have a problem with being identified by my biological sex, since that's just biology, but I don't like gender stereotypes and prefer to just identify as human. It's something I've been struggling with and unpacking for a long time.\nI didn't intend for my language to come off as offensive in any way, I just say that because I'm not really comfortable saying I'm female in terms of gender identity, and I never know when people are going to assume I mean that I am biologically a woman, or that my gender identity is as a woman, so I prefer to just clarify that biologically that's what I am and that's the only thing I mean when I say \"woman\" or \"female\".\n\nIn this case I felt like it was important to clarify, as I feel this situation could have been read differently if it was a biologically/outwardly male person in the situation.", "It is enough to cause issues. I have been unable to use my tray table due to the person in front of me reclining, unable to move, unable to use my laptop, etc., because the person in front of me reclined “3 inches”. So am I to be unable to move because the person in front of me reclined?  I paid for my seat too.", "I really don't understand all these stories of magical seats that recline so far they hit people's knees. I've flown my whole life, a lot, and everyone has always reclined their seats and no one has ever had their knees so in the way it was physically impossible to do so, or that their knees were crammed basically against their chest... Including my 6ft 5, 350lb grandfather", "She literally said she could not move her legs anymore due to limited leg room. Is she just supposed to magically move her legs with no room available to accommodate the privilege of reclining the seat?", "Wait so people can only ever recline in a domino series? what about the last row that can't recline? Does this mean that the person in front of them can never ethically set off the reclining chain? Everyone has the right to recline, and if you don't like it you should ALSO recline, or pay for more leg room. YTA", "People are unbelievably rude sometimes.\n\nIf it’s very early in the morning or very late at night and plane lights are off, then I think people should expect reclining chairs. But if it’s regular business hours, I think it’s pretty rude to recline and take up others’ very limited space.\n\nI’m going with ESH. Op, you did nothing wrong until you started swearing at a stranger on a plane in a public place. Get a flight attendant for help if another passenger won’t leave you alone.", "In your first sentence you call me a liar. I'm now going to block you.", "What prevented you from placing your bag in the overhead bin? If you had done so then your legs would have had more space and she could have reclined her seat…", "It is not a danger to have your bag under the seat in front of you. That's where they are supposed to put them if not in the overhead compartment. I am 5'8/172cm and even without a bag in front of me, my knees usually touch the seat back preventing it from reclining. It sucks all around.", "Why would you bring a bag onto an airplane that doesn’t zip closed? \n\nHonestly your poor planning led to this, next time bring a bag that you know works and just put it overhead even if it’s down the aisle.", "Honeslty, that seems like more of a you problem than anyone else... why are you bringing an oversized bag that doesn't close on a plane to begin with? I've had to put my bag further away from my seat but at least I had leg room. You seem extremely entitled to me", "ESH. You both escalated and swearing at someone never really helps the situation, even if they are being entitled. The seats recline for a reason. Is it nice to ask someone or be aware of the person behind you? Sure, but she paid for the seat same as you. \n\nPerhaps it's also time to get a new bag that zips so that in the future you can put it up and have more space.", "Yep YTA.\n\n\nYou planned poorly then insulted someone for using the plane *as it's intended to be used* while you yourself broke flying etiquette.", "Was overhead storage an option? Too often the overhead bins are full.", "I’m only 5’8”, but I’m all legs and if I sit in basic economy, my knees rest against the seat in front of me.", "Agreed. I’m a 5’-9” woman, and my knees are against the back of the seat in front of me, even when the seat is in the upright position.", "Because the seats are made to recline (just a little bit) and by getting on an airplane, you are accepting that fact. Some people might recline. Some people don’t. You need to deal with it.", "AFAB (assigned female at birth) is one commonly-accepted term for expressing that duality. But whatever feels right to you works too.", "She said her carry on was large and took up all of her leg room under the seat so she wasn't able to stretch out her legs. So actually, she created this situation. Carry on less next time perhaps then you would have a bit more room for your legs and the chair in front won't bump your knees.", "Correct in order to ethnically recline the person behind you to recline, be small enough that they aren't inconvenienced, or an empty seat.  And no one has the right to recline, as reclining charges the status quo for the person for the worse.  And if someone reclines infront of me I will not recline my seat.  I will just unrealized theirs.  As for expecting people to may more you are assuming that they have the money to and also the freedom of flight choice to do so.  I fly mostly for work and corporate policy dictates I  fly in the cheapest seat possible and cannot upgrade it.", "Every flight Ive been on the attendants have announced not to have your bag on the floor during landing and take off. When in air its fine.", ">Why would you bring a bag onto an airplane that doesn’t zip closed? \n\nIf it fits under the seat, why would it need to zip closed?", "Yeah, this is what I’m wondering too. I have bags that have clasps instead of zippers, but I purposely don’t use them when I’m flying.", "It wasn't oversized, it was a regular carry on type bag. Idk how much you fly but they'rey really isn't much room under there.", "She said it was but her bag doesn't zip and it was \"further than she wanted.\"\n\nThis was a self made problem.", "What flights are you on? They all start by telling you to stow your carry-on _on the floor_ beneath the seat in front of you.", "Where I am from the explicitly say to stow you bags under the seat in front of you or the overhead compartment", "I mean I wouldn’t want anything to fall out of my bag? Op said the bag contained fragile things it would’ve broken if it had of fallen out.", "Which is why your carry-on bags are supposed to go in the overhead bins, and your additional small personal item goes under the seat.", "I have flown quite a bit and this has never been an issue for me. Perhaps air Canada plans are bigger but my carry on goes in the overhead and my purse/small carry on goes under the seat in front of me. I have even flown 18 hours to Australia and have never had this issue and everyone's seat was reclined.", "Nope. The overhead storage bins around her were full. That's not on her. That's on the airlines who now charge to check bags.", "Multiple England every summer since i was like 6, italy, france, spain, ireland, istanbul, india, hawaii, NYC, DC, Chicago. \n\nDo your flights not have over head compartments?", "It was though. It was a purse. I had another carryon in the overhead bins already.", "There were other open spaces. Op chose not to use them. That's a her problem, not the problem of the woman reclining. Around =/= all", "Just because the ones around her were full doesn't mean others weren't, I've had to store my stuff in overhead bins pretty far from me before. It's a give and take, want leg room, store your stuff above.", "When the overhead storage bins around you are full, you put your bag in a bin farther away from you or you suffer the consequences of keeping it under your seat. \n\nThe real asshole here is corporate airline bottom lines trying to milk the most money out of every flight. But individual passengers can still do their best to make the experience better for themselves and others.", "Usually flights have over head bins for carryon and under seat storage for a duffle", ">Nope. The overhead storage bins around her were full. That's not on her. That's on the airlines who now charge to check bags.\n\nWrong. Again, the overhead storage bins around her were full. That's not on her. That's on the airlines who now charge to check bags.", "Nope.  The space under the seat is also designated storage space, and a person sitting in their seat has an absolute right to the legroom without being reclined upon. I will absolutely die on this hill, and every flight attendant I've ever had mediate the dispute has agreed with me.", "Yes but the flow of traffic doesn't always allow you to do that, and you create  bigger issue by trying to go back there to store your stuff and then swim upstream to get back to your seat, plus no guarantee that anything else is even open. \n\nIf it fits under the seat, on a full flight chances are the flight attendants would tell them to put it under the seat anyway to clear the bins for stuff that can't go under a seat.", "I agree with your second paragraph. I disagree with your first.", "Sounds great for you, but I’m not sure how legroom and underseat storage is more of a right than reclining. Unless by “right” you mean a subjective moral code you’ve decided on yourself. Because I flew yesterday and 3 months ago and 6 months ago, and I can tell you the flight staff were not out and about defending the legs of passengers from the trespassing recliners.", "I guess we're just going to disagree then", "Now we're talking about philosophy, sources of law, and law versus morality. Heady stuff. Sure we can get into it on a Reddit thread? In any case, I stand by my prior comments. You don't get to trespass onto someone else and cause your seat to come into contact with them.", "That's fine!", "Do you think it’s possible that the flight attendants mediating your arguments about leg room and reclining end up agreeing with you because you’re an insufferable blowhard? That’s not an accusation, just a question based on my flying experience. Squeaky wheels get the grease whether they actually need it or not. \n\nReclining a seat isn’t trespassing  (a word with a specific legal definition) not matter how much you want it to be. You don’t actually sound much different than the “you’re everything that’s wrong with the world” insult hurled at OP, so congrats. OP and this woman both suck in different ways for making the flying experience of everyone else on that plane just a little bit more miserable than it needed to be."]}