{"id": 5397, "submission_id": "zsv0qw", "title": "AITA for getting into an argument over someone reclining their seat on an airplane?", "selftext": "I (26 female bodied human) just got off a ~4 hour flight.\n\nIt was pretty packed with holiday travel, and my bag took up all the space under the seat in front of me, so I was sitting with my knees against the seat in front of me.\nThe older lady (60ish?) in front of me starts trying to recline her seat, and her seat kept hitting my knees.\nThe first few times, she kind of peered and glared at me.\nFinally, she turns around and is like \"Do you mind?!\" or something like that. \nI said my knees were there, and she was crushing them every time she reclined, and when she tried to insist on reclining anyway, I added that it was rude to recline on planes anyway when there's so little space.\n\nI wasn't trying to be rude or start an argument, but the seats were quite cramped, and I wasn't kicking her on purpose or anything, that's just where my knees were (I have long legs), and I had tried stretching them out in the aisle, but stopped because people kept nearly tripping and bumping into me.\n\nLady starts getting upset, and ends up telling me \"You're everything that's wrong with the world these days\".\nI was pretty peeved at that, and called her an \"Entitled B****\" in response.\n\nShe gets really pissed and goes to complain to a flight attendant.\nI try to explain that I didn't start any trouble, she got upset because my legs were in the way and she kept hitting them trying to recline, yet expected me to move somehow anyway. \nThe lady acts like I'm the problem, and like I'm the one who started it because I called her a name, even though she had prefaced that with her comment.\n\nSo wondering here... Was I the asshole? I thought it was typically plane etiquette to not recline, or minimize reclining, as there's limited space.\nI do recline sometimes, if I'm on a really long flight, but always check behind me first, and if I was literally hitting someone by reclining, I'd feel bad, but idk. Thoughts?\n\nEdit: I'm not so tall that I need extra room, I had plenty of room until the last started reclining. She was trying to recline pretty far back so it was getting pretty cramped and I had nowhere else to put my legs.\nI thought the space under the seat in front of you was for bags anyway?\n\nEdit: My bag wasn't so huge that it was cramped or anything. The seating had limited enough room that just sitting normally, my knees were not touching the seat in front of me, but when the person started to recline, it hit them.\nI didn't have any choice here with booking, or what order to board in, this was a connecting flight, and my airline rebooked me on this flight (which was full) after a delay on their end caused me to miss my original connection.", "created_utc": 1671738466, "permalink": "/r/AmItheAsshole/comments/zsv0qw/aita_for_getting_into_an_argument_over_someone/", "score": 242, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I got into an argument with an older woman who was expecting me to move out of the way so she could recline her seat on an airplane, even though she was hitting my knees every time she tried to recline.\nShe said I was \"everything wrong with the world\", so I called her an \"entitled bitch\" in response.\n\nShould I have just let her recline? Or let it go?  Was I in the wrong for thinking it's rude to recline on a plane, especially if you're really infringing on the person behind you's space?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I'm 6'1\" and generally have enough room for my knees, even with a small backpack under the seat in front of me.  The person in front of me can generally recline, but it ain't comfy.  So I'm not sure why there wasn't enough space, although you didn't say how tall your woman-shaped body was.\n\nIf she kept banging into your knees, she should've stopped.  There simply wasn't room.  And she sure as hell shouldn't have been yelling at you, that would've been a good time for \\*you\\* to call the flight attendant.\n\nNTA.", "NTA. Until the Department of Transportation mandates more space in between seats, we all have to realize that flying may be an uncomfortable experience. That means you don't recline into the person behind you. \n\nYes, I will absolutely die on this hill. (Yes, I have gotten flight attendants involved and they have all been on my side.) No, I do not respect contrary opinions. \n\nFor those who say \"well, the seat reclines,\" that's not sufficient. Just because the seat reclines does mean that you get to use the feature under all circumstances.", "NTA\n\nIf someone buys a seat and that seat was designed to recline, I wouldn't say that's entitlement. Your handling of it with escalation was not right.\n\nBut let's be clear on who the AH actually is: the airlines who configure these planes to pack people in them like sardines. And then they put seats that can recline in that mix. SMH", "Flight will be the death of us all.", "Info - what did the flight attendant say/do?", "INFO: If your bag hadn’t been taking up all of the space under the seat in front of you, would you have been able to stretch out your legs and put your feet there?", "NTA. To all the people saying that you had too much luggage, you don’t know that. It depends on when your “zone” is called & how much luggage other people have brought. I have seen people get on planes with large back packs, totes & shopping bags, just one person with all those bags. End result? No room for my one bag except under the seat in front as the bins are crammed. As for reclining, people can be assholes about that. I recline a bit but have had people fully recline then get snotty when I bumped their seat while trying to get out to use the washroom. It is a jungle up there in the skies and a little consideration goes a long way.", "NTA - I’d honestly just forget about it. The woman sounds like she was just looking for trouble.  I can’t understand why she would keep trying when you explained that your knees were there. I think reclining is only really acceptable on long haul flights as there is usually more leg room.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26 woman bodied human) just got off a ~4 hour flight.\n\nIt was pretty packed with holiday travel, and my bag took up all the space under the seat in front of me, so I was sitting with my knees against the seat in front of me.\nThe older lady (60ish?) in front of me starts trying to recline her seat, and her seat kept hitting my knees.\nThe first few times, she kind of peered and glared at me.\nFinally, she turns around and is like \"Do you mind?!\" or something like that. \nI said my knees were there, and she was crushing them every time she reclined, and when she tried to tell me to move anyway, I said that it was rude to recline on planes anyway when there's so little space.\n\nI wasn't trying to be rude or start an argument, but the seats were quite cramped, and I wasn't kicking her on purpose or anything, that's just where my knees were (I have long legs), and I had tried stretching them out in the aisle, but stopped because people kept nearly tripping and bumping into me.\n\nLady starts getting upset, and ends up telling me \"You're everything that's wrong with the world these days\".\nI was pretty peeved at that, and called her an \"Entitled B****\" in response.\n\nShe gets really pissed and goes to complain to a flight attendant.\nI try to explain that I didn't start any trouble, she got upset because my legs were in the way and she kept hitting them trying to recline, yet expected me to move somehow anyway. \nThe lady acts like I'm the problem, and like I'm the one who started it because I called her a name, even though she had prefaced that with her comment.\n\nSo wondering here... Was I the asshole? I thought it was typically plane etiquette to not recline, or minimize reclining, as there's limited space.\nI do recline sometimes, but always check behind me first, and if I was literally hitting someone by reclining, I'd feel bad, but idk. Thoughts?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Unfortunately it has (unfairly) become rude to recline on airplanes because there is just no room anymore unless you're seriously petite. Everyone is uncomfortable, so that lady was acting entitled. And yes, that space is very often used for bags, idk why are people are mad at you for that.\n\nThe real asshole here is airlines who have crammed even more seats onto planes so no one has room to be comfortable anymore.", "ESH. She has the right to recline, there is no secret law stating otherwise. Yes it was rude of her to keep hitting your knees but there was no reason to cuss at her. You also stated that you were squished because you brought a giant ass bag and stored it by your feet instead of the overhead a bit further away.", "NTA. \n\nAs much as it sucks, the reality is that seats recline, and so you can't stop someone from doing it. However, if your literal body is in the way, well then guess they don't get to recline. \n\nI have been on planes, particularly the back row, where normal sized people- varying heights and weight, but no out super tall or super big- had their knees touching the seat in front of them. If the people tried to recline, they hit those knees and the knees had nowhere to go. \n\nIt is the holidays, meaning flights are full and bags can't all go in overhead bins. Yours was in an appropriate storage space, but it meant you were a little cramped. Again, fine. Your knees exist, and cannot be moved, whereas a seat doesn't have to recline. The end.", "NTA. Your cussing at her was appropriate. She was entitled", "NTA and what you called her was apt for the situation. Wish you let her recline and kept your legs on top of her head and possibly took off the shoes. Would have been the last time she would ever want to recline the seat.", "NTA\n\nIt sounds like you were just sitting normally, which didn't allow the seat to recline. This is on the airline, not you. You are not obligated to stretch your legs to accommodate the reclining seat.", "INFO: Was there space to put your bag in the overhead compartment?", "Mostly NTA.  Now that the airlines cram in so many rows of seats, it is common courtesy not to recline.  You know you're screwing over the person behind you when you do.  This lady has probably been reclining seats since the 70s, so in her mind it is still normal (and it was, until probably 20 years ago or so).  \n\nAirlines are not going to take seats off of planes, because that would mean less money and more expensive flights. The only solution here is to remove the ability to recline seats on airplanes.  If people can't use it responsibly (i.e., when there is no one seated behind you), then just take it away.  \n\nEven OP admits she uses it \"on really long flights\".  Even if you check behind you and it doesn't look like you are hitting someone, you are still taking away the 1 ince of free space they have to actually move their legs on a long flight. So OP, you are still a bit of a hypocritical asshole here.", "NTA, she got upset b/c you didn’t allow her the typical conveniences she probably has received before due to old age. \n\nAnyway. You were in the right to say something after her trying to squash you with her seat even though clearly the plane is quite cramped and yes it is proper plane etiquette to look behind you before reclining.", "ESH. \n\nNormal plane etiquette is that you get a seat that fits you and doesn’t infringe on others space. It’s totally normal to recline your seat on a plane and I would consider that part of their space. This means if you’re spilling into the seat next to you - buy another seat. If your legs are too long - buy one of the seats with extra leg room. \n\nYou both escalated unnecessarily and were just downright rude.", "YTA. You travelled with a bag that doesn't zip, so you couldn't store it properly. People should be allowed to recline their seats. Flying sucks, but you made the situation worse **and** you were rude about it. Def the AH here.", "YTA. If you had just put your luggage overhead this entire problem wouldn't have happened.", "There is no rule, and airlines sell seats with extra legroom which you didn't decide to purchase. You felt entitled to someone else's seat which has a recline button that you didn't pay for but they did. YTA", "I do think you are TA, if the seat can recline you have the right to do that, if you need extra space pay for extra space seats.\n\nOf course it is nice to get the person who is in the back approval’s but its not the lady’s fault that you had no space under the seat..", "ESH. 1. You had way too much luggage so you put that under her seat so you couldn't stretch your legs. Lady was a bit rude reclining her seat. But it was for only 4 hours, not 40, so get a grip, ok?\n\nAlso: what do you mean by \"woman bodied human\"?", "NTA, I travel 14 hour flights and don’t recline unless im sure the person behind me has reclined and is comfortable as well, I expect the same from the person infront of me", "[deleted]", "NTA.  The seat pitch on all airplanes now is ridiculously tiny to the point where if you are a child, your knees will hit the seat in front of you.  The airlines need to solve this issue by at least doubling seat pitch AND fixing seats so that they are impossible to recline!", "NTA, it’s not your fault the airline doesn’t leave enough room and you explained there was nowhere for your legs.", "ESH\n\nSo let me start off with she had every right to recline her chair, there is no etiquette not to do this on planes. Some people may consider it rude, but at the end of the day it’s their seat to do with as they please. \n\nIf you have long legs why didn’t you plan ahead and book extra leg room, or bring a smaller bag that would have given you leg room? This part is why I don’t think you’re completely innocent here.\n\nNow, was she wrong to hit your knees over and over? Yeah absolutely, sometimes tall people are behind you and you don’t recline, she had every right to be irritated about it, but shouldn’t have snapped like that. \n\nI mean really people, most seats recline like 6in or less (if you’re in economy which it sounds like you were).", "There is no etiquette not to recline, unfortunately.\n\nLets do this step by step:\n\nYou didn‘t have enough space bc you brought so much luggage that your spot was packed, knowing that you have long legs: YTA\n\nExplaining her your situation: NTA\n\nExpecting her to accomodate your situation: YTA as you knew that this would happen with all the lugagge etc\n\nAs you made a sitation where she only can accept, no matter what: YTA\n\nHer, making a scene: you are NTA\n\nYou calling her bitch: NTA as it was just a response\n\nSo, it‘s 3 YTA and 3 NTA from my pov.\n\n\nIn dubio pro reo: NTA\nBut PLEASE bring less luggage and book a seat with extra space in the future.", "Air travel is awful. You made it worse. Calling someone a bitch inside a cramped plane where everyone's on edge to begin with is a terrible idea. YTA", "YTA\n\nIf I want to recline my seat, I get to.  If you need more room, buy a better seat or put your bag up.  If you don't like people in front of you, sit in a bulkhead row.", "YTA", "NTA. I don’t understand why she would keep trying to recline after the first time she hit you…did she think your legs would magically get smaller?", "NTA. But, unrelated, what does \"woman-bodied\" person mean? If you're using that language in an attempt to avoid transphobia, you might want to reconsider. You can just say you're a woman. There's nothing transphobic about just saying what you are. Saying you're \"woman-bodied\" centers womanhood on a specific type of body, which actually reads kind of exclusive of trans women.", "I will say ESH cause you definitely could have handled it differently and planned better but she was also being an AH.\n\nI do have to say though, I'm surprised by how many people are saying there is no etiquette concerning reclining your seat.  Everyone I know that travels (myself included) has always understood that you only ever recline your seat if the one behind you is empty or if you check with the person behind you.  It's not anyones fault that the airlines make seats that are too small AND recline but as rational adults its fairly common practice to just not recline.", "YTA!!\n\nUntil airlines stop having the reclining feature on their seats, people do have the right to recline. \n\nYou having your bags where your feet should be is solely your problem.  You should’ve found a way to ship your fragile items or had them packed in a way that they could’ve gone in the overhead storage. In the end though, it’s all on you. \n\nPeople have the right to recline without being insulted because YOU messed up.", "Esh, She has a right to recline, you have a right to have your legs with you in your seat. You could have stayed calm and called the air hosts yourself first. She could have not tried reclining so far. The airline is at fault here, but this woman seems to be a bigger asshole", "YTA. There is a reason larger carry ons are supposed to go in the overhead bins, so you have leg room. \n\nAlso, you must be hugely tall (sarcasm, you’ve said you’re not) because my 6’1 bf sat behind me on our last crowded flight and I was able to recline without causing him any issues.\n\nWhat kind of fancy plane was this with deep reclining seats? Every plane I’ve ever been on, the seats literally only recline like 3 inches. That’s not enough to cause issues, sorry. \n\nI’ve never heard of anyone considering it typical plane etiquette not to recline. Everyone I know reclines on flights. Literally everyone. Including you apparently… so if you can do it, you’re either an AH for breaking etiquette, or for expecting other people not to do something that you deem acceptable for yourself. \n\nI think the woman reacted pretty strongly but it sounds like YOU were being an entitled AH too. \n\nHappy holidays", "ESH. It’s polite to ask before reclining, but it’s also not your place to tell her she can’t do it. It’s her right, if you don’t have enough leg space in a standard seat then you need to buy a seat with extra space. And your luggage is not her problem, you should’ve just put it in the overhead compartment. Sounds like you were both rude but the whole situation was your fault and you were the one escalating it further so you are the bigger AH here. I understand your frustration since I’m very tall and have to fly a lot, but you were unreasonable here.", "YTA. We purchase our seat. We sit in the seat we purchased. The seat will recline a very few inches. She paid for the priveledge of reclining that seat.\n\nIf you needed more leg room, you should have paid for it.", "Yta \n\nI want to say nta because airlines helped cause this but you had plenty of ways to not escalate this and you didn't take them.", "ESH\n\nYou should have boarded the plane earlier to make sure you would get your bag into an overhead compartment, so that you'd have enough leg room.", "NTA, she was being rude and entitled.", "NTA.  Etiquette say not to recline your seat unless the person behind you has reclined theirs.  And both in the overhead bins and under the seat in front of you are were you are supposed to put your carry-on so just ignore anybody saying you shouldn't have a bag there. You were starting to get a little out of line with your comments but the old lady was way more out of line.", "Esh but she started it. \n\nHer complaining that your legs were hitting her when she reclined was the initial ah move. Then she upped it when she insulted you. You could hav e gone with something classy like, “there’s no need to be ugly ma’am,” and equally shamed her without name calling. \n\nShe totally had it coming though. \n\nAnd yes, the space under the seat in front of you is for storing a small bag. Like a purse, not a full blown carryon bag.", "NTA.  What did the flight attendant do?", "The airline industry is the asshole really. There isn't one god damned part of flying that is comfortable. They keep squeezing us into tighter spots while taking away things like food, non extra checked luggage and Wi-fi. If America ever switches to high speed train I will give those fuckers a big middle finger and never come back.", "NTA - I think they should get rid of the recline to be honest as it causes so many problems and arguments.\n\nThe person behind always suffers as they will be unable to put their tray down.\n\nThe only think I would say you did wrong was call her an entitled bitch. You should have called the flight attendant over.", "The seats are made to recline. If you need extra space, pay for extra space. And pack lighter. your bag was so big your feet couldn’t be put down and your knees were up? That sounds like a you problem. YTA", "YTA. You created the issue for yourself because you have a false belief that it's proper etiquette for no one to recline on planes. You thought someone was acting entitled for doing something they're literally entitled to do. The older lady could've handled the situation with more patience, but they were justifiably upset, and you should've moved your bag to an overhead bin once they were, not doubled down on your bad choice. You placed your convenience over others' and thought they were obligated to accommodate you after you'd done so.", "NTA. Sure, you shouldn’t have called her a name but she was being inconsiderate and entitled. If your knees were in the way it’s because there was nowhere else for them to go!!", "NTA. As someone who has flown a ton in the last year (probably 30 times at least) airplanes are cramped. People saying you “should have put your bag in the overhead” are missing the fact that you’re allowed an overhead carry on AND a bag that can be set on the floor under the seat. The bins could have also been full. It happens on every flight i’ve been on. You’re allowed to recline, so long as you’re being respectful about it. If i reclined and hit someone, I would immediately put my seat back upright; not try several more times and get pissy. She was being very rude. You were just trying to be comfortable as well.", "When they serve food or drinks, if the person ahead of me reclines, their seat is covering my tray. I have had fellow travelers refuse to put their seat up so I could eat, because they weren't comfortable if they did.  Nothing like a 10 hour flight with nothing to eat, poor though the food may be.\n\nI avoid reclining unless the person behind me is reclined and asleep and I put my seat up when asked. For those of us traveling in steerage, we're in it together.", "I don't recline my seat if there is someone sitting behind me, including long transatlantic flights.   It's rude to make someone suffer for your comfort.", "This is the only way to be all kinds of nice, polite, considerate, not an a hole etc,. I travel and have never understood people who recline when an actual person is behind them 🤔", "I don't believe for a second that the flight attendants agree with you that someone cannot recline their seat. Perhaps during take off/ landing, or during turbulence, but the idea that a flight attendant will tell someone they cannot recline their seat is bullshit. \n\nMaybe someone who's a flight attendant here can chime in..", "Unless there is no one behind you, reclining your seat in economy is a total and complete asshole move.", "She basically just tried to smooth things over, and said the lady had the right to recline, even after I explained she was hitting my knees and I couldn't put them anywhere else without stretching my legs into the aisle.\nI DID put my legs out into the aisle for part of the flight, but people kept nearly tripping over them, and I felt bad so I stopped.", "Its a danger to have bags on the ground. Especially one that is so oversized OP has to put their knees to the seat in front of her.", "The overhead compartments around me were all really packed. I would have had to put the bag pretty far away from me, and it had a few fragile things in it, AND doesn't zip closed so I didn't feel comfortable putting it in an overhead compartment.", "Presumably, OP's legs aren't always too long on every flight, or OP would've mentioned it.  If the airlines changed the pitch on my seat, how am I even gonna know that I need to get a new seat until I'm actually seated?  This seems like a high bar.\n\n(I generally have a couple inches of room for my knees, and the person in front of my can recline, although it's never comfortable for me.  Is it comfortable for anyone, unless you're all sleeping on a red-eye?)", "Not to mention OP created the situation by not storing her luggage overhead.", "That's the problem though.  The only seats with nearly adequate leg room are literally first class.  And many airplanes don't even have a first class section.  But you expect 300+ people on every flight to all buy a first class ticket?  This problem was started by the greedy airlines and can ONLY be solved by the greedy airlines.", "Hard no. Plane seats shouldn’t even be able to recline unless it’s a long haul flight. They’ve shrunk seat sizes so much that reclining means making the person behind you uncomfortable at best and in pain at worst. It’s an asshole move, especially when the person behind you is literally telling you it’s hurting them.", "Unless you book a seat that explicitly has no storage, I think most women expect to have space for their purse under the seat in front of them, and most women are not willing to have their purse (and they often don’t zip) stored where they can’t keep an eye on it.", "They probably had their roller bag up there already 🙄", "Just because you can doesn’t mean you should.", "What? I’m 6’5’’ and my knees are pressed directly against the seat in front of me at all times.", "Nope.  I’m a tall woman with long legs when people have reclined my knees are in the way and prevent them from fully reclining. Meanwhile my knees get bruised and sore and I have no way of moving them out of the way unless I want to move them to the side in front of whoever is sitting beside me", "OP would have not been able to have an oversized bag as hand luggage. It would have been the recommended size which should be able to go under the seat in front of them. Which would reduce the amount of leg room. \n\nI am 5 foot 3 and sometimes I feel massively cramped on flights. It is rude that the lady in front kept trying to recline and hurting OP.\n\nYou need to wind your neck in.", "I'm a 5'4\" woman and I've ended up with bruised knees on a flight from someone reclining into them. The only carry-on I ever have is a laptop case. Glad you haven't had that experience but it happens.", "Idk she did say she was everything that was wrong with the world...calling someone a bitch in response is not probably a great idea but totally understandable", "This is absolutely right. On a plane, keep your head down and don't stir things up. You're probably only there for a couple of hours.\n\nYTA to OP.", "Why", "I say that because I was born into a female body, and don't have a problem with being identified by my biological sex, since that's just biology, but I don't like gender stereotypes and prefer to just identify as human. It's something I've been struggling with and unpacking for a long time.\nI didn't intend for my language to come off as offensive in any way, I just say that because I'm not really comfortable saying I'm female in terms of gender identity, and I never know when people are going to assume I mean that I am biologically a woman, or that my gender identity is as a woman, so I prefer to just clarify that biologically that's what I am and that's the only thing I mean when I say \"woman\" or \"female\".\n\nIn this case I felt like it was important to clarify, as I feel this situation could have been read differently if it was a biologically/outwardly male person in the situation.", "It is enough to cause issues. I have been unable to use my tray table due to the person in front of me reclining, unable to move, unable to use my laptop, etc., because the person in front of me reclined “3 inches”. So am I to be unable to move because the person in front of me reclined?  I paid for my seat too.", "I really don't understand all these stories of magical seats that recline so far they hit people's knees. I've flown my whole life, a lot, and everyone has always reclined their seats and no one has ever had their knees so in the way it was physically impossible to do so, or that their knees were crammed basically against their chest... Including my 6ft 5, 350lb grandfather", "She literally said she could not move her legs anymore due to limited leg room. Is she just supposed to magically move her legs with no room available to accommodate the privilege of reclining the seat?", "Wait so people can only ever recline in a domino series? what about the last row that can't recline? Does this mean that the person in front of them can never ethically set off the reclining chain? Everyone has the right to recline, and if you don't like it you should ALSO recline, or pay for more leg room. YTA", "People are unbelievably rude sometimes.\n\nIf it’s very early in the morning or very late at night and plane lights are off, then I think people should expect reclining chairs. But if it’s regular business hours, I think it’s pretty rude to recline and take up others’ very limited space.\n\nI’m going with ESH. Op, you did nothing wrong until you started swearing at a stranger on a plane in a public place. Get a flight attendant for help if another passenger won’t leave you alone.", "In your first sentence you call me a liar. I'm now going to block you.", "What prevented you from placing your bag in the overhead bin? If you had done so then your legs would have had more space and she could have reclined her seat…", "It is not a danger to have your bag under the seat in front of you. That's where they are supposed to put them if not in the overhead compartment. I am 5'8/172cm and even without a bag in front of me, my knees usually touch the seat back preventing it from reclining. It sucks all around.", "Why would you bring a bag onto an airplane that doesn’t zip closed? \n\nHonestly your poor planning led to this, next time bring a bag that you know works and just put it overhead even if it’s down the aisle.", "Honeslty, that seems like more of a you problem than anyone else... why are you bringing an oversized bag that doesn't close on a plane to begin with? I've had to put my bag further away from my seat but at least I had leg room. You seem extremely entitled to me", "ESH. You both escalated and swearing at someone never really helps the situation, even if they are being entitled. The seats recline for a reason. Is it nice to ask someone or be aware of the person behind you? Sure, but she paid for the seat same as you. \n\nPerhaps it's also time to get a new bag that zips so that in the future you can put it up and have more space.", "Yep YTA.\n\n\nYou planned poorly then insulted someone for using the plane *as it's intended to be used* while you yourself broke flying etiquette.", "Was overhead storage an option? Too often the overhead bins are full.", "I’m only 5’8”, but I’m all legs and if I sit in basic economy, my knees rest against the seat in front of me.", "Agreed. I’m a 5’-9” woman, and my knees are against the back of the seat in front of me, even when the seat is in the upright position.", "Because the seats are made to recline (just a little bit) and by getting on an airplane, you are accepting that fact. Some people might recline. Some people don’t. You need to deal with it.", "AFAB (assigned female at birth) is one commonly-accepted term for expressing that duality. But whatever feels right to you works too.", "She said her carry on was large and took up all of her leg room under the seat so she wasn't able to stretch out her legs. So actually, she created this situation. Carry on less next time perhaps then you would have a bit more room for your legs and the chair in front won't bump your knees.", "Correct in order to ethnically recline the person behind you to recline, be small enough that they aren't inconvenienced, or an empty seat.  And no one has the right to recline, as reclining charges the status quo for the person for the worse.  And if someone reclines infront of me I will not recline my seat.  I will just unrealized theirs.  As for expecting people to may more you are assuming that they have the money to and also the freedom of flight choice to do so.  I fly mostly for work and corporate policy dictates I  fly in the cheapest seat possible and cannot upgrade it.", "Every flight Ive been on the attendants have announced not to have your bag on the floor during landing and take off. When in air its fine.", ">Why would you bring a bag onto an airplane that doesn’t zip closed? \n\nIf it fits under the seat, why would it need to zip closed?", "Yeah, this is what I’m wondering too. I have bags that have clasps instead of zippers, but I purposely don’t use them when I’m flying.", "It wasn't oversized, it was a regular carry on type bag. Idk how much you fly but they'rey really isn't much room under there.", "She said it was but her bag doesn't zip and it was \"further than she wanted.\"\n\nThis was a self made problem.", "What flights are you on? They all start by telling you to stow your carry-on _on the floor_ beneath the seat in front of you.", "Where I am from the explicitly say to stow you bags under the seat in front of you or the overhead compartment", "I mean I wouldn’t want anything to fall out of my bag? Op said the bag contained fragile things it would’ve broken if it had of fallen out.", "Which is why your carry-on bags are supposed to go in the overhead bins, and your additional small personal item goes under the seat.", "I have flown quite a bit and this has never been an issue for me. Perhaps air Canada plans are bigger but my carry on goes in the overhead and my purse/small carry on goes under the seat in front of me. I have even flown 18 hours to Australia and have never had this issue and everyone's seat was reclined.", "Nope. The overhead storage bins around her were full. That's not on her. That's on the airlines who now charge to check bags.", "Multiple England every summer since i was like 6, italy, france, spain, ireland, istanbul, india, hawaii, NYC, DC, Chicago. \n\nDo your flights not have over head compartments?", "It was though. It was a purse. I had another carryon in the overhead bins already.", "There were other open spaces. Op chose not to use them. That's a her problem, not the problem of the woman reclining. Around =/= all", "Just because the ones around her were full doesn't mean others weren't, I've had to store my stuff in overhead bins pretty far from me before. It's a give and take, want leg room, store your stuff above.", "When the overhead storage bins around you are full, you put your bag in a bin farther away from you or you suffer the consequences of keeping it under your seat. \n\nThe real asshole here is corporate airline bottom lines trying to milk the most money out of every flight. But individual passengers can still do their best to make the experience better for themselves and others.", "Usually flights have over head bins for carryon and under seat storage for a duffle", ">Nope. The overhead storage bins around her were full. That's not on her. That's on the airlines who now charge to check bags.\n\nWrong. Again, the overhead storage bins around her were full. That's not on her. That's on the airlines who now charge to check bags.", "Nope.  The space under the seat is also designated storage space, and a person sitting in their seat has an absolute right to the legroom without being reclined upon. I will absolutely die on this hill, and every flight attendant I've ever had mediate the dispute has agreed with me.", "Yes but the flow of traffic doesn't always allow you to do that, and you create  bigger issue by trying to go back there to store your stuff and then swim upstream to get back to your seat, plus no guarantee that anything else is even open. \n\nIf it fits under the seat, on a full flight chances are the flight attendants would tell them to put it under the seat anyway to clear the bins for stuff that can't go under a seat.", "I agree with your second paragraph. I disagree with your first.", "Sounds great for you, but I’m not sure how legroom and underseat storage is more of a right than reclining. Unless by “right” you mean a subjective moral code you’ve decided on yourself. Because I flew yesterday and 3 months ago and 6 months ago, and I can tell you the flight staff were not out and about defending the legs of passengers from the trespassing recliners.", "I guess we're just going to disagree then", "Now we're talking about philosophy, sources of law, and law versus morality. Heady stuff. Sure we can get into it on a Reddit thread? In any case, I stand by my prior comments. You don't get to trespass onto someone else and cause your seat to come into contact with them.", "That's fine!", "Do you think it’s possible that the flight attendants mediating your arguments about leg room and reclining end up agreeing with you because you’re an insufferable blowhard? That’s not an accusation, just a question based on my flying experience. Squeaky wheels get the grease whether they actually need it or not. \n\nReclining a seat isn’t trespassing  (a word with a specific legal definition) not matter how much you want it to be. You don’t actually sound much different than the “you’re everything that’s wrong with the world” insult hurled at OP, so congrats. OP and this woman both suck in different ways for making the flying experience of everyone else on that plane just a little bit more miserable than it needed to be.", "NTA - She rammed your knees multiple times, didn't apologise and then insulted you. Just insulting her back is barely a retaliation. Not everyone can put their legs under their chair, so the luggage didn't matter it seems. Sometimes there isn't enough room to recline, that is just one of the things that can happen if you fly economy.", "NTA - She was an entitled cow.  I am tall.  I cross my legs and brace my foot against the back of the seat in front of me if anyone tries to recline.  They eventually give up. Reclining went out in the 1970's.  No room now.", "NTA but it’s not impolite to recline your seat on a plane. It is if you can’t without physically injuring the person behind you, though.", "NTA. Just because the seat reclines doesn't mean you are required to accommodate it. You're allowed to leave your knees where they are, you're allowed to move them to jostle her. Her right to recline exists, but it doesn't mean your right to sit however you right is subservient to it.", "female bodied human?", "NTA, not even close. Unfortunately, there doesn't seem to be any etiquette around seat reclining on planes, entitled people just try and do it regardless.  I'm also tall and cannot sit in the seat with someone reclining,  luckily I've only ever had one person whine about it and she got moved.\n\nIt's just common sense / courtesy to me, you don't recline if there is anyone behind you, or at least without asking them first, but sadly selfishness usually overrules 😕", "NTA. I am tall and most of my height is in my legs, unfortunately. So when I am on a plane my knees are flush with the seat in front of me. You can recline, but you will probably feel my boney knees in your back. I have a huge tolerance for being uncomfortable, it honestly doesn’t bother me. So, if I can barely give a fuck about my own comfort then I doubt I will care about yours. \n\nAnd I refuse to pay 10 grand for an international flight in first class. And domestic flights are at most 5 hours, so again, I am not spending big money just to be comfortable for such a short period of time. I do pay to check luggage, so I only bring my self and a small handbag for my meds and cell phone. I think of myself as a good traveler. \n\nPeople like the woman on your flight are what’s wrong with the world today, thinking it revolves around her and her comfort.", "NTA.  The airlines have deliberately made reclining seats untenable but are happy to play two paying customers (and an overworked flight attendant) off each other to \"solve\" it, and they come out smelling like roses.\n\nWith currently seating capacity in 2022, there's no need for any seat to have a recline button, but yet there it is.", "I'm going to say what I say every time a recline post comes up: socially we have decided that reclining shouldn't be done, especially on short haul flights. But *technically* your ticket is only for the space starting where the seat in front is fully reclined to the space taken by your chair fully reclined.\n\nThe airlines don't share this information easily because it works for *them* for you to feel that you own something you don't. If you're busy arguing over who has the right to the space around your seat, you're not pointing out that the airlines are moving seats closer together, failing to engage the mechanism that *stops seats reclining*, and having a feature that causes fights so they don't have to be the ones that don't have reclining seats.\n\nThe real AH here are airlines. You didn't do anything wrong telling her she couldn't recline because your body was in the way. She also has the right to recline.", "NTA, reclining on planes should be banned. I had a 5 hour flight, and the lady in front of me reclined the seat for her 3yo, who DIDN'T NEED THE ROOM. I felt claustrophobic and sick the whole time, but still didn't recline because I'm not a dick.", "NTA - I have won every time some idiot thinks my knees can collapse.", "YTA. You travelled with luggage that prevented someone else from using the seat they paid for. People have a right to recline otherwise it wouldn’t be an option. That person may also be tired, uncomfortable, ill.", "the lady bought a seat on the plane, one which has the ability to recline and its really not her problem you didst check your luggage or make sure you had enough space, THAT'S basic plane etiquette, YTA\n\nAlso I don't recline either but that doesn't matter as I am not allowed to control what others do - that's unreasonable.", "YTA : You could have put your bag up in the overhead bins and you weren't comfortable because it had fragile stuff and wouldn't zip. the bag was big enough that you lost out on legroom. \n\nThe seats recline and she a right to recline .", "Info: why didn't you simply recline? Any space you would be losing would then be regained and you could both be happy. Expecting someone not to recline is entitled.", "Yta seats that recline or have more leg room are more expensive than those that don't. People are paying for reclining seats so they are absolutely entitled to recline.", "YTA", "YTA - the seat reclines for a reason. However, there's no reason to recline when someone is eating.  If you have an issue with this you should inform the airline.  Until that time book a seat behind a row that doesn't recline.", "YTA. \n\nIf you want to extra space to make sure your legs aren't crush, God forbid the person who paid for their seats in front of you decided to recline, and you want to be comfortable through your flight - you pay for it.\n\nYou have a reclined seat as well. Just because you chose NOT to recline because you think it'll cause disturbance to others does not mean the person in front of you should not. It's their choice.\n\nSeriously, just because you think it's a short flight, doesn't mean it's a short enough flight for the person in front of you that they don't need to adjust their seats.", "Yta\n\nYou brought a bag that was too big onto the flight and that caused you to sit in that awkward position.", "As someone who would never recline my airplane seat and hate it when people do. I’m sorry but \n\nY T A \n\nThey recline for a reason. The you can’t punish the woman \n\nBut before I make a final judgement:\n\nINFO: what did the flight attendant say?", "YTA if you don't want to be cramped, then pay the extra for more space. But seats recline for a reason, it's not there for decorative purposes. The only time you aren't allowed to recline is during take off, landing, and food service. She paid for her seat including the ability for it to recline", "YTA. I suffer from excruciating back pain when trying to sit in an upright seat for more than 20 mins or so. If I’m going to survive a 4~ hour flight without having to take serious medication, I need to recline my seat. And I have a right to. \n\nWhat people often fail to realise is that if the person in front of you reclines, you just need to do the same. Then the amount of space you had before is the same as the amount you have now. Simple!", "All these people saying that she has the right to recline…no she doesn’t! It’s so rude, you’re basically lying in a stranger’s lap, making yourself comfortable at someone else’s expense. Why is this woman’s comfort more important than OP’s? Airplanes cram as many seats as possible so there is not enough room to recline. Just because the seats recline, doesn’t mean that you should. Plus, with the seats reclined, you can no longer access the food tray. Reclining the seat is rude! NTA", "YTA next put your bag in the overhead storage next time amd when someone reclines their seat just recline yours too.", "YTA. The seats are designed to be reclined. You chose to put your luggage under the seat instead of in the overhead locker, leaving room for your feet to go under.", "> I added that it was rude to recline on planes\n\nWrong.\n\nEveryone hates it, but you just have to put up with people reclining their seat in front of you.\n\nIf you had so much luggage you couldn't stow it properly then that's your problem.\n\nYTA, sorry.", "YTA and i’m guessing have never flown on a plane before. Regulations do not allow you to have your bag take up the space in front of you because that would be a trip hazard in the event of an emergency. The bag must fit fully under the seat in front of you, so you there’s no reason you would need to rest your knees against the back of the seat in front of you. \n\nAlso, while it might be rude for someone to recline their chair on a plane, it’s their right, they paid for the seat, it reclines, they’re allowed to recline if they want.", "ESH - it is her space she paid for. That being said reclining is rude. I never recline I can’t imagine it makes for a more comfortable ride though.", "I'm going with ESH\n\nI've been reading more lately that people find it rude to recline, but that's totally new to me. I was a frequent traveller prior to the pandemic and had never heard of such etiquette. \n\nYou both suck as you were both rude and uncompromising.", "ESH. I hate when the person in front of my reclines but it's an option, so they can do it. Her reaction was insane obviously", "NTA…with a caveat.\n\nNow that you have the knowledge that your bag is inadequate for travel and your knees hit the seat in front of you, you should be prepared from here on out (including the return flight) to have a more appropriate (zippable, at least) bag to free up space in front of you and a seat with more room (bulkhead or exit row). If you continue to book a regular seat after this, completely aware that you are impeding on the person in front of you, you are a total asshole.", "[removed]", "Thank goodness that on most UK flights to Europe don't have this problem. The airlines stopped reclining seats.", "Can't believe all the people saying the airline is TA. Pretty much every airline allows you to buy bigger seats with more leg room.", "As a large man 6’1” 300lbs with a large frame I feel your pain, but it is what it is when you are flying.", "[removed]", "YTA. A passenger has the right to recline their seat. It’s airline policy, which the flight attendant explained to you.\nYou brought a large bag you stuffed under your seat. You should have put it overhead - even if it was far from your seat - or checked it at the gate (which is typically free or charge). You brought a broken bag and didn’t want to be inconvenienced, which means you created the problem.\n\nAs for the argument that airlines are to blame for this - fully agree that flying is miserable. Seats and personal space are comically small. But US tickets are on average 40%-50% cheaper than in 1990, even though the price of fuel has gone up hugely. The difference is even greater for international flights. Airline profit margins are very slim. Those price cuts and fuel hikes have to be made up for somehow - hence packing in of passengers and bag fees. You want to fly in 1970s comfort, pay the 1970s prices.", ">my bag took up all the space under the seat in front of me, so I was sitting with my knees against the seat in front of me. \n\nBased on your own description, your bags were causing the problem.  Frequent flier here: your personal bag should be small enough to fit comfortably under the seat in front of you.  That's on like every airlines' literature.  \n\nNow, the lady in front of you didn't do herself any favors when she was very rude about the, at that point, uncorrectable circumstance.\n\nESH holiday travel sucks", "YTA. Unless youre incredibly tall, the only way the seat was hitting your knees is if your knees were lifted up. I do this too when I want to get comfortable and the seat in front of me isn't reclined, but I recognize that it's not my right to lift my knees up and press them into the seat in front of me, it's an occasional luxury. It's the lady's right to recline her seat if she wants, and its not her fault that you blocked your own legroom with a large bag.", "When my son was little (1 1/2) we took him to Florida. As the safest place for a little one is in a car seat I brought his car seat along and installed it rear facing as that is what he was used to (checked all FAA rules and suggestions and the car seat instruction manual). Older woman in front of him started throwing a fit that she couldn’t recline and it was horrible. She Had a right to recline her seat, blah blah.  She got a flight attendant involved and when I pointed out that I was following all rules we were fine. He offered to move lady and her husband to the exit row in front of them. They hemmed and hawed enough that the other person in the row with them moved instead. Once we took off she started vaping. When husband mentioned it to the same flight attendant he came right over and read them the riot act about it. Didn’t hear a peep from her or her husband after. \n\n\nLong story just to say no, there is no rule saying that someone has to be able to recline. \n\nNTA", "ESH- she has the right to recline her seat but when you were being inconsiderate with your bag that doesn't close and you not wanting it out of your sight, she should have been the bigger person and dealt with it. Calling anyone names is unnecessary, you definitely made an already bad situation(craeted by you not putting your large bag in the overhead) much worse.", "NTA. After not flying for a few years, I feel like there is even less space on planes than before. I dropped my water bottle on the floor on the plane and literally did not have enough space to lean over and get my hand close enough to it to pick it up. Even without my seat reclined, I could feel the knees of the gut behind me hitting my back. I didn't complain because the seats cannot even comfortably accommodate me, a 5'4\" woman, I can't imagine where anyone a few inches taller than me is supposed to keep their limbs on a flight. If they're going to cram people into a space like this, the seats should not recline at all.", "NTA, but honestly I do think she has the right to expect the ability to recline her seat. It's not like they recline far. She was TA for the way she handled it. \n\nIf you were a man, or overweight, I think the folks in this thread might be roasting you. The bottom line is that many times, human bodies take up more space than the airlines allow them to have. And the airlines have ZERO interest in customer service. They know we need to fly and they will have their way with us when we do. They are the real assholes here.", "NTA", "NAH. The airline is the AH, as usual. Planes weren't always as cramped as they are today. You should both be able to have at least a bit of comfort in the seats that cost you hundreds of dollars.", "I don’t understand the need to recline a seat back.  It’s literally like an inch. How is that helpful.", "NTA \n\nAll the times I've flown / many / I have never reclined my seat. Do they recline? Yes. Do I realise that planes get cramped and if I recline I might be making a fellow passenger's flight very uncomfortable? Also yes. People can be so inconsiderate. The lady's entitlement is exactly what's wrong with the world nowadays.", "I can't believe some of these responses you are getting here, OP. You are NTA!\n\nI am only 5'10 but my legs are long. I've had my kneecaps bashed by the person in front of me trying to recline their seat many times. It sucks. The worst is people like the lady you described, who just keep slamming their seat back over and over.\n\nI get that they \"paid for a seat that reclines\" and all, but I also paid for a seat. Do I not have the right to sit in it???", "YTA. Those seats recline, don't like it? Take your \"long legs\" to first class. I recline the second I sit down and I don't change it upright until I land. I wish one of you \"don't ever recline\" nazis would have a go at me. I paid for that chair. I'll recline it whenever the hell I want.", "NTA. Reclining is an utter menace and I love the low cost carriers that have seats that don't recline.", "Anyone who thinks it’s “rude” to recline their seat is not an experienced traveler. And this woman is not or else she wouldn’t have brought a non-zippable purse. Traveling during the holidays blows, it’s amateur hour out there.", "It depends on the plane for sure. I’m 5’9” and sometimes I have plenty of room but there are definitely flights (especially connecting or short flights) where even with the seat up my knees are about touching the seat in front of me.", "There would have been room had the op put their luggage overhead and their feet under the seat. The seats are designed to recline and people pay for their seat that reclines.", "I'm 6'4\", and on those occasions I have to fly, my knees are always against the seat back. Since I know they will be smashed if somebody tries to recline, I simply position my feet so my knees are firmly against the seat in front of me and they are unable to recline. Usually after the second failed attempt they realize it simply ain't happening and give up on it. Airlines could easily avoid the issue by instally seats that don't recline. Instead they insist on atagoning their customers with a feature they know will aggravate most of their customers.", ">we all have to realize that flying may be an uncomfortable experience\n\nIt's not uncomfortable if you buy a big enough seat for yourself. Every airline offers extended legroom", "I mean whether you respect it or not, you’re wrong. Its not that black and white. It’s fine to recline your seat on long flights during hours people would sleep. It’s generally rude to do it during food service. If someone asks you not to recline, you should respect that request. \n\nIf you want to spend long nights on flights without sleep so you can be happy about having a moral high ground only you care about, that’s a fine position to have, but there are a good many people who won’t really care or feel you are in the right for thinking they are rude for reclining their seat.", "Agree 100%.  There is NOT ROOM to recline your seat unless the seat behind you is empty!!", "Thank you. People who recline on planes are the worst kind of people. Really, you want to be minimally more comfortable so you are going to make another human being all of the uncomfortable? You’re a monster. You’re right up there with people who leave their shopping cart in a parking space.", "Queen Latifah knows. \n\n\"I'm not flying all the way to Prague with some stranger in my lap!\"\n\nhttps://youtu.be/zwrVmF7UiVY", "👆🏼👆🏼👆🏼", "BullSHIT. Would you recline your seat in a car if a family member or friend was cramped in behind you? No? Then why the hell would you do it on a plane? Oh, because you don't know the person so fuck them right? OP is 100% NTA.", "> If your legs are too long - buy one of the seats with extra leg room.\n> \n> \n\nNo, the airlines are not entitled to more money for making things too small on purpose.", "Agree. I don’t understand this new normal that it’s not okay to recline your seat. I’ve never had an issue with the person in front on me reclining. They recline and then I recline.\n\nEdit to add: if you have so much carry-on or precious carry-on that you put in your foot space it’s a you problem.", "Precisely", "If the bag was oversized they wouldn’t have allowed it on board, and I’ve been on plenty of flights where I couldn’t put a bag overhead because it was full.", "\"right to recline\" lmao I don't think that's in the constitution is it?  Assault though, that's illegal.. like if your action causes unwelcome and/or painful contact with another's body, that's possibly a law that would apply here.  op is NTA.", "Does anyone know what airline this was? Because if it’s Frontier or Spirit….OP is out her mind.", "Yes, she is entitled to recline her seat as they are able to recline.", "She was entitled to recline the seat. Why do you think they recline?", ">I do think you are TA, if the seat can recline you have the right to do that, if you need extra space pay for extra space seats.\n\nWould you do that if you're in a car with family/friends in the back seat? Of course you wouldn't.", "What if she wanted what's in the bag, ie tablet, phone, laptop. It's not like you can take stuff out of overhead when in flight, nor can you predict an AH in front of you.", "Most planes I’ve been on you have to pay for an overhead bag", ">have flown with people who are over 6ft and have long legs, this has never been an issue that their knees are up high and the person in front of them hits their legs when they recline.\n\nThat's 100% BS.  I'm 6'2\" and my knees are actively pressing against the seat in front of me at all times in all coach configurations on all domestic airlines.  Not touching, pressing.  The only way I can avoid that is by buying an extra-legroom seat.  Which then basically means someone can recline about 1/8th of an inch before hitting my knees.", "So reclining a seat that is made to recline is entitled?  She was rude but she should be able to recline in her seat.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Definitely, I'm 5'7\" and I usually have more than enough space on flights but on a couple hr flight today it was horrid for me the entire flight", "There is not always room to put your luggage in overheard based on boarding sequence and people being unwilling to check their baggage.  So there’s too much baggage overhead, this person ends up unable to put baggage up, and nowhere to put knees.  It’s happened to me and I’m not tall.  If your chair hits my knees while reclining, that’s not a me problem.  I would gladly have put my bag up and have more room between us!", "The small personal item should go under the seat in front of you and luggage bins left for actual luggage. I take a full size back pack with me and have never had any issues like described by OP, but I’m not tall either.", "Yeah, if that's the case, OP is TA.  It wasn't clear.  I couldn't imagine an under-seat bag that the flight attendants would allow that would push your knees that far up, so I'm not so certain.", "I always look back and ask the person behind me if it is okay for me to recline. I had people almost break my computer screen by reclining their seat.", "Every single flight I’ve ever been on with food service the flight attendants without fail tell people to return their seats to the upright position during food service for this very reason. Without any prompting either. As they come through the plane with the food trolley they automatically tell everyone to return their seats as they usually can’t even put your food on your tray with the seat in front reclined. Did you not ask a flight attendant to get them to put their seat up? They’d sort that for you in a heartbeat.\n\nI agree re when it’s ok to recline. I rarely ever recline. And only in the middle of a 12 hour international flight when the cabin is pretty much sleeping and the person behind me has already reclined.", "Try taking off your shoes and socks and placing them on the space between chairs in front of you.  Just as a way of saying thanks.", "I wonder if OP was travelling to/from Asia where it’s normalized to recline seats on planes.  I recall flights where you’d see a gradual cascade of seats reclining, from the front to the back, and no one ever batted an eye since, well, *everyone* did it.  So if the person in front of you encroaches your space…you deal with it by inconveniencing the person behind you. 🤦🏻‍♀️", "What airline is this?! I've never been on a plane where they didn't force everyone to put their seats up before meals lol", "Oh please, there are no planes where the seat reclining covers the tray enough that you “can’t eat.”", "OP actually commented that the flight attendant told her she was wrong and that the lady had the right to recline her chair", ">Maybe someone who's a flight attendant here can chime in..\n\nPshaw, Reddit doesn't respect expertise.  If a flight attendant did speak up, they'd be told they were wrong, and possibly lectured about it.", "Then let the person who wants to recline purchase the premium seat", "ROTFL. I may be lots of things, but wrong isn't one of them.", "Agreed. Flown many times and I’ve never reclined. I don’t sleep well anyways so I just read or watch a show.", "you should complain to the airline, someone's desire to recline is not more important that someone's right to not have their body assaulted by a seat back.", "So basically the flight attendant said you were wrong", "Holy shit, this is the best analogy yet. No one would pull this bullshit in a car!", "If my family member had issues, absolutely I do. My dad has some back problems and I absolutely deal with being more cramped so that he’s not in pain for our entire trip.", "The backseat passenger can't recline.", "Overhead storage is for roller bags, personal items are supposed to go under the seat in front of you. If you can fit your feet under the chair too, that’s bonus leg room. But your feet are meant to go in the space between chairs, not under the chair.", "How often do you fly? Those bins are full by the 3rd boarding group.", "Haha yeah I didn’t even realize it was such a contentious issue before this post. Then again, I’m super short and the short people definitely came out ahead when it comes to air travel.", "This.  Seats shouldn't recline at all.  I'm on board if the exception is long haul flights but along with that all long haul flights should have rows with an addition 6+ inches in between rows of seats.", "Tbh I have snuck plenty of oversized bags into the space under the seat. Airlines don’t check everyone if it’s not obvious.", "I can’t tell if this is sarcasm, but you can absolutely take stuff out of the overheard when in flight…?", "Have you ever been on a flight? You absolutely can get up to grab what you need from your bag in the overhead bin. Unless the pilot or flight attendants specifically state that you must be seated for the entire flight due to turbulence, you can get up.", "It's understandable in a parking lot. But in an airplane? You're only asking for trouble. The flight attendants have no idea which passengers are psychos and which ones are just annoyed passengers. As soon as you drop the b-word, you're setting yourself up to be a troublemaker on an airplane. The FAA doesn't look kindly on that.", "I remember being in Egypt Air in the 90's with my family - and I, at 9 years old, was the only one whose legs were not in **constant** contact with the seat in front of me - and even \\*I\\* did not have enough leg room. On a normal flight at the time I could curl up into a ball on the seat... \n\nSo - I can imagine it being a problem. That said - in most flights - I get what you're getting at.", "She didn’t have the space to recline her seat", "Overnight flights have different rules. There’s no way I’m doing London-Auckland without decking my seat at some point during the sleeping hours.", "There are absolutely planes that make it very difficult to eat when the seat in front is fully reclined. Especially if you’re a little bigger and so can’t slide your tray out all the way. It’s not impossible, but can be extremely awkward and uncomfortable. \n\nBut in my experience flight attendants always ask people to return seats to upright position during food service. I do find it hard to believe this person wasn’t able to eat at all on a 10 hour flight…", "Username checks out?", "Shit, I just saw your username. GG to me!!!", "I don’t understand these YTA comments. Reclining crushes my knees every time someone does it to me, whether I have a bag underneath the seat, or not, and I’m not that tall. Are we supposed to sustain injuries just so another person can lounge like they’re in their own living room?", ">Because the seats are made to recline (just a little bit) and by getting on an airplane, you are accepting that fact. Some people might recline. Some people don’t. You need to deal with it.\n\nWould you recline a car seat if your mother or grandmother were in the backseat in a cramped car? I await your response.", "Maybe it's airline specific then? I genuinely can't wrap my head around a 2in recline at the top of a chair (therefore a significantly smaller recline toward the base) impacting knees on any of the planes I've been on.", "Oh for sure!  Reclining during sleeping hours is fair game on long haul flights.  But I was referring to aloof passengers who reclined their seats right after takeoff, then kept them reclined for the majority of the 14 hour flight. 😔", "And that would be understandable and acceptable. I'd do it too. But on a short haul that's less than 4 hours? Nah.", "Nowadays on most domestic US flights, there will be a cheaper level of ticket with the stipulations that you don't get to pick your seat beforehand and you cannot put any luggage in the overhead container. You're only allowed one carry on that has to fit under the seat in front of you.\n\nEvery flight I've taken, admittedly mainly in the US but also have had 75k+ mile years, the policy is two carry-ons, one you can put in the overhead and one that fits beneath the seat in front of you. The only seats that are not allowed to have bags on the floor during takeoff and landing are bulkhead seats.", "YTA you created this problem with your bag in the first place. If you need more space buy extra legroom. Plane seats are built to recline and everyone has the utilize this feature.", "How tall are you?\n\nBecause I just got off a plane yesterday where the reclined seats maaaaybe went about 3 inches, probably less, in their reclined position. My knees were never against a seat. And that was while traveling on 2 different airlines, with 3 styles of planes flown. \n\n\nIf I recline in my living room, it's sure as hell as a lot more of a recline than that.", "That’s assuming I treat my family the same way I treat strangers. Big assumption. \n\nAlso, yeah I probably would recline back a tiny bit. Airplane seats don’t even go back that far.", ">I genuinely can't wrap my head around a 2in recline at the top of a chair (therefore a significantly smaller recline toward the base) impacting knees on any of the planes I've been on.\n\nI get it - and - I've had a couple that were almost as bad as Egypt Air... but - really - only when they're effectively already actually, or effectively, touching is the only time I can see it be a problem...\n\nUnfortunately - more and more airlines are giving less and less leg room; and I fear more experiences will be like that nightmare of my childhood. (My family are all mid 5 feet in height - and - my parents both had red patches on their knees from them being pressed against the seat in front of them for the entire flight... I don't recall whether the seats could recline though... this was more than 2 decades ago)", "A lot of airlines charge to do carry-ons now as well", "To be fair I’m not American so I can’t say I’m familiar with their domestic flight policies.", "I’m a 5’-9” woman, and yes, my knees have ended up bruised and sore from it.", "So you treat people you don’t know like shit? Also, just because a seat reclines doesn’t mean you should. If you’re in a car, are you gonna say “fuck you granny! The seat reclines so deal with it!” Of course you wouldn’t.", "I'm so glad I've never ended up on these airlines, then! Jeez. I mean, I know they're all cost cutting and generally suck, but that's just insane", "Honestly it’s the airlines who have made every single person in this story an asshole. The lady in front should have room to recline and the person behind her shouldn’t have to fold themselves into an origami crane to fit in the seat.\n\nFlights have gotten fucking ridiculous IMO and airlines need to be taken down a peg.", "Bags go under the seat in front of you. Suitcases should go overhead. It’s the people who take up space with book bags and other smaller items that are the problem. That space in front of your seat is meant for that storage. Also, putting your bag over other peoples seats unnecessarily when you can store it underneath is an AH move. I hate having to walk to the back of the plane to find bin space when someone could’ve just put their bag under a seat. Don’t be that person.", "I'm sorry but what? Every flight I've been on they ssk you to but as much of your stuff under the seat in front of you as possible, so as to save space in the overhead compartments. \n\nWhen a flight is fully booked there isn't space for everyones luggage in the overhead compartments.", "Lol so cute. So because overhead compartments exist, that means that fights do not have under-seat stowage? Moving the goalpost, pal. Nice try.\n\nOverhead compartments existing are not the argument.\n\n> Every flight Ive been on the attendants have announced not to have your bag on the floor during landing and take off.\n\n\nThe argument is that under-seat _on the floor_ stowage exists, and is available, and was used by OP.", "You are permitted to have one bag within certain dimensions that goes in the overhead, then you may have one additional bag like a backpack or purse that goes underneath the chair in front of you.\n\nOverhead generally get full quickly and it is not appreciated if you put your additional item up their.", "You can have bags below the seat in front of you, but not on the floor where your legs go or on the side. It has to be under the seat. And I’ve been on plenty of full flights where there was no overhead space by the time I was called to board the plane.", "My flights have all had overhead compartments but they also have designated spaces under the seats. The announcements have always been “please secure your bags in the overhead compartment *and/or* underneath the seat in front of you.” I’ve personally never traveled on an airline that told me not to place bags in that floor storage space so that’s definitely a new perspective for me to consider in this type of thing.", "I’m European, have never been outside of Europe and have flown a lot, I’ve always been instructed to put bags under my seat.", "Was this Spirit airlines or a similar one?  Most planes can reasonably fit both a purse and feet under the seat.", "That's 4 inches above average. There is a reason why seats with extra legroom exist. Why should people in front of you have to cater to you and not use something built into their seat that they paid to use?", "Strongly disagree. People who bring suitcases as carry-ons are the problem.  Planes weren't designed to carry your luggage in the cabin.  And yeah, it sucks that they charge for checking luggage now but that's on the airlines, not your fellow passengers.  \n\n I pay to check my luggage instead of bringing on a large carry on.  If we are paying (basically) the same price for a ticket, I am entitled to a small amount of overhead space to stow my reasonably sized carry on bag. The space under the seat is for my personal item.", "This statement is not in any way antithetical to what I said.", "Of course you have the right to stuff your bag under the seat, but as long as that recline button is a bailable on my seat, I have a right to use it. Just like the person in front of me has a right use theirs. I say NAH. It frustrates everybody. But as long as people keep buying seats, the airlines don’t care.", "Airlines will check in bags for free if a flight is full. \n\nAnyway , if airlines have seats that recline , you can recline if you want to. Period.", "We must fly different airlines. Because I have never experienced that.", "Most flights Ive been on are 1 carry on + personal item (like a normal sized purse) and anything else would need to be checked.", "You're saying that everyone above 5'9 should be required to pay extra money to fly? That's not even above average for men.\n\nWhy should I have to cater to the person in front of me infringing on my leg space? The row where I'm sitting is my space. If you physically cannot lean back because my legs exist (my legs are attached to my body, which is sitting in the chair) then you're not leaning back.", "I also paid for a seat, and to be comfortable.", "The flight attendants tell you not to store the bags in the overhead bins. My point is, that you shouldn’t have to “suffer the consequences”…they instruct you to do that. She should be able to be somewhat comfortable, that lady was being an AH.", "Just want to chime in another international flier, lots of flights, lots of continents and cultures in my passport, and I am sure you are mistaken.  If you have your purse in your hand when they walk by for a last check they will tell you in no uncertain terms to put it under the seat in front of you.  Your simulation but be broken bc this is everywhere", "Im saying with the way planes are built, people shouldn't complain about people using their seat as it's supposed to be used, if they aren't willing to pay extra. \n\n\nShould commercial planes be built better and more comfortably? Yes. But don't take it out on the person in front of you.", "So you paid for ample leg room and still had a problem, or am I misunderstanding your situation?", "Yeah definitely fuck the airlines, but also if the person behind you is in the way then you shouldn't keep leaning back and hitting them. The space is not physically available. There's a person there. They're not gonna disappear.\n\nI guess I read this more as the woman in front taking it out on the OP by continually hitting her with the seat. I'd be pretty frustrated too, like again my legs are there. I can't take them off.", "And I am also saying this as a poor person who was only on a plane thanks to a way too kind cousin, who bought my plane ticket so I could give my goodbyes to a family member.", "The planes I typically fly on, don’t have seats with extra room (no first class). There are only 3 seats available with more room in the emergency exit row. I can’t afford hundreds of dollars more for priority seating, to get one of those 3 seats."]}