{"id": 5484, "submission_id": "ztxen2", "title": "AITA for telling my friends mom she choose to have a child at 45?", "selftext": "Background: My best friend and I have been best friends since we were 12. We are now 24. Her mom had her at 45. \n\nNow before everyone tells me that’s not possible it is absolutely possible for some women. I’m not a fucking scientist but my friend is proof that it can happen. So I don’t want to hear it. \n\nI also want to be clear THERE IS NOTHING WRONG WITH HAVING A CHILD IN YOUR 40’S. I DON’T GIVE A SHIT IF YOU CHOOSE TO HAVE A CHILD IN YOUR 40’S. THIS POST ISN’T ABOUT BASHING MOMS IN THEIR 40’s.\n\nBasically I’m married, we are financially stable, and we decided to have a baby. I got pregnant, and my best friend was overjoyed for us. She loves kids but has been really clear that right now she is enjoying being young and doesn’t want to settle down. She doesn’t see herself having children until her mid 30’s. Of course this is absolutely fine. No judgment. \n\nDuring my baby shower my best friends mom kept pouting. She kept going on and on about how she is going to be extremely old by the time her daughter has children and she won’t be able to enjoy them. How she just wishes my friend would get pregnant and settle down now. How it’s not fair to her that she won’t be able to be a grandma. I mean ranting to anyone who would listen. My friend looked really sad. I could tell she was upset. Everyone just looked uncomfortable as she was going on. \n\nAfter the party when everyone left I talked to my friend about what happened. She admitted to me that her mom has been really hard on her about settling down because of her age. But that she’s just not ready to and she needs her to understand that. \n\nFlash forward to them meeting my baby recently. My best friends mom launches in again. I just said to her “but Christina you made the choice to have a baby at 45. You had to know there was a chance you might be pretty old by the time you became a grandparent. It’s not fair to try and push Alison into a life she isn’t ready for because you want to be a grandparent.”\n\nShe got up and left. But my friend thanked me later. \n\nAITA?", "created_utc": 1671842666, "permalink": "/r/AmItheAsshole/comments/ztxen2/aita_for_telling_my_friends_mom_she_choose_to/", "score": 142, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I told my friends mom she made the choice to have a child at 45 so she can’t complain. \n\n2) I brought her age into it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Sounds like those were the the exact words she needed to hear!", "NTA. She needed to hear that. She may also be worried her daughter will make the same \"miscalculation\" she did by having a baby late in life. But again, she shouldn't bedisturbing everyone and needs to take no for an answer.", "NTA.  Good for you fir standing up for your friend, you said it well.  It's not her fault that her mom was 45 when she was born.  It's also completely normal to want some years to be young, and settling down before you're ready isn't great either.  Sorry that Christina will be an older grandma but it's Alison doesn't owe her a grandchild before she's ready IMHO.", "NTA\n\nThanks for standing up for your friend!\n\nShe has to see how unfair it is for her to put that pressure on her daughter. Not to mention hypocritical. \n\nYour friend’s choice about when (or whether) to try for children is her choice to make, not her mother’s.", "NTA. Good for you for standing up for your friend. Christina needs to realize that Alison will plan her family arrangements around her own needs, not her mother’s, and it was probably helpful for both of them to hear it from you. Well done.", "NTA and I bet your friend truly appreciated that. Great move Bestie", "I had my second baby at 41.  I fully understood I would always be the “older mother” with him.  But it’s also pushed me to take care of my health and be active so I will be able to enjoy fresh grandchildren in my 70’s.  I know many active 80 year olds.  \n\nYou are NTA.", "My youngest cousin was born when my aunt was 44.  Of course it's possible.  There are lots and lots of \"change of life\" babies out there.\n\nOP, you are NTA. Christina needed to hear it, and perhaps now she will quit bugging your friend about having children.", "Unexpected, NTA at all.\n\nLike… damn, true.", "NTA  - some people just need a good dose of reality to wake up.", "NTA. No family member gets to dictate if anybody will have kids or when. Your point is 100% valid. Having a kid later than most doesn't mean your kid has to catch time up so you can be a grandparent when you are younger. \"Hey I wanted to live life without kids for a long time but now you need to do the opposite and give up some young fun years for me!\" How she doesn't see the obvious irony is beyond me.", "NTA.  That's how math works.  Good for you sticking up for your friend.", "NTA You said truth", "Perfectly fine for her to have her kid at 45, but heaven forbid her own daughter follows suit. NTA", "It is possible. My grandmother had my my youngest uncle at 45. My mom, the next youngest, was 13-14 when he was born. \n\nNTA. Good for you for sticking up for your friend. And good for you for living your own life.", "NTA, good on your for standing up for your friend. You might be doubting yourself but remember your friend thanked you. She told you how much her mother’s ranting was hurting her. Remember that.\n\nMy grandparents had my mom and her brother in their 40s. They knew they would be older when my mom and uncle had children. More so when my parents waited to have me and my brother in their 30s. My godparents had their only child in their 40s. They accepted pretty early on that they’re going to be older when my good brother goes through the big milestones. There is nothing wrong with having children later in life but if you do you have to accept the fact that you will also be older when you become a grandparent.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackground: My best friend and I have been best friends since we were 12. We are now 24. Her mom had her at 45. \n\nNow before everyone tells me that’s not possible it is absolutely possible for some women. I’m not a fucking scientist but my friend is proof that it can happen. So I don’t want to hear it. \n\nI also want to be clear THERE IS NOTHING WRONG WITH HAVING A CHILD IN YOUR 40’S. I DON’T GIVE A SHIT IF YOU CHOOSE TO HAVE A CHILD IN YOUR 40’S. THIS POST ISN’T ABOUT BASHING MOMS IN THEIR 40’s.\n\nBasically I’m married, we are financially stable, and we decided to have a baby. I got pregnant, and my best friend was overjoyed for us. She loves kids but has been really clear that right now she is enjoying being young and doesn’t want to settle down. She doesn’t see herself having children until her mid 30’s. Of course this is absolutely fine. No judgment. \n\nDuring my baby shower my best friends mom kept pouting. She kept going on and on about how she is going to be extremely old by the time her daughter has children and she won’t be able to enjoy them. How she just wishes my friend would get pregnant and settle down now. How it’s not fair to her that she won’t be able to be a grandma. I mean ranting to anyone who would listen. My friend looked really sad. I could tell she was upset. Everyone just looked uncomfortable as she was going on. \n\nAfter the party when everyone left I talked to my friend about what happened. She admitted to me that her mom has been really hard on her about settling down because of her age. But that she’s just not ready to and she needs her to understand that. \n\nFlash forward to them meeting my baby recently. My best friends mom launches in again. I just said to her “but Christina you made the choice to have a baby at 45. You had to know there was a chance you might be pretty old by the time you became a grandparent. It’s not fair to try and push Alison into a life she isn’t ready for because you want to be a grandparent.”\n\nShe got up and left. But my friend thanked me later. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Might be biased bc my mom also had me at 45 lol and also constantly mentions me finding someone, knowing a guy I might like, how my cousin just had a kid, how much she' love to be a grandmother etc. ... but no, you're NTA. \n\nThat said, she might not have *chosen* to have a kid that late; my parents had given up on getting pregnant after decades of trying, and I was an absolute surprise. If that were the case then you still wouldn't be TA because you had no way of knowing and you only said something because she was making her daughter/your friend feel bad, but it still could've made her feel some kinda way to hear and you might apologize anyway just to be nice and keep the peace.", "My grandmother had my uncle (child number 15) when she was 45 years old. My oldest cousin was 5 years old when my grandmother had my youngest uncle. So, having kids at 45 is completely possible and my grandmother lived long enough to see the grandkids of all her kids.", "NTA.  You had your friend's back and you only said what was factual.  She is sorry she lost her victim card.  Hope she loses it permanently.", "NTA", "I had my daughter at 40. She doesn’t think she’s going to have children. And that’s entirely her choice. I really don’t understand parents who hassle their children about getting grandchildren , it blows my mind the entitlement of some parents. I’m so sorry for your friend", "NTA. I had my son at 37. Now I’m 52 and he is 14. I will be an older grandmother and most of my friends from hs are grandmothers and a few of my college friends are grandmothers. I would not trade being an older mom (it has rocked) to be a young grandma, and my kid might not even want kids.", "It wasn't your place to speak up it was your friends.", "OP, you are definitely not TA. However, it is possible that Christina suffered through decades of infertility and pregnancies that ended in miscarriage that you don't know about before she finally had a baby. Having a baby at 45 might or might not have been a choice. She definitely needed to hear what you had to say but there might be another perspective to her yearning for Alison to give her a grandchild. So I'm gonna buck the trend and go with a tentative NAH.", "NTA, but maybe it was life's circumstances (not necessarily her \"choice\") to have her later in life. I don't know the situation, but just saying sometimes there are fertility struggles, trouble finding the right person, etc. and that rubbed her the wrong way. Either way, it does not make it right for her to badger her daughter about her life choices.", "Yep, it was the truth, NTA. High five OP!", "Exactly and her friend thanked her.", "Thank you and I agree.", "I had my son at 42 and also know many active people in their 80's and 90's.  Ageism makes me furious.  But, sure, the mother was aware how old she was when she became a parent.", "Same here - had my kids at 36 and 39. I went into it knowing there's a good chance I'll never meet my grandchildren. It is what it is. I would never whine about it or pressure my kids to have kids of their own just so I could have a grandchild.\n\nChristina needed a reality check.", "Up until I read what she actually said I was expecting her to go full ahole in her delivery, but nope just straight up truth", "She’s in my home so it is my place. I already let it slide at my baby shower thinking it was a bad moment but it makes everyone in the room including my husband I uncomfortable.", "Yeah she was divorced and remarried later and has been open throughout the years about how she feels like it set her back. I get that! It’s totally fair but what’s not fair IMO is making your daughter feel bad for not settling down because your life circumstances put you in a place where you potentially will be an older grandparent.", "Ok cool. You asked opinions I have mine. Your friend need to speak up for herself not your place. Your friend needs to put on her big girl panties.", "Ppl are allowed to speak up when their loved ones are being mistreated. Yes, ideally the friend should have the confidence to stand up for herself, but she already admitted to OP that her mom's behavior was distressing her and that she wanted it to stop. The friend also had no problem with OP standing up for her, so there's no issue between them. \n\nAlso, OP is fully in her rights to decide what kind of behaviors from guests she allows in her home. It's her house and she doesn't have to allow bullying to happen inside it.", "So if someone is being a dick to your friend you should just let it slide because \"it's not your place\"?"]}