{"id": 5493, "submission_id": "zu0r0k", "title": "AITA for cancelling my daughters 13th birthday party?", "selftext": "I (38F) have 3 kids, L (12f) D (10m) and M (2m). L's 13th birthday is in March, and she has been so excited to finally be a teenager. We usually start planning a couple months before hand, so L can agree on something without changing her mind every second. Every year for L's birthday, we go to a hotel with a few of her friends. The hotel is always my birthday present, so she usually only gets a card from a friend. L has been looking at different hotels lately, and a certain one has caught her eye. The only problem is that it costs 100$ for a night. I can't afford that, after buying her brother a PS5 for Christmas. It has a huge pool and a waterslide, which is most likely why she wants to go. I told her it was too expensive, and instead offered to go to the same hotel we had gone to last year, which is way cheaper. It has a smaller pool, and a decent waterslide. L said no, claiming that she hated that hotel, that the water in the pool was \"dirty\" , the waterslide cut her leg open and she didn't want to swim in a cramped pool with \"sweaty 9 year old boys who will pee in the pool.\" I feel as if she is just being dramatic so she can go to a more expensive place to impress her friends. I told her no, we would be going to last years hotel and I thought that would be the end of it.\n\nBut, a couple days ago, she approached me and asked if she could bring along a little more people than we usually do (3 friends, L and I.) She wanted to bring 4 people instead, so one of her other friends could join as well and not be left out. I said no. L immediately started begging, saying its just one more and it wouldn't hurt. Eventually I snapped and told her that the party was cancelled, and to stop thinking about it. She started crying and telling me that I am a jerk, but I could care less. My boyfriend said I'm an asshole. I feel like I did the right thing, but AITA?", "created_utc": 1671853050, "permalink": "/r/AmItheAsshole/comments/zu0r0k/aita_for_cancelling_my_daughters_13th_birthday/", "score": 89, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) Cancelling my daughters 13th birthday party.\n(2) Because my daughter is upset she won't be celebrating her birthday.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Why does brother get $300-400 gaming system and she can’t have a $100 night for her birthday?", "You bought her brother a $600  game console, but refuse to spend more than $100 for her 13th  bday…YTA.\n\nTHEN, You cancelled the party?? Your boyfriend is right. You obviously have a ”favorite” child and it’s not your daughter.\n\nYTA", "YTA. The *slide cut her leg open*. You can afford a PS5 for your son, but you can't afford a hotel that isn't a health hazard for your kid and her friends? You can't even let her have one more friend? Yikes, lady. We can all tell who your favorite kid is, and your daughter will as well when she watches her brother open his shiny new Playstation on Christmas.", "You're freaking out over a $100 hotel?\n\nWhat was the last one you went to? Motel 6? $100 is NOTHING for a hotel and I'd be extremely suspicious of anything cheaper. \n\nYTA.", "YTA. You can’t afford a $100 hotel but can afford a $350 gaming system", "YTA\n\nHow much did you spend on that ps5 for your TEN year old and also how do you not remember how hard it is to be 12?\n\nShe literally accepted your crappy cheap ass motel and only asked to bring *one* other friend lol", "YTA. Send her to live with her dad if you dislike her so much.", "So what did you buy your daughter for Christmas?  Is she getting a $600 gift too. Or just the boy?  Do you even like your daughter?", "YTA I do not think this is real as I choose to believe no one sucks this much.\n\nI just… I can’t even be bothered to explain……. Ok I will try \n\nPS5 gift for son =/= $100 hotel party gift for daughter\n\nAlready super unfair in terms of gifts given to your kids… but now on top of that you don’t even want to give the $100 gift to your daughter or allow her to celebrate. So basically a PS5 for your son (for Christmas vs. Your daughter’s milestone bday) and now nothing for your daughter (or something cheaper than $100)? \n\nPS5 gift for son =/= no gift for daughter?\n\nIdk, you tell me. Does that seem shitty of you? Maybe I am just really bad at math..", "After being financially irresponsible at Christmas I cannot afford a hotel that my child will safely enjoy is what I think you meant to say? Not 100% but that’s what it seems like. You snapped because you are unable to communicate effectively with your child, I say this being the mother of a newly 13 year old girl. She is excited and hoping for something awesome for a milestone in her life. You knew the birthday was coming up in March and chose to spend the money on a PS5 for your son instead of buying an Xbox or something cheaper that allows you to pay for your child to not cut her leg open on her birthday. Congrats YTA", "YTA. So you're saying that you can't save $300 over the course of three months? Yet have no trouble buying your son a PS5. Which, if you're going by current prices, can start at about $350, depending on where you purchase it from. Wow. You're either a cheapskate that favors the boys over their sister or you just suck at saving money. Either way, you really screwed this up and showed your daughter how little regard you have for her.", "YTA.. first, a literal PS5 for a TEN year old?! The way you word it makes it seem like its ONLY for him as well. Second, most hotels cost around 100$.. If I was her I would never want to go to something cheaper. After refusing to take your daughter somewhere nice for her 13th birthday (which imo is going to be a lifelong memory) you CANCEL when she asks for ONE more friend. 4 friends is not even a lot. Let your daughter enjoy time w her friends. Bet she won't be around as soon as she turns 18.", "YTA. I guess you don't think much of your daughter. Keep this up and you'll push her away and she won't bother with you. 13 is a landmark birthday so I can understand her being upset. To go so far as to cancel everything is going waaaayyyy too far. Behave like the adult you are supposed to be.", "YTA. No doubt about it.  You dont have 100$? But you had $600 for her brother, what did you get the daughter for christmas, just curious? A $20 charm bracelet?\n\nSurely you can save 100$ between now and february for her birthday atleast", "YTA. What did you buy L for Christmas? I suspect it was a lot less than a PS5. \n\nAnd why does what you bought your son for Christmas come into this at all? It's three months until her birthday. Surely you can save up $25/week for the nicer hotel. \n\nPlus you are TA for cancelling at all.", "YTA\n\nI had to look up the price of a PS5, and it’s like $500!!!! \n\nYou KNOW that a hotel stay is what you do for your daughter. From what you have said, it’s a couple months until her birthday. \n\nSo you’re telling me that you have $500 to spend on a PS5 for your son, but you can’t spend $100 on a hotel room for your daughter? Am I missing something?", "Also how in the world do you feel like you did the right thing? What lesson do you think you were teaching", "Wow your favoritism is showing but you don't seem to care about even trying to hide it anymore.  YTA!", "YTA. Do you even like your daughter? \n\nYou can spring for a gaming system which is the same cost as a weekend at the hotel but can’t do one night for her??? WTF?", "Clearly YTA. \n\nShe’s growing up, she’s going to want different things like a nicer and bigger place. Canceling is a huge AH move when she asked a reasonable question and you decided to be unreasonable", "YTA - I’ll play along to this most likely fake story . OP sends hundreds of dollars on a PS 5 for the son but can’t muster up $100 for one night at a motel. Then gets  mad because the daughter doesn’t want to stay at the much cheaper motel with the pee filled pool  and the rusty slide that cut her leg the year before. Oh and now since daughter is unappreciative the party at said crappy motel is cancelled.", "YTA. I feel sorry for your daughter. She clearly doesn't want to go to the same place as last year for valid reasons.  When she tries to make it a little more tolerable you cancel? Doesn't make sense.", "This can't be real. First off, almost every hotel is over $100 unless you are lucky to get a good deal from a third party vendor, or are at a roach motel.\n\n 2nd you have your daughter, one friend and yourself ,well that's fine but most teenage girls like to have a few friends along with.  What is the issue with her inviting an additional friend. You just say no with no explanation. Do you not like this particular friend.  You have to use some context. of why you're so adamant that this friend doesn't attend.\n\n I'm trying to figure out why you're so mean to your daughter. She asked for some reasonable things bigger nicer hotel, and a extra friend. But that's too much for you to even consider. If you can't afford a hotel then why go in the 1st place.\nYour a major AH", "YTA\n\n&#x200B;\n\nyou 100% have a favorite child and it def aint your daughter", "Yeah dude you fucking suck.", "YTA\n\n\nYour daughter can't have nice things because you give the nice things to your son.\n\n\nIn what way are you not the AH?", "You are the major asshole. The fact that you even need to ask boggles my mind. Go be a decent human being and pay 100.00 for your daughter to have a birthday party. My God, if you can't save 100.00 from now until Feb, you are doing a lot of things wrong. Hell you could probably sell some used stuff and get 100.00 to pay for her birthday.", "INFO: why does her brother get such an expensive Christmas gift? Is she getting an equally nice Christmas gift? I dont think $100 is an insanley large amount to spend on a bday party but I Live in a super expensive city so idk", "YTA and congratulations on showing blatant favoritism to your son. Your daughter def won’t forget this when she turns 18", "YTA 100%. You can buy the 10 year old am extremely expensive video game system for Christmas (which you specifically call out is just for him & not the family), but the $100/night is too much? Tbh don’t know where you’re at if you are finding hotels for under $100/night with a pool, slide, etc, because most places it’s at or above that price. TBH I’d be sketched out there too. Just because that’s what she’s done in the past doesn’t mean she’s going to want to do that forever; she’s growing up, interest change. To just say you’re going to cancel because she voiced her thoughts on her own birthday? Yeah, YTA.", "YTA. Maybe you should’ve spent less on your son so that you could give your daughter what she wanted for her birthday. Her first real MILESTONE bday. Your boyfriend is right. You’re mean to your daughter and apparently proud of it. You should be hanging your head in shame. Apologize and make it right or you’ll be reaping the consequences as soon as she can flee. Or is that what you want?", "Is this a joke? YTA. You spent way more on the ps5", "YTA. A huge one. Are you serious?", "YTA big time", "Wow YTA \n\nhow much did the gaming console cost compared to a nighr at the hotel. \n\nSeem to me you splurge on the brother way more then the daughter.  Feels like you have a favorite kid.", "YTA… I was with you until the part about buying the PS5 for her brother. As a holiday baby myself… that feels REALLY unfair to your daughter.", "YTA. You’re skimping on your daughter so you can spend more money on your son? Lame. Stop playing favorites.", "Yta - I’m guessing her brother is the favourite.", "yta. a huge one.", "YTA.   You are unbelievable!  She is so excited- but hey I can’t do what she wants cause I bought a 10 yr old a PS5.\nIt’s a shame your boyfriend has more sense than you.  She’s 13 and you said it’s a big deal.  How’s it a big deal if you take her to the same smaller place as last year.  And no, you can’t take one more friend I bought your brother a PS5 which begs the question, what did you buy the other kids? I see lots of fun for this kid in her teen years.", "YTA. You are an awful mother and your daughter deserves so much better than you. When she cuts you off think back to this moment.", "wanted to add that a hotel less than 100$ is def not the cleanest place, treat your daughter to at least someplace sanitary.", "YTA I can’t believe you’re actually trying to justifying this by saying you blew a lot on 1 kids Christmas present so now another kid gets a crap birthday.", "YTA. One child’s gifts should not be a reason you can’t afford a gift for another especially not for events that months apart. This reeks of favoritism.", "YTA. 1 more person is not a few. You can’t spend $100 on her because you spent $600 on her brother? There’s so much wrong here.", "Echoing what someone else asked - what did you get your daughter for Christmas? I mean, PS5s are still going for $600, aren't they? That's a lot for one kid on one holiday. But please, keep displaying blatant favoritism. YTA.\n\nEdit: Just noticed the age difference between your oldest and youngest... you don't have a daughter, she's just a future built-in babysitter, isn't she?", "YTA. You sound like way more of a child than she does. If you can't handle your emotions when she pushes back this little bit, you are not competent to parent teenagers. Go to therapy NOW before you do anymore damage.", "YTA. $100/night is not expensive. I truly wonder what crappy hotel you stay in that has a pool and cost less then $100/night. Give her the choice of the PS5 or hotel room and then it's up to her if she wants a party or PS5 more.", "YTA \n\nAll her concerns about the previous hotel is very valid. The slide cut her leg, and the water is dirty so that could have led to a very serious infection.  It sounds like the hotel doesn't change the water regularly or add the property chemicals. \n\n\nHer concern about her other friend feeling left out is also valid. I think it's sweet that she is taking her friend feelings into consideration. Since you are already going to the previous hotel because of cost why not let your daughter bring an extra friend as a compromise?\n\nCancelling her entire party is not teaching your daughter that life isn't fair. You're teaching her that YOU'RE not fair, that you will value the wants of her brother over hers and trust that will cause lasting resentment and damage to not only your relationship but the relationship between your daughter and your son.", "YTA, a big AH. \nWhy do you have to invalidate and hurt her feelings like that?? If you can’t afford a $100 hotel, then you could have and should have offered her a compromise to find a place that costs in-between last year’s hotel and her request. But IMO, if you spent too much on her brother’s game console and this is the result, then that’s on you.\nAnd so what if she wants to celebrate with one extra friend. I would bet that they’re a close group and want to share this experience together. Either you’ve forgotten what it’s like to be a teenager or you never had any friends yourself.", "YTA and a massive one. You clearly favor your son. I feel so bad for your daughter and when she turns 18 I wouldn’t expect you to ever hear from her again", "YTA- pathetic excuse of a mother", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (38F) have 3 kids, L (12f) D (10m) and M (2m). L's 13th birthday is in March, and she has been so excited to finally be a teenager. We usually start planning a couple months before hand, so L can agree on something without changing her mind every second. Every year for L's birthday, we go to a hotel with a few of her friends. The hotel is always my birthday present, so she usually only gets a card from a friend. L has been looking at different hotels lately, and a certain one has caught her eye. The only problem is that it costs 100$ for a night. I can't afford that, after buying her brother a PS5 for Christmas. It has a huge pool and a waterslide, which is most likely why she wants to go. I told her it was too expensive, and instead offered to go to the same hotel we had gone to last year, which is way cheaper. It has a smaller pool, and a decent waterslide. L said no, claiming that she hated that hotel, that the water in the pool was \"dirty\" , the waterslide cut her leg open and she didn't want to swim in a cramped pool with \"sweaty 9 year old boys who will pee in the pool.\" I feel as if she is just being dramatic so she can go to a more expensive place to impress her friends. I told her no, we would be going to last years hotel and I thought that would be the end of it.\n\nBut, a couple days ago, she approached me and asked if she could bring along a little more people than we usually do (3 friends, L and I.) She wanted to bring 4 people instead, so one of her other friends could join as well and not be left out. I said no. L immediately started begging, saying its just one more and it wouldn't hurt. Eventually I snapped and told her that the party was cancelled, and to stop thinking about it. She started crying and telling me that I am a jerk, but I could care less. My boyfriend said I'm an asshole. I feel like I did the right thing, but AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA, in so many ways. Honestly, her reaction and any outburst seem valid. You clearly favour your son, and she definitely notices that. That's a whole other can of worms that is too much to address here though.\n\nWhat did you get HER for Christmas?\n\nAlso, $100 for a birthday party, much less a hotel with a pool, is nothing.\n\nHeck, I was looking for something similar for my daughter (who is turning 12) and for a decent but smaller pool, no slides, it's easily $150/night. And on TOP of that, when you said no to the nicer pool, she asked to bring another friend (Which doesn't increase your costs generally, but if it does, it's just a small portion, I'd guess easily $20 or less for the hotel rental based on the current nightly rates). And then you completely cancel it because she's trying to find a suitable compromise and you didn't like that?\n\nShe's at a formative age with friends. Leaving ONE out is pretty socially unacceptable at this point, her pushing for this is understandable.\n\nI'm just in awe here of how callous you seem to be to your daughter. If $100 was really an issue you wouldn't have gotten a PS5 for your son.\n\nAnd you should try communicating budgets more kindly to your daughter when they need to be discussed. This could have been a great budget learning moment. This is what I do with my almost 12 year old, we set a budget and then she gets to participate in planning within that.", "YTA.  Just save some time and say you dislike your daughter.", "YTA. You are Momeneezer Scrooge. You are absolutely playing favorites and your daughter is going to remember this for a long time.", "Plus, her birthday is in MARCH. It’s 3 months away. If you can’t put away $100 in 3 months, you have larger issues than than a hotel room. \n\nYTA.", "Real talk OP.\n\nHow long are you going to hate your female child? nuh nuh, come on, don't lie and say you love them all equally. Let's just be real. You know you sort of hate L, not sure why.\n\nShe got hurt there, the water is dirty. What kind of mother says that's good enough for her kid? Would you let your precious SONS go into that water or have THEIR legs cut open?\n\nIf you let your kid go to an unhygienic place where she has  been hurt before, are you trying to abuse her? IS there some magical lesson she is supposed to learn?\n\nHer younger brother gets a much more expensive gift-  WHY?\n\nWhy do you hate your daughter? And how long are you going to do it? Are you hoping she gets injured more at this cheaper place?", "Oh God, this can't be real.\nSo, you are:\n1. Diminishing your daughter's first milestone birthday and painting her in an indecisive light through your description. When she decided what she wanted, you blatantly rejected and disrespected her choice.\n2. Getting your son a $500 gift but not even want to spend 20% of the money on the daughter. A gift that he MIGHT share - usually, stuff like these are common gifts between siblings, they are for everyonez especially in your kids' age group.\n3. When she compromised and requested JUST ONE MORE FRIEND at your crappy unsanitary, you denied that and cancelled her birthday celebration.\n4. From your comments: you got your son the PS5 because he broke his Xbox?!?! Then you justify your favouritism by saying \"LiFe Is UnFaIR\". No, ma'am, YOU ARE THE ONE WHO IS UNFAIR. Life is just sad and unlucky for her that she got you as her mother. \n\nYou clearly have a favourite child, and you don't give a damn about your daughter. Your bf is right. Your daughter is right. Also, you are so adamant on sending your daughter and other teenage girl to an unsanitary hotel with pre-teen boys in the same pool shows that you are not the brightest bulb in the room. There is no possible situation in which you are not a jerk, bad parent, unfair, and an asshole.\nI hope you daughter sees through your bs and cuts you off as soon as she can. \n\nFor the judgment bot: YTA.", "YTA, and from your comments nothing said here will open your eyes.  But, brother broke XBox, gets PS5.  Sister wants party at safer hotel and pool, cancel party.  Do you see the difference in how you treat your kids?", "YTA. The favoritism is real. This is No Contact / Low Contact 101.", "If you can’t save $100 in 3 months and have three kids, then you cannot afford to have three kids. Not to mention that you got her brother a PS4. This is a big day for her, yet you managed to ruin it before it even happened. YTA, major one at that.", "YTA. $100 for a room with amenities like that? And one more friend? You act like she was begging to invite her entire classroom. You can afford a $450 console and I’m sure a game or two, but can’t do this for her? Sad.", "YTA YTA YTA YTA And I find it VERY telling that you mention you getting your son a PS5 for Christmas but fail to mention what you got your daughter. I’m guessing her Christmas present is no where near the same cost. And to gripe about spending $100 for a hotel after spending multiple $100s on your son? For something he “might” share. And then cancel the party altogether? You will get zero sympathy here. I imagine that in a few years you will be posting and boohooing that your daughter had gone LC/NC and you don’t know why.", "I don't understand why getting a big Christmas gift for your son has any bearing on a birthday that won't be for 3 months? You won't have $100 in 3 months for her birthday??\n\nYTA big time.", "YTA PlayStations 5’s *start* at $600…. You’re buying the 10 year old boy a $600 game system for Christmas so you cannot afford the 13 yo’s $100 birthday request? So tell us… why’s the 10 yo your favorite child?", "YTA - and clearly favor your son. Wow. Just wow", "YTA. It’s easy to see who the golden child is, and it’s not L. Mommy invoked the Gratitude and Entitlement clauses and canceled the party. Mommy is a partial, controlling AH. Do you think L can’t see it?", "YTA, and your daughter will find out she's not the favorite on Christmas morning (if she doesn't know already).", "YTA 100%. This should have have been titled AITA for loving my son more then my daughter. You clearly favour him over her.", "You don't have $100 for a hotel,  but do have $500 for a Playstation? YTA. Her birthday is 3 months away. Save $30 a month and take her to the nicer hotel. If you found $500 for a Playstation, I'm sure you can find the difference between the cost of the hotels.", "YTA.\n\nFirst off, a PS5 is a few nights worth at the hotel she wants to stay at, and since her birthday is a few months away there is time to plan.\n\nSecondly, maybe you haven't paid proper attention to the hotel you usually go to. Maybe it is dirtier, and it might be better to go somewhere more sanitary. Find a reasonable priced one and *compromise.*\n\nFinally, you seriously canceled the party over one other person? It's not like your daughter did something really bad! You are being uptight about this for no reason. If prices and amount of people are a problem, then do somewhere else for your daughter's birthday.", "YTA I bet this isn’t even a one off. Don’t be surprised if your daughter loses contact with you when you’re older. So funny to me when moms distance themes-elves for their daughters in favour for their son… who do you think will invite you to the birth room, and take care of you in your old age? Your future DIL ? HAH when you have no relationship with your daughter and are in a retirement home alone I hope you remembered this comment.", "Because she’s a girl and destined to babysit.", "YTA I am also pretty young and the way your daughter sees it, you are willing to spend more money on her brother foot Christmas than you will for her birthday. There is clearly a favorite if your picking your son's PS5 over your daughters safety", "YTA, if it hasn't been made official to your daughter, it's blatantly clear the son is the favorite. \n\nBut your comments scream troll so thank goodness you're not a real mother.", "INFO;What did you get for your daughter for Christmas and how much did you spend on each kid", "What's your daughter getting fir Christmas?", "Big YTA. You clearly have a favorite child.", "Yta favoring much?", "YTA \n\n\nOh, look another \"aita because I favor one child over the other\" post. \n\nOP. You are definitely playing favorites here. You are willing to 3 or 4 hundred dollars on your son, but 100 dollars for your daughter is too much? Expect her to go full NC after she turns 18.", "INFO: how long did you save for her brother's Christmas present? I'm just trying to understand how your financial situation is good enough for you to spring for a PS5 but not good enough to be able to scrounge up $100 by March.", "Wow… you sound like a really shitty parent. Your poor daughter.", "YTA.", "INFO: What did the brother get for his last birthday?\n\nClearly he’s the favorite so I’m just curious what his annual gift/party budget is compared to his sister’s. \n\nYTA.", "YTA. \n\nAnd you need to reevaluate how fairly you treat your kids. Seriously look over what you have purchased for them for Christmas. Is the son getting $1000 in gifts but the daughter is getting $150? My parents did this and I fucking hated it. I would always see piles of gifts for the girls and scraps for myself. To this day I fucking hate getting Christmas gifts due to the years of disappointment and unfair treatment. \n\nIt was never that severe to make me end it with my parents but it has made me reflect on any treatment they get from me now that I’m an adult and they are old. I’ve had to talk to them about being fair to my kids and if they aren’t then they won’t know them. They seem oblivious to the unfair treatment that my brother and I got from them despite countless example and the girls agreeing. \n\nYou need to evaluate that. I’m guessing you often do this and your daughter will likely hate you for it.", "Lmfao you getting that ps5 because either you also want to use it or your bf plans on using it", "YTA\n\nyour son can get a whole gaming system but she cant get a 100 dollar hotel? because you “cant afford it” ? her birthday is in MARCH.  there’s several paychecks you can take a bit of money out and put to the side until then & maybe if you file taxes early enough you might even get those in time.", "You really think taking her to a hotel where she already cut her leg open is an acceptable, let alone comparable, gift? YTA.", "Jesus, this reminds me of not being able to get a $100 laptop for school for Christmas the same year my older brother (the favorite) got a CAR. \n\nYTA, and one day your daughter will be either minimal contact or no contact if you keep this behavior up.", "YTA\n\nGirl what.\n\nMy parents have a similar system with me and my birthday but the exception is that they don’t favor my siblings. This is still MONTHS out and you’re being an ASShole about it. Maybe think about your financials before blatantly favoring your son over your daughter regarding their birthdays. \n\nYou rather her be somewhere cheaper where it has CUT her actual leg open?? What the fuck", "Let's say there a $30-$40 difference in hotels, how can you not justify spending that extra bit when her sibling gets a $500 console? Your excuse that \"he'll have more hours of fun than just one night of it\" is absolute bullshit favoritism at its finest. Way to teach your daughter that her entry into being a teenager isn't as important as gifting something to her sibling. That she isn't worth as much as her sibling. You should have a multiple hundred dollar difference in your children's gifts either.\n\nYTA\n\nETA I'd put money on you using her for unpaid childcare within the next couple years too - if you aren't already", "YTA \n\nSounds like your son is a golden child and your daughter is a scapegoat. Cancel the party because she asked for another friend to join? Lady, watch in 5 years you will be here asking “why my daughter went no contact with me? All I have been is a loving mother and loved the same my son and my daughter”", "YTA big-time. The hotel is the gift but you won't even let her pick the hotel?", "Yes YTA and you are going to have a lot more tween and teen drama in your future, you need to develop better coping skills quickly.", "YTA, Christmas is canceled kids.  Too much whining we are all done here pack it in.", "YTA, enough people have explained why.", "Wait $100 is too much for a hotel room? I was not aware you could get one for less anymore. What ever the difference is can't possibly be that much. Get the room.", "YTA, the blatant favouritism here is astounding.", "YTA and she will never forget this. Brother gets a game system worth hundreds not to mention games and other shit that costs all year long, and she's asking for a LITTLE more, on ONE\nmilestone day and you think she needs a life lesson? You don't think turning 13 warrants a little something special? What did brother do that was so magnificent he warrants something so extravagant and she can't even get a waterslide that doesn't expose her to tetanus?", "YTA. Part of having 2 kids is figuring out how to balance everything between them. If you couldn't afford a nicer hotel for your daughter you shouldn't have bought a PS5 for your son. \n\nNow all your daughter sees is that you were willing to spend $400-500 on her brother but your weren't willing to spend $100 on her.", "YTA - I am always shocked by the lengthy explanations and excuses people give to avoid paying $25. What did the other hotel cost per night? If it even had a few amenities it was likely around $70. Only motels are cheaper than that.\n\nIt's unfair for you to take out your anger and stress about having insufficient funds on your kid. This is definitely something that can be fixed though and I think you should make a plan to make it up to her.", "Info..what did your daughter get for Christmas? Were the gifts close in price or did daughter need to learn a lesson then too?", "YTA.\n\nThis is a trip that's not even happening until *March*. You bought a PS5 for your son for Christmas, but you can't save an additional $100 in the next three months for your daughter? We now know who the golden child is.", "Bro gets ps5. She can’t have an extra friend and actually, no birthday at all. Check your favouritism. Yes yta. I’m hoping this is a joke hey", "YTA. You ARE a jerk! You got your other kid a gaming system and you can’t save $100 by March for your daughter? Your favoritism is showing.", "YTA \nIt’s parents like you that wonder why there kids don’t talk to them anymore. You are clearly favoring your son over your daughter. You couldn’t afford a $100/night hotel for your daughters birthday but could afford a $600 game console for your son. What did you get your daughter for christmas?", "YTA, and a really terrible parent. \n\nTake her to the $100 hotel 5 times, and then maybe you'd finally start to treat your children equally.\n\nEdited to clarify - 5 times THIS YEAR. Not just 5 times over the next several birthdays. But 5 times in the immediate future, and before her brother gets any more/other gifts.", "But also when she actually finds out her brother got a very expensive give on Christmas Day, and you wouldn’t splurge on an experience that could mean as much to her. \nThat’s going to break her heart, and some resentment will come with that.", "Where are you staying that’s less than a hundred a night??", "YTA. In 5 years…AITA for telling my daughter she’s selfish for going NC with me just because I always favor her brother and love him more?", "I think I may have to just stop reading posts on this sub for awhile after this one, holy cow.", "YTA.  That poor kid.  I'm just so tired of people having children they don't really want or like.  Stop it.  Kids don't deserve that crap.  Get therapy.  Be a better parent for both your kids and examine why you don't want your daughter to have a special day, why your priority is to do the least possible instead of the most possible.", "YTA. Funnily how despite answering a lot of questions you've avoided everyone asking what your daughter is getting for Christmas!", "If $100 is too much for a hotel fair enough, but I do have to point out that you did spend like $600 on a ps5 for one kid and have until march to save $100 up. Also why can't she have 4 friends instead of 3?", "i say you are because it is the only birthday she will be turning a teenager plus she was just trying to fit in, i understand you cant afford it but u also didn't have to cancel her party because of this sorry if it seems that i am trying to parent your child, i am simply giving the advise you have appeared to seek.", "YTA. Seems abusive to me. It is obvious you prefer your son and make no effort for your daughter. Awful.", "YTA - this is literally a power play. Your son breaks his last game system becsuse hes not mature enough to take care of his things, you spend $500 on a new console for him, you don't want to spend $100 on a nice hotel for your daughters birthday when she's not even getting a physical present from you...and it's her 13th birthday, which is a milestone. This isn't the way to teach her \"life isn't fair\", it's just bullying.", "When your daughter goes NC with you in 4 years >>>>>> YTA", "Yta. Ps5 vs one night at a hotel??? Think about that for a second lmao", "Where do you live that 100 is an expensive hotel?  I live in a very small town and even the roach motel is that much.  100 for one night with the pool is a great deal.  Except you spent it all on your other child.", "I have a few questions. First, why can't you save the money between now and then for the better hotel, since the birthday is in March? Second, what does your son's xmas gift have to do with a birthday that's months away? Third (though related to the second question), is L getting an equally priced gift for Xmas? \n\nAs things stand, YTA.", "YTA - wtf is even going on? You have months to plan she’s making normal kid requests why are you so angry it’s literally her birthday have some patience and treat this child like you love her.", "Info:  although everyone is saying the same thing, I’d like you to clarify how many nights in the hotel you usually spend and how many meals for each friend do you need to pay for.", "YTA. So you can spend hundreds of dollars for your son a PS5 but not for your daughter for her birthday?? Way to show favortism..", "What is it with moms and their teen daughters on this sub tonight?", "Info: Why are you pretending to care about your daughter?", "INFO: what did she get for Christmas?", "I hate when people call teenagers \"dramatic\" for expressing their opinions and concerns. YTA", "YTA You’re a massive ah. You know her birthday happens every yr on the same day. You know what a big deal this specific birthday is. Nothing she asked for was unreasonable. But apparently your son getting an expensive gift was more important.", "Info: what is she getting for Christmas?", "YTA. You don't take major life events like holidays and birthdays away and replace them with punishments unless you're abusive. Those days last as memories forever, good or bad. \n\nClearly your son is your favorite, and you are a major AH.", "Yta - you can’t afford a $100 night hotel for your daughter birthday?? Wth. But ok with buying 500+ for a gaming station for your son?? You are treating your daughter so unfairly. Just host a real birthday party! Sheesh", "YTA - 100%. Your daughter is excited so yes she’s talking about it. You snapped YOU are wrong. \n\nAs for the hotel - seriously start checking prices online. There’s hopper, Expedia, Hotels.com and a TON of other websites where you can score a deal on the hotel. Seriously this is NOT hard just start looking early to get the best deal.", "You are such an a-hole and a really poor parent in this instance.", "You said you usually start planing this a few months ahead, so you knew how much should be spent since she suggested this other hotel . You spent HOW MUCH on a Christmas present but this is your daughter's Birthday .\n YTH", "YTA. Who buys their son a $400 gaming system that he “MIGHT share with her,” but can’t spend $100 on a super fun night celebrating your daughters day of birth? And now for her birthday, you’ve cancelled her only plans and she can MAYBE just share her brother’s playstation for the evening instead. When you buy her a piece of a birthday cake with the wrong name on it, make sure you at least splurge for a candle!", "You cancelled the party because she wanted to bring one other person? YTA. Loud and clear.", "YTA. And $100 is still suspiciously cheap for a hotel", "Showing your ass and favoritism in one stroke? PRICELESS\n\nFor every other asshole move you want to make, there is Mastercard.", "And the party is in March. She won’t have 100.00 in March?", "That's what I'm screaming!", "Exactly, as though these systems aren’t also status symbols in addition to entertainment, let’s be real.", "400-500, digital is 400 and the disc version is 500.", "Ding ding ding", "Exactly! Also, spending $600+ on son now is going to prevent her from having over $100 in March? I bet she didn't even have the money to actually buy that PS5 and she had to put it on a credit card or finance it through the store. I also wonder what OP got her daughter for Christmas as she makes zero mention of that.", "Playstations can provide days of entertainment. 100$ for about a 12 hour stay that they'll be asleep for most of the trip? Besides, her brother might share once in a while.", "My eyes literally went 👀👀 when I saw the part about the slide. Crazy that she would let her daughter go back there with that kind of danger", "Lol right? Anything under $100 with a pool, I wouldn’t want my kid within 100 yards of 🤣", "Yeah lmao the cheapest I've been to was like a $60 motel 6. No pool, very small, and really just a place to crash", "$400+", "Walmart.com has them listed for $600 and up", "$500 for the PS5\n$90 for an extra controller\n$60 -$80 per game \n$75 - $100 for the charging station\n$100-$200 for gaming headphones\n$100 for PSN online gaming for the year\n\nSo 10 year old gets $950+ just for the console, accessories and probably other presents for Christmas.  So she can’t afford one night at $100 for a nice hotel 3 months and adding another guest to the mix.\n\nTell me who the golden child is without saying who it is!!!\n\nI feel this child’s pain.  My birthday is in March and my brother always received the better gifts for Christmas and his birthday in August and didn’t have to share.  We go the Circus in February for my birthday just the family and it was my main gift.  As you can see I had to share and no friends were allowed.  Needless I don’t get along well with my brother 40 years later.", "She’s 12 and she wants to invite one more kid so no one in her group is left out! That’s a stellar 7th grader.", "Could be. I know way too many people, who make parenting choices like the OP.", "But he broke his Xbox so the logical thing to do is buy him a ps5 obviously. Why not get another Xbox too? 🙄", "He already had an XBOX. He broke it, so I got him the PS5 instead.", ">Besides, her brother might share once in a while. - OP\n\nOh I think it's definitely ONLY for him.", "To teach her that lifes not fair and she should be grateful for what she gets?", "Or when it’s time to pick a retirement/nursing home", "also how apparently the water slide at the cheaper hotel cut her leg open??? I feel like OP is just glossing over that.... idk the details but it sounds like a bit of a safety issue.", "The daughter isn't even a holiday baby, her birthday is still 3 months away. This makes it worse in my opinion", "Nothing against you, but that's not a hard guess....\n\nWhat a shitty mom.", "Whaaa....I had totally read that as 1000. Hold up: PS5 for a 10 yo. But 100 hotel is expensive? Make it make sense.", "She already babysits and is completely fine with it.", "She isn’t getting the PS5 for Christmas. OP got that for the child with a penis.", "$100 is expensive for some people. \n\n&#x200B;\n\nBut he PS5 (which costs 500 USD + tax) is not for her, it's for her brother. Call me weird, but I would expect parents to give their children equal value of gifts.", "What would the cost in between even be? Even a crappy motel/hotel around here is going to cost $50 or $60. I can't imagine there's much in between.  She is just being ridiculous.  I'm sure she could find $40 over the next 2 monis she actually wanted to.", "I certainly understand all things are relative, but she lost me when OP said that the $100/night hotel was expensive but she bought her son a very expensive gaming system. Where I live $100/night would get you into a Red Roof Inn at BEST. If we have money for the gaming system we have money for a nicer hotel that kids don’t visibly pee in.", "She is. She says the daughter already babysits.", ">Besides, her brother might share once in a while\n\nMy goodness. Rule number 1 is holding me ba**c**k right now. But yo**u** are absolutely the asshole. Do you eve**n** love your daugh**t**er?\n\n&#x200B;\n\nAnd assume I'm Australian.", "That's not her gift though. That's her brother's. What about hers? You are basically trying to be cheap with your daughter. She should be getting a gift that's also equivalent to around $600, regardless of what it is. A gift is also about what the other person likes and wants, not what you think is practical and better for yourself (to spend less)", "Buckle up for her teen years because you've got it coming. YTA.", "You suck", "The two really don't compare at all.  YTA for obviously favoring your son.", "You posted this here for opinions on whether or not you are the asshole haha uh so I suggest you don’t reply to those who call you an asshole to try to justify your decision making", "Oh well ok as long as the golden child might share once in a while then that’s fine /s", "Makes me wonder what you got her for Christmas? Is it equivalent dollar value to your sons gift. Or did you get her socks since it’s winter", "Is this your first day as a girl ??? or have you completely forgotten what it's like to be a 12-13 year old tween girl?  \n\nAre you always so transactional where you calculate the money spent to the hours of time?  Do you even love your daughter?  \n\nI have so many questions but it doesn't matter  You're absolutely the AH no matter what.  It sounds like you never wanted to take her to begin with.  \n\n>Besides, her brother might share once in a while.\n\nRight, because that's what boys that age are known for.  Share with big sis!", "I’d be very curious to know what your daughter’s Christmas gift is.", "The PlayStation might give years of fun but the memory your daughter makes will last her entire life. I know I still think back to when my parents did things for me that seem silly to do now. Some of my favorite memories :)", "Do you even read what you write? In 10 years will your son remember what he played during the week of your daughters birthday? Will he even remember next year? This is a milestone birthday for your daughter that she will remember for years. And you want to take that away from her. And so gross about the $500 PS5 for brother but not $100 for her milestone birthday. We can see who the favorite child is. YTA", "*might*??? Damn. YTA", "It's 100$ to make an important milestone birthday for your daughter and make her feel special and loved. It's memories that will last her a very long time.\n\nYour spending several hundred dollars on a Playstation be you 10.y.o. broke his other several hundred dollar xbox.\n\nQuite frankly, if I didn't think you'd steal the money and spend it on your 10 y.o. i would send you daughter the 100$ to have an awesome birthday and chip in a bit more so she can treat her friends to a pizza party. She deserves it", "$500+", "That… makes it worse", "This has to be fake", "Put down the shovel. \"He was irresponsible and so I bought him something more expensive that bankrupted me instead of making sure I would also be able to pay for my daughter's birthday.\" is not the rebuttal battle you think it is", "That's really messed up. Your son breaks something, albeit it can be an accident, and he gets rewarded. Your daughter speaks her mind, brings up valid complaints, and you punish her. How is that fair?", "so what if he breaks it , he would get another? and yet your daughter cant have a party?\n\n&#x200B;\n\nway to show you hate your daughter, hopefully she dumps your ass in a retirement home", "Wow that takes the cake. So you have an ungrateful son who broke an expensive gaming system and you thought you should go out and get him a more expensive system? How does that make sense to you? Like, as a parent I wouldn’t be replacing something my kid broke, it’s a good time for a life lesson and have him save up by doing chores to earn it. He wouldn’t be breaking it if he paid for it", "So you reward him for breaking his gaming system by buying him an even more expensive gaming system?  Make it make sense! Your poor daughter.", "Wow\nSo he breaks a Xbox with is very expensive more then the hotel and in your mind you think it’s smart to. Buy him a ps5 with is again more expensive then the hotel", "So, you son is clearly too immature for such expensive playthings, yet you continue to spoil him and treat him better than your daughter? YTA.", "Soooooo, let me get this straight. Your son was irresponsible with his things and, in all your infinite wisdom, you decided to reward him with a more expensive toy, thus depriving your daughter of a slightly more expensive hotel room? \n\nHoly cow, you suck. Also, why are you taking your daughter to hooker hotels for her bday? Any hotel that has a hotel with a pool for less than $100 is 100% suspect. \n\nYTA", "I’m calling troll. This can’t be real.", "Golden. This is just classic.\n\n(how tf do you break a gaming system? Unless you're like... trying to move it and accidentally drop it or you have a heavy jerk cat that can push it off of wherever it is. He got mad at a game and broke it, didn't he?)", "YTA. Massively. You're not even *trying* to hide your favoritism. I feel so sorry for your daughter.", "Do we even want to know how he broke it, or will this be a story about how he broke while he was angry but that's just what he is like?", "Its sad. The fact that her and her friends would most likely use it more.. Most 10 years olds I know want toys this year.", "You mean to teach her that your son is your favorite child and she shouldn’t complain about that? YTA and don’t be shocked if she don’t want any contact with you when she gets older.", "Yeah, you are definitely the asshole. It's not that life is unfair, but that you are. What a failure of a parent.\n\n&#x200B;\n\nYou clearly love her brother more by spending more than $500 on a new PS5 but are unwilling to spend a little more than $100 on her birthday.", "You suck as a mother your boyfriend should break up with you", "By your logic, she gets shit. Her brother gets a brand new PS4 she doesn't even get a cheap hotel for a birthday party.", "Life’s not fair when your mother has a favorite child.", "And when she disowns you later in life you will regret this", "Oh man, you’re going to learn that “life’s not fair” lesson here in the next few years when she gets to be an adult and cuts you out of her life. \n\nI mean Jesus, if this is how you treat her on her birthday I can’t imagine how you treat her on regular days. \n\nFor Christmas did you take a dump in a box and tell her to be grateful for what she gets while her brother unwrapped his video game console? \n\nYTA. Majorly.", "\"...she called me a jerk but I could care less....\"\n\nIt's \"couldn't care less\". Not could. You're clearly not educated enough to be teaching anyone about anything, but I'm pretty sure your daughter totally gets that you don't give af about her. I'll bet she didn't get a $500 gift for Christmas like your precious son, huh? \n\nYTA, a major one", "Life isn’t fair, but her parents should make an attempt to be. What’s your end goal in essentially bullying your own child? She’s not going to be “grateful,” she’s going to see that you aren’t a person who wants to celebrate her existence, so she’ll stop asking you to be around for the big moments in her life. And in 10 or 15 years, she’ll be grown and she won’t invite you to her wedding, or bring her kid around to see you, or want you at her Christmas dinner and you’ll wonder why she doesn’t think about you.", "You are an absolute trash mother", "so is your son grateful that just before her bday you got him a ps5???  yet your ticked off at your daughter.  double standards i see here.", "Grateful for what? She has legitimate complaints about that hotel, the slide cut her leg. You don't have to do the hotel she wants if you can't afford it, but at least put in some effort to make her happy. Her brother got what he wanted, she should get something that makes her happy too.", "Please do not bring more children into this world if you’re going to treat one like a king and one like street trash. This is clear favoritism and when your child has physically been hurt before at a hotel you shouldn’t want to go back there under any circumstances. I’m sorry you didn’t budget correctly for a birthday (which is THREE months away) but don’t wonder why your daughter won’t talk to you ever again.", "YTA. Just stop. You don't deserve your daughter.", "Life will teach her this lesson over and over. Family should really be a sanctuary from that. 13 is a big deal and you are really setting a poor precedent for the remaining teen years. You could redeem this really bad decision with some humility on your part because it's important for kids to know that parents miss the mark, are able to see the error of their ways and own their mistakes. That is probably a better life lesson but I don't think you see it that way. YTA.", "She doesn't need you to teach her that life isn't fair - life literally teaches us that all of the time. It is a parents' responsibility to provide stability, and to show each child that they love them both. Giving one child a $600 gift while snubbing the other one really makes it appear as though you have a favorite, whether that is your intention or not. While your son may use the PlayStation every day, the experience that you could have provided to your daughter would help create memories that last. As it is now, she will certainly remember how you made her feel. YTA.", "You are right. Life isn't fair. But the world is going to teach her that lesson, it gave her you for a mother, didn't it? \nThis is an opportunity for you to be better than the cold, cruel world and show your daughter that you love her. This is her 13th birthday, a big milestone for kids, and you want to taint it by going to a sub par hotel (that she has legit reasons for not liking). This is the one gift she is getting from you for her birthday and the additional friend won't increase costs (except maybe pizza, but you haven't said you are getting that for her, anyway). \nYou have demonstrated blatant favoritism in under 500 words here, you can bet that as she grows, she is going to notice, and her siblings may as well. This may not break your relationship with her, but it is going to be one more hurt piled amongst so many others. And she may distance herself as soon as she is old enough to do so.\nPlease, examine why you are treating her this way. And if this is a one off, still explore your reasons for not wanting to celebrate her birth. Is there something additional attached that you are blaming her for? Maybe talk it out and see if you can get past it? Because her requests are well within reason.\nYTA.", "But life is fair for her brother? Your bf is right, you’re a flaming asshole.", "It looks like she's getting nothing. And you're right, life isn't fair, but she shouldn't be learning that lesson from her mother.", "You’re right, the world is going to screw her over. No one better than mom to do it first. /s\n\nYTA", "Yeah, let the rest of the world teach her that. You’re supposed to be a safe haven from that. YTA. Like.. the worst. Then in a couple of years you’ll be writing about how your daughter alienated you & refuses to speak to you.. this will be the starting point for that & don’t ever forget it.", "She already knows. It's pretty clear how you treat her as compared to the golden child.", "And what are you teaching your son? That his mother loves him more, sons are worth more than daughters, and they he doesn’t have to take care of his possessions because he mommy will always upgrade for him.", "troll alert!", "YTA - LOLOLOL!!!! Are you really this dense? Don’t be surprised when she goes NC with you. You clearly have a favorite & it’s showing. There’s so many ways you could have made this better. You could have even taken her on a shopping spree just you and her with the cost of the motel. You could have gone a road trip for a day. Literally anything. You just cancelled the trip. I wonder what she’s getting for Christmas. Half a pack of gum?", "Life will teach her that lesson, believe me you will not have to.", "omfg you are just freaking terrible.", "Actually, all you’re teaching her is that once again her brother matters more and mom doesn’t give a shit", "Wtf! It’s her birthday and you can’t even treat her well on it? What you are saying is that you don’t value your daughter. What the hell do you mean life isn’t fair. I think your daughter already realize that when you wouldn’t compromise on the hotel, and now her friend, and than canceling. Your awful!", "Oh sheesh. You’re right. I missed the part about it being March. It does make it worse! 😩🤣", "This has to be fake", "Missed the point on that one .", "Check back in three years when you use her for full-time childcare. Also you didn't answer the question.", "You’re pathetic", "So what did you get her for her Christmas?", "Obviously having a penis is essential for the correct operation of the controller. /s", "Penis-5", "Lol I don’t even know. I was giving her the benefit of the doubt that maybe she lives somewhere where hotels are cheap in March. Sometimes you can find deals for $85-90 for an inn during a low travel season. But I agree with all of the comments that $100/night is a pretty good price. OP is acting like the daughter wants to stay at the Ritz.", "Oh absolutely. I had to read the post twice to wrap my head around what she said. At first I was like ok, she can't spring for $100, some people can't do that, that's fair, but there's also a way to talk about that and come to an enjoyable solution. But then the PS5 talk... nope. Nope nope nope. She's being so unfair to her daughter. I honestly wish I could get my daughter to befriend her daughter so they could have a fun party together or something.", "I need to learn to do that", "Beautiful answer, chef's kiss", "The worst.", "Where is the little head banging against the wall emoji?", ">hopefully she dumps your ass in a retirement home\n\nThat's way more than OP deserves. I hope daughter just goes NC and OP can figure out what is going to happen to her in her old age by herself. I'm sure we all know what the \"lessons\" she is giving her son about how being irresponsable just gets your bigger and better things are going to lead to.", "I was the child who's mom did shit like this. She is currently fighting to spend any time with me at all. Trust me, even if you fix this this has already solidified in her mind as a really shit memory of you.\n\n\n-\nMeant to reply to OP's comment", "oh  i have few words that i would like to say  but alas reddit will ban me if say them"]}