{"id": 55, "submission_id": "yih1z7", "title": "AITA for not helping my sister with her medical bills?", "selftext": " \n\nMy (31F) sister (27F) and her husband (26M) just welcomed their first child. It was a really hard and complicated birth, my sister had a c-section and there was a very real moment where we were all worried we’d lose her. Thankfully she’s okay, and it’s been a few months since. \n\nLast week, she sent a text to the family group chat asking for a loan because she and hubby are having a lot of trouble with medical bills. My parents gave her some help, but I told her I couldn’t. I’m a social worker with medical needs of my own, so I don’t have a ton of spare cash.\n\nBut for the past six years, I’ve been diligently saving up for grad school. I don’t have much, about 12k, but it’s something. And I made the mistake of mentioning this fund to my mother when we were casually talking about my long term plans. And I made the bigger mistake of mentioning that I wasn’t even 100% on grad school, which is the truth. I love what I do, but I’ve always wanted to be a librarian. \n\nFor the sake of brevity, I’ll just say that there was a lot of accusations and meanness thrown around. My mother called me selfish for not helping my sister, and she said I should give up at least some of my school fund to help since I “can’t even make up my mind.” I kept my cool but was still pretty upset, and I pointed out that they’d never be able to pay me back (sis is a nurse and bil is a teacher) and I didn’t want to wait until I was 40 (or take out big loans) to be able to work towards my dream job. \n\nThings have been pretty chilly between my mom and I. She says that she won’t tell my sister, but I don’t know how long she’ll stay that way. I feel a bit guilty because I know I could help my sister, but the thought of setting myself back this much makes me feel really scared. I'm disabled, so I already got my life started later than a lot of people my age. \n\nBut: AITA? Should I get over it and just help my sister? ", "created_utc": 1667234225, "permalink": "/r/AmItheAsshole/comments/yih1z7/aita_for_not_helping_my_sister_with_her_medical/", "score": 280, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I didn't help my sister out with her medical bills even though I have money saved up for grad school, might be TA because I could've made her life a lot easier.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Do not do this. Your mom is so wrong for putting your sister's medical debt on you. This is really messed up. 12k is not a huge sum of money and it is literally your personal investment in your future.\n\nBasically you need to put your family on an information diet in the future with regards to your finances because they clearly do not have your best interests at heart.\n\nLet your mom be frosty. Don't throw your life away to please her. It sounds like you may be the scapegoat of the family and your sister the golden child anyhow. Nothing you ever do will be enough.\n\nNTA", "NTA.  Everyone sounds like they’ve had a rough go, but your sister is not your obligation.  Just like on a plane, you put your oxygen mask on before helping out others.  I’m sure if money wasn’t an issue you’d help, but until then, you have to support yourself first.", "NTA.  Your sister and BIL can work out payment plans with the medical providers.", "**NTA** \n\nIt's your hard earned money and what you decide to do with it is YOUR business.  Just you are not 100% decided on grad school, doesn't mean that you won't be in one week, month or year.  We all change our minds!  And are free to do so!! \n\nAlso - your physical abilities do not define you!  Do what you want/love to do!!  \n\nUnfortunately, your sister and bil got dealt a bad hand and they will have to figure out how to pay for the medical debt.  If other family members wish to donate or loan funds then that is on them.  But you are not obligate just because you saved some money to better yourself in the future.  (And by the way - shame on your mother for guilting you!!)\n\nTLDR - keep the money it's yours to do with as you please!! NTA", "Info: are you located in the US and was this c section at a public hospital? If yes, she can call the hospital or number on the back if the medical bill and apply for charity care. It’s a progran that reduces medical debt based on income.", "NTA\n\nIt's unfortunately that your sister and BIL are in this financial position, but it's not of your doing. You have your own medical issues and have worked very hard to save this money for yourself. You're under no obligation to help them out and shame on your mother for guilting you about it.", "NTA\n\nIt's your money. You worked hard for it. \n\nYou can choose how you want to use that money.", "Don't set yourself on fire to keep someone else warm. It sucks that your sister is in that position. But you can't be expected to derail your own life because of it.\n\nNTA", "NTA\n\nMost people owe something for medical stuff in the US. They’re borrowing money to pay other money they owe. So they still owe. So let them owe the medical bills.", "NTA, if you do give money, be prepared never to see it back. Loaning money to family is a bad idea, because repayment is not a priority. It's not like you can send debt collectors after them. Whatever you choose to do with the money, even if it's a vacation, it's yours. You worked hard for it. You've sacrificed things to save up. It's not free money for someone else to use.", "NTA that’s 12k for your future, not for you to just throw away on someone else’s bills and never get back.", "That is your money that you saved. People need to realize that shit can happen and they need to have a savings to cover for it. Your sister did not and it sucks. She is free to ask people to help but no one owes her anything. Your mom is the AH for trying to pressure you to help. If your mom really wanted to do more she could but volunteering your money is not ok.\n\nNTA", "NTA. \n\nYour sister and BIL made a series of choices that landed them here. They could have waited and saved up until they were more financially prepared to have a kid - but they didn’t. They are not entitled to your money just because you have some right now and they don’t. Everyone knows that children are very expensive bundles of joy. \n\nThere’s also plenty of options for paying hospital bills, including payment plans, and they are two gainfully employed adults - they can make it work.", "NTA. Your sister made the decision to have a baby, and all pregnancies comes with risks. It's not on you to postpone your life plans for her sake.", "NTA and as much as you love your sister, it’s not right to expect you to give up money you’ve managed to save. If something was to happen to you, you would need it and from the sounds of your family no one would be able to help you.  Your mother can always get a line of credit on her house (if she has one)to help your sister", "NTA. This is not your problem to solve. I feel for your sister and BIL and what they have been through is awful, but you have to focus on your future. Your Mum is in the wrong.", "NTA.  They have options, getting a loan from family is just the easiest and fastest.  Not helping your sister isn't going to ruin her, they are adults and will figure it out.  Your savings are your savings.  But I would say keep your finances private even from family so you don't run into this again.", "NTA. It is your money to do with as you wish. Sister should have planned and saved better before planning to have a child. Those expenses are on her and her partner, not other family members.", "Nta\n\nIt sucks that they are struggling, but it’s not your obligation to pay their bills. Especially since they’re now acting as if they’re entitled to it", "NTA. It’s your money, period. Totally inappropriate of your mom to try to guilt you into giving your sister money.", "They can work out a payment plan with the hospital and if they do it quickly they will really get help. Also medical debt is not looked on as poorly on credit reports these days. Do not give them your money that is for your future where there are options in place for them. NTA. Your mom is TA.", "NTA\n\nYour sister and her husband already owe this money as debts to the medical providers.  So it doesn't offer them any benefit to borrow from family... Unless they aren't going to repay the money they borrow from family members.  \n\nInstead of borrowing from family, your sister and her husband should contact the providers and work out payment plans.  \n\nAnd, no, you absolutely shouldn't give your life savings to your sister.", "NTA. Don’t lend family money. You will likely never get paid back and then what? If there is going to be tension and ill feelings, then keep your money and follow your dreams.", "Your future is as important as anyone else's needs. NTA. Your mother is wrong to bully you. And if she feels so strongly about it, she can get a part time job to help her other daughter out more, if she likes. No matter what she thinks of your decision - its your saving - not someone else's emergency relief fund. There is nothing to feel guilty about. You didn't rob a bank or win the lottery. Its not found money. You earned and put it aside for your own needs. That's reasonable.\n\n I bet you never again discuss your personal finances with people who don't live in your home, though? That's fine. We've all had to learn that lesson. Hugs. I'm sorry this is happening to you.", "NTA.  Those are your sister's bills, not yours.  \n\nYou've been working very hard to save $$ towards your dreams.  That money is not easily replaceable.  In the US, your sister can approach the hospital about a payment plan (in the US).  \n\nPersonally, I don't think you should tell anyone anything... nor should you lend your money.  Your mother can come up with the extra money if she really wants to do so. Why is this your problem?\n\nJust because you *can* do a thing does not mean you *should* do that thing.", "Stop thinking you need an excuse to hold onto your own money! \n\nNTA!", "NTA. What is up with this. Since when did it become siblings jobs to hand over their money to each other? You are not obligated to take care of your family like that. They're 2 incomes they can pay their own bills.", "NTA. Don’t do it.", "Im just trying to wrap my head around the fact that a nurse and a teacher don't have health insurance that would cover these bills.  Isn't that standard in benefit packages?", "If your sister is struggling with the medical bills due to income, hospitals will help. Also, she doesn't need a loan. She can make payments. She should call the hospital and make a payment plan with them. I've always found that if I kept regularly paying down medical bills, the billing department wouldn't bother me looking for money. NTA, keep your money and never talk about it again to anyone.", "Nta, 12k is not a lot of money and that's all your savings. You need that money if not for school then you need it as an emergency fund. Like you said they may not even be able to pay you back or if they do will' take years.", "NTA \n\nAnd I hope you've learned your lesson about over sharing info.", "NTA,  Do not give them a penny!", "NTA You have no obligation to pay your sister's medical bills. It's awesome that you have a savings account, but it's YOUR savings account---not the family's safety net.\n\nYour sister should talk to the hospital and each person sending a bill. If you're in the US, she may qualify for financial assistance/reduced bills, which the hospital should have information on. Additionally, many providers have no-interest payment plans. She should call each provider and ask for the lowest possible monthly payment. We had one medical bill $10 a month on for like nine years. It was annoying, but we made it through. As long as you're making some effort to pay monthly, they generally won't send you to collections.", "Save that money.. Pssst You have to go to grad school to be a librarian. NTA", "NTA Their bills are not your bills. They wanted a baby. They need to pay the bills.\n\nGo after your dream.", "NTA,\n\n\nBut definitely dig up some dirt on your mom because then you can use it against her so she doesn't tell ur sister XD I'm joking but honestly be careful I hope your mom doesn't make things worse or if she tries that your sister is reasonable and doesn't blow up/feel entitled to your money.", "NTA.\n\n>...I pointed out that they’d never be able to pay me back (sis is a nurse and bil is a teacher)...\n\nThis sentence makes no sense. Your sister is in a high paying field, and although teaching isn't exactly a path to riches it's typically an ok income with decent benefits. If they need a *social worker* to bail them out, they're so bad with finances that you shouldn't expect them to be able to pay you back.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n \n\nMy (31F) sister (27F) and her husband (26M) just welcomed their first child. It was a really hard and complicated birth, my sister had a c-section and there was a very real moment where we were all worried we’d lose her. Thankfully she’s okay, and it’s been a few months since. \n\nLast week, she sent a text to the family group chat asking for a loan because she and hubby are having a lot of trouble with medical bills. My parents gave her some help, but I told her I couldn’t. I’m a social worker with medical needs of my own, so I don’t have a ton of spare cash.\n\nBut for the past six years, I’ve been diligently saving up for grad school. I don’t have much, about 12k, but it’s something. And I made the mistake of mentioning this fund to my mother when we were casually talking about my long term plans. And I made the bigger mistake of mentioning that I wasn’t even 100% on grad school, which is the truth. I love what I do, but I’ve always wanted to be a librarian. \n\nFor the sake of brevity, I’ll just say that there was a lot of accusations and meanness thrown around. My mother called me selfish for not helping my sister, and she said I should give up at least some of my school fund to help since I “can’t even make up my mind.” I kept my cool but was still pretty upset, and I pointed out that they’d never be able to pay me back (sis is a nurse and bil is a teacher) and I didn’t want to wait until I was 40 (or take out big loans) to be able to work towards my dream job. \n\nThings have been pretty chilly between my mom and I. She says that she won’t tell my sister, but I don’t know how long she’ll stay that way. I feel a bit guilty because I know I could help my sister, but the thought of setting myself back this much makes me feel really scared. I'm disabled, so I already got my life started later than a lot of people my age. \n\nBut: AITA? Should I get over it and just help my sister? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You are not responsible for your sister’s choices. And you need a Masters to be a librarian anyway, so yeah, you do need that grad school money (and even if you don’t become a librarian, you’ll need that money for something).", "NTA.  I see so many AITA posts with people asking if they are if they don't give their money to other people.  And for the most part the answer is always NTA.  This is your hard earned money that you have earmarked for your own wants and needs and there is absolutely nothing wrong with that.  They made the choice to have a child.  I understand they didn't make the choice to have complications, but unfortunately that's just how things work out sometimes.  You have no obligation to give/loan other people your money.  Also, last I knew hospitals will set up payment plans for outstanding medical bills.  Anyone trying to collect money is generally satisfied as long as they are getting something on a regular basis.", "NTA.", "NTA  You are all adults and none of you are required to help anyone else, especially when it can't be repaid and you need that for yourself.", "NTA would they help you if you needed the money, don't be guilt tripped into making bad financial decisions", "Nta. Having a baby is expensive. They knew that going in, they could've been saving money too. Also, most hospitals will set you up on a payment plan. So they'll be fine.", "Why oh why do people do this? You know someone asking people to loan them money. This money will end up as an unpaid loan. They almost never pay it back in full and in a timely manner. You say no for whatever reason. I don't care why. It is your money to do with as you please. And then you blab to someone about a stash of cash you have. This never ends well. So people, keep your finances private. Your mother, father, in-laws, siblings, friends, co-workers, etc don't need to know what you have saved up. All this brings to you is grief and personal attacks.", "NTA.  Having a child, especially now days is an expensive proposition.  You are not responsible for their decisions.  If you can't help (for whatever reason) you can't help.  NO is a complete sentence.  After they don't pay your mom back and they keep asking for more, don't say \"I told you so\".", "NTA You don't know if you need the money yourself. And Your sister and BIL can work out a payment plan with the hospital. They aren't the first and not the last who have problems with their bills. They can't expect that everyone in their family gives up their savings and with this their future wishes.", "NTA. Nobody is entitled to what you have. Give if you want/can afford to but you shouldn't be shamed /guilted into it.", "NTA. Family is great. But your future is too.", "NTA- it’s your money to save, spend how you see fit. Having savings is a good thing. People don’t get to decide how you spent it.\n\nIf sister can’t pay you back it becomes a gift.", "NTA. It took you a long time and a lot of effort to save that money for your own goals and aspirations. You may not have fully decided how you want to use it but it's yours. Something could happen in your own life that could create an immediate necessity for you to use YOUR money for. If you were to give that money to your sister she will never be able to (she will always have a great reason) and then you'll be stuck in a financial predicament not of your own making. Don't give them your money. You need it you just haven't decided how you want to use it yet. I wish you the best in your future endeavors whatever they may be.", "NTA. You *can’t* afford to help them. That 12k is not spare “fun money.” It’s specifically being saved for you to use on your education or something else for your future if you decide to go a different route.  It is spoken for. Not available. Final answer. Think of it as no different than if they asked for your rent money. Do you have it? Yes. Is it an option to give it to them? Nope. \n\nIt’s very unfortunate that your sister is struggling with this debt, our medical system is a train wreck, but this is not an emergency and it’s not right for your mom to act like you have any obligation to fix it for them.", "NTA - I just had twins three months ago and almost died twice during childbirth. With that I have gained a massive amount of medical debt, she needs to apply for financial help from the hospital or medical forgiveness programs (they exist!!) I am about to have a huge sum fully covered by the hospital itself. I would like to add I was fully prepared to pay for this myself as I knew medical expenses would be occurred but the hospital is the one who had me apply to see what they would cover, your sister should have prepared herself as well!", "NTA\n\nYour money is not community money, for the third time today : YOU ARE NOT A ATM. That's some manipulative guilt trip your mother has laid on there. Even if she does tell your sister, you can still say no. \n\nDoes it suck for your sister and BIL? Yes. Is it your responsibility? No. Just because your not certain on your plans now, doesn't mean in 6ms time you won't be and your funds won't be there and if you ultimately decided not to, that money could help with your own health and future. You've saved for years for this. Like you said it wouldn't be a loan, as you'd not get the money back.", "They need to go to the financial office at hospital and ask for help and a payment plan.  Many hospitals will review their income and will write off a % and then take payments for the rest.", "NTA\n\nYou didn't force them to have a baby. It's said she's having medical difficulties, but that's not your financial responsibility. People always think they're entitled to other people's money. I don't get it.", "Nta-", "NTA. Medical bills are part of the decision to have a child (in America). It's not your responsibility to pay for bills they signed up for. Even if you helped them now, what happens the next time they have a big expense? You have to help pay for that one too? Do they have to give you whatever savings they have if you ever ask for it? (that answer will be no)", "NTA. Her bills, her responsibility. It doesn’t matter if her bills were from the child she chose to have or from cancer or anything else. It’s not your job to pay the medical bills of a grown ass adult that’s not your spouse or your own child. Your money is what you earned and is for you.\n\nNEVER tell family how much you make or how much you have saved. EVER.", "NTA And this is why dear readers, never ever tell anyone you have savings, because family will suck you dry because they say your dreams do not trump their dream holiday, their desire for braces, a boob, job, a new car, paying off their student loans, a down payment on a house or IVF. YOU are saving for your dreams. There is nothing to stop them paying the medical bills in instalments.", "NTA...and I hate your mom for making you feel guilty", "NTA.", "NTA\nDon't do it. Your mom is an arse hole. Never discuss money with her again. Do librarians make more than social workers?", "NTA. But I would absolutely put that money into an account with some severe penalties for early withdrawal. You can choose the term length- 3 months, 6 months,  18 months, longer - whatever you choose (I used to do this and just roll it over every 3-12 months until I knew I was going to need it). They generally earn better interest rates too. Then if anyone asks you can just tell them you don't have any money as it's tied up. \n\nThe entitlement your mom feels to your money is appalling!", "NTA honestly 12k is not a lot and you should at least have that as an emergency fund. But look into library sciences for grad school!", "NTA- AS THE SAYING GOES. DO NOT SET YOURSELF ON FIRE TO KEEP SOMEONE ELSE WARM!", "NTA what is it with people trying to spend money that doesn't belong to them?? If you wanted an easy \"out\", I'd suggest investing it or putting it in a CD or something -talk to a banker or a financial advisor!- that you cannot touch for X amount of time. It can be short term, like 6 months, and you should be able to do it again. At least until your sister and her husband figure it out on their own.\n\nAnd I know it's hard, but never let anyone know how much money you have. No one, but me and my husband, knows how much we have saved and/or invested nor do they need to know.", "NTA - don't let them convince you otherwise", "NTA. If you are in the US she can call the hospital and make a payment plan. Heck if she pays $10 a month they can’t go after her. If you aren’t in the US then sorry, I’m no help.", "It's your money. Don't put your dream aside because your sister and her husband didn't make other arrangements. I'm a librarian. If you have any questions about grad schools or the field, feel free to send me a DM!", "NTA", "No. Go to school.", "What level of nurse? Where I’m from they make about 2x as much as a bachelors level SW. NTA, your money, your future, your decision and you can always use the money for a degree in library sciences", "Must be in USA. Will your $12000 be enough to really take the financial pressure or will your sister still need to go bankrupt to have medical care.", "Thank you. I've often considered this, especially after hearing from people with similar experiences. I've been disabled since I was 16, and somehow this made me the \"difficult child.\" It's hard to know that your mother has a favorite child and it's not you.", "You’re not obligated to help anyone financially. That’s it. End of story. NTA.\n\nBut your mom sure is. Why does she think your sister is entitled to your saved money? If she wants to help your sister so badly tell her to do more. She shouldn’t be bothering you.", "This", "Exactly. A lot of people don’t realize that they can call the hospital billing department and often get 1) the total bill reduced and 2) a payment plan.", "Honestly, the real AH here is the medical provider.\n\nEdit: Maybe this was not clear enough but this is about how someone goes into medical debt for treatment they needed to not die. The way this system works is the AH. Medical care should be free", "... and the chose to have a baby, unlike your disability....", "Thank you, you're very sweet!", "NTA & 100% this right here. If they're in the US & having challenges paying their medical debt most hospitals have charity care programs.", "Thank you, that's what I thought too.", "Agreed. The sister and her spouse should figure it out. They chose to have a child. They had the chance to save for unexpected expenses, find better health insurance, etc. Now they have debt… but that comes with having kids sometimes. They can negotiate payment plans or settlements with healthcare providers.", "Lol, I definitely know some things that would horrify her church friends.", "Its easy to spend other people's money, isn't it? 😂", "She's a LPN, so I believe she makes less money than other nurses? But yes that's what I thought too, they have a mortgage and a baby now. I think they were irresponsible but that's a whole other argument if I tell anyone.", "Super hard. But it's absolutely not your fault and there is nothing you will ever do that will change that dynamic. So in the absence of your mom having your back, it's so important that you have your own back!", "Your mom is an entitled jerk for demanding this of you. You’re not responsible for helping your sister and the fact that she would even behave this way is very telling.", "NTA also wtf kinda RN is your sister? If you're in the states core staff can pick up extra time and make double pay and traveling nurses (this can mean driving 60 miles away only) can make between 2K-6K a week. \n\nAbsolutely don't give up or postpone your dream to pay for their medical debt\n\nHospitals in the US have charity funds for those who need help with bills that they never tell patients about, use your awesome soon to be librarian skills and do some research about options \n\nDon't pay thier bills, don't give up your dream", "also they wouldn't be the first couple to end up with a 'medical bankruptcy' which isn't the kiss of death it's sometimes seen as, and the 12K wouldn't even truly dent the kind of money an extended stay in NICU costs. \n\nBut yes, hospitals are well aware that people are not often able to pay off large medical debts, and will typically help in order to get what they can once insurance says \"nope\"", "I was going to write this. Also, many hospitals have resources they can refer them to to help pay.", "I beg to differ.  The medical provider(s) gave a needed service.  They don't do it for free.  Based on the little information I've read, we don't know what was or may have been covered by insurance, or public assistance.", "It’s worth calling even if you won’t qualify for a program like that. Most hospitals will offer a payment plan. They will also sometimes be willing to accept less than the full amount if you can pay a large part of it immediately.", "As long as they pay something each month to the hospital, the hospital will leave them be.", "Seems like a plan 👀😂", "I'm not saying you should use it as a threat, but if she keeps putting pressure on you,  hey ho...", "Typically people in the medical field get great health insurance benefits. I'm sorry your family is in this position, your NTA though. It's your money.", "Medical care should be free???", "I never said that.  YOU said it should be free.", "I’m not sure everaongweeds is saying that the medical provider should work for free. I think they are saying there should be a system that provides needed medical care for free."]}