{"id": 5520, "submission_id": "zu9skp", "title": "AITA for not going to my mom’s house for Christmas and refusing to make my little sister go too?", "selftext": "I’m 17 and my little sister is 15. Our dad died about 10 years ago. It was sudden and devastating. One day he kissed and hugged me and sis and told us he loved us and then we never heard from him again. At the time I couldn’t fully grasped why he chose to stay away even though mom tried to explain it to us. I missed him and thought I did something wrong to make dad mad. I repeatedly called his phone hoping he would answer but it always went directly to his voicemail.\n\nAt his funeral, I realized I would never see him again and I broke down. I don’t remember much from that day except Uncle David held me the entire time. He held me throughout the funeral, during the drive home, and as I fell asleep that night. Uncle Alan did the same thing with sis.\n\nIt wasn’t easy growing up with just my mom and sis but not as tough as it could have been because the two uncles were always a phone call away. Whenever we needed help with school, one of the uncles was there to tutor us. One of them was always in the front row of every school performance and game. Whenever I wake up in the middle of the night and miss dad, I’ll call Uncle David and know he’ll always pick up.\n\nMy mom eventually remarried to Bob. I never liked Bob because he always have to be in control and placed us on a strict schedule. Dinner was at 7 everyday no matter what. If we came home late and dinner was over, we weren’t allowed to eat that night. Whenever our uncles gave me and sis money, we had to give it to Bob and he divided the money equally.\n\nA couple of months ago, sis and I were eating with Uncle David and his family. Our dinner conversation eventually led to where I want to go for college and how to pay for it. Uncle David told me that the uncles decided long ago they were going to pay for me and sis’s tuition and cost of living on campus. I cried when I heard that and laughed when he jokingly said he hope I don’t get into medical school because that’s going to cost him a fortune.\n\nI went home and excitedly told mom and Bob that the uncles are going to pay for our colleges. Instead of being happy, they both looked furious and Bob started screaming about how unfair it was to our step siblings and half sister that we’re getting a free ride through college. He wanted me to tell our uncles to divided the college funds equally among the kids but I refused. The next day he kept on screaming at us so sis and I packed our bags to go to Uncle David’s house. He kept on screaming and even followed us out to my car.\n\nSis and I have been living Uncle David and his family ever since. This feels more like home that it ever did at our house. Mom has been asking us to come home for Christmas for a month now and I’ve been refusing. Today is the 24th and she’s been calling all morning crying and saying how we need to spend Christmas with family.\n\nAm I wrong for not spending Christmas with mom?", "created_utc": 1671888340, "permalink": "/r/AmItheAsshole/comments/zu9skp/aita_for_not_going_to_my_moms_house_for_christmas/", "score": 20140, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. My sister and I are refusing to go to mom’s for Christmas \n2. She said I’m suppose to spend Christmas with family\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You poor thing. NTA\n\nIf your parents pursue any legal action to compel you to come home, request a GAL, guardian ad litem. They will represent your interests, not your parents or any one else’s.", "NTA - Bob's kids are not entitled to what your Uncles have. They arent blood relatives. Im going to assume your Uncles are the brother's of your father? You did the right thing. You and your sister were subjected to a guy that really doesnt give  a shit about you and is more interested in giving what you have to his kids. Your mother let it happen. Stay at your uncles. They've been there for you all your lives, and its clear they love you guys so much. Your mother sounds like when she married Bob, she chose her new family over the one she already had, and the two kids that had lost their dad.\n\nIm sorry for your loss. I hope  things work out for you and your sister, and you succeed in life. Im sure your dad is very proud of you, where ever he may be.", "NTA. Denying you food simply because you missed the dinner bell is abusive. Getting upset over you getting a full ride to college is not great, either. \n\nSometimes, we have to work a little harder to find people who truly love us. I'm glad your uncles are there for you.", "NTA and heck them! How could your mother be okay with Bobs behaviour all those years?! He is way out of line and I'm glad to hear that you managed to live with your Uncle.\nYour Mom and Bob need to respect some very much needed boundaries or NC would be a good alternative.", "Your uncles sound like absolute stars, I'm happy for you & your sister that you have both of them in your life. Bob, however, different kettle of fish. All the money your uncles have given you over the years, was that just shared between you & your sister or all or the steps as well? If the latter, Bob has been stealing from you both all this time. NTA in the slightest.", "NTA \n\nYour mom chose a controlling and verbally abusive man over her own kids. I hate when women are so desperate for a man that they choose a horrible man just to say they have one. You’re 17 you’re almost an adult but your sister need her guardianship switched over to the uncle so Bob and mom won’t cause trouble for your uncle.", "NTA. Bob sure sounds like one. You two will have a happier Christmas with your Uncle.", "NTA.  Christmas is, IMHO, about family, however one defines it.  Bob is not family.  He is the dictator to whom your mother surrendered.  Since your mother will not defend you and would not do so for years, and since your uncles have always done so, you are in the best position to decide where and who your truest family is.  I’m sorry for the loss of your father and for the disappearance of your mother, but glad the uncles were there for you.  You know now with utter clarity that Bob will always bully you to give up what you get from your family in favor of his offspring.  Please don’t share any news or financial details with Bob or his wife.", "NTA. If your mom chooses Bob’s happiness over her daughters, she doesn’t deserve to see you.", "So sorry for your loss.\nClearly NTA. Don't go and enjoy your Christmas with your real family (i.e. your uncles and their families). As you said, family is where you feel at home, and your mom and Bob clearly don't make you feel that. Merry Christmas to you, your sis, and your true family! 🎄", "NTA, if your mother and Bob still has custody of you and tour Sister start researching how to give your uncle custody.\nBob may decided to say you two got kidnapped and get uncle arrested. I know it's unlikely but please make surw your uncle can't be accused. \nHope you get into the college you will choose and have a great college life, hope your sister gonna be ok too.", "NTA for all the reasons others have said.  Also, is mom not welcome at Uncle Dave's for dinner?  Why do you and sis have to go there in order for her to see you?", "NTA. I'm so sorry about your dad. You're right where you need to be... At home with your uncles. You don't need to go back someplace that caused you so much pain and suffering. And Bob sounds horrific. I wouldn't go either. Christmas is about love and joy. Neither of which they provide.", "NTA. Bob is abusive.", "The only middle ground could be to ask Uncle David whether your mom (and just your mom) could come over for Christmas dinner? Or a cup of tea or something.\n\nMake it clear you want nothing to do with Bob. And that she has betrayed you by choosing him over you guys.", "NTA… Bob is abusive and your mom just let it happen.  Be where you feel safe.", "NTA but Bob sure is", "NTA.  Stand your ground.", "I hope David has a wonderful Christmas make sure to visit/wish Alan one too. Your mom and bob is definitely the asshole", "Awwww hugs to you and Nta at all. Mom and bob are ta.", "NTA.  Maybe invite mom, only, to something at uncle's place; but certainly, don't go to hers. Her husband has issues.", "Repeating what everyone is saying,  but.... \nYou're nta, and Bob is most definitely the abusive controlling ah. \nYay for uncles are awesome!", "NTA. \"Mom, you allowed Bob to mistreat us for years and never stood up for us, so we no longer feel safe with you. That means we won't be coming there for Christmas or any other time.\"", "NTA and might want to consider going NC / LC, Bob sounds unhinged.", "NTA , BoB is a real Psyko and your mother, sorry to say this, is not better to let him do this to her own kid. You should report all those abusive behaviour.", "\"Mom, I *am* spending christmas with family. Family that loves me and doesnt scream at me over money. Family that doesnt mistreat me. Family that  actually cares about me. You have Bob now, enjoy.\"\n\nNTA", "The only statement I needed to see was: \"This feels more like home.\" That's what counts. NTA.", "Are you the kids of the parents or uncle who posted about this about a month or so ago? Super interesting how this exact situation was posted but from a different player in the game.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m 17 and my little sister is 15. Our dad died about 10 years ago. It was sudden and devastating. One day he kissed and hugged me and sis and told us he loved us and then we never heard from him again. At the time I couldn’t fully grasped why he chose to stay away even though mom tried to explain it to us. I missed him and thought I did something wrong to make dad mad. I repeatedly called his phone hoping he would answer but it always went directly to his voicemail.\n\nAt his funeral, I realized I would never see him again and I broke down. I don’t remember much from that day except Uncle David held me the entire time. He held me throughout the funeral, during the drive home, and as I fell asleep that night. Uncle Alan did the same thing with sis.\n\nIt wasn’t easy growing up with just my mom and sis but not as tough as it could have been because the two uncles were always a phone call away. Whenever we needed help with school, one of the uncles was there to tutor us. One of them was always in the front row of every school performance and game. Whenever I wake up in the middle of the night and miss dad, I’ll call Uncle David and know he’ll always pick up.\n\nMy mom eventually remarried to Bob. I never liked Bob because he always have to be in control and placed us on a strict schedule. Dinner was at 7 everyday no matter what. If we came home late and dinner was over, we weren’t allowed to eat that night. Whenever our uncles gave me and sis money, we had to give it to Bob and he divided the money equally.\n\nA couple of months ago, sis and I were eating with Uncle David and his family. Our dinner conversation eventually led to where I want to go for college and how to pay for it. Uncle David told me that the uncles decided long ago they were going to pay for me and sis’s tuition and cost of living on campus. I cried when I heard that and laughed when he jokingly said he hope I don’t get into medical school because that’s going to cost him a fortune.\n\nI went home and excitedly told mom and Bob that the uncles are going to pay for our colleges. Instead of being happy, they both looked furious and Bob started screaming about how unfair it was to our step siblings and half sister that we’re getting a free ride through college. He wanted me to tell our uncles to divided the college funds equally among the kids but I refused. The next day he kept on screaming at us so sis and I packed our bags to go to Uncle David’s house. He kept on screaming and even followed us out to my car.\n\nSis and I have been living Uncle David and his family ever since. This feels more like home that it ever did at our house. Mom has been asking us to come home for Christmas for a month now and I’ve been refusing. Today is the 24th and she’s been calling all morning crying and saying how we need to spend Christmas with family.\n\nAm I wrong for not spending Christmas with mom?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nI hope you two have the best Christmas with your uncles.\n\nI have to ask, have you posted about your family before on another issue? This family dynamics sounds very familiar to one I saw on YouTube Reddit recap. For the life of me, I can’t find it.", "Nta.  You are spending Christmas with family. Your uncles and their families supported you in your loss, have always loved you and been there for you. They are your family. Your mom and steps are just relatives. Ignore them.  Enjoy Christmas with the people who care for you.", "Hey OP this sounds extremely close to [this](https://reddit.com/r/AmItheAsshole/comments/ys97jv/aita_telling_my_husband_im_not_going_to_tell_my/) post from a few months ago from your moms POV possibly?\n\nEditing to add NTA, if your mom wants to see you for Christmas it’s on her to come to you two (if that’s what you want).", "NTA\n\nBut i think your mum posted her perspective last month. Reddit ripped her apart btw", "[removed]", "You are spending Christmas with family.\n\nHappy Christmas!", "NTA", "NTA", "Nta", "NTA\n\nYou are spending Christmas with your family. \n\nYour step dad sounds like a real piece of sh...uh...work. Ya a reaaaaal piece of work 😉 \n\nGlad you left. Mom made her bed, now she gets to lie next to the piece of sh... work in a house without her daughters.", "I'm pretty sure your mom did an AITA when you moved out and it made it to BORU. Also, NTA.", "NTA. But i’m pretty sure I have read this story here before, from the mom or stepdad POV. And rightfully, everyone deemed them ta.", "Nta. Stick to your guns. Maybe it will open your moms eyes about her husbands disgusting and horrible behavior, but sadly I wouldn’t count on it. I’m so happy you have your uncles, they sound wonderful.", "Nta. Your mum has failed you and your sister. Thankfully your uncles have got your backs. Consider lc or nc with your mum if your uncles can make the living arrangements permanent", "NTA.\n\nBob is abusive and greedy. Your mother has failed to stand up for you and your sister. Thank God for your uncles. They’re your true family.\n\nDon’t let your mother use crying to manipulate you into giving in to her.  \n\nYou know that as soon as you and your sister set foot in that house, you’ll have Bob screaming at you and demanding your money, while your mother does nothing to stop him.\n\nIf you, your sister, your Uncle David and his family were all willing, you could invite your mother to visit you on Christmas instead of going to her, on the clear understanding that one word in defence of Bob or about money will see her thrown out.", "NTA. Only assholes are your mother and stepfather. I wouldn't want to go visit or even talk to her. She made her decision when she married and allowed that asshole to treat you like shit.", "NTA You are spending Christmas with your family, your real family, Uncle David.", "Uncle David and Uncle Alan are your family. Bob is a jealous controlling jerk and your mom just wants to appease him. Stay right where you are and spend Christmas with family. NTA", "NTA whatsoever.  Uncle David understood the assignment.", "You are spending the holidays with family. The family that loves and cherishes you. The family that cares about you. You are not required to accept family that places unreasonable demands upon you. You are not required to split everything evenly because that isn't how life works. This is the same as if you had gotten a full ride scholarship for college. Would Bob have demanded that you divide that, too? Have a good holiday with your uncle. NTA", "NTA. I'm so sorry about your dad. You're right where you need to be.", "NTA. Christmas is, IMHO, about family, however one defines it. Bob is not family.", "Bob is an AH but the mother is more so. Those are her children and she's letting this abusive man bully them.", "I'm sure Bob won't let mom go spend Christmas with her eldest daughters and their uncles even if she is invited.", "make bob stay home only the mom should be invited!", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "op=NTA\n\nokay, so you sorta hid the lede there. I thought that SD-Bob was dividing the money you and your sister got Individually equally between you, but suddenly you BROUGHT up stepsiblings-So I'm guess you actually meant that the money you and sister got were actually divided not by two but by a minimum of 5(step-siblings(2+) and half sibling(1)).  \n\nSo basically, your Stepfather has been stealing from you and your sister for several years.\n\nNeither your stepsiblings NOR your half siblings are related to your Paternal Uncles.  They owe them nothing.  And your \"parents\" should be grateful that your expenses will be covered so they do not have to provide for your education.  \n\nYour mother is allowing your Stepdad to abuse you to the point you have left the \"family\" home.  Therefore she is the A-H and there is NO reason you should be obligated to suffer continued abuse from Stepdad.\n\nPS:  The not giving you dinner if you got home past 7--that's straight out neglect/abuse in my estimation.", "Is this your mom? The details are very similar. \n\n https://www.reddit.com/r/AmItheAsshole/comments/ys97jv/aita_telling_my_husband_im_not_going_to_tell_my/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "Mom has sacrificed her two daughters to keep her new husband. \n\nYour situation clearly isn’t as bad as some have posted, but it’s bad enough to avoid. I’m glad you have such uncles. \n\nNTA", "NTA.  You are spending Christmas with family - just not her because she chose her abusive husband over you.\n\nFinancial discrepancies among blended families can stink, but it happens sometimes.  Your Uncles aren't going to support your Stepdad's kids.  They're not going to not help you because of that.  It's going to be rough on them seeing life-changing funds so close it feels like they can touch it, but it's exactly that - an illusion.", "NTA\n\n\n\"Bob, if I could trade all of that money for my father back, I would. At least your kids have their father.\"", "Ask Bob why his wife's dead ex husbands brothers should pay for his kids college?", "NTA. This situation sounds very similar to this post last month.   \n\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/ys97jv/aita\\_telling\\_my\\_husband\\_im\\_not\\_going\\_to\\_tell\\_my/", "NTA, screw Bob. Also tell your mom these are the consequences of marrying an asshole and never sticking up for you.", "NTA\n\nBut there is another post from the mothers side of a very similar story. I think someone else posted it.", "NTA, so very much NTA. \n\nYou are spending Christmas with your family. I wish you, your sis, Uncle David, Uncle Alan (and partners and kids, since you mention their families) a very peaceful and lovely time.", "NTA , your mom chose her family. She chose Bob and step kids. \n\nThe second he came in and started trying to control everything was when your mother should have put her foot down. She failed you both and I am so sorry for that.", "NTA At all. Your mom and sd are, but mostly your mom for allowing this.\n\nAnd was the Mom's side on here a couple months ago? This seems so familiar, but feom another persepctive.", "NTA. Is it me or have there been a lot of stories about splitting/giving away college funds on this sub?", "Nta - you are safe there and while your Mom may not be “safe” she is also and adult and has made her choice.", "Pretty sure I saw this story a while back from the perspective of one of the uncles.\n\nBut no, NTA.  Your parents just found out that out of all of their kids, they didn't have to pay for college for 2 of them.  They should be ecstatic.\n\nHonestly them forcing you to hand over money as a kid that you got from your uncles and \"split it equally\" was assholeish too.  They gave YOU money.  Not anyone else.  And I imagine that if you'd told your uncles this was happening they would have had some words for Bob.", "NTA Spend Christmas at your uncle’s house. Going to your moms house would only be a day of misery with her & Bob berating you and demanding you tell your uncles to split the money.", "NTA. You stay where you feel safe and loved. Your mom has not protected you, so she gave up the privilege if having you for holidays. I'm glad you and your sister have a safe place to land and I'm sorry for the loss of your dad.", "NTA.  I am so sorry.  I hope at some point your mom will wake up and stop passively allowing her husband to abuse you.  That home is not safe for you and your sister.  You aren't responsible for caretaking your mom.  You've had to take a lot on your shoulders. It's time to let your Uncle David take care of you and your sister.  It sounds like he knows whats going on.  Would it help to talk to him about it so he can support you?\n\nIts okay to love your mom and worry about her, that's pretty natural. But you're not responsible for making her happy when she's endangering you and your sister.  It is also okay to end a conversation if it gets pushy. Your mom has made a lot of choices in her life that are causing her pain and it is totally totally not your fault and it's something she is going to have to work through and choose to change herself.", "NTA... her job was to protect you and look after your interests.  She hasn't", "NTA \n\nYou are with family. \n\nYour mom has been failing you for years by allowing her husband to abuse you and this is the consequence of her choices.", "You are spending Xmas with family- your uncle.", "[removed]", "NTA. That’s your money and your uncles have no tie to Bob’s kids. Your mother lets this happen and that’s wrong.", "You are spending Christmas with family. You're spending it with people who love you and care about you. Bob never apologized for screaming at you and demanding the college money, did he? If you go there he'll scream at you all over again. They want you to go there so they can harass you about the money. Look after your sister. She's younger and they can get to her more easily. Document any voice-mail or texts Bob and your mom send you. You may need this in case they fight for custody. NTA", "NTA - tell her she can come to you.  Then you can all talk about how abusive Bob is.", "NTA.\n\nBob is a word I don't feel is proper to use in front of a minor, and your Mom is complacent in his abuses. You owe neither of them anything. I'd tell your Mom that if she files for divorce after the holiday, you'll come to Christmas next year. Otherwise, she can stop contacting you", "I want to say a lot of horrible thing to your a h mother. But I will just say: life will make her suffer and I hope you enjoy it.\nNTA..", "NTA at all", "NTA you are spending Christmas with family the ones who have been there for you who want to see you flourish x", "NTA", "NTA. You are spending Christmas with family, you're just choosing not to spend it with your abuser, the man she's repeatedly chosen over you. \n\nBob doesn't treat you like family, and your mother is fine with that. \n\nTell her you're spending Christmas with the people who've always been there, who've always treated you like family, who've been closest thing to parents you've known for years.", "NTA - your uncles don't owe Bob's kids anything. He can throw a fit all he wants, but that doesn't change anything. Stay with your uncles and enjoy the holiday with them. I wouldn't go home until mom gets Bob under control.", "NTA- Don't go if that is not where you are comfortable. Enjoy your Christmas some place that makes you happy and with family that cherishes you and your sister.  Your mom and stepfather are AH. They should be happy and excited at the prospect of you and your sister staying debt free and receiving an education. Good luck and have a Merry Christmas!", "NTA- tbh you might want to talk to your uncles about getting guardianship over you. What your step-father is doing is abuse and I have a feeling a judge would easily give your uncles custody for your own safety. It depends largely on where you're from but please look into your options, for you and your sister OP", "NTA. I hope that you and your sister are allowed to continue to flourish under your uncle's care. I wish you, your sister and uncles much love and happiness. I wish for your mother and her husband to...step on Legos.", "Nope.  NTA.  Bob drew a line in the sand pretty clearly, so until she stands up and defends you, you don't need to go back there.  If she wants to spend time with you, she can do it on your terms.", "NTA. Why would you want to spend Christmas with someone who screams at you and doesn't share your joys, like not having to worry about paying for college? You're making a good choice, and mom should have more understanding of the position you are in with your stepdad.", "NTA, you are spending Christmas with family. Your mom and Bob can go whistle.", "NTA and she couldn't be bothered to advocate for you before what makes her think you want to sit there and be policed and screamed demands at Christmas by a man who has never treated you guys kindly? Stick with your actual family with your uncle's. She made her choice so she can stick with it.", "NTA. Your mother has allowed your stepfather to mentally and financially abuse you for too long. Good for you for getting out. I hope you enjoy Christmas at your Uncle's house. And if your mother won't stop calling, block her until after Christmas.", "NTA. don't go, what you are describing with them refusing to feed you is you being a minor in an unsafe situation. \n\nStop taking your mother's calls at all, if she wants to contact you it needs to be through your guardian, your uncle, and if she tries to legally compel you and your sister to go back to her house with Bob you need to bring up the fact that they have refused to feed you before.", "NTA and I am so deeply sorry for your loss. You are so mature and resilient, I do not doubt you will be successful with whatever you choose to study. Bob sucks. Your mom sucks for having his back over yours. Your uncles are amazing.", "NTA. I’m glad you & your sister had somewhere safe & loving to go to. ❤️", "NTA!!!", "I'm reading the whole thing trying to see if maybe Bob is just a strict parent and maybe you guys were just not used to it. But when he said you need to divide your tuition money with your half siblings...nope. absolutely not. I don't know the role your mom plays in this whole dynamic, if she's just weak and unable to stand up to Bob and she wants to spend the holidays with you guys, and if your uncles are ok with it, maybe she could visit for some time.", "NTA.", "NTA. You wouldn’t be wrong to never go back. Your mother’s home is abusive.", "NTA-\nYou're a kid, none of this is your fault. It's 1. Your Uncle's faults for not discussing the college fund with your mom sooner; 2. Bob's fault for expecting your uncles to pay for his biological kids college, and 3. Your mom's fault for not having your backs.\n\nAt the same time, don't ruin your relationship with your mom. The same regret you have over your dad will happen with your mom. Your relationship may never be perfect, but this doesn't sound like it's worth cutting her off forever.\n\nAgree to go to Christmas dinner under the condition that you don't talk about the college fund and that she agrees to go to family therapy with you and your sister. If they bring it up, remind them of the boundary. If they persist then leave and stand your ground.", "NTA.", ">My mom eventually remarried to Bob. I never liked Bob because he always have to be in control and placed us on a strict schedule. Dinner was at 7 everyday no matter what. If we came home late and dinner was over, we weren’t allowed to eat that night. Whenever our uncles gave me and sis money, we had to give it to Bob and he divided the money equally.\r  \n\r\n\nI'm sorry what?! \n\nNTA\n\nTell Bob to kick rocks.", "NTA anyone who would try to deny someone the opportunity your uncles are giving y’all does not love you. I know it’s hard, and be prepared for the guilt tripping and angry phone calls (I’ve dealt with it all before) but you deserve to have the life your dad would have given you. You may feel guilty bc it’s your mom, but please don’t worry about justifying your choices. Sometimes stuff is just shitty and if they don’t understand then they never will. When I left my parents I had my big brother answer the phone when they’d call yelling, I’d have him shew them off my doorstep— and it wouldn’t be the worst idea to ask someone to do that for you if it’s hard doing it yourselves.", "NTA\n\nYour mother has proven that you are not part of her family by not protecting you from the mistreatment of her new husband.\n\nIf anything they should have both been much happier because now they have two less college educations to finance and INSTEAD she has now lost her daughters.", "NTA. You ARE spending Christmas with family. The best part of your family. I just want to give you a hug. I’m sure your uncles are wise to your mom and have set up your funds appropriately, go get the educational experience your want. And ask about staying with your uncles, your sister will need them too.", "NTA. Your uncles and their families have proven to be your real family. They seem to care about you guys more, and treat you two like actual human beings.", "NTA---your mom needs a BIG wakeup call!  There is no reason for him to treat you that way all of the time.  If mom wants to see you, perhaps she should recognize why you left in the first place.  Toxic is Toxic!  Be merry this Christmas season and stay right where you are!", "Echoing the nta 💯\n\nLook into a permanent guardianship for you and your sister. You may age out before it goes thru but for your sister? It’ll open more doors for college and housing.\n\nBirthing a person doesn’t make it right for the birther to behave any which way.", "NTA! your mother actually posted about this fron her perspective in the same sub a few weeks ago at most, probably last week.", "NTA. Where to start? Bob is TA for so many reasons, from denying you dinner if you were home late, to insisting that you divide money equally between all, to wanting to divide money your uncles saved for you and your sister among your step-siblings. \n\nI don't know about laws where you live, but look at becoming an emancipated minor. Further, your uncle(s) might want to consider petitioning for legal guardianship of you and/or your sister. Both of you are old enough that the courts, at least in the U.S., should give consideration to your wishes.", "NTA tell Mom that you ARE spending Christmas with your family. And then tell her that it's not your fault that she threw away the opportunity to continue to be your family. Enjoy your holidays your uncle sound lovely.", "You *are* spending Christmas with family. Merry Christmas! NTA.", "NTA. Fuck Bob", "NTA, This guy sounds way too controlling and has no business telling your uncles how they can spend their money. \n\nDoes your mom agree with him or is she scared to disagree with him? He sounds abusive, verbally at the very least. Making you go without dinner because you were late is abusive. Does he also take things further?\n\nGood job leaving and taking your sister with you. Don't give in to your mothers demands to come over and tell her exactly why you don't want to come over. You may open her eyes.", "NTA. Your stepfather is TA.", "Why most of the time people called Bob are assholes?", "Christmas, like a 'home', is where the heart is...tell Mom you need a break this year.", "NTA this is Grimm’s brothers level\nEvil Step Parent.", "Invite her but not Bob over for Xmas", "NTA. I'm happy you and your sister have Uncle David and Uncle Alan as your family.", "NTA definitely, parents can be extremely annoying sometimes and especially step parents. Don't feel pressured into doing something you don't want! Best of luck for college!", "NTA but here is some advice (I live in the US).  Your mom can legally call you in as a runaway, and if your uncle refuses to turn you over, they can get in legal trouble. Have your uncles research runaway laws in your area- and possibly apply to get a guardian ad litem", "So, wait. If your uncles gave you and your sister $100, non would take it from you and split it between you, your sis, and *his* kids?!!?", "No, NTA. First off, I am so sorry to you and sister for growing up with a controlling AH who your mother ended up with. Second off, you and your sister deserve so much better so I would definitely not feel guilty about not spending Christmas with your mother. She chose to be with that controlling AH. She made her bed and must lay in it.\nI’m really happy to hear you have other family to fall on like your uncles. Stay with the people that make you feel like you’re at home.", "NTA I agree I would ask for uncle to apply for formal custody or guardianship of you and your sister so you can fight for the both of you in court,", "NTA. Fuck Bob and his rules.", "NTA I agree I would ask for uncle to apply for formal custody or guardianship of you and your sister so you can fight for the both of you in court,", "Please tell Bob the following.\n\nJust because you didn't have foresight to plan for your children, doesn't mean now your entitled to someone else's money. Pull your finger out and start looking at your financials in relation to your own children.", "NTA. Love to you and your sister <3", "You are spending Christmas with family.  The ones who loved and supported you through tragedy.  NTA", "NTA. she stood by and allowed this abuse. He’s awful. He doesn’t get your dad died and his kids have a dad? Why should your uncles pay for their college? You mother stood by and said nothing? I would tell your mom exactly how you feel about him. And ask her why should your dads brothers pay for his kids when he is alive and well but your dad is dead? See what she has to say for herself.", "nta, Bob has hurt you in many ways and your mom from what it sounds like just let’s him, put yourself first", "NTA - You ARE spending Christmas with your family.", "NTA.  for one, your step dad had no reason to take the money given to you and your sister and divide it equally.  Your step family has nothing to do with your dad's brothers.  My husband has a bunch of step siblings.  But they would never ever think to take was is given to him from his paternal side and divide. Nor the other way around.  It sounds as though your step dad wants you and your sister to provide for the rest of the family through your uncles' generosity. No, if your mom wants to see you and your sister, meet with her in a neutral spot, and bring your uncles. Stay away from the step dad.", "NTA", "NTA. Hang out with the family that loves you (your uncles). \n\nYour mother has no right to try guilt trip you into doing anything when she never tried to protect you from the step father (she sounds like a doormat, could be wrong, but it seems that way given the information provided).  She chose who her family is, unfortunately to you and your sister.\n\nMay you continue to feel love from the family you've chosen!", "NTA\n\nDavid and Allen actually care for you and want whats best! If they try to drag you or your sister home call the police and cps and report the abuse as what Bob does is abusive, refusing to allow someone to eat if they are late home is disgusting especially if it was from sports or similar. Make sure your uncles can find out if your father left anything to you as beneficiaries of a life insurance or his will to see if Bob has stolen it!", "NTA, if she calls again, tell her you ARE spending Christmas with family and she gave up the right to claim herself as your main family when she got together with Bob. \n\nI'm so sorry you grep up in such a shitty situation and hope you'll have a fabulous Christmas with your actual family.", "WAIT!!!! Your \"step-father\" STOLE your money from your uncles that are NOT related to him or his children, and divided YOUR money among HIS children? Your uncles needed to know about this outright theft and abuse!\n\n&#x200B;\n\n>Whenever our uncles gave me and sis money, we had to give it to Bob and he divided the money equally.", "NTA\n\nMom should have been protecting you from her husband. She shouldn’t be surprised that you aren’t interested in going over there.\n\nYou are with family. I would argue that your uncle is more family than your mom is.", "NTA.  Don't go.  When you want to see your mom, have her visit you at your uncle's house without Bob.  Since legal issues might show up, please start stating clearly that you do not feel safe or welcome at your mom and Bob's house.  I know from experience that kids try to hide abuse but say this at school when asked why you live with your uncle.  Say it to your friend's parents.  Say this to anyone official who talks to you about the situation.  Say it to the police if they show up.  Bob steals from you, denies you food, and flies into enraged temper tantrums at you. Keep saying your truth, because Bob is going to try to get back at you.", "nta..\nyour mom and bob sucks..", "NTA... so sorry for this amount of stress and trauma. It may hurt a bunch, but don't cave and spend Christmas with your uncle.", "Nta. You're old enough now to take control of your life. Don't put yourself in an environment where your stepfather will abuse and try to control financial decisions that are none of his business. Your mom has done nothing to make her home safer for you and your sibling. Don't go.", "Your uncle’s gift of an education to you and your sister is actually a gift to your step sisters and brothers. It takes the pressure of your mum and Bob to split their resources. I’m assuming if your uncles are covering your costs you won’t need as much if any contribution from them which means their cash can go to financing the others. Bob at the most generous thought might be lashing out because he feels inadequate at not being able to provide as much as your uncles for all of his kids and you two but he is a TA for how he is going about it. Your mum must be devastated at losing you both but I see how uncomfortable it would be. Why not suggest going out with your mum by yourselves and start to rebuild your relationship with her. Bob should go one in the meantime. Good luck", "NTA. It sounds like you both would have been better off with your uncle's all along. In sure your uncle's were outraged that every time they gave you some money, Bob stole some of it for his own kids. I'm glad you can finally live with the people who love you the most. Sounds like Bob only cares about what he can take from you and Mom is going right along with him.", "NTA- \n\nBob seems to have missed the fact that since he and your mom aren't paying for you and your sister's schooling, he has more to use to pay for the other kid's.", "NTA obviously, Happy holidays, seems to me you are spending it with your family. your uncles sound amazing! and fuck bob", "NTA, never heard of anything more spiteful and childish, it’s a irrational ask of anyone, yet alone your uncle, bless him as he didn’t have to provide any financial college support, but he did because he’s an absolute blessing, your step fathers behave disgusts me, \n\nI’m not sure there is a relationship for you and your mother, try and map out your boundaries and what you want from life and for yourself/your sister, and then you can figure out the relationship you want with her, \n\nIf you feel safe and loved at your uncle David’s house then that is your home and your family, you are spending Christmas in the right place, ❤️", "NTA. Bob has issues and your mom is doing nothing about it. Stay away because he could become violent.", "NTA. If she wanted to spend Christmas with family she should have treated you like family, not whatever the hell that reaction was.", "NTA. you ARE spending Christmas with family, that love and care about you. Unfortunately for your mom, sounds like she's finally realizing there's consequences to marrying a man who treats her kids the way that AH has treated you and your sister.", "NTA \nBut i keep seeing everyone hating on the mom, it might be that the mom can't get out of bob's abusive spiral anymore and she needed someone when the dad died and went back to Bob just to have someone, which is also kinda sad. I hope she sees how abusive Bob is and steps up her game to leave him again. Because she might be brainwashed because of him.", "Even if they were blood relatives they are not entitled to uncle's money.", "[removed]", "Yes, I think the courts would be very interested to hear what OP has to say", "Small correction: GALs advocate for what they think is in the best interests of the child.  Not necessarily the child's interest.  \n\nThat being said, a GAL would likely argue for what the OP wants in this situation.\n\nSource: I've been a foster parent for 8 years.  My kids have both their own lawyer (who does represent what they want) and a GAL.", "NTA  and dont give that jerk off a penny of you and your sisters money. Bravo to your uncles.  dont get me started on the cant eat at night part. Dude sounds like an abusive lunatic.", "[removed]", "Yeah, as soon as a GAL hears food was withheld for getting home after 7pm for any reason, they’ll agree the kids shouldn’t be living in that house. A meal being withheld as punishment is abuse/neglect in every state of the US and most developed countries. If mom get authorities involved, OP needs to disclose this asap to both police and CPS, then the family court judge when it gets that far. And if I were OP, I’d tell the uncles now….let them use it to pressure mom into signing permanent guardianship papers without all that mess.", "Did you miss the part where \"BOB\" was stealing from OP and dividing the money amongst HIS kids?", "Coming on top comment but mom made one or two posts about it already. I don’t know if I can find them\n\nEdit post was found by u/ladyLothlorien [on this comment](https://www.reddit.com/r/AmItheAsshole/comments/zu9skp/aita_for_not_going_to_my_moms_house_for_christmas/j1i0ygr/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)", "If anything,the stepdad should be relieved that he doesn't have to find money for the two kids. \n\nWhen OP is talking about Bob taking money from them that their uncles gave them and then dividing it equally,he means he is also giving a share to his own kids,right? Like that is pure evil. There is no equality in that. OP and her sister doesn't have a dad (the step-dad ain't stepping up so yeah I don't feel like he earned the dad title) while the other kids have both their parents in their life. That money is given to them by THEIR uncles, Bob's kids have no claim in that. Imagine 'stealing' from your step kids to make your own kids happy ... They are gonna grow up just as entitled as Bob..", "Not just verbally abusive, denying food is physical abuse", "OP maybe you can ask one of your uncles to get some legal advice for you and your sister. You will soon be old enough to do whatever you want; but she may need help/protection from Bob.", "And taking their money is financial abuse.", "Seriously, stop answering your calls from your mother. She has been abusing you for a long time, stop letting her emotionally manipulate you. If she has something to say she needs to say it to your uncle.\n\nPlease don't sugar coat the situation and talking with your uncle, talk about how she and Bob have been stealing from you and your sister, and about how they haven't been feeding you. If there's anything else you're holding back, tell your uncles. They need to know this because if bother your mom have any intentions of legally trying to challenge their guardianship, they lose it when the abuse is brought up", "NTA I am glad she and her sister are with their real family.", "Heck them? Utah much?", "[removed]", "NTA There is family by blood and the family you choose. These young women are blessed to have both in their uncles. Bob is not family by either. Mom is by blood alone.", "That is s clearly the mom's POV. Funny fact, there's a comment in that post guessing the stepfather would soon ask the uncles to give them the money so they could split it among all the kids!", "I was just about to search for this post to link it here so thank you for finding it first!", "I kept thinking of this one while reading.", "Wow it seems to fit to a T!", "Sounds super similar. I’m guessing mom didn’t take the advice she was given which is unfortunate. Sounds like mom is being emotionally manipulated by Bob.", "Omg it does", "I knew it sounded familiar. Anyone have a link?", "Yeah, I was thinking this!  I thought I remembered it being from the perspective of one of the uncles tho.\n\nBut yup....I bet that's OP's mom.", "I can’t see the link. Can you help please", "u/LadyofLothlorien already posted this", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "One thing not being discussed if they live in the US. Both kids get survivor benefits from Social Security until they’re 18.  Hopefully they’re been able to change the account where the money is being sent.", "While thats true it would at least explain why a parent may find it unfair if one of the sisters got a free ride and the other didnt. Its still the uncles choice but i could understand exasperation at that point", "[removed]", "[removed]", "It really depends on the jurisdiction. Mine advocates for the child.", "Seriously, put this on your mother. \"Why do you allow Bob to steal from us not feed us? Why do you not love us enough to protect us?\"", "Willful negligence, actually. Which is arguably worse", "So frustrating to see parents who sacrifice the well-being of their children just so that the parent gets to have a significant other. I'm always like... if they're going to \"pay\" for the relationship that way... why do they aim so *low*? Isn't the mental/physical health of your child valuable enough to trade in for at *least* for someone with a net worth in the range of $250 mil or so? \n\n/s, just in case. The well-being of a child is priceless, and I don't view them as currency to trade on a karmic market for a partner.", "/u/Aloneable is a bot that stole part of a comment from /u/nylasachi here /r/AmItheAsshole/comments/zu9skp/aita_for_not_going_to_my_moms_house_for_christmas/j1hvej3/", "Some Reddit posts really stay with you long after you read them!", "I literally linked it?", "Got it Ty. Yes I agree it’s very similar circumstances", "It’s the second “this” hyperlinked in my comment but see below. \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/ys97jv/aita_telling_my_husband_im_not_going_to_tell_my/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "I can only imagine the emotional blackmail Bob has on the mom right now.", "some women get trapped with abusive men because they bait and switch. Not saying that’s the case here, but this is usually a cycle of abuse and not just being desperate for any man.", ">I hate when women are so desperate for a man that they choose a horrible man just to say they have one.\n\nMen do it too. Screw that, I'm happy I dumped the ex that was jealous of my little boy, she would have made my son's life hell.", "I thought the same thing.", "Next time mom calls crying that they need to spend Christmas with their family, OP needs to let mom know that actually they are spending Christmas with their family, their most loving family not the people who want to steal her college fund. NTA", "I don’t see where you linked it but I did scroll down and see where someone else did. Thanks.", "It’s the “this” in my original comment, you can hyperlink to a single line of text for ease of reading on Reddit.", "Totally NTA.\n\nAt first, I didn't understand what you meant about Bob taking money that your uncles gave you and \"dividing it equally.\" I see now that he made you share the gifts with your half sister and step siblings. That's theft. If I understand correctly, a minor child's wages from working legally belong to their parents and can be taken, but gifts are the property of the child. Your uncles gave gifts only to two of you. Redistributing them wasn't just an AH move on Bob's part. It was theft.\n\nSame concept applies to the money your uncles want to provide for you and your sister to go to college. Bob, your mom, and your various siblings have no legal claim to any of it.\n\nUnless and until they accept that, you should assume that any time spent together \"as a family\" will include them trying to coerce you into sharing. If you don't want to deal with that, don't.", "NTA definitely.  Step dad is abusive. Your uncles are amazing. But you and your sister should get some legal advice. You’re 17 so less of an issue but at 15, your sister might not have as many options.  Is your mom collecting a social security check for both of you that might cause her to push for you both to be back in the house? Do you have savings accounts or anything that your mom and step dad have access to? If this situation escalates you don’t want to be in a position to be forced to leave your uncle’s house.", "NTA\n\nShe married a man who abuses her daughters and is unapologetic about it. Instead she's just manipulative against you", "NTA. if your more comfortable at you Uncles house then you should spend it with them. Especially if you Stepdad is behaving the way you describe. \n\nI'm curious is you post linked to this story? [https://www.reddit.com/r/AmItheAsshole/comments/ys97jv/aita\\_telling\\_my\\_husband\\_im\\_not\\_going\\_to\\_tell\\_my/](https://www.reddit.com/r/AmItheAsshole/comments/ys97jv/aita_telling_my_husband_im_not_going_to_tell_my/) \n\nThe details are really similar.", "NTA. \"We need to spend Christmas with family.\" That is what you are doing right now.\n\nQuick side thought. Why are they angry about the college funds from the uncles for OP and sis? It means there is more money from the (step)parents for *the other kids'* college. Unless it's not actually for college or the (step)parents haven't been thinking about college to begin with...", "NTA\n\nBob takes that prize, with 2nd going to your Mom for not looking out for you and your sis. Your Uncles don’t owe anything to your step siblings and  your Mom and Bob are ridiculous for being anything other than happy for you with a tiny side of relief that that’s two kids they don’t have to put through college, smh 🤦‍♂️", "NTA.  You ARE spending Christmas with family.  The family who don't scream at you for a decision adults made that the adults had a perfect right to make.\n\nAlso, am I getting that right--that when your uncles gave you and your sister money, your stepfather would take some and give it to your assorted siblings?  Wow, what a jerk.", "[removed]", "NTA. Ask Bob if it’s fair his children have their father but you don’t. Life isn’t fair and it’s not ur uncle’s responsibility to support his kids. The nerve.", "NTA- Life isn’t always rainbows and butterflies…. Your Mom brought someone who puts his kids first and your mom doesn’t do the same.  Merry Christmas!", "NTA - your stepdad just wants your uncles money.", ">saying how we need to spend Christmas with family.\n\nYou are literally with your sister and uncle. NTA. Stay away from Bob.", "NTA - I thought I'd mention, I'm pretty sure your mom posted here not too long ago... She was voted an asshole through and through, and I believe her original post and update post(s) made it onto r/bestofredditorupdates or a similar subreddit because your story sounds eerily familiar to that one.\n\nYou and your sister deserve nothing but the best, same with your step siblings. Your uncle's are stepping up to insure you both get that. They are doing everything right, and your mother and her husband are completely in the wrong. \n\nYou enjoy your Christmas with your sister and your uncle's and as impossible as it might be with their constant badgering, try to ignore your parents for the holidays.\n\nMerry Christmas to you and your family, I hope this new year brings you peace.\n\nETA: the post I believe to be written by OPs mother:\n https://www.reddit.com/r/BestofRedditorUpdates/comments/z4bhvc/oops_ex_passes_away_after_divorce_exs_brothers/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "NTA you are spending Christmas with your family. Your REAL family, who take care of you and have your best interests at heart. It's mom's fault she and her awful husband no longer fit that role", "NTA. \n\nI just read your mother’s AITA post. The reality is that there’s only one appropriate response to this situation: gratitude. Your stepfather isn’t capable of it and your mother lacks the spine to put him in his place. \n\nWhich is to say, he is not your father. Your uncles are not related to him or his children or your half siblings. You have a totally separate family outside of your mother and steps, just like your steps have a mother and her family apart from you, and yours apparently comes with a lot of additional support. His reaction should be gratitude that financial burdens are being generously lifted and happy for you that despite losing your father, you still have his brothers to look out for you. \n\nDealing with your mom is the tricky part, right? The difficulty is that her alliances still fall with your stepfather and until she can muster the courage to effectively put him in his place, he will continue to have free reign to bully you and your little sister. Again, he is not your father. It is up to your mother to reinforce this to him. He only has the power she gives him. She’s willingly put him in a position to assume full rights of being your parent. That isn’t working because he cannot find it in himself to earn your loyalty and trust. He doesn’t get to be your parent unless you and your sister decide he is one. Otherwise, he’s just your mom’s husband. \n\nStay with your uncle until your mom does the right thing.", "You will be spending Christmas with your family if you stay with your uncle.   NTA", "Nta! Spend time with your uncle/uncles. Bob can fuck himself.", "NTA \n\nSounds like you grew up in an abusive household once Bob came along. You deserve you peace. Don’t let anyone take that away from you.", "Nta. And well done for protecting your sister, your mom and bob sound terrible and you really sound very strong.", "NTA. And your uncle needs to file asap for permanent guardianship of both you and your sister based on the prior abuse you sustained in your mother’s house. Not letting you eat dinner at all because you didn’t make it home by 7pm is abuse/neglect. Screaming/yelling by adults in the home is a form of domestic violence and children witnessing it on a regular basis is considered neglect in most states; having it directed AT the children even more so. Your uncle needs legal standing to make medical and educational decisions for both you and your sister which requires temporary or (preferably) permanent legal guardianship, either voluntarily signed by your mother or granted by a court.", "NTA- Y’all have been through enough. Merry Christmas to you and yours!❤️💚🎄🎅🤶", "Ummm NTA. Bob sounds like a grade A jackass. Why would your uncles pay for other children’s education? How Bob got there I don’t understand. You shouldn’t feel guilty, have fun with your uncles. Merry Christmas. I would also like to add that my ex was withholding food from our child and I went right to court claiming abuse and that shit ended real quick, I even sent CPS to his house cause he is married with other children and I was concerned for everyone’s well being. Let’s just say that shit ended real quick when he realized I wasn’t playing. Of course he said it was because they had a budget and didn’t want the kids eating everything. Being strict and being controlling and abusive are entirely different.", "NTA \n\nBe with those who allow you to feel supported, secure, and loved. Bless ur uncle's for stepping up the way they did. \n\nBob can suck an icicle.", "Awww I’m so sorry that’s happening, NTA!", "The only answer you give to your mom is, \"I am spending time with my family. Bob is not that\"\n\nNTA", "No and please have a look at RaisedByNarcissists sub on here. I'm so glad you have your uncles. Your Uncle David should look into formally requesting custody of your sister in case Bob and your enabling mom decide to up the ante. (I think just a threat to tell the authorities about Bob's behavior would be enough to shut that down, but Narcs live for drama.)", "NTA, your mom is an AH to keep up with a guy like that and never said anything to him, when he literally STOLE YOUR MONEY btw, now he’s mad he can’t control you and getting free shit for HIS kids, fuck that, you’re absolutely not an AH and you were in some abusive situation. I am happy that you and your sister feels at home with your uncles, ignore everyone who would say you’re an AH and if you want to tell your mom something, tell her she made a choice by enabling the abuse from her husband towards you and your sis.", "You are spending christmas with family. It just happens that she is not part of it. \n\nNTA.", "Oh hell no. If I were you and my mom took that assholes side instead of mine- there’s no way I’d go back. You need to speak to your Uncle and get the ball rolling on getting emancipated from your mom and step-dad. Did he legally adopt y’all? I hope he didn’t. Thank God for your Uncle. I would hate to think of what life would have been for you girls without him.", "NTA, but know legally you can be required to go back home. Obviously, your mother is letting you live at your uncle's, despite she having legal custody. How far is your mother's place from your uncle's? Would you consider making a brief appearance? You're  a legal adult in year. But your sister still has 3 years.\n\nAs great as it is what your uncles are doing, they should have discussed with your mother they planned to pay for your colleges. Not to divide with other siblings, but those important life decisions need to be discussed with the legal parent.", "Nta your mom chose not to stand up for you with her hubby who has been mean to you. Tell your uncle about how the money he has given before was taken and split up against his intentions. Your uncles are honoring your dad by helping you with college and your step kids don’t have anything to do with the uncles and it sounds like a real blending of the family didn’t happen bc of step dads ways. But with uncles paying, it frees up his and your moms money to go to step kids.", "NTA Tell your Mom you ARE spending Christmas with family. Give your uncles a big hug, they sound like wonderful people. I think you should get some legal representation though, before Mom and step dad call police and cause problems for everyone. CPS or legal aid might be able to help here. Document everything.", "NTA.  I am so glad you had someone to turn to.  Your stepdad sounds like a real piece of work.\n\nTake care of yourself and your little sister.  Best of luck.", "NTA, Holidays should be celebrated with family,and if your mom wants to spend christmas with you,you should ask your uncle to invite just your mom(if you only have problem with your step father, and not your mom) and make it clear to your mom that you don't like Bob and not consider him your family.\n\nAnd yeah please ask your uncle to get your legal guardianship or else your mom and stepfather might create some problem soon.", "NTA . I'm so sorry for your loss,  and I'm glad you have wonderful uncles. \nShe's right,  you are spending Christmas with your family,  the ones that love and support you. Not the ones that yell and steal from you.  \nIf your uncles are willing,  might be a good idea to look into guardianship for you and your sister.", "NTA.  Your uncles are angels!", "Btw my suggestion OP block mom and bobs number on you and your sisters phones. Tell uncle that mom is trying to emotionally manipulate you and enjoy your Christmas at home.", "NTA!!!", "NTA. Your Mom is allowing him to control the household. You lost your dad and his brothers stepped up. Your stepdad did not.", "NTA.  Your Uncles are awesome and Bob sounds abusive.", "NTA", "NTA, Bob pisses me off. I have one great stepfather who never treated me lesser or made me feel not part of the family. I had another stepmom who unknown to me aas holding me back in numerous ways out of weird jealousy or whatever the fuck compels these people to be shitty.", "NTA your mum is not a good parent to you and your sister if she is letting Bob be abusive and controlling to you and your sister. Stay where it’s safe with your uncles.", "Please let your Uncles know that this Redditor thinks they are amazing men for being there for you.  You ar very blessed to have them and I hope you and Sis have a beautiful Christmas.", "NTA\n\nYou ARE with family. You're with people who love you, who rejoice in your successes and have only your best interests at heart. Have a wonderful holiday with them.", "NTA. I lost my dad when I was very young too. Unfortunately I didn’t have any such great uncle to support me throughout. Your uncle’s are great.. Keep them close in your life. \nDon’t let BOB ruin your life. Why would your uncle give his money to Bob. Your mom and BOb are the AH here", "So your mom is a asshole and her she chooses to be an asshole with her new husband. \nAnd you are spending christmas with family. The part that actually are family and puts you and your sis first. \nReally proud of you", "NTA.\n\nChristmas is about *true* family, and that is not always the traditional blood parent. Your uncles stepped up when your dad died, and have given you love and support, and a safe place. This is what makes them your true family. Spend Christmas in a place that makes you feel safe and joyous. Where the warmth of the people around you is like the comfort of a crackling fire in the fireplace and you feel peace.\n\nIt sounds to be this place of peace is with your uncles, and that is exactly where you should spend it. Enjoy being with the people who love and protect you, and treat you with kindness and believe in you, not with people who drove you out and tried to crush your hopes and future.", "NTA\n\nYour mother prioritized her marriage to an abusive man over you and your sister. You do not owe her anything.", "NTA. I can't imagine anyone wanting to spend any time around your step-father.", "Nope.", "When my son was growing up, he kept asking me to start dating because he thought I was lonely. (I have terrible taste in men.)\n\nI finally told him that I saw too many cases in which the woman chose a man over her own children, and I think that's revolting! If you need a man so much that you can't survive without him, then get your tubes tied and get a pet! \n\nBTW: NTA!", "NTA.  You are spending Christmas with family.", "I feel like I seen this very same post before.", "The Step-dad probably wants them there to take their money and split it with his kids.  I am sure he misses that. Pressure Cooker...just say  \"No.\"", "Coming from a toxic family myself, NTA!!! And stay firm on your boundaries!", "No. You are not required to subject yourself to an ogre", "NTA  \n\nYeah, you want to spend a month with people who constantly scream at you, steal your money and give it to people who are unrelated to you.", "NTA. Where was your mom when this was going on? Did she just let it happen? Until she sees that this jack ass is driving a wedge between her and you kids don’t set foot back in that house. I hope your uncles also keep a tight rein on your college funds so that only you and your sis have access to it. Good luck OP.", "NTA.\n\n I'm so so glad you guys have your uncles and I hope you have a wonderful Christmas 💝", "NTA at all, im so sorry you have to go through that. I suggest you go nc with her, I think is for the best they both (your mom and bob) seem to be very toxic to be around", "You are spending christmas with your family. If she wanted to be counted amongst that group she should have acted like your family and protected you from her husband (note I dont call him your stepdad) NTA", "Mom and Bob a T A. Mom more so. She stood by and let this man abuse you and your sister and not only did nothing, but had more children with him.\n\nNTA", "No you aren’t, Bob is an over bearing jerk. Your mom sounds like she was desperate to pick out that guy. The nerve of him , acting entitled. Your mom I bet just sits in the chair and lets him act up. My mother did with both of my stepfathers. You don’t owe your step siblings squat. Stay with your uncles .", "> (...) and saying how we need to spend Christmas with family.\"\n\nTell her you're spending christmas with family!\n\nClearly, David's family is your family, and Bob's wants to take that away, in a way. Best of luck to the two of you. If Bob or your mother try to escalate this, I suggest you ask Uncle Alan and/or Uncle David for help. They clearly love the two of you, and are doing whatever they can for you!", "NTA. Tell your mom you ARE spending Christmas with family.", "NTA", ">AITA for not going back to a household that was abusive to me as a child?\n\nNope. Not even a little. Don’t look back", "NTA. Blood makes you related, but trust, love, and loyalty makes you family. \nI haven’t spent any holidays not even Mother’s Day for the last 15 years with my mother, for a similar reason. Your mother decided that Bob is her #1 priority and you and your sis are just there. You are being abused in so many ways. I would tell all of this to your uncles and ask if you can stay there permanently and get legal advice. \n\nYou are 17 and honestly feelings are *complicated* but fucking kudos to you for packing up your and your sis stuff and leaving. Don’t go back, no one should return to an abusive relationship, *yes mothers can be abusive, yours is enabling an abuser as well.* Once she sees that you are standing your ground she’ll try to make you feel guilty, manipulate, and *blame you two* for the issues. Block her number, my mom would call me while driving screaming at me and then fake a car accident and shit. *Block her number* and stay with the Uncles. *Your well being is your number one priority*.", "NTA\n\nWow, Bob is a dick. So he takes part of the money your uncle gives you to his kids from a previous marriage. And now he wants to swindle away a uni found for them. This is really screwed.", "NTA and quite honestly, you are spending Christmas with family. No one should ever yell at you like that and it's horrid that your mother allowed Bob to treat you and your sister like that.", "Why can’t the parents come to the uncles house?  Be on their best behaviour or they will be asked to leave?", "Nta and what the heck. Have you told your uncles he’s been taking your money  this whole time?", "NTA for not wanting to spend Christmas where you're uncomfortable.\n\nLet your mum know that you ARE spending Christmas with family though. Your family is what you make it, your uncles are your family. You're with people who love you, and care about you. You are having christmas where you feel loved and wanted, and cherished.\n\nYour mum chose to back Bob over your tuition. To be honest since she remarried it sounds like she's put Bob and his offspring over you and your sis. Bob and his ex had plenty of time to save for your step siblings, and your mum and Bob have had ample time to save for your half sister. Honestly they should be thankful that any money they had set aside for you and your sis could be redirected to the other kids (as horrible as it sounds for you and your sis).\n\nYou do not have to go back to your mother's if you don't want to. Neither of you do, and it sounds like you're both so much happier with your uncle and his family.", "NTA.  She has allowed this abusive behavior into her home and allowed it to happen to you.  If she doesn't like it, she can get him out of her life. Obviously, she is willing to let you bear the brunt of his abuse vs. looking out for you. So, she doesn't get to force you to do anything.  I think if your Uncle is amenable, they need to look into an emergency guardianship for you so that they cannot compel you legally to return to that cesspool.  And I am really glad that you have your uncles.  Despite all the other crap, Merry Christmas!", "NTA Bob is your mother’s family but not yours. Spend Christmas with your loved ones.", "NTA. Your uncles can fund your tuiton costs directly.  That will be in your best interest for a few reasons - 1 Bob wont have a say in it and 2 financial aid is tied to your parents income and expenses so you will be entitled to more money.  Spend Christmas with whomever you want, but your mom and Bob will definitely be upset with you.", "NTA. You're mom made her choice, and it wasn't for you two. Please don't ever feel guilty for doing what's best for you now.", "As long as you have made it clear that you are uncomfortable the way your stepfather treats you to your mom, you  are NTA. Your mom and stepdad need to accommodate your feelings, too. The two of you are on the cusp of adulthood. You can't grow into what you need to be in that toxic atmosphere.", "NTA\nyou are spending Christmas with your family, your uncles are family. Your mom has never advocated for you, she just wants bob to stfu because she is just as abused. Ignore her calls, it is not your responsibility to set yourself on fire to keep mom warm.", "you are spending christmas family NTA", "NTA \"Am I wrong for not spending Christmas with mom?\" Your not spending Christmas with Bob, and mum happens to be  where Bob is.", "NTA. I keep thinking about the dinner rule, that is some messed up shit right there.", "NTA. good for you for leaving that toxic environment", "NTA\n\nAs much as an asshole that Bob is, it sounds like it's your mum that has failed you both", "Nta, you Bob needs to take care of his own kids and leave you and your sister to your mom and uncles. You two were taken care of before he got there wtf is he to \"fix it\", although it would be nice for you to spend this time with your mother, tell her that Bob needs to mind his own seed. I had a step father that never had kids wanting to raise me \"right\", my mom and him divorced with in 3 years, I made his bad side come out, so my mom can see how he really was.", "[removed]", "I don’t have advice or anything, but im truly sorry that you are falling victim to this guy’s jealousy and negative attitude. I hope the best for you and your sister.", "Nta\n\nYou mother actually already told us your story, so you know, we all here 100% support you", "Your stepdad sounds very toxic, I'm sorry your mother has been enabling him stealing your pocket money for years.\n\nIf you feel safe and happy at your uncle's home, you should spend Xmas there - maybe there's a little chance for your mother to rethink her relationship with daughters.", "Some of the things you discuss here represent actual child abuse crimes. Stand your ground. Bob should never be allowed to interfere in your life again, and it sounds like your uncles are likely to support your decisions and are aware of Bob's behavior. \n\nTell your mother that her husband is trying to control your life, steal your money, and has never respected you and that it reflects poorly on HER to allow him to treat you that way. It's her job to protect you, and she isn't.", "This reminds me of another AITA that I haven’t found. It was when the daughters left, not about them not returning for Christmas as it wasn’t close yet. There were two uncles. And I think mom was the OP.\n\nSomeone else found it\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/zu9skp/comment/j1i0ygr/?utm_source=share&utm_medium=web2x&context=3", "NTA, you are with the family that actually takes care of you.", "NTA. Bob sounds like a real treat. Tell your mom you love her, that you can't deal with her choice of spouse and you would love to see her at your uncle's house.", "get out! Get out now!", "[removed]", "NTA.\n\nYour mother and stepfather are emotionally abusive. You are spending Christmas with family, a real family that loves and supports you both. \n\nYou did the right thing by leaving and taking your sister with you. It was brave.\n\nI’m just glad you have loving uncles. Enjoy your Christmas with your Uncle, sister, and cousins, and don’t let your Mom and Stepdad ruin it for you with their tantrums. You have that right.", "Your mother chose a crapsack bed, now she can lie in it.  NTA", "You ARE spending Christmas with family. Biological and chosen. Your sister, your uncle, and his family. The people who have been there for you since your dad died. Your mom deserves none of your time since she’s never been in your corner. I’m rooting for you and your sister. NTA. Go have an amazing Christmas with your uncle. He sounds like a great person.", "NTA tell mom this is the result of her allowing years of emotional abuse from Bob. Tell her that you will never live in the same house with that man again, and her only choice is to decide if she wants to go out shopping just the two of you when you decide it's convenient for you. Then hang up and give her the time to accept that.", "OP, you are NTA. Bob is TA. And your mom is also TA because she has let Bob do all of these things like share YOUR gifts with his children. That's not how it works. Enjoy your Christmas with your uncles. If your uncles agree, you could allow your mom to come visit with you (alone) there. If that's not an option. Just do a quick video call with her and wish her a Merry Christmas. \n\nNTA", "NTA. Your mom made the choices that brought her to this place in life. She has to live with the consequences of her actions towards her children. \n\nI want to know what she did to your Dad and why he had to leave. You should ask your uncles why your parents broke up.", "NTA.  Your mom is though.  Her job is to protect her children.  She is 100% failing at that.  Your step \"dad\" is abusing you both.  Stay away and make sure your uncles both know he's been stealing your money.", "NTA. It is simple - you have a different extended family. That isn’t your fault. You shouldn’t suffer because of that and your mother and her husband should be adult enough to realize. \n\nLife isn’t fair, you clearly know that because your unfairly lost your father. Your mom’s husband should know this too. \n\nPlease follow the advice of others and get the legal protections you and your sisters deserve and move on with your lives. \n\nYour mother choose her destiny by forgetting her responsibilities toward you and your sister. A new husband does not  mean you give up the responsibilities of your prior children. \n\nIf she wants her daughters for Christmas, she has to stand up and be the mother and protector she is supposed to be and that is protecting you and your sister from her narcissistic husband. \n\nYou only get one life and you don’t get to pick who your parents are, but you do get to pick how they impact your life.", "NTA. Bob sounds like an awful, controlling person", "Your uncle is your family. She chose her family when she let that asshole drive you out of the house.\n\nYou are NTAH", "[removed]", "Report Bob to CPS. Denying food to anyone, but especially growing children is cruel. Also don’t share anything positive that is happening in your life with your mom and Bob.", "absolutely not", "NTA.  You are spending Christmas with family.  It is unfair for you to have to divide everything from your uncles with your step-siblings.  Your uncles want to provide for their brother's kids, period.  You are very fortunate to have them.  Your mom chose Bob instead of standing up for the two of you.", "NTA. I’m so sorry you are still just a kid and shouldn’t have to deal with this little man and your passive mother. You are not I. The wrong for accepting this gift and you aren’t wrong from staying away from an abusive individual that thinks it’s appropriate to yell at children because he lacks decent control of his life.", "People believe this ?", "Never go back. Move forward, don't feel bad about your mom she's an adult and made her decision. Move forward achevie your goals live a good life.", "NTA\nI am really sorry for your loss.\nI know you and your sister have it rough, losing a patent is always hard, especially in these circumstances. \nYou are under bo obligation to go back if Bob screams at you like that.\nBuy try to still tell your mom that you love her  regardless and be kind to her when possible.", "NTA - Your mom was not a mom to you when you needed her.  She blew it and now has to accept the consequences of her actions.\n\nShe chose to let this man abuse you and steal from you and she wants you to continue to let him treat you that way.\n\nI'm sure this will be one of the best Christmases you've had in a long time not having to deal with both of them.  I'm glad you and your sister have a great support system in your uncles because you're certainly not getting that support at home.", "Nope.  Disassociate immediately....", "Your mum and Bob are the fucking worst. NTA. Stay away from those dipweeds.", "NTA. \nInform her that you are spending Christmas with family. Just not the family she expects.  \nYou can also inform her that her decision to be complicit with Bob's behavior made the decision exceptionally easy for you and your sister, and until she finds the spine to reign her husband in, you're with the family that matters to you.", "You are so far from the AH here. I'm sorry you lost your dad and even more sorry the man who was supposed to fill his role (not saying anyone could ever replace your father) did such a terrible job and made your life arguable worse. \n\nYou have done absolutely nothing wrong and if I was in your shoes I wouldn't want to spend Christmas with my mom and her shitty husband. He sounds selfish, entitled and just plain mean. \n\nNTA", "NTA. Your mother chose Bob the asshole over you and your sister. You had to suffer as a result. She made her choice, she doesn't get to have it both ways, whenever it's convenient for her. I'd cut her out of my life.", "NTA. your mom chose her husband over you and your sister.", "NTA. If they wanted you there on Christmas, they should have fostered a more positive relationship with you and your sister. Period.", "NTA. Stay away from those back stabbing emotional terrorists.", "NTA. OP and sister are so lucky they have their uncles who stepped in to fill their Dad’s shoes. Uncles are making OP and sister a priority, but mother is not. She chose to subject her daughters to years of abuse from  her husband, who is controlling, greedy, and very unfair. If mother’s Christmas is ruined, it’s from her own actions. She can visit her daughters at the uncle’s house if daughters even want to see her. OP should try to get custody transferred to one of the uncles as soon as possible, and chronicle every instance of abuse or willful neglect that she can remember.", "I thought it was weird that he’d make sure the money was spread equally(between you and your sister) but no he spread it with his kids as well. Holy shit what an asshole. Fucking incredible your mom just let that happen. NTA.", "It’s a trap! \n\n😅 Don’t go sweetie, you made the right decision, I’m so glad you have a family that cares for you and loves you.\n\nNTA, your mom and stepdad are.", "Wait a sec this sounds familiar.  Wasn’t there an AITA written by the mother?", "I’m glad you went to live with your Uncle. He is the one who truly loves you and your sister. Mom has chosen her new life. Send her a card and enjoy your holiday with your Uncles.", "NTA.  After the way your mother and \"Bob\" have treated you and your sister, I would personally never go near them again.   It's not your fault you have step siblings or a half sister, or that \"Bob\" is totally bang out of order for his behavior.  You have found somewhere you're loved, and cared for, and where you're not going to get abused for something you didn't choose.  If your mom is crying and saying how you need to spend christmas with family, remind her that you ARE spending christmas with family, just, not her and Bob.", "NTA. \n\nGeez. Your uncles are exceptionally kind, I am glad you have them. They have opted to smooth your way to adulthood after a harsh childhood. It doesn't have to be fair to your step- or half-siblings; it wasn't fair your dad died either but here we are. \n\nYou are both old enough to decide where to spend Christmas. If your mom wants to see you, she can ask your uncles if she can come over and spend some time with you, if you're willing. You certainly aren't obligated to go visit them.", "Food restriction and financial control are big parts of abuse. You and your sister are now in a safe home, with supportive and loving family. You are NTA AT ALL. I wish you both the very best ahead ❤️", "NTA: your step father is an adult. your mother is an adult. They made the choice to be angry and yell at you for your uncles choices to pay for your college. You did nothing wrong. It’s ridiculous to blame you for something out of your control or to ask you to give it up. \n\nIt’s very generous of your uncles to pay for your college education and to treat you so well through the years. It’s their choice. They’re adults to decide what to do with their money, especially since they will be paying for your college education after you become an adult. It’s an adult giving a gift to another adult. It doesn’t have anything to do with your mother or her husband. Your mother and step father are not entitled to it for their other children. \n\nPlus, your mother and stepfather were both wholly inappropriate to steal your money from you to divide it up. They’re not entitled to anything you are given as a gift. Your property is yours. Even if you are a minor. \n\nYou may have a sticky situation on your hands, being your both minors, and if they force it, you could be forced to go home if they call the police. Your mother has custody of you, not your uncle.", "I think I read this same story like a week ago.", "NTA. Your mother showed clearly how much she doesn't care about both of you. Just enjoy your dad extended family.", "NTA your mother failed to protect you from the asshole she married. Until she leaves him, don’t go over.", "Your NTA after he bob thinks it unfair that YOUR uncles not his kids uncles are paying for yours and your sis's collages. But when someone has the audacity to make you split up the money that YOUR uncles gave you is flat out stupid. If your step siblings need money for collage then bob and your mom can pay for it. After the way they  treated you, you don't need to go to Christmas with them.", "NTA. Not a bit.  \n\n\nA lot of people have given advice here, but I think you need to maybe look into making your uncles your legal guardians. You're almost 18, but your sister is only 15 and could definitely use the protection. Bob sounds like a textbook abuser (especially that whole 'no dinner' nonsense). Please stay safe, OP. Wishing you and your sister nothing but the best.", "NTA. If I was in a blended family and found out any of the kids had college covered, from family, from scholarships, from robbing a bank, I’d be so relieved", "You are spending time with family ~ your Uncle’s family. Enough said. \n\nYour mom and step dad are terrible creatures. \n\nHave a Merry Christmas!", "NTA your mom failed to protect you.  Stay where you feel safe.  My mama heart aches for you. Lots of love from this mama on Christmas eve 🖤", "NTA and don't give into any guilt tripping she may pull on you. In my opinion, Bob is a thief, a narcissist, and a bully. Just because she is your mother and he is her spouse does not mean they are true family, at least from my perspective. Your uncles and their families are amazing for how they made sure you and your sister were taken care of. Not only do I recommend cutting off contact with mom and Bob, but also going the extra mile to prevent them from ever accessing your money again.", "NTA\n\nYou *are* spending Christmas with your family. Remind your mother of that fact.", "If this is in Canada, you are well within your right as someone \"16 or over\" to apply for the 16-17 program and gain freedom from your mom (with this you would get a social worker assigned to your case and then the Ministry of social services would become your legal guardian IF approved). Your uncle's have given you a safe home, so you don't have anything to worry about, but your younger sister, being under 16 could be compelled by the courts to go home (unless she seeks guardianship through adoption by your uncle, IF he is willing). I'm sorry you have to deal with this OP, I hope things get better for you.", "You are spending it with family. Your mother had years to behave like family to you. NTA at all.", "NTA in any way OP.", "NTA for sure.\n\nMaybe someone who knows more can speak to this: can your uncle put that college money in a trust to keep your stepdad away from it?", "NTA Your mother chose an abusive man over you and your sister. I'd stay with family that actually loves me. Your uncles have no obligation to provide for your step-siblings', not your half sibling's college.", "NTA. Either she's also a victim of his abuse, in which case she needs the wake up call to make a move and leave, or she's his accomplice, in which case you should stay away. It can be a little of both, especially after a long time, but keep an open mind to resume a relationship with her if she ends up leaving him.", "NTA! Stay away as long as you can. Mom fucked around and chose this asshole over her own kids, now she’s finding out.", "NTA. Remember that it's ok to step away from family, even if it's your own mother. A toxic relationship is still a toxic relationship, no matter who it is. In my opinion, you did great, and you should continue to stay away from them, especially the step dad.", "NTA. \n\nI'm glad you and your sister have your uncles to support you. What Bob was doing was straight up abuse and I'm glad you both could get out that house. But since you 2 are minors I'm concerned if they could take any legal actions, so your uncles should get counseling on how to proceed legally.", "NTA, but is your mom okay? I understand parents wanting to provide equal opportunities for all their children. Sometimes in blended families, that is not possible. If the situation was that your father was the one paying your tuition, would they expect him to pay for your step and/or half siblings? Likely not, so why would they expect your paternal uncles to be obligated to do so? Also keep in mind that by the time you and your sister are off to college, you will be adults. Your mother and stepfather will have no say in who pays your tuition; that will be a transaction between you and your uncles - all independent adults who don’t owe anyone else anything. \n\nI do sympathize with your mom. Your stepdad sounds controlling. I hope she’s okay, and is able to rectify the situation before she loses her daughters forever.", "NTA.\n\n'Mom\" went out of her way to allow Bob to alienate you.\n\nShe fucked around, & is now finding out.", "NTA so sorry your mom is behaving this way and not protecting you from an abusive sf. Thank goodness for your uncles —you ARE spending Christmas with family", "NTA, you guys should have left along time ago and told your uncle about him taking your money. Your uncles have no obligation to your step and/or half siblings they are you mother and step father responsibility. If they can’t cover the cost that’s your parents and step siblings problem. Another example of adults trying to force family members to take care of children created and brought in as step and half siblings. Sorry for your loss but very happy your uncles were able to step up.", "No, you did the right thing. If she wants to spend time with you then she can come to you and spend it where you feel loved. That's so horrible what you experienced. Good luck!", "You need to do what you need to survive. If you see a change in your mom and Bob you could consider it, they’re the adults.", "NTA", "The fact that you are 17 and already recognizing and avoiding damaging relationships makes me so happy for you. DO NOT, and I can't stress this enough,  put yourselves in situations you don't want to be in.  Simple as that. Go where you feel safe, happy and loved!", "NTA - your mother calling and demanding you spend Christmas with family...just know that you are, your uncle is family. Even if he wasn't related by blood, sometimes our family isn't always the typical type.", "NTA.  Ensure your uncles understand not to provide funds for you both or for college to your mom anymore but to pay directly to the school, including any SAT or PSAT reviews or exams & application fees etc.  Bob and your mom wanting your uncles' funds to be split between your step & half siblings is incredibly greedy.  Your uncles are providing because your dad lost his life & they planned to financially stand in for him.  Bob is financially responsible for all his own children.  Your mom is the worst though for wanting less for you even though you've already lost your dad.  No visits until you are at least over 18 so cannot be forced to stay & there is a custody order in place for your sister for your uncles.", "NTA\n\n\nAnd tell her your uncles are family", "NTA. \n\nHonestly, let your mom know you are spending it with family. Family that actually gives a shit about you. \n\nMaking things equal for step and half sibling is not your problem. Bob has created and fostered this dynamic and resentment. Bob doesn’t know how to blend a family but his way is definitely the way to alienate everyone.", "You're with the family that loves you so you are doing exactly what she wants, NTA.", "You are spending Xmas with family. Maybe your mom can stop by if she so desperately wants to see you. Not one penny is owed to Bob or his kids. He's unhinged to think he gets a part of what ever has been given to you. NTA", "This breaks my heart. Of course you are NTA. Bob sucks. I’m glad you and your sister have your uncles to fall back on. They sound like amazing people and great examples for you two.", "NTA at all. I really wish I could give you a hug because this honestly breaks my heart. I'm glad you have family that love you, care for you, and are keeping you safe.", "Protect these kids at all costs! NTA you deserve all the love in the world", "NTA. Your step father is abusive. I’ve been where you are. My siblings reported the abuse they suffered at the hands of our father and step mother to a school counselor and my Aunt and Uncle became their legal guardians. I’m so sorry. I’m glad you have your uncles.", "NTA \n\nSounds like mom and stepdad made their decision a long time ago. And if they had a legal leg to stand on they would have called the cops to bring you home.", "NTA.  You have an identifiable family issue.  You are trying to avoid a toxic family situation.", "NTA. Stay at your uncle’s house. I’m very happy your uncles are taking care of you and sis and love you. Bob can go suck a sour lemon. He can help his own children with college. Your uncles don’t owe a penny to Bob’s children. Your mother is the AH here. Instead of being appreciative of your uncles she’s being a sour puss about her daughters’ blessings. She no longer needs to worry about funding your college educations.", "NTA.  I’m so sorry OP this is unacceptable behavior from an adult.  Unfortunately just because someone is older doesn’t mean they have maturity or wisdom and aren’t straight up wrong.", "Lord have mercy, NTA at all! A mother should consider her children heavily when considering remarriage and it sounds like Bob should never have had the role of step anything since he's taken it as a power trip and an excuse to take from you and your sister in order to give to his biological children. \n\nI applaud you for standing your ground on this and Bob needs to make sure he learns that life isn't going to be 'equal for everyone' before he sets his own children up for  one hell of a rude awakening when they're exposed to the real world. That being said the other kids behavior and reactions are absent from this post so maybe they've already taken on his skewed world view. Regardless, enjoy Christmas with people who love you and don't expect you to go without to make others feel better. \n\nOh, and tell your mom if she was so concerned about family she should've spoken with her new husband about not alienating her children from before their marriage. She made the decision to choose bobs ego over you and your sister. Actions have consequences. That's life.", "NTA, but your mother is correct you should spend the holidays with your family. In this case you and yours sister family happens to be your uncles.", "NTA. Stay with someone who cares about you. They're your family, too, and they treat YOU like family. Bob has no authority to take money from your uncle, don't even worry about that.", "NTA if I had stepkids and uncle wanted to pay for college for them I would be buying him a beer. Talk about taking a hell of a load off my plate lol.", "NTA. I’d honestly never go back. What abusive bs. You and your sister need to go on with your uncles and live your best life.", "Oh yes, yes you are \"so lucky that your tuition is paid for because your dad died and you will never see him again\" /S. \n\nJeez, what's wrong with Bob. Entitlement deluxe. NTA, of course. I'm so sorry for your loss but also so happy you have your amazing uncles.", "You are spending Christmas 🎄 with family. She should never allow a person to come & live with y'all & abuse y'all", "NTA. You are doing a great job for  choosing to go where you and your sister will be safe and taken care of. You are not obligated to have a Christmas dinner at a place where you were denied dinner many times, I assume, for coming home late. PS: you’re very lucky to have those uncles. Let me know if they can accommodate a long lost nephew LOL", "NTA. You are spending Christmas with family. Your Uncles and their families ARE your family. Aren't they your dad's brothers? \n\nMother chose her abusive hubby over her own children. You chose a peaceful life in a loving household. I would stay away from your mother too. \n\nLove and hugs from an internet grandma.", "Nope. You’re good.", "This was posted a few weeks ago. I'm curious if the posts are linked because a lot of the details are very similar.\n\n[https://www.reddit.com/r/AmItheAsshole/comments/ys97jv/aita\\_telling\\_my\\_husband\\_im\\_not\\_going\\_to\\_tell\\_my/](https://www.reddit.com/r/AmItheAsshole/comments/ys97jv/aita_telling_my_husband_im_not_going_to_tell_my/)", "The story is very similar [to this one.](https://www.reddit.com/r/BestofRedditorUpdates/comments/z4bhvc/oops_ex_passes_away_after_divorce_exs_brothers/) The mother seems that she doesn't grasp the severity of the abuse.\n\nEven so, OP and her sister don't have to endure more abuse, so NTA", "I think she could use your talents removing her Mom and this extended family her Mom has from her rear end! hehe Sorry, couldn't be helped. Merry Christmas or just a wonderful weekend to you however you spend it!", "Exactly. I have half sisters and while their relatives might give me a small gift for Christmas or a birthday card I NEVER felt entitled to anything from them. \n\nA step sibling and half sibling can be loved by the other families, but demanding they be treated as absolute equals is not acceptable in this instance.", "Five dollars says Bob is military, either a vet or active duty.", "Glad someone pointed this out. Denying children food is textbook abuse.", "Not to mention, meal timing is extremely personal to one’s health. Everyone is different, and there are people who’s bodies simply dont react well to eating at a certain time. For example if I follow a strict traditional diet(breakfast at 8, lunch at 1 and dinner at 7) I will feel lethargic and sick. I really cant imagine how id feel being forced to eat at a certain hour that i didnt want to. Its certainly abusive.", "Guess no one’s gonna say it, huh?", "Those uncles sound like gold don’t they. They didn’t just provide the equivalent of child support. But they provided bonus dad material. Even from the moms point of view they’re incredible humans. I think it’s def the moms post.", "Both accounts posted with just 1 post & no comments. Very strange & feels like fiction to me.", "Bob is a complete asshole. The uncle's are paying for their brother's children, which I'm sure he would have done himself were he alive. This is the girls right to their patriarchal family side and it's a goddamn blessing the uncle's stepped up for their upbringing and education. \n\nBob being a jealous asshole is not OP or her sisters problem. Mom married an asshole, she made her bed. \n\nNTA.", "Exactly this! I have a mother who chose a man over the well being of her kids. No one will be surprised I no longer speak to her.", "This is the best advice.  No information and ask your uncles to consult a lawyer about your sister's guardianship.", "Great comment!! Her family is the uncles and their families. (I was confused for half a second cause at first I thought you meant don’t go with your real family, but then I realized you meant don’t go to the mothers. It was just my Rhode Island lingo tripping me up lol)", "Yeah both are fake.", "I can't agree with this enough!!", "I respectfully disagree. The mom made her choice to stand by Bob, not her own daughters. A relationship takes both parties to make it work, and these girls aren't responsible for how their mother behaved. I speak from experience, at 51 I had to finally give up on trying to have a relationship with my mother this year and cut her off. A toxic parent isn't really a parent, and unless this mother makes an effort to support her daughters (and maybe tell Bob to take off), nothing will change. This one is most definitely worth cutting off, as she's letting Bob abuse her daughters. Refusing them food is criminal, literally.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "It’s clear that that mom will always take Bob’s side since she didn’t do anything while he yelling and chasing her daughters out of the house. Anything that they try to rebuild with her will eventually include Bob", "Which post do you think was the mom’s? I’m curious now", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Agreed. Especially the part about no dinner if you're home late. OP mentions that both of them have participated in extracurricular activities over the years. Those run late. How often have they been denied food? \n\nOP, NTA, not even a little bit. I'm glad you both had somewhere safe to go to get away from that abusive household.", "Yeah, that dude never thought he was paying for any of those kid's college.", "Abusive parents use college money as a control mechanism. Go to the college I want or I won't pay. Do the courses I want or I won't pay.  Keep your grades above this level or I won't pay. I hear that you looked at a boy or had a sip of beer (and believe me, he'll hear) that's it, no more college for you. \n\nBob is probably furious that he no longer has control of his stepdaughters' lives until they're in their early to mid 20s.", "**OP you are definitely NTA!** \n\nSo grateful that you and your sister have your uncles that love you both and values your feelings and needs.\n\nMy husband and I have no kids, however we've always believed that aunts and uncles play an important part in being there for whatever our niblings, ( a word I've learned here ;) ) need from us. We've been there at all the school events when no parents showed, celebrated their every achievement, and are the listening ears and open hearts ( and wallets ) whenever needed.\n\nSo sorry you've been treated so heartlessly. I didn't see anything about how your mom reacted to Bob's \"rules\" so I'm guessing she's been totally on board with it.\n\nYou've had much good advice from people here who have knowledge and professional experience in these situations. We're all pulling for you and your sister! <3", "This is actually partially changing! Many jurisdictions are moving away from volunteer GALs and moving to full time ones employed by the courts. As such they have more time and resources to really communicate with the child and help advocate choices in their best interests! \n\nSource: my partner is employed as a guardian ad litem for the court system in my county", "I hate how step parents forget that when a parent is dead.. that kid lacks... FOR LIFE. They never get to see them at holidays or big events, never get anything from that parent again while most broken home kids still might have the bad from the broken but at least they still have access...", "That has GOT to be the same family!", "It seems very possible that they are linked. Either way my heart breaks for kids growing up without a parent.", "I too recalled a very similar tale. Thanks for confirming it.", "Damn. Ok but like whats the chance of this being real", "And taking their money..", "I thought this story sounded familiar and that I had heard it from a different perspective before", "This is reprehensible.", "I have step siblings.  I never expected gifts from their grandmother, but did feel entitled to having my existence acknowledged with something better than, \"Oh, *they're* here.\" when she came to our house.", "I've witnessed this with single mothers who don't make enough money to support their families without public assistance so they get married for financial security. They're afraid of being alone, so they implore their kids to follow new dad's rules for the good of the family. Some stepdads are great, but stories like OPs are all too common, albeit not usually to such an extreme.", "Yep. Let her cry", "Maybe, maybe not. You think if he's this controlling of the kids he's not abusive to the mom too?", "Or a cop.", "I don't understand why people like think they are entitled to someone else's money", "Same", "The way this one is written it’s clearly fiction. Wondering if they are trying to make a series/goal to do each view point.", "Yeaaaah. Pretty sure this and probably the other post are fiction.", "That’s so funny. I immediately thought of this post, too. But, like you, I thought the original was from the uncle’s perspective.", "Lol I’m in KY and this isn’t too rare", "Utah? I mean I am from Germany D:", "Thanks! But your confusion is justified, I read my comment again and that part is a bit unclear the way I expressed it!", "Zero history and interaction with the post on either account they made. Their heart isn’t really in this. 🤣", "This one: \n\nhttps://www.reddit.com/r/BestofRedditorUpdates/comments/z4bhvc/oops_ex_passes_away_after_divorce_exs_brothers/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "Yeah denial of food at least in the US is child abuse, no two ways about it.", "As an Asian, I cannot even begin to comprehend this. As far as my experience,even the most abusive parents here wouldn't threaten their kids by saying they won't pay the college fees. I guess it's coz education is like a prestige issue here & the culture is different. Aren't there any government funded colleges in western countries? My fees for each semester was equivalent to like 20 US dollars. Professional degrees are very costly tho. I have read so many people talking about student loan debt,is it that difficult and burdensome to get a 'normal' degree there? Don't get me wrong,education is costly here too but there are government funded colleges that are very prestigious,with very affordable fees. Like private colleges are frowned upon here,these government institutions are the best.\n\nSorry for the long enquiry,just curious.\n\nAlso,the situation you explained is very sad. That is such an unstable situation for a kid to grow up in. There are many things I like about the western culture,but sometimes I find it a bit too harsh the way kids are treated and like kicked out the moment they turns 18. Too many horrible stories posted here (Again,not saying that makes my place superior,we all have different monsters to deal with wherever we live)", "Yeah, that's what happened with my ex-fiance. Her parents were going to disown her and not pay for her college if she continued to even talk to me. We already had a lot of issues caused by her parents so that's where I ended the relationship. Sometimes I still feel like shit about that decision but I know she is living a happy life and that's all I ever wanted for her. It's been 5 ish years since things ended but I still love that girl and want the best for her.", "Niblings is such a cute word ! \nI love how not only the uncles but their spouses and kids (if they have any) are also supportive. Because the uncles cannot make such a big decision without the support of their spouses & kids which is such a refreshing change from what we usually see. I'm tired of reading about moms who put their spouses /bfs over their own frikkin kids!! (Mine always put her own relatives above us giving them full authority over us and I know how that feels )", "They all advocate for the child’s **best** interests. If the child wants to do the obviously worse option, they’re not going to advocate for that.", "Right but \"for the child\" can mean either what the kid wants, or the kids best interest", "For the child's *best interests.* Not necessarily the child's *stated desires.*\n\nOP has stated desires which may be in line with their best interests or may not. From OP's post, there's a reasonable chance a GAL might agree that OP's stated desires are in their best interest, but they might not. In other cases, a child's stated desires may be wildly at odds with their best interests.\n\nThat is the nuance that the commenter was trying to convey.", "Technically, most courts view money that minors receive as belonging to the parents, which is why I didn’t focus on that. I focused on what falls under the child abuse & neglect statutes. (I used to do CPS investigations)", "I wish I could upvote this twice.", "Yes, exasperation, feelings of unfairness, but not the shitty behavior exhibited.", "I bet you bob doesn’t even plan to help his step kids with college. If he was all he would do is move the money from step kids to his kids so that they can get an extra boost. Nope… he’s just mad that he can’t continue to leech off his step kids", "They are paying for both sisters' tuition. Just not Bob's kids.", "Also if he wasn’t a raging asshole, he could see it as now not needing to pay anything for 2 out of however many kids, so he has more to go around for the rest. But he probably never intended to pay for any of the kids anyway, or at most only intended to pay for “his” kids.", "I think the two girls would much rather have their father. Those step siblings have something priceless that the two sisters have lost forever & cannot be replaced with college tuition.", "Bob is not a nice person.", "Abusers are great at boiling frogs. They're all sweetness and light during the courtship phase but once the ink is dry on the marriage certificate the temperature in the pot starts to rise. By the time the frog starts to think maybe it's time to hop out of the water they have a couple of kids with the abuser, limited access to money (if he's taking his stepdaughters' money you better believe he's taking hers too), and has very likely been broken down psychologically by their abuser to believe that they're useless and stupid and will never be anything without their abuser. \n\nThe threats don't have to be obvious. There doesn't need to be a hand raised. The frog will compare their relationship with others and think \"Well, they never hit me or the kids,\" or \"They're a good provider, I should be grateful for what I have.\"\n\nThat's the long version. The short version is that it's not always the abused parent \"sacrificing the well-being of their children for a significant other\". It's much more complicated than that.", "There's a woman like this, Brianna, who has been sending nudes to my brother (who is engaged). She's a single mom and my brother has donated toys to her kid because he loves the kid... Brianna is desperate to have him and my brother hates how unfair it is that he can't help the kid without the mom thinking HEY LOOK A NEW DADDY", "Or stick in the abuse herself too. I wouldn't expect a seventeen year old to necessarily be able to recognize that", "If you have some time, I recommend this: [Link](https://old.reddit.com/r/BestofRedditorUpdates/comments/zmzs61/the_story_of_oops_very_entitled_inlaws_part_1/) It's a wild ride.", "Who is next, stepdad or uncle?", "Now that’d be interesting to see come together.", "Now we just need the step-dad’s POV, then his kid’s POV and we got a nice script for a drama movie", "I'm in Utah and this is so common, the \"Utah much?\" made me laugh so hard, I snorted.", "Yep. And then of course there is the financial abuse forcing them to give their siblings money. Emotional abuse since I'm sure Bob has said things about them in the past, not just this time. I bet screaming is not an uncommon occurrence for him. Plus, mom has chosen AH Hubby over her kids.  \n\nSo glad they've got the uncle's", "I'd consider it abusive in any situation in which food that is available is denied. (Legally, may be a different story if that's what you meant)\n\nIt's different when you're in a place/position where you literally can't feed your family, but when the food is readily available and you deny it as punishment, that is abusive.", "True but also if parents claim \"tough love\" they only have to leave a canned food a day and a sleeping bag in a covered area. \n\nSauce: I was that kid. (In California at least in 2004-2006.)\n\n Edit to mention that was when I was 14-16. If I wasn't home in time, about 8pm, door was locked and I was left with the latter on the small back porch of the apt where when it rained half would be wet bc of rain and wind, half covered to sleep under. It was treated like a controlling teaching moment for a rebelious teen. I hated it and basically lived off the streets and in trouble instead but when i had to id go sleep there. But then the one day I had friends over and fired up the lil bbq and made food to where the neighbors above asked me to bbq for them too and then fed us more and friends slept over on the porch it kind of ended bc I wasn't supposed to have fun or enjoy it. Ahh the days. Bad memories bad times but also good memories good times since I lived to be able to tell about it. Now random redditors know more than a lot of pple I'm closer with now at 32.", "Even government funded colleges are expensive in the USA. Other countries have free or low-fee colleges to a greater or lesser extent.\n\nAnd yeah, I agree about the attitude many Westerners have towards their kids. There was a big flap about Asian \"tiger mothers\" a few years ago, and while I don't always agree with their methods, I have to admit the kids know they always have a home and someone to care for them.", "It depends, where I live you can get an AA, AS and some other similar shorter degrees for low or no cost at community colleges, but even working full time a teenager with no education, little to no work experience would have a very difficult time supporting themselves as these schools typically have no (or practically no) housing, etc. But getting a bachelor's or higher is usually expensive (students may qualify for university grants for the school fees, but that doesn't cover living expenses, books, etc.)", "I did not realize that. That seems very wrong.", "Well yeah, hed still be an asshole", "My initial reaction to the \"unfairness\" of this is that it also isn't fair that these kids dad died, but here we are. Life isn't fair, and the uncles aren't obligated to make it fair. They're being very kind.", "Thats a good point. Them getting a free ride should be a benefit to the other kids if everything was fair before.", "Irl, yes", "https://www.reddit.com/r/AmItheAsshole/comments/yzqvu1/aita_for_refusing_to_help_my_step_sister_with_her/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "It's sad but as a guy in his mid 20s I see so so many girls my age with one or more kids desperately looking for a step-dad. It was a little off putting at first I thought Gen Z might hold off on having kids. Apparently not.", "Thank you it was a fun ride 😊", "Unfortunately, financial abuse isn't really a thing for minors, at least not in California. Withholding of food and the screaming are definitely abuse. Minors have very little legal right to money though, especially for things like allowance, birthday gifts, etc. It's only an issue for things like trust funds and contracts as far as I know. Those never came up when I was writing child abuse court reports though.\n\nThere definitely should be more protections around minors money.", "I would argue it’s theft not financial abuse", "That's horrible ! I see so many people saying they are in their 30s and still paying up those loans. This and having to pay for ambulances and health care thing really makes me wonder how USA can call themselves the first world. I know so many so called third world where they have free / low cost education & healthcare facilities. To think so many ppl like me used to dream about 'escaping' to America when we were kids so we would have a better life....", "Minors have basically no property rights in the US.", "Ahhhh I guess I missed that.", "This^ my mother stole any money I had and I could do nothing about it legally. Turned 18, pulled out the $20 I still had after three years of trying to save, closed the account and never got the money back after so lonh", "Maybe not from a legal standpoint but from a moral standpoint, it's still abusive. Imo anyways", "There are many things that are abusive that are not illegal, unfortunately. The laws don't always match the reality of the world. \n\nThere should very much be better protection laws for minors and money. Agree with you there. Because theft of money by trusted adults is damaging to kids.", "I just paid off my student loan last year, at the age of 52. I'm in New Zealand and my loan wasn't massive, but neither were my earnings.", "WOAH WHATT?!! I'm so sorry,it's so sad we live in a world where education and healthcare are luxuries rather than basic necessities.", "Your mom is TA for bringing that abusive prick home.   You are not. Thank you for protecting your sister and getting you both to safety. \n\nYour mom and stepfather should have been overjoyed that they could focus their resources on your step siblings and not have to worry about sending you to college. \n\nIt is also never excusable to deny a child dinner because they showed up late.  It's okay to say that the main dish was gone. But you could have a peanut butter and jelly sandwich. It's not okay to starve you. You should have gone to your uncle's a long time ago about this abuse. .", "NTA. Your mom is a coward. She allows a man to come into your home and abuse her kids while she does nothing. Let her cry. The fact that you are both minors that left home and she did nothing to make you come back tells you all you need to know. Stay safe with your uncle. I'm glad you girls have someone in your corner", "Didn’t the mom post her version recently? Trying to find it.", "NTA.\n\nFUCK Bob.", "NTA you are so right, that man is abusive and your mom also, because she doesn't do anything to stop the abuse 😭😭 your uncles are so cute and nice, I loved them. Stay with them plz", "Nta. Your mom choose a man over her daughters. That hurts but it is what it is.", "NTA OP and may I suggest if anyone else haven't, you and your sister **need to STOP** telling your Mom and stepfather anything that your uncles do for you two, especially if have anything to do with money/finances.", "NTA - you are spending Christmas with family. Your mother never should have let Bob have so much control of your lives. Make sure to give your uncle's huge hugs for how awesome they are.", "So extremely NTA not even funny.\n\nSeems like your uncles are way more family than your mom.\n\nAll the best.", "NTA dude has issues. Needs some anger management.", "NTA You are never an asshole for doing what you want to do.", "NTA", "NTA, and proud of you for taking steps in the right direction for you and sis.", "NTA \n\nThe money your Uncles give is 1) theirs to give to whoever they want, and 2) coming as support from your dad, who has nothing to do with your half and step siblings\n\nPlease tell your Uncles everything if you haven't already. They seem wonderful in banding together to fill as much of the hole your dad left. \n\nStick to your guns, get your Uncles' support, and whatever else necessary to distance yourself from Bob including legally.\n\nAlso, how much contact does your mum have with your Uncles? Why isn't she putting a stop to any of this with Bob?", "NTA she’s got some nerve asking you to come and carrying on like she is when she did nothing to stop her overbearing husband from mistreating you.", " NTA \n\nSo sorry about losing your dad at such a young age.  Having lost my dad when I was a few years older it changes everything. \n\nI am guessing your uncles are your father’s brothers.  \n\nRegardless Bob sounds like a prince of a guy as applies to regimenting life for children. And then to insist that money you were given by your uncles had to split with his children including your half sibling. I wonder if Bob also insisted on that equitable distribution when it was his children receiving anything. And your mom being in lock step with Bob is disappointing. \n\nYour uncles owe nothing to Bob’s children including your half sibling as they are no relation to them. \n\nI think you made the best decision in leaving with your little sister to live at your uncle’s.\n\nAnd I would encourage you NOT to visit your mother’s and Bob’s for any reason unless you want to be subjected to more screaming or possibly being prevented from leaving.  I also wouldn’t meet with them anywhere without your uncle going with you. \n\nAlso if you are in the US I am wondering if you and your sister are entitled to collect social security benefits.  Your uncles would likely know or could check. \n\nI am sorry your mother had made the choices she did to relinquish how you were to be raised to Bob. However she made that bed and now she can lie in it.", "Your mom is TA for letting Bob be that controlling. If Uncle David will let you, you should continue to live with him.\n\nYou should cut Bob out of your life and explain to mom that you will not be seeing her until Bob is out of the picture.", "NTA", "You should spend Christmas with those that matter the most to YOU. Sounds like you’re there. NTA", "Exactly. Bob’s kids *have* a dad. I’m sure OP and her sister would rather have *their* dad living than material things/ funds, but this is the reality of the situation. Bob is an AH. And so is mom.", "Hijacking top comment, but I’m pretty sure I saw the same post from the mothers pov a few days back. She portrayed herself to be a much better person than what she comes across in this post", "I could not agree more! The SF is an abusive jerk. The fact that he could handle these girls being loved by the late fathers brothers( I assume they are paternal uncles. ) is asinine.  He should be thanking his lucky stars he isn't going to have to pay for these poor girls tuition. It's less money out of his pocket ( which he obviously covets).", "OP’s mother let her second husband withhold food from her children, that says a lot about her idea of family. OP needs to get anything important that’s left at her house (such as birth certificate, social security documents etc), accompanied by their uncles, and then leave it for good.\n\nIt’s telling OP doesn’t say anything about the stepsiblings in terms of an emotional relationship, just that their father is adamant in playing equaliser at least as far as what OP and their sister get. I wonder if he’s willing to do the same when his kids being in money.", "I wouldn't use the word 'parents'.\nOP has one parent who is spineless and one step-parent who is an AH.", "Forget Bob and your so-called mother. Not only on Xmas, but 365 days a year.\n\nHome is where you feel safe, wanted and loved. This doesn't _have_ to be your parents house. I'm glad you do have some great uncles to look out for you.", "If they received scholarships, would Bob have hounded the university to share it with his kids as well?\n\nNTA", "I would be really glad if OP reads this and the mom post and, after that, the husband is kicked out for being the real asshole.", "I was looking to see if anyone else connected the two also!", "THANK YOU I knew that someone would post it. Got like halfway through and was like ‘this sounds…..familiar’", "Yep that's it, commenting and upvoting so op can see it. NtA op, you jabe no reason to feel this way about someone being in the fence of protecting you.", "Wow their mom sure left out a lot of details, huh? She's either in denial about the abuse or purposely left it out to win a NTA vote. Regardless, why didn't she want AH Bobby to involve authorities and get her kids back? She either doesn't care as much as she alludes or she knows she would lose them because of her and hubby's abuse.\n\nOP - stay where you are and never meet with Bob or your mom privately.  You have a much better life ahead of you.", "Holy fuck. I’m convinced. That’s mom’s post right there.\n\nAbsolutely heartbreaking. This poor family.. these poor kids. And Bob is a complete asshole. I don’t blame OP one bit for not wanting to go back. After reading the post, I do feel bad for mom, but she’s made her bed and now she has to lie in it.\n\nOP: NTA. Merry Christmas. I’m sorry it has to be like this.", "Not to mention, I very much doubt that Bob took money from his own kids and divided it equally with OP & his sister.", "By “your interests” I meant what’s in OP’s interest, as in their best interest, not “your every whim and desire” but yes I see how I could have been more precise. \n\nObviously a child who prefers no curfew and no homework isn’t going to be awarded more time in the home that allows that.", "Glad to see the uncle was able to step in and tell Bob to fuck all the way off.", "I was thinking this is the same family as I was reading it too!!! The mom was deemed the AH for siding with her husband and never her kids!", "Thanks for linking. Kept thinking \"I've read this story before\".", "I totally thought of this post when I read this AITA.  Wouldn't surprise me if it's the same family.", "Exactly.  My kids aren't old enough to be doing extracurricular activities (they're toddlers), but there's PLENTY of nights one or the other flat refuses to eat their dinner and then cries that they're hungry when it's bedtime. I don't, and never will, deny them food, even if I'm pissed that they didn't eat dinner. Now, I may not get out the leftovers, serve them up a full plate and warm it up again, but I'll at least make them a pb&j sandwich and a glass of milk. But they never go to bed hungry and never will.", "Do the Uncles know this happened I wonder? It seems like they don't but not enough info in OP. At least OP and sister are  happier now at Uncle's house.", "The only thing that doesn't necessarily seem consistent is the mention of a divorce in the linked. Its not explicitly stated here, and when I read it, it sounded like OP's mom was widowed, rather than separated beforehand. But, that may just be me making assumptions", "Anything here can be fiction, but Reddit is also mainstream and this is the kind of thing people would post on throwaways, so I'm not sure if that makes it that much more likely than usual.", "Yeah but based on what op says, step father isn't exactly being a father...he's basically putting down rules and offering none of the positives of having a parent, then dares to tell the kids that their uncles should share money amongst kids that they have (likely) no relationship with? Probably bc of the step father. Seems like he only cares about the uncles being family when money was brought up. \n\nI have family that have ruined familial relationships over money, and this guy sounds like he'd be one to do the same. I mean damn, he took money given to the two kids and shared it amongst his own. And now is telling the two kids that they need to \"share\" money from two people he has no real relation to for his kids who are, again, not related to the uncles.  Definitely NTA for op, who obviously seems to be in a better situation now. If the mom was really worried about spending time with family, she could take time to visit for Christmas Eve or day, whichever one she isn't doing with husband and step kids.", "Common courtesy is always expected, regardless of relation status. My sisters side of the family were always nice to me.", "Yay for Uncle David and Uncle Alan. They deserve a huge hug from the internet", "yea, i had plenty of times where i came home late due to practice for a lot of extra curriculars.  my parents just left a plate of food out under a pot lid and I warmed it up in a microwave.  its not hard and didnt cost them anything as thats the food i would have eaten anyways.  plus, how the fuck am I supposed to do well in school and sports if im not eating.  any parent that denies food just for coming home a little late is a control freak.", "Being denied food was the reason I was put into foster care way back in the 80s. Emotional and psychological abuse weren’t enough, but my being more than 40 pounds underweight was.", "He steals their money and OPs mother just allows it. I'm glad they have people they can rely on.", "I think that's it. It's the loss of control he is angry about. That he can't hold paying for college over their heads and demand they do what he tells them.", "In my area GALs are also family law attorneys and charge the parents ~$150-250/hour. It's not a good system and many cases sit dead in the water after a GAL is appointmented because no one has $3500 for their retainer.", "No idea, it's the Internet so I take everything with a pinch of salt.", "I just treat this sub as a drama equivalent of /r/nosleep. It’s all fake but we play along.", "Yeah...I suddenly smell bullshit.", "Oh geeze that’s my mom. Didn’t feel like she could do it on her own so she always had a boyfriend helping out. One of them was around for years and SA’ed me on two separate occasions while she was out of the country. These moms really think they’re helping their children by giving them another “dad.”", "Here it's said their dad up and left first, and then later there was his funeral - seems like it lines up, but OP experienced it differently from OP's mom/it wasn't fully explained to her at the time", "Exactly. Now he can put more money towards his kids as he doesn’t have to pay for his step kids’ education. How would this not be a good thing?", "You're so right on the doing well part. Proper nourishment has repeatedly been tied to succeeding in school. Like study after study after study. Denying a growing teen and/or kid proper food as punishment is denying them a chance to succeed.", "Lol as another asian-in-asia (Indonesian) our parents very much dictated the combination of college, major and whether we're allowed to live alone or not while attending that particular college, that they're willing to support us for. I lucked out and the combination I wanted was approved, but my brother had to choose a less ideal arrangement so he was approved to move out. (and after all the controlling, my brother got played into paying for his own shit after he got a part-time job in his second year anyways. oof)\n\nPublic govt-funded colleges exist are prestigious and significantly cheaper, but to get in is a long arduous lottery (that me and my brother refused to participate in). Additionally, the quality of \"traditional\" majors tend to be way better than something more recent tech-based like CS. So for select majors, private institutions is the way to go. ETA: also if you don't have the money and didn't lottery into public unis and wasn't able to get a scholarship to a private uni? You're fucked because student loans don't really exist. Go try and work for a couple of years and maybe return to uni once/if you saved up.", "We have \"community colleges\" which are typically 2 year schools.  You can go there a year or 2 and transfer to a regular college.  Or after 2 years, you can get an Associate's Degree.  It's cheaper than a 4 year school, and most are commuter schools, so the students live at home and not in dorms.  But they still aren't free", "Universities used to be free in the US, until they decided (at the urging of then governor of California Ronald Reagan) that they needed to keep Black people out of college, so tuition was charged to keep \"undesirables out. Now we have a system where it is extremely expensive to go to Govt colleges.", "What the hell was all that? Man, people sometimes can be stupid as a koala", "“This is a delayed post from dad from 2011… I write to the future, which I have been given visions of, to speak about this hot goss”", "Uncle - or a step sibling! \n\n\nUncle - aita for getting involved in my nieces lives. \n\nStep sibling - aita for wishing my dad dies so I get a free ride to college?", "Reddit Roshomon", "Tonight on lifetime, when a father dies, two sisters and their uncles come together to grieve, while the step father plans his revenge.", "I grew up in Utah and occasionally I am horrified to hear an \"oh my heck!\" slip out of my own mouth and betray my Utah-ness lol", "Right around the first time he needlessly withheld food from a child was when he legally became an asshole.", "Not to mention losing their shit on the kids over something somebody else did. How many times have they been berated for shit they have no control over?", "Your parents sound insane", "Brutal.  So glad you shared, no kid deserves that. No adult having gone through this should keep it bottled up.  Truly courageous to share, so health for the noggin too.  I don't know you but feel proud!  Weird maybe but true. All the best 💖", "there was a time that government funded colleges were very affordable in the USA (the 60's and the 70's).  When inflation hit in the late 70's the universities started raising tuition, and then there was a fundamental shift in the 80's away from govt support/funding for lots of things (thx for nothing Wall Street!).  The pendulum has never swung back the other way, USA is still more about corporate/business greed and anything goes capitalism and not social welfare.  So just like healthcare higher education in the US is very expensive now. :-(", "I'm all for teaching kids to be independent but  making teens work (that too full time) while they pursue a degree is a bit much imo. I dont get parents who demand rent from their kids inorder to teach them important life lessons. Like damn,teach them to save that money for future or take that money from them and put it in a fund and give them back in future. I have seen many teens talking about how their parents behaving like strict landlords and having to carry that burden along with academic struggles.", "It's totally different here,private institutions are the last resort. Students have part time jobs but only very poor ones and they many times take long leaves to support their families. Even low class families sell every thing and fund their kid's education. \nBut that controlling thing is the same here,everyone wants their kids to be a doctor or an engineer,other career options simply don't exist.", "It is wrong but the arguments is they don't understand which is badly outdated. It is also why the world of child acting is so horrible in the USA", "Sadly, parenthood is basically legal slavery in most countries. #youthrights", "Ooh, yeah you nailed it with the step sibling.", "At least the Uncles are in charge of college/living funds and there is no way that OP's Mom and Sf can get their hands on this money.", "theft by a parent from a minor is financial abuse. because there are many abusive aspects.", "For what its worth the rising costs of tuition aren't as bad for community colleges but predatory loan schemes and private universities have driven prices up to unaffordable levels for many Americans.\n\nThere absolutely should be more government protections as to the interest rates offered and when interest is allowed (deferment can help or really hurt, especially as I understand when it comes to >4yr degree programs)\n\nSource:  recently finished paying off my second round of student loans.", "Completely agree, adult responsibilities should come with adult freedoms and you can contribute to the household in other ways; for example, I took over the bulk of the grocery shopping once I could drive. The cost of college has gotten outrageous in the US; once upon a time (as in before I was even born), tuition in my state was free for residents at any of the state schools, if you wanted to go private or go out of state then you had to figure out how to pay for it.", "Yeah it's very common for relatives (or sometimes even neighbors) to pool up money to send a kid to college here too.\n\nPart time jobs are not as common as it is in the west, but still fairly common. Lots of folks ran little side businesses selling cookies online and whatnot, or took on freelance jobs online as I did.", "You’re absolutely right. It just sucks that there’s no legal recourse for that kind of stuff.", "Damaging in many ways", "I worked a paper route for 3 years and never saw a dime of it unless i didn’t turn in money from collections.", "At least we have socialised medicine here.", "NTA, stepdad Bob should learn his place.\n\nWhen my mom remarried, my stepdad never felt the need to replace my dad. He chose to be supportive but not authoritative and because of that I love him more than anything.", "NTA, mom made her choice now she has to live with the consequences. She allowed her husband to let you go hungry and steal your money. She was even going to allow him to steal your future. You owe them nothing and I wouldn't trust that so called step dad. Don't go to that house without another adult family member.", "NTA. Your family are your greatest inheretence and “Bob” is trying to lay claim to it. Your uncles saved money for you and and your sister. If bobs family had the good will to also save money for you and your sisters college education that would be one thing but they didn't. “Bob” clearly just wants to lay claim to your inheritance as a dowey and your mother is too weak to challenge that. \n\nI genuinely think that “Bob” is less than a man and your mother is an awful weak person for indulging him. I hope you individually send them both this thread tomorrow so they have something to read over Christmas dinner in your absence.", "I don't cry easily. But holy shit you poor poor kids. You stay where you are loved and you enjoy the love your uncles give you. You've been through too much for this. Keep your sister safe and close.\n\nNTA", "NTA. You ARE spending Christmas with family. Your mother had plenty of time to step up for you and didn't. That isn't your problem.", "NTA- \n\nYou did what any big sister would do: protect her younger sibling and protect yourself. You're clearly were living in a toxic environment and have two loving uncles that just want what's best for their nieces. Don't go back. If your mother's new husband is being that way with you, doing things like denying you food, controlling all your funds...etc he might do something stupid and dangerous to both of your well being. I'm sorry you had to grow up so fast and make decisions like these so early in life.", "First, I am so sorry that you lost your father. My kids also lost their father very young and it was devastating. You are NTA, but you should know that since your father died, you and your sister were probably receiving Social Security Surivors benefits with your mother as the payee (and your younger sister is probably still getting them paid to your mother.) That means that your stepfather and mother have been spending money that should have gone on your needs on their other kids. If your father had any assets that were his solely, those are also yours. The fact that this petty man stole even your tiniest of gifts makes me think that he was getting however much a month because of you both and still denied you food. Have your uncles petition the court to have guardianship, and any Social Security Survivors benefits paid to them. Best of luck.", "NTA. Bob is the asshole here, and your mom too for not putting him in his place (for a parent, kids should be priority over lovers).\n\nI whish you all the best. May you heal from all that trauma you're describing here. I bet your uncles will help.", "NTA and enjoy yourself with your family THAT LOVES YOU.", "NTA. I feel like I’ve read this here before", "Thought I recognized it, this one is probably a fake", "Agreed, get a lawyer and GAL. I’d ask your uncle to get custody regardless so your mom doesn’t come after you later.", "Not parents ….. Bob and her controlled mom.", "Something I see a lot is that people hate the enabler even more, because they want to look like the good guy without ever doing anything to help.", "No one else has the balls so I'll just say what we're all thinking...OP, your mother actually already posted and was voted NTA; if we couple that with today's NTA then that only leaves Bob and the uncles as possible candidates. Hopefully we hear from one of them soon so we can clear this all up.", "fits too well.", "Making throwaways for shit like this is normal.", "Like he would have, what a joke. He wouldn't have given them a dime. He'd have said, if you want to go to college figure it out yourself. He'll probably tell them or would have, now he won't have the option to do it, once they got out of school and got good job, said, they'd have to give him half their salary to pay back all the money he spent raising them.", "Former foster kid here. I had a GAL to advocate for “what was best for me” and I also had an attorney to advocate for what I myself wanted.", "I think that’s easy to say as a knee jerk reaction, but she’s probably being abused too. I’m absolutely not condoning the mom’s actions, just pointing out that it’s not that black & white.", "it might end up on my animated stories on youtube", "I mean.. a couple of those sound pretty reasonable. If I'm paying for my kid's school, they should damn well come out in a better position than when they went in. If they want a major with no ROI, then they can pay for it. If they aren't keeping their grades up, they can pay for it.\n\nIf anything, it's financially abusive for a kid to expect mommy and daddy to bankroll a bullshit major that you don't take seriously and a party lifestyle.", "There is zero jurisdictions anywhere in the world where a Guardian Ad Litem advocates for anything but the *best interests* of the child.", "I honestly hate way more the parent that willingly not only subjected their kid to such an environment but actually partakes in the abuse.", "0%", "You might need to reread that.", "Oh wow! Saying heck instead of a swear word is a very Utah Mormon thing. No offense!", "Not saying it's not fake but throwaways are really common for stuff like this.", "I couldn’t agree more. A person can be an abuser and abused at the same time. Very sad situation all around, and certainly not all black & white.", "Time for your brother to block her.", "I’m so sorry that happened to you. 🖤", "Perhaps not. I worked with abused women. They would take a lot, but the impetus for leaving was usually when abuse went to one of the kids. \n\nAlso, I am sure her former BILs would have helped her get away.", "On some level I knew this.  It's clearly abusive behaviour to deny your child food, right?\n\nBut when that same thing happened to me at the same age, I just accepted that was it.  That there was no one who would say my parents /had/ to give me food.  No one to tell on them too, who would listen. I was late or whatever, so I ostensibly made the choice to not eat. \n\nIt's weird how you read a thread like this,  sitting on the toilet one day as an adult and suddenly you realise another piece of what you thought was life was actually just as abusive as being beaten.  \n\nThe power adults have over children is incalculable and how we just accept it will always unravel me.\n\nSomething new to share.in therapy now, I guess", "Bob, and the mother in particular, are imbeciles. I don’t even know where to start…", "Half true as resources exist within counties to appoint domestic relation officers as GALs at no cost. I have a few cases with free GALs. And a few for $300 paid to the county.", "Haha, yeah that's a good analogy. I upvote/downvote posts on here depending not on whether OP is the asshole or not but whether the post is a good ethical/moral dilemma and a lot of the time the posts are not. This one included.", "Yes but with zero engagement it’s more suspect to me.", "To take it even further, I would say that it is unfair that *both* children will have to rely on complete financial aid from, I assume, the step-father. Now, at least one of the children will be taken care of, education-wise, lessening the burden for the other child.", "Right? Its like \"I don't want kids of my own, let alone someone elses kids\". Plus like it or not, but the baby daddy is going to be part of your life now in some capacity...", "All good points for sure. And always good to have discourse about this stuff to spread awareness and understanding. Leaving an abusive relationship is never simple or easy.", "Could tell it was bullshit as soon as they got into their money and how much they had dished out to people.", "And mom says they have to spend Christmas with family.   Looks to me like they very much are in more ways than one.", "Is a double edged sword, but the fact that judges have leeway to do what they see fit in family court is an advantage in this times like this - is not *illegal* but whoever sees the case may very well decide that the girls are better under their uncle guardianship.", "Yup this is true. I had to start cashing my checks and “gave” my money to my friends. my mom couldn’t pursue legal action because I had already given the money away and she couldn’t get it back", "My dad had got full custody of me and my 2 younger siblings because my mom was actually the insane one, hah. But that's a story for another time. I forced his hand to have to do that honestly it probably hurt him more than me at the time. I was fine doing what I wanted instead of doing what I was supposed to be doing. I do still wish I would have done right and kept my life on track at the young age but it is what it is.", "Thank you", "Omg, I am so sorry. That hurts my heart reading what your mom did. I want to give you the biggest hug ever (i realize you more than likely would be like “ummm no thanks weirdo” haha), but it crushes me that someone would a put a child through this. \n\nYou’ve clearly been a very smart cookie from a young age to figure out the loophole in the system! \n\nI hope all is well now with you?", "NTA, that house stopped being your home when your mom started choosing Bob over her own daughters, there is no way that she could have ignored everything that was happening all this time with Bob.", "NTA. You go to Christmas under the guise of being a family together, that’s how they’ll rope you in and keep you under control. Stay away from them. \n\nAnd u/newbeginingshey has good advice in case they try to force you guys to come home", "I'm pretty sure the mum was on here telling this same story not long ago but I can't find the post.  \n\nOP's not the AH\n\nEdit: [found it](https://www.reddit.com/r/AmItheAsshole/comments/ys97jv/aita_telling_my_husband_im_not_going_to_tell_my/?utm_medium=android_app&utm_source=share)\n\n2nd edit.  Interestingly neither mother or daughter have replied to any comments.", "And cost them 6 grand for the privilege of being told to fuck off by a lawyer.  Source, mom was a lawyer.", "Nah, don't let the mom off like that. She's just as culpable. She's a grown ass adult capable of making her own decisions. \"emotionally manipulated\" my ass. Bob and the mom are shit stains", "I'm not saying they are or they aren't but why even bother reading and posting here if you think everything is fake? You know you can just filter the sub and not waste your time.", "This, as well as the money taken away, and divided 'equally'...\n\nWhy would they not feel relieved that two of their children are completely taken care of education, meaning they have two help out two kids economically. OP said there were also some step- and half-siblings, so there might come some bills and spending.\n\nOP could tell her mom they ARE spending Christmas with family, the ones that had their back and supported them the most, when they needed it the most.", "Or money uncles gave them that was take and given to step siblings.", "Right? Denying children food is child abuse, plain and simple.", "Tell my first STEPMOTHER withholding food is ILLEGAL! Then she expected to be able to carry on like everything was normal, carried RIGHT ON with the beatings (Belts, switches, Dad had a paddle made when she kept bitching about how my brother and I acted)\n\nShe'd be 72 now with a family history of short (early 50s) lifespans. I have prayed for 30 years she follows suit and goes to a particularly TERRIBLE corner of Hell.", "And WTF was her mother thinking???", "Yes, thank God for the uncles!", "Yup, exactly.  I just wish that my kids' attorney actually interacted with them more.  They've spoken to their attorney maybe twice in the 3 years I've had them.", "Whether or not this particular story is real, there are absolutely tons and tons of real stories of real kids with real abusive parents and step parents who really do shit like this.\n\nI like to hope maybe other people in similar situations can see stuff like this, see the answers people give, and without making their own posts, get the help and guidance they need.", ">I'm not saying they are or they aren't but why even bother reading and posting here if you think everything is fake? You know you can just filter the sub and not waste your time.\n\nBecause it's bullshit people writing fake arse posts that ruin the sub.\n\nThat is why fake posts get removed.\n\nIf the mods were fine with fake posts, shitposts, then they wouldnt remove them.\n\nIf they have a problem with fake posts, then it's perfectly fine for commenters to call out fake posts too.", "Holly shit! What happened to them was insane!!! \n\nAll because they decided to share their good fortune with some friends and family! Wow! I’m completely speechless. It’s been two years, I hope they were left alone and that things have gotten better.", "We will be hearing from the deceased father next.", "I think it’s because mentions of offing oneself are banned on this sub. That’s why OP talks about it euphemistically emphasizing the voluntary aspect so that we understand that it wasn’t an accident or an illness. (And that’s why I’m not using the more common/polite word.)", "While I personally agree, as any logical person should, it may still depend on the State’s Departments of Family Services specific regulations. \n\nWhile my father was being investigated by Child Protective Services, for the third or fourth time, we were told that I only needed to be provided one meal a day to be considered “fed” and not abused/neglected. And that meal could be at home or at school, didn’t matter. We had lived in other States and other countries where that was different, but in a certain states we lived in, him withholding food from me—as long as I had eaten at least one meal that day, was perfectly acceptable to Family Services. \n\nI still find that insane today and it’s been nearly 20 years.\n\nEdit: deleted a redundant word.", "40 pounds??! How long did that go on?? \n\nYou don’t have to answer that if you’re not comfortable but, that’s just horrible. I hope you are okay now", "*Because the uncles cannot make such a big decision without the support of their spouses & kids which is such a refreshing change from what we usually see.* \n\nThat is the absolute truth and I'm so glad that you stated it here! Like most of us here I've seen situations unfold and the parents express shock at how things happen. Never accepting or owning that their neglect and abuse of their own children created these hurtful, tragic events.\n\nSo sorry you had to go through it, too, and hope you're able to surround yourself with wonderful people now that support, uplift, and take joy in your friendship!", "> Plus, mom has chosen AH Hubby over her kids.\n\nI swear 90% of the stories here are like that and it's shocking and sickening.. Both sexes do this with their SO and leave their kids behind.", "This, and to add: mom has not only chosen AH Hubby over her children, the two chikdren she had with her deceased husband, she has also chosen her AH Hubby's kids and the kids mom had with AH Hubby over OP and her sister. They are losing it on every front, even from the children that aren't 'biologically*' related.\n\nI'm all for supporting own and step-/bonus-children to the same degree, but when a child is in need of protection, their (legal*) parent should be there for them to do everything in their power. Mom is as big as an A as AH Hubby, maybe bigger.\n\n* I doubted which term to use here. At first, I was going to write biological, to make a sharp distinction with step-parents. But it's not the biological part that I mean, and would like to put in words, that contradicts with being a step-parent. It's about the adults that have chosen to be in your life, the ones that are there for you when you need them to protect you in every way possible. The ones like uncles that made sure they're okay. \n\nStep-parents touch some sort of new dimension in the relation between children and their parent figures. They do so in all kinds of positve and negative ways. They can be the parent(s) you lost or never had, they can be the addition to the family a child needs. They can also be the living hell on earth, while the other one(s) ignore it or be complicit. \n\nAnyway, Merry Christmas y'all, didn't mean it to be so long, argh, those holidays can fuck with your mind regarding family...", "Yea that really shocked me..they don't get to eat even if they are 1 minute late..can't imagine how hungry you are getting out of school and then some sport practice..thats unreal and I am so sorry you had to go thru this. \nAlso splitting up the money not only the money they give you but the college money as well..yea that would have thrown me over the top too. NTA here by any means.", "kudos to you for not burning the house down with them in it", "State by state makes a huge difference. California has some of the more progressive laws from my understanding but even a decade ago my county was a train wreck and we didn't have intergovernmental teams for things like Native American children to ensure they were getting culturally appropriate care and weren't being forced off the Rez because it was easier to find them a white family and resources off the Rez. \n\nIt's still a trainwreck compared to other, non social work departments and I don't actually work with the agency anymore. The pressure of doing four people's jobs was just too much when kids lives were on the line.", "It went on for 5-6 years, during my early teens. I was 6’1”, 135lbs when I was removed from home. And it was a very long time ago…", "It happens to child stars quite often. They make the money, and their parents get all the benefits. \n\nSome trivia: Jackie Coogan, the actor who played Uncle Fester on *The Addams Family* was a child star. He was 'discovered' by Charlie Chaplin, and was in *The Kid*. A wave of Jackie Coogan fanship launched all kinds of merchandise and promotions. When he turned 21, he came to find out that every single cent he had earned was gone. His parents had spent every dime. \n\nHe went on to sue his mother (his father had passed away) and agent, and in 1939 the first Coogan Law was enacted in California. It's been reformed over the decades. Now, child actors' parents/guardians have to provide a 'Coogan Account' to hold at least 15% of the minor's earnings. It's a locked, secured savings account that belongs only to the minor.\n\nThere are only 5 states currently with that type of financial protection for minors in their laws - CA, NY, IL, NM and LA.", "\"Dang, fetch, oh my heck, what the holy scrud?  H-E-double hockey sticks, that's frickin', flippin' crud!\"\n\nEdit:  If you know this reference, I am so, so sorry.", "I'm curious if Bob acts this way with his bio kids or just OP and her sister.", "Oh I know, but long term starvation can cause long term damage so…", "The uncles probably knew that was the only safe way. :/", "Long story, but I had an ADHD kid who rebelled raising the stakes over each punishment. The books I was reading said to set a consistent standard and consistent consequences was the best thing to do with ADHD. Instead, I decided to stop all punishments and all consequences. Instead, I just calmly talked to her about why I didn't like it if she did something wrong.\n\nShe got tired of rebelling against nothing and decided by herself to do better in school. She's now finished college with almost straight As, and has been working and independent having doubled her salary in 3 years due to promotions and trading up. We have a great relationship and can talk about things as adults.", "OP NTA\n\nYou aren't the asshole, Bob clearly is.\n\nYou are not wrong, your mother is despicable for going along w Bob's abusive environment.\n\n& you're not wrong because You ARE spending Xmas w your real/true- the people who actually treat you like family.", "Yeah actually! My mom was definitely battling some demons but she took her recovery seriously :) there’s still some bumps but overall we’re much better than we were", "Bob is crazy. Why would he think he is entitled to their money?", "I am so glad you mentioned this. Not to many people know what GAL does and how they are there for the children and not the parents.", "My god reading OP's post literally has me in tears. My dad died suddenly when i was 17, and that was hard, I cant imagine being 7 and 5 and going through that.. \n\nI agree NTA and PLEASE listen to /u/newbeginingshey OP.  What ever you do, do NOT go to your moms.... Its most likely a trap and bob will be on your ass like crazy to get the money again.", "Can her uncle adopt them to cut off any legal ties from the mom and stepdad?   There was also a similar story recently though not 100% the same but same vibe where uncles wanting to support the OP but stepparent was nuts and even IIRC screamed at the uncle? But that thread had a happy ending.", "[https://www.reddit.com/r/BestofRedditorUpdates/comments/z4bhvc/oops\\_ex\\_passes\\_away\\_after\\_divorce\\_exs\\_brothers/](https://www.reddit.com/r/BestofRedditorUpdates/comments/z4bhvc/oops_ex_passes_away_after_divorce_exs_brothers/)", "And how all the monetary gifts given to her and her sister were \"divided equally\" all these years.", "**Edited for clarity —There is a difference between a GAL and an attorney who is appointed for the child. Which could be sought in this case since the child is 15. The 17-year-old really is an issue because they’re going to be 18 soon enough", "He is an abusive lunatic.  I feel sorry for the stepsibs also.\n\n&#x200B;\n\nYikes!", "Yeah, at first I thought she meant divide it equally among the 2 sisters, but now knowing about the other siblings, I guess she meant all of them?", "Both can be true at once.", "The GAL is supposed to take an objective position about what would be best for the total development of the child.  They then take that position and present it to the court.\n\nThe attorney takes what the kid wants and puts it in legalese and presents it to the court.\n\nThe main difference is found if, for example, a child says \"I want ice cream for dinner every night, and a new PS5 game every week.\" \n\nThe GAL will ignore that.  No one would seriously take the position that ice cream every night is a good thing.  But the attorney works for the child.  So, if the child insists on asking for that, then the attorney will try to come up with a reason why the court should give the child ice cream every night.", "No way any of that is real.", "This brought me to tears - it resonates so much with me.", "Or anything the adults decide because they can fall back on these excuses no matter how bad choices they makes. And they do. :/", "I mistyped, I know what the difference is I’m sorry. I’m saying that they should seek an attorney as well as a GAL", "Because he wasn't going to pay for his step kids education. He was probably going to make them get jobs at 18 and pay him rent or be out on their asses. I'm speculating of course but it seems like something someone who takes money from his step children to give to his own children would do.", "Exactly as their father would have wanted it!", "The uncles were awesome and fantastic substitute fathers.  Bob is very much an AH.  As is their mom for never having their backs.  So much so that, thankfully, OP and her sister moved in with the uncles.\n\nAnd now she whines about \"But it's Chriiistmas!!!!\"  I think OP and her sister should never talk to their mom or Bob again.  Their mom made very clear who matters---Bob, and who does not --- them.", "Well... Yea. I mean. They're a separate guardian that's supposed to be more objective than either parent. If they're doing what's in the best interest of the child that doesn't necessarily mean what the kid wants. And they're still a semi outsider in the situation and can accidentally make bad decisions with the information they have available. Just like any one else", "Honestly, they should seek out their local CPS and explain the situation.  They will be granted a GAL, and probably an attorney as that follows through.", "Oh I know. I (and others) helped a former student leave her abusive husband. She ha a bunch of kids. It wasn't easy, but the night husband went after  their oldest, she began planning.", "There's no legal recourse as far as the kids being able to sue, but documented and presented as one of many things for a family court judge to look at will matter. It will be taken into account.", "I knew about Jackie Coogan Law. But am surprised more states do not have protection.", "my mom did the same. i babysat every single weekend from ages 11-14 for this one family. they would pick me up from school on friday and i’d stay the whole weekend and they’d take me to school on monday. and i’d frequently do weeknights too especially over the summer i was basically a live in nanny. and they would pay me $20 an hour for the whole time even while i slept because i would wake up with the kids throughout the night and get up with them in the morning early so the parents could sleep in. and i had a bunch of neighbors i would babysit for. i saved over $20k and bought my own car, but my mistake was that i was 14 so i had to put it in my parents name. \n\ni’ve always been treated differently. my older brother (4 years older) never has worked a day in his life until two months ago. he’s 24. he didn’t go to college. he went into the navy but it took him four years to lose the weight after high school while he did nothing but sit in my dads basement playing video games all day. and then he got kicked out for a vengeful act only like 8 months in. he didn’t do well in school. he didn’t do shit around the house. he did NOTHING. i did well in school, had 3+ extracurricular activities. i was working before i legally could and the day i could legally get a job they made me and i always worked the max hours i legally could PLUS did my babysitting and other odd jobs. my brother got a brand new lexus when he turned 16. a year later wrecked that. got my stepmoms hyundai elantra that was only a year or two old. wrecked that. got an HHR. wrecked that. then my dad decided to give him MY car. that i spent $14k on. and i had to buy another car all my myself. never got a car. i’m one of five kids and my younger siblings get the same treatment as my older brother. it’s just so fucked up. \n\nand there were so many times that i gave my parents money for safe keeping. the families i abbysay for usually venmoed me but i didn’t have a card so i would give it to my parents. after a couple times of them never giving me the money every again, i wrote a “contract” that we would update and then when i’d go to my other parents house they would just rip the paper up. doubt it would’ve held up legally anyways but i thought it would intimidate them. \n\nidk. i’m just always the bad person. and the one left out. and i’ll never understand because i’m the only child that even actually tries and works hard and has ever earned my own. it’s just so fucked up", "I mean,it is illegal. Most people who are emancipated are allowed to be emancipated because their parents were taking their money. Drew Barrymore and Francis Bean Cobain(to name a couple) were both emancipated for that reason. Parents taking money(either given to them by inheritance,or child stardom) isn't protected and is grounds for emancipation.", "No, girls, you’re already home. If mom prefers horrid Bob, let her have him and his kids all to herself. Neither Bob nor your mom has a right to control either of you. If need be, divorce your mom in court. At 17, and maybe even at 15, it shouldn’t be that difficult if you can prove that you’re not entitled to eat at your mom’s house if you get home after 7 pm. That’s child abuse.", ">we weren’t allowed to eat that night\n\nthat’s abuse. i’m glad you left. don’t go back. stay at your uncles as long as he will have you there.", "absolutely nta. I hope you and your sister live great lives with your uncles and their families.", "She chose Bob over you", "My mom chose a man who literally hated that she had children. He was allowed to be the disciplinarian. Similar situation - if we tried to eat after 8pm he’d flip out. I was a mouthy teen, but I was a good kid. Good grades, had a job, was in ROTC, straight edge. Anyway, I got kicked out at 16 and spent my senior year of high school basically couch hopping. Years later when I had kids, mom couldn’t understand why I didn’t want to have a relationship with her and it was a whole pity party. \n\nYou are NTA. Parents need to understand that the choices they make affect their kids. I can’t imagine a parent being upset that they didn’t have to worry about a huge expense for two of their kids. The step-kids/half siblings aren’t entitled to a gift given by YOUR family. You stay strong and your uncles sound like great men.", "NTA. Stay with the people who love you on Christmas day.", "NEVER!!! Hand over the money!! When I was your age my dad took money out of my account: the total taken was over 2000 dollars. Never saw it again. Take the money and go get your education.\n\nNTA", "NTA I am so very sorry I don’t even know what to say other than I am so sorry I can completely relate as I’ve lost my mother, but I’ve at least had her my whole life and 37 and just lost her two years ago. I could never imagine losing her young I don’t talk to my father, but I am so sorry and no you’re not the asshole. Your mother is.", "Wait. If you got home late you didn't get to eat that night? This is straight up child abuse. Good for you and your sister for getting away from this. If your mom tolerated that from Bob she's just as guilty for enabling this kind of abuse. You don't HAVE to spend time with a family that would do that to you.", "NTA sweetheart. Your Uncles are your angels on earth. Your mother should be ashamed of herself for allowing your step-father to do that. You, nor your sister, owe your mother anything just because she birthed you.", "This. You aren't refusing to come home for Christmas. You *are* home for Christmas. Your step-dad has been abusing and stealing from you and your sister for years, and I'm sorry for being blunt, your mom is just as guilty because she allowed it. NTA. Tell your mom if family is that important to her, she can put the family she had before this asshole crawled into her life first, for once.", "That’s almost always automatically done, but good advice.\n\nOh and NTA. You should’ve also told your uncles that you and your sister’s money was being split with people that aren’t his family. That’s theft.", "No bet. This is textbook. Ask me how I know.", "U/mokutou - You are an asshole to make such a broad statement.  Being miltary had nothing to do with it.", "Bob is jealous he makes less than everyone involved, other than the children", "Take a popular AITA post, post it from another view, rake in the karma. \n\nThis is just so fake it's sad.", "And I am now wondering if mom and stepdad are getting SS for OP and sib in their father’s name. I’m not sure how that works. what happens if they lose custody for abuse. OP you are NTA and you are a brave soul to go to your uncle. He is a rock star for helping you.", "Jesus, that's awful. I am so sorry.", "Respectfully, I disagree with you. I’m a single mom of many years. The single parents I know that push for the new partner will try to frame it as “the kids need a father/mother figure!” But truly, they just don’t want to be alone. Sometimes it’s for financial security, other times it’s to have someone help with the kids/housework, and other times it’s just plain codependency. They appear to be a good person by framing it as “for the kids” instead of what it is - their own wish/desire. \n\nI’m really sorry that happened to you.", "I suspect dad doesn’t make enough $$ to save for the kids (if the same dad as on other post).  My parents didn’t have the $$ either. .  I paid for myself and for my sister, and used assistance, such that it was in the 1960’s.  \n\nI think a huge issue is the dad doesn’t have ability to mental separate differences in the situation.  He’s rather rigid so understanding/appreciating the differences and paternal families may not be so easy for him - sounds like he was of a stern regiment in life.\n\nMom - you need to be a steady sort so you don’t lose the relationships with your children, and, have a good working relationship with the uncles.\nThis all in an effort to support the kids going forward.\n\nAnd OP - you two need to work with mom and uncles - this is not an easy situation but can dealt with in a positive manner with a bit of engagement.", "Yep. When I went back I realize she wasn’t the AH for FINALLY standing up to her husband.  In the end mom is an AH", "Oh! Good point!", "The stories line up a little too perfectly to not have been written in reference to one another. Beat for beat.", "I'm sorry this is happening to you. Keep looking forward! You'll be out soon with more life skills. Continue working hard and be successful", "JFC, you poor thing. I hope you have been able to leave your awful, abusive family behind. Ignore them, they absolutely don't deserve you. You clearly have the kind of skills, drive, and work ethic to be wildly successful in life. Please believe and invest in yourself, and get you revenge by leaving them behind and living your best, happiest life ever", "Ah and she is truly fair, the fairest in the land! Yes, let's go interact with her link and downvote this homely fool!", "I would be happy if someone did that for my kids. One less child’s education to worry about.", "I also agree with throwaways but they should at least comment something to seem less fake", "Mon deau! That was, a wild ride. Thank you internet stranger, for this story, on xmas eve.", "If it makes you feel better it's certainly bullshit.", "Not in Australia.  Most people take out loans  - which the government provides. Loan is indexed each year.", "I was, too. \n\nSome states probably do have stipulations to protect kids' earnings, but they might be under different family/child laws.", "It’s called favoritism. The child the parents see as being easy manipulative towards but this same child is the one that has that “get and go” about them, is in most family. I was that child in mine. \n\nHow my parents made a difference in how the boys were treated was not fair.\n\nMy father never ever taken any money from my jobs, but mother certainly has. It was to teach me a life lesson. My father, I’m sure was aware of this, but did nothing about it...hmmm...in hindsight, however, now that thinking on it, maybe dad didn’t know how mom was milking me of my paychecks since I turned 16. Dad was a professional that did a ton of overtime on the job and making a ton of money, we lived middle to upper class, dad given mom an hefty allowance every week, he paid all of the bills, she got to take girl trips whenever she wanted to. Mom was the one we had to deal with during the daytime and when living at home, I just did what she asked just not to have her constantly nagging me so much, because again, dad worked a lot, I’m just now realizing he probably had no idea of where my paychecks were going and I’m positive she never told him how she was taking my money, because of this, never had real spending money to do the fun things  peers gotten to do. My brothers worked, but they were allowed to keep their funds. I eventually left home and stayed gone. \n\nMothers life lesson taught me that bills come first always.\n\nBackstory, I asked dad years early if I can start working when turning 16 and he said yes, but mom said no. But dad said yes, and so I did. Mom made me start paying $200 in rent, in the 80’s, plus pay for my own food in the home, made me do most of the chores in the home, made me buy everything needed for school, books and clothing. I had to find my own way to work and back. Sometimes not getting off work until midnight, which in hindsight, was illegal. I worked for a major grocery chain and very often walked several miles home, because the buses stopped running before getting off work, but when it came to the boys, they were dropped off and picked up, could never do any wrong, allowed to parties and hang out, allowed to have friends over, in which they did a lot.", "I am absolutely appalled by your family's behaviour. I think you should consult a lawyer to see if there's nothing to be done to get the back for your car. Hopefully you don't live with them anymore and you moved far away. Your older brother is also an AH for even accepting your car after wrecking TWO other cars. None of these people deserve you and I pray you get 10 times more blessings in your life and that you find your chosen family.", "You bought a car at 14 ? :O", "That's so messed up that they did that.  But you sound like you have a good work ethic. I don't know how you are now, but if  kept up the same , then sounds like you are decently good. I hope you are doing alright. You did good on your own and earned that. I hope you are proud of yourself. You did more they have with less. Best wishes to you.", "Where are you located that has colleges as expensive as the US but also has socialized medicine? I'm assuming it's not the US because you're not old enough for Medicare.", "Ok then it's fake lol", "That’s true, mom was already voted NTA so by default we can’t pass that same judgement here…. If any of this was actually real.", ">Agreed. Especially the part about no dinner if you're home late. OP mentions that both of them have participated in extracurricular activities over the years. Those run late. How often have they been denied food?\n\nYou have to wonder what goes through the mind of a woman who would allow her new husband not to feed her existing children, for any reason! If I was in the mother's situation, any guy who did that would be 100% gone the first time! I also would never allow him to take money earmarked for my children! If Reddit is any indication, there are a lot of weak parents out there. They'll be the same ones sitting back not understanding why the kid goes no contact later.", "Because that means they will leave the house and they can't abuse them.", "The thing that makes me smell bullshit is neither OP or the mother is the previous post have commented on anything", ">Because it's bullshit people writing fake arse posts that ruin the sub.\n\nDoes it really tho?\n\nBecause how do you know its bullshit, because it just sounds unlikely or just to perfect? Like lets say I make a fake post on here it gets upvoted, commented on and all that jazz but I never come out and say its fake. Most people think its real and its deemed real but in reality it was fake. It drove conversations, and it drove people to the sub and maybe even other post for more conversations. How did that affect you negatively in anyway? \n\n\nAlso both these post are still up so that must means there not fake I guess. The almighty mods have deemed them to be the truth.", "Oh, you are so right!! We shouldnt even bother having ***anyone*** post, just have content driven posts, written by professional *narrative guiders*. Mayhap if they keep posting about certain things, then people will believe that, act accordingly and then it *becomes true*!! \n\n\nYeah, no. I prefer to interact with at least plausibly real people, and real content, or else you, and i, and everyone else may as well just be sitting here mentally masturbating because that is all it would be anyway.", "wow, given the extra info in both posts i think the mum might be in denial about how awful her husband is to her kids and honestly i feel a lot more sorry for her. she’s clearly not in control of the situation whatever angle you see it from. i imagine she doesn’t want to go through another divorce so she puts up with husband’s shit (that’s just speculation tho). i hope things get better for both parties here", ">The not giving you dinner if you got home past 7--that's straight out neglect/abuse in my estimation\n\nAnd in a legal estimation.  Guardians of minors are required by law to provide base necessities including food.", "There is no way they are different. The mom's POV honestly lines up with the girls POV. The stepdad/husband in this scenario is a prick. Moms not great for letting it happen either. She even states in her post that she,\"talked him out of calling the police and reporting them as runaways.\" Frankly, I'm not 100% sure how the police would handle the situation. They know where they are at, and they're in the home of another family member. I imagine with the girls being 17 and 15 it would be unlikely that the police would make them go back to the parents house if the kids explained the situation. That would only lead to the courts getting involved. I think in that scenario stepdad might have a rude awakening. I wonder how mom would react if she legally lost her daughters due to her \"loving and great\" husband. Commenters on the other thread had him flagged before this post went up. Hopefully mom will stand up for her daughters and shut step dad down. Im kinda disgusted she got a NTA on the other thread. She conveniently left out the things about dinner and taking their money. She even said she supported her husband in his feelings that her daughters were being spoiled and it wasn't fair to his kids. I wouldn't be surprised if mom was involved in all of the mistreatment.", "Well that’s great for you, but my mom actually just wanted the extra help, even admitted it to me herself. She never planned on remarrying. Instead of raising me herself, she had other people do it so she could pursue a glamorous singing career on the weekends. I get it’s hard being a single parent, but sometimes all your kid needs is you.", "I will never understand this American notion of getting a free ride through collage.... Education isn't supposed to get you in debt before you even had a chance at life. Education is supposed to be the tool to set you up for financial stability. It's not suppose to ensure that you're in shackles for life.", "\n>…. If any of this was actually real.\n\nGobsmacked that you could insinuate such a thing lol :O", "Actually, it's not. My ex's wife refuses to allow my kids to eat \"her\" food, even if there's no other food available. Social workers think this is perfectly acceptable because \"there's food in the house\", even tho the kids have told them they're not allowed to eat it", "I’m so sorry. It was wrong for anybody to treat you that way.", "I agree. He doesn't want to do that because it'll mean losing all connection with the kid. For now he's already told her to stop sending inappropriate messages, and he ignores them now (no response) unless they concern her kid\n\nI see this blowing up in his face because he's done this before, years ago, with an ex-girlfriend that he convinced me to hire so that her kid wouldn't suffer. She ended up trying to scam me and I had her arrested. The whole story was top of some revenge subreddit for a while... and it is weirdly, how I met the man who would become my late husband. Small world.", "Thanks for the giggle on this December 25 morning. Happy, warm wishes for whatever you celebrate in December, internet stranger.", "I wasn’t starved. I just didn’t get nearly enough caloric intake to sustain a healthy weight and be as active as I was.", "This is exactly what’s happening to me right now. I’m third oldest of seven. I was the second one to get a job during high school. Partial schedule and all that fun stuff. I was working as much as possible. Trying to save. Because of depression and no one doing jack shit for me about it, a lot of that money went towards weed. Not a good habit. But in total my dad has taken $3000 from me that I was saving. Plus on top of this my parents started making me pay my step-mom rent. And my job started stealing a good bit of my paycheck from me. About $600 total went to my oldest sister. Once when she was visiting the family. My stepmom asked me for $300 so she could go do stuff with my older sister. I got nothing out of that trip. I barely even got to see my sister. The second time was another $300 for my sister’s dog because my sister couldn’t pay for him. I’m currently broke and don’t know what to do. I have to pay rent again on the first and I have literally 1 cent to my fucking name…", "Its not you @ashhald. Its them.\nDont doubt yourself you did nothing wrong.\n\nAnd for OP. Im glad you got out. Find legal advice to see if you and your sister can stay with your uncles. They gave always been there for the two of you. Cant say the same about your mother. It seems she chose new hub and new kinds over her existing family. \nGL", "If youre over 16, you can go to any Social service office and get emancipation. I did it at 16. Sometimes you have to take care of yourself! Sorry youre in this situation and I hope it gets better. Look into emancipation...", "This is so absolutely pathetic. Sure its 'unfair', but bob and the mother can see it as they only have to pay for two kids now. Instead of bitching and moaning. At least OP has some absolutely amazing uncles!", "NTA. I missed that part. That's fucked up. Especially if OP is an athlete. As a teenage athlete after a two hour practice or a 5 hour competition I was fucking STARVING. Putting away a large pizza from Papa John's was normal for me and I'm a female, OP didn't mention their gender but still. I can't imagine being denied food. OP needs to call DCF.", "It’s only going to get worse with options being taken off the table for women…", "JFC I totally missed that nuance and was somewhat confused. My dad did the same too. The offing, not the divorce.", "Thank you for the kind words. They comforted me.", "I'm sure you know this and have probably said this to him before but he needs to lose contact because if he picks a connection with the kid, it's only going to escalate and no doubt he will lose his fiance. It boils down to a choice: the kid or his fiance."]}