{"id": 5523, "submission_id": "zu7zt4", "title": "AITA for moving away from my dad without telling him?", "selftext": "I don’t care if he sees this, we’re moving in the spring. My family (31M, 31F, 7F, 3F) is ready to move further north and out of the state to get out of the same old routine and exponentially growing suburban area that we’re in now, to go out to the country with acreage and less noise, more outdoor activity in a cooler environment.\nWe live 5 minutes from my dad whom we haven’t seen in 6 months. I try to make plans and he’s busy, doesn’t make an effort to see his grandchildren, before the last visit, it was months. We didn’t see him for almost a year once. After my youngest daughter was born, he didn’t come see her until she was 4 months old. He’s not a loner, goes out and does stuff and has his new wife’s family over all the time (not my stepmom, they got married a few years after I did, my mom and him divorced when I was 7, he took custody of my brother and I, I’m still close with my mom)\nI’m thinking about just leaving and not telling him about it. The last test to see if he cares or not. The whole thing really bothers my wife.\n\n*EDIT* more info:\nI spent 2 years in Italy while enlisted in the military, during that time (I was still single with no family) he and my long-term stepmom (I was 7 years old when they were married, 20 in Italy, so 13 years as a parent figure) got a divorce without telling me. Also they tossed most of my shit, my long distance girlfriend (now wife, lived in the same city as my dad) had to go over and salvage what she could that I still had left there when they emptied the house that I lived in from 2003 - 2011. \nI’ve tried sitting down with him and talking on the phone and texting him about the status of our relationship, he just blows it off as “there’s nothing wrong, we’re completely fine! Love ya!”\nWhich is more frustrating than anything. \nI will likely end up taking him next week, not 100% committed yet, and it will probably end up with me being angry and upset or maybe he’ll underreact and treat it like no big deal. Which would also be upsetting. I haven’t fully decided yet\nThank you all for your differing opinions and viewpoints. I really appreciate it all. I’m ok with being the asshole if that’s what it comes down to, or being the bigger person maybe. Idk but I’ll talk with my wife about it, she usually helps me with difficult decisions like this when I can’t decide. She was going to let me choose on my own.", "created_utc": 1671881135, "permalink": "/r/AmItheAsshole/comments/zu7zt4/aita_for_moving_away_from_my_dad_without_telling/", "score": 185, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m moving away from my dad without telling him, I might be the asshole because I’m taking his only grandchildren away\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA   Although you might want to let him know how to find you after you move.", "NTA.\n\nYou are an adult and can make your own decisions of how you want to live your life. It’s disappointing to say in the least that your father hasn’t made much of an effort to spend any time with his grandchildren.\n\nPerhaps it is a good idea if you tell him that you are moving far away because it might make him realise that he hasn’t been involved with his grandchildren much and he might change for the better but if he doesn’t respond how you hope at least then you will know whether it’s worth having any sort of relationship with him. Most importantly, it will ensure that he doesn’t have any excuses to justify why he can’t spend time with his grandchildren.\n\nIn any case, I wish you and your family all the best.", "NTA You have to live where is best for you and your family. But take the high ground here and tell him you're moving. Your relationship sounds shaky and intentionally moving without telling him will just damage it further", "I can understand your frustration and your thoughts... But I think there are important things you should reflect on before you make up your mind about what to do.\n\nYour motive:\n- Is this revenge?\n- Is this a lesson for him?\n\nYour wished outcome:\n- Your dad realize he has acted like an idiot?\n- You want to mend your relationship?\n- You want to go completely no contact?\n\nThe feelings attached:\n- Make yourself feel better?\n- Make your dad feel bad?\n- Feel like you put down your foot!\n\nI think the situation is truly frustration for you, and either way I do not think you would be TA.\n\nAnd congratulations for embarking on a new great and exciting adventure for your family!", "NTA!\n\nThat’s exactly what I did. Didn’t tell my father that I moved across the country. \n\nSome weeks after my move, he called me and told me he will be near me in a few months and that he could visit for an hour. (He only visited me when his new wife had business in my city once a year)\n\nAnd my answer was: „Well, I haven’t been to CITY for a few months now. Have a good time there!“ \n\nSo worth it. \n\nHe tried to throw a fit but I stopped him with a „Huh? I thought you knew? After all, you talk to my sister all the time? Oh well 🤷🏻“", "I really cannot make my mind here. Your father is a-hole for his actions and not caring about you and your family. Nothing can justify that. \n\nBut also acting the same way your father do is not right. You can inform him either by text or call it is your choice but not telling him just out of spite doesn't sit well with me. You totally have right to be mad with your father because he isn't putting any efforts from his side.\n\nIt is your call honestly. Whatever you choose shouldn't make you regret.", "I went through a similar experience with my dad growing up. He didn’t have any custody, he was a weekend dad who saw me on his time. He would consistently blow off our plans, and go months without checking in on me. As a kid I would be so excited when I did get to see him, just for the sheer novelty that he was my dad. But as a teen/adult, I realized he was barely putting in any effort at all, and I stopped trying all together. I reached out to him on his birthday, Father’s Day, and general holidays, but that was about it.  He died unexpectedly when I was 26, and I never resolved those feelings with him.\n\nWhen I look back with hindsight, as an adult I did not want much from him. I wanted a dad that would call me before a snow storm to make sure that I was all set up, or someone who would call me when they knew I had something important happening to reflect back on how it went. It was all kinda basic dad stuff that I felt he should have instinctively known to do for me; I was always resentful that he didn’t just do it on his own, that I never took the time to sit with him and tell him clearly what I wanted and the things that bothered me. My dad and I never talked about anything important when we saw each other, it was always the same clipped small talk on repeat.\n\nCommunication is key. How important is it to you to have him in your life and your kids lives? How hard do you really try with your dad - on the days where he’s busy, do you just get mad at the fact he’s busy again and drop it, or do you try and make a rain date for another time with him? My advice would be to sit down and talk with him, just you and him; about how his actions have made you feel neglected. Give him the chance to make things better, he might actually try to make more of an effort, or he might not - but you’re already used to the disappointment anyways, so how could it hurt things?\n\nNTA, you do you and what’s best for your family. It does not sound like your dad has done much to deserve to be a part of your life. However, if you do want a relationship with him in the future, keep in mind that relationships are a two way street, and just being direct and clear with him about how his actions have made you feel, may go a long way.", "first NTA,,   \n2nd, if he is a non-aggressive person (physically),,   \nhe don't showup,, but if your partner is worried,, just tell your father", "YTA never do these stupid ass ultimatums or tests. Either be an adult and talk to him about it or just go full on NC with the expressed desire to not talk to or see him again.", "**YTA**\n\n>The last test to see if he cares or not.\n\nYour plan is a passive-aggressive test and you are going to be disappointed when he fails your *test* and it's not going to make you feel any better about cutting him out of your life.    Let him know now that are planning to move, then tell him that you are disappointed that he never made any effort while you've lived close by and that it saddens you a little to know that he prefers his new family over his grandchildren.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI don’t care if he sees this, we’re moving in the spring. My family (31M, 31F, 7F, 3F) is ready to move further north and out of the state to get out of the same old routine and exponentially growing suburban area that we’re in now, to go out to the country with acreage and less noise, more outdoor activity in a cooler environment.\nWe live 5 minutes from my dad whom we haven’t seen in 6 months. I try to make plans and he’s busy, doesn’t make an effort to see his grandchildren, before the last visit, it was months. We didn’t see him for almost a year once. After my youngest daughter was born, he didn’t come see her until she was 4 months old. He’s not a loner, goes out and does stuff and has his new wife’s family over all the time (not my stepmom, they got married a few years after I did, my mom and him divorced when I was 7, he took custody of my brother and I, I’m still close with my mom)\nI’m thinking about just leaving and not telling him about it. The last test to see if he cares or not. The whole thing really bothers my wife.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA.", "NTA. Just let him know where he can find you after the move. A nice letter perhaps?", "YTA to yourself and family for this line 'the last test to see if he cares or not'\n\nLike, dude you already know he doesn't have the capacity to care in whatever way you're feeling entitled to. Otherwise you'd be in a different situation.\n\nDon't not tell him to test him, don't tell him because he isn't really part of your lives and doesn't need to know. The whole thing does not really bother your wife, the fact that you're still agonizing over his and your mothers inattention as an adult belittles her commitment to your adult relationship. That's a bigger mess than 'really bothers' covers isn't it?\n\nGo north and be better without your absent father", "That would probably be the best way, “hey son, mind if I come over for a bit?”\nYeah sure, it’s gonna be a bit of a drive though…", "Thank you, I’m gonna end up telling him after all, after Christmas, although I doubt we will see him for Christmas either", "Fair point", "Well said.\n\nOP, what outcome do you want and will this accomplish it?", "We are excited to move for sure! I feel like this has ended up turning into the advice sub instead of aita, but I think I’m going to end up telling him next week", "That’s fucking funny, he sounds exactly like mine!", "Solid observation, I’ll sit on it", "Perfect!", "Best of luck to you, \n\nEven though whatever happens from there is out of your control, always remember that you did everything you possibly could to rekindle yours and your children’s relationships with your father.\n\nHave a happy and safe Christmas.", "Just do it the day after the move. Less chance for drama.", "Nta", "NTA, but you might want to face the rejection of him not caring head on. \n\nIf you leave without telling him, he might play the victim - you didn't give him a chance to say goodbye to or see his grandkids anymore - sad face.", "INFO: Have you had a real discussion with your dad about the kind of relationship you’d like to have with him?", "Info:\nI just have to ask\n\n> We didn’t see him for almost a year once. After my youngest daughter was born, he didn’t come see her until she was 4 months old. \n\n3y kind off coincides with the panda 🐼 paloo.", "NTA, honestly wait until he wants to visit again and reaches out before you tell him and see how long it takes. It's not worth staying for someone who wouldn't do the same for you.", "NTA I disagree that it is spiteful not to tell him you are moving away. You do not owe him anything. I moved away without telling my mother. It has been 3 years, she still hasn't noticed.", "How else will the dad understand how hurtful his actions are?  I think leaving without telling him will show both OP and the dad that the dad ver rarely cares about OP.", "Yeah, this sounds like the right answer. It's free and just an fyi. It's the least amount of drama possible", "And will the father even care?  Some grandparents are just \"not that into\" being doting grandparents, especially if they still have their own careers and aren't retired yet.  Or, have their own lives that do not revolve around grandchildren. \n\nNothing in OP's post indicates that the grandfather asked OP and his family to stay close in the first instance.", "NTA, but I'm going to share with you some stuff I've been dealing with as I seem to feel similarly about things as you. I have this tendency to make things a test for people. I've had to work on my anger issues (not sure if you have those or not) but long story short, I've had to accept that having expectations of people that they are incapable of fulfilling repeatedly leads to disappointment.\n\nShould your father be a better parent and grandparent? Yes. Can he be? It doesn't sound like it.\n\nIf you want to move, do so for your reasons, but not to test your father. He's failed all your tests before. He won't pass this one.", "NTA  He is as involved as he wants to be. It might do your heart good to lower your expectations.", "Nta all I have to say is karma. You get what you give.", "NTA.  Just go and don't feel bad.", "Thank you for that", "I really appreciate this, it sounds a little similar, the big difference is my dad was definitely there as a kid, just emotionally unavailable. Now it’s just excuse after excuse, this new wife he’s been with for years and years now has kept him from seeing his own kids, even my three younger brothers, I still hold a lot of resentment towards him for pushing my only full-blood little brother away. He moved to California a few years ago and my dad never really accepted him for being gay. Wasn’t hateful really, but he let his wife make everything super awkward when his husband was around (his husband is a self absorbed, opinionated, controlling asshole, but that’s another story for later) and it made it really shitty when we would hang out. \nWe used to see them often when my oldest was young, but the. My wife and his got into a big argument because she’s a bit selfish and blamed my wife for something, idk. But he took her side and we haven’t really seen him since, after that very brief period. I’ll try, maybe this could be the one thing that can bring him back. Now that I have kids, I can honestly say I would divorce a wife that I have no kids with to be with my own kids and especially my grandkids. My kids mean more to me than anything and it just frustrates me that he doesn’t feel the same way about any of my brothers and I. \nThank you for your input so much. Changes the perspective a bit.", "That’s a nice opposing perspective, I’m pretty sure I’m just going to call him next week and tell him. Thank you so much for your input!", "Thank you for that view, I guess you’re right on some aspects. This affects my kids more than anything, they get sad when they see him and then don’t see him again for months, even though they know he lives close. My oldest is starting to think he just doesn’t like her. I suppose she’s not completely wrong, so fuck that. \nI appreciate your input", "Always an option for sure. I’m still sitting on it", "He really would do that shit", "Yeah Ive tried a few times, he beats around the bush, avoids answering the question directly. He’s always had issues with anything emotional my entire life.", "You’re probably 100% right about this.", "Ugh, fair point for sure, thank you", "There are ways to communicate hurt without hurting the ones you love. It seems like OP wants their father in their life, and moving away without communication won’t do that. OP, I agree that you should let your father know about your move, and if you haven’t already vocalized the pain he’s caused you, you should.", "With this additional info, I would say that your dad has unfortunately chosen to stay in this relationship at the expense of the relationship with all of his children/grandchildren. As long as he is in this relationship he will continue to prioritize her, as it appears she won’t have it any other way. It’s great that you have a perspective on how toxic his behavior is and can’t imagine doing it yourself, seeing the patterns and breaking the cycle is a battle in itself. I think the question you should be asking yourself here is, do you really want him and his wife (because as of right now, they are a packaged deal) in your life and kids lives? After their treatment of your bio brother and his husband, they don’t sound like a very positive or nurturing influence for your kids to be around.\n\nI do still think that talking with him about the past, and what you wish the future to look like, may help the situation more than hinder it. But there are also some fundamental issues at play here. If there’s no willingness to change the way things are; at the end of the day you have done what you can do. \n\nBest of luck to you and your family. Even if your dad continues to be an absent part of your life, you can always build new connections, and found family can be just as crucial and meaningful as bio family.", "Considering both your answer and your edit, I don’t think you’re an asshole no matter what you decide. It sounds like your dad has never really been emotionally present. His shortcoming isn’t a slight against you or your family. Only you can decide if his involvement in your life and your family’s life is worth the effort you have to expend to facilitate it and the hurt of knowing that if you don’t expend the effort, he won’t. \n\nMy advice is that you’re excited to move and start a new chapter, which is terrific. Don’t darken that excitement by turning it into a test you already know he can’t pass. \n\nAlso, I’m sure you already know this, but his current wife is most likely doing all the coordination and labor for him to spend time with her family. He probably just shows up, putting no more actual effort into seeing them than he does for seeing you. NTA. Best of luck with the move, I hope it’s a great new experience for your family.", "It's hard to struggle with. We want our parents to realize what we need and provide it. It's a natural want, and all these warm and fuzzy stories make it feel like everyone has something we don't.\n\nI finally started to take a deep dive to look into it once I started seeing it affect people that had nothing to do with what may be among the core causes for how I feel.\n\nYour experience is yours, but I wanted to share my ongoing experience because something about your post rang very true for things I'm working on.", "This is one of those situations where the father can pull out any number of excuses if OP asks them directly on why they have missing.", "Really appreciate this comment, it’s more to think about, I feel bad for my two youngest brothers as well because he’s just repeating the cycle with them, he made no plans to see us for Christmas, but his wife’s entire family will be there today and tomorrow, just like every year.  At this point I don’t even know if I want an invite, guess I’m just hurt we didn’t get one.", "Thank you very much", "Your story definitely hit a chord with me, more so on the absenteeism, just translated to his lack of emotional support for all of us. You had it worse for sure, but your views on how you wish you could go back and try harder range pretty loud for me too."]}