{"id": 5543, "submission_id": "zud2gu", "title": "AITA- lied about a miscarriage", "selftext": "Obviously a throwaway, and I know this sounds horrible but let me explain. \n\nAfter several years of trying for children, we finally gave in and saw the doctor. My husband is fine. My ladybits aren't, to the point that not only am I not having kids, there's almost no option for IVF. It has hurt, but we have finally decided to invest our time into becoming the world's best aunt and uncle. The families felt differently. \n\n\"When are you going us grandbabies/ niblings?\"\nWe aren't. We can't. \n\n(After plenty of comments about it happening naturally on a vacation) \"well you should see a doctor.\"\nWe have. \n\n\"You know, there's always IVF/surrogate/ adoption.\"\nYes, we know. And no. \n\n\"You'll regret not having kids when you're older!\"\nNot as much as I regret this conversation...\n\n\"But MY GRANDBABIES!!!\"\n\nMy family has finally given in and dropped it. My inlaws can't seem to comprehend that they're not getting grandkids anytime soon, maybe because my BIL is gay and the family bloodline is ending. \n\nWe got together for thanksgiving, and at the table in front of his grandparents, an aunt/ uncle, and 2 cousins came the dreaded comments... \"We need a playmate for (cousin's kid). When are you guys getting pregnant?\"\n\nI couldn't take it anymore. I answered \"we already were pregnant twice this year. But I'm not anymore. Thanks for reminding me.\"\n\nIt kinda ruined the mood at dinner. I talked about it with my sister and a friend. My sis understands because the inlaws were pressuring so much after we said we couldn't. (Of course, her kids are the victims of our spoiling). My best friend said it was a really shitty thing to do and it disrespected anyone who lost a pregnancy. Maybe she's right, but the inlaws have finally given up. \n\nAITA for comparing my failures to get pregnant with a miscarriage? I know it's a greater loss when you're actually pregnant. But I can't take the constant questions, and they finally stopped.", "created_utc": 1671898919, "permalink": "/r/AmItheAsshole/comments/zud2gu/aita_lied_about_a_miscarriage/", "score": 4441, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I lied about losing a pregnancy when the truth is I can't get pregnant. It disrespected everyone who lost a baby. But I saw the inlaws this week and they didn't mention baby booties under the tree for the first time in about 5 years.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA  They ruined your mood, it's completely fair to ruin theirs. Maybe they'll learn to keep their mouths shut. I hate people like that. I'm so sorry you had to deal with them.\n\nEdit to add: I've miscarried twice and I don't see what you said as being disrespectful to anyone who lost a pregnancy.", "NTA you were emotional and it's the bad part about not having kids not for lack of trying. Your family understood but your hubby's family needed to think of your feelings over this and the moment pushed you over the edge and hence the lie. It for the moment held them off. Later you can clear it up that you lied to stop their pushing which needed to stop.", "NTA.\n\nI've had a miscarriage and honestly this would only be offensive if you had said it for attention. You did it for the opposite reason and if thats what it takes then that's what it takes.\n\nI do however feel like you have dug yourselves a hole. I doubt this will stop them asking for good and if you ever decide to tell the truth then it could be complicated.", "Nta. It's nobody's business. I've had miscarriages and this seems like the only way to them to stfu in your case. Anybody saying it's rude to people which miscarried , I'm pretty sure infertility is pretty high up there as far as sad goes. There's no right way to handle this. Do you boo.", "What does your husband say when this happens? Is he actually fine? Is he using his parents as a mouthpiece?", "I'm going with NTA with the understanding that everyone who has had a miscarriage will have differing opinions on this situation.", "NTA. I really think everyone sucks, but inability to conceive is a loss on its own, and they don't seem to respect that. \n\nThat being said, I hope you pulled them aside, or will in the future, and gently explain that it's impossible per the docs (hopefully you got a 2nd opinion?), you can't have children, and that you would appreciate if they respected the situation without further reminders about no grandkids.", "NTA, lying like that is not great, but their pressuring you for so long is awful and they needed to be taught the lesson to mind their own damned business and worry about their own damned bodies, not yours. Sure a different choice of words would have been better, but that is true almost every time someone is under pressure like that.", "NTA. \n\nWas lying about a miscarriage wrong? Yes, absolutely, 100%. However, you were in the midst of processing the fact that you'd never have children, from what it sounds like the in-laws were being suffocating, and it's not as though it was a planned lie. You simply had enough and said the first thing on your mind that you knew would shut them up.", "Someone on Reddit once used a phrase I loved: this is not the Trauma Olympics. \n\nI get that miscarrying is horrible and hurts in ways unimaginable. But that doesn’t lessen the pain for someone who’s so wanting to be a parent and finding out ain’t no way in hell. \n\nThe poking, jabbing and questions hurt. People need to learn and back the fvck off.", "ESH. People really need to learn to mind their own business regarding the reproduction of other people. \n\nHowever, under no circumstances should you ever claim to have had a miscarriage when you didn't. That's fucking awful and is incredibly disrespectful to anyone who has ever lost a child. It's absolutely devastating.", "NTA, you said it to family in a private setting to get them off your back regarding a very personal topic they weren’t taking a hint on. You could have just told them the truth but they might not have respected your dignity and might have said shitty things about your issues conceiving. \n\nI wouldn’t want clueless, boundary crossing family to know very much about such personal topics and would probably say whatever I needed to to get them off my back so in my view you didn’t really do much wrong.", "NTA at all. People are so rude and intrusive, they fucked around and found out. It’s none of their goddamn business. It would be like if you were at a funeral with them and turned to them and said you’re next.", "NTA. The only other reasonable response I can think of is simply not speaking to those people to understand. There comes a point where people need to be shut down, however that may happen. Sorry you're riding the struggle bus so hard right now", "YTA- very gently. Rather than getting upset by the barrage of questions that happen over the years in families- when you realized all of this you could’ve taken your mom a side and shared your situation with her and let her share with the family. Or a sister or whomever. Instead- you didn’t communicate , got frustrated and lied to make them feel awful. For those of us who have had actual miscarriages- it really isn’t something to just throw out to hide the truth. And why would you do that? \n\nCommunication  can make a huge difference in these situations, nuance is everything. If I were in your family, I would wonder what else you’re capable of lying about.", "Unpopular opinion, but YTA do your own actions. I can 100% understand your frustration. For years I got the “why aren’t you married?” And I’m now moving into “grandbaby fever” territory (still unmarried). But what you did is not an adult approach to a relationship issue.\n\nIt’s the internet and child’s approach based on what I see on Reddit, yelling “dish it back at them!” Yes, it’s somewhat funny and what you daydream about because what you said hurts them emotionally too. But you know by asking AITA that it wasn’t the best response. And worse, it doesn’t stop the behavior going forward. It also can offend people who have gone through miscarriage.\n\nWhat you should have done is made your boundaries clear and then choose to leave or stay. Then arrange for a deeper discussion in the future where you lay out for them that this behavior is unacceptable you and if it happens again you will just leave immediately or not come at all.", "Gotta lean ESH.\n\nYou absolutely have a right to your privacy and biological decisions. A flat NO was sufficient answer.\n\nLying is just seriously a crappy thing", "I'm going ESH.\n\nI get that not being able to have children is devastating.  I'm a card-holding member of that club. But it's devastating on a different level to losing a child  (also a member of that club). That's never an okay scenario to fabricate.\n\nAnd your family needs to just lay off.", "NTA this is exactly why I don’t ask anyone “when are you having kids?” The choice to have kids is deeply personal, and medical diagnosis are also deeply personal and often kept private. Hopefully you in-laws learned a valuable lesson.", "YTA\n\nYou just diminished the horridly painful experience of anyone who has actually lost a pregnancy.\n\nYou aren't a toddler, why couldn't you use your words and tell them...I don't know... the truth.", "NTA.  \nThey kept picking and picking and picking and you suddenly burst out with something that you hoped would make them \\*leave you alone.\\* You weren't trying to be an asshole, you were hurt and lashing out.  \nI'm sorry.  \nI don't think you owe them an explaination, but don't do/say it again, because then you would be being an asshole.  \nI'm so sorry.", "NTA.\n\nThey have no idea what you have gone through and keep pressuring you to have kids. You had s right to make them uncomfortable and to get them to shut up.  If this was the only way to make them uncomfortable enough to stop asking, then so be it. They pushed until you snapped.\n\nSure, it wasnt the best answer, you could have told them the truth that you are simply infertile and nothing else is an option.  But frankly none of that is their business.\n\nI would say that this simple lie doesnt make light of miscarriage, but the relatives pressuring you to have kids does. They had no idea if you were voluntarily child free, or suffering infertility.", "NTA. Yes while lying isn’t a great thing, you said it yourself, you’ll never be able to have children. It was a quick and effective way to shut them up about it.", "YTA. Go talk to someone who has had a miscarriage & see what they think.\n\nBe an adult and tell the truth.", "NTA but may I ask why adoption is not an option?", "YTA\n\nThey are hounding you because they don't understand that it's not your choice to be childless, but making something up is manipulative.  You should have just said, \"Discussing this is painful for me.  Please stop.\"", "NTA.", "NTA - you did what you had to do.", "NTA. The family needs to learn that asking about others' reproductive systems is never a good thing. It is no one's business, and I think you tried to send them the message that you weren't having kids in a nice way for quite a while. They failed to get the memo, so you told them in a more direct way. That's on them.", "NTA\n\nIf it stopped the personal inquisitions by shutting the table down then & in the future I see nothing wrong with what you did.", "As a person that has gone through a miscarriage, it is an unbelievably difficult and painful thing that you wear for your entire life. Really not something to lie about. I get that they shouldn't have pressured you, but what you did was pretty disrespectful to those that have had a miscarriage. Gentle ESH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nObviously a throwaway, and I know this sounds horrible but let me explain. \n\nAfter several years of trying for children, we finally gave in and saw the doctor. My husband is fine. My ladybits aren't, to the point that not only am I not having kids, there's almost no option for IVF. It has hurt, but we have finally decided to invest our time into becoming the world's best aunt and uncle. The families felt differently. \n\n\"When are you going us grandbabies/ niblings?\"\nWe aren't. We can't. \n\n(After plenty of comments about it happening naturally on a vacation) \"well you should see a doctor.\"\nWe have. \n\n\"You know, there's always IVF/surrogate/ adoption.\"\nYes, we know. And no. \n\n\"You'll regret not having kids when you're older!\"\nNot as much as I regret this conversation...\n\n\"But MY GRANDBABIES!!!\"\n\nMy family has finally given in and dropped it. My inlaws can't seem to comprehend that they're not getting grandkids anytime soon, maybe because my BIL is gay and the family bloodline is ending. \n\nWe got together for thanksgiving, and at the table in front of his grandparents, an aunt/ uncle, and 2 cousins came the dreaded comments... \"We need a playmate for (cousin's kid). When are you guys getting pregnant?\"\n\nI couldn't take it anymore. I answered \"we already were pregnant twice this year. But I'm not anymore. Thanks for reminding me.\"\n\nIt kinda ruined the mood at dinner. I talked about it with my sister and a friend. My sis understands because the inlaws were pressuring so much after we said we couldn't. (Of course, her kids are the victims of our spoiling). My best friend said it was a really shitty thing to do and it disrespected anyone who lost a pregnancy. Maybe she's right, but the inlaws have finally given up. \n\nAITA for comparing my failures to get pregnant with a miscarriage? I know it's a greater loss when you're actually pregnant. But I can't take the constant questions, and they finally stopped.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: have you ever actually sat down with them and explained the situation as it is, not mincing words? Like… “This is our medical situation, it is a physical impossibility for us to have children and I am not a candidate for IVF as per multiple medical professionals. We are not open to any discussion about adoption or surrogacy, any discussion about it will result in us leaving. This is not open for discussion and if you can’t respect our boundary, we will not be returning to family events.”?\n\nBecause to me that seems like the first step before lying about multiple miscarriages.", "NTA. I get it. Don’t people realize how rude & hurtful it is to ask these questions. People need to MYOB.", "NTA. The fact that they were made uncomfortable serves them just right. If the (wildly inappropriate and invasive) questions and comments start up again, remind them of this. I don’t care that it’s a lie, for the rest of their lives they can live with it as truth (and in my opinion should be made to believe it).", "NTA they keep hounding you and wouldn't listen with every other answer. Now they have. Hopefully they keep quiet.", "Had two miscarriages, and even though I eventually had a child, the loss remains. \n\nI would not call you an AH for being backed into a corner and just trying to make the inquisition end. I am so sorry that you are grieving not having children, though it takes a different form than a miscarriage. \n\nHowever, I don't think you helped yourself in the long run, because the IL's will take what you said as evidence that you can get pregnant. \n\nPlease talk to your husband and come up with a better game plan, whether that involves going LC/NC, or him running interference, or having a come-to-Jesus conversation where the ground rules going forward are explicitly laid out.\n\nBest wishes to you.", "I'm a bereaved parent. In the first 2 years after my son's passing, I attended a support group for bereaved parents, pregnancy loss, and infertility grief. And one thing that I came to realize is that the pain of those who can't conceive is powerful, but often disregarded as \"not really a loss\". Which is an odd thought process, because like those of us who had children and lost them, and like those who conceived but lost the pregnancy, you are also having to grief the loss of a future, of dreams and hopes, and of an identity that you envisioned for yourself - as a parent, as a future grandparent. \n\nNTA \n\nBut anybody who disrespects and disregards your grief is.", "dear inlaws..I am physically INCAPABLE of having children, we do not want to adopt, we do not want the mess that can come with surrogacy, we will NOT be having children FULL STOP. drop it, or we walk EVERY SINGLE time, the instant its mentioned.\n\n&#x200B;\n\njudgement: NTA", "NTA, if they didnt want to hear that they should have stopped asking", "NTA. They wouldn't leave it alone. Now perhaps they will.", "NTA if I were you I would never speak to them again.", "NTA \n\n*hugs*", "NTA. Maybe they will finally learn", "NTA- that will teach them to keep their mouths shut about it. They fucked around and found out.", "NTA, I'm on your side with this one. People who have been through miscarriages, I can't imagine they would ever be able to openly say something so direct to their family as it would be way too hurtful.  So you are kind of advocating on their behalf - being able to push away such horrible and hurtful constant questions, and teach people that this is not ok.\n\nHowever, your best friend's reaction might be because she has gone through this herself, and doesn't agree with what you did?  Just explain that it was about tampering their behaviour, rather than trying to get yourself sympathy.", "NTA.. but shocking to me that miscarriages are a good enough reason for them to stop talking about it but “I am physically incapable of conceiving” is not.", "This exactly.", "I think OP is NTA, but this approach may backfire in future because now the in-laws can add ‘at least you know you can get pregnant!’ to the mix of boundary-crossing shitty comments.", "I disagree. If you're lying about it for sympathy and an outpouring of support, then yes. It *is* absolutely devastating, which is precisely why it's effective at shutting people up in cases like this.", "The way I read it, OP's mom is aware and I think she said she explained it to the sister? So they gave up but the inlaws were pushing for the extra treatments/ adoption, and still kept asking when OP said they can't. (Honestly I can't see the original post unless I discard this one, so I may be wrong).\n\nI agree about communication, but we don't know exactly what she said about not having a baby beforehand, so maybe they're the AH for pushing when she has gone through a different kind of loss.", "I don't necessarily agree with OP lying to accomplish this, but this family SHOULD feel awful for how they're treating OP. It's so rude and inappropriate to hassle someone about having kids; there are so many reasons why people don't have kids and it's no one else's business. In OP's case, the nagging serves as an upsetting reminder of her struggles with infertility. What an awful thing to do to someone.", "How about the families take no for an answer and don't barrage people with questions after they've made it clear they don't want them??? You don't get to be mad about being lied to after not taking no for an answer. I also genuinely don't believe communication would have solved this because if it if it would have op saying no many times would have stopped this problem long ago.", "Why should OP feel obligated to share detailed medical information (that is also personally painful) with relatives? And even if you want to be practical, people this nosy and persistent won't stop even if you are truthful, they'll just come up with 'helpful' alternative suggestions rather than drop it. The only thing that got them off my back was firmly telling people to back off and if they still didn't, to openly shame them. No one owes their family or friends regular updates on the status of their uterus.", "I think the difference is you probably Could get married. You made the decision Not to get married.\n\nShe doesn't have a choice. Big difference.", "Maybe op shouldn't have lied about the miscarriage, but what truth did OP owe anyone here? They aren't obligated to give anyone the real reason. What you could argue is if the in laws won't back off, op should end the conversation or leave the house if they keep bringing it up and only come back if they stop. But they don't have to share personal, painful medical information.", "Just because they don't understand doesn't mean that they shouldn't just take no for an answer. What makes you think that they're going to stop when she says \"this is painful please stop\" when they haven't stopped the many other times she's told them no???", "I'm going to guess I got downvoted by somebody that has never been through a miscarriage. I hope you never have to go through it. It really is awful. No pain compares to holding your dead child in your arms.", "I'm really sorry you went through that.", "I don't give a shit if you disagree. You don't get to lie about having a miscarriage for your convenience. You don't lie about having a miscarriage for any reason, ever.", "What more communication is needed other than no??? They are the assholes for pushing no matter what if someone doesn't want to have a kid for whatever reason you should accept that and accept their answer as no.", "Still doesn’t mean this was an adult approach. Established boundaries is better. Also they are pushing her to do IVF or adopt which she could do but she made the decision not to.", "She doesn't actually say she told them no.  Saying what I suggested is super direct and places all the discomfort on them.  You repeat it as necessary.  It's pretty difficult to argue with someone's feelings, and it's the truth, so it's an ethical, non-dramatic response that pretty clearly makes anyone ignoring it the asshole.\n\nIt's problematic to lie about miscarriages, especially when they are impossible for her.", "That's horrible. Really gives an awful perspective that many don't consider. I'm so sorry.", "I don't give a shit if you don't give a shit about my disagreement.\n\nPeople lie about things all the time. Whether those lies are bad depends on who is hurt or helped by them and to what degree. No one was actually hurt by OP's lie here.", "Sorry, did you completely skip over the part where OP mentions that in addition to being unable to get pregnant naturally, there is almost no option for IVF? And whilst I get why it was suggested, please don’t suggest adoption like it’s the most logical next step they ‘could do’ but decided not to, it’s a lot more complicated than that. Comparing the pain of infertility to your choosing not to get married is embarrassingly tone deaf; they are monumentally different things.", "She did tell them to back off, that she couldn't, they wouldn't respect her boundaries. I'm getting the grand baby stuff already as the only sibling in a relationship and I'm childfree by choice. If I had to lie to get them to back off i would but thankfully my family is much calmer about it than ops. NTA\n\nAlso she mentioned she can't do ivf it's not a choice she can't.", "What part of this quote makes it sound like she didn't tell them no directly and that she has trouble communicating???\n\n>\"When are you going us grandbabies/ niblings?\"\nWe aren't. We can't. \n\n>(After plenty of comments about it happening naturally on a vacation) \"well you should see a doctor.\"\nWe have. \n\n>\"You know, there's always IVF/surrogate/ adoption.\"\nYes, we know. And no. \n\n\nIf they don't take no for an answer they aren't going to suddenly start because you make it a little more uncomfortable for them than it already is.", "I'm going to assume by your username thay you have never suffered a miscarriage, so I really don't think that you get to have an opinion on lying about having one. When your child dies, then you can come back and talk to me about it. Until then, your opinion to me is invalid and irrelevant.", "I think you have misread the comments. I’m not comparing infertility to not being married. I just said I can understand why she is frustrated. We all have our own experiences and while mine is not to the level of hers I am just empathizing. Also, I did *not* suggest adoption or IVF. In the OP she said her family is pushing for that and they don’t want to. (The third quoted response from the in-laws). I’m just saying it’s a decision her family should respect and establishing a very firm boundary is the best way to go.", "I'm not a fan of lying to solve problems. It lacks integrity. I don't really see the point in arguing it further.", "You don't know what I have and have not gone through, and it's a pretty shitty to assume that the fact that I'm a man somehow means I can't feel loss in a miscarriage.\n\n>When your child dies, then you can come back and talk to me\n\nMy kids are in high school. Are you equating my children to fetuses?", "You're the one that lied aboout op never saying she told them no and then choosing to not address that and instead address your incorrect comment.", "No, I'm comparing your children to someone else's children. A miscarriage isn't a \"pregnancy loss\" it's losing your child. Your comment further highlights how ignorant you are on miscarriages and how truly devastating they are. So I stand by my assumption that you have not experienced a miscarriage. And no, men do not suffer from a miscarriage the same as women because you don't have the capability to feel the physical trauma we have to go through. \n\nWould you lie about your high school aged children dying? No. Because it's fucked up at any age to lie about your kids dying for any reason.", "We should ask women who have both had miscarriages *and* had children die which ones they grieve more. \n\nIn a miscarriage you're grieving the idea of the child. You're mourning the loss of what could have been as much as what was. Is OP not also mourning that same loss?", "Dude, you, a man who hasn't experienced miscarriage,  don't get to mansplain to me, a woman who has suffered a miscarriage,  what miscarriage is and how it feels. You have no fucking clue.", "NTA and good for you.", "Nta had a miscarriage and give you my vote to coninue to use you fib I would too", "Soft YTA, but nonetheless, you are.\n\nWhat happens later, when someone apologizes for reminding you of your \"miscarriage?\" Or, if - heaven forbid - another family member suffers one and turns to you for advice, \"because you've been there?\" What happens when someone asks what they can do to help you get through, or if someone's asks whether there's a charity they can donate to, in honor of your \"pregnancy loss? \" \n\nI get that you were frustrated and angry, but lying about a miscarriage *is* a slap in the face to *many* women who have experienced one. \n\nI'm not saying that you should come clean. I'm saying that you should prepare some backup lies, just in case the future brings someone to you who has, unfortunately, actually suffered a miscarriage and needs support from someone who understands the pain they're in.\n\nETC: Changed \"every\" to \"many.\"", "I had 5 miscarriages before being able to have my miracle baby. \n\nThis is the perfect reason to lie about it. You weren't doing it for attention, you did what you had to do to get people to shut up and leave you alone because they wouldn't respect any other answer.\n\nNTA", "Fuck them. Is lying bad ? Yes. Were you right ? Totally.\nNTA at all. I can not imagine how hard this must be.", "NTA, for all they know that could have happened to you. That's why you drop the subject when someone tells you to.", "NTA while I understand some people's different view, you have been trying and have seen the doctors and lost hope of carring your own child, that in itself is as deverstating as loosing an early pregnancy.  I do know the pain of being told your not likely to be able to carry, that was bad enough and hugs for your position.  Honestly if that's the only way they will understand the heartbreaking situation because the heartbreak you are actually dealing with is too abstract for them to understand then that's what you do.  Honestly it's hard to explain to someone who hasn't been there,  with me it sent me a little crazy for a while and I turned my life upside down over it.  Do what you need to to get acceptance.", "NTA You didn’t said it for attention. You just wanted them to stop, by feeling guilty and ashamed. They overstepped so much by asking for children again and again. Why do so many even think it is fine to ask such pushy and intrusive questions?! Why do a couple automatic needs to poop out children? Why do they never think: maybe they can't or just don't want to? It is their live, their responsibility. for over 18 years, so we better shout up with those questions? No, you must come up with miscarriages to make them zip up. Awful.", "NTA, they sure are for pestering you about having babies. Even if you didn't have infertility issues, it's nobodies business whether or not you will ever have children.", "NTA\nIt isn't a bigger loss, it's just different. Pregnancy and fertility are such sensitive topics, I don't understand how anybody could be so mean towards you when you have already explained. I have a rule to just keep my mouth closed about pregnancy... unless a woman is LITERALLY giving birth in front of me and I have to put some serious strain on my First Aid training, it is literally none of my business what's happening (or not happening) in someones uterus. Sometimes people don't understand that you are grieving unless there's an actual quantifiable death, it's completely understandable (and very unfortunate) that you had to resort to saying you had a miscarriage to get them to process your grief. I'm sorry you haven't been able to have the family you want, but Good Aunties and Uncles form part of the village too so keep up the good work!", "Nta . I had many miscarriages and I know the fear the struggle the sadness and being annoyed with all the questions . This is so disrespectful exactly for the situation you are in . Never ask those questions to a couple . Especially in front of an entire audience", "NTA, it's the only thing that gets the to shit the f up", "NTA, but what a tangled web we weave, when first we practice to deceive.\n\nThat lie is probably gonna come back to haunt you in some way. Lies about miscarriage rarely just end there.", "NTA. Having children is no one’s decision/business beyond yourself & your spouse’s. It’s obvious that you’ve told everyone that it’s not happening in multiple ways, & none of those have worked; hopefully this will shut them up.", "Using a fictitious miscarriage as a means of finishing an on-going argument is wrong...you need to just give everyone concerned an emphatic NO and to stop bringing it up.", "Your in-laws are appalling to the extent that they deserve what comes. NTA. It shut them up.", "People really should not ask such personal questions. I'm sorry you even had to lie ,and go thru that situation. People are very rude and that probably was the only way you could hey them to leave you alone. \n\nI lost my 5 week old son earlier this year ,and yet even within a month later people still felt the need to make comments or ignorant suggestions....\"at least y'all know y'all can have a baby\" \"y'all can just take one of mines\" \"you not missing nothing kids expensive and bad\" and so much more that I won't even repeat. \n\nI hope you and your husband finds some peace and I hope they never ask you anything else again", "NTA\n\nI have had three miscarriages and I don't feel disrespected. How else were you supposed to get them to shut the hell up?", "ESH\n\nThem for prying and you for lying.", "op=YTA\n\nThat is a gross and disgusting lie. You are telling them you WERE pregnant which means they are now grieving the loss they think you had(yes, I realize it's only an \"idea\" but they don't know that).  \n\nAnd it doesn't really put an end to the future questions, because after some time they will ASK when you'll be trying again.  Which leaves you LYING again or telling them the truth(that you lied).  So you only put off the annoying, hurtful questions.\n\nIt is time for your husband to put on his BIG BOY Boxers and tell them to stop the baby talk.  You two cannot/will not be having children(your mutual decision on how much to tell the family) and that the TOPIC is off-limits.  The two of you need to come up with what will be said and what consequences the family will have IF they don't respect your boundaries.\n\nBut please, don't use this lie to shame them into silence.  It is Disrespectful to people who have lost a fetus/baby.  But more so, fundamentally, you are only going to cause more problems in the family dynamic.", "YTA", "ESH", "Soft YTA. \n\nDon't lie and use a miscarriage. I'm also infertile. A miscarriage and infertility are two very, VERY different things. Not cool at all to lie about it and it won't shut them down because now they think you can get pregnant still. I just told people if they wanted me to have kids they could write me the check for treatment/adoption/etc.", " I've had miscarriages, it's not something to throw around like that. \nYou have no idea what women who go through miscarriages actually deal with. \nJust feels wrong to lie about it. There were other things you could have said and your husband needs to step up and deal with his family.", "NTA.  I can't imagine how hard it must be to deal with a situation like this.  And then to have it made worse by insensitive, entitled jerks of inlaws who won't let up.  I don't blame you for snapping.\n\nBut I have to ask - where the hell is your husband during all of this?  Did he even say anything?  He should be the one telling his mom that it ain't going to happen and to shut the f up.\n\nSorry you have to deal with such crap.", "NTA. In essence, you may not have lost an actual pregnancy, but you’re still coming to terms with the loss of your fertility as a whole. Yes it was a lie, but they were being much more rude by constantly asking and pressuring you to have children without respecting your wishes.", "I miscarried the only kid I'll ever get to be pregnant with, and while obviously I can't speak for everybody, I'd give OP permission to lie about this. The family needs to knock it the fuck off.\n\n(And I mean, it's *barely* even a lie; OP shouldn't have to give them her medical history.)", "NTA thank you OP for normalising miscarriages. It should be thought of more by nosey AHs.", "she lied about having a miscarriage there’s nothing right about that and especially using it as a way to ruin someone’s mood is inappropriate", "you can always just keep upping the tally of faux miscarriages. Maybe when you get to 6 or so they will lay off. I say this as a multi miscarrier. Anyone who disrespects you enough to pester you like this, does not deserve the respect of honesty.", "So sorry for your loss..", "❤️❤️❤️", "Ugh, I hope they don't do that. The cliché things people say to those who have miscarried never ceases to astound me. To anyone reading this, take note. This sort of comment to a grieving parent is neither helpful nor comforting.", "Thank you for explaining better than I did.", "Have you been told you will never be able to carry a pregnancy to term? If not, then you don't know that OP's grief isn't worse than yours. Have you given birth to children? Have any of them died? If not, then how can you say the grief of a dead child isn't worse than from a miscarriage? \n\nI'm very sorry for the loss you've endured, but OP telling family members this to shut them up made her life better ~~Ave~~ and didn't actually hurt anyone.", "Ok so they have zero right to hound you about having children and they are TAH for that but why not just tell them the truth? If they are talking about adoption as an option anyway they obviously don’t mind about the DNA. If the fact is that you just don’t feel like adoption is right for you then why not just tell them you can’t have children and you don’t feel adoption is right for you? Also just because BIL is gay doesn’t mean he won’t have children unless he chooses not to. He is as likely to want a family as anyone else. If you feel it’s ok to lie and tell them you miscarried then why don’t you feel ok with telling them that you can’t get pregnant? It’s a horrible situation you are in and it’s never right to pressure people about children but it seems strange to me that a lie about miscarriage is preferable to you then just telling them you have found out you are infertile. I would hope they would support you and let the pressure go if they knew. You hopefully wouldn’t have to bear the burden alone that way.", "NTA, but why didn’t you just tell the truth? Now they still think you’re able to get pregnant.", "NTA - I think you did what you had to do to get through the moment and the constant barrage of questions. Maybe they will leave you alone now. But maybe stop telling people about what you did, if one person knows, it is only a matter of time before others find out. If you are gonna do this type of thing, safer to keep it to yourself.", "NTA. Families (or anyone) need to learn to back off on this subject. It's invasive and rude unless that information is freely volunteered. You are more than just a means to bear children, and your life can be just as fulfilling being a kickass auntie and uncle to your niblings.", "NTA. They needed to stfu and sometimes that’s the only way to shut them up.", "YTA. The mature response would have been to tell the truth rather than lie. You could have also taken a page from Ms. Manners and stared at the offending person in silence or stated that it is a private subject and is not up for discussion.", "ESH. Also gonna tell them other lies? Because it is a flat out lie. Maybe with a purpose. But it does a disservice to people who aren’t lying about going through it. \n\nAnd the in-laws of course need to drop it.", "NTA.", "NTA. Your friend needs to calm down. These assholes would not stfu when you have already explained yourselves. Next time, I’d get up from where ever you are and leave. Keep doing this every single time they open their mouths to ask.", "I can’t STAND people who do the whole “when are you having children” thing. You don’t know what people are going through. You don’t know how painful that question may be.\n\nAbsolutely NTA.", "NTA.  \nI was all ready to say that you were, but y'know what? That was a nice little factory reset for them. Serves them right.", "OP until those people go through the losses you've suffered, they have no right to continue badgering you nor you should feel to be more empathetic towards their AH comments.  It shouldn't take a 2x4 over their heads to realize how disgustingly hurtful their continued dialogue is for a nonexistent path forward for you and your husband.  Just focus on your lives moving forward.", "NTA - Its not like you jumped straight to that option, but unfortunately putting it in those terms seemed to be the only way to get them to drop it.", "I was fully ready to say y - t - a from the title but oh wow, NTA OP. I’m so sorry you have to deal with them, and I’m sorry they won’t acknowledge or accept the grief you’ve had to go through - because finding out you can’t have children is still a loss, there’s still a grieving process that comes with it.\nSending best wishes this xmas, OP", "NTA \n\nBut I don’t think the ILs are going to leave you alone - quite the opposite \n\nThey think you’ve succeeded in becoming pregnant twice recently\n\nWhy would they think you’re not still trying to conceive ?", "NTA, no one is entitled to grandchildren", "Nta, there are so many instances where a miscarriage happens and the woman is not even aware beyond abnormal pain or increased period like symptoms. Who's to say you are lying? You can't get pregnant. That should be enough. People are selfish, that's not your responsibility", "NTA\nLost two babies\nDid not find that Disrespectful\nWhen you are in that club, loss is loss, regardless of when and how. It's shit enough without competing with each other.\nI'm sorry for what you have been through.\nI'm also focusing on being a rad aunt.", "NTA. Your relatives were insufferable.\n\nYou and your husband are the only ones whose opinions matter on this topic. But you should prepare for relatives offering suggestions and alternatives for the rest of your lives. This is a painful topic to be sure, but one that his family may never learn to leave alone. They might even try to break up your marriage.\n\nI sincerely hope the two of you are in complete agreement about your plans.", "NTA.  Your medical issues are no one's business just like whether or not to have children at all is no one's business either.  You don't have to tell them anything you don't want to.  But you do need to draw a line in the sand with them and stick to.it.\n\nTell them that the subject of you having children is off limits and non- negotiable.  If they bring it up again, including behind your back, you will leave and go NC.  It's a matter of respect for you and your husband's request to drop the subject entirely and not their perceived entitlement of their desire to have grandchildren.", "You probably shouldn't have done it that way. But it is completely understandable.  The in-laws had to be told, enough is enough.  So I'm not gonna call you an AH for that.", "You've still experienced a loss and not a lot of people get that. You were basically using a situation people can be readily sympathetic with. NTA.", "NTA.\n\nYou can adopt or use IVF?? Really???? Gosh, I bet you didn't know that already. Your family needs to BUZZ OFF and leave you two alone. They're nosy and invasive.", "Nta, I know it's sad but just let people know the truth. These problems are because they are rude and hoping. Maybe let your mil know \"I'm infertile, I wish I weren't. You bringing it up is severely hurtful.\"\n\nI'm sorry for your bad luck, but it's nothing to be ashamed of.", "NTA, now maybe your in-laws will stop sticking their noses where they don’t belong (your sex life, uterus, etc). Sometimes the only way to shut something down when you’ve given reasonable reasons/answers a billion times with no results is shock factor results", "NTA - The only response at this point is \"Why are you so obsessed with what I do with my uterus?\"", "Nta I think it was the perfect move to end these invasive and disrespectful questions. Your upset friend was probably just projecting her feelings onto \"all women who've ever lost a pregnancy\".", "NTA.  You said what you had to say to try to get these insensitive louts to shut up.  Here's another suggestion.  \"Dear \\[Insensitive  Louts -- or their names, take your pick\\], We are not open to discussing when we're having childen, why, or why not, or your desire for grandchilden from us ever again. We are not open to discussing this note.  We are not open to another word from you on this topic.  Ever.  If you violate this, we will go NC for \\[fill in the blank\\].  Sincerely, Person Who Had to Do Back Flips to Try to Get You to Shut Up.\"", "NTA. \n\nI've miscarried 2 pregnancies, and I opened your post with an aire of judgment and fully planned on voting the other way, until I read your reasons. \n\nI hope they drop it and stop pressuring you.", "Nta. I would do this.", "I have lost 3 pregnancies- NTA OP. It's none of their fucking business and if that's what shuts them up and makes them realize that prying has consequences, that's what it take.", "My wife and I are in your situation, just further downstream.  Married 25 years, no babies.  We're in our late 40s, so the fertility ship has sailed.  \n\nIf I may say so...you handled this all wrong.  This is how you respond to the next person - family or not - who asks \"Why aren't you pregnant yet?\"\n\n\"I don't know!  We kiss and we kiss and *nothing happens*!\"\n\nOkay, now getting serious: NTA.  Your in-laws are entirely aware that you can't have children and they still wouldn't back off, so they pretty much asked for it.  File this under FAFO, if you prefer.  \n\nPlease accept a bit of praise for making lemonade out of lemons.  One of the advantages - and I use that word deliberately - of infertility is that we tend to have time and resources that families with children don't have.  My wife and I also aspire to be the cool aunt and uncle so we can spoil kids rotten.  \n\nIt really is possible to have a blessed, joyful life in spite of infertility if one is willing to make the necessary adjustments, which is what you're very much doing.  \n\n(infertility fistbump)", "Having miscarried 4 of mine I have zero problem with this! They were being massively intrusive and rude. You are dealing with things the best you can with boors!", "Miscarried twice also and seconding this comment.  NTA", "Have had two miscarriages myself and am consequently child free at 44, so pretty much not having children and I think what you did was just fine. Your in-laws sound monstrously insensitive. NTA", "My wife and I have been married for 25 years.  No babies.  We're in our late 40s, so for us, the fertility ship has sailed.  \n\nThanks to our lengthy and distinguished infertility resume, I have a wealth of experience with people who ask the infertile when they plan to have babies.  And to be quite frank, OP handled this all wrong.  Here is how you respond to the question, \"So when are you guys getting pregnant?\"\n\n\"I don't know!  We kiss and we kiss and *nothing happens*!\"\n\nAlternatively, there's always: \n\n\"I don't know!  We've fed him raw oysters and done it missionary three times a day at home and in my car, and it still isn't working.  Maybe you know the best coital position for optimal conception?\"", "Same, wife and I lost two but I don't blame them for the comment. Some people have to have a graphic reminder that not everything is easy or possible before the STFU. \n\nNTA to OP.", "Agreed. I think her answer is the answer all these idiots should consider getting before they open their mouths. So many insensitive people.\n\nI've had trouble ttc 1 and miscarried as well, having received similar infuriating comments I wish I'd had the balls to reply honestly. Might be a fair few less insensitive folk if we all did.", "But didn’t they already tell the truth when they said she couldn’t get pregnant?", "A very empathetic response. Thank you (from one of those people who can't conceive)", ">However, I don't think you helped yourself in the long run, because the IL's will take what you said as evidence that you can get pregnant.\n\nMeh, all that has to be done is extend the lie a tiny bit and say the miscarraiges ruined what little chance there was of a pregnancy being carried to term.  Which IS true in the sense that OP can't get pregnant no way, no how.  The destination is the same, who cares if the route there was different?", "It's a great first step if you're ready to open up to people who have repeatedly been dismissive of your feelings and boundaries. Not everyone is ready for that, or needs to be. Appeasing their curiosity with honesty is not important here.", "That’s what I was thinking, I don’t think she’s TA necessarily but why not just tell the truth?", "But why should she have to open up about a (some would say deeply personal) medical condition? Especially to people who have repeatedly asked intrusive questions, made unwanted and unasked for comments, and ignore the fact that this is an uncomfortable and inappropriate conversation for OP and her husband. They can’t be totally oblivious that OP and her husband don’t like this topic after they’ve pushed back so many times. OP shouldn’t be forced to give up private information to make them stop.", "Heartily disagree. You should not feel obligated to explain your childbearing status to anyone ever. It’s not anyone’s business. If you feel inspired to do so, that’s up to you.  But if you are pressured? NO. \n\nNTA for mentioning non-existent miscarriages. You needed them to back off & you succeeded. \n\nThe fact that your ILs feel entitled to grill you in front of a room full of people is outrageous. I hope you feel comfortable telling them to drop it if they bring it up again. Because the double standard where they think it’s ok for them to make you feel uncomfortable with their relentless questions but their discomfort at your boundary-setting needs your apology? Nope.", ">lying about a miscarriage is a slap in the face to everyone woman who's experienced one. \n\n\nOn this thread alone, a significant number of people who have suffered miscarriages have proved that isn't the case.\nI have personal experience of being woman who has no possibility of ever being able to conceive despite always wanting to have children.  I grieved for the children I'll never know, felt like a failure, felt not a complete woman (the latter 2 feelings I now know to be part of the grieving process and  not true). It's not a competition as to whose pain is worse. The OP was pushed beyond her ability to cope and while there might be some difficult questions, as you suggest, the AHs are the relatives that pushed her to that point.", "Manipulative... Like begging your children to have children", "No, you really can't. For the same reasons the OPs relatives shouldn't have been asking questions, it's intrusive", "I am so sorry for your pain.", "I've noticed that people who have the \"It would've been funnier if they'd done it the way I would have\" mindset are never anywhere near as funny as they think they are.", "I've dealt with infertility and multiple miscarriages and she has my permission to shut down these awful, invasive, and insensitive conversations any damn way she can.", "They ruined her mood too, while essentially prying into a very private part of OPs life. They're literally asking her, \"hey are you guys having unprotected sex yet? Can you please do it more often?\"\n\nAnd they left her no choice unless she wanted to fully disclose her entire medical history, which she doesn't need to do. \n\nAlso, she's not really that far away from a miscarriage. One way or the other, she's not having children. Hopefully this shuts them up.", "She'd just need to remind them being able to get pregnant and being able to carry to term are two different things", "It’s possible she already did. It’s just not 100% clear from the way she summarized it whether she explicitly said “the doctors have told me it will absolutely not happen.”", "Guys. It’s a suggestion. Not a demanded script. There’s lots of ways she can lay strict boundaries, I was asking for INFO if she has.", "I don't really get the benefit of opening up about fake personal medical information vs true personal medical information.", "OP could have just stopped going to events. I've suffered multiple miscarriages, this feels like a slap in the face to me. Just because it isn't to some doesn't mean it isn't to everyone.", "I am not trying to be curious here. I know it's none of my business but as an infertile woman I don't support mixing biological and psychological reasons. There is a big difference between not being able to conceive and not being able to adopt.", "Maybe, but when you deal with a challenge that will be with you for the rest of your life, you have to find some humor in it.", "they left her no choice? you always have a choice when you want to spread a very serious lie.", "they want grandchildren is that so wrong ? no it’s not and it’s her family if she doesn’t feel comfortable having an honest conversation on why she can’t have kids then she’s the problem. i think it’s a very easy solution to tell them the truth and hopefully it’ll shut them up. she’s lying about something that has ruined so many women’s lives because she doesn’t want her family to know the truth? she’s the problem not the family.", "But people can equally be crazy about their own health in the name of reproduction. I have a ex-friend who lost 6 pregnancies, one ended in a full term still birth. And she STILL kept trying despite her health risks and issues. She almost died of preclampsia in the end. But she finally got her baby.🙄 oh did I mention she's a verbally abusive mom too?         \n\n\nI agree. some people can't accept reality and will push and push", "It’s wrong to continuously ask someone to give them grandchildren as if they are entitled to them. No one is entitled to know why someone decides not to have kids.", "Jesus you actually think it's ok to pressure women to have children?", "It's not wrong to want grandchildren. It is, however, wrong to constantly badger someone to \"give them\" grandchildren, as if you just go down to the grandchildren store and pick some up. No one should have to give any excuse or reason whatsoever for not having children. Shutting down the conversation once in a respectful but firm way is all that should be needed. Obviously this delusional old bat wasn't doing her part to be polite and STFU when she'd been told numerous times to stop. So if OP got fed up and said what needed to be said to get the rude old cow to stop, and she's not going online or shouting from the rooftops that she'd had a miscarriage in an attempt to get sympathy points, I really only see positive outcomes to how she handled it.", "If they want grandchildren so bad, why don't they foster? Volunteer to work with kids? Get a goddamn goldfish? Why don't they take in, ya know, **the grandchildren the family already has**?? She's their daughter in law, not a fucking incubator for a bunch of selfish assholes\n\nIt is NO business of anyone else why someone is or isn't pregnant, if they're trying, what they're doing, whwhat they're not, if they've seen a doctor. NOT. ANYONE'S. BUSINESS.\n\nEdit: just checked this person's profile and they are the single most obvious troll", "Found the MIL. \"bUt iT's hEr fAmILy!!!\"", "It's wrong when they are trying to push a life changing choice onto someone else. It's not their body, and tons of people who have experienced miscarriages have given their blessing to this lie. The in laws have no right to her body or medical history", "i think i’m this scenario telling the truth would be beneficial to both parties.", "no where did they pressure them to have kids. they want to know WHEN they’re going to have kids and there’s NOTHING wrong with that.", "i can tell that you’re very angry and are being aggressive so change your tone thanks. anyways foster their own grandchildren? huh that doesn’t make sense. and so you’re saying lying about having a miscarriage is okay? i think you need some help.", "They are not owed her medical history. She does not have to tell them why they can’t have kids. Infertility can be incredibly distressing to some people.", "She did. They wouldn't quit.", "Yes, I'm sure everyone would have an enjoyed an extensive dinner conversation around his sperm count and the exact functionality of her lady bits.🙄", "The entire line of questioning \"when are you having kids\" is pressure. I'm guessing you're one that asks that question all the time without a single thought about how absofuckinglutely rude and condescending it is.", "So obviously you're one of THOSE people who doesn't understand how invasive and insensitive this kind of a question can be. It is putting pressure on people and it's incredibly rude. Stop it.", "So if someone asked you when you'd give them $10,000, and brought it up every time you saw them, asked how the saving was going for their $10k, suggested you should get another job so you can earn more to give it to them sooner, and would not drop it after you'd explained multiple times that you do not have $10k, and would not be giving it to them ever....\n\nYou really wouldn't feel like they were pressuring you for money??", "Not to mention, giving her real medical history might only incite further discussion. MIL would get to blame OP for being infertile, and might try to get her husband to divorce her and find someone who can produce those coveted grandchildren. Or she'd go do some Google \"research\" and have a new bit of \"medical advice\" to give every time they saw each other. It would still be exhausting, and might even be worse. I'm 1000% on team Lie To Get Rude, Judgy Old People To STFU.", "no she lied and said she had a miscarriage which is not what happened so she didn’t tell them the truth.", "Did you not see the prior part of the post where OP talked about previous questions?", "I've had a miscarriage. It is nowhere near comparable to losing an actual child. Get therapy.", "Why is your husband standing by and allowing his family to harass you this way?  He needs to tell them to STFU and leave you alone.", "NTA I've also miscarried twice this year and I support what you did, kudos to you for getting them to shut the f*ck up! Infertility, miscarriages, and accepting life without children is all so, so painful - no need to compare it all, it all just sucks. I'm so sorry for all the disrespectful and hurtful comments you've had to endure. If your comment gets them to stop opening up fresh wounds with you, it'll be so worth it.", "I lost a pregnancy this month, so although I by no means speak for everyone who has lost a pregnancy, I do understand the pain. \n\nI don’t feel it was disrespectful, but it’s not because they were being asses about it (and they were). It’s because when people through around dumbass comments like this, THEY DON’T KNOW. \n\nMaybe they are childless intentionally. Maybe there is trauma they are working through around having a child (or another child). Maybe they have been trying and struggling. Maybe they HAVE been pregnant and lost a baby, or multiple.\n\nThat’s why you don’t throw around these conversations lightly about it “being time” or whatever other nonsense. Because these things hurt like fuck. And they’re way more out of our control than old infertile grandmas pretend they are. \n\nRant over. NTA.\n\n\nETA: My heart goes out to you both in your fertility struggles, and you have my respect for accepting it and using it to be amazing an amazing auntie/uncle. Lots of love your way ❤️", "NTA. They do realise that gay men still can be fathers right?", "NTA. Rude, impolite, and none of their business, no matter how related they are. \n\n\"When someone asks you a nosy question, simply say, “Why do you ask?” (Ann Landers)", "NTA. People who ask this question deserve to feel bad about it.", "I’ve had both a miscarriage and a stillbirth. I think you’re NTA. You’re also grieving a loss. True, there wasn’t a baby or pregnancy yet, but you’ve lost the potential for either one. That’s real. I’m so sorry you’re dealing with this. Yes, you technically lied, but they weren’t getting it when you were honest. It’s selfish and rude to ever harass someone about when they are having a baby- it becomes downright cruel when you already told them you can’t have babies. \n\nI’m sorry.", "NTA - have had a miscarriage and fortunately successful IVF, but dealt with tons of questions from ignorant people along the way and unfortunately some people won’t relent unless you do something drastic. So I think you did the wrong thing but for the right reason. I hope they feel like shitty people now.", "NTA. I’ve lost 4 pregnancies and you have my permission to use this excuse as often as you like to raise awareness- people need to stop this shit.", "Please consider adoption.", "NTA", "NTA for lying. Say whatever you want. These conversations are hurtful.", "I don’t think y t a here because it came out of duress but I think you could’ve said something else than to lie about something so painful.", "I was all ready to be pissed at you, but NTA. \nHave you considered screaming at the top of your lungs whenever they ask you about it?  It wouldn't help them but it might be therapeutic.", "3 losses and 5 kids here...definitely NTA. The comments are horrible and I understand the need to shut them up.\n\nI have a sister in the same position...I see her loss as very similar to mine. Her desire for a child is very real and her inability to have children is a huge, devastating loss. No judgment here, OP.", "NTA they needed to learn to stop asking", "A miscarriage is not a greater lost, just a different loss", "NTA.  I'm a woman that has carried my firstborn child, my sweet baby girl to 6 months, only to go into preterm labor and watch her die an hr later. I've then had 6 years of unexplained infertility and finally was able to get pregnant and have four babies...I get it, I understand the frustration felt when people don't know when to back the hell off and STFU about these issues. They kept pushing and pushing and poking and prodding. I'm sorry you have to go through this.", "Eh, maybe ESH, I think lying is automatic asshole behaviour.", "ESH. They obviously suck for prying. Your mistake is lying. Unless the nazis are banging on the door asking if you're hiding any Jews in your basement, it's almost always going to be a moral and ethical fault to lie about serious matters (not talking about \"polite\" lies), and practically speaking it's going to backfire much of the time as well. Understandable error given the pressure of the moment but I'd not get in the habit of using fictions of that nature to take off the heat.", "NTA fuck them I'm glad you made them uncomfortable.", "NTA I had a mother who wouldn't stop badgering me about babies, I finally told her I can't, the doctors say I won't survive so she had a choice, you get me or a grandkid because both won't survive and there's a good chance both of us will die. Make a choice. I stood there staring at her waiting for her reply. She said she chose me and never brought it up again. \nSometimes tough love is needed when family don't back off.\nAnd anyone telling you differently hasn't lived through a pushy patent wanting to be a grandparent.", "NTA", "I’m 18 F, got diagnosed with thyroid cancer when I was 16. I had it throughout all of my adolescence but it went undiagnosed. I never went through puberty properly and that alongside my medications and not having s thyroid, I’ll never be able to carry to term. I could theoretically get pregnant but I’m already grieving infertility. I don’t want to grieve over a baby that gave me the hope of founding a family only to have it die. I understand why you told that lie. \n\nI’ve been talking to other people who’ve suffered infertility, miscarriages, etc and from what I’ve seen, I don’t think you were insensitive whatsoever to lie about it. \n\nIt’s a grief of its own but it’s one that does connect us to others who’ve struggled to start a family. You’re NTA hun", "NTA. You responded to ongoing rudeness with something that would stop it.", "NTA, but lies tend to be found out particularly when there are some people who know it's  not true. At least two people know it's a lie so there's likely others who know too.  \nNext time someone starts the conversation, shut it down immediately:  \"It's a sore subject so let's drop it now\"  \"No, I don't want to have this conversation again\" \"Let's discuss your private matters instead\" \nHopefully, you've put a stop to this line of questioning.  If not, you're going to have to be blunt and say it's no longer up for discussion - say it very loud and very clear.  Your husband needs to tell his parents that you will not be producing any grandchildren and that you do not want to discuss the matter further.", "Most people i can just tell, nope, no kids, but hey we have awesome dogs!  Some people are...pushy. I've had to explain to some - truthfully- I had ovarian cancer, it really, truly wasn't possible.\n\nMostly that shuts them up,, but sometimes they STILL continue to push. I just blink at them because, seriously, what else is there to say at that point?\n\nFortunately in my case the family has been great though. Im so sorry you have to put up with this, OP. Whatever you need to do to make them stop the foolishness, you have my vote.\n\nNTA", "Personally, I feel like we should denormalize asking couples when they’re having kids. It doesn’t accomplish anything positive and it just serves to pressure the couple unnecessarily. NTA, it’s already hard to know that you won’t be having children despite wanting them, but your in laws drilling you guys with questions isn’t helping anything.", "NTA - at some point though I think a very direct, \n\n“we are done having this conversation, we are not having children, do not ask about this ever again” \n\nNeeds to happen, if they continue after that you should probably start cutting contact bc they clearly don’t get what they are doing wrong", "NTA. It's completely fair to ruin their moods when they insisted on doing it to you!", "ESH- people shouldn’t ask so they are worse, but you could just say you aren’t having children and to stop asking. It’s like lying about the death of a family member.", "YTA and you actually made the problem worse because now they actually believe that you have the ability to GET pregnant.  To which, I guarantee, they are going to resume the harassment after a few months.", "YTA for lying about having miscarriages. The trauma of infertility sold be enough. I hope you can set boundaries w them.", "OP, NTA but also this is not going to work out how you planned if your family is anything like my husbands. I had three losses in 9 months and it wrecked me. I anytime I was asked when I’d give the family a baby I said “When they stop dying inside of me.” The same people asked me the same question the next time I saw them. You don’t owe them your medical history but sooo many people have pulled the “well at least you can get pregnant” bullshit with me. \n\nI’m truly sorry for your circumstances and I salut you on your excellent auntie journey!", "Mother to a stillborn, and I'm saying NTA. You told them so many times it's not possible and they continued to push.", "NTA. I think sometimes it’s okay to fib about something that’s not true but could be true, if that’s what it takes to make someone realize how inconsiderate they’re being. Maybe there’s someone in their life who they don’t know has miscarried and this will cause them to check their fat mouths in the future. People get away with being like this because people are taught to hide their pain.", "NTA. I wish people would stop trying to pressure women to get pregnant. Not all women want to have kids, not all\nWomen can have kids.", "NTA. Given the circumstances, you HAD to shut them up. It’s so insensitive of people to drill other people about their reproduction. Whether it’s badgering a couple who chooses to be childless into having a kid they don’t want, or constantly reminding a couple that they are struggling with fertility and cannot have a baby they desperately want. You do not have to justify anything to them. And the fact that they are giving you advice and options as if you haven’t explored and discussed amongst yourselves is just so tacky.", "NTA, you did what you had to do to shutv them up.", "ESH. Just tell the truth or set a boundary. Don't claim a particular type of pain you evidently haven't experienced.", "My mother taught me at a pretty young age not to ask people about why they don't have kids because you never know what they might going through. I can't believe how many people don't get this!", "I have had 5 pregnancies that ended in loss \n\nAnd I completely understand why you lied.\n\nNTA", "I'm so sorry for your loss. Thank you for this response though, it makes so much sense. My friends had 3 rounds of failed IVF and when I had my miscarraige she was so ready to talk to because she understood. It was in a different way but we both had the loss of future as you've said", "I’m not the only one who’s saying this, but as someone who can’t carry to term, thank you. I don’t know you but your response was very empathetic and insightful. I’m so sorry for your loss and I hope that if there is a life after this one, your son sees you time and again living on with his memory in your heart.", "Not necessarily. Miscarriage and infertility are not mutually exclusive as far as I know. Or even if they are, she could say the situation changed. Just because you COULD get pregnant before doesn't mean that infertility can't come later.", "Agree, this won't stop the pestering. They'll just ask \"when are you trying again\"?", "Yeah this", "Miscarried twice here and if this shut them up then good.  Maybe they'll think twice before bothering the next person.", "She’s lucky they accepted it and let it go.  My in laws went on Google and started giving me diet and lifestyle advice", "I always love, \"Hopefully nine months from this morning!  Right, honey?\"\n\nPeople tend to back off.", "Persistent, intrusive comments are ineligible for attempts at humor. Glad they worked for you though.", "They should be respectful enough to not push. It's really frustrating and it probably happens with little comments, little \"jokes\", suggestions that are not at all subtle. Sometimes people don't listen and back off and need to be put in place harshly. Mine sure did. Not all parents listen.", "Because it's invasive as fuck??", "Oh helllllllll no. I'd go no contact with them so fast... I'm so sorry.", "THIS. I’m 18, have thyroid cancer and a ton of complications that have made it where I will never be able to carry. Long story short, I’ve had it for years and it’s affected my puberty and certain things like my uterus never grew to a size large enough to accommodate a baby, I will never be able to regulate TSH to get proper prolactin levels to carry, my pelvis shape is too weird and small, and I haven’t had a period at all in over a year now as part of that. But my mother has insisted since I was 16 (when I got diagnosed) that I still have my eggs. So has the rest of my family. They don’t seem to understand that I can get pregnant but it will never survive and I would be putting myself at risk. I also don’t want to have a baby via surrogate. I’ve always wanted to adopt (I’m gay and don’t have the “I want a mix of us both” opinion I suppose). But it’s holiday season. So I’ve been getting lots of “you can still have children and should. Give me (great) grand babies” and such", "It’s not *wrong*, but they are not entitled to them, nor are they entitled to their personal information. Some things, people want to keep private because, they are ashamed, it’s too painful, etc. Infertility is a complicated issue, Telling them that they unable to have children, can open up a whole other can of worms altogether too. \n\nThe questions of, “why”? “What’s *wrong* with you?” Likely looking at her first. \n“Is there something you can do to fix it?” “What about using a surrogate?” These questions, although asked in good faith, can be extremely hurtful.", "lol i’m too young to be her mother.", "this is an excellent analogy. sadly, i don’t think it’ll help.", "I feel like these people would just ask if she's tried yoga or something", "No, I mean before that. She told them that she was physically incapable of carrying a child to term, and they still wouldn't quit pushing her to get pregnant. I don't condone lying either, but I have a lot of sympathy for OP. I honestly don't know what else she was supposed to do here.", "They are TA for keep bringing it up but yes YTA for faking a miscarriage. \n\nJust be honest about it or be strong and stern and say you aren’t discussing it any further.", "Essentially what your family is doing is non consensually talking about your body, and putting expectations on your body. You have sovereign autonomy over your body and you can talk about it however you want, even if it means saying something (untruthful) that sets a boundary with your family.\nThat being said, it sounds like you didn’t feel emotionally safe by setting a boundary with your family before it got to this point. Like politely telling them to F off would have totallly been warranted (like asking them to please don’t bring up the subject of having kids with you, for example). I recommend seeing a counsellor to talk through how best to boundary set with your family. My sense is it will keep coming up with your family given that they have been so persistent, and they’ll likely be the type to need explicit boundaries because they clearly aren’t picking up your cues. Finding ways to ask them to leave you alone when they cross the line seems like a sustainable option in this case.", "YTA. You should be ashamed of yourself. Miscarriages are not something to jest about. Your best friend was right. If you’d done this in front of me, it would damage our friendship, potentially irreparably, as I have had a miscarriage", "NTA", "NTA. This is tough. Hopefully you get through it.", "NTA justified lie.", "NTA NTA NTA\n\nThe gaping assholes here are the ones who kept questioning your reproductive choices over and over and over again.\n\nYOUR REPRODUCTIVE CHOICES ARE NO ONE'S BUSINESS BUT YOU AND YOUR PARTNER'S.\n\nI don't understand and will never understand why people seem to think this is an OK topic to discuss.\n\nSorry you're dealing with this ignorance.", "NTA maybe now they will finally drop it for good", "NTA. While I don't necessarily agree with what you said, I completely understand it. I'm sorry that both sides of your family think it's acceptable to put so much pressure on you to have babies", "I miscarried a natural pregnancy and then ended up in fertility treatments, ultimately going to IVF (which was successful for me). There is a specific pain to a miscarriage. There is ALSO a unique pain to infertility - uncertainty and constant disappointment, the feeling of emptiness.\n\nThere is no pain Olympics. You don't need to compare or weigh your pain to someone else's. If someone has a worse pain, that doesn't mean you are wrong foe hurting.\n\nYour are absolutely NTA. They were rubbing salt in a wound and wouldn't shut up. You are totally justified in explaining your pain in a way that finally sank in.\n\nI am so sorry for what you're going through.", "NTA. as a childfree person, I can understand your reasoning behind this answer you gave under pressure and I would do the same if I got all the bingo questions you got. it’s tiring and you start to not want to see your family. I don’t blame you.", "Out if curiosity, why don't you want to adopt ?", "NTA \n\nPretty rude of them to keep asking especially if you’ve made it clear to them that the questions bother you. If they don’t want the hard answers that come with those questions then they shouldn’t be asking them.", "Not the asshole. I'm sorry for everything you've been through", "NTA", "NTA, I suffered a miscarriage earlier this year, and no I don't feel disrespected.  It's all under the umbrella of fertility struggles which just suck and hurt for everyone.  You didn't ruin the mood, your in-laws refuse to let the topic drop after you've asked them not to for the umpteenth time.  It sounds like you finally found a way to shut them up since you've told them you can't have kids and they keep harassing you anyway, rubbing salt in the wound.  They shouldn't have asked the question if they didn't consider that they might get an answer they didn't like.", "NTA. \n\nI would also never discuss which person is infertile because they seem the type to try to force a divorce so he can reproduce. \n\nI am so sorry. I hope you can go NC with them", "NTA. They were not respecting your boundaries and you had to embarrass them into silence.", "NTA, they kept rubbing salt in the wound so you lemon juice into their eyes. Was it crappy? Yes, but they were constantly badgering you guys.", "NTA my MIL grossly offered to be our surrogate using my husband.  It was such an invasion of privacy.  In laws can be the most relentless.   It makes you feel like your self worth is limited to your reproduction rights.", "NTA. Seems like a good, desperado self defense move. Glad it worked!", "Years of loss here and not offended one bit NTA they need to back off", "NTA. You gave them an opportunity to understand the situation and yet they continued to hassle you. I’ve had a miscarriage and I do not find it disrespectful in the least. \nNow they think there may be a chance of a pregnancy in the future. I hope you’re able to sit them down and once and for all let them know how hurtful it is to be asked this over and over.", "You know. I normally have a large angry for people who lie about them, especially after suffering my own. But NTA in any way. I don’t blame you at all and I’m so sorry you were pushed to that point", "I feel knowing that you’ll never be able to conceive is just as devastating. NTA.", "YTA.  You made up a lie that hurt a bunch of people.", "NTA. Good on you for shutting them up", "I'm so sorry you are having to deal with this from family.  My own mother knew I had uterine polyps, among other issues, had surgery and had my tubes tied.  Yet she would still, for years after my surgery, ask why I didn't have more kids and she wanted me Grandkids and how we were being so selfish.  It just did nothing but make me feel awful and bring up things I was trying to work through and move past.  It just sucks and I don't know why people think this is acceptable behavior.", "NTA hopefully they will learn and never ask a women about her fertility again. I will never have children thankfully I’m ok with that but it is so frustrating when people ask.", "NTA. \nHow dare people nag at other people about reproducing? It's very traumatic for some, sensitive to some and totally fine to some. Like if you want to share, you're going to share. If you don't want to share, you're not sharing. I'm so sorry you have to lie about a miscarriage for you to not get nagged at.", "NTA, these people need to learn that anyone could be going through this and to stop pressuring people. You are already teaching them in the perfect way. They don't care if you are uncomfortable, but they will shut up pretty quickly when it gets awkward for themselves.", "NTA. Nobody can compare miscarriage grief and the grief of being unable to conceive at all and say that a miscarriage is worse. It’s not a competition —it’s all grief, and I’m sorry you’re going through this.\n\n\nIf they can’t safely hold your honest answer, they can’t expect honest information. Whatever gives you relief.", "NTA. You taught them an important lesson. As a someone struggling with infertility, I get it, and I’m sorry.", "Damn. When I read the title, I thought \"there's no way this person isn't an asshole.\" I was wrong. NTA.", "NTA.\n\nYour situation isn't exactly equivalent, but it's in the ballpark, and it's an easier explanation than going into painful details that are frankly none of their business.", "NTA OP, I've had 3 miscarriages and anytime someone brings this up I tell them I JUST had a miscarriage last month to embarrass them.\nIt's crazy that in 2022 people STILL feel comfortable asking others about this.", "NTA.  I'm so sorry, OP - they never should have put you in a situation where you felt like lying was the only way to get some peace.\n\nIf you'd gone with the actual situation, they would have demanded a ton of information and then tried to litigate the specifics.  Your response made sense, and was the best choice available to you at the time.", "NTA I’ve lost a pregnancy before. My very first pregnancy. You legitimately cannot have children so if you need to use that excuse then use it whenever you want because clearly they won’t take,”we can’t have children” for an answer.", "My reply to total strangers is a deadpan \"oh I can't have children, but thanks for asking.\" Also, I helped to raise my niece, so I sometimes just tell people my kid is in her 20s and lives in another state. Once when someone asked when I was due (scrubs make basically everyone look pregnant), I looked her dead in the eye and said \"due for what?\" \n\nNTA, OP. Next time, if you can muster up tears on cue, crying hysterically and running from the room would be appropriate. People need to get it through their heads that anyone else's reproductive choices are none of their damn business.", "Bestfriends are supposed to be your number one supporters, that’s why they’re your best friend.\n\nReconsider that friendship IMO.\n\nHowever, I am really sorry this has happened to you. You and your partner sound like wonderful people and I wish you both a merry Christmas and a happy new year. ❤️❤️", "Miscarried once. No issues from me on using that. Have one healthy daughter and that's all I'm having due to health issues. One was risky enough. I LOVE when people tell me I will change my mind /s Like nope. I don't want to die thank you very much.\n\nEdit: NTA", "As someone that had 2 miscarriages before… NTA. I was preassured the same way until I talked about it. People need to mind their own business", "I am both very unlikely to get pregnant and unlikely to carry one to term if I did. And I've had a miscarriage. I understand how much pressure family can put on you, and I don't blame you for snapping at them. Personally my tactic in these situations has been to get graphically involved in describing why, exactly, I will not be having kids. Excruciating medical detail about why my hormones and uterus and ovaries won't cooperate, all the testing. And stark honesty about the level of grief that came with the realization, even while acknowledging that having kids has never been a big priority for me. And then the discussion of the terrifying miscarriage I suffered that I didn't say anything about and quietly leaned on my partner to get through it, specifically because I was afraid of the judgement and I can't imagine why I'd be afraid of their judgement since they've only spent the last 20 minutes impressing on me the fact that the only measure of my worth in the family is the ability to produce viable infants. I mean if they're going to be all up in my business then LET'S DO THIS. \n\nThey haven't said a word since. \n\nNTA. Look, If that's the only way you could get it through to them, then mission accomplished. TBH I think they ruined the mood by pressuring you. Basically they stirred the pot and asked for this kind of response. Who on earth doesn't realize there's probably a reason for you not having kids and maybe it's a touchy and painful subject? They're wrong for not considering that this is a terrible topic to harp on.", "NTA.\n\nI've had a miscarriage. It was a pretty traumatic experience. While you may have never been pregnant, the pain of discovering that the children you wanted and cannot have is real and valid. Having people constantly nag you and ask you those invasive, highly inappropriate, and personal questions that keeps that eound open, warrants your \"mood killing\" comments. I'm sorry you even had to go that route to get them to stop.", "NTA. Does your husband ever step in when his family is harassing you guys about children? I understand it is probably hard on him as well but it is his family and he should be the one putting a stop to it IMO.", "I'm so sorry about your oblivious family, and sad to hear about the losses so many commenters have endured. \n\nNo AH here.", "#NTA. You’re nicer than me, OP. My response to that constant badgering would be “Mind your fucking business!”.", "NTA \n\nYou shouldn’t have to disclose your entire medical history to anyone in order to have them respect you, your husband, your marriage, and your situation regarding children. \n\nI think the way you handled this was perfectly fine. Anyone who is that damn nosey gets what is coming to them. \n\nI’m so sorry you’ve had to deal and navigate through this. I hope you’ve got good support.", "Nta.  I wish I had children.  But unfortunately that doesn’t look like it will happen for me.  I used to cry over it a lot but I have accepted now so it’s not as hard.  But my mom always mentions having a grand child and It always hurts.   I’m 47.  Unfortunately it’s not going to happen for me   I wish she would stop and I have said I don’t think I can  but I don’t think she understands.", "Justified A hole. They need to know to shut up about it", "Listen. I'm a guy. I know I don't get a vote on this. But I know what the same questions can do to you mentally when they come over and over. I'm not mad at you for this. And I'm sorry you have to go through this. This is one of those where it should be justified AH. So NTA", "As a person who actually had two miscarriages this year, NTA.", "NTA but I would’ve said “we’ve tried everything, unless you’ve got magic, it isn’t happening anytime soon.” \n\nI feel the truth would’ve worked just as well, but I digress… perhaps they needed a harsher excuse.", "I think it’s more YTA to yourself. I get that your family is horrible and they absolutely deserve what you did, but lying about a miscarriage will just kick the can down the road for a little bit. It won’t be long before they start asking, “when are you trying again. Haven’t you morning enough?”", "I am so terribly sorry for your loss. 💔I teared up reading this. As someone who has been suffering years of infertility and now a year of IVF with nothing to show for it, thank you so much for saying this and acknowledging the pain. People looked at me like I was pathetic for grieving every embryo we transferred that failed with the exact same crap phrase “it’s not a real loss.”", "2 losses here with 1 successful pregnancy and totally NTA in this situation.", "IMHO, you are most definitely NTA!\n\nI’ve miscarried 6 times and I had to go through the same endless rounds of “well meaning” in-laws and even members of my own family. After the 3rd loss, we just stopped telling anyone when we got a positive on the pregnancy test. My doctors would list me as “high risk” just as soon as I came back positive. Then by week’s 8/9, it would happen again, and we would go through the grieving process again. \n\nBut it literally took my having an emergency hysterectomy at 47 after losing baby number 6, for them to finally stop. It’s not only intrusive, but downright hateful when a family member keeps “JOKINGLY” asking the dreaded question. When your all ready heartbroken over not being able to carry a child to term, that is the last thing you or your spouse want to talk about. \n\nOP has every right to say what she did. Some people just cannot understand or cannot comprehend the limits of polite conversation.", "I got the impression that she lied about being pregnant and having miscarriages. Maybe that's why she said she was disrespectful. I didn't she where the said she got pregnant, only that she couldn't.", "agreed. he needs to stand up for his partner because these are shared struggles.", "They don't owe anyone their medical history. Lie away OP. It won't stop if you tell them your medical history. They will just keep telling you different things to try. They obviously already don't care about overstepping boundaries, just make it uncomfortable for them until they stop.", "Nah hopefully op traumatized them just a little so they never ask a women again", "No it actually helps ppl who have gone through bc hopefully family will never ask again.", "Nah hopefully op traumatized them into never asking again", "Your friend is TA at the moment.", "Totally agree, I had an ectopic, tube burst killing the foetus and nearly me and I approve of her using this to shut them the hell up. \n\nAlso to OP bil being gay does not mean the bloodline is ending he could still use his sperm with a donor egg in a surrogate and have his own biological kid if he wants kids.", "Miscarried once. I’d also give permission.", "3 miscarriages here. I also give OP permission!", "LOL - reminds me of a story from a friend of mine who had twins. Yes, she was large because she was having twins, so she'd get questions about it all the time, often very inappropriate ones. \n\nAn elderly lady in a store was like \"Oh, you're expecting!\" My friend was like, \"Yes.\" She goes \"Are you having twins?\" My friend was like \"Yes\" (in kind of an exasperated tone because she'd been asked a million times like that and felt like garbage because she was toward the end of her *twin pregnancy*).\n\nThen, this woman, A COMPLETE STRANGER, says to my friend, \"Did you use fertility treatments?\" WTF? Why on God's green Earth would a total stranger want to know (or care) how another person *conceived their children*?\n\nMy friend had just had enough that day and she looked the woman straight in the eye and said, \"No, actually, they were conceived when my husband fucked me up the ass. Don't you know that's how twins are conceived? Figured someone as old as you would know that.\"\n\nThe woman looked at her in shock, disgust and horror all in quick succession, turned and just about ran away.\n\nI do agree my friend's response was a bit harsh, but the question was also wildly inappropriate.", "\"Oh I just LOVE babies!! But I've never been able to finish a whole one....\"\n\nNTA", "Im sorry, but this made me laugh.", "Correct- one miscarriage, one successful pregnancy, now I’m infertile. I think people should just be honest though, because the lore we normalize this shit the less people will ask and the shame will be placed on the people who ask and not the people who don’t have children for whatever reason.", "You’re entitled to your opinion", "Miscarriage plus multiple chemical pregnancies. I was able to have kids via IVF but you know what? OP is all good with me. Whatever it gets to get these people out of her business.", "What is bilughing?", "I had twins (my grandmother was a twin, so it runs in our family). LOTS of people asked it they were conceived naturally. They are also boy/girl twins and looked very different anyway, and I was asked if they are identical more times than I can count. People can be dumb.", "OMG! I had full term twins at 26 and your friend is SO RIGHT! Fertility questions, did you try questions, do you know how hard it's gonna be questions, how much college will be (actually, less than for 2 kids born 4 years apart because of how the FAFSAform works).\n\nMy favorites are from after the birth...I can tell they're a year apart (no, trust me, twins. I was there) and for my girl and boy twins, are they identical EXCEPT FOR THAT? (uh, no, biology class anyone? )\n\nI digress. I cannot absolve of the miscarriage white fib because I've not experienced, but I can say I never ever ask about people's baby plans. No. My. Business. And you shut them up so good on you.", "Lol \"bothering\" lololol", "I had a NURSE ask me if my boy/girl pair were identical at a paediatric hospital appointment. \nTwin mum solidarity 🙌🏼", "And it's not her family , it's her so's family.", "People can suck so much sometimes, why can’t they just listen?? I’m sure you’ll be a great mom one day!", "Don't forget the \"What about our grandchild\".", "They have not given up.  They will probably give you a couple of months to get over your loss and the tell you to try again", "NTA. Maybe I'm the crazy one here, but isn't it the fucking epitome of entitlement to demand someone else to \"give you\" a human being for your entertainment and enjoyment?!?! I can't believe people ask these questions, it's so invasive and disrespectful! This \"give me a grandbaby/niece/neffew/playmate for my own kid\" *NEEDS TO STOP!*  this is wrong under any circumstances, in my eyes. Imagine digging yourself SO deep in other people's business, where you actually end up in another person's womb 😳 (figuratively speaking, haha) and thinking you have ANYTHING to say about what should be going on in there....that just seems straight up psychotic to me. I can understand why you lied and I'm sorry that you are surrounded by this. If anyone ever asks me this question, or I overhear someone being asked this, i will be sure to address this craziness right away, preferably in front of everyone who will listen so that hopefully this stupid shit will stop. Crazy people be acting like a whole entire human being is a \"thing\" to be entitled to, because it would be convenient or fun for them....SMH 😔", "NTA at all whatsoever. Your medical history belongs to no one but you. No one is entitled to that knowledge. \n\nI don't see that as a lie - i see it as an obviously-overdramatic-because-they-forced-the-issue-was-required-to-get-them-to-stfu type of statement.\n\nI hope they learn to hold their tongues.", "NTA - I am so sorry they were pressuring you so much you resorted to this hyperbole, but if it killed the mood it did the trick.\n\nStick with the lie unless your partner is uncomfortable with it.", "As someone who has at 4 miscarriages, one of which almost killed my. You are nta, you couldn't get them to respect your no without lying.", "When will people stop asking when someone’s going to get pregnant/have children? \nNTA.", "NTA, I don't know why your friend is talking about this as someone who has never experienced that kind of loss. I don't get why she's white knighting for a community that isn't asking for her help.", "NTA", "NTA. my husband and I tried to get pregnant for a year and ended up going to a fertility doctor. We got tested, and there were issues on both sides. We did IUI, and I actually got pregnant while taking Clomid for the testing portion. Sadly, I miscarried at 6 weeks, and after my body reset, we did 6 rounds of IUI and never got pregnant again.\n\nMy mom didn't really ask about the process unless I brought it up. His parents, on the other hand, constantly nagged him about it. And it blew my mind because they had so many issues conceiving that they adopted his older brother. There were secondary fertility issues for them, the same thing my husband had issues with, and my husband was a total surprise when his older brother was 13. I mean, if you had issues yourself, how about being empathetic when someone else is having issues.", "It’s super bad karma to lie about something like that. YTA", "NTA. I’m childfree by choice, not by circumstances so I understand the incessant “where are my grandbabies” questions. I don’t get them anymore now that I’m divorced and almost 40, but if it got the in-laws to shut up, I say you did the right thing.", "NTA. Miscarried twice as well. You go right ahead and say it Addison if you need to.", "as someone whose lost a pregnancy and still and always will be very emotional about losing her - NTA, at all. It doesn’t matter that you technically didn’t have a miscarriage, they’re nosy and wouldn’t take any other explanation. if that’s what it takes for them to stop, oh well. people need to stop asking these questions. whether you’ve lost a baby or are unable to conceive, i don’t think people who haven’t experienced it, truly just don’t get the pain. they don’t understand that stabbing feeling in your heart when you get asked those questions. they don’t get the GUILT you feel as a person who wants children and their partner wants children, but you can’t conceive and as much as we know rationally it isn’t our fault - it doesn’t stop the guilt and shame. and it’s because of the way our society views having children. having children shouldn’t be what defines a good life. that’s just not fair for people who have literally no choice in the matter.", "I don't know how anybody thinks asking about a private choice in their life is appropriate. You never know what someone else is going through. My family destroyed my sisters holiday by asking questions when she was struggling to conceive then told her to get over it when she miscarried. I don't understand how anyone can be that nosy and heartless. \n\nNTA at all. I'm sorry for your struggles. ❤️", "Ye", "YTA. Failure to conceive and a miscarriage are different. Don’t makeup miscarriages. \nI’ve never been told I absolutely can’t have children. I can only imagine how devastating that must be. \nI understand the struggle to conceive. Ive had multiple miscarriages, failed IUIs, and am on my first cycle of IVF. \nI do not agree with you lying about miscarriages, especially when weaponizing to shut someone down. \nMaybe consider a open honest convo with the in-laws on how their questions make you feel. Walk them through every step you’ve taken. Do so repeatedly if you must. Don’t lie. \nYo\n\nYour also doing a disservice to those of us out here trying to normalize miscarriages by sharing our experiences. So let not make lying about something like this okay.", "NTA", "NTA", "As someone who has miscarried the in laws took it way too far and you did something I think was appropriate in response NTA literally not even a little it’s sad that you had to lie for them to accept it instead of them listening to you to begin with your medical reason is just as valid and I’m sorry they continued to back you into that corner by invalidating you", "NTA, it's no one's business, and them pressuring you was unfair to you and your partner. Obviously, lying is wrong, but for this reason, I totally understand.I've suffered multiple miscarriages and still births, and I can understand why you would say this. Glad it helped. Best of luck to you and your partner. Here's to hoping people stop asking these insanely private and rude questions.", "NTA.", "NTA.  Must be very hard knowing you can’t have children. I’m very sorry you have to go through that. Your family should leave it alone at some point  and since they didn’t you did what you had to do. Hope all is okay for you!", "Not at all. Neither you, your husband, nor your BIL owe ANYONE grandchildren.", "NTA, if you could you’ve indicated you would want to and for all intents and purposes you could kinda say you did, you may not have lost a baby in the womb but you lost the baby you thought you could’ve had. The don’t get to determine what you feel comfortable telling them and they didn’t need to continue to pressure you. Hopefully this stops the barrage of pressuring questions forever.", "Nta but I think I would have instead, simply and without anger, told the truth about your struggles and about how much the pressure and questions hurt. There is no shame in what you and your husband are going through. Your family with the inappropriate and invasive questions should be ashamed.", "We had friends who it took 16 years between first kid and second. They were CONSTANTLY badgered by family when they were going to have another. Then after the second one they immediately got pregnant again. The same assholes who badgered them about having more turned around and kept asking them \"don't you know how you ended up pregnant?? Wow, calm down you guys\". I would get so pissed off for them!\nNTA!!!!", "NTA\n\nWhen will families understand it is in poor taste to ask about pregnancy AT ALL… I will defend anyone who has to do what it takes to get them to stop. Especially when the real reason to why not is a sensitive one.", "NTA. You don’t owe people your private medical details and your response was a simplified answer to their intrusive questions.", "I've had a miscarriage I'm not offended in anyway and I don't blame you for going this route to get them to stop badgering you. Clearly NTA", "YTA. If you wanted to make them feel like crap, and so they should, why not tell them the truth?\n\nI had people ask me for years (I had fertility issues), and I finally shut everyone up with the following: we have fertility problems, thanks for asking. Now you can feel as crappy as you've made me feel.\"", "NTA. People are so inappropriate. Even though you didn’t have a miscarriage, someone else they might pressure could have and they need to know these off-hand comments can really hurt a person. You never know what someone’s going through so you should keep opinions about others’ life choices to yourself.", "NTA. Jesus. I would have Hulked the f*ck out on them ages ago. Telling people they need to have babies because *you* want them to is so gross.", "NTA  Sometimes pooping in the pool is the only way to keep people out of it.", "I don't blame you in the slightest. You have a VERY legitimate reason why you currently do not have kids. And people wouldn't leave you alone. This put an end to it.\n(Also its not you and your husband's problem the bloodline in his family is going to die out)\n\nAlso, you probably already know this, but just because physically your body cannot become pregnant and have a baby doesn't make you a failure at all. This is literally something you cannot control. I honestly want to just give you a big hug and let you cry because you sound like an amazing person.\nBeing an auntie is the best and right now if that's all you are doing that's perfect. \nI wish you luck in the future, and hope family still stops bothering you about it.", "NTA\n\nI've had a miscarriage and am dealing with infertility. Your in-laws are being disrespectful, not you.", "NTA - I have had 2 miscarriages as well as spent 2 years dealing with infertility. Neither is “easier”, they are both soul crushing in their own way. If telling this lie gets your in laws to STFU, I am all for it. I am so so sorry for what you are going through and wish you every happiness as you begin this new path in your life.", "Had three pregnancies in one year. The third one stuck and is now a lovely elementary school aged kiddo. I’m not offended at all by OP’s comment because really, it’s not their business and they need to leave her TF alone.\n\nOP, you are NTA. They should mine their own business. Your medical history is yours and yours alone. Even if the reason for your not being pregnant was that you just don’t want to have kids, it’s not their business.", "NTA - as someone who has experienced both miscarriages and fertility issues requiring IVF. You did what you needed to do to shut down the harassment regarding having children.", "NTA. The comments they made are infuriating, hostile and completely unnecessary. And besides that, honestly...what bloodline? Last I checked, not a single royal family uses Reddit so I'm fairly certain they don't have centuries of inbreeding to ensure their bloodline's \"purity\". They're not the goddamn Targaryens. Every single person who is in that family shares the \"bloodline\" of several dozens of other families. If they're really worried about their bloodline or their \"family name\" ending, too bad, because that happened centuries before they were born. They can GTFO with that harassment.", "YTA. You lied about something very sensitive and painful for many people to avoid having a simple and direct conversation with annoying family members. \n\nNot sure how you undo the lie now though... I think you're committed at this point.", "NTA. They wouldnt mind there business, they reap what they sow", "NTA - you were honest and emotionally venerable doing so. If peoples feeling get hurt fuck them.", "JFC. I don't have any & have never wanted kids. I'm in awe when I see posts like this, however, because I know there are folks out there wanting them so badly. It's harassment to be continually asked about grand babies or frankly anything to do with your uterus because, well, it's YOUR uterus.\n\nEdited to add: NTA", "NTA. At all. First off, no one should be asking about such private and huge life choices. Second, no one should ever ask anyone else about medical issues unless given permission. \nWhen I was in my mid 20s, after 11 years of health problems, I had a diagnostic surgery where endometriosis tissue was found on multiple organs. There was a fair amount of scar tissue and not everything could be removed. At that time, I requested that my fallopian tubes be removed. I had mostly come to terms with being child-free, and the list of possible pregnancy complications cinched it for me. I still struggle with my health, but I know I won’t be bringing a child into this situation where I probably couldn’t provide adequate care on my bad days. That is a relief. \nNow when I get those nosy questions about when I’m having children, I tell people that I’m sterile due to medical complications. It could be considered a lie, since I asked for the sterilization, but I think I’ve earned it. And it does shut people up. Women shouldn’t have to have excuses or disclose health/sterility problems to get people to back off with the intensely personal questions. Say whatever you need to say to get out of those conversations.", "NTA, you didn't lie to gain sympathy or attention, you just wanted them to back off. I think it's justified.", "I think that when you are actively trying for a baby, every month feels like a loss. I’m so sorry, love. NTA.", "NTA. How many of us gals haven't had to resort to a lie one way or another just so that we can feel safe, or to make  lecherous men who don't understand the word no to back off, or as in OP's case to get the harassment to stop. One can only take so much badgering, before they rightly lose their shit! Ask the ones telling you that you are in the wrong: why is it ok for others to continually harass you and make you uncomfortable with their intrusive questions over and over? And why do they think that you deserve that type of disrespect? They are TA!", "As someone who went into labor early at 31 weeks and lost the baby, and STILL had people bothering me about when I was going to get pregnant….NTA OP. I hope they learned their lesson about being in peoples business they shouldn’t be in. Asking someone if/when they have kids or getting pregnant, is so fucking rude and should not be tolerated. Especially since you don’t know someone’s story with it. I will cut any of those people off and die on that hill.", "You get a pass. They just wouldn’t let up. I Can see you didn’t do this with malice or to manipulate. It was more out of desperation to stop having them harangue you!", "I’ve had miscarriages and was deemed infertile after due to endo and pcos but ended up having twins later but you are definitely nta", "NTA: Some details might change that judgement, but based on the information shared there aren't many details that could change that. If you started using slurs or demands, maybe.. but it looks more like you are sick of supporting someone who has no grace or appreciation. She can leave and K can join her. Maybe it will show K what you have given when it's not there anymore.", "NTA. I understand your frustration. My husband and I have 2 kids and after my second I had a procedure to prevent me from setting pregnant and its permanent. It was our choice but my parents complain that I need to have more kids and have actually told me that they are actively praying that God will perform a miracle and reverse the procedure so I csn have more kids, so honestly parents don't care what the reasons are they just want grand babies. Good on you getting them to stop.", "Uh yeah, you are TA. Just because you have been constantly pressured by your in laws does not mean you can use miscarriage as an excuse. I don’t want to compare the two, but you should’ve just said you and your husband can’t.", "NTA! You have not miscarried, but you have still lost a child in the sense of a future child. I would have lost it. This was the right and probably only effective response.", "That is so well said, and so very true.\n\nThrough IVF, I’ve had 1, lost one, then got pregnant with triplets and lost one (had 2).", "Miscarried 3 times....OP I find no disrespect in what you said you were saying what you needed to get those a-holes off your back. They were tue ones being hurtful and disrespectful to you. Sending internet hugs if you want them", "This is a great response. Why not just tell them the truth in the way it’s laid out here?", "Yep, asking about pregnancy is one of the most ridiculous things that are socially acceptable, especially if they end up shaming them for not having/wanting kids", "i’m loving the support from us fellow angel parents🫶🏻 i was worried i’d see a lot of the opposite. OP, you are a wonderful and beautiful soul and you are not defined by something your body can or cannot do. i’m so sorry to anyone reading this for your loss. because even learning you cannot have a child, it is a loss.", "OP, I give you permission to use my five miscarriages to get out of these conversations. Infertility of any kind fucking sucks, and it's only made worse by people insisting you need to have a baby to be a whole person.", "ABSOLUTELY.", "I’m so sorry for what you have gone through, especially the idiot comments. I’m sending you a Christmas hug.", "give it right back. they love babys,why arnt they having more? have they tryed the tipgrip method?i hear it helps even the elderly get that babybump they crave!", "Are you serious??", "They sound Asian...", "adding that to the list right now", "Thank you. We are all part of this “Club” that no woman in her right mind would want to be in. But the reality is this happens, our lives go on, and so do we.  \n\nAnd then we lean on our SO, our closest friends and family, all so that we can begin the process of going forward.", "Yeah but now they think she CAN get pregnant and it probably won’t stop.", "I mean, your story proves her right - she kept trying until she made it. If she managed to get a baby, her not being able to have a baby wasn't as much of a reality as you make it out to be. And if she's willing to risk her life because she wants something so much, it should be her choice. Just because you wouldn't do it because you have different priorities doesn't mean she shouldn't.\n \nHow good of a mother she ended up being doesn't have much to do with her reproductive health issues.", "3 born kids, 4 miscarriages/chemical pregnancies. I’m fine with you lying. None of her business. OP you are NTA", "Woman who had 2 miscarriages here... You're NTA. You told them no multiple times, they kept pushing the topic, you should not have to disclose your fertility journey to anyone. Bringing up a miscarriage to put a stop to a conversation you have tried to stop multiple times is clever and is a reminder that for many people, it's a sensitive topic and constantly harassing someone for grandkids can be painful. They're the assholes, not you, your lie was a survival mechanism to protect yourself, and I can't fault you for that. Honestly, I'm proud of you for hitting back!", "NTA. You said something off the cuff to get them to stop. But in truth, you are still experiencing your own pain. Realizing you've tried for seven years for nothing is an absolutely crushing blow. I tried for my only for six years, and it was only with a lot of treatments I was able to carry to term. It I was in your shoes, I would have been far more devastated. \n\nI'm sorry for your loss. And it is a loss. Fuck anyone who says otherwise. NTA.", "NTA and I’m so sorry you’re dealing with this. The truly enraging thing is nothing is ever enough. If you had been able to conceive and deliver, they’d want to know when another is coming. If you had all of one gender, “don’t you want one of the other?” Or if you had many children, you’d be judged for it. You can’t win. Don’t feel bad about defending yourself as you needed to to make it stop. \n\nMy husband and I have one child and the amount of pressure we received from certain family members to have more infuriated me. We explained, patiently, over and over that we had discussed it and even shared our reasons, but we were done after one. I finally had to get very sharp with someone and thankfully they dropped it (finally) after over a year of badgering that literally started the day we came home from the hospital. But I can absolutely see how you’d feel pushed into doing this to have some peace. Don’t worry about it.", "NTA. Your family is, though. \n\nFertility issues are one of the most challenging things a couple can experience, and I’m so sorry for the pain this must be causing you and your spouse. That said, as the child of an adopted parent, why does it seem like every conversation about infertility ends with “well, I guess we can never be parents.”? Don’t get me wrong, adoption is also incredibly difficult, time consuming, and expensive. But why does it seem like nobody realizes they can in fact be parents without conceiving and giving birth? This is NOT a personal judgement against OP, to be clear. This is just a trend I find in these types of conversations at large, one that I feel deserves to be mentioned. \n\nOP I’m so sorry your family is constantly giving you grief about this extremely sensitive situation, they need to shut tf up and mind they’re own business. If parenthood is something that you still want, I hope you are able to find an option that works for you, because you deserve it!", "People like this are the worst. Shut them up by whatever means necessary. NTA", "NTA.\n\nHow insulting to keep pressuring you for children when they know you can't. Your response was perfect and hopefully they'll think twice before saying anything in the future.", "NTA. Their insensitive AF comments ruined the mood. I’ve had 11 miscarriages, an early birth and subsequent infant loss. I STILL get comments of “why don’t you have kids yet?” At 40. I don’t hold back anymore and tell people flat out. I’m now 30 weeks with our hopeful rainbow and well be lucky to bring her home. If it makes them uncomfortable oh well.", "NTA. They should have respected you enough to not be that gross person who pushes their expectations on you.", "NTA. It still baffles me that people can’t comprehend how painful infertility can be and that somehow the loss of a physical pregnancy is more painful than the loss of potential pregnancies. They are both painful and both deserve privacy and respect.", "YTA lol. just be honest. this is awful.", "I miscarried once - NTA !!!!", "NTA", "Nta. Asking those invasive questions and saying those comments is disrespectful to anyone who’s lost a pregnancy. It’s insensitive and rude and invasive. If they don’t want to know, don’t ask. If they can’t take no for an answer, they can take the shitty guilty feeling for one instead. Yeah it isn’t great that you lied, but I think this situation justified it because they needed a lesson to be taught.", "NTA. People need to stay OUT of other peoples' fertility business. It doesn't matter if you wanted to and couldn't, or you never wanted to have kids at all. It's not up for discussion by anyone else and never should be. They were making you uncomfortable, so now EVERYONE is uncomfortable. And maybe they'll learn to stop poking into what should be a private matter.", "One miscarriage NTA and I fully approve this tactic. If they start asking again tell them the previous losses were to traumatic to continue trying", "NTA", "NTA. I'm terribly sorry for constantly being confronted with the pain every time people remind you of it and ask questions about it. It's a rude thing to do. I hope it shut them up for good about it.", "YTA \n\nThere are ways to handle this appropriately. This wasn’t one of them. Leave every time they bring it up. Go LC until they stop bringing it up. Refuse to engage in any conversations about your body. “Why are you so concerned with my vagina? The only people who need to know anything about my vagina is your son and my GYN. It’s really inappropriate and gross that you’re so into what’s happening with my reproductive health.” \n\nThis was just gross behavior in your part.", "NTA. This is the reason i always used to tell people I can’t have kids when they say something like this. I probably could have, many do with my condition. But I’d rather them get put in their place by me, someone who doesn’t want kids, than someone who is dying to be a mother and can’t.", "NTA. Even if you didn’t experience a miscarriage, you have experienced a loss. And apparently they’ll only respect that if you make it something they can understand.", "Having children or not is a personal choice between 2 people and no one else. Ideally, your husband can tell them that it's not happening and they need to drop the subject permanently.\n\nBut your way is acceptable. The poked a wound and your answer was easier than your complicated truth. The end result is the same and they have no rights to your medical info. My feeling is that if carrying on the bloodline was so important they should've had more kids to up their odds.", "NTA\n\nThe thing was that they were not talking no and after all of that, you gave them an answer that made them finally drop the topic.\n\nBut beyond that why is your husband not taking the lead and putting an end to it?  You know he could have said that he had a vasectomy or even that he was infertile and was not able to father any children what so ever, and that the adoption process fell through and it was not possible.", "If they are making you feel you must lie they are the assholes. Bring the best aunt and uncle is awesome. If you have room in your heart please find other ways to give your love and expertise. Maybe be mentors. I volunteered with some emotionally disturbed first grade twin girls. They had experienced a lot of trauma in their family and I had the chance to mentor them. It was super rewarding and I did want to take them home and keep them:) but was a steady presence so their family encounters were more positive. Be a Best Buddy through Best Buddies. Use your love and gifts in many ways. Keep your heart open. Be super super direct with family members and tell them their continued asking is hurtful and cruel and if they do not drop it you will not spend time with them.", "NTA. It's so messed up that it's the only situation that people have any empathy or respect for when it comes to not having children. But I know from personal experience that it is the case. Until that changes, whatever, do what you have to do. Hopefully someday people will understand that asking why one doesnt have kids is asking about their medical history, sexual activity, and values and that that combination is nobody's dang business at all.", "My first pregnancy was a miscarriage around four months. It doesn't bother me that you lied to them because your infertility is none of their business. You don't owe them grandchildren. I am sorry that you aren't able to have children since you obviously wanted them and I hope you are doing okay with the grief that often comes with that kind of news.", "Why didn’t you say “we tried and we can’t!!”? This lie was unnecessary because the truth carried enough weight of shame in itself.", "Why not just tell them the truth? Why pretend you are sharing a your medical history with a horrible lie. Either share your history or set your boundary with consequences, e.g., \"This is very personal and if you don't respect privacy then I will protect myself by only going where I am respected.\"\n\nGotta go with ESH", "OP: you are NTA. What you have to deal with is so difficult and I can see why you went with something like this as a self-protection move. A lot of us support you.", "While I know its devastating, not being able to conceive is not the same as your baby dying in a miscarriage. I don't think you should've lied. However, the family should respect the fact that you can't have children and that this is very painful for you. What you told them may not be a solution because now they think you can get pregnant and might start asking again after some time has passed. You should tell them the truth - that you can't have children, IVF isn't an option, their comments are very hurtful and they need to stop. If you decided to use a surrogate or adopt, that's your choice and it would be very disrespectful of them to push the issue.", "NTA. Being childfree by choice I do get getting pissed about being asked the same question over and over. \n\nI always tell people about my endo and wonky uterus. In detail.", "YTA 100% not to your family, but to the people who have actually gone through a miscarriage.\nThat's not something that's permissable to lie about having, ever.\nChrist OP, get your head together, just tell them the truth.", "I've had multiple miscarriages. OP, you are NTA and what you said is not disrespectful. Your family size is none of their business.", "Yeah.  Her husband is the asshole in my opinion.  Should’ve never let it get this far", "Seriously. People need to learn to shut up sometimes.", "Miscarried 4 times, I also give my consent to lie about this.", "Even knowing what they are going/gone through most people don't care. \n\nMy Mom had several miscarriages, a still birth, a son who died shortly after being born, and then I was born. Just barely, she almost lost me several times. \n\nMy aunt (her SIL), who was well aware of her struggles, said to my mom that her and my dad couldn't have a good marriage because they only had one child. What the actual F**$?!? \n\nFast forward, I have uterine cancer at 35, and treatment isn't working, so I'll most likely have to have a hysterectomy. My aunt knows this and STILL commented on a photo of my Christmas tree, cat, and dogs telling me the only thing missing was kids. \n\nSome people have zero sense. Like thanks lady both my mom and I are well aware of our inability to have kids. Nothing like taking a raw wound and rubbing salt in it.", "In Texas there was a woman with an ectopic pregnancy and they wouldn’t help her until thirty hours later when her tube ruptured. She nearly died.", "Lost two myself (first trimester followed by a missed miscarriage in the second trimester). OP is welcome to use mine & I support her response to these horribly invasive people.", "Yeah, I hate that we are all in the same boat with losses, but I'm glad to see us rowing that crappy boat like mad towards OP to support her in this. You say whatever you need to get them to shut their mouths OP.", "During my twin pregnancy, i can't tell you how many of these questions I got. I DID start having fun with the \"are you expecting?\" question after getting annoyed enough times. I'd look at them curiously and say \"no, why?\" Watching them backtrack was PHENOMENAL. \n\nThe \"are they identical?\" for boy-girl twins was also annoying. Didn't matter how clearly I marked 'em, couldn't go to ONE store without getting it a bunch of times. I'd keep my patience as long as I could, it's new for people. \"Pink one's a girl, blue one's a boy.\" \"But I asked if they're iDENTtical?\" \"Oooohhhh. You asked if they're identical. My bad. You see, the are differences between boys and girls. Girls have innies, boys have outies. Additionally, boys-\" \"i KNOW that.\" \"Then why ask if they're identical?\"\n\nHaving people put hands on me was not okay. Wanted to touch the Huge Pregnant Lady. I threatened one. Others i started to pretend the pressure sent me into preterm labor. 😁 Fun with Twins", "I did IVF, and am currently pregnant with twins. However, we did not ~plan~ for twins. It was still a VERY UNEXPECTED shock. My coworkers know I did IVF, and will still ask, “was two planned?”  Um no. I don’t think it’a anybodys plan. “How many embryos did you transfer?” It doesn’t matter how many I transferred. I ended up with twins. Get over it. \n\nPeople are so nosy.\n\nALSO….I had a family member ask when I was going to start having babies, literally just a couple of weeks after miscarrying. I answered, “well I actually miscarried a few weeks ago, so thanks.”  That shut them up really quick. NTA.", "Was told no possible kids at 18. Now a couple decades and a few kids later ala modern medical science, with multiple miscarriages and an ectopic. In my state, they are beginning to get down the slippery slope of a period is a possible miscarriage. Use that knowledge and shut the idiots up. They need to keep their noses out of your uterus.", "This is hilarious", "\"Oooh, are we googling how to 'fix' each other now?? I've been ready for this for *ages*! Hold on, I need a few hours and a *lot* of tabs.\"", "Happy cake day!", "No, she isn't. Go your young way and learn some manners. And may you get treated the way you deserve if you ask couples if they're having sex properly or enough.", "I'm with you I went through everything  I was not supposed to be able to have kids. I actually quit stressing and trying to burble stuff and now I have 2. My doctors were amazed and asked me what I took and I told them and they have actually been recommended to other people. C LA is ine this thar can help with pcos. That is just one if the issues I had.\n Edit due to talk to text", "\"Hey look, it says if you eat more quinoa and reduce lactose intake you'll become less of an interfering old crone\"", "NTA I've never been pregnant before so I can't speak for those who've miscarried but I think they would agree that knowing you can't have kids is awful in it's own right. Lying about it isn't cool but I understand why you did it and I don't blame you.\n\nPpl need to understand that it's a terribly invasive topic. In my opinion IT SHOULD NEVER BE BROUGHT UP IN A GROUP SOCIAL SETTING!! This is a super personal question and unless you're personally close with the individual SHUT YOUR CAKEHOLE!!\n\nI'm sorry for what you've had to go through. Hopefully you get left in peace now.", "ESH. Your in-laws are invasive and awful, but I don't understand why you lied about having miscarriages. Explaining that you are infertile is a way more effective reason, and it would be the truth. Now they're just going to think that you getting pregnant is a possibility. \n\nAlso, I *do* think it's offensive to lie about having miscarriages unless absolutely necessary. I don't think it was in this situation.", "NTA. Much like after a miscarriage, you are grieving your lost potential life, the life you expected to have one day. Even though there was no baby, you are grieving the loss of what you thought your future would look like, the loss of that potential family life you imagined. So please don’t diminish your experience - you were dealt a blow that changed your life trajectory! \n\nI don’t think many people who have been through a miscarriage would be upset at your words, because they’ve felt the sting of family member’s words exactly like you have. It doesn’t matter if it’s miscarriage or infertility, the grief still exists and the sting of expectations from others is rough.", "I’ve had two miscarriages with no living children. I also struggle with infertility. I had three surgeries in the last year. I’m now doing fertility treatments. I do stand a pretty good chance at conceiving with treatments, but staying pregnant is my big problem. First, I want to say that a miscarriage is NOT a greater loss than infertility. They are both hard. But they are different. It’s like comparing apples to oranges. Finding out that there’s a very small chance that you can have kids is a loss. I’m sure you’ve looked at gender reveals, baby showers, and nursery themes. I’m sure you’ve imagined plenty of moments with your future child. Having that suddenly taken off the table IS a loss. You shouldn’t feel like your pain is any less. Second, your in laws are 100% being assholes. Those comments are really painful, with any kind of infertility. I usually give a vague answer for the first or second time. After that, I will be bold and say exactly what you did. It makes people feel uncomfortable, just like they made me feel. However, I do feel like lying about a miscarriage is wrong. If you had said “We’ve been trying for years, but we saw a doctor and it turns out we’re infertile,” I would say NTA. I think I have to go with ETA. I think your in laws were being way worse, but I do think it’s wrong to lie about having a miscarriage. They also may now think there’s hope since you did get pregnant, you still could. They may ask you more questions, which can become a lot of lies. That’s where I think it’s more wrong. I understand you weren’t lying about it for sympathy or attention. And while there are a lot of similarities between infertility and recurrent miscarriages, there are some differences. Miscarriages come with things infertility doesn’t, just like infertility comes with things miscarriage doesn’t. Without being too graphic, I lost a baby that was 10 weeks gestation. The fact that people would say they went through that when they didn’t offends me a bit. The way you did it is much less offensive than those who did it for attention. But I still think it was wrong. Especially once a family member asks you questions about it and you have to go along with it. I’m really sorry you’re going through this. And I again want to stress that one loss isn’t greater than the other.", "NTA.  As someone who has had a miscarriage, I understand why you said what you did and would never hold it against you.  They are assholes for bringing it up past your already adequate explanation.  If this is what they needed to hear to shut the f up and act like adults, so be it.", "NTA. People should just learn to shut up. You did fine.", "NTA in my opinion, they clearly backed you in a corner about a difficult situation for you, and I’m sorry you were put in that position", "NTA\n\nYou tried to explain your situation regarding IVF and not able to have them and they didn’t listen. This was the solution to stop them making you miserable. It’s just really sad that they have badgered you for so long and you have to discuss your reproductive health with every member of the family. \n\nI’ve had two miscarriages. You weren’t minimising my suffering by telling your in-laws you had had two. You were using a different tactic to get them to shut up.", "NTA. I lost a child at 27 weeks pregnant.  You have my full support to get them to shut up however you need to. I don’t feel disrespected.", "NTA people need to get a grip and stop putting all their hopes and dreams on other peoples uteruses. It’s weird and creepy. You made them shut up the only way you could and teaches them to stop asking about other peoples reproductive choices, which is very personal. Putting that much pressure on you was disrespectful. Family members aren’t just baby factories to fulfill their dreams. You’d think they’d be supportive and understanding after learning you can’t have children.", "Absolute NTA", "I’ve miscarried more times than I can count and had an ectopic pregnancy in my mid 20’s. I came to terms with never having children then. So I feel for you OP. It probably wouldn’t feel so shitty if older generations didn’t only look at us like our sole purpose on this earth is to pop out babies. I finally got a doctor that would take out my remaining fallopian tube (the other exploded when I was 24 and I’m now 33) so when people ask when I’m having kids, the look on their face when I say “never, I had that shit ripped out” is very satisfying. Pearl clutchers are the most entertaining. \n\nOp, you’re NTA. That conversation is awkward as shit. And it sucks even more when that news is still fresh. But I will promise you this, when you do come to terms with it, putting people in their place is a really great feeling, because then THEY feel awkward and learn to mind their own damn business.", "NTA. But out of curiosity, is adoption out of the question? Family doesn’t have to be blood!", "I really wish families would stop doing this to people. I have 1 kid and for YEARS after he was born I was constantly asked when I'd have another. We didn't WANT another, we were and still are happy with one. There are many, MANY reasons people have the family they have and each situation is valid and no one else's business. NTA I hope they never bring it up again to you. May you be the best aunt ever.", "NTA\n\nAll the women in the planet who’ve suffered the loss of a child are not in that room with you, I do think they’d commiserate with you - I do not think they would’ve sat by and let people do that to you either. So…don’t overthink it imho you did what you had to.\n\nBut I can say I hate telling a lie cause now you have to keep it or come clean. You also doubt yourself. I feel like lies are giving up my power to such people - you shouldn’t have to lie. If it comes up again I’d just say ‘I didn’t know how to tell you all to stop without pointing out you’re being AHs at that point.’ Don’t deny/confirm the miscarriage, if it comes up just assert your point itself and ask they stop before you are forced to come up with more ways to end these inappropriate questions.", "NTA. As someone who actually has had a miscarriage I am 100% not offended by this lie. They needed to back the fuck off. \n\nAlso, I don’t agree with this “greater loss” idea. Grieving the loss of a pregnancy is not necessarily worse than the grief of dealing with infertility. They’re both a loss. They both deserve their space. Why do they have to be quantified and ordered by importance?", "I think it's not idea, but NTA.  We do what we feel we have to to get by.", "NTA", "NTA. I personally think you should have snapped at them over what they actually did wrong, though. Insisting you have children when you CAN'T seems worse to me than asking when you are going to have kids after a miscarriage. Miscarriages are no picnic but many women have them and go on to have children. You want children but cant have them -- ever. It is grossly insensitive for people to keep bringing it up. They deserve a verbal slap.\n\nI think the lie is understandable, though. \n\nI assume you have looked into surrogates, thought about adoption, and so on. Being an aunt/uncle is a great choice and I wish you much happiness in that.", "NTA\n\nYou were cornered into your response. It stopped the questions but the pain remains. For what its worth i hope a miracle happens for you or somesuch.", "NTA. You did what you needed to do to stop the conversation. The other option is to go NC. Given how much you want kids and what it takes to get over not being able to have them, sometimes you have to go to extremes to stop the painful explanations. The problem is you have now implied it is possible and they may ask you again in a few months time. I’m not sure how old you are but maybe early onset menopause could be the next thing to shut things down? I’m absolutely aghast that doctors telling you it’s not going to happen is not enough for them!!", " At first I thought massive AH but the more I read, NTA. \n\nI’ve had well meaning women in my life say similar things. \n\nMake them uncomfortable queen! Make them regret prying into your most personal business .", "Listen, you aren't on social media, at work, and pretending to all your friends that you've suffered from a devastating miscarriage. All you did was shut these people hell up the only way you knew how to, and it was a damn good idea because it worked. You tried being honest, you tried to explain. Are you supposed to be tormented every time there is a family gathering? I bet no one will bring it up after you said, thanks for reminding me! And don't sell yourself short, you probably DO have pain over the situation, you did want children and you did try. But they keep bringing THAT up and I bet you really don't want to be reminded of that. So the \" thanks for reminding me\" is probably truthful, it's just you had to say miscarriage to get them out of your and your husband's business, life choices and personal situations.  Don't feel bad. The people that should feel bad are the ones that probably don't.", "NTA- as someone who has  been through the infertility wringer, you know that the first two weeks of every pregnancy you aren’t actually pregnant.  I’d say you probably lost about 12 of those hypothetical pregnancies last year.  In all seriousness, miscarriage is devastating, but so is infertility with the relentless monthly cycle of hope and loss, and if they couldn’t recognize that, I don’t blame you for putting it in terms that they could understand.  But please make sure that your husband understands and is on the same page as you- his judgment is the one that matters here.", "NTA at all. I'm so sorry this is happening to you and your husband, both the infertility and the family crap 😔 your response was great! hopefully it will make them think twice about bringing up an already painful  thing for you both in the future 💙", "Nta. Their bloodlines are not your problem. Creating cousin’s aren’t your job. Maybe some of those geezers want to have some more kids? I hope your peace and quiet lasts and lasts and lasts.", "Adding to the others in a club you just don’t want to be in. Two early miscarriages and a twin that never developed. One healthy, amazing boy after a year of fertility treatments. We are trying for a second but our first IVF resulted in no viable embryos despite large retrieval and fertilization numbers. Even if IVF physically is an option, emotionally and mentally it is brutal. And everyone is allowed to say “this is not what I want for my life.”\n\nSo I say this as someone who has spent thousands trying to have a child OP, NTA. Your path is yours alone to follow, and people need to keep their noses out of it.", "I had someone I worked with and barely liked ask me when me and my husband were having kids.  We’d been married about 5 years at this point and had just found out the odds of us getting pregnant were extremely low due to issues on his end.  Rather than even trying to explain that to her, I was just like “We can’t. Thanks for the reminder!”  In this really perky voice.  She left the room quickly at that point.  \n\nWe did eventually manage to get pregnant but due to the low chances of us ever getting pregnant again and the health issues I had during pregnancy, he’ll probably only ever be a single.", "I couldn't have my own children either for various physiological reasons. It turned out to be a blessing because various circumstances led to my raising my sister's children. At 62, I occasionally feel a tiny pain over what my own child would have been like but that passes quickly when I get to romp with my various \"grandchildren\" at this point. Divorced years ago too so my time and money are my own to spend it on and with them.\nI am so sorry you are going through this pain. ❤️ But you are NTA. Damn, I wish I'd shut many people up by saying that over the years.", "So because it’s different for you it’s different for everybody? The audacity to tell others what they can and cannot tell their own family because you’re in pain. \n\nAnd yes… I do know what I’m talking about from experience. That’s why this makes me so angry. Women comparing their pain and bashing other women also going through a lot of pain.", "People should just STFU about other people's reproductive organs. It's rude to pry about this topic. They might not be able to have kids ajd feel heartbroken, they might decided they couldn't properly care for a baby and gets pissed when someone want to convince them parenthood is magical. It's just insensitive all the way. I hope the in-laws won't become even more pushier after this.", "Miscarried 3 times and went through medical treatment. I totally agree with this comment. In laws need to knock it off. \n\nLeast thing you need is someone asking for kids knowing you can’t.", "Three miscarriages here and OP, NTA. Big hugs to you and use the line to shut them down as often as you want or need. They are causing you extraordinary discomfort by continually asking you - I really don’t think they deserve any consideration here. \n\nAlso, I agree that it’s barely a lie, because you *have* suffered the loss of the possibility of pregnancy, which is something you need to be given space to grieve and they aren’t giving that to you.", "It’s not socially acceptable, some people just haven’t cottoned onto that yet.", "No! Wow, like you were just not doing something right, and that's why you don't have a baby. Like it's your fault. What is wrong with people?", "> actually, less than for 2 kids born 4 years apart because of how the FAFSAform works\n\nI've never heard of this. Can you elaborate?", ">for my girl and boy twins, are they identical EXCEPT FOR THAT?\n\nOh god, oh no, why.... 🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️", "That happened to me too. It was asked to me by the husband of my dh cousin. He was really upset. Cue my cousin:\"serves you right, never ask that question. I do love him though, he's one of the most generous People. Ive ever met.\n\nI also had a miscarraige and I too love every woman here who has experienced it saying op is welcome to use it to shut others up. These question are extremely painfull and intrusive", "Considering she had a slew of health issues and nearly died, I think it's fair to say that pregnancy should not be recommended for her. But it is her body, so she can do it anyway and did, it was just incredibly risky.\n\nAnd TBH, I would guess the verbal abusiveness and extreme risks she took to have a child are probably related.", "Exactly!!", "Free Application for Federal Student Aid.  It’s used in the US to apply for student aid from the federal government.", "Looking at the profile it’s a teenager that thinks anything that anyone says/does is offensive.", ">she can do it anyway and did, it was just incredibly risky.\n\nYeah, I just don't see why that person was mad she took the risk. Not recommended? Sure.\n\n>And TBH, I would guess the verbal abusiveness and extreme risks she took to have a child are probably related.\n\nEh, maybe, but I wouldn't say that it's an unavoidable consequence or w/e. So I still think it was fine for her to go for it given she really wanted. She didn't have to become abusive for it, and we don't really know if it's even related.", "\"Studies have shown that people who get enough fuck-off-outta-other-people's-business-and-womb in their daily diet go on to live longer lives with less conflict and lower exposure to spontaneous middle finger gestures!\"", "This is where you gift them with metamucil to loosen up all of the *unpleasantness* within them.", "It can be hard to see someone you care about intentionally put themselves in harms way, especially if you think it's over something they have an unhealthy obsession about. But given the \"ex-friend\" bit there's probably more to it than that.\n\nAnd yeah, I agree that we don't really know. But I felt the commenter was heavily implying that, and implying there was an obsession.", "NTA\nI had a miscarriage early this year, it hurts so much, but I understand why you did it, maybe that's the only way they're gonna drop the conversation. Don't tell anybody else that you lied about it.", "NTA. I don't have children and it pisses me off when people ask if I do, they don't consider its a massively personal question and what some women go through to have children, and that some children die or are lost in custody battles etc. \nIf someone announces a pregnancy, congratulate them. Until then, it's no one's business.", "NTA. I also deal with these brutal comments that are so disrespectful, intrusive and truly nobody’s fucking business but my own. Lying to them is the only nice way out of the conversation because the actual required remedy for this intrusion is to tell them alllllll the way the fuck off about how it’s none of their damn business.", "NTA. I also miscarried. \n\nI dealt with much the same as you, CONSTANT barrage of ‘when are y’all gonna get pregnant?’ or ‘with you getting such a late start you better hope it’s twins (I was all of 26)’, or my personal favorite ‘now all we need is y’all’s two running around and we’ll have everything’. All from his side of the family.\n\nGot pregnant. Miscarried after a big fight with hubby. \n\nWaited till the next family gathering and let it be known in clear terms that the next person to ask me anything about when we were going to try again was going to regret the day their grandparents met.\n\nYou are NOT the asshole here. You do not owe anyone grandchildren. They have zero claim on your organs and what you choose to do with them. None. Zip.\n\nIf this is what it took to shut the bullies down, then so be it and I hope you’re ok.\n\nI’ll light a candle for you.", "NTA.", "As someone who lost two pregnancies and was lucky enough to have two carried to term, I don't see anything wrong with what you've said. You wanted the uncomfortable questions to stop and they did. I remember how bad it made me feel when I had to hear these kind of questions all the times. I just wanted to run away. So yes, whatever works", "NTA , they are the only ones being disrespectful and if anything I see this as a way to learn people to shut up about asking people about things they have no business snooping in - that will help people who for different reasons can't have children. You are far far far away from being the asshole", "NTA. Hopefully they learned what happens when you ask personal and invasive questions of people you have no right to know the answer to.", "NTA. Your in laws need to STFU about what they think you should do with your family and what choices you should make. Glad it worked.", "NTA. I don't see that as disrespectful to people who have miscarried. If anything, it may make those relatives think next time before opening their mouths to demand people produce babies for them.", "You were not lying to deceive or hurt anyone, you were lying to protect yourself from people who were harming you, intentional or not. NTA.", "NTA 100%. I too have been asked many times if I’m going to have another baby. It would kill me, so I got my tubes tied. Having to explain that is upsetting and tedious.", "100% NOT the asshole. It's no one else's business to ask these kinds of questions- especially in a public situation. Hopefully they felt ashamed with your response and will think twice before ever doing it again. Hope you are ok.", "I was prepared to think you were the asshole because that's usually such a bad thing to lie about, but they drove you to it, NTA.", "NTA. The relatives certainly are.  After three miscarriages we finally adopted and fortunately most accept this child as part of the family as a cousin, niece, and granddaughter.  The one relative who didn't we no longer include them in any other family activities and gatherings.", "NTA", "NTA I've had 5 miscarriage and I do not feel offended of this! I don't blame you l mean I can only imagine being told you can never have kids probably feels just like I did after each of my miscarriages", "3 miscarriages here and I’m not offended!  My MIL used to ask us the same thing.  My BIL had cancer so his sperm was frozen-  we finally told her to ask him to get his kids out of the freezer.  They have no boundaries.  NTA 1000%", "NTA. You did what you felt you had to OP.", "you're not the arsehole there are two keep bringing it up on you've told them that you're not going to have kids", "\nNTA. My favourite thing to do as a child free by choice person is to make people feel awful for repeatedly asking invasive questions about my uterus so that they don't ever subject someone who is child free not by choice to that kind of bull ever again.", "NTA. My wife has a miscarriage earlier this year and we have spent YEARS hearing the same stuff from family. They never could accept that it was by choice we weren’t having kids. No one really knows about our miscarriage earlier this year because of how much it hurt the two of us. We both understand the need to resorting to such a big lie to get the treatment from family to stop. Good luck OP. We wish you nothing but the best", "NTA desperate family calls for desperate measures", "NTA", "I’m currently going through a miscarriage and I can only imagine what it’s like finding out that you can’t even have children. I’m so sorry for that and I’m sorry your family and family in law cannot accept it and move on. It would make your healing a lot faster. \n\nI 100% give you permission to use this. Definitely NTA", "NTA!!\nDefinitely not!\n\nI’m sorry for your loss!\nI had three miscarriages \nI feel for you", "NTA. I can't have kids and my medical terms are... Shitty. And every time sm find out, they try to *fix it for me*, mostly on spot. Like yeah, i know they mean it with good intention, but i have a little bit bigger research then their 5 second wit \"and what if you try...?\" - i tried already, i consulted with doctors. Or it's imposible for me bc of other medical terms, and no, i will not risk my health for it. But most people just don't get it, simple \"i can't have children\" is not enough and they start to ask \"why?\" and digging into it like it's smt you desire to explain in detail over and over. Your version shut them on spot.\n\nIt's f' exhausting. Your uterus or medical records are not their bussiness.", "NTA\n\nHad my share of miscarriages due to fertility issues, you absolutely have my blessing to say whatever you need to say for your own mental health!", "This!  I don't even understand why it was ever socially acceptable in the first place.  Maybe people will stop having kids just because they feel pressured to do it, and maybe it'll save a lot of people struggling with fertility issues and pregnancy loss a lot of pain.", "Agreed, NTA. Currently going through my sixth consecutive loss during the holidays... And not offended by this in the slightest. Actually, pissed off for OP, because I HATE having to answer these kinds of questions from people who have NO clue of what this pain is like, and because damn right, my medical history isn't anyone's business unless I choose for it to be.\n\nGood on you OP for shutting them the fuck up, as you should have 👍🏻 kudos.", "Damn right. 3 healthy kids, but also 1 miscarriage and 1 deceased infant, and completely with you. Reproductive problems are all painful, and I don't think those of us who have struggled with them are going to police each other on who has it worse.\n\nOP you have every right to claim miscarriage and NTA.", "Exactly this! 💖", "Yea if I’m ever in a relationship and I start getting asked these things I’m just gonna say “well we did have the most vicious sex, busted inside her and everything but I don’t think we got it, I’ll be trying again later today though!", "Unfortunately my friend who just miscarried this week had that same thing (at least we know you can get pregnant) told to her by her parents :(", "Same I've lost babies and I support this 100% because it hurts whether you lose them or can't have kids it hurts. I've even known a few who never want kids but still became devastated when they found out they actually couldn't have kids, with the question \"I know I didn't want them, but what if I change my mind and now I'll never get to\" it's heartbreaking", "NTA. Why do people think it’s ok to discuss something so deeply personal?  One time I responded to a question like this with embarrassing sexual details.  That shut down the line of questioning once and for all.", "OP probably understands that with respect to BIL. I would imagine it’s the ILs who can’t grasp that concept.", "Oh lord, fertility questions! I hate those with a passion. My wife and I are both women and we get some extremely personal questions!\n\n\"So which one of you is the real mum?\" We're both mum, she's ours. \n\n\"I meant which one got pregnant?\" That would be me, but she's our child. \n\n\"Oh, so she's yours!\" *Looks right at me and ignores my wife. \"Was it hard to choose a donor?\" No donor, she's *ours*!\n\n\"Impossible!\" Sure, I chose to lie to you, random stranger. No, she is genetically ours. \n\n\"How can two women have a baby?\" Modern medical science. \n\n\"But how??\" I'm not drawing you a diagram! \n\n\"Oh! You carried her child?\" Gah! No! *I* was pregnant, she is *our* biological daughter, yes it *is* possible for a child to have two biological parents that are both women, and anything more than that is very much not your business! \n\nAt that point we'll usually get sworn at for lying. We don't want to give our medical histories just to shut people up, but they somehow take it as a deep personal insult when they can't work it out. Lady, (it's never yet been a man!), I don't GAF if you're confused! Even if you guessed it I'm not going to confirm it! All you need to know is that she's ours! \n\nI swear the next person who does this is being asked where they had sex and what position did they use to conceive their child!", "Yep. Every time my family asks my partner and I when we're having kids (we don't ever plan to), I turn to her and say \"you hear that? My family wants me to creampie you.\" They stopped asking after the second time, when they rolled the dice, thinking I wouldn't say the same in front of my grandmother. They forgot that I have no shame and my partner thinks making people uncomfortable for asking inappropriate questions is hilarious.", "She should rather stop seeing her family? \n\nWhy does it feel like a slap in the face to you? Can you explain how it affects you? \n\nI don’t appreciate that you speak on behalve of “every woman who ever experienced a miscarriage”, including me. I certainly do not agree with you. My pain isn't aggravated or affected in any way by OP’s statement to her family. On the contrary, I feel compassion for OP who’s going through involuntary childlessness. \n\nI think you might need more support dealing with your loss. Bashing other women experiencing similar problems won’t make you feel better.", "I wanted to ask you what state, but I’m pretty sure it’s gonna be mine🥴", "I’ve heard people say it’s their right regardless of the fallout from the pregnancy especially it death in the table.  It’s incredibly selfish.  You’re purposely bringing a child into the world with the knowledge that you’re likely no going to be able to take care of this kid thus pushing the task to someone else to not only take care of the kids but you too.", "Well… He has just as little knowledge about having miscarriages as you have with OP’s situation. You have been pregnant. You don’t know how it’s to never ever even have been pregnant. Yet you also think you can shame her, tell her what she can and can’t do using a vile formulation. Maybe that wasn’t too nice or reasonable of you either?", "NTA and I'm sorry for your loss.\n\nFamily! I'm glad mine finally gave up on me.", " The in laws are the assholes. \n\nYeah lying is not good. And it was a bad thing to lie about. But they kept pushing and pushing. And it's not their business to know why there isn't a kid in the picture. And yeah they probably won't bring things up for a long time \n\nBut i suspect at some point they will. They sound kinda obnoxious and at some point after a certain amount of time will say oh but that was ... ... time ago. We want grandkids. When is. So and so going to have a playmate. And so on.  They sound obnoxious and asshole enough that would bring it up again. \n\nAll the comments posted that they said. Is about their wants and needs or had to do with others. \n\nI doubt they even asked you both if you even want kids. So they are the assholes. The lie got them off your back. So i don't think you are the asshole. But i think talk to your besty. That seems kinda a tough bit strong reaction.  Is it possible she has had a miscarriage ? Or something when she had a baby and then didn't ?  \n(You don't need to tell me. Obviously. I was asking. Though my phrase probably sounds that way. ) What i mean is talk to her.", "Sometimes you need to make people uncomfortable for them to realise how far they’ve overstepped. \n\nI wish you the best in your quest to be the world best Aunt and Uncle.\n\n NTA", "NTA I'm so sorry about your fertility situation. And even more sorry your family are being so weird about it. Life can be still so fulfilling without children and I sincerely hope you and your husband can have that.", "In this case NTA. They made you uncomfortable in the worse way, you threw it back at them. Period.", "As far as I'm concerned as someone who has miscarried twice, OP is NTA. She shouldn't have to explain her infertility to them. And let's face it, if she did they would just tell her she's dealing with it wrong.", "Nope! NTA in my book. \nFellow woman who has fertility issues and have had two back to back miscarriages in the last year. I also have a toddler that we conceived with fertility treatments. It’s shit. It’s hard. You do / say what you need to get these people off your back.", "NTA, you didnt lie to manipulate someone, you lied so adults would stop asking, you didnt disrespect anyone who has miscarried, because you are also living with the idea that you will never have children of your own.", "NTA. As a person who chose to be childfree the endless bingos can be EXHAUSTING to say the least. IVF/surrogate/ adoption is not for everyone but some people will not accept that. So you said what you knew would make them shut up.", "Thank you all for this comment. We had the same issue. In the end I told my mum I have a low sperm count. People kept talking about IVF \nI mentioned low meant 0 sperm count. It was a horrible time.", "Also miscarried twice, and am unable/unlikely to be able to carry to term. OP can say whatever she wants to het nosy in-laws out of their business."]}