{"id": 5579, "submission_id": "zur0br", "title": "AITA for not going home during Christmas and being honest about it?", "selftext": "Despite my redneck upbringing and my confederate flag waving family I became a pretty liberal bro - 7 years ago I visited my parents and on Xmas day my dad and I got in an argument - I tried to stop the argument (imagine very conservative opinion vs. a pretty mainstream opinion) and by trying to not argue I made it worse.\n\nMy father disowned me on Christmas Day. \n\nI’ve never hurt as bad as I did in that moment and the following year or so. I don’t celebrate Christmas as a result. \n\nMy father and I have made up - after 2-4 years and honestly have the best relationship we’ve ever had. \n\nI still don’t go home. It’s a wound that I just avoid- I’m not sad - it’s just a thing. \n\nLast week my mother asked if I was coming home for Xmas, and I said no, I’m too busy, flights are expensive, can’t find a dog sitter, I’ll come next month, etc.\n\nI was told: “you bring up the same excuses every year” to which I replied: “I don’t really feel like celebrating the day my father disowned me”\n\nTurns out I was on speaker phone. My father heard me, and maybe worse my grandma. \n\nI’ve gotten a few texts saying I’m AH from siblings and family and I should suck it up and quit making it about me. Im a selfish AH\n\nI try and avoid this like a plague - should I have not said anything or should I just go home? AITA?", "created_utc": 1671944364, "permalink": "/r/AmItheAsshole/comments/zur0br/aita_for_not_going_home_during_christmas_and/", "score": 188, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Saying why I don’t go home and potentially being rude or selfish\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nThat which can be destroyed by the truth, should be. Your family is gaslighting you.\n\nKeep your own plans. If you think their drama is bad now, it will only be worse if you give in to their manipulation & go.\n\nIt's great that you've made up, but when you smash a plate on the floor & glue it back together, the cracks are still there, no matter how much you apologize to the plate, or wish you hadn't smashed it on the floor.\n\nThat they're trying to pressure & guilt you is just gross IMO. Leave them to each other & enjoy your Sunday without them. HTH", "When your father “disowned you” he relieved you of any ethical duty to them. Also, if it mattered that much they could offer to pay for the flight or really show they cared by visiting you and apologizing. Enjoy your holiday guilt free!", "NTA. You don't owe anybody an explanation yet you gave the real reason when you were pressed. If your mom is embarrassed that other people heard you say that then it's her own fault for putting you on speaker without alerting you.", "NTA. Holidays are an even more necessary time to set boundaries and protect yourself. You’ll see them soon, you’re not saying never.", "NTA. Even when you've come to terms with trauma it doesn't mean it can't hurt you. It's good you mended your relationship with your dad (though, you didn't have to), but that doesn't mean his words didn't hurt you and haunt you to this day. \n\nIt's easy for someone outside of that to just say grow a pair and deal with it, but if it's that hurtful to you to where you feel like every Christmas is a reminder of that day, then you don't have to participate. \n\nAlso you didn't mean to out your dad like that, you thought it was a private 1 on 1 so nobody can say you were saying it just to be mean.", "NTA", "NTA. Yeah you made it about you, because *it is about you* and what you're willing to put up with / deal with. What do they expect? Rainbows and puppies? Hell, in my opinion you're being fairly nice by ever talking to them again in the first place.", "NTA. Your family is just proving why you're making the right choice by not spending your holidays with them.", "NTA my sister never visits for Christmas and no one holds it against her cause we(including our parents) understand she’s a grown adult and is to make her own decisions, on top of that if you still have a wound from that day they should understand that you need to heal from it, i had something similar with an ex friend where they apologized and i still wasnt past it only to be met with the text “im ready for you not to be mad at me” just cause they have healed and are ready to forget doesnt mean you are.", "NTA. You can see them another time. There's nothing wrong with your father hearing how much that fight continues to affect you.", "Hardest NTA.\nMy parents disowned me this May for being gay, and birthdays and Christmas have been incredibly hard this year, but I can't even imagine how it could feel being done on Christmas. The whole tree-music-gifts stuff supposed to set the festive mood might trigger trauma for you years after the reconciliation.\n\nI am very sorry for you, and you have every right to do whatever works for you to minimise the pain. \n\nYour feelings matter. Your being hurt is real and valid, and whatever you do to get through this triggering is good, and your family are the last people in the world to challenge your choices of actions here. You have already been too kind by inventing a polite reason you can't come. It is good they know the truth. If your dad is hurt - he deserves this because this is a possibility for him to look into your reality, into the consequences of what he did.", "NTA", ">I should suck it up and quit making it about me. \n\nYou're not \"making' it about you it *is* about you. They're trying to make it about them. You have every right to be hurt by this and not be okay celebrating that day with him. Have you had a direct conversation with your father about how much this hurt you? \n\nNTA", "NTA. It's very hard to get over the rejection of a parent and you're not there yet, 100%. You have s good relationship with him but that doesn't mean the scars have totally healed yet. No one can force you to visit them and who cares if he overheard you? It's the truth! If he cant handle the truth he should have been a better father to you 5 years ago.", "NTA. If your dad didn't want anyone to know about it, he shouldn't have done it. He can't ask for forgiveness while simultaneously refusing to take responsibility for his actions.", "NTA, and frankly, it's a good thing that your father and grandmother overheard.  They needed to hear very clearly that you were deeply hurt.\n\nYour siblings suck for trying to make this your fault.  This action on their part is predictable -- but it is designed to preserve the status quo, and it may well prevent any growth on the part of your father (and perhaps your grandmother).  But that's on them, and not on you.\n\nGood for you for creating your own rituals.  That's what I've done to replace the ones I lost.  I also recommend a bit of therapy, just to help you recognize the dysfunction in your family, and to uphold the healthy boundaries you're putting in place for yourself.\n\nI'm sending my best wishes your way!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nDespite my redneck upbringing and my confederate flag waving family I became a pretty liberal bro - 7 years ago I visited my parents and on Xmas day my dad and I got in an argument - I tried to stop the argument (imagine very conservative opinion vs. a pretty mainstream opinion) and by trying to not argue I made it worse.\n\nMy father disowned me on Christmas Day. \n\nI’ve never hurt as bad as I did in that moment and the following year or so. I don’t celebrate Christmas as a result. \n\nMy father and I have made up - after 2-4 years and honestly have the best relationship we’ve ever had. \n\nI still don’t go home. It’s a wound that I just avoid- I’m not sad - it’s just a thing. \n\nLast week my mother asked if I was coming home for Xmas, and I said no, I’m too busy, flights are expensive, can’t find a dog sitter, I’ll come next month, etc.\n\nI was told: “you bring up the same excuses every year” to which I replied: “I don’t really feel like celebrating the day my father disowned me”\n\nTurns out I was on speaker phone. My father heard me, and maybe worse my grandma. \n\nI’ve gotten a few texts saying I’m AH from siblings and family and I should suck it up and quit making it about me. Im a selfish AH\n\nI try and avoid this like a plague - should I have not said anything or should I just go home? AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I mean if your relationship has been patched up, I do feel like you are being a baby about it. You either forgive him or you don't. Get over it. \n\nYTA", "Wow - the plate metaphor is very fitting. \n\nI normally say love my dad, but there’s a time of year I just don’t want to be around him because it hurts", "Tbf - they do offer to fly me to them - but it’s just kind of an off limits time for me. Spend it with my dog doing cool stuff and hanging with my Jewish friends (getting Chinese tomorrow)\n\nAnd real talk - I can’t find a dog sitter I can afford on Xmas", "Yeah, she's an asshole for that alone. If someone is on speaker the first thing you do is tell them they're on speaker and who else is there. That's a no-brainer.", "I’m really sorry to hear about your family not accepting you for you. I appreciate the note and your perspective and hopefully you’re able to spend this Sunday doing something good for you", "I'm so sorry you're going through this too.\n\nI don't want to be nosy or break any rules about going off-topic but I'm gonna risk it because I want to ask how you're doing & say I hope you're faring OK. It's really hard.", "Wut? I have a relationship with him - but I’m allowed to have boundaries and honestly scars - Yeesh\n\nNo clue what this person commented next because they blocked me immediately after.", "Hard relate. Some 30 years later now & my heart still hurts from my own experience with this, the holidays are very difficult for me even now, even with my own traditions.\n\nDeveloping & honoring my own rituals has helped tremendously over the years, but there will probably always be this spot in my heart that keeps me apart from others, this time of year. I don't think I \"grew back\" from it, but honestly, I shouldn't have to, and you shouldn't, either.\n\nThere's some sh!t that can't be unsaid, & to me, that's one of them, and now it's a lot like a healed-up broken bone that aches when bad weather's coming. I just say inside & cuddle up with my comforts & wait for time to pass. Sushi & Godzilla flicks is my go-to.", "These scars can run deep. You do what you feel is right for you.\n\nETA: OP, NTA", "You came here for opinions, that's what you're getting.\n\nFrankly, Christmas is just any other day, my family and I celebrate it when we have time. If you are visiting a month later, then there's no difference than visiting now.\n\nAnd now because you can't get over an abstract idea like a date, it's possible you've damaged your relationship with your Father to some degree.", "Well I really appreciate your words, I knew I wasn’t alone but it’s still helpful to hear. \n\nThe nice thing with living in NYC is I have a handful of Jewish friends who tomorrow is just the day we get Chinese together - then I cuddle my dog. But I do like the sound of sushi", "I think the father damage the relationship when he disowned him. There's nothing wrong with OP setting boundaries around an uncomfortable situation. And the family reaction would make me feel even more uninterested in going. Why would I want to hang out with people that instead of trying to have a conversation and supporting me, they just guilt trip me? Fuck that noise, OP NTA. While I think it would make maintaining a relationship with your folks easier, you're under no obligation to do so.", "So it’s their fault for damaging their relationship because their father disowned them? \n\nYikes bro", "Your post helped me feel a little less alone tonight too, so thank you for sharing & thank you for chatting with me too!\n\nI'm a little to the north of you -- I saw a lot of flooding down your way, up here the line crews are still working to get everybody's power back on, the wind was brutal! Hope you're staying warm & safe in the weather.\n\nVery blessed to have a local place here that is excellent for both Chinese & Japanese. I learned how to make dumplings all on my own this year so I haven't splurged as much, but I'm definitely looking forward to at least one dragon roll tomorrow.\n\nI hope you have a lovely Sunday! Enjoy!", "Jewish Christmas is the best.", "ASAP you need to watch Patrick Teahan YouTube videos on toxic family systems. \n\nYou have set a healthy boundary and your family is stomping on it. \n\nYour other relatives who chime in are what is called Flying Monkeys. \n\nJoin the r/Estrangement sub", "> quit making it about me\n\nWhile there are many situations where compromise is best, it is absolutely fine to make decisions that are about you. It would be different if you were trying to stop the rest of your family from celebrating together, but you’re not. It’s 100% acceptable to decide where you are going to be and with whom on a holiday.\n\nNTA. Enjoy your Chinese food.", "Oh hell nah, f that family.\n\nAs someone who has many scars and divisions in his family, that is one toxic family that you should actively avoid.\n\nNTA, but you deserve better", "I am frankly exhausted with these stories. \n\nFormula: My family mistreated me horribly.  \"Be the better person\".\n\nIf a person can't acknowledge their bad behavior Edward Scissor hand them out or your life.", "Seriously, this OP. Why does your family think you should even *want* to spend time with people who are reacting in the way they’re reacting? \n\n\nThey’re actively, violently pushing you away even as they belittle you for not being able to come closer. It’s ridiculous—you’re right. They’re wrong. \n\n\nWishing you the most delicious Chinese food this day NTA", "& you deserve all of that too👊", "You will never regret reclaiming the day and spending it as you see fit.\n\nIt's not who you are with these 4 special days of the year.\n\nIt's who you are the 361 & how you love and appreciate yourself for it and the people you choose.", "Thank you very much for your kind words of support. I only shared my story to show that I know how you feel and where you've been, and from this perspective you are NTA. I am doing OK, reallyz\n\nI truly hope that you take that love and energy and kindness and consideration that makes you defend your family by questioning if you are T A - and redirect it to protect yourself. You deserve your own support more than your parents and more than anyone in the world.\nYou are a good person OP. I hope you do what works best for you in the upcoming days.\nSending you a warm virtual hug!", "THHIIIIIISSSS! 🥟🥡🥠", "🥠🥡🥟🥰"]}