{"id": 5582, "submission_id": "zupb5s", "title": "AITA for gifting my BIL a bottle of whiskey when I’m a former alcoholic", "selftext": "I (28M) have been sober from alcohol for three years. \n\nThis afternoon for Christmas Eve we had a family get together. My sister and her husband Ryan were both there. \n\nI know Ryan enjoys whiskey so I didn’t think it would be a big deal if I went to the liquor store and got him a nice bottle.\n\nToday a few of us exchanged gifts and I gave my BiL his whiskey. When he opened it Ryan said thank you but my sister asked me if it was really from me.\n\nI said yeah and she just went “oh”. Later on tonight my family expressed their concern that I had “gone into the store and bought something for myself.”\n\nI told them that I was clearly sober and that they were being ridiculous. \n\nNow that I am home I am seconding guessing myself and am thinking I might’ve put my family in an awkward position. AITA", "created_utc": 1671937814, "permalink": "/r/AmItheAsshole/comments/zupb5s/aita_for_gifting_my_bil_a_bottle_of_whiskey_when/", "score": 453, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. The action is buying the whiskey as a former alcoholic \n2. I might be the asshole because my family thinks that I shouldn’t be going to a booze store no matter what and I made the night awkward.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nCause for concern:\n\n* An alcoholic *keeping* a bottle of whiskey\n\nNot cause for concern:\n\n* An alcoholic *giving away* a bottle of whiskey.", "NTA - You were able to walk into a liquor store, buy a bottle of liquor, and keep it in your possession without any issue. I know alcoholics who can't even be anywhere near alcohol without caving to temptation. I'd wager if you can do all that without succumbing to temptation you're in a good place, and your family has nothing to worry about. Stay strong my dude.", "NAH.\nYou did something nice for your BIL.\nYour family is worried about your sobriety.\nBoth can be true, and nobody really be an AH.\n\nSome people will say you have no business ever going in a liquor store again, and they wouldn't be wrong, but you went for a singular purpose and didn't mess around. As long as you were in and out, and it didn't linger on your mind, I would say you are fine. But you don't want to make a habit of this...\n\nAnd yes, your family felt awkward. They know you don't drink anymore, and they know why you don't drink. They would be perfectly happy if you never went to a liquor store ever again. Trust is hard to build back once it's been damaged...\n\nI used to buy the wine for holiday dinners even after I quit drinking (4/12/2000) because I was the only one who knew anything about decent wine...but I eventually quit because it wasn't worth it.\n\nNext year, get him something else. Anything else... it's just easier for everyone.", "NAH - it sounds like you're able to handle entering the liquor store and being around it well, and that's great. \n\nBut as a child of an alcoholic, I can see their point of view. It could easily be a trigger for relapse. And while I don't know your history, it's very likely that your family has trauma from your alcoholism. It's understandable that they got upset and wanted to make sure you were okay.", "NaH. I think that it's good that your family is checking in with you. Recovery is a long term thing, and I understand their concern. I think it would have been worse if they hadn't checked in tbh. Maybe they weren't exactly tactful. And I don't think you're an ass either for knowing your limits and boundaries and going to get a gift you knew you were capable of getting.", "NTA if you were my brother I might have checked in with you, in private, or quietly told you I was proud of where you had gotten too, again in private. A certainly wouldn't have, over the gift exchange, implanted the idea that you were relapsing over a thoughtful gift.\n\nAnd you know what, since apparently your family won't say it I will- good work. Dealing with addiction is hard but you seem to have a good understanding of your own boundaries and comfort and that is impressive.", "NAH. I've been sober for ten years, and for about the first year, I would not have been able to go into a liquor store. You can't avoid triggers, though, you have to learn how to deal with them. Where I live, you literally can't buy a loaf of bread without passing a wine display. What am I gonna do, never go to the grocery store ever again? \n\nNowdays, I kinda like giving people a bottle of something they can enjoy even if I can't. It's like giving a younger person an awesome jacket that you wore back in the day and enjoying how much of a kick they get out of it. \n\nI have found, though, that people without alcoholism have trouble calibrating alcoholics' responses to alcohol. They don't have a good handle on what's worrisome and what's not. (EDIT: And, to be fair, sometimes people with alcoholism don't have a good handle on what's worrisome and what's not, so I do see where your family is coming from.)", "NTA.   You didn't buy it for yourself, you bought it as a gift.", "NtA. If they can't believe you went in and didn't biy anything for yourself that says more about them than it does you. \n\nI'm proud of you for walking into a liquor store and only getting something for your BIL! Hope you guys manage to have a wonderful Christmas", "NAH You did something nice for a family member. Your family wants to make sure you're still doing okay. In the future, I would maybe not give alcohol as a gift just to avoid any unnecessary concern or misunderstandings.", "NTA. Your sister doesn’t trust you. Neither does anyone else that expressed disbelief. I advise next time presenting the doubters with a receipt.", "I think you are NTA, but I recommend calling your sponsor and asking them what they think.", "NAH it’s fair for them to be concerned. Congrats on being so solid in your sobriety", "Honestly, is there even really a conflict to judge here?\n\nI see a recovering alcoholic gifting a family member alcohol, and a family checking to see if everything is okay, followed by a reassurance that there has been no relapse.", "NAH.  You were thinking of nothing except getting a nice gift for your BIL.  But the concerns of your family is very understandable.  They are worried that in addition to the bottle you got for your BIL, you got another bottle to hide in the garage.", "NTA They do not know your journey, your recovery or even your triggers. I have known revovering alcoholics that are perfectly okay keeping wine in their home or even whiskey. It doesn't affect their sobriety at all and they don't feel threatened or nervous when it's there. In tv history, you had a bar owner who was a recovering alcoholic (Sam from the show Cheers) if they can put it on television in the 80s, even as a pretend place, it is NOT that far divorced from reality. They need to LEAVE YOUR RECOVERY TO YOU. Just let them know,  \"my recovery is not in jeopardy, please either educate yourself about the many different issues and layers of addiction recovery, or else stay out of MY business, thankyouverymuch and good day. I said GOOD DAY!\" Then turn on your heel and walk away. It is none of their business and they are in no position to make that call for you.", "NTA. You bought someone a gift they're the ones assuming a former alcoholic isn't able to even see alcohol without drinking again. That's ridiculous and many past alcoholics still consume alcohol and are able to self regulate. Not saying you should go do it of course. If anything they're the ones who ruined the gift exchange by making a gift awkward and seemingly not believing you. You should be so proud of yourself for being able to not even think about wanting to drink while buying whiskey. That's awesome! Go you!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (28M) have been sober from alcohol for three years. \n\nThis afternoon for Christmas Eve we had a family get together. My sister and her husband Ryan were both there. \n\nI know Ryan enjoys whiskey so I didn’t think it would be a big deal if I went to the liquor store and got him a nice bottle.\n\nToday a few of us exchanged gifts and I gave my BiL his whiskey. When he opened it Ryan said thank you but my sister asked me if it was really from me.\n\nI said yeah and she just went “oh”. Later on tonight my family expressed their concern that I had “gone into the store and bought something for myself.”\n\nI told them that I was clearly sober and that they were being ridiculous. \n\nNow that I am home I am seconding guessing myself and am thinking I might’ve put my family in an awkward position. AITA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "It's okay that they were concerned,  but just keep showing them you're fine and it will be fine. Maybe send them a message if you think they're really distraught.  Booze is a good gift and an easy gift.", "NTA.\n\nI don't think you family understands how alcoholism works.", " NTA", "Nta if *he* was the recovering alcoholic, sure.  But you gave a bottle of whiskey to someone who loses whiskey.", "Congratulations on your three year sober mark. You’re NTA, you clearly meant well and are holding true to your sobriety.", "If you are comfortable giving it, they have nothing to say. They can have their concerns of course, but making a big deal about it is the wrong way to go. \nNTA. You thoughtfully gave your BIL something you knew he would like. Good for you.\n\nMerry Christmas!", "I'm loathe to call his family assholes for reaching out concerned about his sobriety. \n\nIt's great that OP is still sober, but a close family member's alcoholism can leave some really deep scars. So long as they weren't actually harassing him, I don't see the harm here.\n\nIf anything, OP's insistence that they were being 'ridiculous' may feel to them like a case of 'doth protest too much'. \n\nAdmittedly, the OP is pretty barebones, and they potentially just wouldn't let up, in which case, that's fair - I just don't see any indication of that.", "That proves nothing, just that on that transaction OP only purchased the bottle for BIL. Not that they didn't buy some for them before or after (at least to people who want to think ill of OP). \n\n\nI don't love people from the USA obsession with utter abstinence and painting any minor interaction with alcohol  that is not drinking with intent  (like buying a specific bottle for someone) as basically the same as drinking with intent.", "Don't assume he's sober because of any particular program or that he has any kind of sponsor.\n\nAlso, complete abstinence isn't always the only way to do it for everyone. Yes, it's the best way for most people. But there's exceptions. For example, Some people only drink excessively in particular situations, and only need to avoid being in those situations.", "Dont assume he's not. Sober describes one who was in a state of acute life destroying alcoholism, but is currently in remission. Like cancer, it can come back even stronger. Most people who successfully achieve and maintain sobriety do so through a twelve step program. \n\nAlso, do you know what they call alcoholics who dont practice abstinence? Alcoholics. Drunks. Sometimes convicts. And occasionally dead. Booze kills. Some faster than others. Alcoholics cant drink normally. Ever. Their brains and body chemistry wont let them. They can live mostly normal lives while their disease remains under control. OP deserves a medal for getting sober. Checking in with his sponsor in this circumstance is a way to help him stay that way.", "I have an anaphylactic allergy to strawberries but I still buy stawberry items for other people… gifts are about the happiness of the recipient, not the giver. \n\nNTA, sorry your family is second guessing your sobriety.", "You got something knew your brother would enjoy. Props to you for being able to do it and stay sober!!!!!", "NAH it was a nice gift and it's natural your family would be concerned for you under the circumstances. Recovery is a long, hard road and different things can be triggers for people", "They may simply be worried. \n\nOP your alcoholism affects them as well. You loose their trust in the process and yes you need to earn that back! Knowing that you have been to that store might make  them afraid that you were triggered and and bought also for yourself without telling them.\n\nEspecially if you have a history of drinking in secret. Next time maybe tell someone in advance and ask them to go with you to the store. \n\nAlso time will be on your side here. If you have been like more years sober then you may have earned back their trust. And then you can go alone.\n\nYou are not the AH for buying the gift. Neither are they for being worried.\n\nNAH", "INFO: Did your addiction negatively impact them? Before you got sober, did you disrupt family functions, especially holidays, while drunk?", "INFO if they've spent any time getting you out of a jam before you got sober it's not out of line for them to have worried about you going into a liquor store for whatever reason.  It's quite possible that they've suffered from your actions and you haven't fully regained their trust, and this may be totally reasonable.  Did your actions before you got sober only affect yourself and not involve your family?", "Light YTA. Congratulations on your sobriety! If it is anything like my experiences they don't want to think about you and alcohol in the same room period. And you normalizing alcohol in any way is probably scaring the shit out of them.", "Er she just asked if the gift was from him and said \"oh\"?  That's perfectly normal family gift exchange behavior?  Then she checked in in private.", "Agreed.  NAH.\n\nEspecially since many alcoholics can do serious damage before realizing they need to get sober, so it can be triggering for their loved ones to see them even handling alcohol. \n\nThree years sober is a great feat but also  certainly within bounds to still be at risk of a relapse. \n\nOne check in to make sure op is okay, and perhaps a bit of extra keeping an eye out for red flags, is warranted when recovering from addiction.", "She asked if the gift was really from him- what answer did she really expect? The answer to that question would have been yes even of he had asked a friend to pick it up for him. It was a loaded question that cast unfair suspicion onto OP.", "Not everyone goes to AA/NA or has a sponsor for their sobriety. Some aren’t comfortable with the setting there but still manages to maintain their sobriety without AA/NA with other methods. I do congratulate OP for staying sober though, regardless on whether or not he has a sponsor.", "All of this is true, but in EXTREME situations. And again, you are ASSUMING OP got clean using AA. Some people, like myself, got sober cold turkey (3 years last week) and have continued to do so without the help of a religious organization.", "Is AA a cult or something? Jeez.", "AA/NA tend to have a lot of religious connotations some people don't want. So it can be in some instances.", "NTA\n\nThere's no malice meant by this statement but it seems you family would do well to educate themselves. Of course they're worried about you, but three years sober should be enough that they don't immediately doubt that you've fallen off the wagon.\n\nI know a few recovering alcoholics and all of them have reached a point where they can comfortably be around alcohol. One of them has even come far enough that he drinks socially. Never more than one or two drinks, but he made it a goal that an illness he feels he has overcome, shouldn't be allowed to dictate his social interactions for the rest of his life. I want to stress that I know that this isn't and shouldn't be the goal for all recovering alcoholics, I just mention it for the perspective that people can put their disease so far behind them.", "NTA its great to overcome the shadows of your past and let others enjoy what you can't.\n\njust take care of yourself man!", "This sounds like great growth and whilst I might understand them asking they should ultimately be really proud of you for this. NTA at all.", "NTA just because they are uncomfortable and don't know how to act regarding you and alcohol. I mean are you allowed in restaurants with a liquor license? This def sound a like a them problem but you could graciously offer to educate them or direct them to therapy for their hangup\nCongrats on 3 yrs", "NAH, assuming it was one genuinely concerned comment not disbelieving interrogation", "I can definitely see how the family might read this as 'no don't worry, I just went to my dealer to pickup drugs from someone else, I'm totally fine.' I know that's not what happen but I can see how alarm bells would go off! Besides, it's better to have people worry about you in this case than not worry about you.", "Agree. Hard to judge with the info given--we don't know the depth of the addiction and possible effects on the family. The axe forgets, but the tree remembers. For now, NAH.", "Awesome! Congratulations! Xxx", "And again, you are ASSUMING op did not. AA isnt religious. Celebrate Recovery is. \n\nIn any case, congratulations on your sobriety.", "Nope. Go watch a few episodes of Mom. Thats how cult like it is. It helps thousands get free from addictions.", "Yes", "NTA - First off, congratulations on your sobriety! \nSecondly, my husband is 6 years sober and he will purchase alcohol for me on occasion when he does the grocery shopping. \n\nAs long as YOU were comfortable and not concerned about your sobriety then that is all that matters.", "NTA.  Been sober 14 years and I still feel like the sober police are gonna get me whenever I go to a state store but I occasionally gift people alcohol that they like.  My husband is not alcoholic so he usually just takes care of that for me but I’ve done it on my own a few times too.  I have no desire to drink it so it’s just not a big deal.  When I was earlier in sobriety my family was very worried about drinking in front of me and my parents offered to get rid of their whole wet bar (like $1000 at least of high end liquor) but I told them not to. They love you and want to support you but they probably just don’t know how.  As long as you didn’t feel triggered, obsessive or uncomfortable about it it’s probably fine, but I wouldn’t make a habit of it.", "NTA.\n\nI’m going through a bit of a similar situation myself - my mum is an alcoholic (claims to be recovering and, not to slate her, but I see little to no evidence of that) and for Christmas she decided to buy me countless bottles of alcohol. Wine, vodka, cider, you name it. And over the last week or so she’s opened and drank every single one, and was bewildered as to why I was upset that the only thing she’d gotten me for Christmas was alcohol.\n\nThe difference between our situations is, you bought alcohol for someone else as a recovered alcoholic, with no intention to drink it. My mum bought alcohol for someone else as an active alcoholic, and drank the entire lot. In fact, I wouldn’t even call you TA if you were to have a glass of it if Ryan offered. I would call you TA if you bought it “for Ryan” and then drank the lot. \n\nI can understand your family’s concern with alcohol, but to me it doesn’t seem as if there’s any cause for worry. Enjoy your Christmas!", "If he’s not showing any signs of relapsing then I think they’re absolutely assholes. He didn’t just randomly give someone the whiskey he gave someone he knows really enjoys it. None of that is out of the ordinary.", "NTA. Congrats on your continued sobriety.\n\nIf your family is nervous about your ability to live in the real world they should talk to someone who isn't you.", "If you have the strength to go into a liquor store and not get something for yuourself, you are AWESOME!\n\nKeep it up (the abstinence, not the going into liquor stores) :)", "NTA  You have access to alchohol in most restaurants, pass multiple bars, and in many states can buy alchohol in grocery stores. There are also any social gatherings, many where alchohol is served. It's not something you can avoid all of the time. Your 3 years shows that you have done major work and still do to remain sober. If you feel like explaining yourself further to them, you can, but ultimately you were confident in yourself and dedicated to your sobriety.", "NTA. I think your family means well but is clueless too. It's sweet their worried though.", "NTA. The alcohol was for someone else not you. Unless you have had relapses I don’t get it. Sounds like you have come to terms with your problem.", "NTA, but as the daughter of an alcoholic who has recently and repeatedly fallen off the wagon and lied about it, I can understand their concern. I think this was a really nice and thoughtful gift from you, I hope they relax and can accept it in the way it was meant, so really, (edited to say this) NAH.", "As someone who dated a recovering alcoholic for a while, I would say NAH. Your family was just concerned about your sobriety and looking out for you, which most likely comes from a place of love and worry. You were just giving a gift you knew would be appreciated by the recipient, and knew you were safe to go in and purchase it without buying any for yourself. Everyone was well-intentioned. It may be worth reaching out to say something like “I really appreciate your concern and love, but I need you to trust that I am in control of my sobriety. I do understand where you were coming from, but I am okay.”", "NTA They cannot buy you a bottle of whiskey, you can buy them a bottle whiskey. They seem to have got it the wrong way about and are going overboard.", "NTA - however, this does not mean that your family are automatically the assholes in this situation either. They were clearly concerned and they also may not understand the progress you’ve made and what you are and aren’t comfortable doing. For some recovering alcoholics that situation may have ended very differently. \n\nBut it didn’t, I don’t think anyone in this situation is an asshole although, their wording could have been better and the way they approached the situation. It might be a great opportunity to educate (if you’re comfortable doing so! Maybe talking about recovery ext.. I know a lot of people might only have experience with recovery from the presentation in popular media)", "NAH. \n\nThey were concerned because that temptation can be enough for people to relapse. However they shouldn’t assume you bought any and they should believe you when you say you didn’t keep any for yourself. \n\nYou aren’t an asshole for getting him whiskey. They aren’t assholes for caring about your sobriety. Only assholes would be whoever doesn’t let it go and/or anyone who accuses you of lying without proof.", "An alcoholic going into a liquor store is definitely a cause for concern.", "Congratulations on your sobriety.", "Yes, and the science doesn't support them", "NTA - but you must have put your family through hell when you were drinking and they don't want those days to come back. \n\nThey are scared and worried, not ridiculous. They love you.", "NAH\n\nYou bought a thoughtful gift you thought your BIL would appreciate.\n\nYour family is concerned about your sobriety because they care about you, not to make you feel bad.\n\nNo idea what your full history is, but I would personally feel worried if my alcoholic sister gave me booze. I believe that would be a hard thing to shake, regardless if I believed she was sober.\n\nPretty sure they just love you and are concerned about your health.", "NAH - They was worried, alchool is an tempting thing BUT good on you for going into the store and buying an bottle for your BIL. i know it hard but you get it! my cousins been sober for five years and just give me an bunch of alchool. my other been sober for 10+ years and is celebrating chrismtas with her daughter!", "I am in recovery and I have bought alcohol as a gift before.  It all depends on where you are in your journey and on that day.  The biggest issue I had was choosing because I had no idea anymore what was \"good\".", "Well done for going to a place that sells stuff you are recovering from and not giving into temptation.\n\nThis is a big step and NTA", "NTA. Unless Ryan is also in recovery or a Mormon or something. I get your family’s concern but presumably you’ve eaten at restaurants where alcohol is served, you’ve been to sports events where alcohol is served, and so on, without the family acting concerned.", "NAH. It was kind of you to get him a thoughtful gift that you know he’d like. It’s also not unreasonable of your family to check in on your sobriety when you clearly entered a space focused on alcohol. \n\nI would say if they don’t drop it they would become mistrustful A Hs, but as someone close to a family member with substance issues, I understand their concern. \n\nCongrats on your recovery, it’s a mark of progress to be able to go to a liquor store, grab a gift, and go.", "Jesus fucking christ how fucked are they. Accusing an alcoholic who is sober of relapsing like that when all you did was something nice for the bil", "NAH. first I want to say congratulations and I’m proud of you for your sobriety— I know how all consuming this disease is and every day sober is an accomplishment— let alone three years. \n\nYou are not the AH for gifting the whiskey but please know addiction doesn’t only affect the one with the addiction but everyone involved in your life. Your family will always worry and care about you and while you are on your own recovery journey, I am sure they are on their own journey.", "You got him something he would like. Family showed concern. Unless you update with more details, NAH.", "NTA.  \nIf you're comfortable buying a bottle of alcohol as a gift for someone else, then I don't see the issue here.", "NTA and I am also 3 years sober so congrats! \n You can go into a bar, into a liquor store, do WHATEVER you want as long as you don't drink.  Your family needs to get that they cannot keep you from drinking and only you can control that.  So they don't get to dictate if you go into a bar (and don't drink) or choose to stay away from drinking altogether.  It is your choice and as long as you stay sober that is all that matters.\n\nNAH hopefully your family will gain more faith and trust in you over time.  But it is hard for them to trust you as you probably, like me, did some crappy things back in your drinking days.", "NTA\n\nI'm six years sober, as of today.\n\nI feel you deeply on this.\n\nThe fact that you have built up the strength to not only walk into a liquor store, but *purchase* something and **NOT** DRINK IT speaks volumes about the progress you've made in your recovery.\n\nYour family might not get it, but I do...\n\n...so because they won't say it I will: \n\n**I'm proud of you. You're doing a good job, keep it up!**", "NAH, I get that you think you're sober, but 3 years is not a long time for the people who were harmed by your addiction. It sounds like they have wounds that have not healed, knowing that you are comfortable walking into a liquor store did put them into an awkward position.", "I’m going with NAH. You put some thought into a gift you knew BIL would enjoy. And, hey, congrats on being able to walk into a store and buy alcohol without drinking it! However, I get where your family is coming from in maybe not wanting you to do this regularly. I assume that, up until 3 years ago, you weren’t in a good place and they had to watch you be there. I think they just want the best for you and want to check with you to make sure that you’re not doing something hard on you.", "Should show those that support you how far you have come!", "NTA. Has anyone mentioned how incredibly strong you are for going into a liquor store, buying something for someone else, and not giving in to temptation?  \n\nFrankly, this is something to be proud of. You honestly have my respect.", "Lol and so true, OP,  your family is sensitive but they are overreacting. NTA.", "I think it can be hard to tell your loved ones to ‘just not worry’ about it when you have a past with addiction. I don’t know many people who pulled off being an alcoholic without at least some broken promises. They’re his family; they care.", "Right? I would consider what OP did an achievement rather than distressing.", "Yeah I also would have felt more concerned if they hid their worries from OP. What would be the point of that?", "He told his family they were ridiculous for expressing concern. I think that nudges it closer to a YTA for OP in my opinion.", "Right but you weren't addicted to strawberries even though they were killing you and harming your family. His family checking in to find out whether or not they were about to have a problem again is not wrong. He really shouldn't be browsing the aisles when his sobriety is still so new. 3 years is not a long time when it comes to addiction", "How on earth would a receipt change anything here", "What? That’s a lot of assuming OP’s alcoholism somehow had no effect on his family whatsoever. What a weird take. Especially being like “well they had an alcoholic bartender in Cheers”— wtf?", "I mean, having an alcoholic friend who, for now, is able to only have a drink or two… why bring this up to an alcoholic exactly? It just sounds like “maybe some day you’ll even get to drink again!” Sorry, it just seems like a weird thing to mention right here.", "Nope. Sober four years. My husband enjoys good liquor, so liquor, shirts, and books are my go-to presents for him. After all, a present I never touch is truly for him. Most adults drink moderately. My inability to do so is not their problem.", "That is a fair point, but OP showed tremendous willpower and commitment to staying sober. I just don't think his family should be giving him as hard of a time as the post implies.", "But... how does his family trust that's what happen. All his family knows is that an alcoholic went into a liquor store. They have no way of knowing for certain that he didn't buy himself anything, that this isn't a sign he's spiraling etc. All they have is OP's word, which isn't really worth much when it comes to alcohol. How many times do you think OP told him he was \"fine\" while he was alcoholic?\n\nNo one is an AH in this situation, especially since we don't know what OP was like as an alcoholic. His family is justifiably concerned, and seem to expressing that concern with love and not criticism. OP was merely trying not to let his alcohol struggles prevent others from living their best life, which is commendable. \n\nThis is a rather healthy family, at least for this subreddit lol.", "But you can buy alcohol literally anywhere else", "Alright, I'll try again. I mention it in order to add perspective. There's not just one way to have moved past alcoholism. It's not directed at OP. They are separate people. \n\nYou strike me as one of those \"walk on egg shells\"-people, who are afraid that something you say could potentially cause the \"house of cards\" that is someone's sobriety to come crashing down. OP is comfortable enough to walk into a store and pick out a bottle of whiskey, have it around for a couple of days, and give it away without further thought. That, to me, sounds more stable than what an anecdote from a stranger on the internet could hope to ruin. \n\nAlso, a gentle \"fuck you\" to you, on behalf of my friend, for you making use of language like \"for now\". I'm sure you didn't necessarily mean it like that, but allow me to point out how condescending it is to use language that all but states that he'll fall off the wagon.", "Exactly this! We don’t know what OP and his family have gone through apart and together about OP’s alcoholism. His family being concerned sounds like it comes from a place of love, not judgement.\n\nTbh this would also make me nervous/weirdly guilty to receive alcohol from a recovering alcoholic.", "> The axe forgets, but the tree remembers\n\nAlways love this saying.", "You don’t think an alcoholic buying alcohol could ever possibly be a sign of relapse? Like you don’t get their concern whatsoever?\n\nPeople are acting like they are starting screaming and threw him out. The fact they felt comfortable enough to talk to OP is a good sign.", "Just because it may be safe for you to go into a liquor store and you \"never touch\" his alcohol doesn't mean other alcoholics are the same.", "Yes you can, but there's a difference between knowing it's out there, and actively browsing the aisles", "I think they’re assholes for immediately jumping to “did you get something for yourself”. If they started off concerned that it might have tempted OP I’d understand that or asking if OP is okay, but they lead with straight up accusations, and at Christmas too.", "I am also a recovering alcoholic and will say buying alcohol as a gift does not necessarily means he wants to start drinking again.  He just wants to try to be normal and if his BIL likes whiskey he wants to do the normal thing and gift it to him.  My wife does not drink much but I make sure she knows it does not bother me.  Hell I encourage it because if I can't drink, at least one of us can have a good time LOL.  I am only half kidding because I have learned to have a good time without alcohol.  Took me awhile though.", "I am also a recovering alcoholic and if I can't go into a bar or into a liquor store without relapsing then I am not truly committed to my recovery.  Going into a liquor store is no different than seeing a beer commercial to me.  And I see beer commercials all the time as I am a huge college football fan.", "\"Although AA is a spirituality-based program\"\n\nWhen one of the steps literally requires you to make peace with a higher power and describes itself as \"open and understanding to agnostic and atheists\" it borders on the religious. Something doesnt have to be pointed at one religion to be religion based. \n\nThere are tons of recovery programs that are not like that that DONT use sponsors."]}