{"id": 5585, "submission_id": "zusiwp", "title": "AITA for ‘ruining’ white elephant with a custom blanket of sexy Jesus?", "selftext": "For context, the white elephant gift was a small custom print blanket of a model posing, pouring wine down his chest, with the classic Jesus thorn crown, shirtless, and white towel around his waist. The top read “Step-Daddy, I’m stuck on a bible verse..” in cursive.\nMy family is not hyper religious, rarely goes to church on Sunday. We have this white elephant every Christmas Eve, all of us are adults. The only rules were keep it at $20 max. \nWhen a family member opened the sexy Jesus she proceeded to be very unhappy and go on a rant about how it was not funny and not in the spirit of the activity, that it really ruined the activity in general.\nAm I the asshole here? The gifts sometimes get a bit raunchy too. Have been over the years…\n\nEDIT: Wow, didn’t think this would blow up. Merry Christmas to y’all: image at - [https://imgbox.com/uZOUpSso](https://imgbox.com/uZOUpSso)", "created_utc": 1671950411, "permalink": "/r/AmItheAsshole/comments/zusiwp/aita_for_ruining_white_elephant_with_a_custom/", "score": 3093, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might have overstepped with my white elephant gift this year for Christmas.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "OP for the love of step-daddy, share the picture\n\nETA: NTA", "That’s pretty tasteless. Perfect for a white elephant. I once had a steal battle over a talking vibrator with my sister’s mother-in-law (now there’s a sentence I never thought I’d write). You just have to go all in or it’s super boring. \n\nNTA", "INFO: Please explain “Step Daddy,\nI’m stuck on a bible verse.” \n\nSerious question.", "NAH. That would go over very well at any white elephant I’ve ever been to, but I’ve never been to one with my family before. Maybe reserve it for a friend-based white elephant next time.", "Definitely in that it's so wrong it's right category.  NTA", "NTA.\n\n\nWell maybe you are one, but that's for not sharing the pictures !!!", "NTA. Isn’t the point of White Elephant to be ridiculous? That sounds pretty ridiculous. Whoever received it sounds like a party pooper.", "Love it. Can you buy it online?", "NTA. She sounds like a killjoy. If she doesn’t want the sexy stepdaddy gift, someone else playing the game can steal it from her.", "NTA that’s funny af", "Love it. Can you buy it online?", "NTA aren’t white elephant gifts supposed to be dirty?", "I prayed to Sky-Daddy…\n\nand tho said NTA", "I hear you saying that your family isn't super religious, but you all do go to church occasionally.  I think this gift definitely crosses the line, and just because someone isn't in church every week doesn't mean they don't respect their faith.  Sometimes I have seen people who aren't regular church goers be more respectful of their religion than the ones in the pews every week.  Tip for the future: don't buy a gift making fun of the religion you all participate in.  I would say YTA in this case.", "NTA. Your family should not be having white elephants if they're gonna get offended at something like that. The entire point of white elephants is to give super dumb gifts, which you totally nailed. Honestly a gift like that would have been the in demand one at every white elephant I've ever been to.", "NTA. I mean, if it's all fun and games, and it's with family members who are all adults, AND the gifts get raunchy, it shouldn't be a problem.", "NTA but I'm biased because this made me laugh so much 🤣", "Soft YTA - Just because someone isn't propping up a pew every Sunday it doesn't mean they don't have a religious faith, they just prefer to keep it private, and unless you really are sure that this type of gift wouldn't offend someone you should never try it. There's also a difference between risque and raunchy gifts and offensive ones, even if they're not offensive to you, and religion is a minefield best avoided unless you are looking for drama.", "YTA- you had to know that at this time of the year, someone was gonna get offended.", "Soft YTA. It sounds like you would have put that gift in the exchange if you thought it would have offended anyone. But it's generally known to keep politics and religion away from these things.", "YTA", "Soft YTA but I don't know how your family are. Are sexual jokes common?", "YTA. The idea of \"sexy Jesus\" could have been funny, but the \"Step-Daddy\" part makes it entirely tasteless and inappropriate.", "[deleted]", "YTA but not a huge one.  This would have been a safe gift for a party full of atheist activists.  It’s not when there may be religious people present.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor context, the white elephant gift was a small custom print blanket of a model posing, pouring wine down his chest, with the classic Jesus thorn crown, shirtless, and white towel around his waist. The top read “Step-Daddy, I’m stuck on a bible verse..” in cursive.\nMy family is not hyper religious, rarely goes to church on Sunday. We have this white elephant every Christmas Eve, all of us are adults. The only rules were keep it at $20 max. \nWhen a family member opened the sexy Jesus she proceeded to be very unhappy and go on a rant about how it was not funny and not in the spirit of the activity, that it really ruined the activity in general.\nAm I the asshole here? The gifts sometimes get a bit raunchy too. Have been over the years…\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Hahaha\n\nGot em", "Wtf is white elephant", "NTA- hilarious!!", "ESH Guess your family has secret prayers, otherwise, it's also not moral to disrespect religious figures.", "_cracks knuckles_\n\nOk so the first thing to know is that there is a genre of porn where step-siblings are attracted to each other. A very specific meme of this genre (which may be derived from a particular scene) is where the woman is \"stuck\" in a seemingly lascivious position and asks the stepbrother to \"help\".\n\nExtrapolating that to Jesus being God (and son of god) well, you get a unique play of the meme", "Seconded! Especially since OP says gifts in the past have gotten raunchy without issue, so absolutely NAH.\n\nPersonally I’d give it as a gag gift to very specific people, but I wouldn’t use it for a white elephant where I have no control over who gets it, because I wouldn’t want to offend someone or hurt them in some way. \n\nFor example, as a sex repulsed asexual, that particular gift would be nothing short of horrifying to receive and would absolutely ruin my holiday (very specific hang up, I know, but a very valid reason still!)", "Grow up", "White elephants are things nobody wants. Interesting back story. In this case it refers to a party game involving swapping gifts.", "No one else cares about your religious cartoon characters.", "NTA that’s hilarious.", "Bless you for taking the time to reply with a succinct summary of the meme. And bless step-daddy.", "HARD NTA in my household that would of been stolen in seconds. Fights would break out and babies murdered over such a glorious item religion be damned. One of us would damn well present that out the front like a flag and salute it.", "Soft ESH\n\nI know people are going to say that being dumb or sexual or offensive is the point, but there's always a limit to that. There are things you could probably imagine (racist toys, say) that just wouldn't be appropriate. \n\nThe family member who got sexy Jesus is more religious than you realized and got offended. \n\nShe still shouldn't have gone on a rant about it.", "Custom-made things are usually well over $20. So INFO, how much was it? Be honest.", "Lolol", "This is hilarious! NTA simply because you made me laugh!", "NTA. You were keeping in the theme of your family's tradition, which is sometimes raunchy... and you nailed it. Like Jesus' Step-Daddy letting his Son get nailed to the cross.   \n\n\nI'm giving stocking stuffer magnets at a Christmas party and one of them is a man on his knees praying, wishing that Santa will bring him a sexy Jesus.", "NTA.   I wouldn’t want it due to my religious beliefs, but I wouldn’t make a big deal about it.   I’d wait until your birthday, and give it back to you as your gift ! 😁😁😜🤷🏽‍♀️", "That is hilarious NTA", "NTA - but where can I get this for next year?", "NTA - I don't think she understood the concept.", "NTA. It’s a white elephant gift exchange. They’re not supposed to be classy gifts.", "YTA. Not appropriate at all.", "YTA.  Absolutely offensive to the family’s religion.  Smh", "This ☝🏻☝🏻☝🏻☝🏻☝🏻☝🏻☝🏻☝🏻☝🏻☝🏻", "Please share where you can buy this. I need this!", "Agreed", "White Elephant is usually a type of secret santa gift exchange but the goal is to give cringey and \"bad\" presents while trying not to end up with the worst one. \n\n[Here's](https://en.wikipedia.org/wiki/White_elephant_gift_exchange) the Wikipedia page about it.", "Huh, never heard of this \n\nThanks for explaining :)", "It depends on if your family does “normal” gifts for White Elephant or jokey gifts. My family’s White Elephant is normal gifts - kitchen gadgets, home decor, alcohol, gifts cards, ect. My friends White Elephant is more of a mix of normal to jokey. If I brought a joke gift like this to my family one, whoever got it would probably be disappointed because they expecting to get something normal. So I’m going to say soft YTA because maybe you should have known better.", "YTA. Just because they aren’t super religious doesn’t mean they don’t have their faith. This is also an item with a very specific humor to it and unless you KNOW everyone will find it funny you probably shouldn’t have provided it. \n\nThink of it this way, if you have a dark sense of humor are you going to go around making jokes like “I’ve got an itch on the top of my mouth only a shotgun can scratch” to just anyone? Or are you gonna make sure you’re saying it to someone you know appreciates that dark sense of humor? You’ve got to know your audience.", "YTA - \"My family is not hyper religious\" which implies that they are religious to some degree, just not off the charts religious. Mock someone's religion and someone will take offense.", "I'm not religious but I would find it tasteless. YTA", "What the hell is wrong with you", "I’m gonna say YTA. If you decide to bring something as blatantly inflammatory has a ‘sexy Jesus’ then you have to understand why someone would find it offensive. What makes me double down is that if I brought a gift that mocked someone’s religion, I would do my best to apologize and move on. I wouldn’t go on a Reddit crusade to find atheists to pat me on the back and make me feel better for being shitty to a family member.", "YTA showing a joke depiction of somebody's faith is never going to go well..? just because someone isnt hyper religious doesn't mean they don't have a strong faith in the figure u wanted to show a 'sexy' depiction of.\n\nreserve those for people who aren't believers who'd catch onto the joke.. because your family could think ur mocking their faith.", "Yta. It's not ok to makenfin of religious communities.", "NTA the rules were $20 limit. That's it. Your gift was fine. It's not your fault they got their britches in a twist.", "NTA that was hilarious.", "YTA\n\nyou’ve stated that your family is religious, and it doesn’t really matter if they go to church every sunday or not because they still have their faith. what you did was mock their religion, of course they’re going to be offended.", "I just wanna see the pic lmfao", "Well you can’t possibly expect us to judge without posting a picture 🤣", "NTA, and... is the blanket still available...?", "I think it's great, but I'm not at all religious.", "NTA, that's fucking hilarious and I want one now <33", "NTA.  I hate these kinds of gift exchanges for this very reason.  Someone is always an AH about the gift they receive.", "NTA. Honestly, I would have died laughing if I had gotten that. In fact, I think I need to find one to give to my friend as a birthday present lol.", "NTA that’s hilarious. A bit tasteless, maybe, but that’s par for the course in a white elephant exchange where you’ve said raunchy gifts are not uncommon. I would have cackled like a hyena if I got that.", "NYA. it was absolutely in the spirit and probably the best thing. My friends and I would have fought over it, even my hyper religious family would have found it funny. You’re welcome at my white elephant anytime", "NTA....but please....share a photo of this masterpiece", "It’s a perfect white elephant gift!!!", "NTA. I personally would be uncomfortable with this gift but if you guys regularly do raunchy then do raunchy by gosh. Our white elephant gifts tend to be more prankstery than raunchy, like the one time I got a hat with mistletoe on the end, hilarious and it’s one of my favorite Christmas hats ever.", "Nta, shes just salty she got the white elephant", "Idk, but honestly I would love to have that as a present that’s hilarious", "NTA. My reverend grandmother would have thought that was hilarious as well as most people I know", "That's probably the picture\n\nhttps://i.imgur.com/7Rjc1wJ.jpg", "I’m sitting here confused about how a custom blanket was 20 bucks. \n\nIt’s when people go over the cost limit in white elephant that really, REALLY pisses me off. Like if everyone is passing around like, cookie tins and card decks and cheap vibrators, and then there’s this one pair of expensive sunglasses that obviously everyone is stealing over and over. Like, we get it, everything is a competition to you and you cared more about the attention / status of bringing the “best” gift than actually playing the game. \n\nIf you managed to have this made for that cheap, like if it wasn’t a huge blanket, and just a cheap 20 dollar novelty, NTA at all.\n\n…\n\nI AM sorry though, when you said “family” I was like… pardon? Like I get raunchy gifts, but “help me daddy” Jesus is something I would more expect at like… an adult, maybe queer holiday party where pretty much everyone had a fairly resentful history with Christianity and/or would actually understand the stepsibling porn meme it’s based on, where it would be an instant hit.  \n\nLike I mean I would more get it if you just … *saw* it and thought “hey that’s funny” and grabbed it. But *custom* “help me daddy” Jesus for your family white elephant? Feels a little like you were really trying to make a statement haha", "No answer. Looks like you get to Google sexy Jesus blanket!", "💯 this!! Pics please!!", "Don't leave us hanging, who won the talking vibrator?", ">You just have to go all in or it’s super boring. \n\nThat's what she said.", "This is probably it. My extended family nearly cancelled Christmas following a White Elephant gone wrong. Most of the folks brought normal gifts and a few brought jokey gifts. A couple normal gifts were obviously waaaay higher than the price limit and the game quickly became very cutthroat. We never did White Elephant again and now everyone just brings cookies or sweets to share.", "Tasteless gifts are the entire point of white elephant though", "Though I agree with you comments about religion, this was an adults only white elephant party.  Even if someone’s offended by a gift, they should still behave with a bit more decorum.  That gift was not extremely outrageous.  They should have just smiled politely and swapped with someone who thought it was funny.  NTA.", "last year’s great white elephant gift was chloroform and a rag", "Stupid, sexy Jesus.", "White Elephant gift game and Dirty Santa game are not necessarily the same thing.  I have played White Elephant game where everyone gets a number to decide the order of who picks a gift but you are stuck with the gift you pick, no stealing of gifts allowed.", "They put their differences aside and shared it.", "Wouldn't Jesus step-daddy be Joseph tho..?", "All of which is why I feel like it’s funny for white elephant but pretty fuckin weird and niche for family white elephant, lmao. \n\nA vibrator or handcuffs is one thing. A **custom** “Help me daddy” Jesus iteration of a stepsibling porn meme is pretty extra.", "Step-Daddy is Joseph of Nazareth! He stepped up", "“Even if someone is offended, they should still behave with decorum.” Yeah no. I haven’t been to church in a minute, but my faith is still near to my heart and if someone got me such a gift, I wouldn’t have a nice reaction. Y’all need to stop policing people’s reactions to be insulted. Why should I have to smile politely at someone basically making fun of my faith", "More decorum than the person buying the gift? Hypocritical much", "OP should also choose gifts with a little more decorum too, so its a soft ESH. We cant expect decorum from others and not from OP.", "I have never heard of “dirty santa,” and I have never heard of white elephant not having stealing component. Basically any research online I have just done says white elephant and dirty santa are just different names for the same game.\n\nI’m not saying it doesn’t happen, just that it’s definitely not the norm, or how the games are generally widely known for being played. Anyone can take a well known game and adapt it to their own rules, etc. But stealing is a pretty common element.\n\nEven in any of the different versions I’ve looked up online, they have lots of variations (eg how many swaps are allowed, etc) but no acknowledged variations have “no stealing allowed,” because that’s the point of the game.\n\nIn your case, it seems like it’s not so much a case of “white elephant doesn’t necessarily mean stealing.“ I think it’s more a case of “your family/friends are playing a different game and calling it white elephant.”", "Aw, truly the spirit of the season.", "I…I’m…I’m seeing things I’d rather not see.", "[deleted]", "Exactly", "I have played White Elephant with a group of close to 100 people, it took forever just with everyone picking a gift and unwrapping it.  If we allowed people to keep stealing gifts we would never get done.  So we call one game White Elephant and one Dirty Santa.", "INFO - can you give examples of what kind of \"raunchy\" gifts went over well previously? The combination of sexy and religious requires a very specific audience - what are some of the gifts that led you to conclude that your family is such an audience?", "YTA.\n\nYou don't have to even be religious to find this kind of gift needlessly tasteless, and not even in a particularly funny way? Like if you're still in the 12-year-old-boy-guffawing-at-anything-that-isn't-athiesm phase, I guess? I love goofy humor, this just seems childishly cringe-worthy.", "It's not a good choice for the situation YTA", "This sub: \"because this gift literally designed to be offensive is funny to me, everyone else in this situation is an asshole regardless of the context of the situation\"", "YTA. It isn’t hard to see either. Replace the family with a secular Arabic family and make this a blanket with the Prophet, and this response would be mild. Do it at a Ramadan party and see it be doubly so. \n\nReligion and self identity are deeply intertwined. My mother hasn’t said one word about religion in my entire life, and doesn’t always go to church; but she would not only find this offensive, it would be something that bothered her for years. And this wasn’t a dankchristianmeme photo — it was something that, to anyone with even the slightest hint of religion, would be deeply offensive. It was tasteless and crude, and you were OBVIOUSLY wrong in your assessment that it wouldn’t be offensive. That makes YTA, period.  \n\nAlso remember that white elephant parties with gag gifts inherently put the receiver on display—how will they react to the joke? Everyone is watching them. Giving them something that is so likely to be offensive to large parts of the population means that they must not only react how they feel, but also if they know someone else in the group would be offended, they may feel the need to point out the offense rather than laugh it off and alienate that person. \n\nTLDR—don’t bring offensive gifts unless you’re 100% sure of how they will be received. And if they are received poorly, the fault was yours and you should apologize.", "I mean, if that came out at a family gift party I for one would be horrendously uncomfortable because of the stepdad porn line. It's not even sexy jesus for me--sexy jesus is a longstanding tradition in christian art--but the choice of kink to include is uh. Gross.", "I’m not religious and I think YTA. I can’t imagine thinking it’s okay to gift this to anyone who’s ever voluntarily gone to church, whether it’s rarely or not. Especially family members. You had to know someone would be offended.", "YTA  if this was any other religion people would be mad I’m not even Christian and know nothing at all bout Christianity but I can tell this is disrespectful as hell to their religion.would you do the same to Muslim religion or any other religion besides Christian", "Any “gift” that mocks any religion is a bad thing and not funny. Would a poster of someone in black face be funny? A poster if Hitler? I say stay away from stuff like that.", "Soft YTA: I think religion and politics should be left out of things like this unless you KNOW no one in there is going to take issue. Especially if it can be perceived as making fun of a religion. Older generations may not be very religious but were likely raised keeping some things sacred. Pun intended.", "That sounds so distasteful", "YTA even bracketing the religious question porn references in a gift exchange with your family are extremely weird. I've never been to a white elephant exchange where the gifts weren't something normal and useful under $20, like a candle.", "NTA. absolute legend", "NTA, period", "If its with family, slightly yta. Most redditors may say nta because it is popular on this site to find humor at religions expense, especially christianity.", "You should respect other peoples’ religions, no matter your feelings towards it.", "ESH. I don’t go to church, and don’t hang out with many people who are very religious. But I’m also very uncomfortable with mocking anyone’s faith. So I would hate the gift too. But if I opened it, I would have kept my opinion to myself and let the game go on undisturbed. Because that’s what adults do.", "No comment tf did I just read 🥲", "It’s like the idea popped into your head and you never gave its reception a second thought before the gift exchange.  YTA for thinking everyone would enjoy your dark humor about something so meaningful to others.", "Is a white elephant the same as a Yankee Swap? That is what we New Englanders May call it.", "NTA u weren't at church.", "NTA. Can I get that blanket? For science?", "It occurs to me this would be perfect for work xmas parties where that one person brings their kids to an Adults-Only party. I'd love to hear her explain the nuance of step-porn to those sweet upturned faces!", "Imagine that you did something similar with the prophet Mohammed and a Muslim family member received the gift. Are you cringing? You should be. \n\nWhether or not you agree someone’s religion, you need to have the common decency not to crap on their beliefs. YTA.", "NTA - Please post a picture of sexy Jesus for research purposes.", "I think, you always have to judge of what you’re doing is the best idea. \n\nSounds like you thought you were in the clear because of other white elephant gatherings. Honest mistake. But yeah I’m going to say yeah kind of the jerk here.\n\nWould you gift a sexy Muhammad blanket knowing someone at the party might be Muslim or at least have respect for Muslims? If not, don’t do it with Jesus (fun fact,  Muslims also think Jesus is their prophet) \n\nFor some reasons, the west has this weird fascination with being as disrespectful to Christians as possible while respecting Islamic beliefs and forgetting that Muslims actually care alot about Jesus.", "I am enough of a heathen that I immediately knew what picture this probably is, and that's hilarious and absolutely perfect for a White Elephant gift\n\nYou're also a good person for picking that picture and not the worse ones from the same picture line.\n\nNTA", "NTA. Hysterical!", "NTA. That sounds hilarious", "Honestly OP NTA most of my family is very anti religion (family history of cults) but the ones who are frequently react to our traditional white elephant gifts with the same horror. I will never forget the rant my Uncles wife went on Christmas Night 2017 over a where's Jesus wall calender (a play on where's waldo) where she basically cursed everyone to hell for laughing at the lords name and bringing blasphemy around her. Little did she know my great aunt found someone to whittle a large penis out of a giant eraser and attached it to a can man statue who previously had a much smaller eraser penis. that was the gift my uncles wife would open next, she simply \"went to bed early.\" Which was rich and everyone could tell didn't happen because the room she was staying in was next to the 35+ person game of white elephant that went on for 2 more hours and she came out to complain about the noise. I will not stand here and say your gift OP is SFW or that all of my white elephant gifts have been in the past, but I will say that some people take religion very seriously while others simply do not and there isn't one true right way. But OP your gift is absolutely hilarious and I am sorry that these comments are coming down so hard on you.", "NTA - that sounds like the greatest gift ever. In Step daddy's name, amen.", "Please tell me you know of 'oh my god, its the church'? Praise sexy Jesus!", "I can't judge, lest I be judged.", "NTA. Tell your aunt to send it to me. I think it's hysterical", "Not all heroes were a crucifix", "*secretly sad I didn't get one*  . nta", "Lmao omg I love it. If it was with my family or my So's family? It'd have gone down like a good whiskey lol it'd be fought over.\nApparently this isn't a family that works with..  Sorry it didn't work out, next time you know to bring a wrapped bog roll to avoid offending anyone :p\n\nJudgement NTA. I'd say n a h but she went on a rant that probably ruined the mood more than the blanket did overall.", "NTA. Stupid sexy Jesus.", "NTA I’d use that daily", "I highly recommend checking out Hamlet 2. \nRock me sexy Jesus!\n\nNTA. It sounds like the perfect white elephant gift.", "NTA. That’s hilarious and now I want a blanket like that", "Epic.  NTA", "Sexy Jesus blanket tax", "I need to know where you buy a talking vibrator. Asking for a friend and myself.", "While I agree it would perfect for a white elephant with friends, with family? Ehhh...I guess it depends on the family.", "Was coming here to say this. My family does white elephant most years and there are rules we usually abide by. Usually no lotion/bath gift sets, candles, or generic glassware. And no gag gifts…although some times we’ll decide on two rounds of white elephant, one with a serious gift and a second with gag gifts only.", "Mock someone’s religion on one of their big religious holidays.  There are places this would have been acceptable, but not at a semi-religious family event. YTA. Read the room.", "\"BuT tHeY bElIeVe In SkY dAdDy!!  So they deserve it!!!\"", "There’s ridiculous and then there’s offensive. This is the latter.", "Wouldn't Jesus step-daddy be Joseph tho.", "I also want to know where they got a custom print blanket under $20. I checked Shutterfly, VistaPrint, and Canvas Prints and couldn’t find an option for less that $35.00 USD and that was with a discount. I’m not being accusatory, I genuinely want to know. \n\nOtherwise, yeah, OP definitely had a lapse in judgement on the print. The problem with joke gift is you have to be 100% sure that the joke will land with the recipient. In a white elephant that means everyone would have to find it funny.", "[removed]", "\"Help me Step-chihuahua, I'm stuck in the dryer..\"", "God is his biological dad. His stepdad would be Joseph.", "I also would be kind of ticked-off if I brought something ‘good’ to a white elephant but went home with a gag gift that is going to end up in a landfill. Definitely a ‘know your audience’ thing.", "Depends on the circle, everyone plays differently. Some people lean more impractical, others lean on funny others lean on tasteless.", "There a certain limit of tasteless you don’t do you never ever disrespect a religion, somebody’s race ,or somebody’s sexuality at all", "So they shouldn’t be held to any social standards based on the feelings of those around them, but the person opening the present should..? I don’t understand that logic", "If it was a adult only white elephant party he should acted like a adult.adults no being disrespectful to a religion is wrong", "I’ve never known it to be raunchy or dirty gifts as the intent, I’ve heard that as “dirty Santa”. My family’s white elephant is always normal gifts so I could see being upset if you received that blanket while everyone else got normal gifts.", "Interesting. I've only participated in white elephant a couple times, but generally 98% are things you actually want and like 2% funny gifts. It was very successful that way as people would choose to \"steal\" another's gift in lieu of opening a new one. We'd set a cap on the number of steals because some gifts, particularly nice bottles of alcohol, were often stolen.", "It like he's wearing nothing at all", "I've seen promotions at random times in the year for a \"free\" mug, blanket, tote, or prints (usually actually a BOGO or you pay shipping) from different retailers, so if you plan for those kind of gifts WELL in advance, like graphics prepped & ready 24/7, it'd be easy to get a cheap printed fleece.\n\nStill generally has an MSRP over a price limit like that, but if you're in a mood to split hairs or your family/group is into *maximizing* what you can get with $20 as part of the game— not everybody is, some people feel like sales etc. like that are cheating— you can prove under $20 left you in order to acquire *that* item.", "My family combined them for a few years, it went pretty well because most people stuck to the idea.  and it was done after those who drank had a \"few\" drinks and people fought over bad wine and sip paintings and photo mugs from when the cousins were in high-school (they're 40 now) and laughed at the ruthless mom's getting rid of their now adult kids \"3th place T ball\" trophies.\n\nIt fell apart when people started running out of junk and had to buy stuff", "….yes I’m aware of why it’s funny lmao\n\nI was talking about why I’m not surprised his family didn’t appreciate it, not that I don’t.", ">Step-ped up. \n\nI see what you did there", "Because usually the people who get upset about someone making fun of their faith have no problem when it's someone else's.\n\nAnd they didn't specifically get this person this gift. There wasn't nefarious intent behind it.", "The point of a white elephant is to be ridiculous. I’m betting every other gift was bland. Dude who got offended probably gifted a rubber chicken or fake puke.", "Then you don’t participate in a white elephant exchange, thats all. If there are things that offend you, its not cool to participate in this sort of activity because you’re setting other people up to fail. “Give me an inappropriate gift but it cant offend me” is a hard thing to do.", "This is such an immature take. \"This stereotype of people I made up in my head would make fun of other religions, so real people shouldn't be mad when I make fun of theirs\"", "The road to hell is paved with good intentions. Not having nefarious intentions doesn’t take away that you’ve hurt someone’s feelings. I usually don’t mean to bump into people, but when I do I apologize. I don’t go “well I didn’t do it intentionally so get over it.” \n\nAnd stop speaking for people of other religions. Just about every church that I’ve been to that isn’t mine, and mine have always taught to respect other’s beliefs. If if you don’t like their beliefs, you still have to respect them. Some of y’all really have this mindset that all religious people are the same, so it’s okay to offend them because of what you seen other religious people do. That’s not how it works in real life.", "You can be ridiculous without being offensive and blasphemous. She literally could’ve gotten something from Spencer’s like dildo, or fleshlight. When you bring peoples faith into, you’re asking for trouble usually, because that’s something people hold dear to them. And I’m not someone who’s easily offended, but that would’ve rubbed me the wrong way", "No it’s not. But okay. It’s usually common sense not to make fun of someone’s faith. There’s gag gifts, and then there’s the extreme", "That’s just a gift exchange, white elephant and dirty Santa have rules for stealing.", "You replied this to me:\n\n> White Elephant gift game and Dirty Santa game are not necessarily the same thing. \n\nI didn’t even mention Dirty Santa. I had never heard of it. I only knew white elephant usually involves stealing.\n\nAnd I said:\n\n> In your case, it seems like it’s not so much a case of “white elephant doesn’t necessarily mean stealing.“ I think it’s more a case of “your family/friends are playing a different game and calling it white elephant.”\n\nAnd so, you said:\n\n\n> I have played White Elephant with a group of close to 100 people, **it took forever** just with everyone picking a gift and unwrapping it.  If **we** allowed people to keep stealing gifts **we** would never get done.  **So we call** one game White Elephant and one Dirty Santa.\n\nSo… exactly like I said. You literally just flat out told me you specifically just made up different rules because the rules weren’t working for you… Like you’re just.. proving my point?\n\nKnowing that, why would you go out of your way to “correct” me about what white elephant is in the first place?", "Would this really truly hurt your feelings? What would be the desired outcome? Would you feel personally disrespected about a gift not even specifically for you?\n\nThere's something very performative about feeling the need to make a pearl-clutching speech in front of other people. If some random cousin or whatever made a similar faux pas in my mind, my first instinct would not be to go on a rant to embarrass them further. I would maybe have a private word later that I didnt think it was appropriate. MAYBE. \n\nThis wasn't a workplace. There's no HR to call. This is a gathering where raunchy gifts have been given before. It honestly wouldn't occur to me that people who are fine with vibrators or dirty playing cards or whatever would take offense to a clearly joking picture of Jesus, especially given the \"not every sunday\" aspect of their devoutness.", "Some people of faith would be offended by the dildo and the fleshlight. Again, if you have sensitive topics, either forewarn people or don’t participate in this type of exchange", "It's not blasphemous if you don't believe in the fairy tale.", "[deleted]", "You don’t have to go to church to be devout. Going to church doesn’t determine the relationship that you have with God, because you can go to church on Sunday and then show you ass on Monday. Your relationship with God is based on more than just goin to church.\n\nAnd yea it would hurt my feelings, and I definitely would say something right then and there, but then again, no one and my family would something like that, and mind you, we smoke, drink and talk about sexual things. Hell, my aunt got me a dildo for Christmas because I’m waiting till marriage with the line “here’s a fake one, till you find a real one ya like.”\n\nThere’s lines you just don’t cross in life. I’ve definitely had to establish boundaries with friends, and yes, I’ve done it in front of the friend group. I can take a joke, but there are things that I think go way to far, and if I feel a way, im gonna speak on it. I may not scream, but I’d probably go “hey, ya getting a little to comfortable beloved” and then we’ll keep it pushing", "Some shit should be common sense though. I know it ain’t that common now a days, but at some point you have to think, yeah, maybe this is to far.", "Grow up dude", "…. I literally said I thought it was a funny gift. \n\nI didn’t take issue with OP’s gift, I’m just not surprised it went over how it did at family Christmas. \n\nYou are six comments deep in a thread where I took issue with someone trying to “correct” me about what white elephant is based on a version they literally made up. They’re the ones that brought up the “semantics” and made it an issue. I bolded the words that clarified that they are aware they made it up themselves, in order to communicate why I was confused that they tried to correct me in the first place as if it was a general thing. \n\nSo sorry if you take issue with my use of formatting (which by the way exists for a reason) for emphasis and clarity. One of us is clearly projecting, and it’s not me.", "So why is your line the end all be all?\n\nThis is such a hilariously typical religious person response. My extremely specific line that no one else would ever know is the line that needs to be respected. EVERYONE ELSE at this party must know and respect this. \n\nBY THE WAY, if someone else in the room doesn't like smoking or drinking or dildos, deal with it.", "Lmao you masturbate and consider yourself devout?  This is the problem with “respecting” religious convictions, y’all literally just make them up as you go along.  Get over yourself.", "\"Lolololololol\" *lololololol* **lololololololol** ok comment edited to remove blankets. You like the blanket but hate when games are misnamed.", "Having someone not make fun of your faith isn’t an extremely specific at all. If I’m doing white elephant with someone’s who’s Muslim, I wouldn’t get them a sexy picture of the Prophet Muhammad, because that’s just plain common sense.\n\nSecond, no one in my family is uncomfortable with drinking and sexual things. My mother hates the smell of weed, but we just we just wait till she lives. We don’t just say fuck you to peoples feelings dude.", "Umm the Bible says nothing specific against masturbation. No one’s making up shit over here, though I see a lot of non religious people, who’ve never been to church a day in their lives, never even cracked open the Bible make a lot of assumptions about Christianity.\n\nWhen people talk about masturbation, they’re usually referring to “spilling your seed”, which a.) I as a woman can’t do, and b.) is referring to Onan. Yes, God killed Onan, for spilling his seed, but it wasn’t because he was masturbating, it was because he failed to complete the task that God had given him, which was to impregnate his dead brothers wife (which was a common practice in those days, if the husband died before an heir can be produced). \n\nGod literally made us with sexual desires and urges. Nothing wrong with a little release from time to time in moderation.", "Like I said. Keep proving my point.\n\nEdit: keep editing comments, it’s not going to do anything? \n\n> ok comment edited to remove blankets. You like the blanket but hate when games are misnamed.\n\n….I was literally criticizing someone for trying to correct me about names. I am not the one who is upset when something is misnamed. I was confused about why someone was trying to teach me about things they named themselves like it was supposed to be common knowledge.\n\n\nAre you good?\n\nShould I say “found ‘wisdomofpearl’s alternate account’” since that’s apparently what we’re doing?", "Interesting that you gloss over the fact that Jesus, as a devout Jew, certainly would have considered masturbation a grave sin.  I know plenty about Christianity, thank you very much, enough to know that it’s basically Calvinball these days.", "NAH. It’s incredibly funny, and absolutely in the spirit of the activity if raunchy gifts have been there in the past. You may have pushed the envelope too far, misjudged the possible recipients, and perhaps a light apology is in order if it managed to strike a nerve with your aunt, but I don’t think it makes you t a h for trying it", "Nta OP\nYou could have gotten a  lot worse of an item for White Elephant and sometimes gag gifts are the best part of the gift exchange. \n\nThe gift my husband opened for white elephant last night was a pocket pussy atleast your aunt didn't open something like that!", "NTA\n\nBut dear golly I need a picture.", " NTA.  White elephant gifts are supposed to be weird/inappropriate/ funny.   Picture? Please?", "NTA it’s hilarious.  And PLEASE can we see this ???", "NTA, that is a perfect gift", "I would’ve preferred a blanket than the toilet paper and plunger I got from my white elephant", "I think I really need to *see* sexy Jesus to make a decision. \n\nFor the love of Holy Step Daddy NTA", "Judging from her reaction, I’d say you nailed the idea of the white elephant gift event on the head. Imma go with NTA. They want to play this game until they get stuck with the sucky white elephant gift.", "Since you say your family isn't hyper-religious, I'd say a tacky/hilarious sexy Jesus is a great white elephant gift. Much better than the used tea bag someone brought to the work white elephant party a few years back! \n\nNTA!", "NTA. That sounds hilarious and perfect for white elephant. The gifts are supposed to be ridiculous and tasteless.", "NTA in my house, there would be a fight to the death for that blanket (save for my religious mom)", "NTA. That's hilarious and in the spirit of a white elephant game.", "INFO: Did anyone steal the blanket?", "NTA that’s hilarious. Receiver is a party pooper.", "NTA. that's funny. White Elephant is supposed to be tasteless gifts, gag gifts, gifts you don't want. I hate white Elephant but that would make me giggle", "NTA, comedy is subjective. Your joke gift didn't land with your family, but that doesn't mean it isn't funny. Also, I'd argue that it's very in the spirit of the activity to get a gift like that.", "NTA SEND IT TO ME!!\n\nFor love of all that is holy and un, PICTURES!\n\nI need this blanket.", "NTA, this is an awesome gift for white elephant.", "NTA.  The recipient needs to take that broomstick out of her . . . . ear.\n\nThat is hysterical, EXACTLY what a white elephant party is about and sounds perfect.\n\nMy only disappointment is that you haven't provided a link.  It's never too early to start shopping for next year!!", "NTA I got my friend a tortilla blanket this year, and now I wish I could go back in time to change it to this lmao.", "Love it!!!  NTA", "NTA. That shit's hilarious, she's just got a bug up her ass lmao", "YTA here. I’m taught to respect all race and religion. Anything that crosses the border it not funny. It’s tasteless and lack of respect. I’m sure there’s other options for white elephant gift that you can consider in the 1st place.", "I feel like this is a gift you should only give if you know that EVERYONE present would be 100% on board with it. What you described is a gift I would give for a white elephant party among my close friends (all of whom I know would find it hilarious), but probably not among family (some I know would laugh, others I am unsure about).\n\nI would say NAH, but just take it as a lesson that you should be slightly less raunchy with your gifts with these particular people.", "NAH, but that kind of gift is one where you should really know your audience. If you’re not 1000% sure that it would be a riot (and it absolutely would be in any of my friend groups), skip it and get something else.", "A woman at work gave a used candle in our gift exchange. She got trashed for it when she admitted it was her.", "NAH. You made a social faux pas, didn’t read the room — or recipient? Not sure of the culture, but raunchy Jesus is clearly too much for some in this crowd.\n\nI,however, this this is hilarious. Share the goddamn photo.", "Dude WHERE are you getting a custom blanket for under $20?? Need to know for reasons that DEFINITELY aren't similar to yours or related to my dream to become a complete meme menace to my loved ones.", "Info: Are sexy gifts like thia the norm in your family gatherings?", "I want to see Sexy Jesus", "It sounds like a case of not knowing your audience and you have offended them with the gift, which makes you, intentionally or not, YTA.", "NTA, I love this and now I want a sexy Jesus blanket.", "Maybe not the asshole, but for the love of step-daddy, read the room.", "YTA, but that is so fucking funny. I'm going to hell for laughing.", "Slight YTA. I’m not as religious as I used to be (like when I chose this username 🤦‍♂️) but you gotta know your audience and it seems like a kinda weird thing for a family white elephant thing (a group of like-minded friends, this would work but family?).\n\nAlso, you gotta realize what people might get offended by in a group. It sounds like some of your family might be a bit more religious than you make it sound so that might not be the kinda thing to pick even if you and a few other relatives would be cool with it. Some of my relatives and I are super into horror movies but some others find them disturbing so I wouldn’t put something horror related into a white elephant exchange where anyone in the family, including someone who finds it offensive, could potentially pick it. And I think that’s the important part, anyone in the family could have ended up with it. This might be a fine gift for someone specific that you know would like it (using my horror movie example again, I got some horror themed gifts this year which were fantastic for me but I know some other relatives would have hated them) but for something that anyone could pick… maybe pick something less edgy and with wider appeal I guess?\n\nJust my thoughts, sorry if too long.", "Lol NTA. The point of white elephant, at least for me, are to come up with j retesting and unique gift ideas. For a $20 limit anything serious you put in, is just probably going to be something boring anyone can buy anyway, so why not make it an interesting gift to talk about! If they don’t like it, boohoo it was a $20 gift exchange.", "YTA mocking religious leaders/icons isn’t funny no matter who they are and this is rly tasteless and immature tbh like rly?", "The only people that can judge this are your family members", "YTA a white elephant should not be potentially offensive.", "Past precedent sets the vibe: you did exactly what has been done before and someone got her panties in a knot for some reason.  Not your issues; theirs.  NTA", "Nta. My family would think this was hilarious lol", "Lmfao I’m fucking dead NTA", "YTA so inappropriate for a family white elephant exchange. I think you wanted to be a sh*t", "Omg this is too funny. This is my type of white elephant gift exchange. It reminds me of the time I bought a pink glitter Jesus and my grandmother got angry…lol. Rest in peace, grandma!", "One year I brought a machete and a dehydrated ice cream sandwich.", "NTA and I'm honestly shocked that so many comments think that Christians would obviously hate that blanket. Most Christians I know would find it hella funny.", "Nta that's hilarious", "Not really the arsehole, but as with any joke, know your audience. If you're only amusing yourself at somebody else's expense, you're basically a bully. \n\nBut given the irrational subject matter, it's fair game - NTA", "Soft YTA. A gift portraying a significant religious figure, one some of your family members believe in and worship, in a sexually compromising state is deeply disrespectful. It'd be different if this was a holiday party with some ex christians who now hated the church or something. Reddit is just more likely to be lenient towards it because Christianity Bad.", "Here me out, I can’t call you the AH, but damn, that was uncalled for. \n\nNot going to church every Sunday doesn’t make you less of a Christian, also you used ‘rarely’ which means they sometimes DO go. \n\nI’d personally feel very uncomfortable just seeing that, so NTA (you didn’t know) but I do think if you were asked to apologize or something you should.", "YTA\n\nAt best, it is a Know Your Audience sort of thing. In that case, it would be N A H, although still tacky.\n\nAt worst, it is in poor taste. \n\nYTA", "YTA. Is your aunt offended because you made fun of her religion? Or a that you made a weird gross incest joke to your family? Maybe probably both. Like I have a pretty “inappropriate” sense of humour and even if I found this funny it would be uncomfortable in front of my family", "Yes not everybody is religious and it’s annoying for you to do that in general for those who are and for those who aren’t.", "YTA. Just imagine you insulted Islam or Judaism. Mocking people’s faith isn’t cool or edgy. Grow up and learn some basic respect. You are one sick individual.", "YTA this isn’t a gift to bring if anyone present is a practicing Christian. You don’t know your family well enough (especially spouses and cousins) to bring this gift.", "It’s vulgur to the religious.  Gotta know the crowd intimately if you gonna try that.  Kinda TA", "YTA. If this post was about literally ANY OTHER religion or culture, these replies would be shredding OP. This was not appropriate for Christmas or a family function, and the fact that OP had to go the extra step of having this CUSTOM MADE to be extra offensive just confirms OP as an utter AH.", "Sorry but I’m not super religious but YTA. Very blasphemous gift. Couldn’t you find something more appropriate less raunchy under $20?  OMG.", "YTA. Incest jokes at a family gift exchange? WTF", "White elephant sucks in general", "YTA you really don’t see that an incest porn joke about a religious figure is beyond tasteless? Oh my god", "Merry Christmas!", "…what did it say?", "I literally have a decorative pillow covered in beautiful blue penises and roses on a white background on my couch from a White Elephant. You better believe I stole that from someone else.", "Maybe I’ll get a Dildo with Jesus on it next year.", ">steal battle over a talking vibrator\n\nWe have different ideas on what white elephant should be", "Agreed - know your audience.", "Probably thinks Reddit represents the average person.", "I think you’re mistaking white elephant with yankee swap. White elephant is almost always meant to be over the top", "It basically defeats the point of Xmas, no thoughtful care and love shown to getting the best gift for your loved ones. \n\nWhite elephant is a great way to bring home crap that you can only get rid of at another white elephant.", "He managed to combine raunchy and blasphemy with an obscure porn reference.", "Hahaha, I would totally steal that blanket at a White Elephant game.", "I’m over here like “damn it pisses me off when the spending limit is $20 and some cheap sad sack brings a cookie tin or a pack of cards”.", "The blanket was $14, shipping was $5.", "I think I know what design you mean, and it truly is worth stealing. Glorious.", "I’ve seen holy virgin ones. \n\nNTA. That shit is hilarious.", "I think the problem comes from going past raunchy to borderline blasphemous. So someone might find a talking dildo funny, but a crass reference  to God, offensive.\n\nSoft YTA for not knowing your audience especially since they are family.", "I feel like there’s a line, though. And while I don’t claim to know where exactly the line is, I do think “allusions to incest porn at a family gathering” crosses it, lol", "Our white elephant may be misnamed, but our gifts are not junk.", "No, they're definitely not. White Elephant describes a style of gift exchange where everyone contributes a gift and people either unwrap a gift from the pool or steal an unwrapped gift from someone else. I've participated in dozens of white elephant exchanges with numerous groups of people throughout my life and not once was there a theme of trashy gifts. It's almost always something new that people actually want, and maybe occasionally a used item from home (that might be tacky, but not trashy).\n\n100% YTA for the OP.", "I mean it's pretty outrageous. I would've loved it but it one hundred percent depends on the crowd and what type of white elephant they do; are joke gifts the norm or is it an outlier? If the type of gift and joke has been done in the past NTA, If it's usually sweaters, tools, games then YTA", "Gun and a negative paternity test", "I did a search on groupon and the first result for \"custom photo blanket\" was 40x27 inch one for $7.99.", "I got one on Amazon for under $20. Can’t comment on the quality yet. It was supposed to arrive on the 16th and I am still waiting.", "This [website](https://www.whiteelephantrules.com/) seems to disagree with you as does my own personal experience.  Every white elephant gift exchange I have ever participated in included the option to choose a new unopened gift or to steal one that someone already opened.", "Only dirty santa game Im aware of is where all the gifts are on the rounchy side", "White elephant and Dirty Santa are technically different games, but often the rules overlap. With a White Elephant, you bring an item from your home you don’t want or find something ridiculous that is within the set budget. That is then put in the pile and people draw numbers to pick gifts. Sometimes but not alway, a rule is added to allow the stealing of a present someone else has opened instead of a new present, which is when White Elephant starts to really resemble Dirty Santa. The game continues until all the presents are opened and everyone has a gift. It’s a white elephant because it’s supposed to be something you don’t want or that is fairly useless. \n\nWith a Dirty Santa exchange, you buy a present you think people would want that is within the budget. People then draw numbers to pick gifts, but now there is the option to open a present or steal something someone else has opened that you want. Again, the game is over once all the presents are open and everyone has a present. \n\nThe different between the two games is all down to tone and nature of the presents. A white elephant is supposed to be some garish, tacky, awful stuff that you are getting saddled with. All the stuff should be gag gifts. That’s the point. A dirty Santa is about seeing good gifts and stealing them off one another hoping for the one you want the most. The blanket sounds like a perfect white elephant item but I wouldn’t bring it to a dirty Santa.", "That sounds like just a plain old gift exchange.", "I woulda stole the shit out of that blanket and put it in another White Elephant.", "It often costs at least 20 bucks for a tin of cookies, and you can buy weird novelty cards for 20 bucks. The literal point of white elephant is for it not to be a well thought out gift that is actually worth something. No matter who you are, there is someone who would ultimately be content with some snacks to eat or a game of cards they can actually play, mixed in with some random stuff that’s just for the laughs. \n\nIf you’re playing white elephant because you want bang for your buck, you shouldn’t be playing white elephant. Was my point.", "I honestly think it’s more the fact that it’s directly making fun of the faith that they go to church for. OP said they don’t go regularly, but they do occasionally go. So he went into this knowing full well his family is in fact religious but just not super devout to the organized aspect of the religion. And seemed to think they would find it funny rather than offensive just because he likes making fun of the families religion. Seems like even just an ounce of common sense would have had him realizing that was a bad idea when you don’t know who in the family will be opening it.", "It really is a \"read the room\" type gift. It's just like any other joke, in some circles crass and tasteless jokes will kill, and in others you'll just get a lot of angry looks. I don't think OP is necessarily an asshole for this gift, but it just requires a little more forethought as to who exactly is participating in the white elephant gift exchange.", "Because, correct me if I’m wrong, a white elephant gift exchange is for tasteless and inappropriate gifts. If you’re going to be insulted about a tasteless and inappropriate gift at a white elephant gift exchange the you’re a self important asshole.", "Nothing at all!", "Why didn’t they just start re-gifting all the same stuff back? Did your relatives really want to keep those paintings and trophies that much? I would find it hilarious if I gave away, like, a dumb throw pillow and then saw it again the next year!", "I always thought White Elephant was where you bring something from your house you no longer want, but Dirty Santa is where you actually buy a gift. But I thought the “stealing” was part of both. \n\nI imagine every region has different names, rules, and definitions.", "In my opinion, Dirty Santa is the raunchier dirty version of white Elephant. You can do white Elephant at work, with family, and children. You stick to adult friend groups for dirty Santa.", "White elephant is supposed to be truly weird, useless stuff and everybody I know has playing cards coming out of their ears.\n\nhttps://en.m.wikipedia.org/wiki/White_elephant", "I have participated in more white elephants than I care to admit (because trying to do the math is making me feel very old lol) and I have literally **never** heard that white elephant is “for tasteless and inappropriate gifts” until this comment section.\n\nIt’s not for any particular kind of gift. Its a form of gift exchange that is for the particular group you’re participating with. If everyone there has a raunchy sense of humour, then raunchy gifts make sense. If everyone has a more PG sense of humour, then the PG gag gifts make sense. But if there is a big mix of people or if you don’t know everyone well enough to know if they’d be into raunchy gifts or gag gifts, then you should use some common sense and do the more generic gift baskets or food/treats or something relating to whatever has brought your group together. This is very very basic social skills; you need to cater these kinds of things to the actual people taking part in it, not just give people what *you* would want to receive.", "Nothing at all...", "Stupid sexy Jesus!", "Oh we did but there'd be like 30 just regular junk and 3-5 hilarious things each year.  the funny ones got tossed/donated eventually by someone.  People moved, had kids, remodel, basements flooded etc and didn't really want cart around \"your face in a mug\".", "I've done white elephant like that, but it's becoming less common. I think it's more fun, though, because you get really silly gifts.", "Exactly. Which is why it’s ridiculous to say “white elephant is not necessarily the same as dirty santa” because “dirty Santa” isn’t a highly specified game set in stone either. Plus I didn’t even mention it. BOTH of those things are just loose names for a conceptual game with lots of variations (both of which generally revolve around stealing) lmao.", "My friend group's white elephant started with themes like July in Christmas, Useless Kitchen Utensils, and then Thrift Store Finds. The thrift store one was such a hit, it's remained the theme for a few years now. There's a stealing element to ours, but most people are happy with their thrifty trash. Either way, I've heard of variations of this concept that are different across the board, so it's definitely regional, if not group specific.", "This is my understanding as well.", "You literally have different names for your family only. Nobody else does it like that lmao", "I never said they would make fun of them. Just that they wouldn't care. I didn't exactly make that stereotype up. Real people can be mad all they want. I just question the motive behind it.\n\nLike this person I'm responding to. They don't go to church every Sunday, they drink, smoke and a dildo was an acceptable gift. How would someone EVER guess THIS obviously joke picture was the line when it was about faith and decorum? I totally wouldn't! So at what point are you just looking to be offended?", "It’s offensive because it is making fun of a religious icon. They may have laughed at a vibrator and then thrown it away immediately after. They may even just find it funny because it’s a personal human thing but when you start *mocking* a person’s religion in a way that essentially denigrates their faith people have every right to be offended whether you believe it or not. \nThis is equivalent to the people who insist on having those draw Mohammed contests knowing full well that is a sin in the Islam religion and are shocked when Muslims show up angry. *Just don’t do it* You can be tacky without being offensive.", "But people are different! I know plenty of people who go to church every Sunday who would not be offended by this picture! This is why I brought up intent. Yeah of course it doesn't completely absolve every action in the world, but it doesn't in any way sound like OP was doing this purposefully and seemed to misunderstand that this wasn't anything goes. \n\nThere are religious people who would get offended by Harry Potter as a gift. You can act like that's a ridiculous line, but to some it's not. I would never in a million years bring any of this shit to my family's functions because they get pissed about everything. But I for sure know religious people who wouldn't mind. \n\nOP thought they were being funny. They didn't buy this for Aunt whoever to piss them off and wrap it up and film their terrible reaction. It was a joke that didn't land. Sometimes the overreaction is worse than the offense and this is one of those times in my opinion.", "It’s common sense that a white elephant gift exchange is for tasteless, terrible and inappropriate gifts. Your faith is your faith, even in the description of your get togethers, you would offend the absolute shit out of other Christians that don’t talk about sex, don’t drink and don’t smoke weed… if they raised a fuss and started going on about common sense then I bet you’d start to think they were full of shit and self important about it… but you?!?! You’re a ‘cool’ Christian, right? Not some self important prick that feels everyone should know your boundaries without communication… you’re just being an asshole. \n\n…these days… what a piece of work.", "I actually went looking and while there are a lot of verses on 'sexual immorality', there's none that specifically say masturbation. So I guess it depends on if someone counts masturbation as 'sexual immorality' or not.", "YTA. Its offensive and blasphemous.", "Jeezus. I'm an atheist and I think it's disgusting.", "YTA. Why celebrate the holiday of you intend to disparage the person it was created about.", "You're the asshole 100 percent. \n\nPersonally I can appreciate the artwork and creativity. It doesn't offend me. But you assumed that everyone else should view it the way you do. For Christians who take their faith seriously, this is offensive. You should have used common sense. I hope you have some in future.", "YTA\n\nNot a present that would go over well with everybody (even if they're not religious (and you said \"not hyper religious\" implying that they're kind of religious)) and don't get presents that are potentially offensive if you're not 100% certain that the person in question is cool with them.", "This is an appropriate gift for someone who would like the joke; a gag gift among friends. A white elephant goes to an unknown recipient, so this is in poor taste. \n\nYTA", "I think it’s funny but my mom would have not been amused. So it’s a “know your audience” moment. I did a work white elephant about 8 years ago and took a framed photo of my boss (AH) in a shirt that was WAAAAAYY too tight for him. 19/20 people said this is amazing and couldn’t stop laughing. One sour Sally said it wasn’t funny cause the shirt was in support of some charity and therefor I went over the line.  You can’t please em all.", "yta. The huge majority of people would not want that gift, it's unnecessarily provocative", "I’m a former Catholic and not particularly religious, but my roommate’s joke that she was going to get me a crucifix with Jason Momoa on it makes me so uncomfortable. Religious trauma is weird that way.", "Politics & religion has no place at a celebratory gathering. YTA", "YTA\n\nWhite elephant is a family-friendly fun Christmas game where gifts are not allowed to be sexy, NSFW, etc. Sexy Santa is a NSFW version where you are allowed and encouraged to bring sexy, NSFW, etc items. Even though this was for adults only it's not appropriate to bring a gift like that to a game like white elephant.", "That's Cards Against Humanity level irreverence, and I'm all for it!\n\nEdited to add: NTA", "NTA\n\nThat's awesome.", "NTA ppl are so offended over a stupid blanket LMAO it's not even that raunchy, I'd die laughing if I got something like this.", "That's funny as hell and we NEED to see the blanket", "You’re just the type of asshole the world needs. That is hilarious, and your family member is a prude. I would secretly buy them a present every year from now on, even if I did not draw their name. They showed weakness now it’s up to you to twist the knife. 😆", "NTA, if the joke wasn't to her taste, she could have said 'very funny' and let it go. She made it uncomfortable by making it a big deal. NTA", "NTA- I'm sitting here cracking up at that pic! Holy shit, that's funny! Also, Jesus is kinda hot actually. Damn.", "NTA. That gift was clever AF.", "I love you. NTA.", "Ummm NTA, if you don't like it don't use it...you missed out on a 20 dollar gift...it's not the end of the world...but also is there a link to purchase said blanket for um science reasons", "NTA. It is a white elephant. Just so happens the uptight person got the funny gift. Especially if you’re from a non-religious family.", "You could never be the asshole for this. You were spreading the light. \n\nNta", "Really depends on your family’s definition of “White Elephant”.  If it’s exchanging thoughtful, traditional, “nice” gifts, then YTA. Otherwise, you’re good.", "this is the funniest AITA i’ve ever seen", "What the heck is white elephant?", "i’m going to go with a soft YTA\n\nalthough i find this hilarious, it’s definitely not a universally funny thing. i’d need more context on the specific person receiving the gift to say for certain, but religion is a very sensitive topic. it doesn’t matter how often they go to church, if they believe in something wholeheartedly, and you are making fun of that specific thing they are so passionate about, it’s almost guaranteed they’ll be upset. even if you don’t agree with their beliefs, them getting upset is 100% valid. \n\nthat being said, since they didn’t appreciate the gift, i’ll gladly take it off your hands. i think this is a priceless gift and i would be honored to receive it.", "I mean this cost over 20$", "I think they have a right to be upset, but if you GENUINELY didn’t know it would upset them like that you’re NTA", "What is a white elephant? Never heard of it.", "I would say soft YTA but mostly just for the caption. That pushes it a little over the edge and brings in other kinks that could make some people uncomfortable even if they aren’t insulted by the image/for religious reasons. If this wasn’t a family gift exchange it probably wouldn’t be so cringe but like., did you have an actual step sibling there that could’ve ended up this gift? Kinda awkwarddddd. Personally if I got this at a white elephant party I wouldn’t mind (it is kind of funny!) because I’m not religious but I would’ve preferred it not have that caption on it.", "You deserve to get a cut of the profits off of this 10/10 advertisement.", "Jesus is too sexy in that pic for you to be an AH, NTA", "THAT IS AMAZING. You are a DELIGHT. \n\nNTA!", "Nta", "I'm not sure what to rate this. If the gifts sometimes get raunchy in a family gathering, I guess I can see how you thought this would be fine. But you had it custom printed and, hyper religious or not, I'd have checked first to see if the family member in question would have taken it in a humorous way. \nOk, going to go with soft YTA.", "NTA. This was the best gift, they're just boring", "NTA\nThat’s hilarious", "NTA. Someone else being offended isn’t your responsibility. It’s theirs. They could have just stfu. But that decided to make it a big deal.", "lolol NTA", "OP: Are you looking for new friends for next year’s White Elephant???\n\nI’d like to be on your list!!", "Haha, this is brilliant. NTA.", "Making fun of any religion isn't cool, absolutely YTA.", "First rule of comedy: know your audience. Also NTA, harmless fun.", "Soft YTA.\n\nRead your audience. Some folks would find this funny, some would find is extremely offensive. If someone is Christian, even if they don’t attend church often, I would stay on a cautious side and not do something like this.", "NTA. I’m not the least bit religious so I’m probably very biased to think this is insanely hilarious, and not mockery. but the jesus they portray today already looks nothing like the real guy, so if they aren’t offended by that then they shouldn’t be so offended by this. \n\np.s. i just asked my grandma, who IS religious and doesn’t love that I’m not, if she liked the blanket and she died laughing and said she wants one. so I’m more confident in saying you have at least one snowflake in your family now.", "Yta:. This is a perfect example of cultural appropriations. \nYou took an image that is held as devout and part of a religious beliefs and you belittled it.\n\nThis is no different than having someone dressed in an Indian headdress posing for a porno scene.  Or giving them a blanket of someone defecating on the Quran.", "NTA. It sounds like your family member was offended and tried to rope everyone into feeling the same way. I viewed the picture and I found it hilarious. I recently participated in a White Elephant exchange for the first time and I would have loved a goofy gift like that.", "YTA - Great job including religion-shaming, incest, parental sex abuse, and torture imagery in one item. I'm not religious *at all* and I think it's a horrible \"gift\".\n\nAnd yes, I enjoy Cards Against Humanity and still think this is an awful gift.", "I’m a very strong atheist with lots of resentment for Christianity specifically, as I grew up in it. Even I think this is inappropriate. Especially if your family are all believers, whether they attend church regularly or not.  I have strong opinions about Christianity, but I’m still respectful of the human beings who believe in it. It’s not hard.  YTA, not for bringing the gift necessarily as it seems you genuinely didn’t know it would insult anyone, but for your reaction after it did insult someone.", "I would kill for a blanket of sexy Jesus, NTA", "NTA. There are very few times id say some people need to take a joke. White elephant is literally the place for joke gifts. My family has been doing white elephant for decades and this jumbo pack of enemas has been going around each Christmas. Several joke gifts such as a nude poster of some guy, sex toys and things like adult diapers are involved also.", "YTA", "I mean, it is funny but maybe a bit much for a family game? Also like, is your family religious? I know that if I bring something like that I'll be disowned on the spot so....", "YTA. It doesn't matter if it's your religion or not but to a follower of that religion what you did would be considered blasphemous on a religious holiday. I'd understand any religious person being upset if you used a depiction of their god that way. \n\nOverall it sounds like you just weren't considerate of others at a gift exchange.", "YTA. You went out of your way to be offensive and you know it. You just expect to get accolades for it on here.", "NTA.\n\nNext time, do a Secret Santa if the adults aren’t into games/joking. For the White Elephant gift, I’d say that’s a good one.", " I would’ve fought for this white elephant gift. NTA", "NTA! BEST GIFT EVER!! 🤣😂🤣", "This is the perfect white elephant gift! Oh my God it's funny!! 😂😂😂😂😂", "YTA. This is appalling.", "In my opinion, a white elephant gift is only a asshole gift if no one wants to steal it, period. If even one person in the group saw the blanket and though “fuck that’s funny” then you’re NTA", "legitimately cackling, you’re fucking hilarious and i’d definitely steal that in a heartbeat. nta.", "YTA\nThis is extremely offensive and vulgar. It’s not just “tasteless” which white elephant gifts can sometimes be. Some people consider Jesus and Christianity as a huge part of their lives and identity. I don’t care if you’re Christian or not, giving a gift like that on a Christian-related holiday, even if you’re family is only slightly religious, is extremely disrespectful. (And yes, I realize it was a pagan holiday and a large portion of Americans just like Santa. But we all know that Christians consider this a religious holiday.) \n\nWould you do this to anyone who is Jewish, Muslim, etc on a day that they consider a sacred holiday? Again, I don’t care what you believe. Intentionally mocking a religious figurehead is so beyond the boundaries of something that is ok, 100% YTA", "NTA…you’re the best!", "Hey OP, I speak from experience when I say NTA despite how much you must feel like TA. I had a very similar situation. Apparently my dad can give away a tasteful nude of himself one year but I can't give a Chippendale calendar with his face superimposed over all the dancers the following year.", "YTA. That is so inappropriate on so many levels.  You should done a \"sex\" Bible...which just gives position, not actually Bible verses", "Y T A for not telling us how to find that blanket so we can buy one for ourselves\n\n\nHalf joke aside, that is absolutely hilarious. NTA, but I do hove to wonder how it will be topped next year", "Who's the white guy?", "Haha!  I think it’s funny af.  NTA", "NTA and i want to invite you to my next white elephant swap", "NTA", "NTA I'm dying. That's hilarious. It wouldn't go over well with my family but holy shit.\n\nAlso- sexy jesus looks so much like my brother in law 💀💀 the face and beard is a dead ringer", "NTA. This is hillarious.i love it. Also, from what little I k ow about early Xmas traditions, this is very much in line with traditional Xmas celebrations. Again, I love it", "Does failing to read the room make you and AH? I don’t know, maybe so if it’s your family. But it’s so hilarious that it’s worth it. I would invite you to my Xmas party for sure.", "As someone who was raised Southern Baptist I will say you're 1000% NTA. This is probably the first post on this sub I've seen that actually made me audibly laugh. \n\nBut I may be biased. Take my judgment with a heavy grain of kosher salt.", "I came here in the hopes of seeing a pic. I was not disappointed. NTA", "NTA, thats fucking cool", "NTA\n\n>The gifts sometimes get a bit raunchy too. Have been over the years…\n\nThat's all the context we need. NTA\n\nEveryone claiming that it mocks Christianity doesn't understand the definition of \"mock\". This joke doesn't belittle Christianity, it is referencing a joke through a Christian lens. Even if it did mock Christianity...that's often the point of a lot of white elephant presents, even in Christian households. \n\n>When a family member opened the sexy Jesus she proceeded to be very unhappy and go on a rant\n\nRanting in the middle of a time like this is the asshole move. Your family member is free to be offended and even express their distaste, but adults do that through conversation, not escalation.", "NTA. White elephant is supposed to be absurd and funny.", "NTA\n\nTactless, yes\nHilarious, also yes\nAsshole; no \n\nPoor taste, great execution", "for the love of god where can i buy this", "That's almost pornographic. I love it.", "This is the best blanket I have ever seen, for that alone NTA", "NTA\n\nI'm delighted, I love it", "NTA. But maybe read the room next time 🤣. Funny as hell", "Nta", "NTA. I heard even JC can take a joke", "Ha! I would LOVE this gift! Well done, NTA", "I could be biased because I **hate** white elephant parties but NTA. \n\nIt’s supposed to be something tacky and useless. This is hilarious and still useful. If you want to throw a random item party, you can’t be mad about the random item you end up with.", "NTA obviously", "I'll have it OP\n\nNTA", "OP can’t just tell us about this and not pay the pic tax!", "YTA that’s actually extremely offensive and the only reason you’re getting a pass on here is because Reddit thinks religion is a joke.", "I'm all for a crass white elephant gift, but that blanket is pretty creepy. I'm not into religious rituals at all, but I would have looked at OP like TF is wrong with you? 😂\n\nThat said, I'm all for a good wholesome vibrator battle royale!... I guess it's just knowing your audience.", "This is the way.  I think this is a ”know your audience” situation.\n\nI could 100% do this gift with MY friends.  They might even fight over it.  At the same time it might give my mother and aunt a heart attack. (And I DEFINITELY don’t want to explain the joke to them.). Meanwhile, at work? I would end up in a serious meeting with HR. And if you aren’t 100% CERTAIN of your audience’s reaction, leave religion out of it.", "The sub is great if you quickly need the opinion of a crowd of 6th graders", "Yeah, there’s nothing more I loathe than the people who go out of their way to be offensive, but then get MAD when people **are offended**\n\nLike, that was your goal, you child", "“Because I am offended by this gift, everyone who doesn’t agree is an asshole and I’m going to make a scene about it”", "Heck, there’s ‘jokey’ and then there’s this\n\nJokey is novelty gifts at a tourist trap type crap\n\nThis is ‘Ah crap, Cousin Josh is trying to be an quirky edgelord again’", "Agree. Making fun of someone’s religious beliefs is never funny. This seems like an out of place gift for a family event especially where one of the family members may be offended. Soft YTA.", "This isn't mocking anyone's religion by definition; that would involve belittling it. This is just a Christian joke.", "If you are so sure about your religious beliefs then it shouldn’t matter if someone makes fun of them. It should still be true to you and other opinions or jokes shouldn’t phase you. It’s more of a problem if you can’t laugh at something because it kind of is about you. People love to be offended because it gives them a position of superiority. “What they did was so over the line. I would never do that.” Everything is on the table folks and if you don’t like it I’m sure there is a boring table for you to sit at somewhere.\n\n*edit NTA", "Nothing. It's a fucking joke.", "Yeah I am so sick of this bs on reddit.", "That’s not religious nor is it anywhere close to that. Most religions went on crusades and committed genocide of indigenous peoples, Christianity/Catholics included. So yeah Christians can handle a little joke, don’t try to use this to be racist.", "Re: the blanket’s cost, a small one from Redbubble can be about that much.", "Hallelujah!", "OP did! Check the post edit", "It was called the Big Talker … 😂", "I'm sure the vibrator says that too!", "Now I know what I'm going to spend my day looking for!\n\nI know my husband said \"no more decorative pillows\" but CLEARLY there's an exception to be made for this!", "My cousin was once fighting for some cheap lingerie and his wife was getting embarrassed. Her looked at her and said, “we have the most kids of everyone here. Do you think they don’t know what’s going on?” That was the moment I realized sometimes you have to stop being serious and play along.", "No one who opens that “gift” should be expected to behave with any decorum at all. The person who gave it sure didn’t! Why is it always on the offended person to smile politely and pretend the offender isn’t being an asshole?\n\nYTA", "> they should still behave with a bit more decorum. \n\nWhen the gift has no decorum at all?", "Im undecided on this AITA but I want to reply to your comment to say that adult-only doesn't really mean all bets off, be offensive.", "Yup, this is the ‘this sub doesn’t reflect the real world’ again \n\nI’m not religious, but I find that just tasteless. There’s a reason CaH is marketed as a friends game, and not something you play with your extended family at thanksgiving \n\nEdgy humor like that is just so worn out and bad. Haha, incest joke\n\nLike, grow up, OOP", "This is the former.", "I've always played with steals for white elephant.", "…. Was it a blanket or a tea towel? Lol", "Sweet! Oops on my part. It’s been a long morning. Thanks so much for telling me!", "So now you know your boundaries. 🤣🤣", "Only for some", "I’ve seen that movie.", "Let’s make a deal. The general population will stop policing Christian’s reactions to their obsession with an imaginary dude in the sky, when Christian’s (generalizing of course) stop trying to police who people can love and marry? Fair enough?", "Idk, why should queer folks be nice about your faith when Christians use it as a justification to ostracize us, outlaw our rights to marriage, or kill us?\n\nLike.  You wanna talk about insults?  How about an asshole walking into a nightclub and shooting people because Paul said it was bad to be gay?", "Religion is a tool used for oppression. Freedom of religion also means freedom FROM religion. Someone made fun of your religion? Who the fuck cares. Stop telling people what they can and can’t say or do to your religion. That’s not how any of this works, at all. Ever. Freedom of speech means the freedom to criticize and even put down your religion.", "My MIL is Christian thinks that Harry Potter is an insult to her faith and \"witchcraft\". Same with women having short hair, women wearing pants, and women going to college. So if she goes to a white elephant exchange and is given like an SAT book or a pair of pants can she melt down too? I can't even imagine the crying that would happen if someone got her a harry potter book. Do we all need to spend time pandering to the professionally offended? \n\nJust take a deep breath. I once got a t-shirt that said \"pansexual pride\" with a pan on it, and I thought it was funny without having a meltdown over how it offended my sexuality. Why is it that everyone other than Christians need to \"get over\" straight up bigotry but you get to cry over a goofy towel?", "Then your just a religious crybaby and i wouldn't even care about your feelings or your imaginary friend feelings.", "Lol my extended family played CaH at a few holidays. One Thanksgiving, my extremely formal, Christian grandmother (in her 90s at that point) read the card \"Firing a a shotgun into the air while balls deep inside a hog\" as her selected winner with a completely straight face. It's one of my favorite memories.", "Very true. I’m sure there are some families where this would have been funny and they can probably play CaH too without any fuss but OP’s family is obviously not one of these.", "No, it’s disgusting…even without the Jesus aspect, stepfamily porn is already gross on its own.", "Yeah, I’ve only ever been part of white elephant gift exchanges where people bought real gifts they thought people would genuinely want. I guess it depends on the crowd.", "They’re not interchangeable names. Dirty Santa implies it will be raunchy for sure. Hence the name. \n\nWhite Elephant can be, but often isn’t. I’ve done them with family with children involved as well as at work. White Elephant is just about being stupid and funny, but doesn’t necessarily mean it’s raunchy.  \n\nEither way OP: NTA", "Like all humor", "Every white elephant I've been to has had actually desirable, tasteful, appropriate gifts. \n\nI think the term is used to mean gift exchange with steals. I know that in some circles the idea is you bring a gift you didn't want, but every one I've been to has had nice items, like Lego sets or nice throw blankets or nice candle sets etc.", "Yeah, truth be told the 2% were because we were all friends and thought it would be funny. Like I jokingly had people convinced I would buy an adult toy and packaged the legitimate gift I bought to look like it could be an adult toy before unwrapped. We got our laugh, but everyone left with something worthwhile.", "I literally said “novelty cards.” As in like, cards with naked old people or jokes or some shit on them.\n\nAlso, I read the WIKIPEDIA link you gave (eyeroll) as well and it’s just just “weird” or “useless,” but something you just don’t have space or room or need for. Like another set of fucking ridiculous playing cards everyone already has, or a giant tin of cookies at a holiday party already full of cookies. \n\nLike.. the point of this entire thread is that white elephant is an evolving game that’s slightly different depending on who is playing.\n\nYou’re being incredibly pedantic, and over what? My entire fucking point was that if you go out of your way to bring something everyone is going to want or that’s going to be be fought over, it defeats the purpose. \n\nI didn’t say that’s what OP was doing, just that they clearly spent more than was outlined just to make a statement, which I found to be pretty extra. \n\nOr would you disagree with that as well? 🙄", "Thanks for the advice. White elephants are for entertainment. Often times it’s tasteless and inappropriate gifts in my experience. It’s even defined that way through most of the sources I looked at to make sure I wasn’t a crazy person.\n\nCommon sense points to not ruining a gift exchange because you are extremely sensitive about your religion, or too self important to engage in good faith, without a single shred of communication.", "I had to look it up, the term derives from a king that would give a white elephant to people he didn’t like because they were expensive to maintain, impractical and burdensome. The exchanges are for entertainment, mostly.", "Okay, that's fair, I can see how things might get a bit stale after a while (and even keeping things for a year might be too much sometimes!).", "Gotta love that you got down voted because you don’t believe in the religious nonsense. But commenter over here all “MY FAITH!!!!” gets all the upvotes. It’s stupid.", "So you do a bunch of stuff against your religion but one blanket is way too far? Only allowed to mock your faith how you decided God won't mind?", "From the context, I assume you meant to say you would NOT get them a sexy picture of the Prophet Muhammad.?", "NTA, I would love this.", "NTA this is hilarious. Maybe the wrong time for it but 10/10.", "NTA, too many Christians think you have to consider them every time you do anything in your life. You don't.\n\n\nIf they didn't like your blanket, fuckem, they can enjoy receiving nothing.\n\n\nIf you're a curmudgeonly scrooge who can't appreciate someone's attempt at a joke, you should really be staying at home during the holidays.", "YTA this doesn't seem like a family type gift, especially if some of the members are religious (even if not \"super religious\")", "My friend was hosting a WE gift exchange party and when it was my turn, she whispered to me that I HAD to pick a certain gift and pointed out something long and thin in two pillowcases taped together. It was someone's old 4-foot-bong, beautiful hand-blown glass. They cleaned it out really well, even. I pantomimed taking a giant bong rip and everyone had a great laugh. But I am not much of a pot smoker anymore, so wasn't heartbroken when someone took it from me. From what I remember, the person who took it got into an argument with his girlfriend on the way home over the bong and they broke up not long afterwards. So it turns out that bong is cursed. I dodged a white elephant bullet.\n\nThis blanket rules, you're NTA. Everyone should be fighting over it.", "Yta I hate how everyone berates everyone when the insult any other religion that’s not Christian and then when it is Christian everyone is okay with it. These comments need to do better.", "NTA\n\n\nPlease I need to know where I can buy this.", "Yes you are the AH. It’s very distasteful and disrespectful to a whole group of people.", "This is beyond disrespectful. I’m amazed you can’t see that. YTA. You would never do that to another religion.", "YTA. Even people who are not religious can choose to be a little religious on the day that celebrating the birth of the Lord. Its pretty bad taste to mock peoples religion on their own religious holiday, regardless of YOUR interpretation of how good of a christian they are.\n\nLet me guess, you aren't showing up to a Ramadan party with a t-shirt of Muhammad with a bomb in his turban are you? Didn't think so.", "YTA - That’s a very offensive image whether your family is religious or not. Would you think it’s ok to buy an item mocking Islam or Judaism? I don’t understand why this would be different. Just keep religion out of it. There are plenty of over the top items that would be considered funny without bringing other peoples’ beliefs into the mix.", "I never comment on anything on Reddit but here I am to say..  well done. WELL GD DONE.", "LOL that’s amazing. NTA. comedic genius. sorry your family aren’t funny 😔😔", "YTA- tasteless gift which could be offensive even to those who aren’t super religious. I’m not Catholic, but I’d never gift a “sexy Pope.” I’m not Muslim, but I’d never gift a “sexy Muhammad.” You know Jesus is a sacred figure to many.", "You are hysterically funny.  NTA", "I gifted a crocheted penis once. It was stolen a lot. Very well loved. Haha", "NTA, Jesus would have approved.", "NTA LMFAO Come to my Christmas parties", "NTA. That’s just funny right there. 😆", "Okay, is it just me or does this Jesus look particularly whiter than usual?", "NTA unless you knew they would hate it. And I need two of those!! Where do I buy it?", "NTA", "NTA, please attach link where I can get $20 custom blanket. If you don’t attach link, YTA", "YTA. Know your audience. I think that this would make a lot of people feel uncomfortable. It would be better suited for a white elephant with friends who are all non-religious and who you know have this type of humor.", "\"THOU SHALT NOT COVET THY NEIGHBOR’S GOODS.\r\nThis one is just plain stupid. Coveting your neighbor's goods is what keeps the economy going: Your neighbor gets a vibrator that plays “O Come All Ye Faithful,” you want to get one, too. Coveting creates jobs. Leave it alone.\"\nGeorge Carlin, \"When will Jesus Bring the Pork Chops\"", "They wouldn’t even have to replace the prophet, Muslims consider Jesus to be a prophet too and this would never go down well . I couldn’t even imagine what the reactions would be to this level of disrespect.", "I agree. I am an atheist with a not religious family and I wouldn’t even wish to receive this.\n\n1. I am not a giggling teenager to find this funny\n\n2. I wouldn’t keep it around in case someone with more sensitive taste comes to visit. \n\nThis is clearly something made to be offensive and you need to be very sure before giving it as a gift", "I see people taking my religion in a humorous way in the regular, so... Yeah, I gotta disagree. There's no such specific persecution.", "Exactly!!! Black face and Hitler are two good examples. Sitting back and acting all innocent like, “It’s just a joke!” isn’t always going to cut it. Just because it’s intended to tasteless doesn’t mean *everyone* has to laugh. The OP read the room very badly and only has themselves to blame.", "I do not kink-shame.. I do Kink-ask-why", "Rock me Sexy Jesus", "I agree with the second part. My first thought was to post it to the queer kinky friends group chat.", "Oh good, I was looking for something to do at work today. I'm going to search for this pillow!\n\nEdit: well that took about 30 seconds 😂 Thanks look human!", "Definitely. I would have laughed a lot if I had gotten OP's gift. However, anyone in my boyfriend's family would have been super offended. You need to know your audience.", "> Making fun of someone’s religious beliefs is never funny. \n\nNo, it definitely is funny. Have you seen what Scientologists believe?", "I cant imagine myself in a scenario where someone in the party with me wasn't going to fight for that blanket", "I ran into this exact design years ago. It's lived in my mind rent-free ever since, and I know exactly where to find it: https://www.lookhuman.com/design/48274-floral-penis-pattern-blue/pillow14in-whi-one_size", "Check out Spoonflower website. You can print any design you upload there onto all different kinds of fabric or search for fabric designs by other people. Possibilities are endless, trust me 😉", "We do White Elephant with a friend group that is all couples, so the tradition has become for there to be a \"good\" gift and a gag gift from each couple, so that when all the stealing is done, your family is likely to head home with at least 1 good thing", "It doesn't matter what they believe, the ideal society, the perfect society, is one where people are free to believe what they want. Or we can all be at each others throats all time. You pick. Since you;re the atheists i'm sure you'll make the wise choice.", "High and mighty coming from someone supporting an institution that has literally policed everyone, other than white Cis straight men, for literal centuries. It’s time to sit back and learn that it’s not all about you and your hypocritical faith.", ">“allusions to incest porn at a family gathering”\n\n“allusions to incest porn featuring the central figure in the religion y'all participate in at a family gathering”", "Like, even a gift poking light fun at an aspect of a religion is one thing, but this is like, straight up sacrilegous lol. If OP's friend group were capital A atheists into edgy humor, this gift is pretty whatever, but for any group that is even casually religious, wtf did you think would happen?", "It’s both actually.  Things can be more than one thing.", "Sounds closer to Secret Santa to me.", "I made the mistake of reading this to my husband. He's now demanding that the most ridiculous pictures of himself be printed out and turned into pillows.", "Oh yeah, people should be free to believe what they want.\n\nThat doesn’t mean no one should make jokes about it.", "honestly thought white elephant was for weirdly expensive gifts.", "So the purpose is to offend, why isnt OP pleased he succeeded in the goal?", "Some of us queers *are* Christian and already have a complicated relationship with our faith. You don’t have to be nice about it, but that doesn’t mean we like that part of us attacked either.\n\nBasically, I really just mean to not be a dick to someone unless you want said someone to be a dick right back at you.", "Great, so this is an admission that you desire to use a religious holiday to attack the religion of the people who celebrate it. At least you are honest about it, unlike OP who is acting all \"oh innocent me!\". \n\n> How about an asshole walking into a nightclub and shooting people because Paul said it was bad to be gay?\n\nOrlando nightclub shooter was a Muslim.", "Or when christianity (or any religion) stays out of law in general.", "Freedom of religion also means that recipient of what (to her) was an inappropriate gift gets to *express her opinion* about that. This isn’t one-sided. Everyone gets to express their feelings. OP had the right to make fun of someone else’s religion, sure, but the recipient has a right to say they don’t like it. They’re not obligated to smile and pretend they like something when they don’t. Nobody is.", "[Not according to that scary evil tool wanna-be Pres Mike Pence: \"Well, the radical left believes that the freedom of religion is the freedom from religion. But it's nothing the American founders ever thought of or generations of Americans fought to defend. And the good news is, that after four years of the Trump-Pence administration, I'm confident that we have a pro-religious freedom majority on the Supreme Court of the United States.” Ugh.]", "Yeah, the incest thing really pushes it into bad taste", "Reddit's juvenile hatred of religion overrides its \"sensitivity\" about trauma triggers I guess.", "More like “community santa” lmao.", "Always heard of Secret Santa as everyone draws a name but no one knows who got their name and who the gift came from.", "Uh oh. Sorry about that 🤣 You never know tho!", "You're aware the Pulse shooting wasn't the only one to ever take place and they're probably referring to the one that took place in Colorado a month ago, right?", "Oh get over yourself and your theocratic pent-up hysteria.", "*nothing at all...*", "Haha it's totally fine. I'm used to how he is, so I REALLY should have expected this.", "Norms and terms and goals are what people make of them. The point is to abide by the rules set in the group you're playing with, not by tradition or what other people do. \n\nSome people do them for entertainment, for sure. I've always done them with friends or coworkers with a $40 spend limit, and people bring pretty safe and nice items. \n\nI'm aware that the original variation is not this, but it has been the norm of every group I've played with to bring things you think people would actually want, but that are not risky in any way. OP's gift would have been in extremely poor taste for the most recent white elephant I've participated in, while I've heard of other white elephants where it would be one of the premier gifts of the room. \n\nInternet strangers can't really judge whether the gift was appropriate without being part of the social group the OP was playing with and being there to witness all the other gifts.", "ehhhhh tbf there's another aspect here with the porn reference. like, just because stepparent/sibling porn is common doesn't mean people aren't going to react really badly to it, especially if they're unfamiliar with the fact that it's become a meme.", "Could be fun to use a few images of him he might not enjoy being emblazoned on a sofa throw pillow!"]}