{"id": 5644, "submission_id": "zv5qjq", "title": "AITA for “lying” about having a brother?", "selftext": "\nI (24F) have been dating Charlie for four months, and things have been going well. \n\nWhen we were first getting to know each other, I referred to “my brother”, Max. Now, technically, Max (38M) is not my brother. He started working for my dad 16 years ago and they became really close. Max doesn’t have a family, so my dad kind of included him in ours, and he’s remained close to my whole family, even since my parents’ divorce. He has also become a very good friend to me. Because of all the blurred lines, I just refer to him as my brother. The fact that we aren’t related never came up. \n\nEarlier today, Charlie dropped by my mum’s house to exchange Christmas presents. My mum invited him in for tea and he briefly met Max. Charlie commented on the surprise that Max was older than he thought and he didn’t realise there was such a big age gap between us and my mum laughed and said Max was obviously not her son. \n\nWhen he was leaving, Charlie said it was wrong of me to not tell him that Max isn’t my brother and he questioned why I was hiding it. I told him that I wasn’t hiding it, it’s just easier to explain Max’s relationship with my family that way than to go into the whole history. I’ve known him since I was little, he is family to me, why does it matter? He said he feels weird about it now and he isn’t sure what to think because I lied to him. I don’t really think it’s a big deal but his reaction is making me wonder if I’m the AH for not clarifying?", "created_utc": 1671999490, "permalink": "/r/AmItheAsshole/comments/zv5qjq/aita_for_lying_about_having_a_brother/", "score": 79, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole for not clarifying that Max and I aren’t related because it has made Charlie feel like I lied or wasn’t open with him\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: are you generally the type of person who doesn’t share intimate details easily? It doesn’t seem like a huge deal on the surface, but it raises other questions about your brother’s life that you may not feel comfortable going into yet if you are a more reserved person. Only asking because for me, four months is still early in a relationship but I know other people would feel differently.", "Sounds like he's made a big deal about nothing.\n\nFamily does not always equal blood related.\n\nNTA.", "NTA Some people don't understand or recognize the concept of chosen family. If they think relatives have to be by blood or marriage, that's their problem. My chosen brother died. Too many people tell me my prolonged grief isn't real because he wasn't really my brother. I refuse to care about their opinion. Max is your brother. Charlie is insensitive.", "Um, not an AH but it is weird. I have some family friends I call aunt and uncle, but I usually mention that we aren't actually related if I talk about them, certainly would mention with a partner.", "NTA. It doesn’t change anything and hes family, just not biological.\n\nHad the same situation with my aunt, my husband didn’t find out until 5 years later or so that she’s not my biological aunt. He shrugged it off because in terms of our relationship with her, nothing changed. I also didn’t bother to mention it because what is he supposed to do with that information?", "NTA. This is just one of those things some people don’t get but it’s totally normal to others. I refer to close friends kids that have known me their whole lives as my nephews and nieces. I have aunties and uncles who aren’t technically related but they’ve been chosen family for a long time. My roommate has a dad who is a close friend who’s like a dad and not blood. 😂I don’t think it’s a big deal or lying particularly to call people family that are chosen family v. Blood family. But there are other people who don’t do that and it’s nice to clarify for them so they don’t feel silly at family events.", "NTA. Could your bf possibly be more uptight and insecure?", "When you're explaining it to anyone new say \"this is my 'brother' (quotation marks) - unrelated but pretty much a brother anyways\" all explaining done, in under 3 seconds!", "He’s overreacting. NTA.", "NTA. Plenty of people refer to cousins and aunts/uncles when they aren’t related to them. Relationships aren’t all about blood.", "NTA. If he’s like family to you and you always refer to him as your brother then what’s the problem? You weren’t lying intentionally and it’s not like it actually matters whether he’s related to you by blood. I’d try to clarify this to Charlie and if he makes it a big deal even after you’ve explained your side of the story then that kinda seems like a red flag.", "NTA.\n\nI think it could possibly be a culture difference as well? My partner also refers to some people as his siblings when they are either cousins, close childhood friends, etc. It took me a while to piece together the family tree, but it's not like I'd ever get mad at him about it. \n\nI think he is more upset at his bruised ego for your mum saying he wasn't her son. That, or now he all of a sudden thinks you're banging your \"brother\"  If that's the case, y'all are only 4 months in and he knows where the door is. You don't need that childish crap.\n\nAlso, another cultural aspect, I was never allowed to call my siblings \"step\" or \"half\" - we were all siblings no matter what. There wasn't this \"hierarchy\". To everyone saying that OP is in the wrong for not disclosing these things, I think you need a reality check that families exist in all different ways, and to demand OP declare the hierarchy is just weird.", "NTA. \"He's not biologically related, but he is family and has been since my childhood. He's my brother.\"", "NTA\n\nWe have a similar situation in our family. I view the girl as my niece and my kids view her as a cousin and we don’t think anything of it. Others might question it once they know she was basically adopted by my brother and sister in law as a 19 year old and some even think it is strange. However that doesn’t mean we are AH’s for not explaining the whole situation, to us she is family. \n\nJust because your bf doesn’t quite get the situation that doesn’t mean you were trying to hide something.", "Soft YTA\n\nYou really should have explained that he wasn't actually your brother, just a very close family friend. I don't think it's a huge lie, because he clearly is treated like a brother (I had an \"uncle\" who wasn't really my uncle - my grandparents just took him in off the street when he was a kid and raised him as one of their own). But still should have been explained.", "NTA.  \nKeep your brother and leave AH Charlie behind.", "YTA. It would be one thing if this was a brand new relationship, but it’s been four months. There is no way this wouldn’t come up and be easy to specify at some point.\n\nI know this because my cousin came to live with us when I was young and we often refer to each other(my brother her and I) as siblings and my parents treat us as such- even today when we all are now married with kids of our own.\n\nBut when getting to know friends, there are ways where this detail can come up as you talk about childhood, family and experiences.\n\nIt’s super weird to be with someone for four months having an intimate relationship- not just friends- and that never coming up in conversation.\n\nEdited to add: all the comparisons made here in comments about cousins, aunts and uncles isn’t the same. Siblings typically share homes and are raised/living together at various points and is a different relationship than the others compared to. Having had direct experience with this, there are definitely ways in which this should have come up as you were both getting to know each other.", "NTA my beautiful brother passed away recently and I was always avoiding  having to explain the complexity of our relationship. I loved that guy like my brother, knew him since forever like my brother, it was wayyyy easier to say 'my brother ' than go into the finer details of why this person was important to me. He was my brother. Hold him tight op. NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI (24F) have been dating Charlie for four months, and things have been going well. \n\nWhen we were first getting to know each other, I referred to “my brother”, Max. Now, technically, Max (38M) is not my brother. He started working for my dad 16 years ago and they became really close. Max doesn’t have a family, so my dad kind of included him in ours, and he’s remained close to my whole family, even since my parents’ divorce. He has also become a very good friend to me. Because of all the blurred lines, I just refer to him as my brother. The fact that we aren’t related never came up. \n\nEarlier today, Charlie dropped by my mum’s house to exchange Christmas presents. My mum invited him in for tea and he briefly met Max. Charlie commented on the surprise that Max was older than he thought and he didn’t realise there was such a big age gap between us and my mum laughed and said Max was obviously not her son. \n\nWhen he was leaving, Charlie said it was wrong of me to not tell him that Max isn’t my brother and he questioned why I was hiding it. I told him that I wasn’t hiding it, it’s just easier to explain Max’s relationship with my family that way than to go into the whole history. I’ve known him since I was little, he is family to me, why does it matter? He said he feels weird about it now and he isn’t sure what to think because I lied to him. I don’t really think it’s a big deal but his reaction is making me wonder if I’m the AH for not clarifying?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I have many family friends who I refer to as aunt and uncle, even if they aren’t related to me by blood. I would never specify that they weren’t unless I was going into detail about how I know them. When I tell stories about them, I generally say “my aunt and uncles place” or “I’m watching my aunts cat.” I even refer to my brothers best friend as one of my brothers occasionally because they’ve known each other for so long we’re all practically siblings. Besides, it’s easier than trying to say “and also my family friend who we’ve known for many years and who has become a close part of a family.” That’s kind of a mouthful. \n\nIn four months of dating it might have come up, but it also might not be something you talk about often given that it sort of seems like Max’s story to tell (you say he didn’t have a family, part of the reason he’s become so close with yours). Charlie is insecure. I would give him a day and then have a conversation about it with him. Be aware of his attitude and how willing he is to acclimate to you having men in your life that aren’t him.", "NTA, we have so many chosen family in our family. my dads best friend is my 'uncle' but i call his daughter my 'sister' and her children are my nieces and nephews. while her other sister is my cousin.   \nMy brothers best friend (since they were very little) I call my brother and will introduce him as my brother when we are all out together.  its a laugh when people catch on, ill explain if I want  to in the moment. and if they don't want to understand it then that's a them problem.   \n\n\nYou don't owe anyone an explanation to your family unit. chosen family is the best!", "Errr not the arsehole. Max is your brother. Your family decided to unofficially adopt him and that's how your family define your relationship with him. Wasn't a lie", "NTA I have a deceased “aunt” and I always hate that I feel like I need to explain she isn’t actually my aunt but my moms friend I grew up with me whole life. To you he’s your brother and you’ve only been dating the guy 4 months he’s not at the all secrets revealed stage of the relationship.", "Light YTA \nYou view him as your brother and is part of your life but hiding that fact that he’s not blood is kind of weird it’s like lying that you don’t have a driver license or like not knowing how to riding a bike small irrelevant stuff but could be important to a future partner, also it’s serious enough we’re he exchanges gift with you at your family home, I also think your BF probably won’t think twice that you didn’t tell him it’s more like he felt dumb that he did know Max wasn’t your blood brother", "Soft yta, I mean, I get that sometimes is easier to explains things that way to everyone, people you know and not close to, but he is your partner, he is your boyfriend, he should know", "Well even if I had told Charlie that Max and I aren’t related I wouldn’t have told him details about Max’s personal life, that’s not my place at all. But generally I don’t talk much about my family, just because we’re all very private people.", "I actually find that odd but it might be a cultural/ family thing. I have an uncle who is not actually related to me ( no idea how he got into the family tbh). Only when I asked my mother why he looked so different from her and her siblings did I learn.  At no point in time have I ever given a biography when introducing him. No one in my family does. He is my mother’s brother and my uncle.", "Agree.  An odd thing not to mention.  That said I did know one friend (platonic though) for like a year before learning his \"sister\" was a close friend.  Tbf they are platonic also.", "I refer to my best friends grandparents as my own, we've known each other for years and I love them both especially grandpa. He's ex navy and always has a story to tell. \n\n\nI also do this with my step family, I say my step siblings are just my siblings cause no one needs to know the whole story.", "If he like this 4 months in with  something so innocuous,  I'll wager he's just getting started.", "Perfect. Maintains everyone's privacy while ensuring that SO has the facts. OP, NAH. Try to be empathetic to your bf. Your actions hurt him. Acknowledge and apologize. Ask him if he wants you to share your line of thinking, whether he's ready to hear it now, or would like to hear it later. \n\nAs many have pointed out, some of this boils down to cultural norms, which obviously differ. Your \"no big deal\" IS a big deal to your bf. Your idea of \"private information\" seems like what your bf would say should be common knowledge, or at least shared with the person who you choose to be intimate with. (All of this assuming that you have a healthy relationship and a good dude, of course.)", "They've been seeing each other 4 months. Max has been in her life since she was little. Essentially adopted into the family. Bio or not, she considers him her brother. It's not a lie. End of. No explanation required", "I'm struggling to understand why it even matters?\n\nThey consider each other siblings.\nYou considered your cousin a sibling.\n\nWhat kind of impact would that have on a relationship if your partner was to find out the actual logistics? \n\nHow is this such earth shattering news that OP is deemed an AH because at no time in the last 16 weeks did she roll out her family tree?", "I disagree, i have a sister who is a long term family friend (her dad is my uncle, but is not actually and is best friends with my dad, but her sister i call my cousin)  \nMy brothers best friend who I grew up with I call my brother and he calls me his sister and we introduce ourselves as that to people  \nI wasn't in the same household as them but they are as close to me as my real siblings and are treated like that.    \nits not weird and OP doesn't need to explain their relationship to anyone.", "NTA, I totally get that. If you consider him your brother than he is your brother, and how that relationship came to be isn’t the important part. It may help your boyfriend though if you make that clear- you weren’t purposefully concealing anything, you just have known him as your true brother since your were a child and never think about him as otherwise.", "See I was brought up with uncles and aunts who I knew weren't related to me. They didn't pretend they were family, they were just people we loved who we made family.", "Because this is a guy she is calling her bf. That’s why it matters. This is the sort of thing you would share as you are getting to really know each other and talk about your families. If it were just a friend and someone casually dating it doesn’t, but as someone who LIVES this scenario it definitely would be weird not to have disclosed as talking about families and things from your past.\n\nI have quite a few in my life who don’t have any clue my sister isn’t my birth sister, but people that are close that we talk about personal things, it definitely comes up when talking about childhood experiences, family members etc.\n\nIf she isn’t having deep conversations with a man she is calling her bf then maybe it wouldn’t, but that in and of itself would be weird.", "So your wife/husband/partner believe they are brothers/sister you were raised with and don’t know the real history?\n\nBelieve what YOU want but I think it’s weird to have someone you are building a relationship with- they are coming and staying overnight in your mothers home- and they don’t know your immediate family situation. These are the details you share when building this sort of relationship with people and no way in talking about childhoods, family traditions it doesn’t come up. Here he finds out directly from the mom right away.\n\nMost of my friends know my sister as my sister, but people involved intimately definitely know bc her birth mom is my aunt and alive and so is her dad. This sounds similar in your case where they have birth parents. Max doesn’t have a family, but I’m sharing about family things he wasn’t always there in the home for all of their things growing up- it was only when he started working for the dad that he became a part of the family- so I’m sharing details about life and childhood this would have come up at some point.\n\nI would find it weird to be taken to my partners family home having talked about our family members and then learn this from the mom as though it’s no big deal. By not sharing it means either she didn’t trust him to share or just didn’t and I would question why.\n\nYou are entitled to your own opinion, but I’m entitled to mine and I GREW UP with the one that is my sister- not just someone close to me that I choose to call a sister, but someone that lived in my home and shared my parents and brother with me, and whom I talk to almost every day, and I feel this way. Those close to me that I share intimate details with do know the truth bc it comes up naturally in talking about life experiences, relatives, etc. \n\nShe isn’t talking about a random friend but a man she is serious enough with to bring home overnight for the holidays!!!"]}