{"id": 5665, "submission_id": "zvhosx", "title": "AITA for agreeing with my family’s unhappiness about my cousins pregnancy?", "selftext": "My (31f) younger cousin (28f) recently found out she is pregnant. She is really excited. But…she found out she is having triplets… the dad (45m) is a real piece of work and won’t be in the picture (and can’t offer financial support), she doesn’t make very much money and she has no savings. I myself have 2 kids and even with the financial and emotional support of my partner it can be very stressful.\n\nOver the past few weeks I’ve gently tried to tell her that it may not be green pastures ahead. She doesn’t even have a functional car right now. It’s like her head is stuck in the sand and she’s only talking about how amazing it will be, how blessed she is, how it’s a miracle, how she’ll just “figure it out.”\n\nOn Christmas Eve she surprised the rest of the family with the news after doing a big surprise scavenger hunt that led to 3 onesies.  Her mom already knew but told grandparents, cousins, aunts, uncles, etc. She didn’t get the reaction she was hoping for. Some people told her she should consider her options like adoption or abortion (even though some are very conservative and pro life), some talked to her about how hard this will be, asked about how she will afford this, wanted to know what support the dad would be giving, etc. It was not very celebratory. I could tell she was upset and she left early.\n\nI went to talk to her this morning in her (studio) apartment. I told her I was sorry for everyone’s reaction but that I could see where the family was coming from and that they just wanted the best for her and were concerned. I asked her what she expected the reaction to be and she told me she thought everyone would rally together to help her now and to offer a bunch of help once the babies arrived. She expected financial support too. I told her that she can’t rely on others like that and she will likely have to figure a lot of this out on her own if she goes through with it.\n\nShe told me that I’m horrible, that our family is terrible and that we all deserve each other and that unless she gets our support she’ll cut us all out. Then she told me to leave.\n\nIn some ways I think it is a reality check, but the more I think about it, I also know how overwhelming it is to be pregnant and I am sorry that she didn’t get any happy reactions or offers of support. Especially because in the past, other family members have gotten very happy family reactions when sharing their pregnancies. AITA for agreeing with the rest of our family?", "created_utc": 1672039194, "permalink": "/r/AmItheAsshole/comments/zvhosx/aita_for_agreeing_with_my_familys_unhappiness/", "score": 406, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for agreeing with my unsupportive family members reaction when my cousin who is having triplets needs support and wanted a happy reaction from everyone?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.   This poor girl is delusional and seems to make a lot of bad choices.  The family members are being realistic and practical.  They don't want to finance this girl's bad choices, either.  How incredibly sad for her.", "NAH but it’s going to be a rocky road ahead for her and her brood. I wish her all the best.", "NTA, it sounds like you were gentle with it by going over to her place and doing it away from others. you could’ve been more excited but ultimately it sounds like she needed a reality check.", "NTA.  She says she will go NC but I promise you she will remember everyone's phone number when she needs financial assistance.\n\nYou did the right thing by talking to her privately and gently about the realities.  If she keeps the babies then she will find that out quickly enough.", "NTA\n\nI really feel for her, some of those reactions were cruel and some best left for another time. \n\nI feel for those babies more. \n\nI'm not sure how she expects to get support by cutting everyone out. I hope she realizes, and works to get as much support as possible.", "NTA - but your cousin in going to get a hell of a reality check. Since she’s having triplets, she is basically guaranteed to have her children in the NICU due to prematurity.  She’d be incredibly lucky if this didn’t happen.  Caring for 3 newborns is going to take more than one person, and it doesn’t sound like she understands this. She can’t just assume family is going to financially support her and be her full time Nannies. That isn’t realistic.  Her life is about to get real hard.", "NTA, reading your comments, I think her expectations of the family are unrealistic. She needs to come down to earth, her head is in the clouds. Yes, we’re happy she’s having a baby, but we’re unhappy that she will have 3 with very little support. As you have explained your family is not well off and everyone has jobs and families, giving her maximum support, as she expects, will be impossible.", "NTA\n\nSome people are not ready to be parents and she seems like she's one of them, especially with triplets and no father in the picture. I feel bad for those babies once they come into this world because they're going to go through stuff that's for sure.", "NTA.  Just trying to bring her back to reality in her studio apartment.  She is trying to think of ways to get by, and it is easier to talk oneself into believing everyone in the family will participate in the raising of triplets.  She is kidding herself right now and living in a fantasy world.  She lashed out when you popped the fantasy bubble.  The more she thinks about it, the more she will realize you are correct.  That doesn't mean she'll forgive you, though.", "Nta she needed a head check that these are her babies her responsiblity and no one elses", "NTA\n\nIt is fair to expect support from the family, but it will be minor. She will be by herself most of the time, cause other people have their own lives, kids, etc.\n\nYou are being realistic.\n\nAlso, it sounds like a bad choice (having 3 kids from a deadbeat is a bad choice by default), and I'm not a fan of supporting other people's bad choices.", "NTA. Having one baby when you don’t have a good financial foothold is a challenge. Three babies?!?  God forbid one of them has health issues. She is going to have to grow up very quickly. Could anyone in the family offer help with a resume update so she can find a better employment situation before the babies arrive?", "NTA and I think your family should all think about this and draw their lines in the sand now. And point blank tell her all the ways they *won't* be contributing. She needs to know upfront Mom doesn't have any extra cash to spare, Dad doesn't have a spare bedroom, sister's too busy to help babysit, Grandpa's too ill to handle little ones running around. You are maxed out with your own life and won't come running when she is overwhelmed.\n\nAll pregnancies are not blessings. Remember the recent vid of the grandma finding out her irresponsible kid is having a third child? Grandma knew she'd be expected to handle it when they couldn't handle the kids they already had. But yay every child is a blessing, right? Sometimes kids are a.burden and an imposition on others - even if you love them. Hell the love itself is sometimes a burden. That poor grandma had no say of course. She's just expected to sacrifice even more of her life. Cousin needs to know the limits of other people helping.", "NTA for agreeing. I’d say if you care enough about your younger cousin, it’s worth trying to help her through this even if she’s pushing you all away. I agree that dumping money in her bank account might not be the way to go about it, but perhaps you and other empathetic family members can find other ways to help her; fill her fridge every now and then, run some errands, check in on her and make sure she has what she needs, help her help herself by talking her through the short-term and long-term living/work/child care plan, etc… I have to assume that the pregnancy is taking a toll on her emotionally, especially coupled with what she’s recently went through with the dad, so she’ll need the support even if she’s incapable of expressing that right now. Good luck to you all, OP, I wish you the best.", "NTA. Being realistic doesnt mean you wont support. However kids are expensive. When you factor in her being single, and the father not contributing to their upkeep, its quite rich to expect the rest of the family to contribute financially. \n\nIf she chooses to cut you out, so be it. Its her loss, not yours.", "NTA.  If a woman cannot provide a good life for children- SHE SHOULDN'T HAVE THEM!  To make children suffer merely because the prospect sounds cute is ridiculous. Good, you guys letting her know at least removed some of the fog surrounding her brain.", "NTA \n\nThis story is crazy lol, first 45???? \n\nHow are you 45 and a deadbeat? Sad times. \n\nIf she can’t even take care of herself, what makes her think she’d be able to handle 3 babies? One baby is a lot so i know that 3 babies at the same time is even more. \n\nKids are expensive. This is a wake up call for her i hope.\n\nYou shouldn’t have unprotected sex with someone you wouldn’t have children with. And even if you’re with someone, as a pregnant woman you should also be prepared to be a single mother. just in case something happens. \n\nThis question is a common conversation topic on twitter “should poor people have children?”\n\nI said no, as someone that grew up poor i really hated it and it traumatized me. Children deserve better", "NTA", "ESH. You don't ever tell someone to get an abortion or to adopt their children out. That is a very personal decision. She absolutely should not expect financial support from the family, but some emotional support might be nice. But she will clearly not be getting either.", "AESH \n\nOkay, you’re NTA, but… your family members who hold pro life views can’t put their money where their mouth is and help a family member who is excited and wants to keep her babies? \n\nYour cousin is very much YTA for assuming everyone will be helping her do it alone as a single parent, but she probably developed that expectation from hearing other family members talk about how abortion is not an option ever. \n\nAnd why can’t the babies’ father contribute something? Is there a good reason he can’t purchase off an Amazon wishlist every month? \n\nWhat your cousin needs is help identifying resources or building a plan on how this can work. How/when she can sign up the babies for Medicaid? Does she qualify for assistance? Can she trade child care hours with someone so they can both work? How can she make some extra money?", "ESH - ooh boy was I torn on this one... If it was just how the family reacted and not what happened when you went over, yeah the family and you are the arses. Even in the worst of circumstances, if someone is trying to share their joy with you, you don't kick them down. Particularly a pregnant woman, as pregnancy hormones can pull one back and forth between dark and light places mentally. You be happy in the moment and then have a sit down to help her figure it out.\n\nBut expecting family to help financially? Unless there has been help financially with other members of the family, that rides the line between assholery/naivety.", "You all sound nasty. \n\nHer head will be all over the place right now. It isn't the right time to reinforce the fears she is trying to push to the back of her mind.", "YTA. Massive, massive AH. It is not your place, nor anyone else's, to tell her what to do with her babies. You all should be supportive in whatever way you can. How dare you suggest abortion or adoption. I'd cut you all out too.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (31f) younger cousin (28f) recently found out she is pregnant. She is really excited. But…she found out she is having triplets… the dad (45m) is a real piece of work and won’t be in the picture (and can’t offer financial support), she doesn’t make very much money and she has no savings. I myself have 2 kids and even with the financial and emotional support of my partner it can be very stressful.\n\nOver the past few weeks I’ve gently tried to tell her that it may not be green pastures ahead. She doesn’t even have a functional car right now. It’s like her head is stuck in the sand and she’s only talking about how amazing it will be, how blessed she is, how it’s a miracle, how she’ll just “figure it out.”\n\nOn Christmas Eve she surprised the rest of the family with the news after doing a big surprise scavenger hunt that led to 3 onesies.  Her mom already knew but told grandparents, cousins, aunts, uncles, etc. She didn’t get the reaction she was hoping for. Some people told her she should consider her options like adoption or abortion (even though some are very conservative and pro life), some talked to her about how hard this will be, asked about how she will afford this, wanted to know what support the dad would be giving, etc. It was not very celebratory. I could tell she was upset and she left early.\n\nI went to talk to her this morning in her (studio) apartment. I told her I was sorry for everyone’s reaction but that I could see where the family was coming from and that they just wanted the best for her and were concerned. I asked her what she expected the reaction to be and she told me she thought everyone would rally together to help her now and to offer a bunch of help once the babies arrived. She expected financial support too. I told her that she can’t rely on others like that and she will likely have to figure a lot of this out on her own if she goes through with it.\n\nShe told me that I’m horrible, that our family is terrible and that we all deserve each other and that unless she gets our support she’ll cut us all out. Then she told me to leave.\n\nIn some ways I think it is a reality check, but the more I think about it, I also know how overwhelming it is to be pregnant and I am sorry that she didn’t get any happy reactions or offers of support. Especially because in the past, other family members have gotten very happy family reactions when sharing their pregnancies. AITA for agreeing with the rest of our family?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - but! I am a fan of honesty and therefore I say NTA but there is a smart phrase from east. Don’t take somebodies hope it might be the last thing they have.", "NTA. Sometimes people need a reality check as hard as it may be for them to hear. As you said to her you can't rely on the generosity of strangers, moreso now when times are tough for a lot of people.", "This is a very sad situation. Single mom, Studio apartment, no car, no financial support, no emotional support, who knows how pregnancy and birthing will go, and then there will be 3 babies. 3 feedings, 3 diaper changes, 3 sleep schedules…one newborn is difficult even with money, time, and support. But three? I truly hope she is able to see the depths of this situation and not just think “it’ll all work out somehow” because that’s an immature and even dangerous line of thinking.\n\nNTA, but please take care of yourself in this situation as well. It truly takes a village but not at the expense of your own well being.", "NTA. She sounds mentally 16, not 28. I get pissed off when women expect their parents and extended family to magically provide for the outcome of their own poor thought processes (btw, I’m a woman, mother and self-made professional). I waited until I was financially secure to have a child, and was very careful with birth control before then.\n\nI feel very sorry for her unborn kids, and the family members she’s about to dump them on. At least you tried to wake her up.", "ESH. I struggle with your family telling her to put children up adoption or abortion. When it’s very obvious that she wants to keep the children. \n\nIn my family my step daughter is about to have twins at 19 with a dead beat who is four years younger than me, with multiple baby mamas. The first question her parents and I asked is what is your plan. She shared her plan, & a lot of it including us helping her. We’ve told her what we are willing to do & what we aren’t willing to do. She’s unhappy with us. I think your approach was appropriate. I think your cousin in being unrealistic about the expectations and is in for rude awakening. I do think your family is in no win situation. \n\nIf you live in USA. I would suggest finding out about section 8 housing or income based housing. She needs to check into food stamps. Her children will qualify for WIC program. If she doesn’t have insurance, she needs to do Medicaid/ Medicare program. Her children will be delivered early and they’ll qualify for early childhood programs, where they can  offer speech, OT, PT and developmental therapy all is free until age 3 for children. Will it be difficult yes, but she needs to start researching local government programs that help people in this situation. She should see if she’ll qualify for daycare vouchers & she uses the time to better herself like going back to school so she can get a better paying job or just go to the work. She may need to make the hard choice to move away from your family, so can get a better job.", "Have fun raising those 3. friend had become father with triplets in a stable d\nRelationship with quiet a lot of support. \n\nThey are really struggling. Like really. NTA", "It’s weird because she has a college degree, has always seemed level headed and logical. I’m not sure, maybe it’s the hormones, but ever since she’s gotten pregnant she has lost her logic. I think 1 baby at a time is hard….I can’t even imagine 3…", "Well, they’re 50% the bio father’s responsibility, whether he financially can or not. Takes two to Tango, and it’s not fair to just blame the mother.", "Thank you. I would say that all of the support you mention is definitely what my family would do and has done in the past for others in the family. We all love each other and are very close. But, she said some things like “we will need to make a schedule of babysitters!” and I think that rubbed some people the wrong way, like she’s expecting a lot more support than most can give (full time jobs, kids of their own, disabilities, etc). I personally work full time and barely have enough time with my own kids.\n\nI would be devastated if she cut us all out. It’s not what we want…or at least not what I would ever want. I also want her to come down to earth and see how hard this will be, but of course I want to be there for her emotionally.", "I agree with that and I was very disappointed in my uncle and other cousin who suggested that. I don’t support them saying that to her and I told my cousin that today.\n\nEdit: to clarify I’m pro choice myself. Of course my uncle that suggested abortion has always been vocally anti abortion…..but my cousin and I have always agreed that he’s a total pig", "Thanks for that comment. As if it is so easy to give children away and to abort!!! Abortion would maybe be something I would consider for me in some situations. But give my children away??? Never.\n\nI think in this situation: the whole system sucks. In my living country (Germany) as well as in my birth country (France) she would get financial help from the government as well as helpers several hours a day paid from the wealth care. It would be very possible (if not easy) to get child-daycare very soon for very low costs. It would still be very difficult for her, but not impossible.", "> Okay, you’re NTA, but… your family members who hold pro life views can’t put their money where their mouth is and help a family member who is excited and wants to keep her babies?\n\nBeing pro-life does not mean being rich. Fuck, most I've met were rather poor.", "There’s never been financial support for others…or a lot to give. Our family isn’t dirt poor but there’s not a lot to spare. Her mom lives with our grandparents because she is severely overweight and disabled. For what it’s worth her mom is excited but given her circumstances I don’t think she can help much.\n\nI feel bad because she got a lot of these reactions all at once too. I love my cousin and I want to support her but she doesn’t seem very realistic about the support that would be available in the best of circumstances.", "No she needs a reality check she has no time to push those fears to the back three babies are coming in less then nine months even sooner with triplets who will probably have nicu time time for the expectent mother to think of every senario and how she will afford it no time to coddle her", "I understand where you’re coming from. I think everyone was just surprised and concerned, especially because of the triplets aspect. I agree that it would have been nice if she had gotten some congratulations instead of concern. I did congratulate her when she found out she was pregnant, but that’s before she knew it was triplets.", "Yet the mom expect the family to help finacially support her so clearly they were right to mention options as the mom even admits she can't care for the babies", "She lost the logic dating someone almost 20 years older than her. Ew.", ">But, she said some things like “we will need to make a schedule of babysitters!”\n\nOh no, that's not good. Help is something extra, something you are grateful for, maybe expect if it has been given to others in the same situation, but not something you can require. And definitely not something you can build your life on. She realizes it won't only be though with the babies, but also with toddlers, kids and teenagers?", "Of course, and that’s entirely understandable. Without knowing her, I would hope that if she wasn’t pregnant and recently separated, she might be slightly more open to those sorts of conversations. As it is, though, it sounds like there is a lot of bedrock to chip through before anything will get through. Of course that requires love, patience, and, possibly in shortest supply, time. Perhaps you & the family can talk about options there - who has free time to help, what that help would look like, etc…", "What about helping her apply for state assistance? I understand if you all don't have the money to support her. But there are programs that can help. WIC, medicaid (or medicare, I can't ever remember the difference) things like that.", "No, there is a time a place.\n\nToo many of you are high on the smell of your own farts. Make small alterations to story so that it is something you have done and the responses will change to the other side being the ass holes for berating you over something you're kicking yourself over.\n\nShe is pregnant at the moment. It will be a frightening experience and her hormones will be all over the place. If you love and care for someone, you do not look to add to their concerns when what they need is support and reassurance.", "Has the family offered financial support to other members when they've had babies? If so, that's not a stretch for her to think they would do the same. If they haven't, they can always help her by suggesting state programs like WIC that would help. Suggesting she abort the babies or put them up for adoption is cruel if she's excited about being a mom. If SHE wanted to abort or put up for adoption, she would and that's her choice. I just think it's heartbreaking that someone would suggest that to a pregnant woman who wants to keep her children.", "I talked to her about this when she told me that it was triplets since the dad won’t be involved. She said her doctor is setting her up with a hospital social worker to help her apply for these things. But even with that assistance I think it will be very difficult financially. Our area seems to be getting more expensive by the day.", "Its not about her anymore its about three innocent babies who she  already admitted she in no way can care for and who she plans to mootch off others to just servive", "In a comment OP said the family hasn't financially supported others, and that while they aren't poor, there isn't much money to spare.", "Even if they haad heloed others in the past that in no way entitles her to help and certainly not help with three newborns.she wants to raise three newborns fine but she made her bed now she can lie in it all alone with no partner and three babies.", "I understand it will be difficult. Raising one baby can be hard, let alone 3. I just think you all could've at least been emotionally supportive when she made her announcement. I feel sorry for her. It sounds like she's in a rough spot since the babies' father isn't in the picture, she's hormonal from being pregnant, and then it seems like most of the family came down pretty hard on her. By the way, she can still take the father to court for child support. He may not be able to pay much, but he shouldn't be able to walk away from this either.", "She needs to take the father to court to garnish wages, set child support, etc. Just because he doesn’t have a job/money now doesn’t mean he won’t next month, next year, etc. Sounds like she’s as foolish about not demanding his support as she is about demanding everyone in her family support her.", "Cut the crap.\n\nThere is always an excuse to show callousness. If you're thinking about the 3 innocent babies, you wouldn't have a hard time understanding why it isn't helpful to add to the stress of their hormonal and already stressed out mother.\n\nThis isn't about the kids. It is about people not wanting to pump the brakes on saying what's really on their mind.", "He is more than $50k behind in child support for his other children already. He works cash jobs and lives with friends in a free room. Unfortunately he’s an old hat at escaping child responsibility…..but he is a very smooth talker and attractive, so in a lot of ways I don’t blame my cousin for falling for him at the time. Their relationship was very short lived. Like I said, he’s a real piece of work.", "You think she is stressed now? You think she is having a hard time? Of course! But this is a walk in a park compared to taking care of three babies at the same time. It's not at all unrealistic to say she might not be able to sleep for days, because newborns tend to wake up every few hours, stay awake an hour at the time and nap 45 mins at a time. If babies are not syncronized sleepers, which I doubt, one of them will be awake and crying all the time. I honestly think it might be impossible to do this by herself.\n\nAnd yes it is about the kids! People are telling her this because she needs to know! She needs to understand what she's in for.", "The mom brought the stress on her self by getting pregnant by someone who wasn't going to stick around and then expecting the family to clean up her mess they were 100% justified in mentioning sheborobably shouldn't keep the babies", "Oh jeez. I'm sorry she got mixed up with a man like that. What a jerk. I really do feel sorry for her.", "Then, she is up all night and needs to go to work all day. After dropping 3 babies off at daycare that will probably cost more than her salary. Although, that will even be a problem because she has no car.", "All I'm smelling is the BS people say to justify their callousness. \n\nThis \"I don't have to show empathy because they brought it on themselves\" is a very Conservative approach. It pops up any time someone wants to wiggle their way out of showing basic decency.", "And even if she had a car, she'd probably need an upgrade, becuse three seats don't fit in a normal car.\n\nEdit: and how would she even carry all three babies to the car by herself? Unless she lives in a house and can park her car right outside...", "Yet you don't think the mom to be should show basic decency and figure out her own issues instead of expecting her family to do it for her", "They do not. My friend and his wife needed to upgrade their car before their triplets arrived. 3 car seats do not fit across in a sedan.", "Again, all I'm seeing is more BS, rubbish that comes from conservatives looking to excuse their callousness. \n\nAt no point did I express the beliefs you're accusing me of. It is actually contradicted by my claim that there is a time a place for these conversations, which  indicates the belief that tough love will be required at some stage. That stage isn't whilst she is hormonal and experiencing the fears anyone pregnant for the first time would have.", "You are clearly unhinged time for your meds and to go to sleep", "NTA. Babies are hard and she apparently knew the dad was a piece of work. It is not anyone else’s responsibility to raise or contribute anything to raise her babies. Also, if she’s cutting off any family members who don’t support her, she’s going to be in for a rude awakening.", "NTA\n\nI think your family were kind in giving your cousin a huge reality check now.  She’s very entitled and misguided in thinking her family will bankroll her poor life choices. \n\nShe needs to take a long hard look at how she will raise and support not just 1 but 3 babies.", "NTA, I would say most peoples there were not AH besides some family members, especially like the one talking about abortion when they're pro life, first talking about abortion if you're not the partner is weird imo and even then it's ofc the woman choice, but also the hypocrisy piss me off, ofc they're pro life except when one of their family member is in a difficult situation", "NTA. Sometimes a reality check is needed, even if whomever you tell it to doesn’t like the answer.", "NTA. Triplet pregnancies are incredibly high risk for both mum and the babies with a high chance of premature birth and its associated complications. There is every chance these babies will have ongoing health issues and a prolonged nicu stay..... I really feel for your cousin as it seems she's somewhere between a rock and a hard place but in all honesty you and your family are right to be worried.... just treat her with gentleness and compassion but don't shy away from the reality of her situation. Particularly around how much help she can actually expect.", "NTA based on her saying she basically thought the family would help her a lot more than family’s really do normally. She wanted financial support.\n\nHowever it is her body and her choice. You can say we will always support you emotionally but not financially as we are not in the position to do that.", "Having multiples and particularly triplets is so very complicated- there is a LOT to consider, plan for, juggle, and prepare for- that’s WITH a fully engaged spouse/partner/co-parent- the complications that come with a multiple pregnancy are astronomical - and that’s before the babies arrive. 3 cribs, stroller for multiples, 3 car seats, three sets of everything- 3 x the diapers, formula, bottles, baby baths, supplies.  3 x the expenses, 3x the round the clock feeding schedules. \nShe isn’t thinking any of this through logically- and expecting others to just rally around her, financially contribute to support her and these babies is unreasonable- and illogical. \nPeople may offer to come help for a few hours initially but that will fade- people have their own lives and families to provide and care for. \nHeaven forbid these babies come early- that brings whole new sets of complications/potential problems. \nShe is being really short sighted and is in for a very rude awakening.", "Well....the bottom line is: she can't afford the babies and she will not be receving help...so the message from everyone was: how are you going to solve this? She is not preparing and taking responsibility, she is trying to get funding through family. NTA", "NTA, what she seems to ignore is that its easy to get a happy reaction for news like this if the ppl know their support/help will only be needed from time to time - thats fine, we all need a little help from our friends/family sometimes. BUT if such news are presented to you and you know/can savely assume they will rely on your help, its not so exiting anymore and as a relative you may better get out before you are on the hook for the next 18 yrs, lol.  \n\nOc your cousin can ignore that and i'm sure there will be family members supporting her when the babies are here, but expecting an exited reaction to the news \"hey you all, you will support 3 kids for the next 18 yrs bc i want them but can't afford them so better set up some college funds for them\" was highly delusional.", "NTA sometimes people find the harsh truth upsetting, but she is going to struggle it will be expensive and exhausting", "NTA. 28 and 45? can someone say CREEPER? he absolutely can and will provide child support if the courts force him! your cousin should abort/adopt out. there's no fuckin way she's gonna be able to provide a good life for those kids even with government assistance. her only bet at that point is to try and get someone to pick up the slack that daddy dearest didnt do.", "NTA. It’s unfortunate for her that her circumstances are difficult but it’s hard enough figuring things out with one baby. Three would be overwhelming.", "Um what? Cruel? You are going to have to explain that one.  \nSounds like she was expecting everyone to rally around her and pick up her slack, essentially to deal with her poor life choices. That's not their job.  \nAnd I do wonder where she was when they were having their babies, was she helping out? I'm suspicious not. Or she wouldn't be so unrealistic in her expectations, or the reality of raising kids.  \nDefinitely NTA.", "If she got in the wrong places on the internet or socially with other people who obsess about nothing being more important than birthing every child conceived, she might be riding the false prophecy that by giving birth, everything else will magically resolve. All it takes is one toe dipped in this realm of magical thinking to focus on how wondrous it is that she naturally conceived triplets and how she has so many close family members who recently had children to imagine herself being blessed with abundance and understanding. \n\nMy cousin found herself pregnant with a casual fling, but she is a carrier of a severe recessive gene disorder and she had known most of her life that genetic testing was absolutely essential to not pass on this disorder. Of course the guy she was dating had not been tested. But, they supposedly were dogged about protection and somehow this miracle happened. So she refused prenatal testing for this disorder. You can imagine where this goes, she sure does give birth to a baby who is suffering from the disorder and the guy is livid, his parents apparently know this recessive gene runs in their family but he was high on new love and didn't bring it up. He leaves my cousin. His parents are disgusted with the both of them, but this is their only grandchild so they step up, and its really scary for a long while as the poor baby fights to live with the disorder. Suddenly we stop hearing about miracles and fate as she navigates parenting a chronically ill child as a single mom.", "Nah I met a woman, university degree and all and (I'm saying this nicely) she was soo s*****, head in the clouds and made one bad decision after another. In a matter of two months after starting her job, she had fallen in love with another woman's husband, slept with him, he then proceed to beat the s*** out of her, she wouldn't leave because she was still in love with him, got pregnant, lost her job, got infected with a STI, the man spent her one and only pay check, ditched her(his wife had gone to visit her family in another country for a few months). She ended up relying on outsiders help, to get money for an abortion and a plane ticket back to her parents home and till the end she did not know what she had done wrong or understood her situation. So education does not strictly equal intelligence and common sense", "Damn dude, maybe she’s just attracted to him.", "Have you ever dated someone 20 years younger than you and thought wow how appropriate of me to date someone young enough to have been my own child?", "I’ve never dated someone younger than me, but I don’t think it’s wrong to date younger people if they’re like 30. Some women are only attracted to older men.", "He was 18 when she was 1. If you think that’s not weird then that’s up to you.", "Ya but she’s not one now, she’s 28. What’s WRONG with it? You don’t have to be into it, but it’s the same as anyone dating someone you’re not attracted to.", "A 45 year old man impregnated a 28 year old woman and is then abandoning her with no financial support. When he was 21 and legally drinking/having sex/finishing university she was 3. Once again you seem very involved in this decision? Is Your partner much older/younger than you or something?", "She's 28 and he's 45, stop this batshit moralizing. She's old enough to make her own life decisions.", "\"She expected financial support too\"... what?  she and the father should support the babies, not other people", "NTA\n\nFrom this it sound like you and the family were kind and gentle while delivering the truth she didn’t want to hear. This woman isn’t in a position to be a parent, let alone three at once. No one should expect and demand that much of your family and if people who generally believe in following through on unintended pregnancies see how bad her situation is that’s something to be noted", "Nta\n\nShe is expecting the family to support her financially/ emotionally and physically by taking care of the babies. \n\nI think you need to speak to the family about what she expects (involvement of money and presence) of them. Also, point out you can’t offer anything due to your own family and financial commitments. \n\nDon’t worry. She won’t cut anyone off, she will lose any offer of babysitting that she will be desperate for after a week.", "NTA but in some circles, this is what PL sows. That there will be a magical gathering of family members who will love to do everything. \n\n\nShe is 28 in a studio apartment. It is going to be very rough.", "NTA. I think it's unlikely she'll go nc with the family, as she'll clearly need support and expects that's how she'll \"figure it out.\"", "NTA. I had a similar situation where one of my relative got pregnant at a young age, there's a slight age gap between her and her partner. Her partner doesn't have a stable job. The result? My mom, who is blood relatives with her, had to help her somehow financially (we tried to tell her it's not her responsibility and it affected our family negatively but she says family is family ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯). Anyways, it has affected us negatively especially me and my siblings. I had to somehow settle for less especially during important moments in my life just because my freaking relative can't be freaking responsible for her own kid, being a burden to all of us. Needless to say, it ruined my relationship to her and my mom. So OP, you did the right thing IMO, you had to make her realize the situation she's in and reevaluate her audacity to put the strain of her irresponsibility to you and everyone else. Hope you go no-contact with her, save yourself the drama, toxicity and burden.", "NTA\n\nThe only vibe I get from your post is a lot of care, concern and compassion on your part. Even if the concern and caution you expressed isn't what your cousin wants to hear, there's not an ounce of ahole in anything you did or said.\n\nThe fact that she's assuming and counting on a lot of financial and other help from her extended family (waaay more than anyone is likely to be able to give her, much less want to give up) is reason enough that it's important to be clear with her up front.\n\nYou may want to suggest to her that she gets some counseling. You can suggest it to help her prepare for dealing with three little ones to care for. In reality, it may also help her actually see reality better and get her to start figuring out how she really is going to handle what is ahead of her.", "NTA", "NTA. You and your family are not horrible. You all expressed your very valid concerns about how she would manage. I'm also guessing the family suspected cousin expects a lot of help and laid down their boundary early. Regarding the cutting everyone out fir not supporting her, tell her \"go ahead. That just means we won't have to deal with your circus\".", "NTA. This is her life, not some stupid Lifetime movie where it all works itself out before the credits roll.", "The responses on this one are so very American! Damn, for one of the richest countries in the world you guys can be cold!\n\nI know you don’t have much in the way of a welfare support system, but did anybody think to signpost her towards what help may be available, whether from the government or charities or even freecycling for baby goods, or were you all too busy sticking the knife in? \n\nIt’s no wonder you have to pay through the nose for care when you’re elderly, the younger generations are just returning the same level of compassion and consideration that you give to them! \n\nI don’t think I can justifiably call anyone an AH here, because I get that this is your cultural normal, but it really doesn’t look great from an outsider’s perspective!", "NTA, you tried to gently tell her what she is in for, that is support. However it sounds like the support she is actually wanting is financial and for you all to be unpaid childcare. This is reasonable or feasible and she needs to realise that now. They are her responsibility not yours.", "NTA. Sounds like she really needs a reality check and while she might hate you for it for now, hopefully it gives her food for thought and helps her make what might be an incredibly tough decision. Expecting family to just rally around us a big ask - it’s not their job to pay for her choices.", "NTA. With multiples, there's a chance she'll need bed rest towards the end and the babies might spend time in ICU. And then there's strollers, car seats, diapers, food for 3.\n\nI hope she's able to get in contact with an organization that's able to support her. She needs to start applying to every available social program that she qualifies for.", "NTA \n\nThe woman lives in a studio apartment depending how big it is where is she going to even put the babies???? There is her bed but even then is it big enough for all four of them???? Is the area she lives in even safe for kids and if not what does she plan on doing for protection???? Does her apartment complex even allow families????? because some only allow two people at most in a unit or have a no kids policy. She’s definitely not thinking things through. She’ll definitely have to move though at least to a big enough apartment to allow an extra bed. Most cities will require you to have at least an extra bed, full kitchen and bathroom for an adequate living environment. If she doesn’t have any of that the kids could be taken away.", "NTA but she has no concept of reality My aunt and uncle had a daughter and then had triplets but the point to this that they had support off each other but they also got help from a nanny I think from the government this girl like I am just baffled if she has no income coming in, no partner to support her 3 kids to bring up on her own just frightens me she thought the whole family was going to step up give her money and babysit whenever she wanted thats not how the world works", "I'm glad there's a social safety net, even though that's no easy life, she's gonna need it if she alienates the family. It seems like she thinks she'll be fine, because everyone else will pick up the slack and help her. Kind of entitled, if you ask me. You're NTA", "Oh look it’s another post about someone having triplets as a single mother, whose family is dumping on her, but this one is even better because it mentions taboo subjects like abortion.\n\nWow there must be a something in the water at the moment because reddit is part of a worldwide phenomenon that everyone pregnant is having triplets and the dads are not in the picture at all.\n\nEdit: maybe it’s time these fairy tales writers learnt the odds of having triplets is pretty slim, (unless you are writing a reddit AITA of course) and got more realistic with their stories, if they want people to actually believe them.", "NTA but please talk to her about an abortion. One infant is hard by yourself 3 alone I don’t think most people would want to deal with it. She should just get an abortion.", "NTA. \n\n\nShe needed to hear it.", "People have been having babies since the dawn of time and families have been helping. She is 28, not 12. I agree that she shouldn’t expect financial support, but truly the response of the family was ridiculous. YTA.", "ESH Everyone should help her with taxes.", "ESH. It's so easy to suggest adoption and abortion when it is someone else but would be unthinkable to me personally.  It's all very well having this discussion about how hard it is before,  but now the babies are here I think it is in poor taste to suggest killing them and giving them away because life will be hard.  \nShe is also unreasonable to expect others to shoulder her responsibilities and needs to be realistic.  But I can definitely understand why she is offended and upset.  \nSome practical advice is probably needed for sure, but you and your family could also be excited for the little babies that she will be having.", "ESH.. it’s not right for you or your family to push your cousin into getting an abortion or adopting out her children. having a loving parent means a lot more than having a parent with money. cousin also sucks for expecting help and financial support, as they are her responsibility and since she made this decision it’s time to figure out viable solutions (financial aid, work, child care, idk exactly what the situation is with the father but she can probably take him to court for child support even if he says he doesnt have money). you can still be happy for someone and help them assess actual options.", "Yep, and as a former NICU nurse she'll be lucky if there aren't complications depending on how premature the babies end up. Caring for 3 healthy newborns is hard enough, caring for 3 newborns, one or more with medical needs that can arise from having premature multiples (not guaranteed but much higher odds the more you have in one pregnancy) is soooo much harder. Plus if in a country you don't have free healthcare that is gonna potentially be one hell of a hospital bill.", "I am not an American, in my country the NICU is covered by national insurance... But I wonder how this is in the US? Do you have to pay it yourself? Because if you have to pay the NIcu for 3 childeren you will be bankrupt.", "In OP's shoes, I think I would have let this woman have a breather for a few days. Even if you are right, you need to sometimes recognize when someone is in a space where they need a bit of time to calm down, think, and process their emotions. With this family pile up being so fresh and emotions being so raw, I think this conversation was doomed to be unproductive from the jump. \n\nThis woman clearly does not fully comprehend the gravity of having triplets and she needs to figure out her life/finances/housing etc out for the sake of her unborn children, asap. But, she is still a human, dealing with a great deal both mentally and physically right now. She just had her entire family basically all come at her at once, on Christmas Eve, and tell her that she is unfit to be a parent due to her finances and she needs to either get an abortion or give the kids up for adoption - both of which are traumatic options for someone who wants to be a mom.", "Most places have laws on how many people can live in a rental based on how many rooms.   Usually it's 1 per living room and 2 per bedroom.  It's probably not even legal for her to have 3 kids in that studio.", "Most people that aren't ready to have children, just have because they are relying on the help of the rest of the family. It's infuriating.", "I'm VERY pro-choice but would respect pro-lifers if they actually stood behind their goals and supported pregnant women lol", "She doesn't have the luxury of pushing them to the back of her mind though, those babies will be coming and she needs to be realistic. She also seems to feel entitled to financial and child care support from the extended family for her decisions. Again this is not realistic. If she can't cope she needs to figure it out and she can't do that with her head in the clouds. The ones who will suffer are those babies.", "I understand you. I got pregnant very young. My fondest memory of that time was the teacher who, firstly, told me congratulations. My family didn't help at all because \"I brought it on myself\". There were some very hard years. It hurts my heart to see how much they're helping my sister in law now. I don't understand why they treated me like that.", "pregnancy is different for each person obviously. I'm a pro choice & personally would choose to end the pregnancy. it would be harder for me with potential triplets, but I think I'd still do it because of complications I know I'd have. can't say that for her, she might be having a really big moral dilemma whether she's pro choice or not. I'd try to reach out again if it's within your own limits, I don't want her to over rely on you either though.", "It’s not uncommon to go bankrupt from a single child’s NICU/PICU stay in the US. With multiples you’ll see a lot of people here trying to monetize their pregnancy and babies on social media to try and help afford the costs", "You need insurance, and it better be good. The bill for my son’s NICU stay would have bankrupted us if it wasn’t for our (excellent) insurance, and he was a singleton who was only in there for 16 days.", "Yeah in the US it varies. Our private insurance through work covered it, we had copays and deductibles and stuff, but we aren’t $2M underwater. NICUs also have social workers on staff who help navigate applying for aid and especially public insurance (Medicaid) which the requirements vary for from state to state, but some premies qualify for just based on level of prematurity/birth weight. Some people do end up in huge amounts of debt, especially if there is a gap between when insurance or they can’t get in Medicaid right away, or if there is air transport involved (which is just a shit show with insurance). Basically it’s complicated, and extremely stressful for a lot of folk.", "It doesnt sound as if he's planning on acting responsible.", "I think maybe the abortion comment was pretty bad.\n\nLike she's far enough that the doctors can tell already there are 3 babies.\n\nSuggesting an abortion for triplets that far into a pregnancy to a mother who wants to keep them all (whether she's ready or not) seems pretty cruel.\n\n(Don't get me wrong, she shouldn't expect everyone to make up for her choices, I am merely explaining some of the cruelty that can be perceived)", "Considering that her life as she knows it is essentially over at this point, I understand why it would be preferable to escape behind the fig leaf of even the flimsiest illusion. It is a pitiable state to be in.", "they could signpost her to resources, help her mentally/emotionally??", ">Thanks for that comment. As if it is so easy to give children away and to abort!!! Abortion would maybe be something I would consider for me in some situations. But give my children away??? Never.\n\nThe alternative, that she somehow manages to burn herself out over the next 18+ years to try to keep those children, is no less horrible, it just takes longer. Her life has irrevocably become a tragedy, the only choice she has left is to pick the number of acts.", "This right here. I’m a college professor. The amount of students who “earn” a degree these days is not equal to the amount who actually  have the brains to use them.", "What a childish attitude you have.", "She's nearly 30. That's old enough to make such a decision. If she was in her early 20s, yeah, that would be concerning. But a 28-year-old shagging up with some older guy she found attractive? Not really an issue.", "Can we just stop with the ew age gap mentality. She is an adult. Grow up.", "No, that's the pregnancy hormones screwing up her common sense. Those are the same hormones that make some women think it's appropriate to bite their husband's head off when he won't get up at 2 in the morning to go shop for her craving when he has to get up at 5 or 6 for work.", "You can tell the number very early on. There would be three embryos at the dating scan. Well Within the period to get an abortion if that is what the mother wants.", "You can tell the number of babies by 8-10 weeks scans so still first trimester.", "You don't need to be far gone to be able to say it's triplets. It's visible straight away. And it's possible to have reduction abortion where some foetuses are aborted and some left. She's potentially going to be a single mother to 3 disabled children, as it's unlikely she'll carry top term...", "Think 7-8 weeks for the first ultrasound but 13 weeks latest for an abortion. So yes it's cutting it super close. And that's not even to go into the discussion of whether she would even consider it as an option in the first place.", "Are you people awake of the sheer amount of women who LOVE older men? LOL y’all need to get real, this is VERY common there’s more than a handful of women who are exhausted with men their age. Older guys are (most of the time) a lot more level headed & stable. Hence where the attraction comes in.\nEdit: aware", "Thank you.", "I mean, it's still a terrible decision. We're allowed to call out terrible decisions when we see them. \n\nThe bigger the age gap, the greater the likelihood of divorce. \n\nhttps://www.theatlantic.com/health/archive/2014/11/why-to-marry-someone-your-own-age/382520/", "Agreed. People need to start (re)-recognising the difference between Age Difference relationships and Age Gap relationships.\n\nOne can be problematic because of a disparity between lived experiences, income etc.\n\nOne is just, hey, you're not dating your birthday twin.", "The people on this subreddit are very against big age gap, like adults in their 20s still teenagers.", "As a woman close to OP's age, I wouldn't date a man more than a few years older than me. I've found that most single men in their 40's have baggage (divorces, children, baby mamas) or some reason for why women don't want them. Anyone (man or woman) dating two decades younger are lacking in emotional maturity of some sort. Look at this post- a 45 year old man who can't afford to be a father. Why can't he afford that? Does he have a criminal record? Is he a drug addict? Is he paying someone else child support?", "Your attitude is pathetic.", "I've dated someone that much older than me and it was perfectly pleasant. I'll tell you who I haven't dated, though: anyone as judgy as you, bc that would really suck.", "I'm with someone who's 30 yrs older than me. And my maintenance man's wife is 20 yrs younger than he is.", "I just don’t get it. I’m in my mid 20s & no I’m not saying there aren’t great men my age, but everyone’s entitled to their own choice & I’ll never understand why people think age is such a big deal once you hit adulthood. I guess it’s just younger people, who haven’t realized happiness is what you make it & life won’t always be that cookie cutter vision you have in your head (:", "That’s your own opinion. Not all older men have terrible baggage. & you don’t need to act condescending because of my age baby. I guarantee, I’ve been thru things in my life that would make your skin crawl. I do not need a lecture from anyone on what “life experience” will teach me. One of the most successful marriages I’ve ever personally seen had a 20 year age gap. You, like everyone else, are acting like every couple with an age gap MUST have these issues. That’s simply not the case. Like I said, life is not cookie cutter.", "And I’m also very close to OPs age, we share very different opinions on this & that is clearly due to life experience.", "Same here tbh. I feel like there's a lot of confirmation bias when it comes to age-gap relationships. People only hear about the ones that go badly and of course, that's what they point to. My bf and I have been together for 2 years now and have no problems.", "I think is really ignorant to judge a relationship you know nothing about, based on age only. \nCouldn't agree more, once you hit adulthood, you have to own your  decisions.\nI don't like how this subreddit treat every story with a age gap like grooming. I seen this even with people in her 30s", "Yeah I didn't get it when I was your age either. Life experience will teach you.", "https://www.theatlantic.com/health/archive/2014/11/why-to-marry-someone-your-own-age/382520/\n\nHere you go! Couples with 20 year age gap are 95% more likely to divorce :) enjoy", "So fucking what?", "But she isn't 1. She's an adult", "Maybe I’m too young (26) but I’d find it weird that the future mother of my triplets would be 8 years old now. Apparently I’m wrong on this one my bad.", "But she isn't 3. Stop turning her into an infant. She isn't in nappies."]}