{"id": 5713, "submission_id": "zvv4iz", "title": "AITA for not accepting and opening gifts from my mom and her family?", "selftext": "My(16M) parents divorced when I was 6. Mom remarried when I was 8 or 9. Her husband has 2 kids(12,14) with his late wife. They were always favored. They got more attention, more gifts. I complained, but was always told they lost their mom. After some time my mom adopted them (which I hated) and everyone still used the same excuse.\n\nIt all came to head this November at my birthday. I got half the value of gifts then them for their birthdays. I was pissed and argued with my mom and her husband. In the end I told them that I don't want gifts from them and the rest of my mom's family ever again. Neither for my birthday or any holidays. I am done.\n\nFor Christmas I am with my mom at the morning and then go to my dad and stepmom in the afternoon. When I woke up I went downstairs to make me some breakfast. The kids were already opening their gifts and mom told me to open mine. I told here I don't want any gifts and to distribute them to others and went to the kitchen to make breakfast. Mom, her husband and grandparents came after me and told me how ungrateful I am and to just open the gifts. I argued with them, things were told, people were offended and I went to my room and locked it.\n\nI waited till my dad came and just sneak out of the house. I told dad what happened and he told me I should just open the gifts. I got some text from my mom's side how I ruined Christmas and made my mom cry. She texted me and begged me to come home. I told her I am not coming till 2nd of January when my school starts. Should I accepted the gifts or AITA?", "created_utc": 1672084024, "permalink": "/r/AmItheAsshole/comments/zvv4iz/aita_for_not_accepting_and_opening_gifts_from_my/", "score": 1058, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my mom I don't want any gifts. They still got them for Christmas. I refused to accept and open them and was told I ruined Christmas. I don't know if I'm AH here.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Enough with their bullshit. Instead of the presents, imagine your mom and stepdad are serving you a disgusting soup every year. You taste it year one, you don’t like it and it makes you sick. Next year, same. At this point, you know how the soup it’s going to taste and how you’re going to feel. No need to subject yourself to this experience. Your mom crying is really funny to me, and the fact that she says you’re ruining Christmas by not tasting their disgusting soup is sick.", "NTA  You were clear in your expectations- you expected equal treatment, didn't recieve it and let them know you'd no longer tolerate it. It's a shame your mother allows and encourages this, do you live with her? Can you stay with your dad? And I'd point out that you didn't ruin anything - her treatment of you ruined things and I'd even ask her why she cares so much.", "NTA: You told your parents how you feel and they ignored you. Their inability to discuss this with you and come to an agreement is on them. Attempting to make you feel guilty for your feelings is dysfunctional.", "NTA. This is the result of years of mistreatment by your family.", "NTA but if you're not already in it, I'd look into therapy. You might also consider moving in with your Dad, even if you have to switch schools.", "NTA, blended families are ridiculously complicated and from the sounds of it you were never a fan to begin with.  However you let your mom know how it made you felt and she did not do enough (or anything) to rectify it.\n\nI can kind of see the very flawed logic as to why she did things the way they did.  If you have both your mother *and* your father so you have two sets to provide where their kids together only have them.  I call them their kids because she did adopt them.  However the blantent favoritism isn't exactly making them look very good", "NTA your mum needs a wake up call, she is going to loose her son but unfortunately i think its too late. Im sorry for you", "NTA - You could accept the gifts and sell them for cash. Because if you want to leave in 2 years,  you are going to need all the cash you can get. If  you can't sell them as they are not worth anything re-gift them back to your mom - husband and kids. If they complain - well if they were good enough for me they are good enough for you.", "NTA. They mistreated you. They \"ruined Christmas\" on their own by treating you differently and not listening to you when you voiced your concerns. You decided to no longer be put through that anymore and now they're mad.\n\nI will say, I'd open the gifts just to check if your mom/stepdad become better about the whole thing. But judging by their reaction to you not opening them, I don't think they did get better.", "Nta\n\nIf you hadn't told them ahead of time, maybe a tiny bit ah your way, but you told them very clearly that you were tired of the obvious favoritism, and rather than demand that they give you more, or give the kids less, you just said you want no part of the whole thing. They chose to ignore your wishes then were surprised, which they had no right to be. \n\nNext year, make it clear that you're just not going to see your mother on your birthday or Christmas.", "NTA The ugly sisters open their gifts and get wonderful presents and Cinderella opens hers and it is nothing like her step sister's gift. And everyone smirks and feels powerful and Cinderella feels humiliated and less than. But what if Cinderella doesn't open the present? Then no one has any power over her. She is the one with the power. My mother was a narscissist. She played loads of mind games, but I learnt to take back the power, just as you did there. Yes it hurts, it hurts bad. But you put yourself in the driving seat. You didn't ruin Christmas, you just drew a line in the sand. You just told them you are not putting up with the B.S anymore. It is hard to enforce that as a minor. good luck. Don't let people bully you into being the victim.", "NTA\n\nThey refused to listen. Not your fault.", "NTA. I hope you have a plan when you turn 18 and can move out.", "NTA. You told her you didn't want anything, then stuck to your guns when she did it anyway.", "Info : Have you ever clearly expressed to your mom that you feel like you lost a mom too? \n\nHow’s your relationship with your step-siblings? \n\nIs there any difference between how step dad and mom treat you?", "You don't want their gifts because you don't want to be reminded of the favouritism. You are not the one ruining Christmas or gift-giving by setting a boundary having been treated badly. NTA", "NTA but I hope you try to find another place to stay, even if you have to move the 40 minutes away with your dad. I know changing schools can be hard but having a tough time at school but a calm peaceful home is way better than a happy school experience but a chaotic miserable home life.  \n\nYour mother has shown you time and time again she doesn't care about you. Her and her husband take some sick pleasure in making you feel lesser than him and his children. If I were you I wouldn't even bother picking up her calls once you are able to get away. You don't need or deserve such horrible assholes in your life .", "Is it just about the gifts or is there more? How were they always favoured?", "Plot twist: they got you a PS5 this year.\n\nNTA anyway", "NTA. As a mom I don't understand the favoring other kids over your own(i do get loving them and treating them equally as your own). \n And you already complained about this issue but the response wasn't \"I'm not favoring them\" but \"I'm doing it because of this\". \nYou're still a kid as well and you have the right to be upset and wanting an equal treatment, attention and gifts value.", "NTA.  Tell your parents you want cash into a college savings account for Christmas and birthdays. Something tells me they won’t have the funds to pay anything for your college expenses and this will give you a little bit of a leg up.", "NTA", "NTA", "NTA, you’re better than me, i’d be getting my dad the best gift possible while giving a gift card not even signed for her", "No. Go no contact.", "NTA.\n\nYour stepsiblings have been getting more gifts, more vacations, more furniture, etc. for 8 or so years. Every birthday and Christmas has made you feel less wanted. You're being called ungrateful for not letting them continue to mistreat you.\n\nThis is like trying to wrestle someone in a match where you have to play by normal rules but your opponent is allowed to kick you in the nuts, gouge your eyes, etc. There's no way for you to win.\n\nRefusing to play is the only sane option.\n\nHave you asked your mom what it would take for her to start treating you and your stepsiblings equally? How many times does she have to break your heart before she decides that you've suffered enough? Or is she mistreating you to inflict pain on your father?\n\nI personally think that mental health is more important than educational opportunities. I would transfer to a school near your dad's house and go LC.", "[deleted]", "YTA - you mention in a comment that your dad gets you great gifts but you dismiss that as “compensation” for your mom not spoiling you. Have you considered that your parents may have come to a compromise over gift-giving without consulting you (because they don’t have to) and since you live with mom and step-dad and they provide the majority of your day-to-day care, your dad gets you the big presents (the type that step-dad is providing for his own kids… meanwhile your mom is doing the job of mothering *all* of you with that invisible mental load of mothering (of which you know nothing?)", "YTA. Sorry but you are kind of acting bratty. Your mom and step-dad got you less expensive gifts? Really? Gifts aren’t love. Gifts are not always measured by much they cost. Also sometimes it is harder financially at different times of year. That’s life. They did what they could and you didn’t appreciate it then. They tried again and you marched out. You resent that your Mom adopted other kids. She probably had to try pretty hard for them to accept her and in that time you felt less close to her- but they can never ever take your place. It’s just bad timing because a 16 year old girl really needs her Mom . This may be coloring every experience you have, and hopefully family therapy can help… but it’s not really about gifts. Perhaps you could try to be the bigger person, try to be more open hearted and focus more on the bond you two share. Life is so short. You’re upset because you need more from them but running off won’t make that happen. Talk and be mature. Analyze where your feelings are coming from. Be strong and mature.", "NTA but sit down and have a calm but serious conversation with your mom. Don't get angry, but say your piece, then listen to her side. See if you both can compromise.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy(16M) parents divorced when I was 6. Mom remarried when I was 8 or 9. Her husband has 2 kids(12,14) with his late wife. They were always favored. They got more attention, more gifts. I complained, but was always told they lost their mom. After some time my mom adopted them (which I hated) and everyone still used the same excuse.\n\nIt all came to head this November at my birthday. I got half the value of gifts then them for their birthdays. I was pissed and argued with my mom and her husband. In the end I told them that I don't want gifts from them and the rest of my mom's family ever again. Neither for my birthday or any holidays. I am done.\n\nFor Christmas I am with my mom at the morning and then go to my dad and stepmom in the afternoon. When I woke up I went downstairs to make me some breakfast. The kids were already opening their gifts and mom told me to open mine. I told here I don't want any gifts and to distribute them to others and went to the kitchen to make breakfast. Mom, her husband and grandparents came after me and told me how ungrateful I am and to just open the gifts. I argued with them, things were told, people were offended and I went to my room and locked it.\n\nI waited till my dad came and just sneak out of the house. I told dad what happened and he told me I should just open the gifts. I got some text from my mom's side how I ruined Christmas and made my mom cry. She texted me and begged me to come home. I told her I am not coming till 2nd of January when my school starts. Should I accepted the gifts or AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA- I'm guessing that they take your dad and step-mom 'into account' when choosing your gifts. Their theory is that they are the only parents buying for your siblings and that you would get double the gifts of your siblings if they treated you all the same. \n\nBut...that is the AH thing to do. It's none of your siblings' business what you get from your dad and step mom. What matters is that your mom and SD have chosen to make you suffer in order for the other two to feel okay, and that's not your responsibility.", "ESH. Clearly they’ve acknowledged yet somewhat ignored that you feel sidelined, which you shouldn’t feel and as a half sibling to 3 other siblings I know that feeling well, but—\n\nYou’re also being kind of bratty, punishing them and yourself because you’re counting the value you of the presents. You’ve said nothing about how much you like or dislike the gifts themselves or if they were given to you with thoughtfulness, just that they cost less. Gross.", "Guessing step mom handles gift giving, purchases for the house, etc.  dad does the stereotypical dad thing of earning money and letting his wife do everything else. He probably never gave a thought to how her kids might benefit more than you; nor did your dad.", "Wow, that is great comparison. I will use that in next family therapy. Thanks.", "Thank you. My school is in my mom's city so I live with her. My dad is in another city 40 minutes away. I still have 2 years to go. I hope I make it. There is always tension in my moms house when I'm there. We went to family therapy but I always felt I was being gaslighted by all. I'm just done.", "Yeah, this *might* have been the holiday they changed (but highly doubt it). \n\n...open them, and if you don't like, just immediately donate to charity. \n\nNTA", "I think the mom and step dad listened and got nice gifts, they just didn't know how to talk to OP and explain themselves. They should have spoken to her b4 xmas morning and said we listened to and thought about everything u said last month and are sorry and we have corrected this behavior and want to show u starting with Xmas.", "OP says they’ve done family therapy only to get gaslight, i think it’s safe to say OP has expressed this many times only to be dismissed", "It depends. If OP has a strong school community (mentioned doing plays in another comment) and is involved there, might be better to stay.", "Better birthday parties, multiple vacations a year (I get only one from them), everything in my room is more than 10 years old (except bed), they get new furniture like every 3 years, nobody from mom's side comes to my plays, but they go to every game for them, etc...", "He’s a minor living most of the time in her house. Going no contact isn’t really an option.", "They buy OP necessities like clothing and gift the other two gaming consoles. Thats blatant favoritism that would hurt even the most level headed adult.", "Then why did she get to spend more money on children that aren't hers.", "In that case they would have communicated that.", "I'm a boy. My mom and her husband kind of show love through gifts and so the cost does show that I'm less than. But it's not just gifts, they always treat me less then. At this point I have more connection to my stepmom. She treats me the same as her own kids. I call her mom too, which my mom absolutely hates (I saw messages between my dad and mom. She accused my stepmom of taking me away from her too, after she took away her husband and destroyed her marriage). I think my mom resents me for that and treats me as such. I'm just waiting to finish high school and get away from that house.", "When you get clothes and shoes for your birthday and the other kids get gaming consoles and electric bikes it kind of shows how much you matter to them. And then they tell me that kids have no one on their bio side of family and I have my dads and they give me great gifts. Yeah, they give me great gifts because they are overcompensating for your lack of effort. Gross.", "If your mum was treating her replacement kids that much better would you not act bratty at that age? Not that I agree that op is acting out, they sound pretty mature for their age.", "It’s his mom and stepdad.", "Your boundaries are valid, and you took a very remarkable and strong step to refuse more gifts - you put your feelings and mental health over material things. Honestly, that is something to be proud of because not many adults are able to do that.\n\nIt isn't fair that they are making your mother's feelings your responsibility when she has never taken full responsibility for yours. Just something to think about!\n\nMerry Christmas, I'm sorry things are difficult for you.", "Tell the therapist that every year they use gift-giving as an abusive ritual to drive home the point that they love the other children more.\n\nYou’re completely correct. The only way to win is not to play.", "Actually, this is something my therapist told me!! Glad it helped!", "Would it be ok to ask for an update for when you go back to her ? Genuinely hope how this one will turn out. Hope it will be by an apology.", "Sorry to hear it. Just work with your school then and keep focused on what you'll do after high school.", "I also wonder if financially the dead mom left money for her kids, tied to gifts. Some people have weird after death wishes... it might be worth considering?", "Can I sell you a bridge in Brooklyn? It's a brilliant deal, cash only.", "NTA. It’s so unfair that she treats someone else kid better than her own. That must hurt a lot", "That’s straight up abusive ngl, it’s kinda insane how there’s so many stories like that I feel like it’s just the parents being stupid and not knowing it’s abuse (still their fault tho) you’re NTA 100%", "But she adopted them, so she is their mom. OP details a lot of other behaviours that make the overall situation not okay, but at least with the gift-giving it sounds like OP has an issue with the accounting. OP gets twice as many gifts since he gets gifts from mom and then presumably again from dad. OP sees his step-siblings getting gifts that are twice as valuable, but they don’t also have another parent contributing from off-screen. To me, the gift situation sounds fair overall and I think OP isn’t seeing it that way. \n\nOf course my comment comes with the caveat that there’s a lot more going on here than just gifts, but that’s beyond the scope of the post.", "How did you figure? What OP is seeing as a discrepancy and”unfair” may just be stepdad spending money on the siblings (not mom) because mom may have an agreement with bio-dad that she spends on day-to-day bills and care, and he spends on the big ticket items. Which works out to equitable treatment.", "Yeah this is pretty complex. I’m sorry it sounds like your mom is also a YTA. You’re right to want to move", "Can you at least compare your total presents (from mom and dad) to theirs instead of just a portion of your presents? Is it still uneven? Or should you always get twice as much since you have two homes and they don't?", "Well clearly your mind is made up. What’d you come here for?", "I wonder if therapists ever go 'oh hey I recognise this metaphor'.", "Wouldn’t they have explained that at some point when he asked why they always got more. And to be quite honest, fuck that as an excuse anyway. You don’t treat your kids differently and make one feel like shit because of the wishes of a dead person.", "100 percent this!!!!!!", "Haha no! Because all my therapist tells me is “oh, soup again!” (Otra vez sopa!) to convey a toxic family situation that happens over and over again. It’s a saying from my country that means “oh here we go again”. I did my own literary take on it.", "Also, the 16yo gets worse gifts than the 14yo and 12yo? Fuck no.", "Alright... I see where you're coming from but legally if the money was in a trust or whatever, there are rules for spending... it's worth OP at least asking IMO", "NTA.  Sounds like they have no genuine interest in maintaining a relationship with you.  The sooner you go NC with them, the better.\n\nBest of luck OP!", "NTA. They’re completely dismissing your legitimate feelings and trying to guilt you. It clear favoritism and they refuse to acknowledge & change the crappy behavior. Would staying worth your dad more often help? Is it a possibility to move in with him? You’re clearly treated like an afterthought at your mom’s house and it’s straining the relationship with your and each of them, including your step siblings. You’re mom & step dad will wonder why you move away and choose to have little or no contact as an adult. Sorry OP!", "NTA.\n\nI agree with the other poster that said it might be better to transfer schools and live with your dad.\n\nIf you come back and they force the gift(s) on you, throw it away.", "You “ lost your mother “ too. You lost her to two step kids that she favored over her own son. You’re old enough that you are not required to live with her if you wish.", "NTA You should change schools and live with your Dad.", "YTA, listen I get that you feel left out and want your spot in the limelight, but this is no way to live, counting the $ spent on gifts and keeping score. If you think about it you are getting more 'cause you have a Dad that also gives you things. I know this won't be a popular opinion since most on this subject like revenge and getting people back when they feel wronged, but it is a much more peaceful way to think and live. You can't change them, you can only control your reaction to them.", "I’ll buck the trend - YTA, big time.  You have two homes and therefore presents at each one - surely your mother considers that when getting you gifts and getting the other kids - who have ONE home - gifts.\n\nGrow the heck up and be glad that you still have two living parents.", "NTA. In your comments you mentioned family therapy so I hope that that helps, although if this is still happening perhaps not. You shouldn't have to deal with being treated like that, good for you for standing up for yourself", "NTA, my son is experiencing this with my parents.  He gets $20 junk toys he has no interest in and his cousins his age and younger get the latest iPads.  It's always that way for birthday's and Christmas.  Eventually he'll notice the difference so I'm just refusing to do any events with them that involves gifts.  Everyone should be treated equally.", "I like to read other comments before answering to see what I assume is a grouping of people who are more your peers.  I am much older then you and can only see through my own lens of childhood.  I think if I grew up similar to you, I’d probably feel the bitterness of unfairness, but sucked it up because of the power dynamics of the times.  Advocating for yourself to a parent was something you didn’t do.\nToday that has changed.  And in your case, you every right to express your observation of their preferential treatment.  And offering to have the gifts distributed to others wasn’t taking away from anyone else.  But what really got me was someone (an adult?) texting you-a child (sorry) and saying you “ruined” Christmas.  How fucked up is that?\nSomeone else here said to only accept financial account gifts if anything.  College, Bonds, etc.  Useful.  It will help you leave when you’re ready.\nNTA", "NTA\n\nYou were sick and tired of being treated as the Less Favored One.  And you flat out told them \"No more gifts for me on Christmas or my birthday.\"  \n\nThey didn't listen and your mom was upset that \"you didn't open the presents.\"  Which you told them not to get.   \n\nIf your mom truly wanted you to feel welcome and included in the family, she's had a decade to do so.  She has not.  Her actions scream \"I love my new stepsiblings more than you.\"\n\nDon't open the gifts.  If they insist you take them, throw them in the trash, unopened and toss the bag out to the curb.  Right in front of their eyes and house.", "[removed]", "NTA. Interesting how they are calling you ungrateful when you're the one not accepting the gifts they are giving. They are not treating you equally to your siblings, you set fair boundaries and kept them. By not accepting the gifts you showed that it's not about the value, it's about the sentiment, and you are receiving far less than anyone else in that household. Good on you!", "NTA. Take them, still wrapped, to a homeless shelter or older kids’ group home.", "nta. there's definitely purpose behind not giving you the same value gifts as the other kids - otherwise why would they insist on getting you gifts even after you refused them and then be so upset when you refused to open them? if it were plain neglect they would leave it alone and let you refuse. it's an abuse tactic.", "INFO:\n\n>After some time my mom adopted them (which I hated)\n\nWhy?", "NTA. It's not about the gifts, it's about expectations of equal treatment. And you were already clear that you won't receive gifts anymore. I am hoping that your father isn't an AH.", "NTA . This is neglect. Neglect is child abuse. You don't have to be hit or starved in order to be abused.\n\nAsk to move in with your father full time.", "At 16, you are old enough to have your wishes taken seriously. Instead, your mom and step-dad continue to boundary stomp. You are NTA.", "nta, your mom needs to understand that as tragic as their losing their mom was, it doesn't give them the right to ignore you. You made her cry, well welcome to how she has made you feel. You should tell her that. Maybe see if you can move in with your dad?", "INFO: are you comparing what they get from their dad and (adoptive) mom to what you get from your mother plus what you get from your father? Because if you are only comparing what you got from one parent to what they got from two, you're comparing apples and oranges.\n\nETA: YTA, you get gifts from your father that you are completely ignoring here. I hope someday you look back on this and cringe at how you treat your mother. She is recognizing that you, not your steps, have other parents and gift givers. You seem to completely discount that your father cheated on your mother, then married his affair partner, AND you call the person who helped break up your parent's marriage \"mom.\" Of course she's mad about that! What a disgusting, unprincipled little brat you are!", "NTA\n\nOp, I know you like your school where you are at, but 2 years of living in that environment is not worth it.  It is not worth the mental illness the neglect that your mother is doing to you.  It is not worth it to watch as your mother favors her stepchildren over you.  Nor is it worth it when her parents and all of her family decide to harass and bully a child, that would be you.\n\nI think your best option would be to talk to your father about living with him full time and to not return there for a long while and put for the condition that any visitation is only with your mother and not with your mother, her husband and the other children.  \n\nNow there are several things here that I am thinking of and looking at.  One is the family therapist.  I think you need to be brutally honest infront of the therapist and from the sounds of it, that you are already checking out of the relationship.  That in 2 years you will no longer be in her life, will have nothing to do with her or her children or her husband or her family.  That to you they will be strangers and you don't want to know them or have them around.  \n\nThat is what is going to happen, you will turn 18 and one day will just leave her and she will never know what happened to you or be involved, that you intend to go NC with her for the rest of her natural life.  \n\nThe other thing and this is where you have to think long term and start planning and that is what happens if you get something nice from say your father?  Do they take it away or make you share it with the others?  You are a teenager, what if you get a car, what is to stop your mother or your stepfather from taking it away from you or trying to sell it and use the money on their children?  what if you get something nice and those kids want it, does this mean you have to give it up to them?  \n\nThose are the kinds of things that I think need to be answered.  And from what you posted, having it taken away from you or conditions put on it in favor of the 2 younger children kind of seem more likely.  \n\nAlso when you get a chance, talk to your father, you want to know about things like college funds and other stuff like that, which is in your name.  (Far too many posts where a child has a fund, and the stepparent steals or tries to take it from the child to fund their own child or tries to get the child to hand it over.)  If you are working, have your dad as the parent on the bank account and not your mother.", "NTA", "solid NTA", "NTA... Am I right to assume that when you can financially and legally move out of there you will leave asap?", "[deleted]", "I'm usually not one to agree with bitching about presents but this seems to be part of a larger issue. More of a symptom of the problem not the main issues. I'd say you are well within your rights to refuse being treated as a second class citizen in your own home. I would write down in as non Blamey as you can, your gripes. Definitely mind the wording. Something akin to \"look we are all equal or we aren't. I respect that you guys have a family going on here but if I'm a second class citizen here then I don't want to accept gifts and accept my lot in this, it's akin to accepting the situation here. I love and appreciate you guys, but I don't want to be part of this if I am being treated differently than my \"siblings\". If you want to Harry Potter me just because they had hardship I think you may be missing the point of what it means to be a family.\" Ngl I suffered from this too, my brother would get computers and gifts in an effort to curry favor and I would get nothing.", "NTA.", "I'm truly sorry for what you're going through. Without commenting on your reaction at Christmas, I will say that your mom and stepdad have no right to make you feel less important than the other two kids. As such, in some sense you're speaking out (or reacting) in the face of injustice.", "YTA. You basically want twice what your stepdad and mom’s kids get because you know damn well you’re also getting plenty from your dad and stepmom. Parents divorcing sucks, doesn’t mean you get to cash in on it.", "NTA. It is really sad beyond words when a mom don't stand up for her child. It sucks, but you did good OP, since it seems like no one is on your side you are making your limits valid. Stay strong it won't last for ever.", "NTA man. I’m sorry you’re being treated this way. You made it clear you don’t want anything and now they’re trying to make you the asshole here instead of acknowledging their asshole behavior. They’re just trying to make themselves feel better about their shitty behavior and making you the bad guy so that they don’t have to think about how they’ve been acting and mistreating you.", "NTA. They lost their mom and you've in a way also lost yours. I'm sorry you're going through this and hope there is at least one adult who understands and supports you.", "NTA-- good on you for setting and sticking to a boundary. Your mom could have respected your wishes, or gotten you gifts and privately offered them to you, or otherwise found a way to try to apologize that wasn't painting you as the bad guy. \n\nUnsolicited advice - try to remember that as much as this situation sucks, your step-sibs are also kids and not any more responsible for your mom's behavior than you are. You can hate the situation, but unless they're also jerks, try not to take it out on them-- which you probably aren't, you sound remarkably mature about a bad situation, and also don't take that to mean you ALSO have to cater to them or anything, just worth keeping in mind.", "NTA\n\nyou are justified in your reaction but I would use this as a way of broaching the subject about equality again. Your mum obviously expected you to forget about the past inequality and be a greedy teenager, but you held your will and didn’t accept the presents. This is a perfect opportunity to sit down with her now she knows you’re serious. Emphasise that you are becoming an adult and will be able to make choices as to how much you see of each parent at future holidays. Continue treating you like a second hand child will cause you to drift away from her.", "NTA - If you were significantly older than them, I could see the justification, as gift spending will inevitably go down as you get older... but there's literally 4 years between you and the youngest. That's hardly anything in the grand scheme of things!\n\nIt is absolutely not unreasonable then to expect that you'd be treated the same as them, but it seems your Mum is prioritising her new children, and taking you for granted.\n\nThey're only upset now that you've refused to keep playing doll house and made them look bad in front of the relatives.", "NTA.  A few gifts don’t absolve mistreatment.", "Oohh. Awesome idea", "This comment sums up how you have been treated for years and deserves an upvote.", "Not only that, but the reason the mom and stepdad keep making this “soup” is because the other stepkids enjoy it. So the soup is made for the benefit of all the kids except for OP.", "This kid calls stepmom - who had an affair with dad - “Mom” but calls step-dad by name.  Wants twice as many presents as the other kids in the family, resents “only” going on 1 vacation with them (I’m guessing he’s with his DAD during the other vacation, but apparently they should somehow grant him a make-up vacation?) and said such horrible things to his step-siblings that they had to go to therapy.  But yeah, he’s not TAH.  Oh, but wait, He IS TAH.", "Just posting to keep this at the top. NTA, OP", "What a fantastic metaphor! NTA OP, and your mother’s behavior is appalling", "I used to run a \"Giving Tree\" at a church every Christmas.  I can't tell you how many times I had to explain to volunteers putting together gifts for a family that each kid in a family had to receive a gift or gifts equal in value to his or her sibling's.   I kept having to teach basic psychology (and economics) to a bunch of women who were already parents and should have known this already.  Many tried to argue that the kids wouldn't notice.  Kids notice from a very early age.  I hope a few eyes were opened at least a little bit.", "No. OP has already told them never to buy them any more gifts. Even opening them is a concession.\nNTA.", "Even if they did get them a PS5, they’d probably be forced to share and never get their turn on it.", "Two more years and they are all out of my life.", "My school is in my mom's city, my dad lives in another 40 minutes away. Luckily, college is in my dads city so I will move in with him as soon I finish high school. Just two more years to endure.", "I don't really have a relationship with my mom's husband and the kids. When they moved in I refused for him to parent me and the kids got this idea that I will be their older sibling. They pushed and I said some horrible things to them, probably causing trauma. Thats when therapy started and it's not helping. It's probably too late now. I just don't see him as stepdad and kids as my siblings.\n\nI expressed my feelings to my mom multiple times, but was always told the same excuses. Everyone on my mom's side denies any favoritism but I'm not blind.\n\nI must say that I snoop on my dads phone (bad, I know) and I learned a lot of things that are happening behind the scenes. I think my mom resents me for calling my stepmom mom and my mom's husband by his name. My mom hates my stepmom because she had affair with my dad and now thinks she is stealing me too. Nobody knows I know and I can't express that in therapy. As far as I am concerned I already lost my mom, but got a new one.", "I am sure the only thing my mom considers is to put all on my dad and his family. In that way she saves money for other kids.\n\nSo yes, I am glad I still have two living parents, my dad and stepmom.", "Op shouldn’t pay because his parents are divorced while his mom adopted his step-siblings. Your logic doesn’t make sense.", "You mean the bond of 'you only get old furniture because you still have a mom and they don't', 'you get smaller birthday parties and less gifts and less vacations because you still have a mom and they don't', 'my family only cares about my adopted children and treats my oldest son as mere baggage', 'how dare you feel hurt and express that in therapy, we've done nothing wrong you need to understand it's because they don't have a mom'? That bond?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I was with my dad and was notified via text. I knew that things will get even worse for me.", "Honestly switching schools would be easier then doing this for another 2 years.", "If you feel the family therapist isn't helping, ask for a different therapist or just switch to individual therapy altogether.", "Switch schools", "OP’s right. This is a great comparison.", "Next time just open it then donate it to church or charity", "Maybe I'm petty but if this is another year of the same, it's better to throw them in the trash, right in front of them, to make the point as blunt as possible.", "Yes, because people who have been neglecting someone for a decade suddenly change because of one statement.\n\nIf they did, they wouldn't have gotten OP presents, as they requested.", "NTA - However, if the family doesn't/won't see the difference in treatment; then keep a detailed list. Make a Big posterboard with the list of differences and then at your graduation party post the list for all to see. Example: OP: gift received from Mom socks vs Step-kids: Mom gave them iPhones .... OP: parents that came to play/event #1 - ZERO vs Step-kids: Parents that came to play/event #1: Mom and Step-Dad. OP: Event #2 - ZERO vs Step-kids event #2 - Mom and Step-Dad ... OP: birthdays forgotten by Mom - vs Step-kids ... etc. etc.", "The best kind of gifts are the ones with strings attached, aren't they.\n\n'Oh, this is for you but it's not really yours it's still ours expect to not being able to treasure it in the future'", "Any chance it can be sooner?  They don’t deserve the privilege of having you around at all.", "Totally understand! Have you tried talking to you mom about this privately over the years? Or to even your grandparents? You definitely don’t come over as entitled or selfish, but I believe they’re completely being disrespectful to you and your feelings! Sorry! Hopefully the next few years goes fast you! And you could keep this “no presents” thing going until you do move out to prove your point!", ">My mom hates my stepmom because she had affair with my dad and now thinks she is stealing me too. Nobody knows I know and I can't express that in therapy\n\nCan't you ask to speak to the therapist alone at the end of an appointment? It really is something you should talk about. Also, write down in a notebook all the times when favoritism has been noted, along with your feelings at that moment, it is something a friend did in a similar situation and it helped her a lot. She also left a copy to a lady from the church that her family went to as revenge, you could do something similar.", "So you refuse to have any relationship with your step-dad and still expect him to spend money on you like he does his own kids? I'm definitely not saying it's right to treat one kid differently, but at the same time... you are the one making sure to separate yourself.  So maybe it's both parents paying for your adopted sisters things and your mom paying for yours? Just another way to look at it. You choose to alienate your mother and her family emotionally and then get upset when they don't give you enough material things. Don't you think this is a problem? \nESH", "So you went into this whole new family situation being a giant a-hole, but everyone is against you?  Good grief.  Again, you are expecting twice as much as the other kids in the family get.  Meanwhile it’s pretty obvious that your behavior towards all of them is lousy.  You “only” get to go on one vacation with them?  Aiyiyi.", "Yup, this seals it, you really are TAH, and a SUPER entitled one at that.  If your mom spent $200 on you and $200 on the other kids and your dad also spent $200 on you, I guess you’d consider that perfectly fair.  You clearly prefer your father - I’m guessing you’re the only child in that house?  Eeesh.  Hopefully someday you’ll learn…", "Academically maybe, but it really depends how much they value their school friends.", "Given OP's mom has been treating him like the Less Favored One for a decade, somehow I wouldn't hold my breath waiting for an apology.\n\nMom would need to admit she was fundamentally wrong and treated her own son like a second class citizen for a decade.", ">The only way to win is not to play\n\nmy old butt now has War Games (1983) on the brain...   but that's great advice for family conflict AND nuclear war", "FR it’s like being treated as a second class citizen", "That would not be such a strong and powerful message", "If OP was an adult, I'd agree, but it's parent-child politics", "OP didn’t (and doesn’t) want another father. They didn’t say they weren’t willing to have any type of relationship. Don’t twist things and be cruel.", "Where did op said they expected the stepfather to buy gifts? Are you the mother and trying to claim to be financially tied to the husband on a way that can't even spend money on the older child?", "Actually, I have 3 stepsiblings and 2 half siblings in my dads house.\n\nYes, it would be fair. Right know my mom spends 200 on the other kids, their dad spends even more on them (I get nothing from him), maternal grandparents spend as much as my mom on them (I get nothing from them) and the rest of maternal family spend as much as my mom on them (I get nothing from them). And so, my dad has to spend 3x as much as my mum.\n\nAnd yes, I prefer my dad.", "We don't know what kind of gifts the father is giving them. The father isn't buying them game consoles and expensive electronics. But the adopted children are getting those gifts. Then there's a problem.", "The fact that she adopted the kids. That means she's spending a portion of her money on them. Also there's no indication that the father makes up the difference.", "This is true but two years of being miserable is hard. I don’t think there is any right answer for op.", "Good point.", "There’s tension in the house because this kid has been such an a-hole in the past that he traumatized his step-siblings.  His DAD had an affair and he calls that woman “mom” but won’t call step-dad “dad”.  He’s an entitled brat.", "Nta ask your dad to go for full custody your mom is clearly made her choice. You are old enough to make yours good luck stay strong", "NTA.  You choose whether to open the gifts or not as this is for you alone to decide.  She has been placing you third compared to her step children and it has now caught up to her.  Hopefully this will wake her up and she will at least treat you equally from here on out.", "NTA They mistreat you! It is too much. You did the right thing. Your mom is crying because she is like - wow, I really hurt him and I am his mom.", "NTA. I hate the holidays. For me the holidays are a time for me to do something mundane and ordinary that made my mother have a meltdown and everyone hated me for making her cry. It took me several decades to get where you are.", "NTA. Can you go live with your dad, an aunt, uncle, or grandparent until you’re 18? I know it would be a big change, but it may be for the better.", "NTA get them a pair of socks next year and say Merry Christmas.", "NTA", "NTA Your mom is crying because either 1) she thinks she can manipulate you with tears or 2) because she realized her crap behavior actually will have the consequence of you hating or at the very least not respecting her or 3) because she is defending the man she married who choses to treat you that way and she is a doormat in their relationship and realizes that not having a spine may lose her her child. I certainly hope you don't buy them anything.", "NTA-\n\nInitially I misread your age and thought you were an adult. Obviously you’re not so you’re still in the thick of this and you’re a kid. (Not trying to be condescending at all- I just understand you being hurt more now that I realize you’re only 16. It would be far different if you were a 30 year old complaining about your step siblings getting more gifts.) \n\nPlain and simple- kids need to be treated equally. I understand the others lost their mom and yes that sucks BUT that doesn’t mean you get put on the back burner as a result. If they need extra support, then your mom and their dad should’ve arranged for therapy, grief counseling, support groups, etc. They should have invested in family bonding and counseling to strengthen everyone’s relationship with one another- instead they chose to focus on these other two children and not give you the same amount of attention & love. That’s not fair. \n\nYour feelings are valid. Your reaction was fair. You told your mother a mom in advance that you didn’t want gifts from them anymore because of their actions & how they’ve unfairly treated you. She chose to ignore that wish and well, she has to deal with the consequences. You’d already tried talking to her about the imbalance in how you’re treated and she ignored that too. \n\nI get your dad wants to keep the peace but I’m this situation it’s not feasible. You deserve to be heard and you’re allowed to set boundaries to prevent yourself from being hurt further. \n\nI’m sorry you’ve had a rough Christmas after a rough birthday.  I truly hope your new year is far better!", "NTA. It wouldn't have hurt them to treat all children equally. You didn't ruin their Christmas but they did that themselves.", "NTA. No one should ever feel less loved than their siblings/step-siblings/pretty much anyone really, and definitely not by their own parents.", "You're quite possibly one of the worst cases of AH I've ever seen on the sub. You need to dig deep into your own issues with yourself, considering the hate you have for your mother, her adopted children, and their father. But you provide no reason other than ones you yourself have caused, you alienate yourself from them, you treated the adopted children horrible by your own admission, and you have never wanted a relationship with their father. You provide no reason why you dislike them, why you were unhappy they were adopted, nor do you provide an explanation as to how you are treated lesser. All of your comments are excuses and you are just telling yourself and others what you already want to hear. Give up, stop going to your mother's, and stop ruining her and her new children's lives. Its disgustingly selfish, which is the most prominent trait you've shown throughout your entire post. YTA", "Don’t go to your moms anymore.", "NTA- dude I sympathize my little bro was always the golden child and littler sister was the baby... they got everything they ever wanted. Clothes, toys, activities.. god forbid I needed a third pair of pants, a second pair of shoes, or a winter jacket... usually had to embarrass them by telling relatives that would just gaslight me so we could all play happy family... my parents made over $250k for context. Stick to your guns and strive for independence, always have your next step planned out!", "NTA", "I understand why you were hurt and why you wanted to stick to your guns regarding gifts, but I kind of wonder if maybe what you’ve been saying finally really sank in this past November, and they got you some really nice gifts this Christmas. Maybe that’s why everyone’s pushing you to accept the gifts. And maybe your Mom is crying because she realizes that this gesture may be too little too late. \n\nUp to you whether you stay away until January or ever accept the gifts. But maybe write them an honest, open letter explaining where you’re coming from. Own up to your issues and bad behaviors (I’m sure there’s a lot you’re not mentioning here). And tell them you’d like to explain. Say that you understand that when your Mom married stepdad your step-siblings were toddlers who lost their Mom and that this was horrible. But that they seemed to forget that you were only 6 and your life had been turned upside-down too. Tell them you feel like you’ve been lowest on the kid totem pole since then, and, because of that, you felt like you were losing your Mom a little too when she decided to adopt them. Tell them that feeling less valued and less seen than your siblings has really hurt you deeply, and it’s hurt for so long that you feel like your heart has started to harden and like you just want to lash out sometimes. I think if they have time to sit with honest, heartfelt written words from you for a while, they’ll understand and try to make things better. Good luck!", "NTA", "NTA.", "NTA but with all the fuss about opening the presents I am wondering if they have made more of an effort and have attempted to go the extra mile this year to try and fix things (to little to late imo), otherwise I don't understand the fuss they are making about opening them. You had made your point very clearly after your birthday. They may also think that you technically get a seccond Christmas/ birthday etc from your dad so they can skimp on your gifts as you get from the other side of the family too. Next time you see them remind then your name isn't cinderella and you don't expect to be treated like a 2nd class citizen, that you are very sorry for what has happened to your step siblings in their life but your parents treating you differently to them is putting your relationship with them in A negative place and that you may not have physically lost a parent but that is how you feel when you are treated differently to them.", "NTA- good for you.", "NTA.  If the gifts are there.  When you return.  Tell your mom.  You will open gifts.  When. And only when.  You are treated equally.  Until then.  They shall sit unopened.  Then carry them to your room.  Sit them in a corner.  And let them sit.  Every time she says something.  Reply.  When I am equal in your love.  I will respond in kind.   \n    \nIt will get the message through.  Very.  Very. Clearly.", "Going against the grain to say NAH. \nIt’s hard when you are a kid to feel empathy, but it would be good to try and think about what it must have been like for a 4 and 5 year old to lose their mother. And parents aren’t perfect, they are human. And your mom probably didn’t know how to handle two small girls grieving for their mom and may have overcompensated, especially since you at 9 would require less hand holding than a 5 year old. From your post it seems that you resent the girls and that your mom favors them. But I would say make sure your anger isn’t misplaced. No, it’s not ok if your mom doesn’t treat you well and you have a right to communicate your feelings, but I would encourage you to try and see the situation in a different light", "YTA but justifiably so.  Probably a little over the top reaction, but you had told them you didn't want any gifts and why. Whether your concerns about the gifts had been addressed this year you wouldn't know unless you open them.  \n\nAnd the excuse about their mom,  while tragic, isn't an indefinite excuse to treat OP less than.  With OPs own mom not seeing the irony of pushing her own child away", "YTA, jealousy is a very petty emotion. you should resolve this with your mother, with a therapist if needed.", "YTA.  At your age gifts are expensive.  What did they give you?  A little kid wants $15 dollars.  Teens want 300 iPads or other items.  Your going to get less but more expensive.  Everyone, including your dad is telling you to stop it.  Could you be any more of a spoiled brat.  I am assuming you were an only child until now.  Now your having a hissy fit.  If I were your parents (mom, stepdad and dad) I would take you at your word.  No presents until you can apologize.", "Exactly. This is really good. I’m sorry that you are dealing with this op. Good luck.", "This right here, the step dad chimed in and was very ugly saying bio dad cheated on mom… so it sounds bitter, and they’re taking out their bitterness on OP. But it seems step mom treats him better than step dad.", "I will move in with my dad the moment I graduate from high school.", "So, not to be the wet blanket, but I'm a lawyer and it's a super common misconception that kids hit a magic age where they get to choose whose house they live out. Not saying your sentiment is wrong, but just want OP to know that dad filing for full custody isn't a magic bullet.", "Idk if I had to choose between my mom dying vs my mom adopting 2 kids and giving them attention, I know which I'd choose and don't think it's a particularly hard choice.", "The father cheating has zero to do with the child and the mother taking it out in the child because they accept the new wife is horrible. I hate cheating and think the situation is horrible but not the child's fault and the child should not be penalized for it. Mom and her family should treat all kids equal. They should go to their plays as often as they go to the adopted kids games. This is a child and should be treated fairly by all family!", "Whoa !  Settle down.  Are you the mom ?\n\nCause you sure are acting butt hurt about this whole situation.\n\nIt does not matter what his father and step mom get him.\n\nHis mother and step father are making him less than a member of the family.  Unequal.\n\nAnd that is wrong.", "Um…how did mom ignore him? She got him gifts despite him crying about wanting more expensive things for his birthday.", "Because this kid is TAH.  Calls dad’s new wife “mom” even though dad had an affair with her, yet refuses to call step-father “dad”.  Treated step-siblings like crap.  Resents “only” going on one vacation per year with them…. Good grief.", "It means step dad and mom treat him equal to his step siblings.\n\nDoesn’t matter what any other family gets him.  He is still and equal in THAT family dynamic.", "Are you kidding me?  NEGLECT?  For not getting as many Christmas presents, when he will be getting plenty more with Dad and new wife whom he calls “MOM” even though she had an affair with the dad.  Meanwhile kid won’t call step-dad “Dad” and said such horrible things to step-siblings that they had to go to therapy.  Sounds like this KID is the abuser.", "Well father apparently showers him with gifts - probably to make up for the fact that he had an affair with the woman this kid now calls “mom”.", "OMG, it’s not an abuse tactic!  This kid gets more gifts than the other kids because he has a father giving him tons at his house.  This kid calls step-mother “mom” even though his father had an affair with her.  He refuses to call step-father “dad” and treated step-siblings like crap which he admits most likely traumatized them.  This kid is an entitled brat.", "This bratty kid calls his step-mother “mom” despite the fact she had an affair with his dad.  He refuses to calls step-father “dad” and admits that he caused trauma to his step-siblings.  He clearly resents that his mother was able to move on from his father’s deplorable actions.  He gets PLENTY of gifts in total between the two parents.  His own attitude and actions are what cause tension in his home.  He is the one who should feel guilty for being an entitled a-hole.", "But OP is also getting 2 Christmas' so are they not getting anything from their father, or does it work out to be about the same including both?", "Yes, all of this.", "NTA\n\nChange schools if you are able to. You can always make new friends if that’s a concern.", "Sarcasm: I love how you are supposed to be grateful to consistently get gifts of less value.\n\nIn truth, I love your solution. You got your point across and avoid the disappointment.", "I feel so sad for you that your own mother is putting her own step (adopted) kids above you and not at least treating you all equally. Hope you've had an amazing Christmas with your father.", "I am glad to hear you are in therapy. It doesn’t sound like it’s helping to open their eyes but hopefully you will get some good out of it.", "[deleted]", "No they get OP the bad soup. While they give step kids the good chicken noodle soup", "What are you on? Seriously what are you inhaling?", "There have been studies that even dogs notice unequal treatment when treats are distributed", "That's the best option for everyone.", "NTA, and OP, please communicate this privately in a session with your therapist. **Your mother is likely abusing you by holding you accountable for your father’s infidelity.**", "I just wanted to point out that your birth mom saying that step mom is stealing you away, but actually your birth mom is pushing you to your stepmom and dad with all the playing favorites and not caring about you.", "I am glad that you found a new mom and she treats you well.", "“Gaslighting” is only present if lies are being told.  We have no idea what’s being said in therapy.  Based on OPs admitted behavior in the past, it’s tough to think that he’s some angel now.", "You’re pretty determined to hate your mom no matter what, so I can’t really see how it makes much difference.", "How did the kids feel about it?", "Yeah, I’m not seeing much other than a teenager complaining about what he wants. No actual facts supporting any neglect by mom. No incidents of mom speaking badly to him about his dad - Even though dad is the one who cheated. \n\nFunny, if mom and stepdad had Follower OP’s demand not to give him any gifts, he and everyone else would be saying how awful it is that he was left out.", "What is your issue with this kid?\n\nSo the stepmom had an affair with the dad. She still treats OP the same as her children. She shows him more love than his own mom does, so she has earned the title of \"mom\" from him. The stepdad doesn't treat OP like his own child, so he's whatever his name is. *Their respective actions towards OP have determined their titles, not how their relationships with his parents started.* OP was at most 9 when his mom remarried; maybe cut him some slack for not reacting perfectly to his stepsiblings? And as for the only one vacation, if you think taking one vacation per year with the whole family justifies purposely excluding OP from all other vacations they take during the year, then I think you might be OP's mom, because no one with empathy would think that's acceptable.", "I agree. After reading just the op, I was completely 100% on his side. But his responses here shed a different light on the situation. They welcomed him, wanted to be his stepfather and siblings but he refused by saying terrible things to them. Only after that, after he decided to ignore them and shit on their feelings, they started to neglect him. He also never said, who pays for the gifts. Is it his stepfather, who he never cared to build a relationship with? Go to your dad kid and stay there, let your mom, stepfather and step-siblings get some peace.", "He admits that he traumatized little kids who had lost their mom. It’s gross.", "Man you really have it in for this kid.", "Or maybe to make up for the fact that OP has to watch his stepsiblings get gifts from their dad, his grandparents, and his mom's extended family (all of whom give OP nothing) in addition to the better gifts they get from his own mom.", "The affair is about adults...not the kid", "True! If possible! Or how about family therapy to teach parents the benefits of fairness?", "I went to 3 high schools (military family); it was hard but I got involved in school activities and made friends. And that was before cell phones and social media!  Move to your dads house where you will be treated with the love and respect you deserve.", "I keep seeing people using the 'reverse victims' tactic on this sub and it's heartbreaking. Like as if OP has to pretend this ruse is all well and good, with no pain, or be branded the villain. The family falls in line as enforcers. NTA and I hope OP can live on their own as soon as possible.", "I was wondering the same about you.", "Well is the money the new husband’s or hers? Maybe the mum only has that much to spend? Also, OP is getting gifts from two sets of parents, the kids are getting gifts from one. So is OP expecting to end up with twice as many presents as the new kids?", "The kid was like 9, not a teenager….", "yeah what’s your point? pretty sure a “family” who cares less for a kid and throws a fit because they refuse to play with their game doesn’t have to lie. angel or not you don’t get treated like less than, you’re either projecting or just being a jerk", "You said you’re a mom, so you understand kids change over time, so you think this kid hasn’t changed in over 8 years?", "Excellent point. Then he’d have been here asking “AITA because I asked for no gifts and my family listened to me?”", "If the OP is with his father for the Summer (for example) then his mom shouldn’t go on vacation then?  Or any other time the OP is with his Dad?  It’s not like they’re leaving him home alone.\n\nMy issue with this kid is his entitlement complex.  He has given no or very little indication that there is favoritism at play here other than the gifts and vacations and furniture - which we have no idea what that even means.  Nine is old enough not to say something so horrible to another kid that, by his own admission, it caused them trauma.  It’s very easy for him to complain about the family he spends the most time with - you know, the ones who are doing the daily grind, day in and day out - while spending all the fun time with the other family.  The fact he can’t see that is part of the problem.", "Since mom and stepdad have no part in providing what OP gets at his dad's house they should not get to use the value to offset their gifts.", "True enough, but my point is that the OP is fine to call step-mother “mom” but not step-father “dad”?  but cites no reason why other than he simply didn’t like that his mother re-married.  Apparently he puts rules on his mom that his dad does not need to follow.", "When your family Xmas is like Global Thermonuclear War...", "So do you still think OP is the ah?", "What the other set of parents give OP isn't really relevant, though, because all they're asking for is equality from the one set.", "Yes, and I can give him a little bit of a pass for his initial reactions, but apparently he never changed his attitude or behavior, and now he’s 16 and surprised that things are strained?\n\nHe also says that he’s spoken to his mother about this issue and she’s explained things to him but he doesn’t like her explanations, so he’s decided he’d rather be a brat instead.  He hasn’t told us what those “excuses” are so how are we to know if they’re valid?  I mean I’m sorry, but only a brat says, “If I can’t have what I want, then I want nothing at all!”", "But kid is fine calling dad’s new wife “mom”, even though she’s the woman dad had an affair with…", "He did say \" don't really have a relationship\" with them . Also that he said hurtful and traumatic things to the kids. That's not twisting anything", "So if the girls are getting gifts from their father and adopted mother= 2 parents paying for those gifts\nOP says they get gifts from mom and stepfather that are worth half what those same adults get for the girls. So...that half is moms equal contribution to all 3 of her kids' gifts, right? \nIn addition,  OP gets additional gifts from his father and stepmother (who he favors and calls mom over his own mother) . I mean at some point in life, OP will have to learn that you can't just treat people like trash and still expect them to give you everything you want", "The OP is the one who chose to be a brat and not open gifts which were given to him.  He placed an UNFAIR ultimatum upon them.  He was basically threatening them to get his way.  “Give me what I want or give me nothing at all” is an a-hole move no matter how you slice it.", "Well he still won’t call step-father “dad” and sounds like he’s still resentful over the whole remarriage, and says he still has no relationship with his step-siblings on that side, so yeah, it sounds like he hasn’t put much effort into changing his attitude.", "Is your mom and her family aware  that you plan on cutting them out of your life for good? I don't see how they think what they're doing is right and fair.", "Your dad doesn’t “have to” do anything. Your entitlement is over the top.", "So you prefer the man who had an affair.  If you aren’t getting gifts from other members of your mother’s family, then perhaps you should examine why that is.  Perhaps you’ve been just as bratty to them as you have been to your mother, step-father, and step-siblings.  If things are “tense” then it’s likely due to YOUR behavior.", "Yes...I agree something is missing", "I switched schools in my sophomore year of highschool weird at first but it was a great experience. Do whatever feels best OP!", "And they just keep calling you even though you took your phone off the hook.", "You know what's weird? Reddit has shown me that some moms actually try that! They cook with rotten stuff or allergens and still sob when kids refuse to eat their food. I never understood how people can know they're doing something bad yet they want others to act like nothing is wrong.", "Absolutely.", "The 16yr old has Christmas at TWO houses and gets plenty of gifts!  I am mind-boggled that people aren’t seeing how entitled this kid is acting.", "How isn’t it? New siblings get presents from mum and dad, as does OP. Only OP seems to expect the same amount of presents from one parent compared to two. And we don’t know if the money comes from mum’s husband or mum", "Explained that they get better gifts because their Mom died isn’t a valid excuse. She is their Mom, she is just using that orphan stuff as an excuse to treat him like crap. How can a mother ever treat a child different from other kids is beyond me. You’re the mother of two. If you married a man who’s wife died, would you seriously treat his kids better than your own? Would you attend all of their games and shows but not your own child’s? I mean this is beyond gifts. This “mom” hardly attends games and shows, and I bet it’s because dad is going to be there.  That is what OP is going to remember, not the gifts, it will be the never supporting their activities. THAT is why OP is not the AH. As a Mom you should be disgusted with that.  I would be angry too… in fact I still have issues because my Mom hardly came to any of my ball games, that is what I remember.", "Sure. Probably because step mom never forced it and it happened naturally. Especially because OP’s mom seems more into the new family than OP, but that’s just a guess.", "Are you conveniently forgetting the grandparents?", "Op said 'treat me equally'. They still are not so he's checked out.", "that’s not an ultimatum, OP said if you can’t treat me equally don’t give me anything at all. what does OP gain nothing", "Are your parents divorced? Have you ever been through a similar situation. Kids all handle things differently. I bet there is a reason why he resents his step dad, and I’m sure it’s not all about the kids. I bet something was said, something telling, something no one would believe OP about. It still isn’t an excuse to give less and not show up for your kid. “Hey old kid, we’re not giving you an equal amount of love because my kids don’t have a mom anymore and you have a dad and another step mom. You already have more you don’t need to be loved as much as these half orphan kids.” That’s what it boils down too. The half orphans get more love than broken home kid because broken home gets two homes. That’s messed up.", "My mom's family hates me because of my dad. I don't want to tell my mom because there will be drama.", "They hate my dad and are punishing me for his mistakes because I have his blood in my veins and look like him. It started even before mom met her husband. They are doing this to hurt me because they know this is their only way to hurt my dad.", "Found the Mom", "So you know this kid… you must be step dad?", "It's the victim complex. Some people get a high of thinking/being the victim. So they try to make everyone around them be an \"aggressor\" so they can go \"woe is me\" for the 200th time", "Why?", "But one of those Christmas's involves seeing how low on the totem pole they are to the woman who brought her into the world as opposed to her half siblings", "Not entitled, he sees what’s being given to his sibling vs the value of what’s being given to him. He feels under appreciated, like they “have” to give him something vs they want to give him something. All kids should be valued equally from the beginning if you give siblings be iPhones and op a $20 track phone that makes him feel undervalued and then they get mad because he doesn’t appreciate the cheap phone. If he was acting out in the beginning then it should have been a sign to help him, not treat him different.", "Their concern was about their step-siblings getting more gifts,  which could extend to birthday presents as well. But fails to say the type of gifts. I assume they do mean higher value as well. \nBut you are right, OP is going to two Christmas' so OP could be getting the same number,  just spread out over both families. \n\nThis doesn't address their feelings of less attention though", "Because they're two separate families? It's not OP's fault that they don't have two sets of parents. Withholding gifts based on something OP can't control is really shitty. \n\nThink of it this way - let's say there are two brothers and they each marry someone and have kids. For one of them, the parents of their spouse died young. Would you say that the parents of the brothers should give the other grandkids less based on the fact that they have four grandparents instead of only two?", "Considering OP doesn’t live with Dad, it’s pretty easy for him to say everything would be flowers and rainbows over there…", "That they said OP was acting ungrateful? That's all I saw about them. And he was.", "He actually has no idea if they treated him “equally” for Christmas.  However, he really has no right to make such a demand while seemingly making no changes on his end, especially since they have explained why he doesn’t get as much.  He says he doesn’t buy the excuses but we haven’t been told what they are - a very valid one is that he’s getting MORE presents at his Dad’s house, so he’s going to end up with equal or even more gifts.", "Actually it’s a particularly conniving ultimatum because whatever his mom does, he’d find fault with it.  Guarantee that if his mom hadn’t gotten him anything then he’d be here saying “AITA for being upset that my mom got me nothing?”", "OP you need to tell your mom. All of this, and if you feel more comfortable doing it at family therapy then do it there. Explain everything about how you feel, maybe write it down or type it up somewhere they cannot find it first to help you collect your thoughts. Good luck!", "You’ll have to forgive me if I find this totally unbelievable.  However, you have stated that you favor your father, treat your mother, step-father, and step-siblings poorly, and I’m guessing that doesn’t win you any points in their eyes.  There’s a saying that if you have a problem with everyone you meet then you might want to look at your own actions.    \n\n\nCan you HONESTLY say that you are a good son when you are with your mother?  Mothers try their damnedest to treat their kids equally and to let slights roll off their backs because “kids will be kids”, but mothers are also only human and eventually being constantly slighted and seen as the second-tier PARENT takes a toll.  The fact that you choose the man who CHEATED on your mother as your favored parent says an awful lot about you, and it’s not good.", "Nope.  And anyway, you’re forgetting that he LOVES his step-mom.  That’s a huge part of the problem here…", "Nope, not at all, but for some reason this OP has really gotten to me.  Maybe it’s because I’m mom to kids who are only a few years younger and who would never in a million years act the way this kid is acting.  All I can think about is how horrible this kid’s mom must feel.", "For all of the reasons I already stated above.  Why do YOU think he’s entitled to ”equal” presents or NO presents because he decided to be a brat?  Christmas presents aren’t actually mandatory.  Seems to me there was a whole “naughty” vs “nice”.", "And one of those Christmases is spent with the man this kid (who is a boy) favors over his mother despite the fact that the guy had an affair with the woman this kid now calls “mom”.", "They put him in therapy.  He’s no longer a “kid” in my opinion.  He’s 16 and old enough to know that his behavior has consequences.  His mother knows that the father will overcompensate, so why should she reward his bad attitude?", "They mentioned “only” getting one vacation (I assume he’s with his dad during the other/s) and something vague about going to the other kids functions, but no mention as to how many of his own they missed or if his dad went to those, or if only mom or step-dad went to the other kids’ functions.  On that one I’d have to know more specifics.  I mean I go to all of one of my kid’s dance recitals - because there are only two or three a year - and miss some of the other kid’s track meets - because there are ten to twelve a year.", "Don't you think is stupid to comment on something you haven't read?", "What happens at Dad's has no bearing on this situation. He is mums child and so should be treated by mum and stepdad as equal to the other children - presents, time, affection, attendance at school functions. He has every right to demand to be treated properly and equally. \n\nIt has been years of not being treated equally and being hurt so now he's decided to simply check out. He should have been treated correctly from the start. \n\nPoor kid.", "\"You’ll have to forgive me if I find this totally unbelievable\" \n\nI find this totally believable as I've seen it many times.\n\n\"However, you have stated that you favor your father, treat your mother, step-father, and step-siblings poorly, and I’m guessing that doesn’t win you any points in their eyes\"\n\nPlay stupid games and you'll win stupid prizes. If the OP keep seeing how his mother keep favoring her step children over him, she can't blame him now because their relationship is strained.\n\n\"Can you HONESTLY say that you are a good son when you are with your mother?\"\n\nCan you say different? \n\n\"Mothers try their damnedest to treat their kids equally\"\n\nA terrible generalization, specially when again it's not weird to find biased family relationships when parents are divorced.\n\n\"The fact that you choose the man who CHEATED on your mother as your favored parent says an awful lot about you, and it’s not good\"\n\nThe fact that an entire side of they family is taking it against a child so they can punish his father says awfully a lot about them, and you seem strangely concerned that the OP is not playing moral judge about his father infidelity. If he can forgive him, who are you to say the contrary.", "How do you know he loves his step mom?", "But this kid was dealing with a lot, and it seems to be that they didn’t want anyone extra and everyone just assumed they would get over a new person. It likely took time for SM to gain trust with Op before he called her Mom. I’m a mom of two also. And idk how my kids would be in this situation. I know I would be concerned with them more than anyone else until I knew they were ok with me dating. The way kids see moms is different than Dads and that has to be noted. Mom fumbled, and felt more for the half orphans than her own son. He feels under valued. Or, they’re over valuing the half orphans because they feel bad for them…. That’s a big possibility too.", "He never said anything to his step siblings. The reason their in therepy is because their mother died. And yes wouldn't you hate the afct you've only been on one of the 5 vacations your mom and your step siblings go on every year. And why should he respect his stepdad when the step dad doesn't even like him. And he's not asking for more gifts then siblings. He's asking for equal gifts. Like say your brother got a PS4 for Christmas but you got a PS2. Youd tell your parents to at the very least they shoulda  have gotten you a PS3", "That doesn't really track--if they make it to all of his stepsiblings' games but not his plays, I *promise* there are fewer plays than games.", "We have no idea how he was actually treated vs how he chooses to remember or retell it.  Let me ask you, if he hadn’t gotten any gifts - per his request - and had then come on here complaining about it would he have still been NTA in your view?    \n\n\nI totally disagree that what happens at dad’s has no bearing on what happens at mom’s.  Apparently this kid sees his parent’s divorce as his windfall - double everything.", "We have no idea why that side of the family may (or may not, we have no idea) be biased against the OP.  My whole point is that it may have nothing to do with his father and everything to do with his own behavior towards his mother.", "In comments, OP says that his stepsiblings tried to treat him like a brother and he rejected them and said things mean enough to them to traumatize them. This doesn't align with the theory that that whole family only treats him different because of his dad.", "He specifically said in another post that he considers his step mother his mom now, calls her mom, and apparently has no issue with the fact that she had an affair with his father.  I honestly don’t blame her as much for that - I mean dad was the one who was married - but I don’t see how the kid can favor the man who cheated on his mother, be okay with that whole extended family, but then turn to his mother and not accept that she’s found some amount of new happiness.  The kid flat out said he resented that his mom adopted his step-siblings and that he said such horrible things to them that he traumatized them - HIS words.", "Or OP is misreading normal interactions from a lens of resentment.  Also a possibility.", "No, he said in another post that he didn’t like when his mother married his step-father and he said some horrible things to his step-siblings which left them traumatized (they had been excited for an older brother).  You need to click on his user name and read all the replies he’s written.", "Yes because he is reacting towards years of neglect and favouritism, neglect and favoritism that should not have occurred in the first place.\n\nOp is 16. He's spent years watching his mother prioritise his siblings over him, his step dad not get him anything, his mother's family blame him for the sins of his father. He is stuck in a horrid situation and it must hurt him so much and he's still so young.\n\nEdit: nice edit\n\nHis treatment at his father's is not necessary to this as it is about his mother's. Whether he get 25 gifts or 1 at Dad's hasn't bearing on the fact that mum and stepdad should be treating him equally to their other children from the start"]}