{"id": 5753, "submission_id": "zw0cxr", "title": "AITA for not letting my brother tell our family that he is gay?", "selftext": "The story is very simple, my younger brother is gay, he is 17 years old and I am the only one in the family who knows (it's just the two of us and our parents, we have no contact with the other family members) and he didn't intend to tell me , I figured out why I caught him flirting on a call with a friend about a year ago, to be honest I took it in stride but advised him not to tell our parents for the time being, our parents are extremely conservative, and my father already made several statements at family lunches saying that he thought gays had some kind of disease or something, I said that I would help my brother, but we would need time to make our parents get used to this idea, since then I've been having sporadic conversations with my dad to try to get the idea into his mind that it's okay to be gay or whatever, and I believe I'm having results, my dad has stopped the homophobic statements at family gatherings. ares, the big problem is that about 4 months ago, my father was diagnosed with prostate cancer in an advanced stage and without cure, my father is currently under palliative care, and fearing a premature death of our father, my brother wants to speed up the process and coming out as gay to our dad soon, I strongly advised him not to do that as the shock could be too big for our dad and it could affect his illness in some way, now my brother thinks I'm sabotaging him and I'm ashamed of him for being gay, he said I should just support him as a brother, and that the decision of when he tells our family he's gay needs to be his and not mine, we haven't spoken in a week, AITA ?", "created_utc": 1672097689, "permalink": "/r/AmItheAsshole/comments/zw0cxr/aita_for_not_letting_my_brother_tell_our_family/", "score": 176, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I need to know if I was an asshole advising my brother to hide his gayness from our family (2) whether that would be shame on my part, or insensibility\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA.\n\nIt will not be your brother's fault if dad dies. It won't be yours either. But it would be your fault if your brother has to grieve the loss of his father knowing that he was never able to tell him something that is extremely important to him. He will always wonder whether he would have had his father's approval, and this may be something that becomes damaging to his mental health down the line.", "Gently, YTA. Your brother is right, the decision to come out belongs to no one but him. Your intentions are coming from a good place, you’re concerned about his being accepted and not hurt as well as putting stress on your dad. But it is his decision when and with whom to share his identity.", "My condolences.\n\nIt is *entirely* your brother's choice about how he comes out as gay. How that affects your father is mostly up to your father. I would hope that your father's impending death would give him a better perspective on the trust that your brother is showing him by coming out. You have no way of knowing any of this, or how it will affect anyone but you.\n\nLet your brother be himself. His true self. YTA", "Soft YTA. Your intentions are good, but this matter is between your brother and your dad. The best thing you can do in this situation is support both of them.", "YTA. You don’t get to decide when someone comes out.", "INFO\n\nYou said:\n\n> I caught him flirting on a call with a friend about a year ago, to be honest I took it in stride\n\nTook what in stride?", "YTA. I didn't tell my dad I was trans because he had heart disease and I was afraid of \"speeding it up.\" He died knowing that I was hiding something from him but never knowing what. I regret with my whole being not telling him before he died and trusting his love for me.", "YTA. After a certain point, you rip the bandaid off. Meanwhile, you've been telling your brother to keep quiet, keep hiding, stay in the closet.\n\nYour dad is not going to explode.", "YTA, but I know this sucks and that you're doing your best to keep things together. That said it's not your decision when your brother comes out, and think about what this will do to your relationship with him when your father is gone. You can't fix your dad's bigotry, but you can make sure you and your brother stay close and can trust each other. Be honest with him, explain your reasoning, but I implore you to let him have agency and support him.", "YTA, it’s your brothers journey.  You can help him by identifying LGBTQ resources, counseling, individual and family support groups.  It might not go as well as he wants.", "YTA, although your intentions are good.\n\nI have a good friend who is gay and never told his dad because he believed his dad was homophobic. It affected their relationship until the end. He never told his dad before he died and to this day he regrets not telling him.", "YTA You can't decide when, how or if anyone comes out. It's not your choice.", "YTA coming out should be when HE is ready, and not about anyone else. Back off.", "YTA. It's not your place to dictate to your brother what he tells his dad before he dies. If he needs to share that, then he gets to make that choice.  You don't own your father, your assumption this would impact his illness is wild, unscientific speculation, and you're attempting to micromanage your brother's personal relationships. Simply inappropriate on all counts. Butt out.", "YTA\n\nYou don't get to decide when your brother comes out, even if it inconveniences you or your family member. If you truly do support him, then support his decision to come out to your father. There's no \"right time\" to do anything, and if he feels like it is the right time, let him have his moment. I am queer identified, and I was outed before i was ready to come out, so I fully understand this.", "God it’s funny how these things tend to work themselves out.  It’s almost like the lord doesn’t like homophobes after all.\n\nHot fucking take but if coming out worsens your dads condition in some way, that’s his own problem. It’s 2023, we’re not tolerating anymore hateful bullshit from the Book of Myths.", "YTA. Now your brother thinks he's shameful.", "YTA, this is not your decision to make.  It is your brother’s to make with your advice if he wants your input", "YTA\n\nYour father knows. This is between them. Not your choice.", "I'm hesitant to say yta so please take it in the smallest of fonts.\n\nI can totally see where you're coming from & your brother telling your dad his truth might have an outcome he's not thought of. If your dad is coming to the end of his time (and I'm sorry you are facing this) there may not be *enough* time to sort things out if his initial reaction is very negative which could mean the final state of their relationship is an awful one - which your brother will have to live with.\n\nBut then , as you say, he's ceased to make homophobic comments it may be he's realised your brother (or you) is gay & has already come to terms with it.\n\nTbh is a horrible situation but it is down to your brother & him alone, but you do need to support one another now more than ever. Good luck to you both.", "YTA..I understand you think your helping and it’s a sensitive situation, but in the end your  brother deserves a chance to tell his father who he really is, if that’s what he wishes to do, and I think your dad also deserves to know his son, for real. Your role would be to provide support.", "YTA. I see that you think you are helping, but your brother being gay will not affect your father’s illness in any way. If you love and support your brother, let him know that, and allow him do things in his own time.", "YTA. This is your brother's decision, not yours. Your decision is to either support him with what he chooses or not.", "YTA", "YTA. \n\nI know you are more concerned with your brother's safety, and trying to protect him emotionally. But not only is this not your decision to make, but you are also doing your father a huge disservice.\n\nFrom your own actions, you acknowledge your father's ability to change his opinion. You have already noticed his behaviour change and the decreasing amount of overt homophobia.\n\nYeah I get not wanting your baby brother to be subject to hate or rejection, but by telling him to stay in the closet you are removing his hope for the acceptance & love he deserves to get.\n\nLgbtq kids are ready for the ugliness. We accept its possibilty when we are ready to come out. And if your brother feels ready to take that risk, its because he is ready to deal with the fallout if shit breaks bad. He already has a very good idea of how bad things could be. But he has an older brother who loves and supports him, and right now that means supporting him in this.\n\nSudden shocks are probablu bad for people who have cardiac problems, but a sudden shock is not going to affect your father's prostate cancer. This isnt about your dad's health, this is about you believing your father will react poorly to learning his son is gay.\n\nThing is, as long as your father is alive, he has a chance to prove himself a good father. Maybe he react badly initially, but with declining health and sudden context for all those conversations he's had with his mid about accepting gay people, its likely that he will be able to make it over the mental hurdle and make peace with his gay son. And that literally will never happen if he dies without knowing.\n\nYour brother thinks this might be the only chance he has to have a father who knows him and accepts & loves him as he is. And he knows he might not get that, but to him the potential reward is worth the risk.\n\nLook, maybe your dad is an unrepentant homophobe and a terrible father. But there is a chance he isn't, or that he is willing to learn/change. You shouldn't take the choice away from him. And if your brother is willing to take the risk, you should just try to be supportive. Maybe ask to be there to help defuse the situation, or ask what you can do to soften him up first. And then do what you need to do, to protect your brother. If shit goes bad, keep working on your father to get him to accept gay people. But don't try to keep your brother in the closet just because you don't trust your father to react well.", "Gentle YTA\n\nIt makes sense where you're coming from and what you're trying to protect not only your brother but also your dad from. But no. Your brother coming out will not make your dad worse, and the timeline of his coming out belongs ONLY to him. \n\nHe's right. Support him, but don't try to make his decision for him", "NAH\n\nI can see both sides. You are afraid that your dad will not accept your brother, and that it will cause grief for everyone involved. You brother wants to be accepted by your dad as his authentic self while he still has the chance.\n\nI don't think there is an easy answer here, but ultimately the decision to come out is your brother's, and you should accept and support him whenever he decides the time s right.", "You’re doing your best, but YTA.  Your brother is trying to take responsibility for who he is, and it is very important that he makes this decision for himself.  You can support everyone here, and I think you should.  Talk to your brother; I think gently walking this back and telling him you support him will mean the world.", "YTA it's his choice only", "Normally I would say you’re correct in hiding someone’s orientation to parents but only if there was threat of harm. That doesn’t seem to be the case from the post. Your brother wants to be honest with your father and I think he should. I’ve heard numerous stories from LGBTQ folks that their biggest regret was not telling their parents before they died. I wouldn’t hold your brother back. Your dad is going to pass on whether he has this info or not. This isn’t for him, it’s for your brother. Gently, YTA. But you can make this right.", "YTA \n\nFirst I’m very sorry about your dad… I unfortunately know exactly what you are going through but… it is your brothers choice and if he doesn’t get to come out to your dad he will regret it and eventually you would regret keeping him from telling him. Plus you never know your dad may surprise you…\n\nMy own dad was not perfect by any means. He made some pretty big mistakes but in the end… when he was sick… none of that stuff mattered. What mattered was family and the love we have for one another and all the good memories and good times.", "A gentle YTA. It's clear that you have good intentions and care about your brother's well-being. I imagine this is a very difficult time for you, too. At the same time, your approach takes away from your brother's autonomy.\n\nIt is one thing to encourage your brother to wait to tell your parents until he is an adult / more independent because you know that your dad will react poorly. But it is different when your dad is dying and your brother can't wait any longer. It is likely important to your brother to share this part of who he is with his dad, and he may feel long lasting regret if he never shares who he is with his dad despite wanting to.\n\nFor what it's worth, sometimes terminal illness has a way of changing people's perspective about what is truly important. I certainly hope it does in your dad's case and that your brother feels loved and accepted for who he is. At the same time, be there to support your brother in case the reaction is negative as you anticipate. Ultimately, whether to come out to your dad is your brother's choice to make, and you should support him in whatever decision he makes.", "YTA - I know you’re trying to protect him, but this is HIS decision, not yours.\n\n(Source: was outed by my mom to my uber-conservative extended family without my knowledge.)", "YTA It’s likely that Dad already knows this information. You shouldn’t gatekeeper anything because it has nothing to do with you.", "Yes. YTA. It's none of your business to who or when your brother comes out. And supporting him when he does is something you should do.\n\nThat said, it's understandable to be worried about your father's health; though not so much for your reason. But you should also view it as an opportunity for your brother to Introduce his true self to his father before it becomes an eternal what-if. It was insensitive of you, true. But one of the hardest thing to do is to understand a situation you will never be in. What matters is that you make an effort to.\n\nAsk your brother to tell you why he wants to come out to your father. No judgment, just ask him to help you understand a situation you have no comparison to.", "YTA. When you were trying to protect your brother from your father's homophobia, that was one thing. But now you're trying to protect your father from the consequences of his homophobia, meanwhile potentially taking away your brother's ability to ever come out to your dad, or to have time for your father to repair the relationship if he reacts badly at first. You have no right to interfere with that.", "YTA, he should be allowed to come out whenever he wants to. the trick to getting your dad to be less homophobic might even be that your brother’s gay and he loves him. and if that doesn’t work, it’s still your brother’s decision to make.", "YTA He doesn’t need your permission to be open with his sexuality", "YTA. It’s your brothers relationship with his father. It’s none of your business to interfere with it, especially if your father doesn’t have a lot of time left.", "Soft YTA. Like others have said, I think your intentions are good. However, this is your brother's decision and right now he needs your unflinching support. When my wife and I were  dating, her mother strongly discouraged her from telling her extended family about me, particularly my wife's grandfather. She used the same excuse you mentioned, that his health was poor and hearing shocking news could kill him. My wife ended up coming out to her other family members, but not him, because she was scared about what her mom had said. And then he died, and my wife never got to share that part of herself with him. She will never know for sure if he would have fully accepted her, though we both think he would have. I know this is something she still regrets. And on top of it, it has been years, but she is still angry at her mother for not supporting her and for talking her out of coming out to him. \n\nSo keep in mind that you're ultimately hurting your brother, your dad, and yourself by not being more supportive. You don't want any resentment poisoning your relationship with your brother, which is likely if your father passes and your brother felt that you had gotten in the way of something this important. It's hard to be caught in the middle, but it's between them, and you can't keep shielding your brother by making him hide who he is. Time to reach out to your brother and apologize.", "YTA Your brother wants his father to know who he is before he dies. Don’t get in the way of that.", "Yta while I understand your original plan, the circumstances have changed so the plan must change. Your brother wants your dads acceptance before it’s too late and he deserves that. It is not your place to interfere. as a brother your job is to love and support your brother.", "YTA. This may be your brother's last chance to speak the truth.", "YTA. You need to support your brother ASAP not keep him suffering in silence. Get it together!", "YTA you said your brother wants to speed up the process of your dad dying by telling your dad that’s he’s gray? That’s a horrible things to say! It’s your brothers decision and it may be an important decision that he needs to make while your dad is still alive for your brothers own personal reasons. Stay out of it.", "Is there any possibility that your parents would kick him out the house? He's still a minor. That would be a huge consideration.", "> I strongly advised him not to do that as the shock could be too big for our dad and it could affect his illness in some\n\nif your brother coming out of the closet offs Dad faster, then that's dad's own damn fault. \n\nYTA", "NAH. I'm no doctor but I'm pretty sure it won't affect his illness, but I understand why you would be hesitant considering the fact that you don't want to upset him when he is sick like this, especially since you don't know how long he has left. I also see your brother's side though since he understandably wants to come out to his father before he loses his chance to do so. I don't really think either of you are assholes in this situation, but you should talk about the situation in a civilised way and decide on a course of action like that, rather than just arguing.", "NAH. I understand your concerns but all you can do is advise your brother on what you think is best. Your brother is ultimately the one who decides", "NAH. I get you're concerned about your dad but it really is up to your brother when he comes out, just make sure that he's prepared for the possibility that it might not go well and that you will do what you can to support him whatever happens.", "NTAH but also its your brothers choice to make. You are trying to help, but it really is his choice. Just step aside and support him when you know he is doing it, regardless of the results. \nAnyway on a side note: Por Culero.", "Dude, YTA. I know it's hard to recognize the ingrained homophobia in yourself sometimes, but the idea of \"the shock might kill him!!!\" Is just that, homophobia. Nowhere in this post do you express concern for your brother- no \"I don't want him to get kicked out\" or \"considering comments my father has made in the past I would be concerned for his safety\". Your post is entirely about your father's supposed delicate feelings and making everyone else but your brother comfortable. Heads up dude, your father is a grown ass man who's about to die. Hurt feelings are the least of your, or his, concerns right now. \n\nSupport your brother by letting him lead, then standing by him in action and word. Not trying to \"manage\" his coming out like a controlling pop artists' manager trying to manage their image.", "NTA. \n\nLet Dad die in peace, blissfully ignorant. After Mom's had time to grieve, your brother can tell her.\n\nAt this point, it's not about you or your brother, but about your Dad and what makes him comfortable in his last days.", "Youre not an ahole just in a tough spot. Youre right and wrong at the same time lol you gave your brother your opinion but at this point just let him make his decision. And if it ends up being the wrong choice then thats his to accept.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThe story is very simple, my younger brother is gay, he is 17 years old and I am the only one in the family who knows (it's just the two of us and our parents, we have no contact with the other family members) and he didn't intend to tell me , I figured out why I caught him flirting on a call with a friend about a year ago, to be honest I took it in stride but advised him not to tell our parents for the time being, our parents are extremely conservative, and my father already made several statements at family lunches saying that he thought gays had some kind of disease or something, I said that I would help my brother, but we would need time to make our parents get used to this idea, since then I've been having sporadic conversations with my dad to try to get the idea into his mind that it's okay to be gay or whatever, and I believe I'm having results, my dad has stopped the homophobic statements at family gatherings. ares, the big problem is that about 4 months ago, my father was diagnosed with prostate cancer in an advanced stage and without cure, my father is currently under palliative care, and fearing a premature death of our father, my brother wants to speed up the process and coming out as gay to our dad soon, I strongly advised him not to do that as the shock could be too big for our dad and it could affect his illness in some way, now my brother thinks I'm sabotaging him and I'm ashamed of him for being gay, he said I should just support him as a brother, and that the decision of when he tells our family he's gay needs to be his and not mine, we haven't spoken in a week, AITA ?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[deleted]", "Yta it is a hard burden to keep secrets.You might feel it would be better to say nothing but it can cause many physical issues. Let your brother make his own choice but be ready to help him deal with the fallout", "Gentle YTA - what you have been doing is commendable, but coming out is not your decision to make. It would be incredibly sad if your dad took this news badly, but one would hope this diagnosis would give him a new perspective on life and he would want to leave this world on good term with your brother. It is probably very important to your brother that your dad dies knowing who he actually is.", "YTA - Dying early because your child is gay is not a thing.", "YTA, it’s ultimately his choice to come out, not yours. Palliative care is imminent death, patients in this kind of care are allowed to smoke and drink because they’re going to die soon anyway. You absolutely cannot take this away from him because he’s going to regret it for the rest of his life.", "NTA. you're only trying your best to look out for your brother, so I don't think asshole is an  appropriate term for you, as you've been going out of your way to try and make him coming out as easy as possible. I do think you're wrong however.\n\n I think that your brother is right, and you should just get it over with, I think many parents have issues until it's their child, and he should get to be who he is. Regardless, all you can do is support him as he makes his choice.\n\nBut I'm sorry to that your going through such stress as this so young. Please look after yourself", "Well, it's not that you're \"not letting\" him, I mean he's a sentient human who can make decisions for himself.\n\nBut I think you're in the wrong here, your brother wants to take a chance and hope for a positive outcome of coming out to his father, and you shouldn't get in the way of that.\n\nYTA.", "NTA, \n\nI have to agree with you, the sad truth is that you are trying to change your father's view, slowly, but while he is sick, right now it is best to deal with his illness, and if he is going to die, it is best to hid the fact one of his  sons is gay, because your father may curse him out, ending their relationship, what if that happens and the father dies. that is it, there is no reconciling between them. which to tell you the truth is the worst thing a person have to live with knowing their father hated them and died for the rest of their life. Next is what if there is a will, can your father change the will to not include his gay son? I do not know but it is possible. \n\nTo tell you the truth, tell your brother to stop with this I need to come out right now. and spend time with his father, and make real memories he can cherish before his father possibly dies. and if by chance the dad lives then great he can tell him then, knowing there is time to reconcile.", "When would it ever be ok for you for your brother to come out?", "NTA.\n\nLet your brother know that it is not wise to broadcast his sexuality to the whole world. He may want to. We get it as this is something us men tend to be proud of whether straight or gay, but just don't do it. It's like dudes sending D pics to women. Okay, and? You got a penis. Good for you. You're gay? Good for you. Dudes I swear 🤣\n\nSorry about your pops. Wish him the best.", "I didn't tell my dad before he died that I was gay. I do regret that a lot. In hindsight as his son I should have told him.  But I didn't, and I feel like he died without knowing the real me. But in that moment when he was sick, it didn't feel right for me to come out. I wish I had done it sooner. I also had family members tell me not to tell him which influenced my decision. I don't think my dad would've cared honestly, he would've just wanted me to be happy.\n\nIn the end it's his decision to make, it's a private conversations that involves your brother and his father, you have no say in the matter as it doesn't involve you. \n\nI will go with NAH, as you are worried about reaction of your father and have every right to be, but this may be the only chance your brother can truly connect and be real with his father, something he feels he needs as closure and be authentic. Don't stand in the way of that.", "Your Dad could be very angry at you for hiding this from him. You’ll take the hit.  This is between your dad and your brother.", "YTA...and not a soft one like other posts are giving you. Look at your post.... \"not letting\"? \n\nComing out is up to the person and no one else. You can give him advice on it but he's free to do what he wishes. You're definitely an as&hole for believing you have such decision making authority over your brother's coming out.", "YTA and I think it’s absolutely delicious that this bigot gets to die knowing he has a gay son.", "This, OP doesn’t want brother to rock the boat right now ([which this is the best analogy I’ve found so far](https://www.reddit.com/r/JUSTNOMIL/comments/77pxpo/dont_rock_the_boat/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) of rocking the boat)", "On the other hand, if dad disowns brother over this (which is completely and undoubtedly dad’s fault for being a homophobic ass) and then dad dies, would brother be upset at not getting to spend time with dad during the last few months of his life? \n\nIn theory brother should get to come out on his terms, fuck all homophobes, but real life is rarely as simple. And even if it were dad’s fault completely, brother could still lose that remaining time with dad and regret it.", "And, in fact, he isn't deciding. He is advising. Which he is entitled to do. NTA.", "It sounds like OP has some of his own issues with homophobia. He seems to be trying to understand- but he still has some of his own work to do, obviously.", "Finding out his brother is gay?", "How is it that the OP supposedly has all this influence on his brother, but to think that his brother has any influence on his father is \"wild, unscientific speculation\"?", "HAPPY CAKE DAY", "This!", "Revolting take.", "This. I had a couple friends end up homeless when they came out, and a bunch of friends who decided to stay in the closet until they were financially independent. This was ages ago but it's unfortunately still relevant. I don't know if that's even a factor here, but unfortunately coming out... doesn't always go well. Ultimately, though, it's not OP's decision to make.", "I read that as his brother wants to speed up the process of coming out, due to the diagnosis. As in he wants his dad to know this about him before he dies, not that he’s looking to shock him to death", "Being near death can give people new perspective on what is important in life. People can grow up until their last days. I don't know how the OP's dad will react, but it would be wrong to suggest that a person cannot open up their heart just because they are dying. (It is worth noting that many parents who initially have a hard time with their child's sexual orientation do ultimately come around, so if the OP's dad doesn't respond well, it doesn't mean he wouldn't have ultimately been more accepting a few years down the road.)\n\nAdditionally, OP's dad will only be alive a short while longer. If he's horrified that his son is gay, 1) he's being homophobic, and 2) he won't have to live with that for long. OP's brother, on the other hand, will hopefully be alive for many more decades, and may have to live with regret if he did not share his genuine self with his dad before dying even though he wanted to.", "I think by \"speed the process\" OP means \"speed the process *of coming out*\" but it is very poorly written.", "Info: your brother wants to tell him because he thinks it will speed up the death-is he doing this out of compassion or anger? Or he wants to speed up the outing so your father knows. I read it both ways.", "Just because he's entitled to do something doesn't mean he's not an asshole for doing it", "Bro. My friend came out to me in college via.a text as he left for class. It hurt me that he didn't trust me enough ( I knew from the situation before I ever got the text).\n\nI am still recognizing and squashing homophobic thoughts over a decade later. its not a on/off switch. Nurture can be a hell of a thing to oovercome.The number of people who act like any single thing is a disqualifier really makes those of us doing the work to try and change ourselves wonder if it will ever be enough. And that can be enough to make some stop trying. \n\nImagine trying for years to change your father's perception of what you know is your brother. And then some internet stranger comes along and dismisses it as \"obviously this guy has a lot of work to do\". Ice cold of you. Would freeze a whole pool if your pinkie toe touched it.", "People take surprising news in stride all the time.  It doesn't always imply that hidden bigotries are being smoked out.\n\nThe OP is YTA for pushing his brother a bit too hard.  The latter may just want to let his dad pass on without confronting him, which is perfectly all right IMO.", "Bruh, being momentarily surprised that someone you've known for a long time is gay isn't homophobia. If that was the case, it makes me banging my high school crush VERY confusing.", "What’s revolting is how there’s a fear that this guy might get sicker or die cuz his son is gay.", "Well, maybe, but he goes on the say the shock cod be too big for our dad and it could affect his illness", "Thanks tried to edit it and I messed up.", "Okay, agreed.", "No, your thinly veiled wish of death on another person's dad is revolting. Your comment is sneering, disrespectful & wholly inappropriate.", "The person you are talking about is OPs dying father. Show some fucking empathy.", "Some can’t read correctly", "Where am I wishing death on him?  I’m saying that if having a gay son speeds things up, that’s his own issue.  I fully hope that his son comes out to him and he says “ok I love you”", "No. \nI hope that the brother comes out to the dad and the dad says “ok I love you”. \nIf it somehow makes his condition worse that is his problem.  That’s not a lack of empathy gtfoh\n\nPeople have really had 15 years to grow the fuck up on this issue at this point, at a minimum.", "No, the dad will be dead it's everybody else's problem. if he gets worse and dies from the brother telling him how do you think that will effect OPs brother?  You think it will be fun for OPs brother thinking that he killed his own dad? Or that he's dad hated what he is so much that it killed him?", "if your hatred for innocent people kill you or worsen you illness, then that’s just karma doing its thing", "Someone should remain closeted for fear of how someone else will react. That’s gold.  Tell us you agree with the dad without saying it directly.", "YTA. Telling him he might kill your dad by being gay, are you serious??", "YTA.\n\nNo one has ever died or had a medical condition worsen just because someone told them they were gay.", "YTA \n\nHe's absolutely correct, it's his choice who, and when he tells. Your only role in this is to support him.", "I see a lot of people saying YTA, but honestly I don’t agree.\nWith the concept of homosexuality out of the argument, it would be pretty selfish for your brother to come out if there is any risk to your fathers life. Doesn’t matter whether the father is an ah or not. Your thinking about your fathers health, while your brother is being self conceited", "NAH. I understand your concern - if your dad isn't accepting then it could potentially be devastating for your brother. He may not be able to spend any more time with his father and he could be completely cut out of the will. \n\nHowever, it's ultimately up to your brother to decide his own fate. You just have to be supportive of his choices. If you're not there for him, it'll just be you and your mom.", "YTA. you don’t get decide when someone wants to come out, ever. Your brother coming out is not going to kill your father. I know you are trying to protect your brother but he’s 17 and he wants to live the rest of the time your father has honestly. You have no right to tell him to continue to lie.", "TTA he should choose when he wants to come out, not you, or when you feel your parents will be ready, he may never be ready, and brother wants to tell him before he dies. You're also the AH for implying that telling your dad could cause his death such bs.", "I have the feeling that you dad already knows or he thinks that you are gay…. (He’s stopped the homophobic comments right?)\n\nIt’s a nice thought that you’ve been protecting your brother from what you were sure was going to be a terrible reaction & I think part of that was you trying to delay the blow up you were sure was coming to the whole family too. \n\nI have to ask if part of you wants to delay the announcement because if your parents react badly, you will have to choose sides & you’re afraid of what that means for you? \n\nBut the thing is, it’s your brother’s life & his decision. Your dad will react how he reacts & you can be there for your brother afterwards. I hope that you can support him through this no matter what he decides to do.\n\nIt’s a scary & tough situation for both of you I’m sure, but he has more on the line than you do (after all, he could lose you as well as your parents). He just wants the freedom to openly be himself & I’m sorry but you’re holding him back from that. \n\nIn all honesty, I think now is the best time to tell your dad, I couldn’t imagine going through the rest of my life not knowing if my father would still have loved me.. that would really make grieving for him very complicated!\n\nWith all my heart I hope that your parents react well, that you & your brother have all the love & support you need & that you & your bro remain close.", "If i could award this I would.   This exactly this.   You must tell your father or it will hurt you for the rest of your life", "Don't be gentle here. Enabling discrimination is itself discrimination.", "My 3 year old has brain cancer, you think the lord has it out for him too? \n\nThe OP's brother should do whatever feels right, because the dad's condition is going to get worse either way. Cancer doesn't care if the dad is a homophobe, it kills good people as easily as bad.", "Religious AHs always find a way to displace the blame on literally anyone else who isn't them. 'God gave me cancer to punish me for your sins of being gay!' Remember when the religious nuts blamed those hurricanes in Texas on the LGBTQIA+ community rather than...weather?", "Could he also be written out of any will?", "There is a risk. However, it's still the descision for the brother to make, he is the only one who can decide what is most important to him.\n\nSo I agree with YTA. Let your brother decide for himself.", "Totally possible but I'm sure the brother realises this. It's up to him whether he wants to take that risk or not, not up to OP to \"let\" him.", "This\nEdit: I agree life is rarely simple. But op YTA", "i don’t think OP is enabling discrimination. he said he’s talked to his dad about stopping his homophobia and it has been working. it’s more the fact he’s trying to protect his younger brother from forms of abuse but also he’s now worried about his father. i agree with a gentle yta", "That'd what happens when your raised in conservative christian home.", "Compassion for dying people is just as important as compassion for LGBT person. \n\nIf my marriage fails and my parent is dying, should I tell them my truth or let them find comfort in dying peacefully that all is well in the world.", "That is clearly not what it’s about, OPs brother wants to show his dad who he truly is before it’s too late. That is his brothers decision not OPs. YTA for trying to dictate someone else’s journey.", "I was just agreeing with the statement “life is rarely simple”, i probably should have clarified that.", "Assholes die too."]}