{"id": 5974, "submission_id": "zynue3", "title": "AITA for leaving my boyfriend behind and going on the trip with our friends?", "selftext": " I've been with my boyfriend (I'll call him Paul) for 3 years and living together for 6 months. \n\nPaul has serious problems with forgetting important documents and after the 4x he did this, I became responsible for carrying our documents in my purse. According to him, all documents have a digital version and that is enough, not all are digital (passport) and not all places accept the digital form, but he is stubborn and maintains this position. I don't mind being responsible for the documents and most of the time, I have them in my purse. \n\nThat is until one day (2 months ago) he called me asking about his identity, because he needed it for something and they didn't accept the digital version, I was at work and I informed him that I had with me. He gave me a huge scolding, saying that their documents should be at home and told me to stop \"holding\" his documents. I handed his documents over to him and said that I would no longer be responsible for this or warn him about it, because I was doing a favor for someone I love who is a capable adult (27). \n\nFor the situation: \n\nWe and our friends decided to travel to another country on New Years from the 12/27-01/03 and a passport is needed as it is on another continent. We would go to the capital where we would stay at our friend's house until our flight time. Our city is 2 hours away.\n\nWe decided to go to the airport 4 hours before (visit the VIP room) and I went to check all my documents first. Paul was on my side and when he saw only one passport, he asked about his and I just said \"You have it\". \n\nHe panicked, saying he thought I had taken even more passports as usual and left it at home. He decided to run home and come back, he asked me to go with him but I didn't want to spend 4 hours in the car. He went to get his passport (but complained that this was something to remember him by) and I went with my friends to the airport.\n\n In short, he didn't arrive on time and I decided I wouldn't miss my trip because of him. I turned off my cell phone and made my 12h trip. \n\nWhen I arrived, several messages from him saying that he couldn't believe that I had gone on a trip without him and that I had done it as forms of revenge because of his scolding. The flights are all booked up or too expensive, so he probably won't come. He's still accusing me of leaving him behind after purposely not remember something I know he struggles with. \n\nMy friends are on my side, but I feel doubtful. \n\nAITA?\n\nI forgot one detail: I always make a list for our trips of what to take, his passport was on the list and he still forgot it", "created_utc": 1672365862, "permalink": "/r/AmItheAsshole/comments/zynue3/aita_for_leaving_my_boyfriend_behind_and_going_on/", "score": 3813, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 leaving my boyfriend behind and going on the trip with our friends\n\n2 after \"purposely\" not remember something I know he struggles with.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nHe wanted his documents back. You gave him his documents back. He forgot his documents.", "Nta. He’s not a baby. You’re not his mommy.", "NTA. He is a grown ass man who is blaming you for his irresponsibility.  He self sabotaged the trip & expected you yo miss it by coming home with him.  He is pissed because his plan did not work", "So he bitched you out for holding on to his documents after asking you to do just that. Now he's bitching because you followed his wish but afterwards did not baby him and remind him of his password. He needs a mommy, not a girlfriend. Maybe your solo vacation is enough of a wake up call for him, good on you for sticking to your guns. NTA.", "NTA. This is a red flag and you need to move on.", "What he has done and continues to do, is called weaponized helplessness, and it is a no-win situation for you, no matter what you do. \n\nKeep your phone off and enjoy your trip.\n\nNTA", "NTA, and this is an easy one. \n\nHe, and he alone, is responsible for packing for a trip which includes his identification and documents. He failed himself and missed the flight, that's 100% on him. \n\nYour bags were packed and your ticket paid for. You responsibly made it to the gate in a timely manner. You absolutely did the right thing in boarding that plane.", "Well, well, well if it isn’t the consequences of his own actions. Maybe he’ll learn to accept your help or be more responsible with his important documents. Go and have a fabulous time. NTA", "NTA and really, do you want to live the rest of your life with this dope?", "NTA. You aren't his mom, you're his GF. If he made a stink about you having his things and he forgot about it, it's not your fault. He's an adult and things have consequences", "He's a grown man responsible for his own documents. You have warned him time and again about this. Could you have reminded him before you left? Sure, but it's still down to him to remember it. Let him sulk. **NTA**", "You are NTA for going without him. Why should you BOTH miss the trip??? He is a grown up with an apparent disability. He needs tools to help him cope with adult responsibilities. You are not responsible for that, he is. He may need some apps, or a reminder service, or therapy, but he needs to find a way to manage his stuff! \n\nMy mom has a short term memory dysfunction disorder. She has medications in a box with a timer so that she can only take one set of meds per day. She has a call reminder to take her evening medication. She has post its to remind her when it's time for me to reorder supplies that she uses only semi-regularly, and a subscription to reorder the ones she uses regularly. There are all sorts of tricks for reminding yourself of things you need to recall. He needs to look into some of those if he wants to thrive and have flourishing relationships with other people. But you? NTA.", "Nta . The fact he thinks you took revenge on him for his scolding means he knows he is in the wrong. If he can't accept that elegantly he's not worth your time", "NTA. not even a question. You should probably ask yourself, do I want to spend the rest of my life being in a relationship with someone I am parenting? This shit doesn’t change and he doesn’t seem like the kind to introspect properly about this.", "NTA. He told you to leave the passport etc. at home and to stop holding them. What kind of  moron decides to not check if he has his passport when leaving to go to the airport to visit another country?", "Gotta go with NTA. How does he have the balls to bitch at you to not carry his documents then bitch at you for not?", "NTA.  And I’m super proud of you for going without him.  You aren’t his mom. He fucked around and found out.  Seems this might be a lesson that you’d have less troubles without him.", "NTA. He wanted to be treated as an adult, so you did. Apparently, he is not ready to be an adult. Run girl, run!", "nta. he didn’t want you taking care of his documents anymore + there was a checklist? it’s on him 🤷🏽‍♀️ why should you have to miss out because of his mistake", "NTA. \n\nIt's bad enough he wants you to be his mom, but even worse that he wanted you to make the drive back with him. And unacceptable to have a tantrum because you actually got to follow through with the plans. \n\nThis was a good lesson for him. If I didn't break up now, I'd certainly warn him that if he acts like that again I'm gone.", "Definitely NTA, he needs a souvenir t-shirt that says “well well well, if it isn’t the consequences of my own actions”.", "NTA - he insisted he could handle his own documents and now he is facing the realization that he in fact cannot. Perhaps he won’t take your looking out for him for granted anymore.", "NTA. He is a grown adult, he missed the trip. Sounds like you need a new boyfriend.", "NTA. \n\nHe is an adult who is blaming you for not holding his passport after he explicitly told you not to hold his documents. \n\nAnyway, don’t keep a passport in your purse as a wallet is easily pinched. I know! And replacing a passport is painful! \n\nBut your boyfriend is a massive a*****e and why would anyone sane want to drive 4 hours because he didn’t check he had a passport before leaving the country. \n\nI mean that is the first thing every adult checks for before heading off for an international flight!", "NTA\n\nNote that every time something goes wrong or he’s forgetful, he blames you. Every. Single. Time.\n\nThis won’t change. He will always blame you and take it out on you and expect you to absolve him of blame and responsibility.\n\nEnjoy your holiday - Happy New Year!", "NTA -- Anyone who thinks you should be responsible for the grown man who didn't appreciate all your free labour can go kick rocks.", "NTA but he is one, if he thinks You should have to miss out on this experience because he's a lame", "NTA\n\nSimple truth: the only one who can convince someone to grow up is *that person.* Your BF seems to be emphasizing the \"boy\" in *boy*friend. I've seen the phrase \"weaponized incompetence\" referenced in several comments, but I suspect that this is an altogether more insidious issue: *persistent juvinilism.*\n\nIn short, your *boy*friend wants what he sees as the best of both worlds - to be an \"adult\", but also to have someone who handles all of the responsibilities which come with actually ***being*** an adult. \n\nHe's pushing 30, and still wants to behave like he's pushing 13? Right now, you need to start thinking about if you're willing to support his infantile behavior.", "NTA hes a grown ass man and can't remember to take his passport?  You hold it for him he scolds you to never touch his personal documents again.  You don't and turns out he needs a baby sitter.  He needs to learn how to be responsible.", "Welcome to your future. Do you see one with him? I don’t. NTA", "NTA big time. You gave him a much needed wake up call. You aren’t going to mother him with his docs anymore and he’s angry that he’s been faced with that. Let him miss out on a few more critical things and he’ll learn to manage himself like a big boy in no time. Enjoy your trip!", "NTA.\n\nLol. I hope you’re not foolish enough to think that this man could ever eventually be responsible enough to be a father to children.", "NTA he is 27 not 7.", "NTA. Please show NO remorse whatsoever. Tell him it’s time to grow up and you’re not his mommy.", "Please tell me your trip was to Italy because he is displaying some marinara flags. Dump the boyfriend and date a grownup who can be responsible for himself.", "NTA - If it isn’t the consequences of his own actions. He told you to stop “holding” his documents, you stopped, he forgot his documents, missed the flight, can’t get to the next country. How is ANY of that your fault?", "NTA. However, I must say that living your daily life with important documents in your purse is crazy. They can be lost or stolen. His passport should have been at home the whole time. That said, \n\nNever offer to carry anything for him again. It puts the burden of his irresponsibility on you in his mind, instead of squarely in his lap. I’ll bet he never forgets again.", "NTA\n\nSucks for the both of you. I’m sure you would have both rather have enjoyed your trip together. Way to go Paul!!! Ugh!", "NTA.  He should look after his stuff. You should not suffer because hes irresponsible.", "NTA. You have told him multiple times, you have made him a list... Why should you miss on a expensive trip of the life time? Hopefully he won't make the same mistake twice... However I am wandering if being inattentive and forgetful is something that happen in other aspect of his life? Could he have ADHD for example? Probably not the case, but just a thought...", "jfc, he needs a minder, not a girlfriend.\n\nNTA. if this is not a wake up call for him to get his stuff together *without your help*, then idk what is.\n\nimagine many more years of him forgetting his documents and getting mad at you, and then having you hold on to them and getting mad at you for having them when he needs them but isn’t near you.\n\nunless ***he*** changes, it won’t change.", "NTA. You kept his documents for him, he yelled at you. You wrote him a checklist including the passport and he ignored it. You have bent over backwards to try to help him, but he won't help himself.\n\nThis is the quiet labor burden that women bring up in divorce. It's not about the passport, just like it wasn't about the cup. It's about you being the project manager of your home, and his weaponized incompetence.\n\nDon't apologize. He's an adult. But I would encourage you to stop being his mother. Whether that means you leave or not is your decision. But ask yourself: if I left today, other than housing, would I have any difficulty living on my own? Then ask yourself if he would. Therein lies your answer.", "NTA.  Missing a flight because you're dumb about ID is called a 'natural' consequence.  Hopefully he learns from this.  Do you want to deal with bs every time you go on a trip or he needs his documents? Tell him to grow up or get out.", "NTA", "NTA \n\n\nHe scolded you for holding the documents and then again for not having them...", "Bro is 27.  You literally made him a list.  NTA.", "NTA. Are you his girlfriend or his mother? He is an adult. You've already done more than you should for him by making lists and carrying is ID around. I suggest you familiarize yourself with the terms \"weaponized incompetence\" and \"learned helplessness.\" He is a shining example. Do you want to be his mother the rest of your life?", "I'm gonna go with NTA. You have warned him multiple times and he is an adult. In saying that, maybe you could have said something to remind him but as that's not your responsibility, I'll stick with my verdict 🤔🤷🏻‍♀️", "NTA. What the hell is up with your bf???\n\n\nI have memory issues due to a chronic illness, and I make a bunch of lists whenever I travel and put my important documents together days before.\n\n\nI check everything atleast 3 times the evening/day before I leave and the really important stuff the day of.\n\n\nYes, I'm forgetful, but that's not an excuse to rely 100% on other people.", "NTA. Weaponized incompetence just bit him in the ass. Also how does a grown man think everyone everywhere accepts digital copies of identification and documents that could easily be doctored? Dumb and wrong opinion on his part. \n\nGet him a wallet and fanny pack for his birthday so he can carry his own shit.", "He wants a girl just like the girl who married good ol' dad. Mommy made him fend for himself. How heartless can a mother be? NTA. \n\nPS Don't forget to send him lots of photos.", "Definitely NTA in this situation.  He scolded you for having those documents then you informed him that he needed to be responsible for them. And he forgets. Nope you were prepared he wasn't..\nCalled his own actions have consequences. Maybe he will learn from this", "NTA, but that definitely would've been my \"break up\" point", "NTA. His frustration is understandable but you are not his mother. It's wrong to blame you for his issue.\n\nI am a real flake and forget something really important every time I go somewhere. I started doing the packing checklist but I don't check anything off until it goes in the suitcase. Then the list goes in the suitcase for when I repack to go home. Would that help him? Make him do the checklist once while you sit there, then say it's up to him from now on?", "Did your vacation hotel fly Marinara flags or serve Iranian yogurt at the complimentary breakfast? Because I’m seeing both of those here…\nEDIT Verdict… NTA", "[deleted]", "So one question… did you know he forgot it? Honestly?  Or did you not remind him on purpose to see if he would do it or not?   In any case - it is his fault, yes,   But it is also the end of your relationship… one way or the other - so I hope you are ready and wanting that as well", "Edit: to NTA.  just read in another comment from you that you already made him a list with \"passport\" on it. So I change to NTA. But for a long term relationship question is whether he will change or if you are willing to accept this issue. Could be a deal-breaker if he isn't willing to change nor you to accept his shortcoming. \n\n\nOld: YTA. I know it's hard to have someone depend on you, because they are not really capable of managing a task by themselves that is very important and easy for you. (I lost track of how often I have to remind my husband to take his medicine...)\n\nBut you are his partner and you should support each other on your shortcomings. Especially if it is an important event like that. If you want to teach him a lesson do it for something less important. Also, try to give help on how he can remember to take his documents. Eg a calendar entry the night before or a travel checklist. And it might happen that even that won't help. You have to decide if you are willing to take that responsibility for your partner or not.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n I've been with my boyfriend (I'll call him Paul) for 3 years and living together for 6 months. \n\nPaul has serious problems with forgetting important documents and after the 4x he did this, I became responsible for carrying our documents in my purse. According to him, all documents have a digital version and that is enough, not all are digital (passport) and not all places accept the digital form, but he is stubborn and maintains this position. I don't mind being responsible for the documents and most of the time, I have them in my purse. \n\nThat is until one day (2 months ago) he called me asking about his identity, because he needed it for something and they didn't accept the digital version, I was at work and I informed him that I had with me. He gave me a huge scolding, saying that their documents should be at home and told me to stop \"holding\" his documents. I handed his documents over to him and said that I would no longer be responsible for this or warn him about it, because I was doing a favor for someone I love who is a capable adult (27). \n\nFor the situation: \n\nWe and our friends decided to travel to another country on New Years from the 12/27-01/03 and a passport is needed as it is on another continent. We would go to the capital where we would stay at our friend's house until our flight time. Our city is 2 hours away.\n\nWe decided to go to the airport 4 hours before (visit the VIP room) and I went to check all my documents first. Paul was on my side and when he saw only one passport, he asked about his and I just said \"You have it\". \n\nHe panicked, saying he thought I had taken even more passports as usual and left it at home. He decided to run home and come back, he asked me to go with him but I didn't want to spend 4 hours in the car. He went to get his passport (but complained that this was something to remember him by) and I went with my friends to the airport.\n\n In short, he didn't arrive on time and I decided I wouldn't miss my trip because of him. I turned off my cell phone and made my 12h trip. \n\nWhen I arrived, several messages from him saying that he couldn't believe that I had gone on a trip without him and that I had done it as forms of revenge because of his scolding. The flights are all booked up or too expensive, so he probably won't come. He's still accusing me of leaving him behind after purposely not remember something I know he struggles with. \n\nMy friends are on my side, but I feel doubtful. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\nHe needs to grow up and take responsibility.  I would’ve gone on the trip too!", "NTA. So he is mad you didn’t choose to miss your trip because he was irresponsible? His forgetting his passport wasn’t your fault. He’s upset he had to face the consequences of his (in)actions, \n\nI’m wondering: did he ever apologize for scolding you? It sounds like your boyfriend is wrong from beginning to end and wants to make you at fault for something. You did everything right.", "NTA \n\nAt this point he simply doesn’t want to take responsibility for himself. \n\nHe’s a grown man who should be able to remember things by himself.", "Is your boyfriend 13? \n\nIf not, his inability to keep important documents is a red flag. Either (1) mommy always did such things for him and he can’t adjust, or (2) he’s incapable of functioning as an adult. \n\nEven adults will forget things on occasion. But this is bizarre, and this may help him get a handle on the situation. \n\nNTA", "NTA. He's an adult. He needs to act like one.\n\nAs for you - it's bad form to date children. I suggest you find an adult.", "[deleted]", "ESH\n\nHe had it coming, but you did abandon him.", "YTA. Partners shouldn’t ditch each other.", "[deleted]", "ESH \n\nI'm mostly on your side here. I don't see a problem going on a trip without him because he failed to keep track of his own documents. It might have been nice to give him an extra reminder as you clearly know your partner is disorganized, but it's not your responsibility to remember to do that and it shouldn't be something you have to spend mental energy remembering. He's an adult and it's fine for partners to spend a week apart. \n\nThe 'ESH' comes in because it sounds like you didn't communicate very well once you both realized there was a problem with him forgetting his passport. His lashing out sounds worse, but you could still show him some amount of empathy...also, it wasn't clear if you told him that you were going without him before getting on the plane and turning your phone off. The choice you made was fine, but I'm not sure you communicated it well.", "This. Dude actually had the brass balls to get upset with her not packing his passport *after* he accused her of withholding his documents from him. 0/10 specimen.", "[removed]", "Honestly it’s possible, the forgetfulness would be concerning to me personally. I’m not saying it’s OP’s fault, but rather that I’d be worried if I were in her position and my partner was this forgetful and honestly unreliable (at least a little bit).", "I added at the end, I always make lists of what to take, his list had the item \"passport\" and he still forgot.", "She made him a checklist... he still fucked up.", "Also…you might want to ask those friends your are out partying with if you can live with them and figure out how you are going to get new “stuff” b/c you probably will not come home to a place to live or a lot of stuff left since you are not loyal to him even in his stupidity… just saying", "Don’t agree with your first take. Even if OP hadn’t written her adult husband a to-do list, she did not withhold the information maliciously. He told her to stop holding his documents and she did \n\nNTA, I’m hoping this is a learning experience for OP BF instead of an ongoing argument. Because it shouldn’t be, he fucked up. Gotta keep your documents straight if you’re traveling (starting weeks in advance)", "Except he scolded her for managing his documents. \n\nIt is at the moment that you stop!\n\nHe doesn’t get to scold her and think she is responsible for doing exactly what he scolded her to do!\n\nIf he was appreciative and expected her to remember it as they had happily done this then it would be a different story. \n\nBut he scolded her like a child so she did what he said!", "If that is true she should break up with him.", "She seems to have added that she made a list and he still forgot.", "Reading into stuff much?", "I didn’t get that at all.", "He wasn’t abandoned! She got on her arranged flight. He couldn’t because he wasn’t organized", "Yeah, she should have been a good partner and missed her trip too because... Uh... No. Can't even come up with something to make fun of that idea. NTA.", "Abandon him? He’s at home.", "Nope! He is an adult with no intellectual disabilities he can remember of leaving a country you need a passport. He got upset when she was in charge of them. So this is on him. She shouldn’t have to remind him or grab it and if he thought she had why not as before you leave. Again he is 27 not 7", "No. He's an idiot. Why should she ruin her plans cause he was too stupid his passport when leaving for another country?", "OPs bf expects her to be his mom, not his partner. This relationship is doomed regardless of this situation, no one wants to have sex with someone that acts like their child.", "This is nonsense. Why should she miss out on a trip and lose money because he couldn’t be an adult. He ditched her by leaving his passport at home.", "Congratulations on the worst take.\n\nHe *scolded* her for taking charge of this before but she should have telepathically known to do so now?", "She made a checklist with the passport on the list. If she's not his mother what else was she supposed to do????? Lmaoo \n\nAnd she did look out for him originally, and she got bitched out for it. \n\n\nNTA op.", "He shouldn’t need it because he’s an adult but she did make him a list", "The more accurate term is “weaponized incompetence,” and I found a great description of it\n\n“Weaponized incompetence is a poorly executed action or behavior that someone does on purpose, while appearing to do so out of incompetence. The goal of this tactic is to make oneself look like they are incapable of performing an action, therefore removing ownership and accountability for the action being completed.”\n\nIt is often a step in a a pattern where one partner makes the other responsible for completion of tasks and is a form of control that in many cases, escalates.", "Wow then even more so NTA. He faced the consequences of his own ineptitude and you should in no way feel like the AH here!", "Are you suggesting he just gets to kick her out and steal her things? \n\nHe wasn’t loyal to her and their plans when he decided to leave his passport at home.", "How was she not loyal to him..?", "You seriously implying that her boyfriend can and should illegally kick her out and take all of her belongings because he forgot his own passport? You're also assuming the guy is the main leaseholder/owns their home. You think she has to forfeit a vacation because HE is a poor planner because of 'loyalty'?\n\nGo to bed kid, its way passed your bedtime.", "How wasn't she loyal?? This man probably has a phone, he's responsible for his stuff, she told him to bring it, what more do you want this woman to do??? She's his gf not his mother.", "Boyfriend is definitely a way bigger asshole", "[deleted]", "Nope. I’m Suggesting he is a jerk and just might do that", "No. I’m implying that he is a jerk and he might do that.", "Agreed I would not want to be in a relationship where I get scolded for trying to help.\n\nEDIT: she did try to make sure he could go. Again, she made a checklist for him.", "[deleted]", "NTA - When you get back from your holiday and he starts berating you for “making him miss it” show him this thread. Tell him it’s time for him to be an adult  and tell him to use this experience as a life lesson and that your not his mommy or his personal assistant.", "NTA. What the heck would he do if you weren’t dating? Have his mother pack his suitcase?", "NTA but how long are you going to tolerate weaponized incompetence?", "Nta. If ur going to another country, passport is the #1 thing on ur list. Wtf?!", "NTA - this is hilarious to me. Then the update. You made him a list that included his passport. He’s one of those guys who doesn’t want you to treat him like a kid, then acts like a kid, and doesn’t understand why you didn’t treat him as such.", "NTA.  You taught him a valuable lesson that you’re not going to mother him and bail him out of his adult responsibilities.  If he doesn‘t realize this is all his fault and apologize, you should drop him.", "He sounds EXHAUSTING.\nYou're essentially his mommy at this point.\n\nNTA but you would be an A H to yourself if you keep putting up with this thankless child.", "NTA.  He’s your boyfriend not your child. You didn’t take him to raise. I think even making a list is going above and beyond your responsibility.", "NTA. You should reconsider what you are getting out of this relationship. Is it enough for you to continually parent your partner? From experience, it's exhausting.", "Weaponinzed incompetence. Research it.\n\nNTA", "NTA! Time for Paul to grow up or waste more money on trips he won't make. He can't have his cake & eat it too this time.", "NTA and find a new BF", "The only thing I can say is well done!!!\n\nNTA", "NTA he wanted to be responsible and he failed miserably. Why should you miss a trip", "Nta\n\nMommy carry all my stuff\nUmm I'm your girlfriend\n\nGrow up, remember play stupid games win stupid prizes", "NTA", "NTA. I’ve been married 22 years and it gets exhausting to always have to be on top of your partners things. Hopefully he learns his lesson and doesn’t rely on you 100% of the time.", "NTA. \n\nIf there was EVER a f***ed around and found out situation...\n\nWas it a great trip?", "NTA. This could be forgivable if he acknowledged his problem, was working with you on how to deal with it, and took responsibility when he messed up. Instead he’s demanding *you* compensate for his forgetfulness, then berating you for doing it and demanding you change what you’re doing to help, then berating you *again* when he messes up. Again. \n\nThis is exhausting just reading it. Living it must be just *~spiffy~*. If you actually want this relationship to work out, he needs to take responsibility for his own shit, apologise for the way he’s been treating you, and DO BETTER. Consistently, and long term, not for two weeks and then pouting because you haven’t forgiven him yet.", "NTA. Yikes. He wanted to be treated like an adult, you complied and then he failed to act like an adult, even though he had a list to follow. You know you're right.", "NTA.\n\nTake what sounds like a well-deserved break and reconsider your relationship.  He wants a lover/mother/emotional support animal all wrapped up in you.  Good for you for not enabling him.  And his goto response that you did it for \"revenge\" speaks volumes about his inability to be accountable for himself.  And ihe will always be that way.  After numerous opportunities he still didn't learn and missed an awesome international trip and wasted thousands of dollars his go to was to blame you.  Rinse repeat....for like ever.", "NTA. He wants to you to pull a Schroedinger: Don't hold his documents when he wants to access them and simultaneously always hold his documents because he's too irresponsible to remember them when it's important.", "NTA. I have ADHD and terrible object permanence, so I too have a naturally hard time keeping up with important documents. Know how I deal with it? By designating one drawer in my home for them, and they are always in there unless I need to remove them for travel, etc. Then, while traveling, I keep up with them with the help of an AirTag tracker and a zippered pouch on a chain that is attached to the inside of my bag. As soon as I return home, the documents go right back in their designated drawer. As an adult, I would never dream of making this someone else’s responsibility. Reconsider this relationship unless you want the rest of your life to involve being this grown man’s mommy.", "NTA. Every adult traveler is responsible for having their own passport on their person at all times. Period.", "NTA. If this is a legitimate struggle, as in he is neurodiverse, he needs to come up with a plan to address this. It is HIS responsibility. Not yours.", "NTA\n \nHe forgot ot. zyou are his partner not his parent.", "NTA... STOP enabling him. You sound convinced that you should take on this mommy role for him, that's the most disturbing part of this post. He is gaslighting you. (Conditioning you to believe something that is not true)  He is also shifting blame from himself to you and trying to make you believe it was somehow your fault. \n\nPlease read up on gaslighting and on narcissist traits, I'm not sure if this is a case but you need to be able to identify it when it happens. Read up on the effects it has on the people around them. (Family and partners)", "You are so not the asshole. If he can't grow up then boot him.", "NTA", "You're the asshole for abandoning him for six days without a babysitter. He gunna die.", "My initial reaction to the title was YTA but after reading it's a clear decisive NTA.\n\nHe wanted his documents back, so it's his responsibility 100% to take care of them. He should have been taking care of them to begin with. You arent his mom or babysitter and its not fair to expect you to miss a trip because he forgot his passport.", "INFO: Does he blame you for other things going wrong in his life?", "NTA\n\nHe didn't want you holding his documents so he was looking after them.\n\nHe had a list and didn't follow it which included his passport.\n\nJust because he forgot something, doesn't mean you have to suffer.  This isn't a new thing.  This was a consequence of his actions and not yours.\n\nBut I would question whether he has ADHD.  Possibly the inattentive type. Maybe have a look at this possibility.", "NTA. He’s a grown ass adult and already got mad at you for trying to help him. He’s needs to be more responsible and why should you miss out because he’s irresponsible \n\nHave a good trip and he can learn from this and start acting like an adult.", "NTA.\n\nYou're not responsible to make sure he has everything he needs, you're not his parent.\n\nI'd honestly tell him to get checked for ADHD, it's a common sign in adults he forget because he gets distracted by something, then gets distracted by something else, then gets distracted by something else, it's a vicious cycle.  \n\n\nThere are ways to manage, developing healthy coping mechanisms is important, like writing stuff down so you don't forget, setting reminds in your phone to do things at certain times.  \n\n\nBUT  \n\n\nthat means he needs to take responsibility for himself and his actions, not blame other ppl.", "NTA. He sounds exhausting and childish to blame you for his lack of responsibility.", "op=NTA\n\nHe FAFO, Why should you have lose out on your vacation, because he can't deal with his own paperwork.  \n\nHowever, he's clearly a grudge holder because he's blaming you again rather than taking responsibility as an adult. \n\nIs this something you want to deal with now and after you have children?  Carrying the mental load for EVERYTHING because he won't \"adult\" on his own.  And he'll blame you EVERY time you don't save him and he will accuse you of controlling him when he needs to push you down.\n\nYou could try for couples therapy and see if it helps, only you can answer if it's worth it(or if he'd be amenable to it)", "NTA. He gave you his documents because he forgets them, then chewed you out for having them and took them back. You even put his passport on his list of what to bring and he STILL forgot it. That's his fault, not yours. There's no reason you shouldn't go on the trip with your friends because he forgot.", "NTA. But you Know he will Never change and if you stay with him it will be a lifetime of him making you responsible for him and blaming Everything on you?", "NTA- expectations were set- he needs to learn how to adult and sometimes learning is painful and you miss out.", "NTA. You are in an abusive relationship. Your boyfriend has set up a scenario in which you cannot really win- there is no right choice. If you had brought his passport he would have found a reason for that to be wrong. If you had stayed, that would have somehow been wrong as well. There were no right choices here.", "He is a grown adult. \n\nI made sure I had my passport before we left the house by age 13. \n\nThere is no excuse. \n\nNTA. Your boyfriend is behaving like a toddler.", "The bf seems to be someone who always finds fault with their partner, it’s not a trait worth spending a lifetime with. NTA", "NTA he's a grown ass man it's time for him to take responsibility for his own damn self. Play stupid games win stupid prizes.", "\nNTA! \n\nI’m a non married dude from the Midwest who’s into cars and video games A 27yo man doesn’t think to double check that he has his passport before leaving the country? \n\nHonestly, it sounds like he’s using you as “mommy” or as his “caretaker.” It almost sounds like he’s intentionally incompetent as a way to manipulate you into just taking care of this stuff for him.", "Uh, I would expect a 27 year old to at least be able to handle a passport. That's ridiculous. NTA", ">he couldn't believe that I had gone on a trip without him and that I had done it as forms of revenge because of his scolding\n\nHonestly, even if this was a petty form of revenge, you still wouldn't be the AH.\n\n&#x200B;\n\n>He gave me a huge scolding, saying that their documents should be at home and told me to stop \"holding\" his documents.\n\nAt this point he just lost any right to complain in the future about his passport.", "> We decided to go to the airport 4 hours before (visit the VIP room) and I went to check all my documents first\n\nYou didn’t check passports at home?? I’m confused.", "NTA. Are you gonna marry this toddler?", "he is a grown man and needs to be responsible for his own government identification documents. let this be a lesson to him! \n\nalso dump him. you are doing so much emotional labor for him and he doesn’t deserve it — you’re not his mother but he is treating you like you are. \n\nNTA", "NTA, and I hope you enjoy your trip with your friends!", "So first he's mad at you for keeping his documents with you due to his irresponsibility, and then he's mad at you for not keeping his documents with you due to his irresponsibility.\n\nHmmm I get the impression that no matter what he and you do, it's always gonna be your fault and he's never gonna own up to his actions.\n\nNTA", "NTA this is a clear indication of stupidity resulting in a tantrum. Good for you not letting this ruin your new years...but - you're going to gave to deal with a tantruming toddler when you get home.", "NTA, what kind of adult makes a habit of forgetting their passport while traveling internationally? That's fucking ridiculous. He's got codependency issues, and sounds generally immature. Good for you, some people have to learn the hard way. Bet it doesn't happen again...ha", "NTA.\n\nI smell weaponized incompetence.", "This has to be fake", "Nta\n\nIts time for you to start acting like a girlfriend and stop acting as a mother\n\nMan should be able to hold his on documents he is an adult", "NTA.\n\nI'm kind of laughing at the idea of him getting pulled over while driving and telling the cop \"I don't need my license, you can find the digital version online.\"", "NTA, unless the intent of your relationship with this 8-yo was to wipe the mouth of a small child for all of his adult life. \n\nYou have my greatest sympathy. But it sounds like you either need to start wiping his mouth, or STOP wiping his mouth. Because this isn't going to get better.", "ESH\n\nIf you'd do this, then you should break up with him. I couldn't imagine anyone in my life turning off their phone and going to another country without me so simply. We'd be texting the whole time I went home to get my stuff, and I'd try my hardest to be on time.\n\nYou also definitely did this out of revenge. You even turned off your phone. I'd bet quite a lot that you felt real powerful knowing he was leaving his documents at home when you left, because you didn't remind or grab it yourself, and it definitely crossed your mind that you could grab them, but didn't on purpose.\n\nThe way he acts is obviously annoying and awful, but if it's something you can't handle, and aren't going to actually discuss and figure out with him, why are you together? 3 years is more than enough to figure this out.\n\nYou're going to win on this subreddit, but you didn't get a big win here, you were just petty and childish in your 3 year long relationship, that you should now end.", "NTA. If he doesn’t learn a thing or two from this experience about responsibility and accountability like a normal adult, then it’s time to re-evaluate the relationship.", "He messed up. You don’t have a partner. Assuming your still on the trip, you guys need to have a conversation when you get back, this does not have a future unless he takes responsibility", "I remember another AITA that was very similar to this one. \n\nThe OP was a woman who went on a trip with her friends and without her husband because he hadn't gotten his passport updated in time. He blew up her phone and made her feel guilty for \"abandoning\" him.\n\nETA: If this is real, take this time apart to read all these posts, temporarily block your boyfriend, and decide whether you really want to be a surrogate mother to this man/boy for the rest of your life.\n\nWatch the red flags fly and dump the bastard!", "Nta. Your not his mother. Tell him to grow up.", "So many AITA posts are just some version of “AITA for not managing a grown man’s affairs for him?” NTA, all of this was his responsibility in the first place and you were doing him a major favor to even help to begin with.", "Almost everyone in my social circle has ADHD, and I doubt we can collectively pull this sh^t that this dude pulled!\nNTA", "ESH -him for obvious reasons. \n\nBut you did this to be petty. This relationship has run its course and hopefully you two will be better to your next partner. I hope it was worth it", "Do you like your boyfriend? Do you want to be in this relationship? Every person has their faults or or mistakes. In a genuine and loving relationship you work together to help one another. Who the hell cares that he misplaced documents. You’re right, he shouldn’t have chewed you out. He was probably frustrated that he didn’t have it when he needed it. You should have talked to him about the situation then. It’s called communication. It’s something adults do. \nInstead you used this as an opportunity to teach him a lesson. You’ll be lucky if you have a boyfriend when you get back. Hope your vacation and “lesson” was worth it. YTA", "And OP even made him a LIST with the passport on it!", "NTA.\nIf you stay in the relationship, he will forget about the marriage license.\n\nAlso the baby's birth certificate.\n\nAlso, your 25th year anniversary vacation papers.\nAlso, . . .", "*This* ⬆️💯", "She wrote him a list of what he needed to bring and the passport was on it. So she DID still baby him and remind him and he STILL forgot it… or possibly “forgot” it. At this point I’m leaning towards thinking that he’s doing this to make up something she keeps doing “wrong”, or he didn’t actually want to go and either deliberately or subconsciously left it behind so he’d have an excuse.\n\nETA: And he wanted her to go with him to fetch it! So it’s possible he was trying to sabotage the trip for her, too. \n\nI realise this sounds nuts, but so does the way he’s trying to make everything her fault even when she changes what she’s doing because he asks her to, and “shortly after moving in together” is a common point for AHs to think they’ve got their partner locked down and it’s safe to start showing their true colours.", "How the hell does an adult get his age and not double check that he has his passport packed for an international trip? The dude is either a full blown space cadet or truly trying to weaponise his incompetence.", "Super glad OP went on the trip!", "I wish I could upvote this more", "Right? Idk where they live but I’m a bartender and was taught legally you are not to accept pictures and such of IDs, you need to hold it in person as part of checking it’s real", "What?!? Are you the child in your relationship that needs your partner to remember everything for you?", "She did what to be petty? Make him a checklist, including his passport on it, and then assuming he would act like an adult and check the list and make sure he has all his important documents with him? If it's petty to assume your adult BF will act like an adult then I guess I'm petty too!", "So what do you expect her to do? He lashed out on her and told her to stop managing his IDs. If she continued asking or holding on to them everyone would say she's controlling or being a nagging girlfriend. He insisted he was capable of taking care of his identification himself.\n\nShould she have missed the vacation because he's incapable of a very basic aspect of travel? And she said she turned off her phone when she realized he wouldn't make it. I would do the same.\n\n You don't want me to hold your hand like I've graciously done without complaint? Fine. This is a consequence of that. Nta", "She DID try to help him by always having his important documents with her. She then got yelled at for that, so she gave them back. She also made him a travel list that included his passport. He STILL forgot and is blaming her. She is dating a petulant child.", "I think the simplest possibility is that he's just used to having others take care of him. That list to him didn't mean he had to take responsibility or anything, it was just a meaningless piece of paper...\n\nI will say that there's a Roald Dahl short story (The Way Up to Heaven) where one character is very deliberate about their sabotage. Highly recommend!", "My ex-husband changed radically when I was 8 months pregnant with our son. That's why he's my ex.", "This isn't a case of weaponized incompetence because he isn't benefiting in any way. If he pretends to be incapable of contributing to home repairs, yard work, cooking, shopping, or cleaning he would benefit from.not having to complete tasks that he finds distasteful. Not carrying identification, tickets to an event, or a passport prevents him from doing things he wants to do. This is just plain old incompetence.", "I check my pockets no less than *three* times every single fucking time I leave the house to make sure my wallet and keys are with me. How someone forgets the single most important thing needed for international travel, the thing that should be first and foremost in any traveler's mind before a trip, is completely beyond me.\n\nThis dudebro needs to grow the hell up (or hire himself a full-time caretaker if growing up is too hard), and OP needs to find herself someone who can wipe his own ass.", "Yes, because women are worth more than being replacement mother's to their partners. Are you saying women aren't worth basic respect and equal treatment?", "Huh it's almost as if people started deciding to name unacceptable behavior to make it easier to identify and label as unacceptable.", "uh oh, did this one touch a nerve for you? hit a little too close to home?", "Women are capable of “weaponized incompetence” as well. Anyone can do it.", "Is she not?", "Well that was added as an edit after my post, so obviously changes things.", "Are you the boyfriend? You sound like it.", "Not loyal? Lol grow up", "I'd expect her to say \"Sorry you couldn't find your passport. We are heading out now. I'll miss you and see you when we get back.\" instead of just turning off her phone and leaving. \n\nHe sounds much much worse here, but she needs to be able to communicate in a relationship. The exception being if she is ready to break up with him - which seems reasonable tbh...but if she is planning on staying in the relationship she should be able to communicate.", "When she handed the documents back to him she warned him she would never remind him again. Even with the list, it wouldn’t have killed her to kindly ask as they left the house if he had his passport. Literally everyone makes mistakes in life. With all the BS AH we see on this sub, his infractions are pretty minor. \nThe question still stands. Does she want to be in a relationship? If so this tit for tat will destroy it. He missed an entire vacation with her because she wanted to teach him a lesson. That’s NOT how you treat someone you genuinely love and care about.", "Ha! Yes, I remember that story.\n\nI agree it’s very likely that he’s just used to being reminded and catered to and doesn’t want that to change, but when you get to the point where your loved ones genuinely can’t tell whether you’re being lazy/incompetent or abusive, it doesn’t really matter which it is, does it?", "I hope you and your child are thriving without him!", "He’s freed up from the mental work of remembering to pack things and where things are kept. It’s like being a kid again and knowing your mom would never lose your passport and she always knows just where it is (in the safety deposit box at the bank).", "Agree completely with you. Though she did allow herself to act like his mother forever up to this point (3 years?). She did nothing wrong.  It will still be the end of this relationship which should be a very good thing for her.  Though I would say she could have handled this in a much more mature way like telling him when he left that she would not wait etc.   the relationship is toxic and has run its course.", "Hahaha nope. Just warning her what stupid toxic partners do.", "He was the only AH! She was even nice enough to create a checklist, including a passport, and he still forgot it, and tried to blame her!! He is an adult and should be able to remember important documents like that himself! Him expecting her to miss the trip too makes him an even bigger AH! Not sure how she is an AH at all!", "Isn't that basically what she did? She said she wouldn't do the FOUR hour drive there and back and would go with her friends. Communication doesn't have to be spelt out like a kindergarten book in an adult relationship. Thats expecting her to just baby him in a different way. He knew there was a chance he wouldn't make it, she expressed she wasn't going to make the four hour trip with him and wanted to be at the airport in time. Thats more than enough communication when he's the one that messed up, more so considering the ID issue is a reaccuring problem.", "Someone like what? Someone who tried to help and then got yelled at for it and then stopped because she was told? I wouldn’t want to be with someone who yelled at me not to do things and then still expected me to do them after being yelled at not to.", "He missed his entire vacation because HE forgot his passport. Don’t pin this on her when he’s the one who forgets.", "Exactly. He’s foisting the mental load onto her by pretending he’s not capable of doing it himself. Thereby getting out of his responsibility of, well, having to be responsible.", "Cool! So he also wants to go to court and possibly prison! That’s nice.", "Reread both of your comments. They both fully place the blame on her.", "Nope they don’t.  This is so common sense.  It’s laughable that anyone would put this on Reddit\nAnd you trolls would go off on it.  If this list is even real.  They should be enjoying their vacation. It reading all of this drivel", "Because why would she do that when last time she was helpful she got yelled at for it?🤔", "> figure out how you are going to get new “stuff” b/c you probably will not come home to a place to live or a lot of stuff left since you are not loyal to him\n\nFairly certain telling her she's not loyal to him is blaming her.", "They should be, but he’s a moron and can’t remember basic things even when they’re spelled out for him. Why should she have to suffer?", "[deleted]", "Lol you'd have to ask OP. \nI don't agree with \"well they're in a relationship why shouldn't she just accept being yelled at for trying to help and still go out of her way to babysit her partner\" but alas agree to disagree.", "NTA. Run now.", "NTA Do you want to do this for the rest of your life? He will never let you be in the right.", "NTA he's a crybaby and needs to learn how to be responsible for his own shit. Sucks to suck, grown ass man.", "NTA - I could get forgetting it when needed for routine stuff, or even losing it completely if you're forgetful, but who on earth doesn't check if they have their passport before they get to the airport?\n\nEspecially given it's been a sore point, and you even put it on his list. Some things people have to learn the hard way, no reason you should also lose out on the trip too.", "NTA.  A grown-ass man needs to take care of his own crap.", "Sounds like my ex tbh. Nothing was his fault. It was always somehow my fault.\n\nIt got tiring and annoying. He's irresponsible af and can't handle the truth about him.\n\nI know I'm a bit dirty with stuff. I leave a lot of important documents at my parents for that reason.\n\nAnd I'd never blame someone else for my inability to keep up with things. NTA but he is for sure.", "NTA. You are not his mother. He is a grown man, who should be capable of holding his own legal documents.", "Nta. Hes an adult. He needs to act like one.", "NTA Sounds like purposeful weaponised incompetence and seems like he's purposely making you responsible for everything so you can take the blame for it in future and absolve him of any blame or a way of control in a relationship. He's pretty much wearing and waving big red flags", "NTA. This is called weaponized incompetence. You’re not his mommy or babysitter. He’s experiencing consequences of his own behavior.", "NTA.  You’re his gf, not his Personal Assistant, and he specifically told you to stop “holding” his documents for him.  Hope you have a great break from his useless arse.", "Jesus. Why are people like this even in a relationship? You’re both TAH.", "NTA of course. You're his girlfriend, not his valet. Honestly you might want to reconsider even being his girlfriend. It seems like you can't win with him and he insists on trying to saddle you with a full time job of looking after him. Find someone lower-maintenance. Maybe being on his own for a while will give him the opportunity to learn some self-sufficiency.", "ahahaha he accused you of not bringing his passport after he scolded you for his ID. nope NTA he's a grown ass adult. he should figure out this stuff at one point or stop complaining.", "NTA. \n\n\nTbh, when you left, did you feel relief that well, he was no longer coming? Be honest with yourself because if you did, great, that's you telling yourself you're sick of his shit and don't need it. \n\nIf you felt guilty however, well, I can't tell you what to do or how to feel. Just don't feel guilty that he couldn't grow the hell up and bring his own shit. \nIt's better that he forgot it here at home rather than on a different continent. It is what it is, and it can't be taken back now or changed. \n\nGo enjoy yourself, and have a happy new year. If you drop some body weight aka him, so be it.", "NTA \n\nHe told you to stop treating like a child and he’d take care of his own.  \n\nDoes he want you as his mom or a girlfriend cause he can’t have both.", "NTA, I personally would recommend dating a functioning adult but you do you", "NTA\n\ngoing out of the country the #1 thing is a passport. Hopefully dude realizes that this is something he needs to work on otherwise everything will just keep being everyone else’s responsibility and fault.", "Obviously this is coming back as NTA, because be responsible for your own shit etc\n\nBut I think we all know you DID do this on purpose.  A small asshole", "NTA he can fuck off, he’s a grown adult and you don’t need to hold his hand. It’s actually embarrassing your bf cannot remember basic essentials", "Nta", "NTA\n\nLet’s be blunt, Paul’s a fuckin’ idiot.", "NTA\n\nWow. He gets mad at you for having his passport in case it is needed. Then he gets mad at you for not having his passport when it is needed. And on top of it he had a check list. Did this guy even pack his own bag? Can he even tie his own shoes? How does he keep a job?\n\nYou need to enjoy your trip and not worry about him. It's his own fault for missing out. There was no reason for you to miss or have to pay extra for the trip because he can't remember basic things. I'm glad you took off without him. You did the right thing.", "NTA AT ALL. You deserve better", "NTA. With him for 3 years?  It's time to get a new boyfriend.", "OP seems to mekke you don't have a boyfriend, you have an overgrown child that thinks you are his new mom. OP NTA", "What a great story, sorry to say. Enjoy your vacation hon, that's all i can say. The big baby is old enough to be home alone, right? So NTA. Oh and could you give us an update on what you did with this episode?", "NTA\n\nYou do realize that nothing will ever be his fault, right?\n\nHe isn’t just upset he missed the vacation, he’s accusing you of *revenge* for not giving up something he couldn’t do because of his own actions.", "NTA\n\nHomeboy needs to learn accountability and take ownership of his own actions ESPECIALLY in a serious relationship. \n\nAnd by serious relationship I mean the relationship an adult has with life. 😂 But also especially in a serious relationship with a person.", "Do you have to nurse and diaper this jackass too? **DAMN.**", "This post is hysterical!\n\nIs he your boyfriend or your son, lol 😆. \n\nYou had it right the first time---just \"leave him behind\", but this time for good.", "NTA- he actually told you to stop carrying his documents. Now he is angry because you did what he asked. This is how 3 year olds act.", "NTA. You wrote him a list and him forgetting it is still your fault? A 27 year old really needs to do better.", "NTA. \n\nHe’s a grown man. He also specifically asked for his docs back, and gave you a hard time about “holding” them. \n\nTime for him to grow up…", "It’s a 50/50 you should have told him you were going but he wanted the passport so he got the passport", "NTA but if a partner really cares for you they would encourage you to go on a trip they likely wouldn't make because of a mistake they made. They would NEVER blame you for their mistake or try to guilt trip you out of enjoying something because of their mistake. This guy sounds like a master of weaponized incompetence. Drop him like the sad potato he is", "NTA. \n\nWeaponized incompetence doesn't just apply to doing the laundry.\n\nHe fucked around.  He found out.", "I love how he ‘maintains his position’ that all documents have a digital version. There is a saying - ‘you fight reality, you lose’ - and this guy is the poster child for it. \n\nI also love how he scolded her at the airport!!! My goodness. This guy is something else…\n\nNTA. I’d be considering enjoying not just this holiday but the rest of your life without him.", "ESH\nHe’s right you don’t need important documents on you at all times. My family keeps important documents at home in a safe, we grab them when needed or for trips. Depending on what country you live in, a DL should be enough for daily activities or just going to work.\n\nYou did tell him to bring it and he didn’t so that is on him.\nBut in my family we communicate and make sure we have our passports before we leave the house.", "NTA. Who the hell expects to travel outside the country without their passport? That's the first thing I pack on a trip outside the U.S., and I will check multiple times before I leave for the airport to make sure I've packed it, since the closest airport to me that flies outside of North America is easily a 1.5 hour drive away. So if I forget it, I'm missing a flight and possibly my entire trip - and that's on me. \n\nHe's a grown-ass adult and you're not his mom, so the fault lies entirely with him. I hope you have a great trip!!", "NTA. He can’t have it both ways, and has been mostly\nsheltered from the consequences because of your actions.  \n\nHe sadly needs to get it ingrained to double check for valuable paper-only documents before leaving the house.", "NTA. If a grown man doesn't know he needs to take his passport on a trip out of the country, there's not much hope for him. You aren't his mommy. He needs to grow up. I don't know how you can stand this behavior.", "Nta", "NTA. Enjoy your trip!", "NTA.\n\nIf he doesn’t figure it out from this then he’s hopeless", "OP, you have to save J Lo's \"I ain't your mama\" song and play it every time he expects you to be responsible for his adult life and decisions.", "NTA. I am gobsmacked this is a 27 year old man you are talking about. I can't imagine how tiresome it is being with someone like him.", "NTA. Let me give you a good advice that will save you a lot of grief, time, energy and money - ditch this child now while you still can. I was married to someone like this for way too long, he never learned to take care of his own shit, always blamed me for it - just like you bf is already doing, and with time became emotionally and mentally abusive about this. Run girl while you still can because if he hasn't learned at 27, WHILE YOU MAKE A LIST FOR HIM like for a 6 yo, he will never learn and will make your life a living hell.", "NTA. Those lists you made for him is above and beyond what you should be expected to do. Definitely NTA!", "NTA. You really can't win with him. Glad you didn't let him ruin your vacation.", "He has zero standing to blame you. You have done absolutely nothing wrong. Enjoy your trip away!", "It’s time to end this relationship, he needs to learn to grow up", "Do you also wipe his butt after he poops? Because it sounds like you married a tioddler. You are nta, you are the nanny.", "NTA, he wanted you to leave his documents alone, and you graciously obliged. Let it be a life lesson in responsibility. Enjoy your trip, and happy new year!", "NTA\n\nHis documents, that he wanted back, are HIS responsibility. He pushing 30 ffs and still needs this level of hand-holding. Is this really what you want to put up with forever? I'd suggest some reflecting over this trip.", "No it’s totally his fault all of his documents were at home you’re his partner not his mother and he wanted the responsibility of having documents in his own possession so he has no to blame but himself. And even if he had at one point thought you would bring it you made him a list of things it pack/bring for the trip and he either didn’t read it or assumed you would have it. It’s 110% his fault he missed the trip enjoy your vacation!", "NTA - I also cannot hold on to a piece of paper and  have lost/misplaced my wallet a LOT. Like Christmas gift checks, W2s, drs reports the instant I get something important I scan it. But for traveling I find that shit like a month out and pack it then and then when I’m doing the rest I touch it and then the night before I check again.", "NTA, but y’all should break up.", "Come ON. You’re not the AH", "Mmm, I love the smell of weaponized incompetence in the morning.\nNTA.", "Nta. Grownups pack passports, set alarms and learn how to email/make lists/manage money.\n\nYou deserve a grownup.", "Some people take advice; other people need consequences. \n\nNTA. And life is too short to take shit from weak men.", "NTA and your bf is an idiot. Dont procreate with him.", "NTA\n\nHis missing the trip is ultimately his fault. Not your job to coddle.\n\nBut I have to ask: Do you think Paul might have ADHD? Is he forgetful in other areas? Doesn't perform chores when he's supposed to? Forgets about plans? Loses things? Unprepared? Late? Emotionally sensitive, seeming to overreact to small things? These could all be signs of ADHD, which would mean it's not _entirely_ his fault. Though if he's showing patterns of ADHD behavior, it's still on him to figure that out and seek treatment.", "YTA for staying with him. You know he's like this yet continue to remain in the relationship.", "NTA, OP your not this guy's parent and I'm guessing here that the passport isn't the only issue you have with him. Especially in the forgetting department. Do you really wanna spend the rest of your life with some guy who can't even take responsibility for losing his own passport?", "NTA\n\n\"Be my mommy! No, not like that!\"\n\n\\- OP's BF, probably", "NTA\n\nHis passport, his responsibility to bring it!", "This should be a dealbreaker: no one should place the blame on a partner for one’s own folly. That’s a major red flag. There are so many posts like this where partner is angry the OP didn’t wake them every morning because they lost the ability to wake up with their own alarm. \n\nThis guy is presumably an adult and functioned in the years prior to his relationship, OP gave no indication she has adopted this man. \n\nMy conclusion: Lucky you’re not married. NTA. Good luck OP.", "NTA. \n\n& honestly, no sympathy. He’s a grown ass adult who needs to respect the purpose of legal documents. \n\nHis documents, his problem.", "NTA He wanted to be responsible for his own documents", "How could you be TA? You did exactly as you said you would.", "NTA But why do you really want to be with someone blames you for him not being able to act like an adult? His attitude around this is both controlling and childish. A loving partner wouldn’t have scolded you in either case, and treated you like you did something wrong when it’s him who doesn’t have his stuff together.", "NTA", "NTA. How does he manage to cross the street every day? OP, do you have to remind him to get up, get dressed, go to work? \n\nI get you have been together for 3 years but since he isn't getting better about this, in a world where identification is required for so many things and then yells because first you were in charge of documents and then didn't want you to be in charge but now he can't figure out how to do it himself?", "NTA. I have recurring bad dreams about leaving my passport at home, but it's been decades since I flew regularly. Each person is responsible for themselves, even in my half-way decent marriage, we checked for ourselves, even \\*gasp\\* at at the elderly age of 30 plus.\n\nPaul is a total ass. Might need to rethink your relationship. This level of cluelessness is not going to go well for you, or Anyone, in future. WTF is he thinking! So sorry. He is the AH", "Lol OP have a blast and happy new year! Don’t let him rain on your adventure.", "Why is it so difficult to be an adult? Especially after scolding you about having the passport when he needed it.\n\nThe only lightly asshole thing might be that your celebrating new years without him so although it really is your partners problem and not yours maybe this once you could have reminded him when in the car and about to leave the house. But I do understand that you didn't\n\nSo NTA", "NTA. You need to RUN. Unless you want this to be your life because you are surely in store for more of this oafish behavior. Doesn't matter that you love him. There is a HUGE difference between loving someone and being able to build a life with them.", "NTA. He wanted to be responsible for his documents again you gave him that responsibility as a grown adult. He failed.", "This isn't stubborn, this is stupidity. I'm not sure I can understand why you're with him? Why anyone would be with him? What country are you in that uses the digital versions of id's everywhere? That's never once been an option for me anywhere. NTA but best of luck with this dummy and his weaponized incompetence. Look forward to many more issues.", "NTA but it does make me nervous you’re carrying your password around in your purse on the daily", "NTA but you knew he’d forget. You could’ve gently reminded  him not to forget his passports. Kinda seems like you want too prove something.\n\nNot saying what you did is wrong. But sometimes we win the battle but lose the war.", "NTA.", "And OP very clearly communicated that she was no longer taking responsibility for them.\n\nBesides, even if my partner was holding my documents, I'd still ask to make sure.", "NTA\n\nHe wanted his docs back, yet he has incompetence issues. You can’t blow hot and cold at the same time.", "Yeah, don't date men who scold you while expecting you to be mommy.", "NTA.  Weaponized incompetence is not sexy.", "I came here to say this. First, NTA. More importantly, time to make him an ex. \n\nI have ADHD. I forget shit ALL the time. You know whose responsible for it? I am, because I’m a grown-ass man. \n\nAbout 10 years ago my family was flying to NYC (wife, 2 kids, my mom). The day before I ran a 5k and twisted my ankle prettier severely.\n\nWe got to the ticket counter and low and behold I was missing my ID because I’d taken out of my wallet so I could travel/run the 5k without worrying about my wallet. I forgot to put it back.\n\nSo I had to hobble to the cab line, race home, find my damn ID, race back to the airport and then get a special electric cart ride to the gate where I JUST BARELY got on board. \n\nIf I’d missed the flight, my family would’ve flown on without my ass, because it was my fault. \n\nNTA, and time leave such a selfish prick.", "You make it sound like he did it on purpose. He’s an idiot not a genius.", "Seems like he consistently blames OP for his problems.", "> Maybe he’ll learn to accept your help\n\nI sure hope not. I hope OP has finally figured out that she deserves a competent, kind adult as a partner.", "Agreed with all of this. BF has now experienced a very expensive life lesson—the kind of mistake that rational people will only need to experience ONCE to learn from. The question for me is, how rational is BF?", "Yes, this part is important I think. He made an instant connection between his complaining about her holding his documents, and her no longer carrying them which resulted in him meeting the consequences of his own actions. \n\nHe made the WRONG connection, but he is aware enough to understand action = result. Really makes me wonder how inept he actually is. It seems that no matter what OP does, he blames her. That is very suspect.", "Straight up!  I know this is extreme but it made me think of parents who unintentionally leave their child in a closed car on a scorching hot day.", "LMAO!!!!", "im sorry he bitched her out when she was helping him earlier by holding his documents since is incapable of being an adult. Im glad you changed the opinion, but still really weird you jumped to that", "OP is absolutely NTA. BF is 100% YTA. He sounds really tiresome.  OP, you know if he joined you, he'd be giving you a hard time while on vacation. So just enjoy yourself while you're away.", "[removed]", "ESH. \n\nShe knew he was terrible at remembering,  it was a expensive trip, but a a bare minimum she could have asked if he had it before walking out their front door. This is what people do who care about each other. My husbands memory is excellent but I still remind him and vice versa. While she may not be T-A, but I think for something this big on a different continent she could had mentioned it. \n\nBoyfriend is T-A BIG TIME for not recognizing his issues or trying to come up with a way/system to help himself or let her deal with all documents without bitching about how she does it. He needs to grow up.", "You're on to something. \n\nIs there a name for being a horrible, arsehole,b#tt head in a relationship in order to make your partner so miserable they break up w you - so that you don't have to to the breaking up.\n\nChrissy Metz has song lyric \"You made me do the leaving and you made me take the blame.\"\n\nMy ex did a version of it for 5 years.\n\nJoke was on him. He gaslighted me so much I could not discern reality from what he said a thong was.\n\nI was miserable but not looking at leaving (bc again the unreality, I couldn't make a sound decision).\n\nLol, can you imagine trying to be the worst, meanest schmuck you can be for 5+ years and your partner won't leave?\n\n😆 he was I-Rate! 24/7...that his wife wouldn't leave & chose to keep tolerating his crap.", "As someone with ADHD, it is possible. I usually fly domestic which takes a driver's license so I don't usually need it and it can be forgotten. But the big difference is, if I leave my passport at home it's my fault and I know I only have myself to blame. The boyfriend is trying to blame OP, and have her miss her trip, because of *his*  mistake! And she wrote him a goddamn list!!!\n\nThis is an expensive lesson for him but one worth learning.", "Not to mention continually misplace his wallet and car keys.", "Actually her having to hold all the documents because he couldn't be bothered was a huge red flag. I would've never done that. Let him figure it out on his own and keep to whatever schedule or itinerary without him. And who travels to another country and doesn't check that they have their passport? I traveled in June and probably checked for my passport a dozen times! Him expecting OP to have it just means he is placing ALL OF the travel work on OP. Therefore, anything that goes wrong is OP's fault. \n\nI would dump him.", "You’d be surprised", "The wheel is turning but the hamster is dead", "I mean if the women in question are dating men who display traits of weaponized helplessness, then yes, they should leave them, and yes, they are worth it", "Oohhh those young *professional* women, what with all their own money, self-respect and lack of interest in mothering their useless boyfriends. That must be so threatening for you.", "found the guy who got dumped because a cosmo article was more inspiring than anything he contributes to a relationship...", "This like he is rude to OP when he\"s the one who forgets everything an d insists that digital has to be accepted. Yells at her when she is helping him. She make a checklist (awesome!) he still forgets. This is on him not OP", "Oh jeez that cracked me up. I was having a lame day but that tickled me. Hurr durr", "Weaponized incompetence.", "I once figured out 8 hours before a flight I had misplaced my passport. (To this day I still have not found that damn passport.) but you know what? I manned up, rescheduled my flight for 8 hours later, and then begged, pleaded, and offered to bring lunch to the US State Dept passport office if they could print me a new one in time. And they DID! That’s called being an adult and working the system properly when you screw up. (Side note-I also learned to always listen to my inner self - basically it was a sign I shouldn’t have gone on that trip if I lost my passport. Had to come home early bc of a family medical emergency.)", "You know adhd is a real thing right? You can be frustrated but calling people fucking stupid is gross.", "Assuming you missed the part where she made him a LIST?", "OP already did more then the bare minimum. Why should she still do the mental labor when her boyfriend is a lazy ass and rude to her on top of it?", "Thank you for the suggestion. What a lovely little macabre story to end the day.", "Yeah, it’s called being an abusive coward. I’m sorry you had to deal with that and I hope you’re in a great place now.", ">>Not carrying identification, tickets to an event, or a passport prevents him from doing things he wants to do. \n\nHardly. He probably wants to feel like he controls her more than he wants to go on vacation. Note how he didn’t generously tell her \n “hurry on, I’ll catch up ASAP! I don’t want you to miss your fun!” Nooooo, she had to accompany him home for NO reason, and likely miss the trip she’d been eagerly looking forward to.\n\nHe’s awful. I hope they break up. NTA.", ">And who travels to another country and doesn't check that they have their passport? \n\nThis was my immediate question. Dude actually got all the way to the freaking airport for a foreign trip without once making sure he had his passport?! What the hell", "No motive.", "but even then he is 27 he knows he needs these things. You cant bite the hand that feeds you when she was helping him. This is just stupidity.", "he yelled at her when she was helping you can;t bite the hand that feeds you and expect them to help always", "This isn't tit for tat. This common knowledge when you fly to another country you need your passport and a boarding pass. Without these two things you are not getting on a flight or through security. If by the age of 27 you can't do that and when the person who was helping you is yelled at by you for your incompetence then thats on the BF not OP. She has done far to much. These aren't minor infractions. His incompetence would have made OP also miss the flight and trip. She would have gotten yelled ar for that as well are you fine with that?", "Im sorry but I have ADHD but I know that I need a physical document for everything even if it is digital. This is on the BF not OP", "What the hell? Who's talking about ADHD and why do you think I'm insulting people with ADHD? I'm talking about people who have a literal listmaking passport including spouse and still manage to fuck up. Why are you even referencing ADHD?", "Didn’t take long for someone to pull an ADHD diagnosis out of their ass. As is tradition on this sub.", "Thank you, we're doing great. My son will be 39 on his birthday in 2 weeks.\n\nWe celebrated when his dad died. He was that big of a bastard.", "😊 lol, we need a funnier moniker 👊\n\nAw, thank you lovely redditor.\n\nI AM! In a stupendous place.\n\nTurns out divorced & 56 is a very hot thing to be right now. 🤗\n\nHope your New Year is as bright as the 'light' you shone over here tonight 😘", "Your argument is empty and nonsensical. He didn't purchase airfare and drive 8 hours (2 hours each way 4x)  for the pleasure of controlling his girlfriend. He's an unreliable dumbass. Failing to accompany his GF on a planned trip because he was too incompetent to pack properly definitely makes him an AH. But he didn't create this fiasco to purposefully miss the flight and ruin the vacation. He certainly didn't dump money down the drain, create a clusterfuck, and then spend a full working day in the car just so his GF would carry his passport on future trips.  \n\nHe's also an AH, completely separately, for how he treated his GF after his eff up. He should never have suggested that she return home with him. He shouldn't have responded angrily when she refused. It was completely unreasonable to expect the OP to miss her flight just because he did. Responding with anger when she chose to travel was unacceptable. Yelling at her was also completely uncalled for. All of these things are AH moves. \n\nHe's clearly an AH. He just didn't \"weaponize his incompetence\" in this instance. That would require him to actively choose to put these events into motion. He did not. He's just dumb and lazy which is another way of saying incompetent.", "I touch my passport approx every 15 minutes to make sure it is still there when travelling internationally.\n\nLike the anxiety it has teleported out of the zipped section of my handbag while in the line at the airport is real.", "Ooo happy birthday to him! And happy life to you! 🥳🎁", "Absolutely the same. I have this awful habit of sticking my passport in an extra-secure location that it can't possibly fall out of, which invariably means it's at the bottom of my bag, then getting paranoid that I somehow forgot it and having to unpack shit from my bag just to verify that it's there. This dude somehow *got to the airport* without bothering to make sure that he had his passport or even knew where it was?!", "Notice he acknowledges that he scolded you but hasn't apologized for doing so. Hasn't told you, you were right for holding onto his documents for him. Instead he tried to blame you for doing what he asked...\n\nNTA, enjoy your vacation and maybe he'll take this as a sorely needed life lesson.", "NTA for leaving him behind, because he is old enough to know that he needs his passport on a trip abroad. And if he knows that he struggles to remember, he should set up some sort of reminder by making a list or setting up a notification on his phone.\n\nThe part that is weird though, is you keeping his documents on you when you're home/at work. I agree with him that those documents should have been home for him to access freely if he didn't want to carry them around himself.\n\nI also think that you probably still could/should have given him at least a verbal reminder to pack his passport before the trip. Not necessarily packing it yourself, but something like \"Don't forget to bring your passport\"/\"Did you pack your passport?\" while packing your own or checking your list a final time.", "Tickets.  Money. Passport. On an old Ab Fab episode it's Edina's mantra before leaving for Paris. I use to this day weather heading out to visit a friend for overnight or traveling cross country.\n\nYou are always going to need ID, credit cards and/or cash, and your boarding pass or hotel room confirmation number, or equivalent.", "NTA. He sounds like a literal child whose hand you have to hold because he can’t comprehend simple logic. My advice is to keep your phone turned off, or at least his texts/phone calls on mute, and enjoy your trip. My guess is when you get home you’re both about to have an argument that’s going to be make or break for your relationship. \n\nAnd please don’t go back home to pacify him. If it’s too expensive and/or booked up for him it’s going to be the same for you. You might as well stay and have a great trip. Also, if your friends are telling you you’re not wrong, you probably aren’t. Listen to them. They have your best interest at heart, and are going to make your trip memorable even without your bf.", "Nta\n\n\nThis is your future. How many times will he blame you for his mistakes.", "NTA. \n\nWeaponized incompetence is a huge red flag.", "I'm glad you stopped babying him. A grown man, going on vacation knows what kind of important things to bring. Even giving him a packing list wasn't enough for him to remember. He probably wanted you to come help him find it cause he had no idea where it was. This is what is called a life lesson. Hopefully he will remember things he needs instead of expecting you to do it for him. NTA OP. He needs to grow up.", "NTA- look, I get that people aren't perfect and if you want to be in a relationship you'll have to put up with things. Forgetfulness, in and of itself, isn't an automatic dealbreaker for a lot of people so if it was just that, then I wouldn't ask why you are with him.\n\nBut this seems so much worse. He has some idiotic \"belief\" that digital documents are fine and always acceptable, but this seems like a way to skirt responsibility for a pretty normal part of being an adult- carrying acceptable forms of ID. He then blames you for being the responsible person and having his documents on one of the (seemingly several) occasions he didn't come prepared to an event with a proper form of ID. And then, when you actually decide to treat him like an adult and let him take some responsibility\\* for packing his own passport, he screws up and blames you. Then tries to manipulate you into missing a trip so he has company while he fixes his self-made problem. And then when  you go on your trip (good for you!!!!) he guilts you to the point that you took time out of your vacation on another continent to ask a group of internet strangers if you're an AH.\n\nSo, given the totality of his actions, I must ask- why are you with this AH?\n\n\\*I'm being kind by saying he had to take responsibility like an adult because you made a packing list for him. WTF is his problem?", "As someone who struggled with untreated ADHD for a long time, I'm curious to know if he is actively forgetful about more than just his passport. Consistently forgetting things, even in the face of reminders, can be a large problem for folks, and it can be a strong source of conflict in relationships. I think i would like more information before i could feel comfortable ppassing judgement. it could be that no one's an asshole, and there is a larger problem being highlighted, here. \n\nPeople have made valid assertions that this could be toxic behavior, but it can be really difficult to distinguish between what people consider childish behavior, and an untreated cognitive difference.", "NTA. But aren’t you tired of dating someone that sees you as his mom?", "NTA. He told you not to hold onto his documents. You agreed to that request and did not take his passport. This is all on him.", "NTA. He's a grown man. He asked for his documents back, so he took responsibility for it. Not your problem!\n\nEnjoy your trip!", "NTA.  You had his documents, he has the nerve to scold you for it, you have them back and told him he was responsible.  Do you really want this to be the rest of your life?  It will be.  He will not do what is required and blame you for the negative outcome.", "NTA, your boyfriend sounds like an asshole who doesn’t know how to organise his things and blames it on you so that he can protect his precious ego", "As you point out - he is an adult. He needs to learn strategies to remember things. Now that he got burned I’ll bet he doesn’t forget his passport again!", "NTA. you warned him enough.", "NTA\n\nI'm sorry but if your relationship got serious and you guys decided to get married and had kids it will be disaster..\n\nWhat about your marriage license or your kids' birth certificate? \n\nWhat if he forgot to take the kids from school or attending school event? Or forgot they are with him when they are going somewhere without you?\n\nWhat about his other personal things? Wallet, car key, etc..\n\nAll the responsibility will be on you and he will be there to scold you for every mistake you make.. and the older he got , I afraid it will be worst..\n\nIt's not worth it..", "NTA, not only is he an adult and more than capable of being in charge of his own documents, as he insisted, but if he really wanted he could have gotten a later flight. Maybe he'd miss the first day of the trip or pay a little more, but that's the punishment for being an idiot. The only reason not to rebook is that he wanted to make you feel bad and have more ammunition for his side of the argument.", "As someone with absolute shit memory, first rule of travelling is to make a list of things you'd absolutely need (cash and documents being on top of that list) and ensuring that either you or the person you're travelling with has that stuff BEFORE you leave. NTA. and this is abusive behavior to blame you for his forgetfulness or expecting you to make a 4 hour trip because he was irresponsible.", ">I forgot one detail: I always make a list for our trips of what to take, his passport was on the list and he still forgot it\n\nThis makes it clearly NTA. \n\nI will say however, that I have been with my wife for almost 20 years, she is a very responsible adult, as am I, but if we were going on a trip like this, we would BOTH be asking each other repeatedly if we have everything critical like tickets/passports/vax cards and any other critical travel documents and we would BOTH be responsible for ensuring that we have them. \n\nWe are a TEAM. It's not me vs. her.", "Please wise up before you end up marrying this child. \n\nHe sounds exhausting.", "NTA.\nIt’s grown-up man, give him his documents!", "Dude defo forgot his docs on purpose. Why do you think he asked for them back in the first place?", "NTA. He is a grown ass adult he should be responsible for his own documents. I hope he is going to be your ex boyfriend after you get back from your trip.", "You dont need his passport while you are out and about .. that should always remain at the house..  list or not you know hes a dufus but you must love him. You chose to stick it to him this way almost knowing he was going to forget it. NTA but if you wanna be with a dufus.....", "NTA, and hopefully single soon.", "NTA. \n\nIt is not your responsibility to make sure another adult has their documents when you leave the house. It is not your responsibility to make packing lists for another adult. Running lists by each other to make sure neither forgot anything, that's normal. This is unhealthy. You are his partner, not his manager or parent. \n\nMy husband has pretty severe executive dysfunction, and I don't pack for him or make sure he has his travel documents or make packing lists. I remind him to make sure his passport is valid, is maybe the extent of it, but our marriage became a lot healthier and happier when I stopped covering for his lack of planning. The difference is my husband agreed the burden of managing him was not mine to bear, and apologized for putting me in that position. Your boyfriend is under the mistaken impression that you work for him and at the same time are his manager. It doesn't work that way.", "NTA ….BUT… did u set him up to fail?  Changing the behaviour after 3 years might not sink in right away.  In the words of my mother, do you want to be right or do you want to love them?  Another approach could be to verbally remind him (just once) that he needs his passport and point it out on his packing list…", "Does he want a gf, or a mom?\n\nNTA", "NTA", "I would say YTA. But that might just be the way I was brought up. In my family the women are the household head and they are (as we joke) the house minister. We take care of the important things such as passports, finances, plans, vacations ect and the men are the once taking care of cooking, cleaning, laundry, ect.\n\nIn short : you knew that he is forgetful so you could have at least said something along the lines of \"did you pack everything? Your passport is with you\"? Just before you left ft the house.", "NTA. He's 10000% in charge to bring his own belongings and it should have been that way from the get-go. He has no one to blame, but himself for this.", "NTA and before anyone swoops in and says how mean you are and your boyfriend probably isn’t neurotypical… and that’s somehow an excuse for taking 0 responsibility for himself…\n\nLOOK. He is a grown up. He is almost 30. He had a list. He had a visual cue. He insisted on keeping hold of his passport. He insisted on his wrong interpretation of documents. \n\nHe fucked around and found out.  \n\nI have ADHD. I am humble enough to ask my wife for help with certain things. For big trips I routinely ask her to help me run through my checklist. Guess what is the first thing I pack because I’m not getting on that plane without it? MY PASSPORT. \n\nPaul was repeatedly an asshole. It is time to let him face natural consequences for his actions. Don’t gloat about it. Be kind. He is probably ashamed underneath his faux righteous indignation. But he needs to learn to either ask for help OR build a system so he doesn’t need to.", "NTA, however, there's no going back together after this, and he has access to all your belongings while you are in another continent. I'd definitely be worried about that.", "NTA and don't you doubt it for even a second.  Frankly, if he refuses to accept responsibility here, that should be the end.  I'm not even joking - this isn't some annoying but ultimately trivial habit.  This is a high level of feckless irresponsibility about things of vital importance, about something you two have previously argued about and for which he has no good excuse for ever forgetting again.  Forgetting your passport on a 12-hour international flight is no small potatoes!  What else is he so irresponsible about that you can't trust him?  Your household finances?  Your home mortgage?  Your future child?  I personally couldn't tolerate it, this story is just pathetic.  This is a massive red flag waving in your face, I hope you take heed.", "NTA \n\nI'm in my 40s and many of my female friends are divorced and dating. And you wouldn't believe how many of them tell exactly the same story. It's always the same: At some point I felt like his mommy, I felt like I had +1 child to care for, not a partner.", "You are not his mother. He is not a child. He needs to grow up and take responsibility for his own actions (and his own passport)", "Far out, I remember reading this exact story about 5 years ago. Bit the outcome is the same NTA. How does he function with other things? Like a career etc?", "Why would you have the documents on your person? That’s ridiculous. The documents should be locked at home somewhere safe not on you smh. I take it that’s what your boyfriend meant. \n\nKind of stupid for your boyfriend to ASSUME you had his passport without even asking as well. Nonetheless, NTA but I would definitely rethink carrying the passports on you as opposed to a safe place at home.", "NTA. He fucked around and found out. \n\nAlso scolding?? He’s not your parent. Let him be responsible for his own crap then. If he wants to whine about it, he can either learn how to manage his crap or you leave. Don’t deal with his scolding.", "NTA. He made it very clear to you that he didn't want you carrying his documents. You listened to his request so the only person he has to blame is himself. It seems easier for him to blame you than himself. Stand strong with your stance.", "NTA. You are absolutely not responsible for carrying someone else's passport unless you're that person's parent and they are a child. Sounds like he wishes he were a child so he wouldn't have to be responsible for things that fall under \"basic adulting.\" That makes him the asshole in this scenario, and a bad bf in general if he blames you for his actions/inactions on a routine basis. I'd leave a relationship like this.", "NTA.\n\nAs others said, this is a pretty big red flag. It sounds like he wants to be with someone who acts like his mother. You're his girlfriend and he's an adult. He needs to either grow up or you need to be content spending your life as his maternal figure (gross)", "Forget about the fact that he wanted his documents back. Forget about the very rude scolding. Let’s all remember and realize that he’s a grown ass man. You are not his mother. NTA", "NTA - that’s not petty that’s just minding your own business; like he wanted you to do. He’s old enough to pack his bag. He‘s old enough to not just assume you would take care of it and ask. He’s old enough to face the consequences of his own actions. And after that backstory it’s not on you to drop your plans just because he’s to unorganized to stick to them. Under different circumstances you should stay back with him, but not in this case. You served him like a child and he still fucked up.", "YANTA \\[you are not the asshole\\].\n\nDo i even need to explain this? Why not show some respect to your friend before your boyfriend?", "NTA\n\nIn what universe is it your fault that he was too irresponsible to remember his passport. You're not his mother. \n\nYou did exactly what was asked of you. Paul wanted you to stop holding his documents, you stopped, you and your friends went bye bye. \n\nTell Paul to stay warm and enjoy your trip.", "NTA", "NTA", "Nta and enjoy your trip and rub it in his face about how much you enjoyed your trip it might be a lesson for him", "Stop babying this man. NTA", "NTA and this is a huge 🚩", "NTA \n\nI dated someone who did the same thing. Happiest moments was when I left that relationship. Stopped being mommy.", "NTA, sounds like he’s got ADHD", "NTA He made his bed now let him lie in it. If nothing else he'll probably remember his documents next time", "NTA.\nPaul is a grown ass adult.", "Info: can you elaborate on what you mean by he thinks everything can work digitally? This is an odd thing for him to keep insisting after the first time hard copy is needed. Also what even *can* work digitally for identifying documents?", "NTA, you are a mf Hero and your actions only showing that you have healthy relationship with yourself. Please teach me, master", "NTA, also he needs to grow up and take some responsibility. I wish you luck in the future, seems like a spoiled baby.", "NTA. When I am go on an international trip, I check my documents at least 3 times, including expiry date to make sure I didn't bring along one of my old passports by mistake. I get rid of the old ones, but you never know. It just might have slipped in there without me looking. :-)", "I'd like to hear the other side of this story but I have a feeling that it would still result in you being NTA", "NTA. Let him read all these comments. He should do better. I hope you have a nice time despite all of this!", "NTA - he’s an adult. It was NEVER your responsibility to carry his documents.  Not your responsibility to make him a list either.  Turn your phone off and enjoy your holiday.  Can you be bothered being in a relationship with someone who is so careless they would ruin your trip - this isn’t the first time.  We can all do stupid things once - but a normal person admit they were stupid and makes extra sure you don’t do it again - I’d be stapling my passport to my head if I’d forgotten it once….. NTA.", "I have ADHD and I misplace/forget stuff a lot.   The difference is that I am aware of my struggles and I've developed coping mechanisms.   Documents are always in one place.  Multiple checklists for trips, that I print out and only highlight when it is packed.   Special organizers for my luggage where specific things go (like a documents pouch for plane tickets and passports).  Google Calendar alerts a year before my passport expires, and a week before the trip in case I need to buy stuff.  And even after all that, I still double check it all again.   You are NTA, he needs to learn to cope with his issues or you will start resenting him for them.", "NTA", "ESH \n\nId say mostly NTA but theres abit of AH too. \n\nI think its his responsibility to bring his own passport and if hes late you dont have to miss the flight. In fact, if hes VIP room he probably bought first class and they can probably reschedule him for the next flight out for a little bit of a fee. \n\nHowever, I felt theres a little bit of AH where you turned off your cellphone. You do have to turn off your cellphone on the flight but it comes across to me like you turned it off before you HAD to to deliberately be unreachable. Id say this part is not so nice.", "NTA. He is a fully grown man. It’s nonsensical that he can scold you when you have the documents, only to scold you when you don’t have them and blame you for his incompetence. The FIRST thing you pack when you’re travelling abroad is your passport, how anyone can forget that is beyond me. \n\nYou’re not his mother or caretaker, you’re his girlfriend. I’m happy you chose to go on the trip anyway, and don’t allow him to ruin your holiday, but I’m afraid you’re going to have to brace yourself for when you return. No doubt he’s going to continue blaming you for “spoiling his trip and new year”. Depending on how he behaves, you may need to seriously reconsider the relationship, but that’s all up to you. I couldn’t imagine staying with someone who can’t hold themselves accountable. Best of luck to you!", "NTA he needed to remember his passport and forgot. He missed his flight and you didn't... No point missing both! He will hopefully remember next time!\nAlso.. VIP room? You mean the lounge or am I missing some other VIP rooms when I fly from the states?", "NTA, but for fucks sake, how can you possibly use the words \"capable adult\" to describe him?  I've known 10 year-olds who are more responsible than him.  How much hand-holding are you going to have to do for this guy, if you stay with him.  Dump him and try dating a grownup.", "NTA\n\nThe whole background story is irrelevant. If you’re going on a trip abroad, you make sure you have passport and money at least two weeks out. Upon leaving for the airport, you double check you have money and passport. Everything else can be bought etc. \n\nEven if someone else is looking after documents, you check in with them before you leave for airport. Unless you’re a child. \n\nHe needs to get over this and accept he put himself in the situation. Big problem going forward if he doesn’t.", "NTA LMAO good on u honestly.", "NTA ! \n\nHe asked you to keep his important stuff, you did and then scolded you for doing what he asked of you. Then gets angry again because you didn't do what he asked you NOT to do ?!  You even wrote a list ! He's acting immature and you are not his mother! \nSend him this post because he clearly needs a wakeup call and to start wearing his big boy pants. \n\nMost importantly, enjoy your trip and happy new year 😊", "Not the A*\nBut! I don’t see in the OP post that she communicated with bf that she was still going on the trip. It reads as though she turned off her phone and stopped communication with him. That is A* behaviour.", "NTA. He’s a grown ass man responsible for his own shit. You tried helping, he got mad. You made a list, he still forgot. His incompetence is not your fault, and you shouldn’t have to miss anything because of it. Have a wonderful holiday", "Please don't date a baby who blames you for what he did.", "The boyfriend has a serious issue. Imagine loosing your SIN card now that’s dangerous.", "Nta. My Jamaican grandmother's favorite expression is \"those who do not hear must feel\". Hopefully this experience will wake him up.", "NAH. He acts like a child.  You were in a damned if you do, damned if you don’t. (As far as handling his important documents)  You need a new BF.", "NTA. \nBut sometimes people think ahead in situations like yours and think in case it will teach the other person a lesson. If this may have come to your mind than there would probably have less „mean“ (in don’t have the right words now) situations to teach him. \nOr maybe while packing your documents loudly proclaim your actions and remember him again. \nI would say it was a little dick move. But factually accurate in response and therefore maybe a theme for [r/MaliciousCompliance/](https://www.reddit.com/r/MaliciousCompliance/)", "NTA. This is a serious problem, a grown adult partner is making you responsible for a fundamental aspect of his functioning life. Then he got mad and told you to stop, you're not a damned mind reader and took him at his word. Does he often refuse to take responsibility for his own, very obvious fuckups? It's ludicrous he even asked this of you in the first place.", "NTA\n\nI'm the designated passport/important documents holder in our home (engaged with kiss) and I think thats normal to have someone who puts everything away together in one place. However it's not judged or complained about, and when we go on holidays even though i hold everything my fiance asks me about 5 times have I got everything and we go through it together to make sure. \n\nYou boyfriend sounds like a whiney baby. Dump and move on.", "NTA How are you responsible of a 27yo person's documents, ID, etc? What is he going to do if he ever get's in a situation where, for example, the police needs to see them? He is an adult, he's been an adult fo almost 10 years...   \nYou are not his mother, and even if you here... He's been an adult for almost 10 years!!!", "Identity theft is not a joke Jim.", "Do. Not. Be. The. Mom. In. The. Relationship.\n\nThis is the beginning.\n\nDo you buy presents for his family and wrap them?\n\nYeah.... He needs to learn now. Weaponized incompetence will not be accepted in your relationship anymore.\n\nHard lines.\n\nNTA", "ESH\n\nMy partner and I have said it before, if one of us forgets a document when travelling the other will go on without them so at least one of us can enjoy the trip.\n\nThat being said we double check each other have the documents we need before walking out the door.\n\nYes he should be more responsible, but equally you could have verbally checked he had it before leaving the house.", "NTA responsibility for identification and visas always ultimately falls on the individual adult. Why should you miss out because of his ineptitude?\n\nI don't know how anyone can for an international trip without \"PASSPORT\" on repeat in their head. Wallet, phone, keys, passport, medication, visa docs... You can buy anything else there", "You are not 100% the Asshole here, but it was a super dickish move. \n\nI had a partner leave on a vacation without me. We were never the same. We broke up 3 months later. We have a child and we’re together 13 years. \n\nYou guys need therapy or you need to find new people to be with. Just trying to help before it hurts more.", "NTA but break up with this child", "NTA", "NTA and also you are not his mother.", "NTA. You aren’t his mother. He isn’t a child. Also he has no right to scold you over something he, a grown ass adult, should be taking care of himself", "NTA.  Don’t fall into being responsible for another adult.", "NTA. Get a new boyfriend.", "I get so paranoid about these things because I am forgetful. I make sure to double, tripple, and quadruple check that I have important docs. This guy is a grown a** adult", "NTA - like you said he is a grown adult very capable of taking responsibility for himself, you are not his mother. But consider this a 🚩because I can assure you this will only get worse.", "NTA OP your bf literally is soo irresponsible  your going on a flight but don't bring your passport I honestly just can't wrap my head around it like honestly what is going through his head its his job to make sure he has his passport not yours he has learned a very painful lesson and the fact that he says you know I have trouble with this like he is a man acting like a child. When I was growing up ya of course my mam would always carry our passports uh duh we were kids now we are older we are always told to carry our own. I am wondering what he did when he was single and had to travel on his own", "NTA! Even I he thought you may have had it he knows he scolded you and demanded his documents back. He should remember you saying you wouldn’t warn him or be responsible for his documents anymore, since he accused you of punishing him for scolding you he clearly remembers what happened. So then why I’m the world would he not at minimum ask you if you were going to bring it? He’s very irresponsible and very rude to you. You shouldn’t have to miss your vacation due to his negligence.", "Seriously. I felt dumber after reading this. Do such people really exist ? Dump his ass already.", "NTA. \n\nYou aren’t his carer or his parent.", "Agreed. He’s an adult and is solely responsible for himself. The fact that he expected you to just miss the trip due to his incompetence is ludicrous. NTA. Reconsider this relationship OP. This won’t change.", "Indeed a succinct summary.\n\n&#x200B;\n\nWon't go into a yes or no on the discussion about weaponized incompetence with t his guy, but definitely willful in it and entitled acting.  \n\n\nIf absolutely nothing else a responsible adult who had \\*actually\\* thought the things he said he did would have at some point asked, given their discussion before, if she brought it to make sure if she was doing it or he was.     \n\n\nYou don't assume someone is not doing something you told them not to do while also blaming them if they don't do it.  You make sure your passport (or what have you) is there, by checking for yourself or asking your partner if you can't find it because they may have still decided to look out for your needs anyways when it's important.  \n\n\nHe put her in a no-win situation and wants no responsibility for that.  Regardless if maliciously intended or just entitled ass.", "Judging by his behaviour he sounds like a baby to me.", "hes a crybaby in the body of an adult.", "My thoughts exactly", "Agreed NTA he’s an adult and needs to take responsibility for his inactions.", "Most i.portant comment here", "This. You should fuck one of your friends on the trip to really seal the deal.", "Or ADHD", "Some of the posts on here make me realize how desperate some people are for relationships.", "Like deliberately doing something badly so you won't be asked to do it again.", "Wow this was cringe", "I first read that as incontinence issues! I need more sleep!", "Forgetting the passport, accident. Asking OP to drive 4 hours with him to go get it, purposeful decision to make OP miss her flight if he missed his flight because of his forgetfulness.", "IT doesn't Take a genius to weaponize incompetence", "Weaponized incompetence is a thing.", "I’m 22 but I have done it on occasion. On those occasions I am embarrassed and apologetic and don’t blame even my actual mom or anyone else—let alone a girlfriend, wtf.", "Well have one of mine!", "100%", "He already made that mistake and didn't learn from it though. He made her carry his documents then got mad at her for carrying his documents and made her stop carrying his documents and now is mad at her for not carrying his documents, so...", "Right? Calling her doing exactly what he told her he wanted (including still making a list for him after he was already a jerk about it twice at a minimum) \"revenge\" - yikes.", "You shouldn't even have to make him a list. He's a grown man. It's a new year. Time to shed some dead weight.", "NTA...I'd be checking that list so many times as it was and i bet Passport is prob #1 on it too.", "> He sounds really tiresome\n\nINFO: I have a question for /u/TAourtrip—does your boyfriend typically ask you to cut up his food or does he expect you to also chew it for him too (feeding him like a mama bird would feed its chick). I only ask because your boyfriend sounds helpless and/or useless.", "Agree  and will add as an adult  is YOUR OWN RESPONSIBILITY  to take & care for your documents.  Not your  parents  ,not your  gf/wife.\nNta  op", "You might want to take the y off for the bf, I think it still logs it for the OP", "I once put my passport in my checked luggage. That was a nightmare to fix, but I made it on the flight!\n\nIn short, am stupid.", "Forgot passport for 20 hour flight to see gfs parents for first time.  Was going to do the permission to marry thing.  Was insanely nervous.   Got back home and back to airport in time.\n\nForgetting things js an honest mistake.  Blaming others when for your own responsibilities is the issue here.", "Exactly, he’s 27. Even my 7 year old niece knows you need to take a passport for international travel", "This made me actually laugh out loud", "She is nit his nanny/mother and he s not a child.  As an adult  you make your own  list and check it or if you are incapable  do not travel.", "Found the boyfriend.", "Lol", "Reddit is ridiculous. People live in a fantasy land here expecting that people live ultra-harmoniously without ever getting into an argument. Everything's a red flag  and every infraction needs to be dealt with by ending the relationship.\n\nIt's an extremely unhealthy view of the world. It's just not reality.Yeah he's the asshole in this situation, but it's just a typical unempathetic reddit over-reaction to label this a huge red flag and to dump him.\n\n\"I know he struggles with...\" \"has a serious problem with forgetting\"\n\nMeans nothing to typical redditors who exercise no sympathy and no empathy.", "Not travel work only but responsibility as well and you can bet if an accident  happens  he ll blame  her as well.", "> The goal of this tactic is to make oneself look like they are incapable of performing an action, therefore removing ownership and accountability for the action being completed.”\n\nI think this is just incompetence. He asked her to *stop* doing the thing that removed the responsibility from him, and he got the responsibility back. Then he bungled it and wants to blame her for it. If that isn't just plain and simple incompetence, what is?", "Weaponized incompetence is certainly a thing.  I don’t think this is it, though.  It’s just basic incompetence and added immaturity - lashing out at OP for things that are his fault (already pretty reasonable reasons to break up with someone).\n\nWeaponization implies a deliberate intent that I don’t think is here.  He’s not forgetting his passport as part of a campaign to manipulate OP into dealing with it for him - he already got that and rejected it.\n\nIn general I think the term weaponized incompetence gets thrown around more than it should.  It takes a negative behavior and asserts active malice.  The other person isn’t just doing something annoying, they’re actively deciding to be annoying to manipulate you.  It certainly happens, but not as often as AITA says it does.\n\nIt’s the same thing AITA does with gaslighting, ascribing malicious and manipulative intent to a lot of situations where the other party just disagrees with the OP and thinks they are wrong.", "Something I was asking as well. WE NEED ANSWERS OP. Reddit needs to know!!", "It is sadly a common coping strategy when people feel stupid to lash out because angry is a more comfortable emotion than embarrassment or shame. He knows he is wrong but doesn’t want to accept it was entirely his fault. Common doesn’t mean acceptable. OP is NTA and boyfriend needs to suck it up and accept the consequences of his actions.", "Oh yeah, people sometimes are fucking stupid. Happens to the best of us. Good buddy of mine did a lot of flying for work pre-pandemic. Like 95% of his flights were for work. Always had his passport in his briefcase so he wouldn't forget it when flying. Which worked until he took a vacation with the wife and didn't bring his briefcase. \n\nHis wife called him fucking stupid. Which he was at that point in time. Smart guy for the rest.", "I want people to know. Begging is sometimes necessary. If you have a gun pointed to your head. You beg for your life whether your an adult or not. Begging when the situation begs for it is acceptable", "this isn't weaponized, it's just pure incompetence", "Good point", "Yay! 🥳☺️ \n\n>!AITA for leaving my husband behind because he was late dropping me to the airport to catch a train to Paris to see my daughter?!<", "Control is a motive. \"If I can't go, you can't either because I can't handle my emotions so you must suffer with me.\"\n\nIt's also not a consciously put together sentence like that. Feelings are hard\n\nSource: unfortunately there are legit narcissists in my life", ">He went to get his passport (but complained that **this was something to remember him by**) and I went with my friends to the airport.\n\nSounds to me like a premeditated fuck up to end the relationship. *This event right here OP this is how you fucked up our relationship, and this is how you're going to remember me, when you stabbed me in the back and made me leave my passport at home.* It's just the right amount of stupid.\n\nBet he didn't even try to get back to the airport, and lied. Knowing full well that OP would go without him. Fully expect to come home to a messy apartment.", "INFO: Does the bf have ADHD or something that affects organization abilities?", "I recommend checking out [this article](https://www.psychologytoday.com/us/blog/mindful-anger/201607/is-your-anger-cover-shame) about anger and shame and how they're tied together. It's pretty interesting.", "My friend's husband packed his insulin in his checked luggage.  In this day and age.  Naturally the airline lost their luggage for 48 hours and they had to get an emergency prescription. That was only ONE of the stupid things they both did on that trip.", "And being prepared to pay through the nose for your mistake. Money and sweet talk can get you many things, passports included!", "No, really. Here are some some indicators ...\n\nWhen someone expects somebody else to do what they refuse to do for themselves, it is weaponized incompetence. \n\nWhen someone blames, scolds, etc. another for their own incompetence, it is weaponized. \n\nWhen somebody expects another to suffer the same consequences they must because of their own incompetence, it is weaponized.", "Why would someone make their own lives worse for such a petty thing?", "Then why did he ask her to stop taking care of it for him? Isn't that exactly the opposite of what weaponized incompetence seeks to achieve?", "Hahaha same. My brain as I'm going through airport security is like \"What if my passport morphed into a loaded gun? Better check!!\" And check again in 5 minutes.", "I haven't moved from my current hotel room in hours and still went to check the passport was in its safe place while reading this post. The fact he didn't even ASK OP if they'd had his passport on them before leaving their house is beyond me.", "Who cares? Even if he did, he was such a dick about it that he ruined his opportunity to have someone always look after this kind of thing. To hell with him.", "Even if that was the case, she made his a list with everything he needs. The passport was on said list.", "Good question, but it still doesn't make it okay for him to be angry at her for helping, and then blame her because she stopped helping. My husband has severe ADHD and is extremely forgetful even on meds. Thankfully I am a detail oriented person, so I help out with things like documents and keeping appointments. He would NEVER be angry with me because I was holding onto his passport or anything else. We would just quickly set up a way for him to grab them real quick, and then I'd remind him to give them back once he's done. Of course, I keep everything in a box on a shelf in our basement, instead of on my person, but that's besides the point. It's completely unfair to berate someone for trying to help you and then expect them to keep helping.", "You just need to know how to say the right things. Why do you think so many people fall for some scams", "Ok but no?  You're just describing incompetence.  You can be incompetent and then blame others for it, this is very common and it's still just incompetence.\n\nWeaponized incompetence is pretending to not be able to do something to get out of the responsibility.  Oh I can't cook, so you have to make all the meals.  I don't know how to wash the clothes without messing it up, so you have to do all the laundry.\n\nYou could make an argument that it was weaponized incompetence when he initially got OP to take on the burden of carrying around his documents and always making sure she had on hand whatever he would need.  But that stopped because he **explicitly told her not to do that**.  At that point it was clear that he didn't really have some ulterior motive, he's just a moron.  Please stop using pop psych buzzwords just because they sound cool.", "Attention", "Attention and control\n\nThere's no real sense in it, which is why it's an illness. Someone like this didn't use real reason to get there, so reason won't get them out of it, either", "I'm not going to argue semantics with you. I'm just being more specific than you are, if you prefer. Yes, this is incompetence. More specifically, it weaponized incompetence. \n\nThe examples of manipulation that I provided  make it weaponized. You don't have to trust me, you can go learn about it yourself. \n\nFor example, the term first was published in 1986 so it's not exactly some pop culture buzzword, as you say. Just because you think it is, doesn't make it so.\n\nPlease stop acting pious as if you know better than others, including what type of vocabulary people should use. \n\nYou seem like the kind of person that needs the last word so I'm going to throw you a bone and let you have it. Take care and be well.", "Could I get that source you're referencing? I see people using the definition that /u/azrou gave all the time, and it's the only definition I can find on the front page of Google, but none of those are scholarly sources. I'd prefer to use the term properly!", "gets word wrong, gets corrected, \"im not going to argue semantics with you.\" why cant people just admit when theyre wrong and move forward from there", "[History ](https://idiomation.wordpress.com/2021/11/27/weaponized-incompetence/#:~:text=Weaponized%20incompetence%20%E2%80%94%20also%20known%20as,for%20himself%2Fherself%2Fthemselves.) of the term with sources and links.", "Because anger is an easier emotion than embarrassment, which funnily enough is what this whole thread is about!", "NTA. And this is what travel insurance is for. This is your BF's own fault entirely, but I have a feeling he won't own it.", "I live 15 minutes from the airport in my city and I wouldn't dream of even making my way to the airport without looking at my passport 6 times. He needs to grow up. NTA", "ESH\n\nLook, I get it, bla bla grown man. Everyone has their own flaws and obviously his is not big enough to warrant OP leaving him or being a big burden on her. Your doubts are correct, OP, this wasn't nice of you. You know you could have tols him and you didn't and this is why you're bothered.\n\nTruth is, reddit, we don't know why this guy is like this. Doesn't sound like weaponized incompetence because he's been burned by the consequences already. He's an asshole for scolding you, but that was then, and also for not taking the responsibility for this current situation.\n\nBut leaving your bf like this obviously hurt him. I mean the easy solution here is for him to take another flight apologise and for you two to communicate this whole thing out.", "NTA, I have ADHD, I forget stuff all the time, when it happens it sucks but it's on me. I would never expect someone else to  keep track of my stuff for me let alone scold them for helping me.", "NTA - he's an idiot and refusing to put the effort in to be more responsible. He deserved to find out for fkng about and I hope you and your friends have a great time!", "NTA. He told you to stop playing mommy for him for once and you did. Clearly, he still wanted a mommy to do everything for him.\n\nAlso when I was a kid, my mom would hold all our passports AND I WOULD STILL DOUBLE CHECK WITH HER IF SHE HAD ALL OF THEM! This grown ass man couldn't even do that with a fuckin list 🗿", "Seriously NTA. He's an adult who should be responsible for his own stuff and should own his own mistakes. You are not his parent.\n\nYou need to ask yourself if you want to keep doing all this stuff for him when he's 37. Or 57. How many decades can you keep doing this?", "Is there anyway he might have adhd?? As someone with adhd I understand his struggle (he still shouldn't have handled it the way he did, but it might be because of undiagnosed adhd). If it's not possible adhd then NTA!", "What bugs me is that OP even considers being an AH. NTA all the way", "NTA.\n\nYou are NOT his Mommy.", "NTA - You are not his mother. Unbelievable that he is 27 years old. You did the right thing in this situation. Hope you can enjoy your vacation.", ">In short, he didn't arrive on time and I decided I wouldn't miss my trip because of him. I turned off my cell phone and made my 12h trip. \n\nIt isn't true because no one treats their 3 year boyfriend like this", "lol YTA, every man ITT has experienced being late for something MANY TIMES because their SO took too long getting ready 😂", "NTA. What happened to your boyfriend could happen to me, too. In that case I’d rather pressure my girlfriend to have a good time without me and be angry with myself instead. In general, if one of us can have a good time and the other one can’t, I don’t see a reason for both to miss out on the fun. Of course there are cases where you’d decline anyway in a sort of solidarity, but that’s not appropriate here, as your boyfriend caused all this himself.", "Time for Paul to realise that the OP is his girlfriend, not his mummy.", "I was looking for this comment. This man is the definition of weaponized incompetence. It might be something to work on, but it comes down to reeducating your partner and not everyone is up to doing that (me included). So OP I would think long and hard about a relationship with someone who acts this incompetent and puts the blame on you.", "Yes! My first thought was how crazy it is to carry all of your important documents in your purse all the time. Who does that!? It's just a matter of time until you have your identity stolen or have to spend a week requesting new copies because they got damaged.", "She made him a list and even put passport on his list.", "OMG, LOL - Either you’re a woman who has never been in a heterosexual relationship or you’re a man.", "I'm the sort of person who has to check and double-check and check one more time. I double-check that I have my wallet when I get in the car because I know it sucks to get somewhere and... Fuck, I'm broke! There are things I don't think of too, and it is common for me to make a list to keep me calm when I see all the check marks  I can't imagine someone make ng me a list of things for me to tak care of, then just assume they actually took care of it. You can't say 'dont do this' then get mad when they don't do it.", "Classic reddit. \"Just break up dummas 🙄\"", "I don't mean any shade to OP, but just generally I read or hear about relationships like this and just kinda \"Yeah...not feeling bad about being single.\"\n\nNTA. At all. In any way. Dude's a total dipshit. Enjoy the holiday!\n\nThe funniest part is this isn't even revenge, it's just what happens when he doesn't use his own goddamn brain. And OP doesn't do more than she has to (nothing, really).", "He wouldn't forget. He would expect her to handle all of that. It is always such a delight when you marry a child instead of an equal partner...", "My family is a bit more \"collaborative\" / accomodating, but responsibility is still attributed correctly.\n\nMy father left his hand luggage at my place when visiting me, and I was the one to go get the bag when he noticed. I was not flying that day (my parents were) but I was the one that could make the trip fastest, so I did it.\n\nIf one of us would miss a flight that we were supposed to take together for whatever reason I think the person missing the flight would ask the others to go, but the others would start to organize for the new trip and potentially wait, if feasible", "I was thinking the same, i live in a very digitalized country and we don’t accept it. Even though all authorities have access to digitalised version , you would not be let on a plane with one.", "So he's also made you responsible for his admin too, by you having to write him a list of what to take. Has he made you responsible for tracking birthdays for his family members? Buying them presents? How much household admin has he shoved onto you? NTA btw.", "To be fair, I agree with him. \n\nThere is a point where you just have to either accept someone has weird quirks and deal with them together in time or through talking or you don't want to accept the quirks and you leave. \n\nYou don't make someone miss their plane and go to vacation without them on purpose to \"teach them\" a lesson. To me this is childish and the only acceptable outcome is a break up. \n\nSometimes I get mad at my partner's antics and sometimes I just fucking wish she wouldn't do the few irrational things she does but in the end, these character traits I've come to love and cherish just as much as the good ones. If I couldn't, I wouldn't be with her. I would have looked for someone who is more acceptable to my standards. \n\nI know she will buy some food I don't particularly like in bulk and get mad because it stays too long and I didn't eat it enough but that's her weird little traits. There are things I do she doesn't like as well but we came to accept those flaws, they are inherently what make us unique and lovable as well. If at any point those traits become overbearing and the other can't manage to change then it will be break up time, not petty vengeance time.", "For real. You could throw a stone on a street and hit 3 or 4 dudes like this. They also never know how to cook anything and their bathrooms are GROSS", "Truly. I'd get resentful and eventually hate a person like that. I can't imagine dating so exhausting.", "INFO: Does bf have ADHD? Because losing/forgetting important documents is kind of a symptom. (But blaming others for your own mistakes isn't)", "The two things I always make sure I have with me when  I go on a trip: a physical form of identification (compulsory in my country so we all have one) and a way to get money. All the rest is cake and can be bought if needed.", "Don't assume malice when incompetence suffices.", "I think if one partner is a bit more absentminded about stuff that doesn't mean that they are a terrible partner. Obviously what OP's boyfriend did is ridiculous, but I don't think having one partner be \"in charge\" of travel documents is a huge red flag?", "No you're right and this is why she carried his passport with her (which is stupid if you ask me) \n\nBut then he went off on her and she still wrote down passport on his list.\n\nSo she did manage him. He rejected that and then she still managed him in ways that he explicitly wanted. \n\nShe did no wrong. she did more than I'd have", "i would be really disappointed if i was the bf and it happened to me. but i know im kinda hopeless sometimes at stuff like that. i would blame myself. i would encourage her to go, and if i can afford it, i would reschedule the flight to join her. stupid things like this happen to me, even though i try my best,. sometimes, i am just too tired, and mistakes happen despite my best efforts. it seems to happen to me more than others. im such a klutz.", "This isn't really weaponized incompetence. Weaponized incompetence is when you do something poorly intentionally so you\n\n1. will not be asked to do that thing again,\n2. can have someone do something for you,\n3. can hurt/harm/anger/upset someone,\n4. can punish someone you don't like for a real or perceived act or\n5. can punish someone for asking you to do something in a passive-aggressive, non-confrontational way.\n\nFor example, if your significant other asks you to wash dishes and you really don't want to & want to make sure they stop asking you, you agree to do the dishes, but instead of washing them, you just rinse them. When your SO calls you out, you say \"well this is the way I do them. If you don't like it, then do it yourself\" or \"if you don't like it, then don't ask me\". Another example would be if you're asked to buy decorations for a party when you don't want to be involved in doing that, so you agree, but then intentionally buy the ugliest decorations you can find. Another example is being asked to take care of your child when you don't want to. You agree, but you intentionally don't change the child's diaper. You do a poor job so you won't be ask to watch the kid again. Another example is someone asks you to do some important work you feel isn't your job & instead of doing the work quickly, you intentionally take an extraordinarily long time and end up making the person late on a deadline. The key to weaponized incompetence is the incompetence is intentional and it is done to manipulate. People use it to avoid the direct confrontation of just saying no, or avoid the appearance of looking like the bad guy, with this type of passive aggressive manipulation.", "Hard to tell if he'd sabotage the entire trip on purpose. But to make her miss the trip on purpose _after_ he suspected he'd miss it? Very likely.", "Having one partner hold that stuff themselves isn't, but the less responsible partner berating the other when they didn't get said document they would need from them absolutely is.\n\nEdit: Source: I had to hold onto wife's documents before she went to rehab and got sober.\n\n2nd Edit (it's too damn early): NTA.", "But you take responsibility  for your mistakes,  op s bf blames HER. That's  a HUGE difference. Everyone  makes mistakes  weather due to an off /bad day or distraction  or something  else. How you deal with it is important.  If I see someone  struggling  I try to help but if I try to help and that person  is entitled  and treated  me badly for trying  to help you can bet i will make sure I won't  help ever again.  If that person  apologized  for having a bad day count on it that I will try again  to help (assuming  the reaction  is not the absolute  same every time)", "He's putting it on her to remember his ID. And saying she should've missed the trip because of it. His incompetence being used to control her actions, (i.e. go home with him to get the passport and miss the vacation to stay home with him.) and she's not buying it. I'd call that weaponized incompetence. Id hate to be in that car ride... since he seems to be blaming her for forgetting it, probably blame her for everything. If he hadn't blamed her and gotten mad that she went, it would just be pure incompetence. The fact that he expected her to make up for his incompetence and for her to miss out because of it... expected her to stay with him because of it... that's where it becomes weaponized. I wouldn't say it'd fit the strictest definition, but it does fit. And makes it a red flag. \n\nMoreover, she put it on his packing list that she made for him (because he's seemingly incapable of writing his own packing list?) And he still forgot it. I'm assuming she's on AITA because he's trying to make her feel like shit because of his failure. \n\nGenerally weaponized incompetence is more like putting the entire pot of leftovers into the fridge instead of a sealable size appropriate container in order to make the partner do it because \"they're bad at it.\" Which is the classic example. But he is putting the onus on her because he's \"bad at keeping track.\" And therefore she should be responsible for it. That's the weaponized incompetence. He's doubly the asshole for blaming her for his failure. For seemingly shaming her for having going on this trip to have fun. Probably trying to prevent her from having fun by continuously contacting her about it. I've been through enough to just tell her to leave that nonsense.", "Spurious. Nothing suggesting this in the text.", "So? I I have ADHD and I don't forget documents. I am the sole responsible for my documents.\n\nI can sympathize with the BF though, one common pattern for families with kids with (untreated) ADHD is to have one or both the parents remind stuff to the kid. For me it was \"it's time to start preparing for getting out\", for others might be documents. When I started to try to get more independent I would ask to not be reminded, which usually worked for a couple of times, then both me and my parents \"forgot\" and we got into a weird situation where sometimes I would be reminded (usually when I reminded myself and I was preparing on time) and sometimes I would not (usually when I was relyinf on my parents' help because I forgot that I asked to not be reminded). \n\nI mean, it's not a justification in any way, but I understand the struggle (and the corresponding meltdown when shit hit the fan).", "I'm a 27 year old with adhd and pre diagnosis/meds I would lose my wallet and passport inside the apartment all the time. My partner did give me a bit of flack for it but ultimately I knew it was my fault if I ever properly lost it. \n\nOnce I was stuck 5 hours from home working away on a Job with different locations each day and a crashed car. I needed ID and realised I'd unknowingly taken my wallet to London at my sisters flat and left it there. Finished a night shift at 3am, got the 6:30 train to London, grabbed it, fell asleep on the train back, over shot it, just got to the rental car place before it shut lol. \n\nThen a few weeks later at the end of the Job i realised I didn't know where my passport was, I thought it should be in my backpack as I often need to get it scanned when I start new jobs (freelance, lots of new jobs) and my partner couldn't find it at home; we were supposed to be flying out to Greece with friends in a few days. Was I upset? Yes.  Did I blame her? No! I accepted that she'd have to go without me. Turns out it was at our apartment but I had to turn the place upside down to find out which of my stupid adhd hiding places it was in lol\n\nI digressed a lot lol, but it's a funny story to me now. Moral of the story, don't blame your mistakes on someone else, especially if you rejected their help like op's boyfriend", "Aww, bless your heart.\n\n[History ](https://idiomation.wordpress.com/2021/11/27/weaponized-incompetence/#:~:text=Weaponized%20incompetence%20%E2%80%94%20also%20known%20as,for%20himself%2Fherself%2Fthemselves.) of the term with sources and links."]}