{"id": 6053, "submission_id": "zzfb56", "title": "AITA for telling my brother the truth on why I don’t ask him for anything?", "selftext": "I (19f) have 3 brothers (27, 28 and 32). My oldest brother (Dave) got married to Sara in May.\n\nI study halfway across the world from my hometown where my family are. I got really sick a few months ago and rushed to the nearest hospital. Turns out they don’t accept my insurance and I had to pay out of pocket. I was €50 short and called everyone I could but no one was picking up. I then called my oldest brother (Dave) because he always picks up and asked him to send me €50 and I would send it back once I get paid in a few days. He told me not to be ridiculous and he didn’t need me to pay him back €50. \n\nSara called me that night and asked how I was doing. After the chit chat, she asked if I could ask someone else the next time I need money because my brother is a married man. I was shocked but i apologised and said I offered to pay him back. She said it’s fine but next time, I should plan my finances in advance so I won’t have to rely on a married man. \n\nIt’s my birthday soon and Dave called to ask what I wanted. I said nothing and that I was fine but I appreciated him asking. My other brother called to ask what I want and I said I wanted some money to heat my apartment. I couldn’t afford to heat it this month. He was baffled that I was so broke I couldn’t afford heating and I wasn’t saying anything. He started tearing up on the phone call with me and ended the call, and sent me €500 later. I guess he told Dave about the call with me because Dave called me and started interrogating me on why I just told him I didn’t need anything, and then asked my youngest brother. He sounded offended and asked why I feel like I can’t rely on him. I asked “haven’t you spoken to Sara about this?”. He was confused on what I meant and I told him about the conversation I had with Sara after he sent me the €50 for the hospital. He said he’d call me back but he hasn’t.\n\nA cousin of mine sent me a message a few hours ago saying I was a bitch for meddling in their marriage, and that Dave didn’t owe me anything. I was like ???? When did I say Dave owed me anything? I have never relied on him for anything, nor do I plan on it. I mean I feel bad that Dave and Sara are fighting it I can’t help but feel weirded out that Sara did that behind his back and he had no clue. I’ve been extremely anxious and I can’t stop shaking. AITA?", "created_utc": 1672443863, "permalink": "/r/AmItheAsshole/comments/zzfb56/aita_for_telling_my_brother_the_truth_on_why_i/", "score": 701, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) told my brother why I don’t ask him for money\n2) because his wife probably didn’t want him to know\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nSara is a manipulative arse.  Your brother had no idea she had that conversation with you.  \n\nSara's now playing the victim.  Your brother may be realised what sort of nasty person he may have married because there may be a lot more things along the same lines that you have no idea about.", "NTA- there is something seriously wrong with your sister in law. Do not trust her. Personally, when someone starts to show me this type of behavior if I cannot get away from them I keep screenshots and record conversations just in case they start playing games and fucking with me down the line.", "NTA.\n\nWTF did I just even read?! Of course your brothers would be baffled that you want freaking heat as a birthday present and I hope Dave forces Sara to apologize to you, publicly, as should your cousin.", "NTA\n\nIf Sara has a problem with her husband loaning (or in the case giving) money to friends or family, then she should discuss with her husband not you!\n\nYou didn’t “snitch”. Tell your family what is going on, you do not have to go through this alone. Sounds like you have some good brothers.", "NTA. This isn't you. It's not your fault. \n\nSara was out of line and meddled in the relationship your brother has with his little sister. If someone did that to me, I would be *furious*. \n\nYou couldn't conceal it without lying to his face. I don't think you should have, either. They're newly married and they need to work out their new relationship, including Sara leaving the relationship Dave has with you alone.\n\nI hope you're okay. Take care of yourself. Your brothers sound awesome.", "Wow. NTA. Sarah needs to have a think about why she feels threatened by her husband helping out his *sister*", "NTA. Your SIL might soon become FSIL.\n\nIf anyone of my siblings needed my help and my SO told them to not ask me for money or help, I’d seriously be reconsidering any connection with that person. \n\nEspecially, if I’m not struggling myself.\n\nThe audacity that Sarah had to tell you not to ask for money instead of talking to your brother is insane. That in itself is insulting and condescending.", "NTA, and I would steer clear of Sara. She clearly has some sort of complex that is making her want to establish a boundary between you and your older brother. She's probably thinking you are trying to separate them by being dependent on him. Obviously she also gaslit your family into thinking that he owed you and involved your cousin in this. You and your older brother need to sit down and talk with Sara because if you leave her unchecked, she will take more out of context and twist it so she is the victim and further separate you and your siblings from him.", "YNTA. Sara is a greedy and possessive witch. You should be able to rely on family AND you offered to pay him back. Sara is the witch.", "NTA, and Sara seems like an AH.", "NTA. It sounds like Sara may be the meddler in family affairs, not you. Being a married man isn't really an excuse not to help family if they wanted to. Also, I see it as a good thing that you were honest. Hopefully, now your brother knows the reason!", "NTA and seriously what the hell is wrong with your SIL?! Also, your cousin needs to STFU and mind her own damned business.", "Nta at all your brothers genuinely care about you and your sil is ta here for sure. Your cousin must be close to sil to be messaging about it sounds like sil is talking nonsense and bad mouthing you. Don't let her ruin your bond with your brothers", "NTA - you didn’t meddle in their marriage.  His wife chose to make decisions concerning family without discussing them with him.  Your cousin sounds like a jerk and should be cut out.", "NTA - Sarah is though.", "NTA but please update us", "NTA, you have sweet brothers, Sarah is jealous about you.", "Wow.  No.  You are most definitely NTA.", "NTA.", "NTA\n\nYour sister in law is, however. Being a “married man” doesn’t mean cut off from the rest of the family, but she didn’t get the memo. Sara has shown her colors- controlling, isolating and conniving colors. Inform the cousin that they need to mind their own business. You now know Sara and the cousin are no allies of yours. Keep in touch with your brothers; ignore Sara. For all you know, she’s put her marriage to your brother on thin ice.", "Nta. Sarah is absolutely the AH.", "Definitely NTA here, Sarah meddled in this and you told your brother what happened. \n\nNo shame in your game.", "Definitely NTA as Dave is still your brother even if he is married. If he wants to help you and can afford to then it definitely isn't weird for him to do so!", "NTA. Your SIL has her own agenda here, and you've been caught up in it. You've done nothing wrong and aren't responsible for whatever issues they're having or for talking about a conversation you had.\nAlso, what is this married man reliance nonsense?? Says way more about her than you!", "NTA. Sara put you in an impossible situation where you’d be forced to lie to protect her, and she knew that. You haven’t done anything wrong. If she has a problem with her husband’s helping you financially, she should have discussed that with him, not you. It’s possible she did speak to him, got a response she didn’t like, and then tried it with you instead.", "NTA\n\nSara is a huge one. Your cousin needs to keep their nose out of something that doesn't involve them AT ALL and is an AH.  \n\n\nI'm sorry you're getting the blame for this, but none of this is your fault.", "NTA\n\nWow how insecure in her marriage can she possibly be if she thinks it’s inappropriate for a brother too help his sister out paying a hospital bill???????? Especially when you offered too pay him back! And in a more then reasonable time frame! Definitely NTA Sara is crazy and needs too get a grip.", "NTA. This is on his jealous manipulative wife. He needed to know.", "NTA. Sara has issues. He should be informed about them, as her husband.", "NTA!!! You SIL is the worst - a lying manipulator.", "NTA. Firstly, Sara is wrong and is using your naïveté against you. Your brother isn’t having marital problems because of you. He’s having problems because his wife lied to him and manipulated his sister. She seems to have some weird jealously of you being another woman in his life. You need to recognize you didn’t do anything wrong in talking to your brother. \n\nThe larger issue is you’re hurting yourself. Your brothers was to support and look out for you and you’re pushing them away because you feel trapped by your lies. You need to stop this and let them help you. At a minimum you can benefit from the years of experience they’ve had. \n\nYou’re letting yourself be consumed by guilt and not using the people around you that want to help you. You’re so adamant on being independent you’re not recognizing how your lack of knowledge is making your life harder in the long term. Just because you are younger doesn’t mean you are a burden. You need to seek some therapy and stop seeing yourself that way. \n\nBut talk to your brothers. Sit down on a zoom call with the three of them and be honest. Talk about what your life has been like, why you’ve lied to them and what you felt. Commit to being honest with them and they will forgive you and help you be successful. You shouldn’t force yourself to go it alone when you don’t have to. Everyone benefits from help.", "Soooooo much NTA. You did not do anything wrong, and I'm sorry you're in this situation, both financially and emotionally.\n\n\"So you won't have to rely on a married man\"?? He's your brother! He's family, families are supposed to help each other out if they can. And that cousin of yours is jumping a lot of conclusions with the whole \"meddling in their marriage\" thing.  In what world is asking your family for help with a hospital bill \"meddling in a marriage\"?", "NTA. Man oh f’ing man.  If either of my SIL’s ever told me I couldn’t borrow money from my brothers because they were married men I’d ask them what flavor of crack they’re smoking and tell them to get bent.  Siblings help each other out.  I’ve helped my brothers and they have helped me.  It’s called taking care of your family.  The fact that Sarah, soon to be ex-SIL if she doesn’t chill, told you not to borrow money from a married man who is also your brother when you’re in the middle of a health issue tells me she’s got some issues.  Wtaf.", "NTA.", "NTA. Based on your comments, Definitely have a full talk about your finances with your brothers though. Not just to come clean, but so you can have people to talk to. Maybe just stress that you don’t want them to solve your problems, just listen to them", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (19f) have 3 brothers (27, 28 and 32). My oldest brother (Dave) got married to Sara in May.\n\nI study halfway across the world from my hometown where my family are. I got really sick a few months ago and rushed to the nearest hospital. Turns out they don’t accept my insurance and I had to pay out of pocket. I was €50 short and called everyone I could but no one was picking up. I then called my oldest brother (Dave) because he always picks up and asked him to send me €50 and I would send it back once I get paid in a few days. He told me not to be ridiculous and he didn’t need me to pay him back €50. \n\nSara called me that night and asked how I was doing. After the chit chat, she asked if I could ask someone else the next time I need money because my brother is a married man. I was shocked but i apologised and said I offered to pay him back. She said it’s fine but next time, I should plan my finances in advance so I won’t have to rely on a married man. \n\nIt’s my birthday soon and Dave called to ask what I wanted. I said nothing and that I was fine but I appreciated him asking. My other brother called to ask what I want and I said I wanted some money to heat my apartment. I couldn’t afford to heat it this month. He was baffled that I was so broke I couldn’t afford heating and I wasn’t saying anything. He started tearing up on the phone call with me and ended the call, and sent me $500 later. I guess he told Dave about the call with me because Dave called me and started interrogating me on why I just told him I didn’t need anything, and then asked my youngest brother. He sounded offended and asked why I feel like I can’t rely on him. I asked “haven’t you spoken to Sara about this?”. He was confused on what I meant and I told him about the conversation I had with Sara after he sent me the €50 for the hospital. He said he’d call me back but he hasn’t.\n\nA cousin of mine sent me a message a few hours ago saying I was a bitch for meddling in their marriage, and that Dave didn’t owe me anything. I was like ???? When did I say Dave owed me anything? I have never relied on him for anything, nor do I plan on it. I mean I feel bad that Dave and Sara are fighting it I can’t help but feel weirded out that Sara did that behind his back and he had no clue. I’ve been extremely anxious and I can’t stop shaking. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA I would like an update. Sara is a jealous idiot.", "What does being married have anything to do with it. If my husband sister called from the hospital for money I wouldn't think anything of it. Are you asking him excessively? I mean you seem college age and I remember struggling too. Cup of instant ramen and I were besties", "Sara is a monster show your brother all the texts", "NTA... its important to be honest with your brother. It is not your fault that your brother and his wife have a communication problem. \nYou have not been seeking money but your brothers have shown concern for your well being... all this is good", "NTA. Dave deserved to know.", "NTA", "And Sara is talking to other family members about it too! Double nasty!", "Why is nobody talking about the whole \"married man\" thing? Is Sarah thinking that OP wants her brother to be her sugar daddy? Freaking weird.", "My teenagers give/loan money to each other all the time, even if they’ve been fighting. I wonder if Sara is an only child or if she’s just that much of a selfish person.", "Not just little sister, his *baby* sibling, the youngest out of all of them and the brokest. Ofc he’s going to get his hackles raised when he finds out his insecure wife called his baby sibling just to berate her for asking for money when she clearly needed it for an emergency. \n\nAnd he’s going to be even MORE pissed about the fact that his baby sibling is broke and felt she couldn’t reach out to him and was living without heating. OOP this is NOT your fault and it was going to come out eventually. \n\nYour SIL married into a family that sounds pretty close knit, and she seems to be trying to pull your brother out of it - or away from just you since you’re the only other female in his life. What she did was flat out wrong and it was gross, just keep telling yourself that she went behind his back and lied to him. That’s not a good thing to do in a marriage. \n\nYou can also tell your cousin to back off and mind her own business and not interfere in nuclear family affairs. It’s none of their business.", "Tbh at first I thought maybe Sara did that because my brother might be struggling financially. They had a very lavish wedding so maybe that took a big hit to his finances and he was too proud to say anything. But no, a few weeks after the call I had with her, she was posting the gifts he brought back for her from his business trip and there was nothing remotely cheap in that pile. They also travel A LOT together so he’s definitely not struggling. \n\nHe and my other two brothers offered to pay my entire university tuition when I was applying to universities but I grew up thinking I was a burden and I still struggle with that. I lied to my family that I got a full scholarship (to be fair, it’s a 25% scholarship so definitely better than nothing) but I’m paying for my tuition myself. I wonder how she’d react if he was paying for my university tuition if she was acting like that over €50.", "And stay away from the cousin too", "The SIL chose to meddle in a family relationship, which is hypocritical tbh.", "For real!! She’s treating OP like some random woman who wants her man. You have to be deeply sick and insecure to feel threatened by your husbands little sister.", "Most sole children I've known while growing up were actually more generous than myself and others who had siblings, likely because they've never been pressured to share or contend for anything. I suppose an argument can be made in the opposite direction, but surely there's something else very wrong with her. This isn't mere selfishness.", "I'm wondering if Sara is from a culture where being a married man carries some different significance than it does for Westerners. Like a married man can only spend his money on his own immediate family or something?", "You need to stop deceiving your brothers.\n\nUnderstand that you don’t have to accept their gifts or aid but not being honest with them about your situation will probably make them feel like you don’t like them or trust them.  This is what has happened already.\n\nYou need to start today by being open and honest with them about everything.  Write them an email and tell them how you have felt and your concerns and tell them you love them!", "As an older brother who plans to contribute to their siblings education, I hope you know you aren’t a burden and your brothers would not have offered to pay unless they really cared about you. Hopefully, you aren’t taking on undue hardship with tuition fees (though considering you are using the euro symbol hopefully they aren’t as bad as US tuitions)\n\nConsidering how mad Sarah got about €50 I don’t think she would have survived hearing that your brother is paying for your tuition. \n\nI really think you should come clean about your situation to your siblings and about how you feel as if you are a burden because it would be heartbreaking to hear your sibling is struggling and not knowing why. (I’m assuming this based on you saying your brother was tearing up over the phone).\n\nETA: Though I understand how difficult it must be.", "Can you please update us when things settle down ? I don't want to be nosey but i'm hoping you have a good conversation with your brother about that. You're obviously NTA.", "Sara is simply one of those women who think that nothing that existed before marriage matters. So his family can go kick rocks.", "Can confirm! I’m an only child and usually pretty generous, and I absolutely believe it’s easier for me to be generous because I was never forced to share or felt the need to hide “resources” from siblings as a child and therefore sharing doesn’t come with all kinds of weird baggage 😄", "But OP is his sister - OP \\*is\\* his immediate family. I understand that there might be a cultural disconnect, but if they're married, they're supposed to communicate and compromise. NTA, and SIL is totally in the wrong", "My brothers and I are very close. I tell them everything except my struggles. Our dad died when I was really young and they’ve been bending over backwards for me since then. I felt terrible at how much they had to do for me. We call each other all the time and they’re my best friends but I don’t want to feel like a burden again. I’m working on it, truly. But it’s not easy. I want to cry my eyes out just thinking of them worrying about me. Admitting that I wanted money for heating is the most I’ve admitted about my struggles in years, so hopefully that’s the start of me being honest with them. I’m also worried they won’t take my word for it when I say I’m ok again.", "I really want to come clean to my brothers but given one of them was tearing up just because I couldn’t afford heating and was suffering in silence, I don’t think they’ll take me being in debt very well. Tbf my debt isn’t huge. It’s €900 ish at the moment. I manage to pay most of my tuition and my rent with what I make. I have so so much that I’ve lied about regarding finances that I wouldn’t even know where to start with coming clean. I haven’t even gone home for Christmas because I couldn’t afford the trip but I lied that I couldn’t take time off work. I know it’s the right thing to do and I can’t keep lying forever but I genuinely don’t think I’m strong enough to come clean. Seeing my brothers hurt in any way is so heartbreaking for me. I didn’t mean to keep the lies going this long. I’ll try by best to work up the courage but I’m not making any promises. \n\nThank you so much for your advise 🤍", "Will do! I’m anxiously waiting for my brother to call me but I’m assuming things are very tense with him and his wife so it might be a while.", "I would suggest therapy but if you can’t afford heat I am guessing this is off the table.\n\nI can only image how hard it is on you and it has been over these years.  You can show you aren’t getting a full ride scholarship and you can show them bank statements, but all I can say is by what you say it will never come to that.  \n\nIt is extremely hard letting go of your insecurities and it won’t go away anytime soon.  I would start by talking to one of your brothers about the current situation and your fears that you have and are being a burden on them and their relationships.  You can then ask to eventually talk more when you are in a better situation but your brother’s just want you to be safe and happy.  You truly and honestly showing them this is the best thing you can do.", "Tell your brothers your struggles please.  They would rather know now and help you then let it get so deep you don’t communicate at all.  They sound like an incredible support system and you are fortunate to have them.  Say look I am really trying to do this all on my own but I’m struggling and it’s hard.", "Ok, the more I read the more it sounds like you’re a little bit of a martyr.  Where’s your mom in all this schooling away from home, not a full ride, and not enough money to live on. Time for a family meeting. Your brother’s tears  breaks your heart and you can’t confide in him???  If your 3 brothers contribute $50-100 a month could you make it then?  Let your family assist you, and you will do the same for your future nieces and nephews.", "I’m really sorry to hear that 😔. I understand strong feelings of guilt and not wanting to worry the people you love with what’s been going on with you but your brothers clearly love you so much and having them know what you’ve been going through would at the very least probably lighten some of the burden you feel keeping up the lies. \n\nMight I suggest maybe writing everything out in a letter/message and sending it to each of them? It would give you more control on what you say and how you say it, and give you some kind of buffer in the actual delivery so that you don’t put yourself in a situation where you’re face to face with them, and lie again or break down crying and can’t tell them everything properly.", "However heartbreaking it is to see your brothers hurt for you, remember that it's *for you* and not because of you. The more you suffer in silence, the bigger their hurt when they eventually and inevitably find out. It actually seems like the cat is out of the bag now and they'll be asking questions. You asking for heat money isn't something they'll just shrug off.\n\nIf that makes it easier, you don't have to have some big coming clean with everything spilling out. You'll have to muster up the courage to admit a few things, but just saying that you wanted to make it on your own and it simply didn't turn out well should be close to enough. They'd probably even respect that.", "My mum and I aren’t close at all. I haven’t spoken to her much since I moved away. She got remarried and started a new family when my dad died and her new family have been her priority. \n\nI know realistically my brothers could pay for everything happily. They offered to do so when I was applying for universities. But I genuinely thought I could provide for myself without burdening them. Hence why I lied, I thought the truth would never come to light because it wouldn’t need to. I had older friends when I was in high school and they were paying for everything with the money they earned and I thought I could do it too. I was naive and it’s much harder and more emotionally taxing than I thought. I also admit I’m a bit too prideful to ask anyone for help, financial or otherwise. Telling them the truth now will require me telling them a long chain of lies I told since I graduated high school. That won’t be easy. But I’ll try build the courage to do it. I’m starting a new job in Feb that pays €500 more than my current job and I think that will be enough to get me by so I’m hoping I won’t need their help, but I’ll tell them everything soon hopefully.", "You shouldn't be worried. You did nothing wrong.  The fact that Sara went behind his back to call you and now she is telling other relatives what's going on tells me she is an AH.", "NTA. What does your brother being married have to do with anything? Your SIL is a weirdo.", "NTA\n\nAnd this is your cousin's business because...??\n\nShe is the one meddling here. This is your brother, a first-degree relative to you, what happens between you is your business and your business alone. Tell her to get a life. \n\nAs for your SIL, you did the right thing, telling your brother. What she did was awful", "if my boyfriend tried anything remotely similar to that to any of my siblings i would be fucking pissed and probably single, i can barely imagine how mad your brother is about It. NTA", "NTA - Sara on the other hand is a giant one. This is not on you. Please do not let her allow you to think it is. Your brothers love you and care for you. They actively want to help you because of that. Do not doubt their love for you. Keep talking to them. Don't let Sara's issues make you question those relationships. They sound very healthy and positive for you and your brothers.\n\nDon't worry that Dave hasn't called you back quickly. He likely has a whole lot on his hands with Sara, and any fights they're having are all because of her actions. You are not responsible for the mess she made of her marriage by going behind her husband's back.", "NTA. Sara sucks and is weirdly jealous of you.", "NTA\n\nSave that message from your cousin and at an appropriate time let Dave know that Sara is having other family harass you. She's a snake snd deserves all the backlash she gets for her actions. And I'd go nuclear and cut contact with Sara completely.", "NTA I find it weird that Sara was using the married man thing as a reason.", "NTA. Sara is, though. My brother is my first phone call if I need anything. His wife is also very supportive of our relationship. Sara doesn’t get him to herself when he has other family and the insinuation that you were after your own brother by repeatedly stating “he is a married man” is gross. She needs to get a grip.", "NTA - be honest with your brothers. If you have trouble writing or talking to them, you can send them this post. Maybe this can open up a conversation with them. Good luck. Hugs", " NTA. Your brother was happy to help out and knows his finances well enough to be know what he can afford. But just for my own curiosity, how much would that be in American currency?", "NTA that is messed up. Unless if you are leaving big parts out of the story, like you have a drug addiction and you have a history of repeatedly asking for money from him. I actually really dislike my sister in law and would personally be willing to send her money if she really needed it for something like a hospital bill. I would be more likely to send her money than my husband would. Husband and I have separate finances, he could give his sister as much money as he wants.", "NTA. Your further conversation with Sara implied she did not want to give you any more money. Her comment was quite aggressive, he's not a stranger, he's your brother. It sounds like your brother has had words with her over it and she's trying to play the victim to others. Do not feel bad for any arguments your brother and Sara are having, because they're likely to be about her behavior towards you.", "NTA. Jeez, I thought I'd met some profoundly insecure people until I read about this sister-in-law. Do not trust her, EVER. Go out of your way to avoid her until she sees the error of her ways. Maybe even after that.", "NTA. Sara is the problem, not you.", "First off, ignore cousin. Cousin is the one meddling and she needs to stay in her lane. This is between you and your brothers, and between your brother and his wife. None of cousin's business. Feel free to reply: \"What's between me and brothers is between me and brothers. Please don't meddle in our sibling relationship.\"\n\nSecond, you did everything you could have done to not get caught in the middle between your brother and his wife. You *didn't* go running to your brother when Sara first got ridiculous. You *tried* to respect her wishes even though it was very much not in your own best interest. What were you supposed to do, never ask anyone in your family for help ever again because Dave might find out but he's a \"married man\"?!?!\n\nThird, it is clear from the actions of both of your brothers that they do not want you to struggle if they can help you. You are their little sister! They want you to be ok. Dave is making it clear that he wants you to ask him for help, and that's up to Dave, not Sara. Other people don't get to dictate the relationship between you and each of your brothers. Dave has been your brother a lot longer than he has been Sara's husband.\n\nFourth, Sara is full of it. She's making up rules and then insisting you follow them. You are allowed to ask married men for help. You are allowed to ask your married father, uncles, brothers, sons, friends and neighbors for help. You are also allowed to ask married women for help! It's just asking for help! \n\nFifth, Dave is not angry at you. He was frustrated and confused at first because saying this:\n\n>I said nothing and that I was fine but I appreciated him asking\n\nWhen you could not afford to heat your apartment was kinda a lie. And when you told other brother the truth, that got back to Dave and he was confused. Maybe frustrated. Didn't know why you didn't tell him sooner. What were you supposed to do? So you simply told Dave the truth. He was angry at Sara when he learned the truth because... he should be. She was awful and she tried to come between her husband and his sister.\n\nYou've been more than fine through all of this. The only thing you could have done differently is when Sara first started making her WEIRD requests you could have pushed back. It doesn't sound like that's your personality, but it would have been OK to have said, \"Yes, I know Dave is now married but he is still my brother and in our family, we turn to each other for help in times of need. Getting married will never change that. If Dave can't help me, he will be the one to let me know.\" I get that you didn't think to say that. Sara was being manipulative (and WEIRD). But you're ok.\n\nTalk to Dave again when you can. Tell him you will go back to asking him for help when in need like you did before. Maybe tell him you don't want to interact with Sara anymore if he's not present. He will understand.\n\nNTA", "NTA. Sara ITA. She is manipulative and controlling. And the bit about him being a married man — what on earth is that supposed to mean?\n\nI’m sure she’s lying about you behind your back, but that isn’t something you can control. I say this from experience with difficult family members and in-laws. She will say what she says and those who really know you won’t believe her. And this random cousin’s misinformed opinion doesn’t matter.", "NTA. But please contact your cousin again. She needs to hear your version of what happened bc It’s so weird that she’s coming at you so strong. Do you think Sara may have twisted this into something way worse and made you the devil in this situation? Bc like why the f is she even contacting your cousin about this situation at all. I’d be more embarrassed that I did this behind my husband’s back and want this to be kept under wraps. Send her the link to this post. Bc Sara is giving off manipulative vibes!", "NTA. Your brothers wife is sick and your he is probably realizing he married a monster. I hope you recover from this knowing you did absolutely nothing wrong here.", "\"I should plan my finances in advance so I won’t have to rely on a married man.\"\n\nThe fuck?? You got sick..thats out of your control and so many people are struggling right now...tell your brother to run. NTA", "NTA. Sara should have taken it up with Dave, not you, or at least told Dave about her (very weird IMO) opinions when she relayed them to you.", "NTA, sara and your cousin definitely sound like they might be however. Sara is upset your brother cares for his family (jealousy maybe?) and your cousin obviously hasn’t heard the entire story and is upset because your brother doesn’t owe you anything but you didn’t even ask which is what resulting in your telling Dave about the conversation you thought he knew about", "NTA. Looks like Sara already had this financial conversation with Dave. He must have said he would support OP regardless of her view. Then she went behind his back directly to OP to get her way. But that’s just my opinion. 😉", "NTA but it is interesting that Sarah would 1, go behind her husband's back in the 1st place. 2, when called out her first response was to badmouth you to all the family. Seems like a fox is in the hen house.", "Rely on a married man? He’s your brother! She’s got major insecurities and I’m glad you told your brother. Make it clear your loyalties lie with him and not her next time if she tries this crap. And same with your cousin. Why is your cousin so upset about this situation to begin with? \n\nNTA!", "NTA!  Sara is calling you TA because it's easier for Sara to blame you than to admit her role in this.\n\nShe had a problem with her Dave giving $50 to his sister in a medical emergency! Instead of talking to him about it, she scolded you and demanded that you change your relationship dynamic with your brother. She also expected you to keep it from Dave so she doesn't look like a bad guy. Nope. \n\nGoing forward, be straight up honest: \"Sara doesn't want me receiving anything from you now that you're married to her.\" If Dave has a problem with that then his problem is with Sara and not you. Never let Sara be a go-between you and Dave, since she's proven herself to be deceitful. Ignore the cousin. That's just a flying monkey.\n\nBut do tell your other brothers about your finances. They clearly care deeply about you, and as weird as this sounds, it's actually an act of love to let them in on your struggles rather than keep it from them.", "NTA- Sara acted hateful and didn't expect Dave to ever find out. She created the conflict in their marriage by going behind his back and that not your fault.", "NTA. Sara's a c***.", "NTA \n\nI don’t know what him being married has to do with it? Siblings can’t help each other once they’re married? Don’t understand SIL’s logic. It’s not like you were asking to borrow thousands out of the blue, just €50 which you offered to pay back and he declined. SIL sounds like a huge manipulator and SHE’s the one that has caused a rift in her marriage not you.", "> I was shocked but i apologised and said I offered to pay him back.\n\nYTA. You should never apologise.", "Sounds like your SIL is an American b****", "I hope you're okay. Take care of yourself. Your brothers sound awesome.", "I'm just curious how Sara expected OP to plan their finances for a medical emergency? Edit: seeing as by definition you can't plan an emergency\n\nNTA", "Or Sara realized OP hadn't told Dave what had happened and realized she was left to her own twisted devices, and told a lie about the events that transpired.", " I say immediate family I meant nuclear family as in him, wife and any kids they might have.", "The cousin’s hypocrisy here, “how dare you meddle!!!” Said while meddling in someone else’s business.", "Also something wrong with the cousin, who meddled in OP’s relationship w/ her brother & SIL, just to scold HER for meddling in someone else’s relationship. Sounds like the whole family could use some pointers on Boundaries!", "the mentality (\"hes married he shouldnt help his sibling\") is weird enough. but having that convo with the sibling and not THE HUSBAND is wild.   \n\n\n(OP is NTA)", "She tracked him down over 50 friggin dollars!", "That's hella weird! What does being married have to do with lending your sister £50? I'd understand if it were a large sum that may impact their finances, but come on. Sara is the asshole through and through.", "I read it in the context of \"he has to put his wife ahead of his sister now\" rather than that way but she still needs to do that aboveboard and have her husband aware of it", "That's what I was wondering! I mean, having an emergency fund is a good idea, but this is a teenager studying abroad! She may not even be *allowed* to get a job, so how TF is she supposed to save up a bunch of money just in case she gets sick? And how would she even decide how much is \"enough\"? Is she supposed to look up the going rates for an appendectomy, car accident with major injuries, broken arm...?", "I presume Sara thinks a 19yr old student halfway across the world should somehow have an \"emergency fund\"(which is supposed to be 3-6 months worth of expenses). s/", "RIGHT LOL", "Don't stereotype only children.  I am one and I'm a giving person. I was raised to consider others.  Sara is just narcissistic, insecure and selfish AF.", "One does wonder why the Cousin feels so invested in Sara & Bro's marriage....", ">Your SIL married into a family that sounds pretty close knit, and she seems to be trying to pull your brother out of it\n\nI think this is it right here. Exactly right.", "I mean if it was between his wife’s basic needs being met and his sister’s basic needs being met, and he couldn’t do both, sure, he should put his wife first. But if my brother was struggling to have his basic needs met, and my spouse went behind my back and did something like this, I’d be reevaluating the entire relationship. Particularly because it sounds like the brother does well financially based on other comments, so there is no question wife’s needs and far beyond are being met.", "Yeah, if he were lending a family member €5k it would be totally fair to say \"he is a married man (with finances that are to some extent shared) and can't just do that on a whim now.\" But it's absurd to say that over €50.", "When I told her I needed to pay out of pocket because they didn’t take my insurance, she said “you know your insurance gives you a booklet with the names of hospitals that you can go to right? Why didn’t you check it before you went in?” And she sounded so condescending. Like yes I made a mistake but I was in so much pain I could hardly give the receptionist my details. My priority was getting to any hospital as quick as I could. The possibility that the hospital doesn’t accept my insurance was the last thing on my mind.", "And clearly she thought her insurance would cover her, so it wasn't like she hadn't planned ahead.", "Yep, most only children have problems with being pushovers, not with sharing.", "I was an only child for 19 years and when I was little I was constantly giving my toys and things away to my friends, which drove my mother mad.", "Not necessarily. When my MIL died one BIL paid for most of the funeral. We paid for FIL, another BIL, and others to get to from Florida to NYC for the funeral. Also, for the hotel rooms. Another BIL hosted a dinner at his home for in and out of town family and helped pay for the funeral. Another BIL said he’d pay for the after  funeral lunch. As is usual lunch was a smaller group, limited menu, and we all paid for own alcohol. So, basically all the expenses were spread among the brothers.\n\nAfterwards SIL, married to the last BIL, sent a bill to all the other brothers to pay for the lunch. No offer to help defray any of the other expenses. In reality it was part of a pattern to push his family to the side.", "And, that's not even always an option, often if you call an ambulance it will take you to a specific hospital, not choice allowed, or certain emergencies go to certain hospitals that are best suited to deal with that emergency. It's a stupid thing to expect of a person to be prepared for every possibility", ">the need to hide “resources” from siblings as a child\n\nYou reminded me of how my brother and I used to steal each other's snacks and money as kids. Sometimes we just did it as revenge for when the other stole from us earlier rather than because we needed it", "I am in this comment and I don't like it.", "She's horribly wrong and OP is definitely NTA. I'm just trying to think of a reason Sara would have the gall to say something like that to her and the \"married man\" thing made me wonder if there was something cultural I've never heard about. When I say immediate family I meant nuclear family as in him, wife and any kids they might have.", "Yikes.", "If they won't take your word for it later, it'll be because you lied now. I'm not trying to make you feel worse! It's just one more reason that being honest with them is a good idea. If you ever feel like you can tell them the truth, you should include these feelings you have in your explanation so that they understand it was never about them, and it will make them hopefully more willing to take you at your word moving forward. None of this stuff with Sara is your fault, for the record.", ">Maybe you can arrange some loans from them(small amounts so you can have that \"emergency\" cushion).    \n>  \n>I understand your need not to be a burden(tho I think that may be more an emotional thing than a real world thing).    \n>  \n>Just consider these things.    \n>  \n>I imagine they want you safe and healthy more than they want you to be \"independent\" of their help.", "Yo, I'm an older sibling. Stop being an idiot and tell them the truth about your struggles. They will want to know, even if they can't help. But it sounds like they can help. So stop being too proud to ask for that help. Family helps family, it isn't a burden.", "Please post an update when you’re able.", "tbh she’s probably one of those internally sexist kinds of women who believe that ANY other woman is a threat to her husband/marriage including sisters and especially since OP is around ten years younger than all of their brothers. \n\nWhich makes a little more sense she would go after OP for 50€ than anything cultural or if like they were a family with young children that was struggling & OP asked them for a ton more money. Or like, sees OP as a threat because she is a young woman who is slightly financially dependent on her brothers. \n\neither way, Sara is the real AH here for treating OP like she’s some kind of sugar baby rather than like a member of the family who is in questionable financial straits currently.", "The Uni may offer free counseling to students, mine did (admittedly, that was 25 years ago). If they do, OP, take advantage of it! We all need help sometimes, please take care of yourself.", "They do! But the counsellors are students in their last year of their psychology (or maybe something else? Not sure) degrees. And then examiners sit there with a note book to judge how they’re doing. Almost makes me feel like a lab rat lol. I chuckled all the way home after my first session and I never went back."]}