{"id": 6070, "submission_id": "zznazk", "title": "AITA for leaving dinner early and causing a scene in front of my wife's family?", "selftext": "Let me preface this by saying that I (M35) love my wife (F40). I just think she can be a bit inconsiderate at times.\n\nMy son (15M) has what my wife calls a \"deadpan voice\". While I admit he doesn't show much enthusiasm when speaking, I think he has a right to express himself in his own way. My wife, however, insists that he needs to be more enthusiastic and vocal. She often tells him to \"speak up\" or \"say it with feeling\" and I can tell that it gets to him.\n\nMy wife recently started taking a different approach, which I can tell really bothers him. When addressing him, she talks in the most enthusiastic voice she can muster. She'll even go so far as to clap her hands and make facial expressions as she talks to him. \"How was school today? Tell me all about it! Speak LOUDLY and with ENTHUSIASM!\" (Think kindergarten teacher talking to her students). My son just looks at her like she's crazy and I can tell he's embarrassed.\n\nI have tried to privately talk to my wife about this, but she doesn't seem to get it. She insists that her way is the \"right\" way and that our son needs to learn how to be more outgoing.\n\nSo fast forward to yesterday. We were celebrating Christmas at my sister-in-law's house and my son asked me to pass the gravy. My wife, in her usual enthusiastic voice, started saying \"Say it with feeling, honey! Can you ask for the gravy with enthusiasm?!\" I snapped. It's one thing to do this when it's just the two of us, but doing this in front of our family was too much. I got up, took my son, and took him to the movies, leaving my wife with the other family members.\n\nAfter we got back, my wife pulled me aside and absolutely ripped into me for causing a scene. She said that I was embarrassing her and that I was out of line. I told her that I was tired of her trying to \"fix\" our son's personality and that I felt this was a good opportunity to make a point. My wife's family hasn't said anything to me, but I've been getting a lot of judgemental looks from them.\n\nI just wanted to stick up for my son, but did I go too far? AITA?", "created_utc": 1672467450, "permalink": "/r/AmItheAsshole/comments/zznazk/aita_for_leaving_dinner_early_and_causing_a_scene/", "score": 308, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My action was to abruptly leave my sister-in-law's house with my son to go to the movies, leaving my wife behind with the family. I believe I might be the asshole because I did not handle the situation in a respectful way and I did not consider my wife's feelings. My actions could have been seen as disrespectful to the family and I may have caused my wife to feel embarrassed.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA: Your wife is mocking your son in front of your family. It's ridiculous.", "NTA. She’s purposely embarrassing him in front of the family and treating him like a toddler. Your son is 15.", "LOUDLY and with ENTHUSIASM, NTA!", "NTA, as a person with a deadpan voice, I appreciate a parent going through the effort to tell their kid it's alright to be that way. Doesn't mean they don't care, that's just how they talk.", "NTA.\n\nYou actively brought this up, multiple times in private, with your wife. She has lost all claim to ask for this matter to remain in private because she refuses to act appropriately after being addressed. \n\nYou are looking out for the mental health of your son, and didn't force him to sit there and be exposed to harassment from your wife.", "heartbreaking. your wife is bullying your son and you did the right thing standing up for him. NTA.", "Info: I know you said you love your wife but, is she like this with everything? How long as this ridiculous requirement for enthusiasm been going on? \n\nHow else does she treat your son?\n\nEdit to add: NTA. Don’t know what deadpan even means but it sure as hell does t sound like a compliment. Good for you with standing up for your son though.", "NTA. She's unintentionally telling your son that he isn't normal.or.good enough as he is, which is damaging to his self esteem. I understand that she thinks she's doing the right thing but she isn't. 15 is a crappy age to have  parent constantly enforcing that you're not normal. You did the right thing and let your son know he has a safe place with you.", "NTA and good on you for making a stand for your son, he will remember this act his entire life as an example of how you stood up for him and how you have his back", "Nta. Your wife's method is annoying as hell and it's going to get the opposite reaction she wants. I know I'd avoid her like the plague if she did that to me. Either that or start talking as obnoxiously as possible. I can see telling him to speak up if he mumbles, but speak with enthusiasm? Nah.", "Why are you letting your wife talk to your son like this? She is such a patronizing asshole, and she’s embarrassing as well.\n\nNext time, tell her to shut the fuck up with enthusiasm so that everyone else can be happy.\n\nNTA.", "NTA. Good for you for standing up for your son. Tell your wife that real life isn't a nineties sitcom, and she isn't the main character.", "NTA, her doing this would drive me insane. And it’s definitely doing damage to your son, I’m surprised he still even speaks around her", "NTA but your wife absolutely sucks. get ready for your son to go NC when he moves out.", "NTA, stick up for your kid.", "Maybe the wrong time, but honestly, it seems like your wife doesn't respect your opinion on the matter. Turning it into a \"big thing\" seemed like your only option.\n\nKeep checking in with your son away from your wife, maybe even start making a joke about it.\n\nNTA", "NTA\n\nIf she felt embarassed in front of everyone, she got a taste of her own medicine. She needs to stop.", "NTA.  Thanks for sticking up for your son. \n\nYour wife complained because she felt that you embarrassed her in front of her family ?  Remind her that's EXACTLY what she did to your son. You're willing to keep rescuing him each and every time she pulls this crap.", "NTA\n\nYour wife sounds like a condescending b.\n\nGood job standing up for your son. \n\nShe needs to stop", "NTA. I can’t wait for his overly enthusiastic sarcastic response to her in the most inappropriate place possible 😆", "NTA and your wife’s approach won’t work. She looks foolish talking like that, your son witnesses it and will not replicate it or anything close. The last thing a 15 yo wants it to look foolish. As someone with the same kind of speaking manner, at 15 this behaviour would of made me retreat back into myself. It’s bizarre she thinks this it appropriate. He’s not dumb, don’t talk to him like he’s 3", "NTA- I have two people in my life who tend to be monotone. One is just deadpan most of the time with everyone but folks she likes. The other has Asperger’s. Either way- this approach doesn’t work. \n\nFor someone with Asperger’s- her actions might be confusing at best, bullying at worst. And she is not the right person to assess his behavioral therapy needs if there are any. \n\nFor someone neurotypical- your wife’s behavior is condescending and bullying. And it will just cause him to withdraw further. She shamed him in front of family. He’s a teenager- and she has three years before he’s a legal adult and she quickly loses the balance of power in their relationship. If she keeps this up and doesn’t rectify it- he’s just going to bide his time until he can go low or no contact.\n\nI would insist on family therapy.", "NTA. She embarrassed herself. Apparently, she is OK with embarrassing your son. I guess we should only worry about her? Thank you for sticking up for your son. Let her family look all they want. He needs his parents to be his advocate and not a bully trying to force him to be someone he isn't.", "NTA. Your wife is lucky that your son is not enthusiastically telling her to shut up.", "NTA in the grand scheme of things. \n\nYou have spoken to her about it privately. Your son is clearly not comfortable with her trying to force him to change who he is. And she proceeds to do it and embarrass him in front of everyone. If possible try and get some type of counseling or mediator to try to get her to understand that although her heart may be in the right place she is hurting your son. Leave the kid alone. Let him be “deadpan”. Some people make whole careers out of it. And also, there is literally nothing wrong with him being who he is and I sincerely hope she gets it sooner rather than later.", "NTA.\n\nI am going to give your wife the benefit of the doubt for a second and believe she thinks he's unhappy and just wants the best for him. It's one thing to want the best for your child and help them be happy in any way you can. It's another to believe the best way to achieve that is to change the way someone talks. First off, believing someone's enthusiasm is a mark of their happiness level is sadly incorrect. Let's pretend he's depressed. All she is doing is training him to fake his enthusiasm around her. She'll be happy while her son feels more and more alienated in actual depression.\n\nNow I'm not going to give her the benefit of the doubt. It's possible she feels embarrassed by his deadpan voice and it makes her self conscious about her own social status. Telling him to be enthusiastic when asking for GRAVY of all things IN FRONT of people leads me to believe she wants to be seen as trying to \"be a good mom\" in front of others. It's not about your son. If it were, she would have an adult conversation with him. She's applying an untruth onto him specifically so she can \"fix\" him and look good around other people. Her fears of looking bad to other people is all she is focused on.\n\nHer family may or may not be AH themselves since their perspective is fed to them by your wife, but they are definitely a product of the same environment your wife came from.", "NTA\n\nYou tried to solve the problem the proper way but your wife wouldn't budge.  She has done nothing but escalate it when it hasn't worked and only caused more discomfort and embarrassment.  She needed to be taught a lesson and this was a really effective way to do it, so not only are you NTA, but I say bravo to you!", "Nta, good for you. I can't force emotions.  I'm monotone so people assume my emotions aren't there. They are, it's just differently expressed than them. She's on the fast track to being cut out once he gets old enough to move out.", "NTA. Not relevant, but is your wife the mother of your son?", "Maybe you and your son should start talking to her like some people talk to their pets, in that kind of baby talk/ super sweet kind of way.  Like if she makes dinner be like, “Who’s the GOOD GIRL!?  Who’s the GOOD GIRL!?”", "I think you haven't taken this far enough.  Your wife is basically bullying your son over something that is only important to her.", "NTA. My daughter is the same way and she has high functioning autism. She doesn’t really get excited by anything either unless it’s something she’s really into. Honestly I don’t get why anyone would ask for gravy or similar requests with enthusiasm either. If someone spoke to me with overly enthusiastic attitude about a small request like that I would think they were talking to me like you hear people talk in a high pitched voice to babies or small toddlers. It would be demeaning as I’m not either of those.", "Her approach is not going to work. I'm also not very expressive in my day to day life. And although it even costed me a job once, I won't feel comfortable at all if people criticise how I behave.\n\nNTA, I hop your wife gets it now", "You should have declared your departure. NTA", "NTA.\n\n“She said I was embarrassing her” but she’s embarrassing her own son? IN FRONT of others? \n\nSo many teenagers talk unenthusiastically. It’s NORMAL behavior and a lot of the times it can be because theyre depressed. Your wife’s actions probably add to it. How does he feel whenever she does this—inadequate? Like a failure? I bet she finds other ways your son isn’t perfect besides this. \n\nShe needs a wake up call and you gave her one.", "NTA. I applaud your son for not having a moment of temporary insanity and chucking the gravy boat at her overly enthusiastic face.", "NTA. I also have a deadpan voice, and even when I try to “seem enthused” it just makes it clear I’m being very fake.\n\nThe bigger issue, though, is your wife purposefully doing something that clearly upsets and embarrasses your son. I’d say YTA for taking him out of dinner in the middle of it but honestly, you’ve clearly tried to communicate it over and over, and she’s not listening. Maybe this will help get the message through that it’s NOT okay. She’s picking on your son in the guise of “parenting” (something my mother with NPD did, to be clear), and using it as an excuse.", "NTA", "NTA I don’t like saying your wife is the a h but she’s not listening. Your son will distance himself from her if she’s not careful", "NTA \n\nRemind your wife that teens never respond well to public humiliation, and that's exactly what she was doing to your son. \n\nFunny how *she* doesn't like being embarrassed in front of her family, but it's OK for her to do it to him. Why couldn't she just let the poor kid have a nice day?", "NTA for Pete's sake, what a horrible thing for a mother to do to a kid!  My husband is on the spectrum and is monotone like this, he rarely shows any vocal emotion, and I can't even FATHOM humiliating him like that.", "NTA. \nThis is abuse. What else does she do and how long has this been going on?\nWish my dad had stood up for me as you did for your son.", "NTA. She SHOULD feel embarrassed because what she did was mean-spirited and dumb.", "NTA your wife is speaking to him like his is a 5 year old and it is not okay i used to have \"deadpan\" voice and my mother would speak to me like this it made me irratated and made me feel like i was a little kid it was embaressing and she needs to understand that and respect his personality and to stop trying to change him i can see him resenting her if she continues this behavior and i hope she learns from this.", "NTA. You wife is out of line for trying to turn your son into something he is not. She is sending a clear message that he is not good enough and doing it in a bullying way. After repeated attempts to get her to stop, you stopped it by walking away. Someone needs to look out for your son and clearly his mother isn’t doing it.", "NTA but your wife is.", "How do you ask for gravy with enthusiasm?? ; Asking for a friend", "NTA\n\nSome people are just stoic naturally. Her trying to press and treat your son like a toddler instead of a teen 3 years away from adulthood will ruin any relationship she has with him. And the fact you can tell that your son was getting annoyed at this approach says that you know your son better than your wife", "NTA\n\nYour wife is a bully. You kept the issue private until she made the issue a public one. How dare she embarrass and harass that poor child in front others! \n\nLoudly and with enthusiasm, tell her you would like both of you to seek marriage counseling as well as individual services for your son(he might not express it, but he is affected by her treatment of him) and if she refuses, you will be seeking to dissolve the relationship. \n\nI can handle anything thrown at me, but I will be damned if someone is going to harass and bully any of my children and think there won't be any consequences. Protect your children!", "A tough one, but I'd go with NTA. You tried to talk this out with your wife and she seems to nit really care. But what she does is bulling at this point. I'm sorry for the kid who has to withstand her behavior at home, but when she does it in front of others....\nI mean, did you make a point? Yes! Was it the best way to act? No. But hence your wife doesn't understand talking things out in private, that seems like the best way yo act, although assholish nonetheless", "NTA. MoistCr1TiKaL making bank with deadpan-ish delivery. Also, who is that excited when asking for the gravy? Maybe only Broadway actors.", "NTA Your wife is being abusive to your son. Do whatever you have to do to put a stop to it.", "I have never once in my life heard a single 15 year old boy express anything loudly and with enthusiasm. The most I ever got from my step brother was a series of shorter or longer grunts. We learned to interpret this. My step father told me in private that lots of boys are like this because voice breaking is embarrassing for them. It’s a time if change and many want to go under the radar. Your poor son. Good on you for taking him out and away from that. NTA.", "NTA", "NTA!! Good for you sticking up for your kid! As an adult with perma-deadpan voice, no matter how excited I am, unless it involves a baby something, I always sound utterly monotone & bored. It has nothing to do with my actual mood, and I’m quite glad most of my family gets it. Your kid will thank you some day ❤️", "How is one supposed to ask for gravy with enthusiasm? Like I honestly can't picture it.\n\nNTA and its good that you stood up for your son. But he shouldn't have to face this harassment by his own mother in his own house as well. At 15, its uncomfortable and awkward and not to mention it will make him feel as if he isn't good enough the way he is. If you son doesn't have any trouble making friends at school and interacting in social situations with his \"deadpan voice\", then he's doing perfectly fine.", "Enthusiastically: NTA!!!! \n\nShe is being mean to your son. She embarrassed him at the dinner. You stood up for him. You need to continue to stand up for your son. What she is doing is not ok.", ">My wife, in her usual enthusiastic voice, started saying \"Say it with feeling, honey! Can you ask for the gravy with enthusiasm?!\"\n\nCan your wife get any more patronizing?\n\nNTA, and she needs to stop speaking to your son like he's 5, not 15!", "NTA, poor kid", "NTA but you will be an asshole to your son if you continue your marriage with the woman who constantly bullies him.", "Your wife is an AH! My 12 son also has that monotone speaking voice, and I know it can be irritating or it causes people to lose interest in what they're saying. So, I feel for your kid. Btw, does your kid suffer from anxiety disorders, or is he on the autism spectrum? My son has crippling social and generalized anxiety, and I believe these conditions usually contribute to that monotone/deadpan speaking style.\n\nRegardless, this should never be brought up around anyone but the most private and intimate family members (typically mom and dad). To do so is humiliating and degrading, especially if they suffer from any of the aforementioned conditions.", "Nta\n\n\nDon't worry. He will loudly and with enthusiasm stop talking to her when he moves out.", "NTA \n\nIf someone kept talking to me like that they’d be wearing the gravy on their head.\n\nGood on you for standing up for your son and having his back, you’ll never know how much that would of meant to him!\n\nHe’s 15, I’ve had 2 so far and talking like that’s quite normal.  Your wife is belittling him and being condescending, she is the AH.\n\nI’d be talking to her about what she’s doing to him, if she doesn’t stop or see the problem then I would tell her you all need to go to family counselling or therapy and then bring it up with them, she might see just how wrong what she’s doing is when a professional tells her it’s a shitty way to treat your son.", "I love this approach, but it's also to be frank, a bandaid approach.\n\nAt some point, you need to sit down with your wife and ask her where this fixation on how your son speaks/sounds stems from? Is she afraid people are going to treat him differently because of his totally understandable teenage monotone? What is the outcome or punishment she thinks he's going to incur by doing something the \"wrong\" way?\n\nAnyway, NTA.", "NTA. There is nothing wrong with your son's personality and expression, it doesn't need \"fixing.\" Your wife is mocking your son and probably destroying his confidence. Please continue to stand up for your son.", "NTA - said with out my outside voice!!!  now your son is an introvert so if he is quiet and deadpan yep an introvert.  you should ask your wife why does she not love and like her son the way he is?   i think its awesome u defended him.", "Some of the coolest, smartest and most sincere people I know are blessed with a poker/ deadpan expression. Rather than to make your son conform to social conventions, your wife should learn to understand that personalities come in different forms, and love your son for who he is. X'mas isn't exactly the best time to confront this issue, in the presence of others, but NTA for standing up for your son.", "NTA There is *nothing* wrong with your son's personality. I love introverts and quiet people. I've raised two and married one. These are people who don't waste their breath or emotion/energy on small things that mean little to them. Get them on a topic they're passionate about and you'll get lots of enthusiasm. Most things in life are pretty mundane...like gravy. When a quiet person speaks, I listen *because* they consider their words and commentary and usually have something thoughtful to add. Chances are, your wife is making his reticence worse. I'd go robotic mute around her. She's psychologically abusing him and doing so in front of the extended family is particularly heinous. \n\nGood for you for standing up to your wife and for your son's dignity. You're the reason he'll have a chance to get to adulthood without issues that severely limit his quality of life. He'll have some because of her actions, but you're giving him the foundation to overcome them. \n\nI hope you have some luck in getting your wife to see and accept just how wonderful he is exactly as he is at this moment.", "NTA - your wife is giving the same level of cringe/grossness as people who tell women to smile.", "NTA.  Thankfully this mom isn’t married to the dad punishing his 18 year old daughter by not teaching her to drive because she didn’t smile at people enough at church.", "NTA.\n\nAren't teenagers supposed to be grumpy, surly, and aloof? Deadpan voice is pretty normal for a 15 year old boy. There's a chance he'll change as he grows up, or he might not. Either way, just enjoy being a part of his life!", "NTA. I’m an introvert and grew up believing that was a character flaw. Your wife is going to chase him away if she doesn’t cut the crap. She sounds exhausting.", "NTA has she never heard of teenage apathy? Teenagers are by definition apathetic weirdos it’s part of growing up.", "N👏🏻T👏🏻A👏🏻\n\nNTA", "15 year old boys mumble and can be quiet naturally. Yelling at the poor lad every time he opens his mouth will wreck his confidence.    NTA, I bet your kid loved you standing up for him and removing him from that awkward situation.", "i talk in monotone and she’d probably call it “deadpan” too. she needs to back off. NTA", "You didn't make your son sit through anymore of that and you shut it down without having a fight - I'd say you did well, actually. NTA\n\nAlso, she needs to *stop* that shit.", "NTA, your wife, however, is a self important, condescending nut job.", "NTA, you stood up for your son.  Your wife is decimating his self esteem.", "Obviously NTA. but she is a bully and rather obtuse.  Her approach is not working.  She needs to see that.  And at a deeper level, nothing actually needs to be fixed", "Is she his bio mother or a evil step parent.", "NYA: tf is this Dora???", "NTA, but please start talking like that to your wife. \n\n\"WHAT the HELL are you thinking? WHY do you want to make some one feel SHIT about themselves? Say it LOUD and with ENTHUSIASM!\"\n\nIf she can't see that humiliating a teenager isn't going to result in anything else but resentment and no contact, she's delusional and needs professional help with parenting. \n\nContinue standing up for your son and help him see he's allowed to be himself. Respectfully, A person from a country where no one speaks loudly and with enthusiasm.", "NTA. My ex bf was very much like this, his “very enthusiastic” voice is the equivalent of my baseline level of passion in casual conversation. And that’s fine! If his lack of outward emoting was due to a depression/lack of zest for life in general, that would be one thing. And your wife’s method would still be wrong if that was the case, anyway.", "As long as your son is polite and respectful, I don't see what the problem is. NTA", "NTA she has to learn that some aoproaches simply do not work or even go too far. She went too far.", "NTA what your wife is doing is the equivalent of those people who tell random women just going about their day/life that \"they'd be prettier if they SMILED!\"\n\nI have one of those \"deadpan\" voices as well. I have occasionally had to make my apologies to people in certain situations because of you don't know me well, it sounds like everything I say is dripping with sarcasm (to be fair, most of the time it is, but not when I'm giving condolences for them passing of a loved one for example). I'm also quite introverted. If someone insisted that I needed to constantly do mundane every day shit like politely asking for the gravy \"with enthusiasm!!!!\" I can't say exactly what I'd do here because I may get sent to the naughty corner by the mods.", "NTA.... She's embarrassed because of what you did? Imagine how your son feels. You've already mentioned it to her about not doing it and she continues to do it and in front of others. She needs to stop. Clearly it isn't working or she wouldn't feel the need to keep doing it. If she wants any kind of relationship with your son, she needs to stop.", "INFO why is your wife’s “hurt feelings over being embarrassed” worse than what she’s been doing to your son (embarrassing him routinely with her over the top responses)?", "Is your son happy? Does he have any desire to alter the way he speaks? If he wants to alter things then I’d say soft N A H.\n\nFrom what you’ve written though, it sounds like he’s happy. In any case, even if he did want some guidance, your wife’s method is ridiculous, patronising and offensive. So I’m leaning towards hard NTA.", "NTA\n\nshe is being insensitive at this point and it is not helping your child in ANY WAY she needs to realize that what she is doing is straight up bullying", "NTA. If a parent tried to do that to me at 15 I would probably stop speaking to them altogether. That’s how you speak to little babies. It’s insulting and infantalizing.", "NTA", "NTA\nThis hits very close to home. I have a \"resting bitch face\". Now famous but when I was a child and teen it was always something to talk about. For my family, friends and even strangers! Mostly swarmy older guys. Smile, smile more, smile wider, you could be so pretty, what's wrong...\nNowadays I would have some choice words, but as a shy awkward teen?", "ESH Can't believe how well your son is doing being kicked in his own home. Both of you are responsible for that.\nYou only stopped it in front of other people, not because you know it's wrong, but because it embarrassed YOU.", "NTA, although you could’ve addressed it sooner and in private.", "NTA, is good that you finally stood up for your son, but you really need to put a stop to your wife's harmful actions, otherwise, you will be failing your son as your wife has so far.", "NTA, I have a deadpan voice that I usually try to control but if I am talking to you and not paying 100% attention well you get what you get and you don't get upset. When my daughter was younger she used to get upset because she said I was always being sarcastic and it was hurting her feelings. I taught her it's more important to pay attention to the words coming out of my mouth than trying to figure out the emotions suggested in my tone. She is 10 now and this no longer bothers her. Your 40-year-old wife damn sure understands how disrespectful she is acting toward your son and she doesn't care because it's not the way she wants him to speak. Let her keep going she has 3 more years of A H behavior left until your son goes NC with her.", "ESH. I believe your wife is honestly trying to help your son but she's probably being a little overbearing about this and probably just needs to accept that this is just how he speaks.\n\nBut causing a self-righteous scene like that accomplished what, exactly? That wasn't the time or place.", "NTA. But also ESH. I love how you're sticking up for your kid but giving your wife some warning would've been helpful to prevent this from happening in the first place. It didn't sound like he's being disrespectful  but she needs to choose her battles. Does gravy really matter? I think it comes down to how your kid responded to the situation.", "Info: has your son been screened for possibly being on the spectrum?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLet me preface this by saying that I (M35) love my wife (F40). I just think she can be a bit inconsiderate at times.\n\nMy son (15M) has what my wife calls a \"deadpan voice\". While I admit he doesn't show much enthusiasm when speaking, I think he has a right to express himself in his own way. My wife, however, insists that he needs to be more enthusiastic and vocal. She often tells him to \"speak up\" or \"say it with feeling\" and I can tell that it gets to him.\n\nMy wife recently started taking a different approach, which I can tell really bothers him. When addressing him, she talks in the most enthusiastic voice she can muster. She'll even go so far as to clap her hands and make facial expressions as she talks to him. \"How was school today? Tell me all about it! Speak LOUDLY and with ENTHUSIASM!\" (Think kindergarten teacher talking to her students). My son just looks at her like she's crazy and I can tell he's embarrassed.\n\nI have tried to privately talk to my wife about this, but she doesn't seem to get it. She insists that her way is the \"right\" way and that our son needs to learn how to be more outgoing.\n\nSo fast forward to yesterday. We were celebrating Christmas at my sister-in-law's house and my son asked me to pass the gravy. My wife, in her usual enthusiastic voice, started saying \"Say it with feeling, honey! Can you ask for the gravy with enthusiasm?!\" I snapped. It's one thing to do this when it's just the two of us, but doing this in front of our family was too much. I got up, took my son, and took him to the movies, leaving my wife with the other family members.\n\nAfter we got back, my wife pulled me aside and absolutely ripped into me for causing a scene. She said that I was embarrassing her and that I was out of line. I told her that I was tired of her trying to \"fix\" our son's personality and that I felt this was a good opportunity to make a point. My wife's family hasn't said anything to me, but I've been getting a lot of judgemental looks from them.\n\nI just wanted to stick up for my son, but did I go too far? AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You HAVE to protect your son when he can’t protect himself. \n\nSeveral ppl have brought up how this is common with Autism. Idk anything about your son but if you see other signs or things that are slightly “off” or “odd” you need to have him evaluated. \n\nThe way you spoke about your wife also gave off possibly Autistic vibes. Has she ever been evaluated? It can be genetic. She either has issues with social skills or she is a hemorrhaging asshole. WHO does that to their child?! \n\nAlso, please look for u/crocodilezebramilk comment and read it carefully. There is a possibility that your wife is creating problems that she can’t possibly foresee. \n\nAs for you, why are you SO worried about what others think? You won’t draw a firm boundary with your wife, to the detriment of your son, and now you’re worried about what kooky-loos think? Who cares, honestly?! Everyone in the world could hate you for this- does it even matter? \n\nTalk to your son, get his to tell you how he feels when this happens, ask him how he prefers you handle it. Maybe he doesn’t really care bc he thinks his mom is a bumbling idiot. Maybe he wants you to make it stop. Maybe you doing anything embarrasses him more. You have to know so you can know how to act- bc HIS OPINION IS THE ONLY ONE THAT MATTERS. \n\nThink about getting him therapy and do it if he expresses that this has really hurt/damaged him. Get therapy for yourself to help you stand up and handle this. INSIST on couples counseling bc this needs hashed out. Don’t ask. Set the appt for when you know she’s free and tell her you’re both going. \n\nYour son will eventually cut you off if he has to in order to cut his mother off. If he doesn’t hate her now he will at some point.", "What your wife is doing is only making your son more withdrawn. I was a shy kid and my gramdmother(who raised me) would do this kind of shit and call me out in front of others for looking glum or being quiet and I hated her for it, still do when I think about it. Good for you from sticking up for him, she needs to just let him be.", "NTA. do the same thing back at her", "I remember being told I had a monotone voice. It, to this day, has destroyed my confidence when speaking. In my own head I put emotion in to my voice most of the time, so to be told I was basically emotionless in speech really affected me.\n\nI can’t imagine being constantly reminded and ridiculed for it. \n\nNTA", "NTA. \n\nStanding up for your son is something to be proud of. You rescued him from an unfortunate scenario. He doesn’t deserve to be humiliated. Your son knows he can count on you to stand up for him even when it will be painful for you. Man, that’s awesome. Good job.\n\nYou did not go too far.", "Good for you. NTA.  Keep sticking up for your kid.  Your wife sounds incredibly annoying, condescending, and manipulative.  I worked with a woman for years just like that: all sing songs and gung ho. she was insufferable.", "NTA but empathy for your wife... the change from your little boy to moody teenager is swift and painful for a mama. \n\nThe miserable face... the deadpan voice.... it sucks \n\nI hope you both can find balance until the teenage years pass.", "NTA \n\nyou have had lots of discussions and she hasnt taken any heed to them.\n\nif you were the wife you would have received all the support on AITA", "NTA and I wonder if your son has autism. For years my parents would harp on me for not using a certain \"tone of voice\" and I had NOOOO clue what they were talking about. I got in trouble for it constantly and learned as an adult getting a diagnosis it's very common to not understand tone.", "NTA. My son also has a very \"sarcastic\" tone. But I do too. He gets it from me. I tell him the same thing as your wife but in a different way. I EXPLAIN what will and can happen with such a voice inflection.  And I don't NAG him him every 30 secs. I give purpose and reasons why he shouldn't use that tone in all occasions.  But at the end of the day I don't openly critique him either. That's just rude.", "NTA!! Teens are broody by nature...how he chooses to express himself, as long as he is being respectful, should be his choice! What your wife is doing is kind of mentally abusive...Someone has to stand up for him! Good job Dad! I hope things smooth out! Hugs!", "NTA. Your son will start to resent her.", "Does one really NEED to ask for the gravy enthusiastically? \n\nNTA. If your wife mentions her embarrassment, perhaps point out that she had already embarrassed your son.", "NTA.\n\nYour wife is being abusive, full stop.\nProtect your son or it won’t be just her he cuts out of his life in a few years.", "INFO will you give her the link to this and insist that she read these comments?\n\nAlso, has your child ever been diagnosed with autism?\n\nYou're NTA but your wife is emotionally abusive and he'll go NC as soon as he's out of your home. Poor kid. When he finally snaps on her she'll have that surprised Pikachu face I'm sure. There's only so much of that shit anyone will be able to put up with.", "NTA but your wife sounds mental. Poor child. He's counting the days till he turns 18 and goes NC with loud and enthusiastic mom who speaks to him the way small dog owners speak to their minions of Satan.", "Absolutely NTA, as someone who is and has always been introverted I can say her ridiculous approach will just cause resentment", "YTA, and frankly, it's your wife who should be apologizing to your son. You were right to stick up for him, but the way you did so was not the most effective. You should have calmly explained your issue with your wife's behavior and asked her to stop in a reasonable manner. Taking your son away and leaving your wife alone was not the best way to make your point.\r  \n\r  \nYour wife's behavior is inappropriate and she should not be trying to \"fix\" your son's personality. It's important for her to respect his boundaries and to let him express himself in his own way. You should talk to your wife and express your concerns about her behavior. If she is unwilling to change her approach, then you should seek outside help to work through the situation.", "ESH if you can’t reach a consensus in how you want to raise kids, don’t have them. Never undermine each other’s parenting, take your differences behind your kids (and other family members) to trash it out, and come to an agreement.", "ESH.\n\nYour wife is clearly in the wrong. She may have good intentions, but her method is bizarre and condescending. She belittled and embarrassed your son in front of others, and that is not okay.\n\nHowever, abruptly leaving was also not great. I know that you wanted to protect your son, but there probably were better ways to do that. Abruptly leaving negatively impacted all of the family members present, not just your wife.\n\nEither way, what's done is done. I would talk to your wife about it. I would ask her how it would make her feel if you started talking to her like that. Would she enjoy having that belittling and condescending tone being directed at her?", "YTA", "This. \n\nAs OP said, at home? Let's have this dialogue and work towards a resolution. Why the hell does he have to be enthusiastic about asking for gravy? It doesn't sound like he was impolite?\n\nSo now it has to be ✨️🤗 PasS the GraVY, PleaSE? 🙏 🤗✨️\n\nGood for Dad for sticking up for his son. Although side note-- if son could have handled it I almost wonder how it would have played out with extended family. If my sibling was being weird like that with their kid I would ask what I'm missing. \"What is this? What are you doing?\"\n\nPeople are weird.", "This is way more than \"a bit inconsiderate\". I was subjected to similar criticism but instead of being treated like a toddler, it was like I was a criminal. Policing emotional expression is abuse and I don't know how anyone could love a mother who does that to their own child.", "Me sister has a toddler and she doesn't try to get her to feel a certain way about things. Expecting your kids to have manners is reasonable, trying to change them isn't. Why does the son have to be outgoing and enthusiastic? The world is full of introverts and loners, and we are just as happy (or not) as the other sort.", "👏👏👏", "FOR REAL. I have a friend whose diction is very emotionless, OP, and they are absolutely wonderful. It doesn’t mean anything about his personality, or his capacity for emotion or passion. You’re doing the right thing standing up for your son.\n\nNTA.", "Lol. Well played.", "N FUCKING T FUCKING A", "I’d award this if I could!! 💯⬆️", "I agree LOUDLY and with ENTHUSIASM, NTA!", "If she keeps doing this, the only emotion she's going to get out of him is resentment.", "OP give permission to your son to tell her to shut the fuck up loudly and with enthusiasm everytime she belittles him- and lead by example.", "She is abusing him. Bullying is when the people involved are the same age. NTA.", "I can only imagine the wife & OP in their intimate moments. “Come on, OP, do that again, with feeling this time. LOUDLY and with ENTHUSIASM!” And then she claps her hands.", "Especially if his voice has dropped.", "Turn everything into a full ass cheer- like a cheerleader. \n\nMy family is entirely too petty for it to be healthy but this is what my kids and I would do. It would be SO *obnoxious* but we’d practice and everything. It would be very apparent it was choreographed for that specific occasion.", "When I was a child I used to hiss at anyone who tried to get me to speak a certain way especially if they clapped at me enthusiastically. In my eyes the direct eye contact and clapping felt challenging? I don’t know how to describe it, but I’m now selectively mute without any control over it because I could never find the “right tone.” \n\nOOP your wife is being a major AH and she needs to STOP.", "OMG yes.", "I'm Autistic too but also peri-menopasual and thought if someone spoke to me like that I'd show them some enthusiasm as ripped them a new one.", "That’s the first thing I thought- ASD. I have twin Autists and one is super peppy and enthusiastic like the mom (not condescending like that, though) and her twin is exactly like the son. Both Autistic, both opposite the other.", "My son hasn't expressed any desire to change the way he speaks, and he seems content with the way he is. I think her approach is overbearing and embarrassing for him.", "He said he did. She didn't pay heed to his concerns.", "He said he did and she kept doing it.", "Trying to help? Nope, not after she's been told it's doing nothing but harm multiple times. It's straight up bullying.", "She’s not trying to help, she’s being a straight up AH and she’s trying to police someone’s tone that they really can’t change. And she ISNT accepting that that’s how he speaks, she’s been talked to, OP told her to stop and she isn’t listening. What she is doing is damaging.\n\nEdit: OP did accomplish something, he let his son know that he’s in his corner and he’s going to defend him even to his mother. Which is extremely important for OP to do.", "> I believe your wife is honestly trying to help your son\n\nIn her mind perhaps but she's wrong.", "Wife is going about things the wrong way.\n\nHowever, I see where you’re coming from. The son and OP do need to realise that speaking with a completely deadpan voice could really hold him back later in life. Dating, job interviews, making new friends… it will just make things harder for him when he’s an adult. \n\nThe way wife is dealing with it is infantilising and downgrading. All she is going to do is piss everyone off and muddy the point she is trying to make. \n\nThere are 100 better things the wife could do to actually help the son.", "\"I have tried to privately talk to my wife about this, but she doesn't seem to get it. She insists that her way is the \"right\" way and that our son needs to learn how to be more outgoing.\"\n\nShe's already had more than one warning/request. A public call out is appropriate given her public behaviour.", "> but giving your wife some warning would've been helpful to prevent this from happening in the first place.\n\nOP's asked her to stop already. She had her chance.", "In case OOP can’t find my comment - I’m selectively mute due to people commenting, making fun, or pointing out my vocal tones and just trying to tell me to be “happier.” Which I’m not saying this can happen to your son, this is just my own personal experience. \n\nWhen someone goes out of their way to comment on your manner of speaking, it’s tiring, it’s draining, confusing, and like you don’t know *how* to fix it without sounding fake and when it’s done in a public setting? It’s extremely hurtful and it draws all the attention to you and everyone’s eyes are on you. I got tired and anxious enough to the point where I just stopped speaking all together. \n\nEventually people got the point but by then it was already too late. Then I’d get pestered with the whole “you’re so quiet” “cmon you can talk to me were *family*” “just say one word.” \n\nI’m pretty sure I’m on the spectrum (again just my own personal experience, I’m in no way arm chair diagnosing), and to me your wife comes across as very aggressive. And clapping is a sensory issue, direct eye contact for me is like someone is either challenging me or trying to intimidate me, I do not like it and I will turn my head to avoid it or I’ll just simply walk away. \n\nOOP is doing the best for his son and I like his approach, including calling his wife out in front of his family. Yes it sounds tacky but if they side her - your child WILL feel like he’s backed into a corner and he will feel like he’s wrong for simply having a vocal tone that is different.", "He has talked to her about it many times, she refused to stop and insists her way is the only way", "What are you talking about? The wife ADORES over the top reactions.", "> You should talk to your wife and express your concerns about her behavior.\n\nOP already did that.", "OFFS, he HAS attempted to have the private conversation, more than once. She isn't listening, and he absolutely needed to be louder and more assertive to get through. Her embarrassment is of her own making.", ">Never undermine each other’s parenting, take your differences behind your kids \n\n\nDoesn't sound like you are a parent. There is no NEVER when life is happening. \n\nYou cannot be fully prepared for everything and not agreeing on everything does not mean one shouldn't be a parent. It is mostly all trial and error.", "It's emotional abuse. Because then some kids grow up not being able to read the room and having bad emotional cues,", "Corpsehusband comes to mind. That dudes voice is amazing because it is so deep and emotionless.", "Perfect approach 😂", "r/MaliciousCompliance", "No I’m pretty sure bullying can happen regardless of age range.", "Id say bullying is a type of abuse.", "Emotional abuse either way. She's disgusting", "Maybe she adds a treat to sweeten the deal?", "That is fantastic I wish I could see that play out 🤣", "Love your pettiness 😂.", "I don’t want to say that I’m sorry for your SM bc I don’t think there’s anything to be sorry about but I just wanted to say hi! \n\nMy 4 yr old is SM and, BOY, has it taught me so freaking much about anxiety and how it manifests. She doesn’t show any signs of Autism, so it’s strictly anxiety, but she’s ADHD as hell. \n\n2 of her sisters are Autistic, one has Tourette’s, all have ADHD and anxiety. All her bio sisters have dyslexia and dysgraphia- like we really span the spectrum over here but her SM has taught me more about ppl and how they relate to their environment than anything else. Idk why and I’m not saying I don’t understand my Autists, but I guess the SM just filled in the gaps. \n\nI’m glad that you’ve found a space to be able to freely communicate! It gives me hope! I can actually SEE the moment her vocal cords freeze and it freezes me when it happens. It’s physically painful to watch. \n\nKeep on u/crocodilezebramilk! I wish you peace and happiness and thank you for openly talking about it!", "Then you’re a great dad", "Just want to say, there is absolutely nothing wrong with your son having a deadpan voice and not being “enthused” enough for your wife’s standards. If he seems at all depressed, or potentially struggling with social issues, then the solution is a licensed therapist, not your wife’s harassment. She is exhibiting harmful behaviors towards him that can potentially lead to insecurities or cause further damage, if he is dealing with any underlying issues.", "I'm like your son. Nobody has ever given me shit about it. In fact people have told me they like being around me because I'm always calm and never raise my voice. NTA.", "You did the right thing. \n\nOne of my parents has bullied me like this all my life. There’s always something to fix and they are always looking for a chance to point it out, in front of anyone - and I mean anyone - who will listen. I needed support like you are providing here. Good job. Rock on.", "NTA.\n\nHowever, may I ask, how *deadpan* is your son’s voice? \nYour son may be happy with the way he is, but having a truly monotone voice could hold him back as an adult.\n\nI complete disagree with how your wife is going about things. Her behaviour is infantilising and rude. I also think you were in the right by leaving dinner- your son knows you have his back.", "I doubt it. Very few people are the cartoon villains this sub likes to think they are. She probably just thinks his deadpan way of speaking is going to hurt him in life and is trying to train him out of it. She's been \"told\" multiple times by her husband but she doesn't agree. She's wrong, but I doubt it's malicious.", "Which is basically what I said.", "When a parent bullies their child it is child abuse.", "Or maybe a line of Rockettes, with a high kick dance routine to make things more ENTHUSIASTIC?", "Thank you! I’m able to communicate with my immediate family fairly well, but any time we’re outside I lock up instantly and wind up using my notes app or sign language. \n\nThankfully my immediate family can read my facial expressions pretty well and they know me down to a T so most times I don’t have to do much to communicate with *them.* But it does get tricky to communicate with anyone outside my family, especially since sign language is not taught in schools at all, and hardly anyone knows it so I do have to get creative and use my notes app on my phone quite a lot. And I need to keep a portable battery on me a LOT. \n\nUnfortunately my SM started at a young age and carried out to adulthood, but that’s mainly because I had no help - because there was none. So I do hope that your little one can find ways to communicate where they’re comfortable .o. It’s pretty hard not being able to communicate like everyone else does, and it’s frustrating sometimes to even *try* because I do end up stuttering, mixing up words and languages, and then I just shut down. \n\nAlso I’m pretty sure I’m also on the spectrum but getting a proper diagnosis as a female and an adult is incredibly hard, I also fit all the boxes for ADHD, and dyscalculia (problem with numbers, dates, time, navigation) like your kiddos .o.", "Beyond a certain level, it's malicious. She's way beyond there, IMO. \n\nWe will continue to disagree.", ">She probably just thinks his deadpan way of speaking is going to hurt him in life and is trying to train him out of it. \n\n\nMy book suggestion for you is: Quiet. No really, it is a book and please read it."]}