{"id": 6089, "submission_id": "zzq511", "title": "AITA for snapping at my wife after she woke me up?", "selftext": "\nMy wife has an unusual sleep schedule, she sleeps only 3 hours at night and then when I'm at work, (she doesnt work) she sleeps for like 5 hours. She has this weird thing where she likes to try on outfits at night and then wake me up to ask me for my opinion. Keep in mind I have a really hard time falling asleep especially after someone wakes me up and turns on the lights. I also need to be well rested as im a chiropractor. She does this almost every night and I tell her to please wait till the morning to show me, but she never complies. \n\nSo last night she did the same thing again as usual, and I snapped at her. I didn't insult her or say anything mean but I did yell at her to let me f**** sleep and stop being so annoying. She left the room and slammed the door behind her. I don't remember what happened after because I fell right back asleep as I was very tired. In the morning she was giving me the silent treatment and didn't pack my lunch like she normally does. She was also side eyeing me and sighing. I tried reconciling with her but she just ignored me. AITA? \n\n\nP.S: English isn't my first language so excuse any mistakes.", "created_utc": 1672478384, "permalink": "/r/AmItheAsshole/comments/zzq511/aita_for_snapping_at_my_wife_after_she_woke_me_up/", "score": 187, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I snapped at my wife after she woke me up at night to tell her what I thought of her clothes\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. That was very inconsiderate of her. It sounds like she's not used to being criticized and doesn't realise she's totally in the wrong", "NTA, that is such ridiculous behaviour from her. Trying on outfits in the middle of the night and waking you up for an opinion? That would absolutely be a deal breaker for me.", "NTA\n\nThis is just weird. It’s fine to play dress up and ask for opinions (I’m guilty of it myself) but waking you up to show you? Rather strange. I can’t think of a logical explanation for this behavior outside of maybe excitement, attention seeking and/or self-centered thinking, all of which aren’t really an excuse.\n\nWhy doesn’t she just take a picture and show you when you wake up? Why do the outfits need to be seen right that second?\n\nSleep is very important for overall health and well-being. Even if you could fall right back asleep after she wakes you, her behavior is still rude and unacceptable. She needs to understand this. Perhaps offer the picture suggestion as a compromise?", "NTA, I would have snapped before now! Maybe if she gets a job or hobby in the day she would have a better sleep schedule?", "NTA. That’s just odd behaviour from her.", "Your wife is an inconsiderate disrespectful AH. Wtf.", "NTA, totally rude to wake a sleeping person over something so frivolous. Why have you been tolerating this? Should have stopped her right from the start and not make it a habit.", "NTA. She is definitely selfish and self-centered. You have asked not to be awakened, and she kept crossing that boundary. Now she is pouting because she crossed the line too many times and got what she deserved. I wouldn't apologize. It is she who should be apologizing.", "NTA \n\nDo you have another room? Move into that room and lock the door. Sleep deprivation is no joke. \n\nPlus, if she would stay awake during the day, her sleep schedule may adjust so she sleeps at night. I work shift work and she has adapted her body to that schedule.", "Maybe she should work, help regulate her sleeping schedule and give her something to do. Not making your lunch is petty behavior as you are still providing for her by going to work. I know I may sound like as ass for suggesting for her to go to work, but it would be helpful for her to understand that you need sleep in order to work in the morning.", "NTA, I would divorce over this ridiculous behavior.\nNot having a regular sleeping schedule is fine, literally waking other people up on purpose and making a lot of noise is ridiculous and lacks common sense & respect", "NTA. I work night and wife insist on coming home from, she works half days, and coming into our room and getting my K9 to let him out. I greatly appreciate her help but she’s constantly slamming the door and being very loud when calling him. Additionally, my other dogs will come rushing into the room and jump on the bed. It once again became a problem today as she decided to bring my daughter some food when she came home. She proceeded to hand off the food at the entrance to our bed room talking and my work dog started barking which woke me up. I feel your pain.", "NTA. You have been far more patient than I; the first time it happened I would’ve snapped. Also, she should see her doc or a sleep center about her sleeping patterns. That’s super not normal.", "NTA. Your wife is ridiculously inconsiderate. I would have snapped a long time ago if I were you", "Your wife is selfish. If she worked she would understand sleep is a valuable thing that she robs you of to show you “outfits”. She sounds childish. \n\nI am sure she is also lovely and that’s why you married her. But you need to get her to understand that you need your sleep time for sleep so you can continue to be the breadwinner and support her. \n\nShe should find something more productive to do while you’re at work instead of sleeping. Then she would also be tired at night while you’re trying to sleep. \n\nYou’re a chiropractor…give her an (attitude) adjustment 😂", "NTA, a relationship is still a transaction, even if both of you should look out for the other's interest.", "NTA. I have a sleeping disorder and a similar sleep schedule (4 hours at night, 4 hours during the day). \nI understand my husband works afull day and requires the full night of sleep so he can safely make to work, perform his work duties, then make it home. I would do nothing to compromise this. It would have to be an emergency for me to get him up. I wear headphones to listen to my music and shows and work quietly around the house when he is asleep. It’s not just annoying, it’s a safety issue and a health issue. People with sleep deprivation are more likely to get in an accident or get sick, if she’s doing this on a regular basis, she lacks concern for his well being.", "NTA. She isn't respecting the fact that you need to rest because you have to work and sleep deprivation is unhealthy, so she's not taking your health and wellbeing into consideration. The only reason she should be disturbing your sleep is if there's an emergency. The fact that you've asked her repeatedly not to do this to you and she's persisting is a big problem... she seems to have some boundary issues.", "NTA. That’s hugely disrespectful. She may be happy with her unusual sleep schedule, however she has no good reason to be waking you at all. \nYou need to sit her down and tell her to quit waking you, and cease the entire outfit sessions. Other than that, separate rooms with a lock. \n(Note - my teenager likes to try on outfits and make up at stupid hours, but she just takes photos!)", "NTA.  She is being selfish and rude.\n\nShe seems to be very interested in her clothes. \n\nYou could set boundaries around her waking you to show you her outfits but refusing to give her money for shopping if she wakes you up and/or donating to charity each and every outfit that she wakes you up to see.  Perhaps you could set a scheduled time, after dinner, before bed, which is the ONLY time that you will look at clothes.", "Um... NTA. Is she getting therapy? There is something gone wrong with her thinking if she thinks her behavior is ok.", "NTA", "Lock the door. NTA. Number one rule of respect in my house is to be considerate of others sleeping schedules. Hella rude.", "She is being completely self centred and inconsiderate. You have to get up for work. You don’t have the option to catch up on sleep during the day like she does. She needs to leave you alone to sleep.\n\nNTA", "NTA your wife is totally disrespectful. You need to tell her this is not on and youbwill not accept this, she needs to apologise. How would she like it if you kept calling her when she is trying to sleep in the daytime?", "NTA - and please realise that her behaviour is abusive. Disrupting your sleep night after night for such a ridiculous reason with no regard for you is not normal behaviour, I honestly think your wife needs help.", "NTA. She is fully aware that you don’t want to be woken up to play her fashion model game and she continues on doing it repeatedly. Not letting someone get sleep is abuse. Her behaviour is abusive.", "Nta she needs help", "Does she spend a lot of her time shopping for clothes?  What's with all the outfits?  If it were my husband he would definitely not appreciate my interrupting his sleep so I could show off my clothes.  He doesn't really care what I wear anyway, and he sure wouldn't like it in the middle of the night when he has to work the next day.", "NTA and actually it is abuse.  I do not toss abuse lightly but because you have repeatedly asked her not to and your are not getting any consistent sleep, night after night, you are facing likely sleep deprivation!  That's, I assume, almost torturous.\n\nI'm sorry she has sleep issues, she should see a specialist, but the fact she is willing to risk your well-being because of how she sleeps is abhorrent.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nMy wife has an unusual sleep schedule, she sleeps only 3 hours at night and then when I'm at work, (she doesnt work) she sleeps for like 5 hours. She has this weird thing where she likes to try on outfits at night and then wake me up to ask me for my opinion. Keep in mind I have a really hard time falling asleep especially after someone wakes me up and turns on the lights. I also need to be well rested as im a chiropractor. She does this almost every night and I tell her to please wait till the morning to show me, but she never complies. \n\nSo last night she did the same thing again as usual, and I snapped at her. I didn't insult her or say anything mean but I did yell at her to let me f**** sleep and stop being so annoying. She left the room and slammed the door behind her. I don't remember what happened after because I fell right back asleep as I was very tired. In the morning she was giving me the silent treatment and didn't pack my lunch like she normally does. She was also side eyeing me and sighing. I tried reconciling with her but she just ignored me. AITA? \n\n\nP.S: English isn't my first language so excuse any mistakes.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA what she is doing continuously is quite inconsiderate. When you are able to please have a calm sit down discussion with her. Letting her know that this is impacting you mentally physically and could lead to financial impacting. Let her know there's the great ability she has to be in another part of the house to try on outfits take photos of those and you'll be able to look at those later on during awake hours. Let her know that you love and respect her and you would not interfere with what her physical needs are so please respect and don't interfere with your physical needs. Some of us who sleep less than others can be forgetful of other people's needs. Consistency reminders and a firm boundary are going to be very helpful in this instance.", "NTA. she knows what she's doing. she's interrupting your sleep on purpose.", "NTA!!!", "I think more couples could benefit from separate bedrooms, especially when having such different nighttime routines. If that's not doable, at least put the wardrobe in a different room so she doesn't have to turn on the bedroom lights and wake you up. But with separate bedrooms you could also lock your door if she still wakes you up going in and out without respecting your need for sleep. N A H\n\nEdit: read it again and you have asked her to not wake you up and yet she keeps waking you up on purpose to show you outfits? NTA, buddy that's torture, I would yell as well...", "Is she in drugs? This sounds legit so strange who wakes up their husband to show him outfits…", "NTA\n\nThat's divorce material.  Extremely inconsiderate of her.  Worst part is that you can't get her back the same way... because she really doesn't sleep.  I wonder whether she needs a sleep study to determine what's wrong with her sleep and if there's something that will help fix it.  Lack of sleep can cause irrational behaviour.  She's behaving irrationally.\n\nMy adult child does stuff like this sometimes.  She'll ring me at 2am to tell me something because she's still awake.  I yell at her because there is no consideration for others who are sleeping because they have work the next day.  I want to yell at your wife for what she does too.", "NTA she is rude and i considerate. Why doesnt she work? Sounds like her nap time is affecting her sleep time. Time to nip that!", "NTA. Split sleep cycles suck, you wake up in the night and just can't sleep again. There are loads of ways she can keep herself occupied without waking you up too. Reading in another room, reading on her mobile device, watching something with headphones on watching something quietly in another room, trying outfits on in another room and taking pictures to show you later when you do wake up etc etc etc. Her waking you up in the middle of the night just because shes awake is ridiculous.", "NTA. Move into another room and lock the door. She's an inconsiderate asshole.", "NTA your wife needs to get a job, even if it's just part time to match her weird sleep cycle, and she definitely needs to have more respect for you, your work, and your sleep.\n\nTalk to her when you're both well rested.", "NTA. That's just really rude of her. And odd. You don't get to sleeo during the day or you'd be fired. She needs to stop doing that.", "NTA. She is terribly inconsiderate. Get her a sleep test.", "NTA\n\nI would like to point out that calling someone annoying - even if it’s valid such as this - is insulting them. She needs to respect your sleep. Have a conversation and ask her to take pictures of the outfits. You need sleep to function. Lack of sleep is bad for your health all around.", "Wake her up the next time she is asleep and see how she will react. And do that countless times as she does now. I bet she will be pissed. \n\nHow does her mind work to think she can just wake you up? I just don’t understand the dumbness of some people. NTA", "NTA she’s inconsiderate and the asshole", "NTA but your wife should see a therapist. She sounds manic as if she has some sort of mental illness.", "NTA \n\nShe is being completely unreasonable. There is no need to wake you up to show you outfits.", "NTA. This is strange and your wife should get a job.", "NTA. You asked her to stop, she didn't stop.  Actions, meet consequences.  You need to talk to her though.  She can't keep doing this and think what you  need to function healthily isn't important.", "Info:  was it a choice for her not to work, or work papers issue? Does she have any friends? Is she lonely or depressed? Either way this is really odd behaviour.", "NTA the is torturing you waking you up night after night for no good reason. And being abusive giving you the silent treatment for her screw up. She has no right to be mad at you. Sit her down, explain to her you have asked her repeatedly not to wake you up unless it’s an emergency and that you won’t stand for it anymore. If possible start sleeping in separate rooms. Good luck!", "NAH. This just sounds weird. People suggesting divorce over this are wild 😂", "Not everyone has a regulated sleep schedule.  There are multiple sleep disorders that don't allow people to sleep all at once, or even at night.  I have delayed sleep phase syndrome.  I have a full-time job, but I'm unable to sleep a \"normal\" sleep schedule.  I have no control over my own sleep.", "You definitely need to have a discussion with her. Mine works weird hours, and we have an understanding and respect it. Not fair at all that she isn't keeping you in mind. Mine suffers from insomnia even with the crazy hours and will not turn on the TV in the bedroom if I'm sleeping.  He'll sit in the family room and make sure the volume isn't loud to wake up others.", "That sounds like a parent/child relationship, and financial abuse to boot.  No a great idea IMHO.", "YTA for being a chiropractor.", "NTA. I have a horrible sleep cycle due to my poor health and I always leave my SO alone when he sleeps. I know his job is physically taxing and is super draining so I avoid the bedroom when he’s sleeping or if I want to lay next to him as he sleeps I’ll read on my phone, which is dimmed alot.", "nta, my boyfriend is a heavy sleeper but I still try to be as quiet as possible when showering/getting dressed with lights off to not wake him", "NTA…as others said, very odd behavior.  But, she gets to sleep during the day?  A good five hours?  Without interruptions?  Time to find a way to interrupt her sleep for a good month and let her see what it is like for you.  Find an alarm that you can hide where she cannot find it, or get to it, or turn it off.   I would have it go off about half way into her sleep for a good minute.  After a few weeks of this, hopefully she would understand about needing sleep.   But, do you work long hours?  How much time do you spend together on the weekdays?  Is she like this on the weekends?  Does she do anything outside the house?  With friends?  It sounds like she needs something to do.", "What you should have done was call her every 20min during her 5hr nap", "NTA", "NTA go to marriage counseling & have her book a sleep study with the goal of normal sleeping hours. She is very inconsiderate & if this continues it is likely to affect your job performance & livelihood.", "Wakes you up to get opinion on dress?\n\n“That dress makes you look fat & inconsiderate.”\n\nNTA", "NTA but also you need to sit down wife's and explain your expectations for sleep, and she needs to respect that or sleep in different room.", "STOP TRYING TO RECONCILE WITH HER!!!\n\nSHE needs to be the one apologizing,  not you. NTA", "NTA at all. Snap at her again if she continues doing it.", "Does she have any mental health problems?", "NTA- you’ve been remarkably restrained. Most people would have reacted like that the first time she did that. Insomnia is not an excuse for being a selfish asshole.", "Your wife is so unreasonable. She wakes you up to look at her outfits?! \n\nNTA and do not let her convince you otherwise.", "NTA. Your wife needs therapy.", "NTA but you can pack your own lunch you are not 5", "NTA. Your wife needs to get a job. That way, she will stop sleeping during the day and actually sleep at night. Plus, your family will get extra money. Win-win.", "NTA. You cannot be held accountable for being rude after being woken up in the middle of the night.\n\nI’m not sure what ages you are, but your wife acting incredibly immature by choosing to ignore you rather than talking to you.\n\nI’m not sure what is going on with your wife, but something is up. It’s just not normal behavior to do things like late fashion shows on a regular basis and on top of that is showing a severe lack of common sense/empathy by waking you up in the middle of the night.\n\nI’m not sure what you can do here. If she keeps refusing to talk to you, there is no fixing the problem.", "NTA. There is nothing that makes people not tolerate selfish behaviors than the lack of sleep. I honestly think you should wake her up every each time she tries to nap. Or suggest that maybe it is time for her to find a job", "Anxiety. Anxiety could make a person do this. It could also contribute to that sleep schedule.\n\nNTA, but OP it doesn’t sound like your wife is totally healthy. I’m not a health professional, but it sounds like seeing one might help both of you.", "I have a weird sleep schedule (insomnia/night shift worker) so when I move in with my boyfriend, we’ll keep separate bedrooms. I’d hate to unintentionally keep him up, let alone on purpose.", "I don’t know how regular this is for OP’s wife, but this happens to me when I get hypomanic."]}