{"id": 6106, "submission_id": "zzudwh", "title": "AITA for wanting my best friend to go out without her boyfriend?", "selftext": "Sorry if the title is confusing but I'll try to explain. Throwaway account.\n\nSo I (22f) have a best friend (23f) that I'll call M. We live in different countries so we only see eachother 2 times a year on summer and winter breaks. \n\nEach time I went home we planned on going out which we dit. In the past 3 year we each got boyfriends so every time we would go out we would do like a doble date.\n\nBut I missed going out only the two of us like old times. \n\nSo I invited her out to go eat something and spend some time together just the two of us but she said that her boyfriend wouldn't like that and that she wanted to spend the day with him since he wasn't working that day and that we should do a double date. \n\nI got annoyed since I expected that she could sacrifice a few hours and spend some time with me without her boyfriend as I would do myself. So I decided that since she can't do that from now on I won't be going out with them and we'll just stick to talking over the internet as we do the rest of the year.\n\nI want to also mention that I convinced her 2 times before to do a girl's night and even then she would rush home after an hour or so.\n\nMy boyfriend says that she's an AH for this and because of this he also won't go on double dates with them anymore.\n\nAre we the assholes for not wanting to go out with them anymore? \n\nShe's my best friend since childhood and our double dates are usually fun, but I felt bad when she wouldn't spend some time with me..", "created_utc": 1672494105, "permalink": "/r/AmItheAsshole/comments/zzudwh/aita_for_wanting_my_best_friend_to_go_out_without/", "score": 73, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the Asshole for wanting my best friend to go out with me without her boyfriend?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. It's a little concerning that her boyfriend \"doesn't like\" her going out without him. Doesn't sound like their relationship is a very healthy one. But I think you're right to stop putting effort into the friendship.", "NTA. \n\nWhat exactly wouldn't her boyfriend like? Her having friends? That's a red flag, but she's so blinded she wouldn't see, anyway. \n\nYour boyfriend reacted good, though, he's supporting you and taking your side, as he should. \n\nI'm sorry your friend doesn't want to spend time with you anymore. You could eventually try asking her why, but i doubt she'd like that, or if she'd answer honestly.", "NTA at all, it’s obvs hard to tell what their relationship is like… but it does sound like maybe she is in a toxic relationship especially if shes said her bf wouldn’t like the idea of you 2 hanging out together without him AND the fact that she rushes home after an hour of hanging out. \n\nTry to speak to her about how you’re feeling, there may be other reasons why she seems to not be able to put more effort into the friendship. It’s a new year, and I hope in 2023 you are able to surround yourself with more friends who can appreciate you and put in effort to see you!", "Nta. Having to Rushing home , etc is controlling on her bfs part", "NTA - if you live in different countries and rarely get to see each other, she should make an effort to spend some time with you without her partner. If she chooses not to, it’s time to move on and stop making the effort.", "NTA. She can go out with you without her boyfriend. Her boyfriend sounds really controlling. She has to be able to speak up for herself. If she can’t do that, it is ok to scale back from your friendship. Someday, she may not have the boyfriend and she will be sad she prioritized his demands over your friendship.", "NTA , and I would have done the same thing", "NTA: She should try to spend some time alone with you if you barely see each other. It's time to move on and quit making the effort if she decides not to. You are no longer required to play along if she can't find time to spend a couple hours with you just as friends. Friendships shouldn't always be dependent on the relationships of one individual. Your partner is an AH as well for being so unkind and selfish to you.", "NAH - you’re definitely not an AH - it sounds like she is involved with a very controlling guy - that doesn’t make her an AH either, but you should probably try to keep an eye on her for her safety - her BF is probably abusive in other ways", "NAH/NTA. You’re not the asshole for wanting to have one on one time with your bestie - my best friend and I have girls nights once or twice a month even though she’s engaged. But some women, once entering relationships, center their whole social worlds around their partners and hate doing stuff without them. It’s shitty and it shouldn’t be that way, but it is like that for some women and she’s not an asshole for not feeling comfortable going out without her boyfriend (especially if he’s at all controlling and she’s afraid of him).", "NTA.\n\nIf she can‘t make time to spend a few hours only with your as friends, you aren’t obligated to play along anymore. Friendships shouldn‘t always be tied to one person‘s relationship.\n\nAnd your boyfriend is an AH for being so selfish and inconsiderate towards you as well.", "ESH - you shouldn’t cut someone off for just one shitty thing especially if they are a life long friend. It also makes me think something is happening with her current partner, toxic and abusive partners often isolate their significant others from their family and friends as a form of control. \n\nMy advice would be to maybe miss out on seeing them this year but really let them know you miss hanging out just the two of you and dont lose touch.", "Nta BUT\n\nI know a lot of people that are uncapable of activity without the partner. You can't judge them for a behaviour different to yours.", "ESH - Your friend should be willing to spend an evening without her boyfriend.\n\nLikewise, it seems an extreme measure to cut all contact with a childhood friend because of this. \n\nIs there a middle ground you could reach with you friend?", "I’m kinda torn.. I don’t think you’re an AH for being upset, but to no longer hang out in person altogether is a bit much for someone you claim has been your best friend since childhood.. so, YTA, but just barely.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSorry if the title is confusing but I'll try to explain. Throwaway account.\n\nSo I (22f) have a best friend (23f) that I'll call M. We live in different countries so we only see eachother 2 times a year on summer and winter breaks. \n\nEach time I went home we planned on going out which we dit. In the past 3 year we each got boyfriends so every time we would go out we would do like a doble date.\n\nBut I missed going out only the two of us like old times. \n\nSo I invited her out to go eat something and spend some time together just the two of us but she said that her boyfriend wouldn't like that and that she wanted to spend the day with him since he wasn't working that day and that we should do a double date. \n\nI got annoyed since I expected that she could sacrifice a few hours and spend some time with me without her boyfriend as I would do myself. So I decided that since she can't do that from now on I won't be going out with them and we'll just stick to talking over the internet as we do the rest of the year.\n\nI want to also mention that I convinced her 2 times before to do a girl's night and even then she would rush home after an hour or so.\n\nMy boyfriend says that she's an AH for this and because of this he also won't go on double dates with them anymore.\n\nAre we the assholes for not wanting to go out with them anymore? \n\nShe's my best friend since childhood and our double dates are usually fun, but I felt bad when she wouldn't spend some time with me..\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH … I know your feelings are hurt, and I’m sorry. Maybe, after all these years, you don’t know her as well as you once did. Maybe she’s grown in a different direction and reminiscing about old times makes her sad. \nIt happened with my friend of many years. I still love her, and will always cherish her, but she’s a different person now, and the reminiscing can be a bit much. She’s in a different part of life, as am I, and on some levels we just don’t relate anymore.", "NTA - I think the biggest thing for me is he doesn’t want her to go out without him…I know couples who much prefer to hangout together but it’s not because they don’t want the other to have independent time. It seems a bit controlling from his perspective. As a friend, I would almost talk to her about why that is instead of cutting someone off completely. It could just be you are both living different lives now…it does happen…but it might not be.", "NTA", "Updated comment with judgement: NTA\n\nIf OP is the one traveling to a different country where her best friend and best friend's bf lives and finds her best friend is not willing to spend time with her one-on-one, then it's totally understandable if OP doesn't want to go on double dates.\n\n\\------\n\nOriginal comment asking for more information:\n\nDoes your best friend and her boyfriend live in the same country? Or do they also live in different countries? (Basically, I'm wondering how often your best friend is able to see her boyfriend?)", "NAH. You’d rather spend alone time with her and she’d rather spend double date time with you. It’s not like she’s standing you up, she’s clearly expressing her preference. If you enjoy your double dates with them, go out with them.", "For more info : I don't plan to cut off contact completely, just remain to talking over the internet.\n\nAlso : For the people calling him controlling, I don't really thinks he is that controlling. I think she said that he wouldn't like just the two of us hanging because she didn't want to, as she admitted being too depend on him before/never wanting to go out without him.", "Lol lot of singles in this comment section I’d reckon", "NTA for expecting some occasional 1:1 girl time, but I worry that this could be a red flag that she's in an abusive relationship. This is not a time to abandon what has always been a good friendship - see if you can get her to open up and make sure she knows that you have a safe place for her if she ever needs it.", "ESH.\n\nYou are both a little immature. The friend for the extreme codependency that is their relationship with the boyfriend. You for trying to force your friend into compliance by rescinding time together until they do what you want. Then you went to your own boyfriend to complain about what a victim you are. \n\nDid you try having an honest conversation with your friend about how you feel? Did you ask them about their own feelings?", "NTA her bf sounds controlling, she always chooses what the activities or plans are probably due to her bf suggestions.  If the outings are not as much fun anymore then there is no longer a need to do double dates.", "NTA but you might want to pay close attention... she says \"he wouldn't like it\".... sounds controlling.  She might not be in a great situation with him. I know Reddit likes to jump to conclusions, but...  well. You know your friend.  But from an outsider's perspective, that was a red flag to me.", "YTA  there is a solution to this issue.  The 2 of you can meet up early and bfs can join later.  Everyone is happy.", "My question is whether the best friend and her boyfriend live in the same country or not.\n\nI'm reading this as the best friend travels back to OP's country twice a year. I'm assuming the best friend's boyfriend also lives in OP's country because otherwise it's really surprising that the best friend's boyfriends travels with his girlfriend to a different country twice every year.\n\n(The other scenario is that OP and her boyfriend travel to the the best friend's country twice a year which also seems unlikely.)\n\nIf that is the case, then I think I understand the best friend's POV much better. She has limited time to spend with both her best friend and her boyfriend and so wants to make the most of it.", "My question is whether the best friend and her boyfriend live in the same country or not.\r  \n\r  \nI'm reading this as the best friend travels back to OP's country twice a year. I'm assuming the best friend's boyfriend also lives in OP's country because otherwise it's really surprising that the best friend's boyfriends travels with his girlfriend to a different country twice every year.\r  \n\r  \n(The other scenario is that OP and her boyfriend travel to the the best friend's country twice a year which also seems unlikely.)\r  \n\r  \nIf that is the case, then that explains why the boyfriend might be upset because he only has limited time with his girlfriend. \n\nOR if he is traveling to a different country with his girlfriend, it would be mean if she ditches him to be all by himself in a foreign country.", "??? OP's boyfriend is supporting OP in this tho?? How is he the asshole?", "I'm not intending to cut off all contact, just hang out less with them. We talk almost every day through messages.\n\n Also when we were hanging out they would always choose where because they would never like our suggestions so there's also that.\n\nThat's why I also wanted to hang out just me and her because as a double date we would always do or go where they wanted and it became less and less fun.", "They live together. They're together everyday :/", "More context for my question\n\n1. Is the best friend the only person living in a different country in this scenario? If so, then during the two times you guys see each other, is she the one coming back to your country? Are those also only the times that she gets to see her boyfriend?\n2. If it's the best friend and her boyfriend who both live abroad, then do they both travel to your country to see you? Does he have friends/anyone else in your country that he can hang out with while your best friend would hang out one-on-one with you?\n3. Or are you the only one living in a different country? And you are you going to visit both your best friend and your boyfriend?\n4. Or is your boyfriend also making a trip twice a year with you?\n5. Or do you guys take turns to visit each other?\n\nThe situation changes in every scenario. But it's very important to understand who lives in different countries.", "“Each time I went home we planned on going out…”\nImplies that OP is the one visiting their hometown/country where best friend lives.", "I also thought OP's bf is supporting her in this, but then I read this part again:\n\n>My boyfriend says that she's an AH for this and because of this he also won't go on double dates with them anymore.\n\nAnd now I'm not so sure. There's enough vagueness to suggest that OP's bf might be the one instigating this whole not-wanting-to-do-double-dates thing.", "So me and my bf live in a different country. We go to our home country (where best friend and her bf lives)  twice a year.", "Yeah OP clarified that later in a different comment.", "Yes, i've read that part multiple times before i commented to you. \n\nI understand it as \"my boyfriend thinks it's rude of them and doesn't want to go on *double dates* with them as well as me, since i have no plans to do that anymore\". How do you understand it, since you're not sure?", "This is really important context. I'm updating the top-level comment with my judgement.", "Sorry if I didn't explain correctly, but this is what I meant. English is not my first language.", ">How do you understand it, since you're not sure?\n\nOriginally, I was under the impression that it's the best friend who is traveling back to her home country and I wasn't sure if she and her bf live in the same country. If that were the case, then it would be sus if OP's bf was calling the best friend in AH.\n\nBut based on new context provided by OP, my original impression was incorrect. Given that it is OP and her bf who travel to the other country, I now think OP's bf's opinion makes sense.\n\nBut also, jfyi\n\n>Yes, i've read that part multiple times before i commented to you.\n\nI'm not the person you replied to :) I just randomly jumped into the convo. Sorry about that.", "Neither is mine, no worries. ^^", "NTA I had a boyfriend like that. Controlling. Just be prepared for your friend to be very mad, because she will defend her boyfriend out of fear. Eventually she will come back.", "NTA no one wants to hang with their friends SOs", "NTA. it sounds like she’s in a controlling relationship. There’s an issue if he gets upset with her hanging with others without him or she’s cuts things short to get home to him early. Also you live in another country so this is not someone she sees on a regular. You should let her know this upsets you and you would like one on one time with her without your partners around. Maybe voice your concerns if she says she feels bad leaving him behind or he gets upset.", "NTA But I’m curious if your friend constantly checks her phone and messages during your girl’s nights. As other commenters have said, her rushing home bodes poorly for her position in her relationship.", "Her decision to spend time alone with you shouldn’t affect your decision to do a double date if you also enjoy that. In the long run, you’ll have to recognize that your relationship is changing and this is how it’s going to be if the friend has an SO. It’s up to you to determine if you want to adjust to this change in the friendship parameters. \nNAH", "NTA, but I think your friend isn't purposefully being an AH either. \n\nPlease do speak to her about her partner because that's very controlling (and is what I expected would be the problem because it happens a lot). He seems controlling, and this is a form of abuse. Not allowing to go out on her own. If she were, I expect he would accuse her of cheating and being out to see men, even accusing of cheating with your partner. It is 100% unhealthy to expect your partner to not go out without you. She needs help seeing that she's not being treated right. Because for most of us it takes a long time to realize what's happening to us. Take it from those with experience. If she left after an hour of hanging out without him, that rings alarm bells in my head. Because that just tells me she was scared. and if she was scared, she expected something scary. So I doubt it has stopped at controlling behaviour. \n\nThis sort of behaviour from someone - not going out alone without the partner - is a pretty telling sign.", "That’s not healthy behavior. Not saying they should be “judged” but it’s not just “different behavior”. Codependency isn’t a good thing.", "Oh no worries! I was at the store at the time and didn't even look at the nicknames. xd didn't occur to me someone else might have replied to me tbh ^^ \n\nThanks for explaining either way!"]}