{"id": 6132, "submission_id": "10029mu", "title": "AITA for telling my son's teacher to reconsider her role as an educator?", "selftext": "I just want to preface this by saying that I (M42) appreciate the work of educators. This isn't intended to be a shot at them.\n\nMy son (13M) is a good kid who follows the rules, does his homework, and generally does well in school. He is also very pragmatic and doesn't take kindly to authority figures who try to shame or bully him. \n\nSo onto the incident at hand. \n\nAbout a month ago, my son was assigned a project in one of his classes. The assignment was to interview three people in different professions and discuss the commonalities they share and the differences between the various jobs. It was an assignment I thought was a great opportunity for my son to explore his talents and options for his future. \n\nMy son interviewed three people for his project: Our garbage collector, our neighbor who works in finance, and his aunt who does business consulting. My son then crafted a report about his project, noting the differences and similarities between the three professions\n\nHowever, when my son presented his project to his class, the teacher made some inappropriate remarks about his choice of interviewees, saying that \"a trash collector is not an appropriate profession to compare against finance and business consulting\". \"Do you want to end up as a trash collector?\" She asked my son. Of course, this embarrassed him and made his class laugh.\n\nI was not pleased. \n\nSo I set up a meeting with the principal and the teacher and I told her exactly how I felt. I told her that my son should have the freedom to explore whatever avenues he wants to explore. The principal said she understood but \"education and trash collection do not exactly go hand in hand\". The teacher just smiled in a \"we both know I'm right\" kind of way. \n\nI lost it, telling her that she needs to create a more open and accepting environment for students and that if she wants to make her school a better place she needs to stop shunning certain careers.\n\nHere's where I may have gone wrong: I told the teacher that she needs to reconsider her role as an educator if she is going to think so narrow-mindedly.\n\nI know it's not my place to tell an educator to reconsider her role. At the same time though, I don't think it's right for a teacher to discourage a student from exploring their own potential roles in life.\n\nSo AITA? I want my son to be successful and happy but was this remark about the teacher going too far?", "created_utc": 1672516708, "permalink": "/r/AmItheAsshole/comments/10029mu/aita_for_telling_my_sons_teacher_to_reconsider/", "score": 3437, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole in this situation for speaking to the teacher so harshly and suggesting that she reconsider her role as an educator. I know it's not my place to make judgement calls about someone's profession. I may have gone too far.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nSchools pushing kids to consider only college based careers is a problem. I wish when I was in school I had known about the trades or other careers that were an option.\n\nYou probably shouldn't have told her to reconsider her career but you weren't wrong in saying so. A trash collector has as much value to society as anyone else does.", "Trash collectors in my area can make upwards of $100,000 plus benefits. A  Teacher in my area makes about $50,000 plus benefits. I would have pointed that out when she mocked that profession", "NTA. I wonder what she would do if no one ever collected her garbage ever again.", "NTA\n\nNot every profession is a white collar one. Indeed this project makes for a fascinating sociological study. \n\nTell this teacher it’s no wonder that she ended up teaching middle school and not college and see how she likes that.", "NTA\n\nYou’re likely making yourself more level-headed and patient in this retelling than you did in real life but you’re not wrong. Trade jobs are as valuable, if not more lucrative, than a lot of college jobs.\n\nHeck, ours in the bay make 90k a year whereas I was teaching in the same area for 50k. Jokes of them, right?", "Don’t just think about the remarks  as they resonated to your son, think about the other 20-30 students with 30-40 other parents from all sorts of different workforce backgrounds who had to hear that hurtful ignorance.  You were dead on the money when you said she should reconsider her field of work.  NTA.", "Not enough to actually be an AH. I am a teacher and this comment is not that bad. What the teacher did is FAR worse. NTA.", "NTA. Teacher and principal should not be putting down trash collectors. Look at what happens to NYC when sanitation workers go on strike. It immediately turns into a shithole. Trash collectors are an important part of our society and should be treated with the same respect as anyone else. Good on you for standing up to them.", "NTA. i 100% agree with you and grew up having a lot of teachers who were horrible towards me and wish i (or a parent) stood up to them. we dont need more horrible teachers - teachers should not be close minded.", "NTA - I would report them for their behaviour and bias. \nThey are bigoted and are not educators. There’s nothing wrong with having a garbage collector on his report.", "You perhaps could have worded things in a more calm and collected manner but ultimately a teacher (or anyone for that matter) should not ever be looking down on anyone for what their employment is. The teacher was basically implying that a trash collector is an unworthy job which is a very poor lesson to teach children as it teaches them everything that is wrong with society and in my opinion kids should be learning far more than just the basic subjects at both school and home, they should be learning how to be decent human beings who are kind and accepting also. I’d say it was understandable why you lost your cool and said what you said so NTA.", "NTA - there’s absolutely nothing wrong with doing trash collection as a job and the school is wrong for indicating it isn’t a career. Well paying job, benefits, pension- without college debt.", "NTA, bin men are valuable members of society, maybe the teacher should consider becoming one? It would teach them about a lot about life and the value of different roles.", "NTA.  And I think the teacher and the principal are very narrow minded about the job of trash collector.  Snobs, really.", "NTA. I think it’s much better to include a job that is very different and makes you actually think through the comparison versus three similar white collar jobs.", "NTA\n\nEnforcing the idea that we should look down on people for their profession is something we have to get passed as a society. Without trash collectors, or entire urban environment would be disgusting. What would teachers do then?", "NTA. Trash collectors are literally one of the backbones of our society and this elitist bullshit is not ok.", "What a snob. The garage collector probably earns more than her. And it's extremely likely that at least one student in her class has a parent with a similar job. She should be ashamed of herself.", "NTA", "A trash collector makes more money and benefits than teacher's so this is funny. \n\nNTA", "NTA. The teacher sounds like she comes from a place of privilege and doesn't understand what leads people to becoming trash collectors or how important they are for your average person. I'm sure if your son interviewed a plumber she'd say the same thing because it isn't a college degree career.", "There is a college degree called environmental management. It mainly deals with how to find a balance between landfills and nature (among many other crucial things). Garbage collecting is way more than just picking a can up from the curb. It is an essential part of keeping the earth and the creatures in it healthy. In fact, the more emphasis we put on where our garbage goes and how to make less of it would do SO MUCH GOOD!!\n\nNot only are you NTA, you are 100% correct. The educator needs to be educated. \n\nA career in garbage disposal is a lot more important than this teacher's obviously uneducated opinion.", "NTA. Garbage collectors get paid more than lots of finance jobs, first of all. And yes the classroom needs to be inclusive. The only way you’d be wrong here is if you told the teacher that in front of your son.", "NTA. It was a bit rude but tbh the teacher was way out of line. Your son completed the assignment exactly as instructed, if she's got a problem with what he chose she can keep it to herself.", "NTA. You’re fine. Being a teacher is just a small step up from that of a trash collector. Neither job is something to be ashamed of though.", "NTA, your comment was minor in comparison and doesn't swing it to an E-S-H in my view.\n\nWhat gets me though is what was the actual value of this assignment?  If this compare/contrast exercise is to help the kids work out what kind of career they'd like, this is a really ineffective, or at least inefficient, way to go about it.\n\nI could get it as a way to understand help children understand the value and experience of a different array of jobs and experiences in a society.  Yet the teacher is acting like this is a substitution for careers advice which it blatantly isn't.", "NTA. And as a side note a garbage collector can provide a good life and is a needed service in our society. What a shitty thing for a teacher to say. And no I'm not a garbage collector either.", "NTA. And she needs to reconsider her career if she thinks bullying kids is acceptable.", "NTA. Teacher and principal are being classist as hell. I bet they'd love it if their regular trash collectors suddenly stopped doing the job they seem to think isn't valid lol.", "NTA, the world wouldn't run without trash collectors. Good on you for calling out pretension", "NTA. What if one of your sons classmates has a family member who works as a trash collector?? What a bigoted and elitist comment. Honestly I’d  take this further up the chain.", "As an educator for over 25 years you are absolutely NTA. If the teacher wanted the kids to only interview jobs that required a college degree that should have been stated in the directions (which is also obnoxious IMHO). \n\nThe teacher is probably jealous that the trash collector gets paid more than she does.  I know I am....😂", " NTA and some people just should not teach. She sounds really stuck up.", "NTA and i bet that trash collector makes 3x her salary", "As much as teaching is vital to our society, collecting trash is more so. It prevents disease, especially in anything more populous than a village. It helps protect infrastructure. And generally these are union jobs with good benefits. NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI just want to preface this by saying that I (M42) appreciate the work of educators. This isn't intended to be a shot at them.\n\nMy son (13M) is a good kid who follows the rules, does his homework, and generally does well in school. He is also very pragmatic and doesn't take kindly to authority figures who try to shame or bully him. \n\nSo onto the incident at hand. \n\nAbout a month ago, my son was assigned a project in one of his classes. The assignment was to interview three people in different professions and discuss the commonalities they share and the differences between the various jobs. It was an assignment I thought was a great opportunity for my son to explore his talents and options for his future. \n\nMy son interviewed three people for his project: Our garbage collector, our neighbor who works in finance, and his aunt who does business consulting. My son then crafted a report about his project, noting the differences and similarities between the three professions\n\nHowever, when my son presented his project to his class, the teacher made some inappropriate remarks about his choice of interviewees, saying that \"a trash collector is not an appropriate profession to compare against finance and business consulting\". \"Do you want to end up as a trash collector?\" She asked my son. Of course, this embarrassed him and made his class laugh.\n\nI was not pleased. \n\nSo I set up a meeting with the principal and the teacher and I told her exactly how I felt. I told her that my son should have the freedom to explore whatever avenues he wants to explore. The principal said she understood but \"education and trash collection do not exactly go hand in hand\". The teacher just smiled in a \"we both know I'm right\" kind of way. \n\nI lost it, telling her that she needs to create a more open and accepting environment for students and that if she wants to make her school a better place she needs to stop shunning certain careers.\n\nHere's where I may have gone wrong: I told the teacher that she needs to reconsider her role as an educator if she is going to think so narrow-mindedly.\n\nI know it's not my place to tell an educator to reconsider her role. At the same time though, I don't think it's right for a teacher to discourage a student from exploring their own potential roles in life.\n\nSo AITA? I want my son to be successful and happy but was this remark about the teacher going too far?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. To often people forget that if it wasn’t for those supposed “uneducated” jobs our society wouldn’t work. I get teachers want to push college and what not, but how many time do these newly graduated students end up in debt working at a job not even in their field trying to make a living.", "Did you tell her the trash collector makes more money than she does?", "NTA, if it were that important to them, they should have stipulated that in the assignment. I love that your son thought out of the box and went all out. And trust me, there are a lot of educated trash collectors out there. Thankfully your son has not been brainwashed yet in thinking that it is not a preferred career.", "NTA. I've spent time as a teacher, including in the academic wing of a vocational school. All of those jobs are extremely important and should be valued. Having trash collection is vital in a tangible way the other two are not. Both of those folks should never have become educators. I would encourage you to take this further up in the school system, if at all possible. It sounds like folks needs to learn the true importance of taking out the trash.", "NTA\n\nSure, the garbage collector doesn't need much of an education, but that doesn't mean you can't make an interesting comparison between, for example, how hard the garbage collector works and how hard the financial consultant works.\n\nDepending on exactly what your kid wrote, it might have been a silly comparison, or it might have been a reasonable one, but there's no fundamental reason why one can't compare a consultant and a garbage collector in this kind of exercise.", "NTA. My uncle was a trash collector. He made a whole lot more money than any teacher. He also had great benefits with heath care, retirement package and vacation time. My brother decided to not go to college after my uncle got him a summer job and he saw what kind of money he could make. Both the teacher and the principal are a couple of narrow-minded snobs. From their way of thinking then being a drug dealer is okay. After all, you have to know how to weight the drugs, that's math, cut the drugs with whatever to make them go farther, that's chemistry and then get word out that you are selling and find people to sell to. That covers business and marketing.", " NTA. Where there's muck there's brass.", "NTA. I was a kid who was always a little embarrassed for career day because my mom was a migrant worker and I didn't know how to explain her work compared to other kids whose parents were like, doctors, lawyers and business owners. Talking to a garbage collector like an actual, normal person is teaching your son a valuable lesson about how communities work - everyone's job is important even if it's not \"cool.\" You stood up to a (classist) teacher who couldn't see that lesson-- even though she should've been the one teaching it --and I'd wager might have made the class environment more comfy for other students whose parents work in careers the teach would've made fun of.", "NTA; the attitude that-someone who works in a public service that's not as glamorous as teaching-isn't as worthy as a white collar worker is an horrific message to promote to kids. Just because it doesn't require academic prowess doesn't mean it's not an equally important role to keep society ticking over and your son's project sounds really interesting and you should be proud of him!", "But also the assignment was not to compre three jobs they’d like to have, it was to compare any three professions and find common ground and differences. You son did the job correctly, whether or not he wants to be a trash collector or an astrophysicist is of no consequence for the homework he was assigned.\n\nAbsolutely NTA.", "What was the actual assignment? Was he supposed to find people with similar careers or 3 people in the same profession? Did you actually ask or read the directions before you lost it?", "NTA. Everything you said was right.", "NTA\n\nWhat if one of those kids in the class had a parent who was a trash collector or any other job she decided is not good enough.", "my mom cleans houses for a living. does that make her job less valid? of course not, in fact she makes more money in a week than some white collar jobs out there. definitely NTA on this one. if schools want to be more accepting, than it has to come full circle. it’s not ok to put other jobs down just because you don’t view them as worthy as other jobs", "NTA trash collection is important.  Without it we would be in a real mess.", "NTA - Does this \"teacher\" realize how much money some trash collectors make? What their benefits are? The retirement package? She is a condescending pile.", "NTA - I (36m) was told by my father more times than I can count that I was going to be a loser/worthless, and that I’d end up a garbage man. It’s stuck with me my whole life, and it’s effected many decisions I’ve made. These decisions ended up with my in rehabs and hospitals over the stress of being someone “important”. I’ve now been sober 3 years as of Christmas Eve, and have given up trying to impress anyone with what job I have. Hell a garbage man may be the right call. I wish I would’ve had someone stand up against that.", "NTA\n\nI could not be a trash collector, the heat where I live would kill me in a week. \n\nThe teacher is mocking an essential job, ever look at news coverage during a trash collector strike? Cities would cease to exist if we did not have trash collectors.\n\nIt is also union in a lot of places and can pay very well.\n\nBut even if the above were not true, that is was a pointless job that pays badly. It is a job that humans have. There is a long list of jobs that I do not understand why they exist, or why they make so much money. But the job exists and there is no reason to mock a job that people have to pay the bills, or a job that people want that I don't understand.\n\nI was also reminded of the trash collectors in Turkey that started collecting books that were being thrown out and now have a library. A group of professionals, doing a job that teacher does not respect, created a library. What has that teacher created? Besides a classroom where bullying is normalized. \n\nhttps://www.cnn.com/2018/01/15/europe/garbage-collectors-open-library-with-abandoned-books/index.html", "She's aware that she may well be teaching the children of or future trash collectors, right?  What a vile thing to potentially say.  Not to mention I'd love to see how she deals if they all just stop working for a month.  \n\n\nNTA at all", "NTA\n\nLol she’s probably just mad that the trash collector makes more than her. I don’t know why people throw so much flak at them, they really do make good money. \n\nThe education system never really considers any job that doesn’t need a college degree worthwhile. This behavior is just an extreme result of that imo.", "This teacher is an asshole and gives the profession a bad name. Shame on her.", "NTA and I’d let teacher know that the trash collector probably makes more than her without being saddled by student debt. That’ll wipe the smirk off her face. (ETA I’m not anti-teacher, I’m anti-THIS teacher)", "NTA: There really isn't a more valuable profession in our society than trash collectors/public sanitation in general. They save untold lives. Things get very bad, very quickly without them and this teacher was way out of line.", "Trash collectors make really good money and have benefits. No idea why people look down on them. Can you imagine what would happen if they go on strike? All these people like this teacher would sing a completely different tune", "That Garbage man makes FOUR TIMES what that teacher makes, probably the principal too, neither of them have a CLUE.  🤣🤣🤣\n\nNTA. Have fun being you, and supporting your kid.", "NTA I think this is the first instance of a parent yelling a teacher where the teacher is the AH lol. The teacher is not just narrow minded but classist, I bet she wouldn't be talking BS if those lowly garbage collectors stopped collecting at her house.", "NTA. \n\nAnd also the assignment was NOT three jobs student is interested in, but three jobs compare/contrast. \n\nPlus,  WTF. And your additional comment is deemed  acceptable by a parent who has seen 2 kids through the school system. \n\nSometimes, you gotta shock the pool.", "NTA.\nThat teacher and the principal are elitist. I bet the trash collector makes more and has less student loan debt.", "NTA. I am a science teacher and always encourage students to do what they love, and pays the bills. I would never shame a tradesperson, most usually make more than I do as a teacher with a M.S. That teacher is failing many of her students.", "That would have made me furious as well. Good job standing up! NTA", "NTA. She should be taking this opportunity to remind the kids that all jobs are important. Instead, she’s acting like professions such as a garbage collector are beneath everyone. Also, it’s bold of her to assume that people with blue collar jobs aren’t educated.", "As a former teacher/now administrator I wanted to come and say YTA but you are NTA in this situation. I agree that it’s supposed to be about career or college readiness and she should definitely be more open minded. Hell garbage collectors make more money than many other professionals these days. Their job is necessary and nothing to scoff at!", "NTA", "NTA let her sit in her own trash for a while then ask her if she values trash collectors so lowly. People shit on blue collar jobs cause they don’t want to do them and don’t like to think about the importance of those jobs. Pay check or level of required “formal” education does not indicate value of profession or skill of profession.", "I get angry at people looking down a blue collar jobs as a profession. Preface to say that I have a doctorate, but I think that professions such as garbage collector, plumber, painter and welder are probably more essential to our society than the research I do.  If their jobs don’t get done, everyone notices.  If my job doesn’t got done, the impact is less visible (but no more or less important)\n\nThe point is that we have spent a generation and a half telling kids they need to aspire to a college degree and that has resulted in millions in student debt and an under employed generation.\n\nYet the son of a friend of mine decided after high school to become a welder. By the time my daughter graduated college, he had a steady job and had saved enough for a down payment on a house with no other debt.\n\nI told my kids to pursue any job that interested them that could maintain their chosen lifestyle with out harming or relying on anyone else. If that means becoming a garbage collector (whose job will not be outsourced overseas and probably comes with pension/401K and benefits), then so be it.\n\nNTA and good for you for standing up for your son.", "So... gentlest offering of ESH here. You gotta know telling somebody to their face they're bad at their job is an asshole move.\n\nThat said... from everything you've said, I agree with you. The issue here is that your son still has to deal with them on the regular. Calling them out while he's still in their care may be setting your kid up for added struggles. Make a plan to get the kid out of this educational setting, and in the meantime focus your energies on making sure he knows he's doing a good job and not to listen to idiots.", "ESH\n\nThe teacher should not have said what she did.\n\nYou for the virtue signaling.", "ESH", "It’s usually a union job where I’m from, with decent pay and benefits. Society can’t function without trash collectors, sewage workers, janitors, etc.", "This. A lot of these \"menial jobs\" pay 2-3X what a white collar job pays.\n\nBack in the early 90's I worked for Waste Management and our drivers and collectors made way more money than anyone in the office did.\n\nPeople who are willing to get their hands dirty on the job make bank most of the time.\n\nAlso, where would we be without people who are willing to do these IMPORTANT jobs. Have you seen pics of when the trash collectors go on strike and no one's trash gets picked up for weeks? At that point the trash collectors are the most important people in the city!", "Exactly this. A \"trash collector\" with the right certification in my country does 130 000 and more.. \nIt is a great safe long term job,  teachers earn less", "Teacher is garbage from the sound of it. God knows who'd want to collect her.", "You see that's the part of the story that hasn't been told. The teacher is a hoarder and she finds garbage people to be threatening to her hoard. (Joke)\n\nNTA. I would have went further...", "Jobs like trash collectors may be invisible through a social lens, but they’re just as important. You don’t always care about decisions a banker might make but you know if the rubbish isn’t picked up because it has an immediate impact on you. It’s like the school janitor, who they probably look down on. If they do their job right you don’t even notice until something isn’t done or goes wrong. The assignment was three different professions after all, it didn’t say high class professions.", "Teaching middle school is one of the hardest and toughest jobs for any teacher.", "I think the bin men should just stop collecting this teacher's rubbish out of principle lol", "Time and time again, we've seen the devastating effects of what happens when garbage collectors go on strike. Within a month the streets are filthy, overrun with vermin and pests and if it goes on long enough diseases. \n\nNTA waste management is a respectable job that's essential to a healthy functioning society.", "I would bet big-bucks trash collectors make more money than that teacher.", "I’d rather be a trash collector", "Its rarely an asshole move if it’s  a fact.", "And builders. It’s not seen as a classy job, but who makes the buildings people live, work and do recreation in? Architect plans don’t manifest as stone, brick, wood and glass by magic, people need to make it happen.", "Hell, the city collectors start at about the same as a teacher in my city. I think I’d rather be a garbage collector than a teacher.", "Money doesn't matter, but unionised trash collectors make similar money to teachers, if not better AFAIK.", "Exactly. Im curious hao that teacher would like it if the trash collectors went on strike? How quixkyl would she see their immense value! \nI was in Rome once during a 2 week strike…holy hell it piled up quickly. You do not want that, respect your blue collar workers.", "Realistically civilization collapses a lot faster without trash collection than without business consulting and finance", "Yep, it's like the teacher hasn't been paying attention to the world the last 3 years. Covid has shown just how important the 'low skill/low paying' jobs are to keep our society functional. Just because a job doesn't require a fancy piece of paper doesn't mean it is automatically 'below us'. That almost completely invalidates all of the worlds infrastructure.", "Man, I thank the garbage collectors every time I see them.", "Well according to this teacher a job that is physically and even mentally draining isn't worth anything. It's the jobs that have the prestigious titles that matter.\n\nSo she should be ashamed of her position because of her own standards.\n\nPeople who look down on others for things such as this are terrible people. She should judge herself by her own lens.", "Maybe depending on location. It is funny to hear teachers talk about education and success in this way since it is not as if they themselves reached the pinnacle of success", "Oh, believe me, \"stating facts\" does not exempt anyone from being an asshole, especially when those facts are being pointed out in public deliberately to try to undermine others.", "I was in Rome when a strike happened.  Not sure how long it had gone on but the dumpsters were literally buried under trash to the point you could not see them.", "I checked [salary.com](https://salary.com) and I was wrong. The median salary for teachers in the US is much higher than for garbage collectors.", "Parent-teacher meetings aren't what I'd consider public. Parents need an avenue for accountability and communication. A private meeting was probably the best way to do it without undermining them publicly.", "Don’t confuse me with one of the ‘just being honest’ crowd. You’re right that many people use ‘honesty’ to excuse unnecessary rudeness. However, I’m talking about rather specific senarios. If someone is manifestly incompetent or unprofessional in their job to the point of  adversely affecting other people (as it tends to do), it’s okay to speak up.", "If you call tech support and the person on the phone can't tell Shift from Control and tells you to delete critical system files, do you tell them they're incompetent to their face, or do you file a complaint with their supervisor?\n\nIf a waiter mixes up your order and pours hot coffee down your shirt, do you tell them they may not be cut out for the service sector, or do you file a complaint with the manager on duty?\n\nOP was well within his rights to complain to the principal, or to the school board if the principal doesn't listen, but confronting the teacher directly solves nothing and could be seen as inflammatory.", "Everyone makes mistakes and a mistake doesn’t make someone bad at their job. I’m talking about manifest incompetence. For example, a qualified chainsaw operator felling a tree with colleagues well within the ‘danger zone’ and in the direction of felling (we were operating other machinery at the time, didn’t even know what he was doing till it was done. One example of many true stories). Are his colleagues assholes for telling him what they think of potentially having their lives put at risk?\nYou have a point about it not being the best course, however telling someone doesn’t necessarily make you an asshole.", "17 year educator here. Often (but not always) these “my teacher is horrible” stories are embellished or untrue. I would suggest asking the adult more questions about what happened instead of taking your middle schooler’s recount / assessment at face value.", "For compare and contrast, the combination your kid used seems great. If he was able to tie in similarities it should have been a learning moment for the teacher. NTA", "Nta. Not only does a garbage collector provide an essential service, they also make more money than a teacher and aren’t required to hold a college degree. To top it off they probably work less hours than a teacher and if not, it definitely won’t be a stressful job like I’m sure teaching can be.", "NTA. You could probably make a fortune going in to the trades and starting your own business. She should not be looking down on any profession, especially such a critical one. Seriously what would she do without sanitation workers?!", "NTA.\n\nJobs such as waitress/waiters, garbage collectors, construction workers, factory workers, or positions of more physical labor as just as important and vital to the functioning of contemporary society.\n\nIf I was in your position OP, I might have said something along the times, \"I guess you can take your own trash and drive to the dumpster to dispose it yourself.\"", "As someone who has a lot of family in the educational field, I can easily say they would be ashamed to work w a teacher like this. Also unless you're in higher education, a principal or in the administration, garbage men wages are higher.", "NTA.\n\nLook, as the adult son of a middle school science teacher and a law professor, you had every right to tell that simpleton that she’s undeserving of the opportunity to educate young and mailable minds. For her to so wantonly dismiss the efforts of others (and in such an ironically arrogant fashion no less) speaks to not only her clear inability as an educator to cultivate the atmosphere needed for growth, but also her lack of capacity as a whole to think critically where it’s needed most. \n\nIf you really wanted to be an asshole (who’s in the right), you could’ve simply said that her life’s work will cap her out at 85k a year (if she’s lucky) which at that will forever remand her to the confines of the low-mid middle class.", "Is this a public or private school? I would be looking to switch schools if possible, I wouldn't want my kid anywhere near that teacher and it sounds like the principal is just as bad. NTA", "Actually where I live trash collectors get decent pay, benefits and pensions as it’s a city job.  NTA", "Nta.  She’s just mad that trash collectors make more than she does.", "NTA, and the teacher should have been more specific if certain jobs weren't acceptable.", "NTA. That teacher is a snobby not nice person. Garbage collectors are necessary! I would go to a school committee meeting and the superintendent with this story. I am sure all the garbage collectors in town would love to know what their children are being taught about their profession.", "Did you tell her that trash collector probably makes significantly more money than she does?", "NTA. This teacher can't just insult your son like that. From what I've seen in these comments, garbage collectors still earn a nice amount of money. I wonder what the teacher's reaction would be if she found out a garbage collector earns more than her? Either way, I think you did the right addressing this issue. All that hard work your son did and she belittles him? Shame on her and good on you. All the best.", "NTA,  Blue collar work is a perfectly acceptable field.  Some even pay better than college degree fields.  There is a shortage of workers for these fields because people have said for decades that college education is where it's at.  Now the college fields are being overrun with candidates and the blue collar fields that are able to get higher starting pay for the field due to lack of employment pools.", "NTA- what’s wrong with being a garbage collector?", "The irony that teachers are constantly threatening to strike because they are underpaid and undervalued but garbage collectors are happy and paid pretty well and home by 4pm. NTA OP", "Lmao my wife is a teacher and I guarantee the trash collectors make more than her…. NTA", "NTA\n\nDoes your son go to a public or private school?", "NTA. Both the teacher and principal sound prejudiced and like they're not deep thinkers. They're the ones who need to be educated.\n\nIf I were you, I'd find a way to bring this to the wider community and let it be known the school looks down upon blue collar workers.", "I think trash collector is not a bad job and they make decent money depending on where you are. She sounds like a bad teacher if she puts professions down.", "Trash collectors are vital, make good money/benefits, consistent hours, where is the insult. Sounds like the teacher is an elitist snob, and elitist snobs shouldn't be teaching kids. You just told the truth. NTA", "If I had to choose between no bankers and no garbage collection, I know what I would pick. \n\nNTA", "NTA\n\nand I am interested in the correlations he found between the three occupations.  The differences are kind of obvious, but to find similarities, well I think that would be brilliant.", "NTA. They were incredibly snobby. The whole point of this exercise is to develop independent thinking and it sounds as though your child nailed it. \n\nTheir attitude makes me wonder how visibly they judge the careers of the parents of the children they teach. Either way, they were out of order. I think your response was perfectly proportionate.", "Former educator here, NTA.  When you listed the careers he interviewed, I thought \"that's perfect!\"  What a great cross-section of society, and comparing careers that are different enough to provide meaty substance for this report.\n\nI have no idea why she would look down on trash collectors; my understanding is that they make a decent salary.  But just because your son interviews a trash collector at the age of 13 doesn't mean he has to be a trash collector.  Or a business consultant, or go into finance.  It's just a school project, yeesh!  However, whatever career he does go into, the skill of seeing the value in all sorts of different people and being able to develop genuine relationships with them will be quite useful; this is a skill that apparently the teacher does not have.\n\nBoth the teacher and the principal are disturbingly in the wrong here.", "NTA. Trash collecting is a very important job, and a lot of these so-called 'menial' jobs are what help to keep our society functioning.\n\nNow, telemarketers I can understand being annoyed at - since, unlike trash collectors, telemarketers are *not* doing a public service. Not that I agree with bashing telemarketers, either - but it's at least a little bit more understandable why people would be annoyed by them. There is no reason whatever for anyone to be annoyed by trash collectors, though.", "NTA\n\nGarbage collectors are one of the major pillars of our society, and should be respected greatly because of how much they do to keep our cities clean.", "NTA. If trash collection is not an acceptable job then I presume the ‘teacher’ herself takes her trash straight to the dumps? Because she wouldn’t want someone unworthy near her home now would she? \n\nIt’s a fact that we will be in deep shit, literally, far sooner if the trash collectors strike than if the teachers do.\nTrash piling up for even a few days is a health hazard. Waiting days, weeks or even years to get education might make it difficult but it won’t kill you.", "Wow, the classism is strong in that school. NTA though you probably went a little too far. But your son sounds great!", "Absolutely NTA. You defended your kid and stood your ground. The fact A TEACHER would even say anything like that to a student is disgusting. I had delt with horrible teachers and due to that I didn’t do well until I moved to a new state and I graduated with honors. I’m sorry your son was embarrassed and I am completely disgusted with the teacher and principal.", "Schedule another meeting, Bring the janitor of the school into the meeting, and let the teacher and principal say it to them", "NTA.  Being an educator and providing education don't always go hand in hand either.", "NTA. Where would we be without trash collectors? All jobs are valuable.", "Education and trash collection don't go hand in hand? Just because someone works in Sanitation doesn't mean they are stupid. People make the mistake of thinking all blue collar workers aren't intelligent and no one with any 'real smarts' would chose a white collar job. Sanitation workers perform a necessary duty for us, they work hard and should be valued. Some even have college degrees.\n\nAnd I believe that they make more money than teachers (at least in NYC).", "My childhood trash collector sent one of his boys to Harvard.  One became a lawyer. One took over his fathers trash business, forgot what the other two boys did? Our trash collector was a hero to so many neighborhood children, best guy. Teacher is in another world, she was wrong.  Glad you called her on it.", "NTA. The school should ask the janitors to not clean or empty any trash in that teacher's classroom. See how long it takes for that teacher to realize how important people who have jobs like trash collectors actually are.", "NTA…I see what our trash collectors do.  I don’t think that teacher would last two hours. Being a trash collector.  All different kinds of weather,  different kinds of trash, constant moving, etc.  also, the assignment was not for three comparable professions, but three different professions.  I think the teacher and the principal are asshats.  The teacher bullied and the principal condoned it", "NTA.\nI have had some\nIncredibly farsighted, politically in depth conversations with blue collar workers.\nDoing a socially important job is important, and doesn’t mean you aren’t intelligent or politically or intellectually engaged.\nTeacher is a snob and a bully.", "Trash collectors make more money than teachers in a lot of states so idk what’s up her ass 🙄", "NTA, being scornful and insulting of blue collar work is arrogant, ignorant, and disgraceful.  This person and principal have no business teaching kids.", "I’m a teacher, and garbage collectors make a comparative income, without the student loans. NTA", "NTA. Your kid’s teacher and principal are spouting some elitist bullshit.\n\nEthically, garbage collectors are clearly superior; they perform a socially necessary and responsible task that leaves the world a better/cleaner place. People in finance create no value (they just make money off of others’ labor), often leave the world a worse place, and are not necessary to a functioning society.\n\nIf they mess up, garbage collectors can’t do much harm beyond a small area. If they mess up, people in finance can destroy an entire society, crater the world economy, and put millions of people out of their homes and into poverty or starvation.\n\nGarbage collectors don’t make as much money as financiers, it’s true, but that may be a feature rather than a bug; they’re unlikely to destroy the world through pure greed.\n\nThese “educators” are pushing the same bullshit that’s bogged so many people down in student debt, only to find out that there are no jobs available in their field, anyway, and the few that exist pay less than average blue collar jobs. I hope they enjoy watching their retirement accounts tank because some dude in finance decided he needed a third yacht; maybe when they go back to work in their 80’s to make ends meet, they can find a job collecting trash.", "NTA. How would she feel if one of her students had a parent who was a trash collector?  That child would feel terrible hearing a teacher say their parents: job wasn't worth doing. This teacher sounds very elitist.", "actually, i think you and your son should research and make a project comparing the career/income level of trash collectors and teachers.", "NTA \nThere are likely students in that class who’s parent is a trash collector and it’s a very important job. While I think it’s fine for teachers to encourage students to seek higher education there should be no shame at all in other very important careers.", "Trash collectors make more than teachers…. Plain and simple", "NTA.\n\nAs an educator myself with a father who’s collected trash all my life all I can say is he EASILY makes double my income. Thanks to my TRASH COLLECTOR father I graduated debt free. If she thinks trash collecting wont take him anywhere she’s mistaken; they are some of the hardest workers who are always looked down upon.", "NTA\n\nTheir attitudes are absolutely hateful. They are snobs of the worst kind.\n\nWhich jobs were most important during Covid, for example? - \n\nThe lowest paid health and social carers and cleaners and yes people that deal with trash.", "NTA- fun fact! In many parts of the US, garbage collectors are paid better than teachers. I wonder if this teacher knows that…", "NTA, and I guarantee that the trash collector makes twice what the teacher does. 🤨", "I just commented this; I’m a teacher and my dad is a trash collector. He easily makes double what I make, works 5 days a week, has way better insurance, 6 weeks of paid sick leave/vacation time, and when he gets home he doesn’t bring home work with him. I wish someone would try to look down on him around me.", "I was thinking the same thing", "And a gov pension.  Not too shabby tbh.", "Anyone who’s lived somewhere that’s had a garbage strike realized pretty damn quick how important trash collectors are. \n\nThings start to smell, you end up with bugs and rodents, people start getting sick because it’s not healthy to have all kinds of trash around. \n\nImagine how that may have felt for any of her students who have parents or relatives who are trash collectors. \n\nThat teacher is trash. NTA", "Um depending where you live and who the garbage service is, some actually make the same if not just as much as teachers. Now that may not be everywhere, but I know a guy who has been working for a company for years and he affords a decent life. He had no college, so no debt from school, so he may have started out better than some!", "NTA. This same thing happened to me when my youngest son was in 1st grade. \n\nWe had a parent/teacher conference and it was 45 minutes of her just complaining about how hard her job is and how much the school sucked. She kept repeating how she couldn't handle that many young kids at once. She never once talked to me about my son specifically.  \n\nAt the end of it, I told her she made a mistake with her career choice and this should be her last year of teaching. \n\nNot everyone is cut out for everything.", "Yeah from the title I was ready to say YTA, but educators should not be disparaging professions in the classroom in the first place.  I mean what if someone in the class has a family member that is a trash collector … 😔", "How would this teacher feel if trash collectors stopped existing for her? Is she going to drive her own trash to the landfill/dump? Doubt it.", "Not to mention that garbage collectors in better-paid areas make more than teachers in many places.", "Not just that, but trash collectors’ strikes show exactly what happens when our trash is not taken away. Blue collar jobs enable white collar workers do their jobs as well - if trash is not taken away, our society starts to riot pretty quickly; if we don’t have food stockists or truck drivers for food, we will starve pretty quickly; when our plumbing fails, people are ready to pay thousands for a plumber only to get running water and sewer to work.", "I can't imagine how rudely she must treat the school custodians.", "This! ^^ And, as a former middle school librarian, I can say with absolute certainty that the idea that “trash collection and education don’t go together” is one of the most egregiously insulting attitudes a so-called educator can take. Not every student will go to college. But “even” students who become trash collectors will have benefited from their education. And their work might make it possible for their own children to go to college - not to mention the general social benefit their work creates. It’s absolutely appalling that a teacher would make such comments in front of other students - basically telling any student who has blue-collar parents that they should be embarrassed by their parents’ hard work. Appalling and demeaning!! \n\nNTA by ANY standards, but particularly because anyone who thinks a blue collar worker is any less valuable a member of society than a white collar worker - or that a blue collar job is only for the “uneducated” - or that a blue collar career isn’t worth pursuing - absolutely shouldn’t be a teacher and should seriously reevaluate their own life choices.", "I def grew up in an environment that shoveled the \"go to college, do you wanna work at McDonalds\" bs on strong. As an adult I have come to realize that all those frowned-upon jobs are both important to society and far more useful to me than a lot of these college degree jobs, and necessary for society because not everyone is made to go to college or get a PhD. And there is nothing wrong with that.\n\nIf she can't understand that not everyone is made to slog through higher education and it's wrong to disparage those who will succeed best at 'manual labor' then 100%, she needs to gtfo of teaching and stop trying to brainwash kids into flinging themselves into student debt.", "And what if one of those kids has a parent who is a trash collector? Imagine how he or she would feel hearing the teacher being so condescending about the profession.", "My uncle was a trash collector and it was a great job. He made a really good salary, had amazing benefits, and retired with a great pension. Because of that job he was able to give his family a very comfortable life. More people should consider it as a viable career and stop looking down on it.\n\nNTA, but the teacher certainly is for limiting how her students view potential careers that can provide stability in their lives.", "UPS drivers make twice what teachers make where I live.  A lot of people don’t realize that, and miss a career path that doesn’t require student loans, has great benefits, and decent flexibility (except the 6 weeks before Christmas).  And you aren’t tied to a desk.\n\nThis teacher missed an invaluable opportunity to expose her students to a wider variety of opportunities out there.", "I also wish I would’ve known about trade jobs. I mean I’m happy where I ended up and I wouldn’t trade some of the experiences I had in college for anything. But the style of teaching college has just never really worked for me and I’m more of a hands on learner than anything, so going into a profession with that would’ve been super helpful.", "I wonder what the school board would think of their comments.  You should find out.", "Nah, drug dealers don't have to go to college. Unless they're working for a big pharmaceutical company.", "And the current NYC Sanitation Comissioner, a woman, has an MBA and a JD and has worked in IT.", "\"When you do things right, people won't be sure you've done anything at all.\"", "That is super short sighted too! Trash collection is a profitable and large necessary service. There are probably some really good jobs in supply chain and Logistics related to waste management.", "Don't forget how the garbage collectors crashed the world economy in 2008...oh, wait, no, that was the banksters.", "I think college is great, but I also think that the heavy focus on getting every kid to go to college and pursue a \"prestigious\" job does a lot of students a disservice. Not everyone is suited for college or white collar work and learning about these other options is great for them. In some places, trash collectors get good salary and benefits.", "I’m a middle school librarian myself! Totally agree with what you wrote. When I taught HS English, we did a big careers unit and explored all kinds of different jobs. I never cared what they picked because why would I? I’ve had kids with all kinds of dreams and aspirations including things that others might look down on. However, all of those jobs are extremely necessary if someone doesn’t want to do them!", "Teacher here and totally agree. In fact, trash collectors are employed by the local government in most cases. It can pay quite well and provides good benefits. “Blue collar” jobs can still provide a profitable and happy life. Not to mention, of those three jobs, who would the teacher and principal be most upset about going on strike?\nOP is NTA and awesome.", "Oh, no, all the business consultants are on strike? Who are we going to throw money at so they can tell management things that the workers already know?", "Never forget the importance of telephone sanitisers!", "That’s a very good Bender episode", "It isn’t just chucking it in a landfill, it’s the practical ways to practice sustainability and recycling. Things like plastic milk bottles becoming playground equipment for example.", "Exactly this. Sanitation workers are so so so important to health and safety!", "NTA and were they not paying attention during Covid? You know who didn't get to stay home because their jobs were essential? Freaking trash collectors.\n\nAnd yeah, I doubt anyone really *wants* to be picking up other people's trash, but it is one of the most important jobs there is. What snobs.", "NTA. The teacher is classist and that is not the sort of attitude that someone working with children should have. There are going to be children who have that teacher whose parents work in sanitation come and they shouldn't be shamed for that. No one should be shamed for what they do, and sanitation is a solid union job.", "NTA. Trash collectors are often good union positions and they make more than lots of people I know with degrees. They're also absolutely crucial to a functioning society.", "NTA. She was being ignorant and classist, besides which she wasn't to know if any of her other students have parents who work in trash collection. She could've easily inadvertently shamed any number of her students.", "NTA. I’d be meeting with the school district to file a complaint against the principal and the teacher. That’s complete BS. For the record trash collectors can make very good salaries and deserve as much respect, if not more, as anyone else because they work their asses off.", "NTA. She was way outta line here. Someone has to collect the trash.", "NTA.  The teacher and the principal are classist.  I would have gone after them both stating how disgusting their attitudes are and how do they think students with parents working such jobs felt hearing that and that garbage collectors probably make more, have better retirement, better healthcare and better vacation than a teacher.", "NTA and fyi my buddy is a trash collector and makes a lot more money than me and im a carpenter", "NTA They sound like elitist snobs 🙄", "NTA\n\nAnd screw this teacher for shaming a profession that is both vital to society and actually very well-paying! She can get off her high horse.", "One of the people who works where I do has a masters degree in art. He is extremely talented not just in creating art, but also in music. But he is the school janitor. He finds peace in caring for the environment where children learn and where his wife teaches. \n\nBut even if he didn't have degrees, his work would still be important, and his kindness and support for the students would be integral. The idea that somehow Blue collar jobs are \"less\" is repulsive. And I agree, that teachers who push this notion should not be teachers. Not everyone is cut out for college. That neither makes them stupid or expendable.", "Absolutely NTA. I don’t blame you for being pissed. Honestly, I would go higher up the ladder  like going to the superintendent and saying the teacher doesn’t create a safe environment for students.", "NTA and bless you for standing up for your son and for very important service workers who are JUST as important", "NTA. \n\nThat teacher is dense and a judgmental snob. Trash collectors are typically part of a union, well payed and with good benefits. This depends on the area of course, but still. There is nothing wrong with that job. Someone has to do it!! It’s honest and hard work. Not like he went up there talking about having an only fans. \n\nNot shitting on only fans. It’s just an obvious poor choice for a 13 yr olds project.", " garbage collectors are worth far more than financial advisors. They literally keep us from drowning in garbage.", "NTA and as a teacher I came ready to defend the teacher but what she and the principal did is way out of line. And to top it off garbage man may not be a fancy career but it pays well or so I thought", "NTA - as a 20 year veteran educator in the trades area I despise colleagues like this. It makes my job harder and contributes to the growing shortages of skilled trades workers.", "The teacher was inappropriate.   Now. I live in the country. We don't have public refuse.  We pay for it out of pocket... meaning it's not included in our property taxes.\n\nThe gentleman that does trash pickup has his own company.  He does all the refuse pick up for all the neighboring farms/ areas outside of the city. \n\nWe pay $7 a kitchen garbage bag and $10 a large trash bag. Bulk items start at $20.  The man runs a multimillion dollar company.  Your kids' teacher may want to rethink her stance on garbage men.", "The teacher was the AH", "NTA. waste removal may not be glamorous or pretty, but it is an essential service.   Without it we would all be neck deep in our own trash. Folks who provide this service deserve as much respect and consideration as any other profession. More then some :)", "Nta. It's a profession nonetheless. If there were no waste management system, our society would have a severe negative impact. Just because the role is not glamorous doesn't mean it's not essential.", "NTA And I would go to the district level or school board. I would also go to the janitors union.  This shit is not ok OP.", "That teacher should google images of the 1968 or 1981 New York City trash collectors strikes And she’d rethink that it’s not an appropriate profession.", "NTA. Imo, teachers are there to help shape our future: our children. What they say and do will have a huge impact on their success in life. I agree with you and your statement that she should reconsider her career. Maybe she needs to be educated that tearing others down takes more energy than building them up. Her personal opinions aside, if she wanted the career choices to be more closely related, she should have specified that in the assignment. Ambiguity favors the students, in this case.", "ESH.  The teacher and the principal for their remarks stating education and trash collection not going hand in hand.  I get encouraging higher education, but not everyone is cut out for college, and we need people in the trades.  The teacher's remark might have been really hurtful to someone in the class if their parents are in blue collar occupations.\n\nOP you suck because you could have just emailed the teacher and explained that you found the remark inappropriate.  She probably would have been very apologetic.  Instead, you had to escalate it to a face-to-face meeting with the principal and then say a totally AH comment telling her to reconsider her role as an educator.   We are short teachers and substitutes as it is.  We don't need competent teachers leaving over ill-advised comments.", "NTA. As a teacher, I think she was completely out of line. Honestly the salary is pretty similar to a teacher’s salary, but even if that wasn’t the case she should not be commenting on his choice of careers. The assignment was to compare and contrast careers, the assignment said nothing about what type of careers to focus on.", "As an educator, I am constantly telling my high school students that college isn't for everyone, and that's okay. Finish high school at least because 99.99% of jobs need that diploma or GED, so just suffer for the 4 years of high school and go into a trade school or straight into a job (several juniors this year already told me they plan on working immediately upon graduation,l). \nTrash collector is a good-paying job; that teacher can go bite the dust. She lives in a fantasy world with most people who think college is the be-all, end-all of life.", "NTA. I do appreciate educators (my partner is one), but I also know (through secondhand accounts via partner) that a lot of educators are crap and probably shouldn't be in their profession. \n\nConsidering the fact that a lot of teachers come from at least a middle class or upwards upbringing, you get some real ignorance mixed in there. Not saying this applies to everyone everywhere. My own partner is first generation college grad, grew up in the projects person. But that's also why I trust his judgment when he is very frustrated with the 21-year-old recent grad who came from white privledge/money and yells at students about walking in late when their parents were the ones who dropped them off 30 minutes after first bell.", "Pretty gross that in 2022 a teacher would belittle an important job like garbage collection.", "NTA and the trash collector probably makes double her salary with zero of the debts and years spent at college.", "I would let her know that garbage collectors get paid more than middle school teachers. And ask if that’s why she’s so bitter.", "Uh, waste disposal personnel make a really good wage most of the places I've lived. Like, really good.", "Whatever biggie said", "Wow, that's really telling by the teacher. It seems like a juxtaposition in that she's emphasizing financial benefit, which surely is not what teachers are enjoying these days.  It's a shame, because if the system is run on that mindset there will be more failures and no direction into trades or alternatives. Or arts or music professions.\n\nMy neighbor who is my age worked in our City Sanitation department. He's been retired for several years, great health insurance, pension. I'm a college graduate with a white collar job and still working and plugging away - and will be for a while, and will not have a pension or healthcare that I don't pay for. \n\nNTA - all jobs are valuable and that's what she should be instilling in her students", "NTA. They sound too ignorant to be teaching anyone's kids.", "NTA\n\nWe need trash collectors, if your child is passionate about collecting trash so be it! Teachers should be fostering children's hopes and dreams no matter what they are. The principle should have backed you up entirely and put the teacher in her place", " NTA. remind her that if she doesn’t think sanitation is a worthy job what would she do if her trash was sitting in front of her house for a week. like employees in sanitation are the some of the most necessary individuals out there.", "NTA\n\nYou’re right.\n\n1) trash collection is an essential service and a valuable role\n\n2) who knows if any of the kids in the class have a loved one in a similar job that felt bad at that comment\n\n3) your son followed the assignment correctly, so her comment was dumb and rude", "Lmao!! In some countries you LITERALLY need a degree to collect trash. This is because collecting trash is about a lot more than the actual collection of said trash.", "NTA a teacher told a friend of my sister’s that he would only ever amount to being a garbage man. Another boy in her class piped up that his Dad was a garbage man and actually earned a good wage, plenty of paid holidays and new shoes every few weeks.", "NTA. The assignment wasn't contrast and compare careers that go hand in hand. Teacher was unnecessarily rude about trash collecting and humiliated your son in front of his classmates over it. Every job deserves respect. Maybe she should tell this story to the school janitor. I'm sure she values the job they do.", "NTA and that teacher should be ashamed of herself.", "NTA.   \nThis is like the teachers threatening the kids that if they fail the class, the only job they could get would be becoming \"garbage collectors\". Let's not forget that the job of \"garbage collector\" is one that is highly needed in our society. If we were not to have that job filled by hardworking men and women, there would be much more disease than there is.  \nEducators should focus on making sure that students have a secure foundation that they can build on when they become adults, no matter what job or path they choose, not pass judgement on the jobs or paths that students are looking at unless their opinion was asked.", "op=NTA\n\nBecause your son's teacher deliberately humiliated him in class.  It's one thing to make constructive criticism privately BUT NOT so that the kid has to be shamed by his teacher and fellow students.", "NTA I think it's really interesting that your son chose those 3 jobs and found a way to compare and connect them.  The teacher sounds like a snob, and deserved what you said.", "Trash collectors require the same license as a semi-truck which is not an easy test. They are also usually state jobs and hard to get, since a lot of drivers considered it a great income. Nta", "I had a mean teacher in sixth grade who insulted a kid who did poorly on a test and said something to the effect of \"you're going to wind up working at grocery store chain\". One of my classmates father worked in the grocery store as a butcher... I couldn't believe how nasty that teacher was.  NTA.", "NTA. Ex-teacher here and married to a current resource teacher. She is constantly battling a few of her colleagues on behalf of her students who are almost all going to into the workforce after school. Garbage collectors make good money and have nice union benefits. Let that teacher have a waste management strike for a month and see how she deals without collectors.", "NTA. She should reconsider her job as an educator. But we all know that educators are extremely well protected in their jobs and the bad seeds rarely are exposed and fired, until and unless they pull a Mary Kay Letourno.", "The teacher should know better than to make such jokes. So I'll give you the NTA.", "NTA and thank you for standing up for all the kids out there who are looked down upon and told they won't amount to anything because they aren't academically gifted. I had a teacher like this- I called him out on it - my mom backed me - he quit teaching at the end of the year.", "NTA. I’m graduating my bachelor of education this year (btw I can’t believe it is 2023) and I’m absolutely appalled by what this teacher did", "NTA and I’d take this whole thing to the school board", "NTA — In our town, one ‘trash collector’ started small but kept adding routes and trucks and is now the dominant waste hauler in our city. He just built himself a huge 4+bedroom, 3 car garage custom home in the newest part of town.  Garbage is $$$.", "NTA I was prepared to call you a helicopter parent but the teacher is out of line looking down on occupations.  Did the teacher specify what occupations to interview with a perimiter in her rubric?  Granted rubric are for college but still.  Good on you for letting your son explore.  The garbage collector probably felt appreciated.  I'm in college and hate this stuck up Academia bs mind set they get into.  Also she is only in the mindset of college degrees being worthy.  Ever hear of trade schools and certificate occupations which actually usually pay more than a bachelor dependent on what it is.  She's also probably paying off a crap tone of debt to get her educational credentials.", "NTA not only is a garbage collector a necessary role to fill, but what if one of the other students in the class had a parent that had that job? She'd literally be telling them their parents job isn't an important one. Every job is important for society, that's literally why there's a demand for them", "NTA\n\nIn fact, comments like yours are what push the boundaries of complacency. Narrow mindedness is a dangerous and infectious disease. Thank you for doing your part to prevent its spread.", "NTA. Trash collector Sanitation worker. Teacher needs to check her income against Thier's. She'd be surprised how much some of them make.", "NTA- Although it does sound like the career he's actually considering is 'mafia boss' LMAO", "NTA. Coming from a blue collar worker, that bleepidty bleep needs to realize that without people getting dirty, her perfect life would be a LOT more…rustic. Someone send this to Mike Rowe. Let him put it words far more elegant than I can.", "NTA. You should have asked how does she think a child whose parent was a trash collector would think about her statements.  The principal and the teacher are not fit for their positions.  It seems like you may be in an area where high earners live . That's more than likely the reason for their attitude.  They should know that reality can hit and put them both in a position where they may have to take job that they previously looked down on.", "NTA \n\nAs a PreK teacher we would talk about careers and we always mentioned garbage collectors. Most kiddos thought it was yucky and not important. We would then get in a discussion about why and what would happen to all the trash and recycling? I’d ask things like where would all the trash go? Who would keep our cities and buildings clean? Do you want trash everywhere outside? Do you want to have trash pile up in your house? They came around to see how important this job was and for the most part they would understand it can be a yucky job but we should be grateful for those who choose it.", "NTA. I'd tell both that principle and teacher \"ok. Cancel your garbage collections from the city and bring them to the town dump yourself. If you see those jobs as beneath you, don't subscribe to such amenities.\"", "“The principal said she understood but \"education and trash collection do not exactly go hand in hand\". ” Not only are you NTA for what you said, but you should actually go above the principal’s head and talk to someone about *their* behavior, because this was inappropriate too. It seems like the problem at that school goes beyond just the teacher.", "Same sanitation is a highly coveted job in my area, anyone would be dumb to pass up the opportunity", "Exactly! What if one of the kids in the room had a parent who was a trash collector? It was a seriously insensitive and inappropriate thing to say.", "No shit!! OP’s kid did the assignment well within the parameters and outside the box with the different people he chose. Each one of those people your son interviewed was gracious enough (and let’s be honest, touched) that he chose them for his assignment. \n\nOP, you were right to defend your son and his teacher sounds like a has-been mean girl. Keep an eye out if she targets your son by giving him bad grades or absurd office referrals. I don’t think you’re done dealing with this teacher.", "Education in America needs to come off the idea that everyone is going to college. Some people are not capable of college, some can't afford it, some are not interested. Schools need to start offering trades as part of the regular education process, as well as, other educational options for those not college bound.\n\nMany in the education system treat students that are not college bound as unimportant.", "Recently I learned that plumbers need about 5 years of training to be considered competent and I know that it can take years for a electrician to become a master electrician. Not every career requires college, but can still require extensive education.", "She probably couldn't get a full time tenure even if she tried at college.", "If that is supposed to be a massive diss, it’s not. \n\nPerhaps people choose to teach middle school not because they are too stupid or pathetic to teach college, but because they care about impacting kids’ lives during the toughest, roughest years of their development. Just a thought. And yes, I teach middle school after teaching at higher levels and realizing that middle school years are ROUGH and those kiddos need teacher who care about them and about their education. \n\nIf you are trying to put the teacher down, mentioning that trash collectors often make more than teachers ought to suffice, and you aren’t shitting on anyone with that.", "High school social studies teacher here. One of my top priorities is to refrain from passing judgment on things that don't matter. My students get judged enough already. I don't ever want to treat a student differently based on what color their hair is, or what they wear, or what language they speak at home, or what their family situation is like, or anything else. I want to model for them the idea that, no matter where we all come from, we can come together and work on something together without hostility or suspicion.\n\nIf a student does the assignment--if they honestly satisfy all the requirements, regardless of whatever idiosyncratic way in which they do it--then *they get full credit*. Period. End of story. For the life of me I can't understand why this teacher would want to complicate that.", "I would assume that if it had been untrue, the teacher would have denied the story instead of sticking to the same argument that the son said she had", "I had a friend who was a garbage man. He made a lot of money, worked six hour days, and audited university classes in his spare time - but only classes that he was interested in, not all the boring ones that they insist you take in order to get a degree. He learned how to invest his money, and retired a multi-millionaire. He now winters in Costa Rica. \n\nHe did very well for himself.", "My husband began his career in Trash Collection and is now the Head of the Safety, Health and Environmental department of an important company in 5 years! Don't knock it!!!!\n\n\nEdit to add he had a master's in a relative field I don't want to be too specific", "Ngl I’m an attorney and have a friend whose brother is a union protected trash man (he likes using this title - I got him business cards printed with it and she designed him a custom logo for them for his bday one year and he loved them so much he turned it into a cake and does this every year - great dude so fun and creative!) . He makes almost double my salary and works less hours now . If I ever have a kid I would love for him to turn out like him and prefer that to them becoming like a corporate litigator or shilling for Exxon or some messed up shit.  This teacher is such an elitist snob", "This so much. I worked in the waste industry and a company had to ground their entire fleet of vehicles, this means they couldn't service their clients including government contracts, the whole industry was a mess because of it. \n\n\nThe company that I worked for at the time stepped up and we serviced their clients. The amount of rubbish that piles up after a week is insane, the trucks were pretty much running 24/7 to catch up, there was crazy amounts of paperwork, overtime in the office from the finance department, mechanics, drivers and business staff was insane.\n\n\nOne more bug bear but waste driver's/collectors actually get paid pretty well in my country, with one driver I know bringing in 100k per year.", "Yes, just like how during the pandemic everyone found out just how essential some jobs were..", "Our city had a terrible problem with trash during the worst of the pandemic because Covid was running rampant throughout the public works department. They had to adjust collection schedules and totally dropped recycling pickup due to a shortage of employees. DPW is a necessary cog in the city’s health.", "It’s actually an excellent reason to use the three different professions, white collar, blue collar and self employed consultant which spans different risk, education and likely income levels so finding commonality would be interesting.  Honestly trash collectors may often not have much education but make a good wage and usually when working for a municipality still receive a pension which is almost unheard of in private sector jobs anymore so it’s a good option for many people who seek stability and security across time.  Well done to OP’s son", "I feel bad for any classmates whose parents happen to be trash collectors....\n\nETA: Because of what the teacher said, not because of their parents profession, to be clear!", "How do you end up living in a society where no one wants to do the \"crap\" jobs? You label them crap jobs and look down on them. Being a fast food worker, garbage collector, retail worker, etc - they're all valuable jobs and honestly add more to society and daily lives for most people than many office jobs do. \n\nA narrow view, indeed. If someone doesn't deem it a good enough job to do, we'd have trash everywhere and that would really change the daily life for people (for the worse).", "Or other blue collar jobs that aren’t glamorous but still vital to keeping things clean and safe. As others have pointed out there must be students who have parents or other family members doing these jobs.", "It's called \"illustrating absurdity by being absurd\". \n\nIf she wants to denigrate trash collectors, she should be comfortable with someone denigrating teachers.\n\nThe obvious point is that the kid completed the assignment and no one should be denigrating anyone, but that flew over your head, I guess.", "Teachers have periods of the year they aren’t teaching and work within a specific building. Rubbish collectors work everyday, or at least once a week in rain or snow or shine over a large area.", "Not only that, but those kinds of jobs will always exist.  There will always be a need for blue-collar jobs.  It doesn't matter if everyone goes off to get a college or university degree, there's still going to be a need for those kinds of positions to be filled and all that means is that we're going to have very educated blue-collar workers.  The attitudes so many people have about higher education and work are highly delusional.  Certain niches absolutely have to be filled.", "New York City, 1968, there was a [strike from sanitation workers that led to 100,000 tons of trash piling up in the streets within 9 days.](https://untappedcities.com/2015/02/11/today-in-nyc-history-the-great-garbage-strike-of-1968/)\n\n100%, don't disrespect the people who makes your world function.", "I work a pretty.... not menial, but low-level medical job. I went to college but most of the people I work with didn't. Those people are making the same amount of money I am, without the college loans. \n\nSo who came out ahead? Makes me feel stupid but good for them.", "I used to put a small cooler of cold water bottles out for them when the weather was hot, but the company that collects our trash went to automated trucks several years ago (now they don't have to pay as many employees but got a new contract with a huge increase so our property taxes went up). Since the driver never gets out of the truck, there's no sense in my putting water bottles out any more.", "Yeah, no, I don’t think that’s what this is, and it definitely did not fly over my head. Not that I doubt that the commenter was thinking, “Gee, let me illustrate the absurdity of her ignorance by being absurd in pointing out that her life’s work is crap. . . “ (no, wait, I seriously doubt this was their thinking in commenting). In fact, it very much came across as a personal insult to her as well as her chosen profession. \n\nThe obvious point is that the kid didn’t just complete the assignment, but that he did a solid comparative analysis of three separate fields, and he seemed to have enjoyed the process of interviewing and researching as he put his project together. And absolutely, no one should be denigrating anyone, which for sure flew over your head if you got heated with my taking offense over the comment that “no wonder that she ended up teaching middle school and not college” as an insult to put the teacher in her place.", "Yes. But I am paid for 10 months a year, not 12, and I work through an active shooter being reported at my school site and it’s my job to get the lights off, doors locked, all technology shut down, 36 teens under desks in the dark corner and silenced while comforting crying kids. But yes, rain sound terrible.", "Yeah, it's ridiculous. I figure the issue is that schools these days are expected to be the great equalizer, responsible for giving kids the skills necessary to not just pull themselves out of poverty, but to get into prestigious, high-paying jobs. Parents want their kids to strive high and a school would probably get a lot of complaints if teachers were encouraging students to take on the wonderful vocation of trash collecting.\n\nI used to substitute teach at this one high school that had these legitimately good vocational programs. The programs were a bit selective but students from all over the district could apply. The kids would graduate with REAL credentials and skills. Some of the programs were more academic in nature but there were also some more blue collar/working class ones. And it was a Title I school so that meant a lot of low income kids were benefiting from it.\n\nUnfortunately, that school was the exception. Most vocational type classes I subbed for were clearly just dumping grounds for apathetic students who were academically low and couldn't even be bothered to pick their own electives. Any student who took those classes with the hopes of getting real job skills and knowledge was screwed over.", "Strike happened where I live, no bin collections for 6 weeks. Even the local dumps were jam-packed enough that people were paying others to take it to the bigger one. Men made bank. \n\nThe bin men are now on £17.50 an hour, finish early and have pensions surpassing a lot of other people.", "I know what you referenced there. . .", "I don’t know. All if the people I’ve known in the trash business make at least $100k a year. I’ll look into a breakdown later.", "And get paid pretty decently most places", "He should ask this teacher how long she goes without having her trash collected. Unless she’s making weekly trips to the dump she needs to keep her asinine opinions to herself.", "I worked for the council. Bin men got paid well and the young men doing it never needed to go to the gym or use a sun bed so literally every week HR got calls asking if there was a job on the bins. ETA typo", "Some teachers are so full of themselves. Not everyone can--or wants to be!--a banker, lawyer or doctor. \n\nMy nephew is 18 and a senior in high school and very bright, he is looking to go to trade school and be a welder which is making some of his teachers upset. He just nicely tells them that in a couple years he'll be making quite a bit more than they do.", "Seriously...Teachers and everyone else pushing college on every student is part of why the US is currently having a student loan debt crisis.", "Yes, I was looking at joining the military right out of high school but every teacher I had weighed in their opinion and essentially made me feel stupid for wanting to go that path before going to college. It was two years into college when I was burnt out that I decided to go into the military. Now, I have no student loans and 2 bachelor's degrees, with considering going back and doing some additional coursework.", "Garbage collectors make bank where I live, whereas your average banker doesn't...just sayin'. NTA", "True story, I was the dump truck.", "NTA, and I’d go to the school board at that point.", "NTA. And ignoring the inappropriate comments about trash collectors which has been covered already, there is also the fact the teacher changed the project parameters AFTER THE FACT. If the teacher felt certain jobs or types of jobs (such as blue collar) should not be used in the project, that information should've been provided at the beginning.  Changing the requirements after is poor teaching.", "Trash collectors are incredibly important in today's society. They're underappreciated, and without them there would definitely be chaos and mayhem while people try to firgure out to to properly and safely dispose of trash.", "> I know it's not my place to tell an educator to reconsider her role.\n\nNo, the teacher and principal were way out of line, arrogant and elitist.\n\nYou're NTA OP.", "NTA. I am an educator, in case my username didn’t make it obvious. Remember literally two years ago when sanitation workers and retail workers and healthcare workers were all lumped under one label…what was it….oh, yeah, ESSENTIAL WORKERS!\n\nWhen everyone else was staying home and complaining about Zoom meetings and joking about wearing business suit tops with pajama bottoms, essential workers were making sure public spaces were safe and healthy so that society didn’t fall apart. Society has literally always needed someone to ensure the cleanliness of public spaces to promote health, and sanitation is a damn important job. Not to mention, it has great hours, great benefits, pretty good pay, and you get to be outside driving a truck that smooshes garbage. It’s a cool job. \n\nNo one in education should be belittling any profession. We’re part of our communities, and every job deserves respect. Plus, when you belittle a job as an educator, you’re bullying a student or their family. It’s ridiculous.", "NTA. What if one of the other students’ parents were garbage collectors and just watched their teacher say that shit? You’re right. She should rethink her job. She’d probably earn more as a trash collector.", "The trash collectors probably make more money than she does anyway! NTA in NJ and NYC garbage collectors get paid very well, great benefits, hours, and will always have a job!", "NTA. \n\nTruth: plenty of kids in that classroom will not go on to college. Even more won’t get a 4 yr degree. Many garbage collectors actually make decent $ and benefits.  \n\nIt was narrow minded. Not all careers are white collar.  And IMO, throwing in a working class career with two white collar careers is an even better compare and contrast than three white collar careers.", "NTA.\n\nThe teacher is a jerk. I thought we as a society had gotten past the idea that people who do physical labor do it because they're not smart enough for anything else. Ugh!!\n\nGood for you for defending your kid. Some people really shouldn't be in charge of shaping young minds.", "NTA. Not only is this teacher demeaning, short-sighted and judgemental, she is also not very bright. A big part of deciding what you want to do with your life is also deciding what you DONT want to do with your life. Comparing and contrasting blue to white color, manual labor to intellectual labor, amount of education needed is important when thinking about next steps.", "NTA\n\nAll three are professions, he followed the assignment, it sounds like he did a good job.  What if a parent of one of the students was a sanitation worker?  \n\nThe teacher was an ah here.  All professions have bad apples, and it seems you found one.", "NTA. What if one of thebkids' parents was a trash man? There's so many reasons this was entirely inappropriate", "NTA. She is narrow-minded and encouraging her students to be judgmental.", "NTA-\nAs a teacher myself, I find this horrifying. \nNot only is she shaming a profession... she's publicly shaming and embarrassing a child. \nAs teachers we have duties if care for a child's physical and mental health. Publicly shaming then literally goes against that duty.\n\nIf she had asked why he chose those three professions because she was unclear as to how they linked, that'd be understandable.\n\nAsking him if he wanted to be a garbage collector when he grows up is also valid, but not how she asked.\n\nShe shouldn't be a teacher at all, I'm sure she does it to more students. At least one in every class.\n\nAbsolutely disgusting.", "NTA", "NTA - I wonder if she even bothered to think about whether a parent of one of her students might actually be a trash collector before demeaning the job in front of everyone.  You were absolutely in the right, and I’m shocked the principal agreed with the teacher.", "NTA\n\nActually, in some places, becoming a trash collector is a competitive job and pays quite well.  You were angry, and as an educator, I somewhat agree with you.  Where I feel the teacher went way off course was calling out your child in front of peers.  That's ALWAYS a no-no!", "Whenever I see the bin guys roll by in my neighborhood I thank them in my head. It’s a dirty and sometimes dangerous job, but also so so important. I wonder if the teacher or the principal ever saw the pictures from the Edinburgh bin men strike, it was absolutely trash chaos because that’s what’s happen when they decide not to collect due to unfair wages or whatnot. NTA, OP.", "NTA garbage collectors seem like the lowest of the low, but most are unionized, they get paid well, and society grinds to a halt when they don't do their job. The same cannot be said for the other two professions he interviewed.", "NTA!!!!!!!\n\ni currently work as an educater and it doesnt matter if a student wants to be an astronaut, doctor, custodian, president, tradh collector ect...trash collectors are county employees and make really decent money, have great benefits, and room for advancement. That being said they dont have to like what information was presented, but theu damn well should respect the fact that your child worked hard and be proud was able to complete the assignment with 3 very different career paths. \n\nShame on the educator and admin in that school for not understanding how important it is for a kiddo to feel like their classroom is a safe space for them to present their hard work.", "NTA inform the janitorial staff at the school of her remarks. Some don't realize how well a trash collector can do with benefits and pension etc.", "NTA a garbage collector provides much more to society than her ass backwards elitist point of view will.", "NTA - the teacher did far worse: she taught the rest of the class that there is still shame in having “menial” jobs! i can’t totally express it well because english isn’t my first language.. but it does boil my blood thinking that the whole class laughed at that and it was okay", "You did right by telling them that. It is frustrating when people look down on professions that are the literal reason they can get through life comfortably.\nWould they like to take their own trash to the landfill themselves, climb up to the power lines themselves, or fix their own plumbing when it isn't working? I think not.", "What the fuck? NTA and go to the school board about what the principal said.", "NTA. Remind this teacher that my trash collector probably makes more than a teacher. It’s a sad fact! There is NO SHAME in hard work and honest money. PERIOD.", "NTA. Garbage collectors work 8 hours a day just like everyone else. It's an honest living that, in my state at least, pays more than teaching.", "lol tell her she’s right. There’s way more to compare if he would have interviewed a trash collector and an educator as in America they are both blue collar jobs 🤓\n\nNTA.", "NTA, she's just upset because trahd collectors probably make than her. Have a stronger union, and fantastic benefits. And anyone who says that isn't a real job, ask a new Yorker what happens when sanitation goes on strike.", "NTA, and this is speaking as a future educator. That teacher (and it shames me to refer to her as such) incited bullying by creating an environment for your son's class to laugh at him. You're right. There shouldn't be a place for teachers like that in schools.\n\nAlso, at least in Australia, from my understanding, garbage collectors are paid very good money. In addition, there'll always be job security because there will always be a need for garbage collectors. (This can be said for quite a few trades too, but I'm mentioning garbage collection specifically because it's what's relevant to the post.)", "Trash collectors make more money than a teacher. They also have really good benefits and retirement. She is just one of those that thinks a college  education is the only way to go and if you don't have one you are less. Nta", "NTA. Wow. That teacher was out of line.", "NTA. Um, wow. Sanitation workers and education do not go hand in hand? Education is for everyone, regardless of how someone eventually earns a living. The teacher’s and principal’s behavior was classist and judgmental and isn’t something children should be exposed to. I suggest you bring this to the superintendent. You should also ask if they are treating the school custodial staff with this same disrespect. \n\nAs a side note, I really thought your post was going in a different direction when you described your son as having a problem with authority. This detail doesn’t have anything to do with your story, so I’ve got to think you have had to explain this to excuse away poor behavior in the past. ‘Having a problem with authority’ is a parent’s way of saying their kid is sometimes disrespectful. Your child shouldn’t have a problem with appropriate authority roles. That’s something you need to educate your son about.", "NTA. \n\nHe followed the assignment and compared Professions!\n\nNo one said they had to be similar professions!\n\nTeacher is super rude and putting down service workers that keep the actual country running!", "NTA\n\nI would be absolutely appalled if one of my kids teachers was a snotty, elitist b%%$h. \n\nShe definitely does not need to be in education.", "NTA. Guarantee the trash collector makes more than she does as a middle school teacher. And teaching is essentially blue collar. Should've said well he was going to interview a middle school teacher but I didn't feel like that was comparable to finance or consulting either.", "NTA This teacher is a snob. You might want to let her know, that there is a good chance the trash collector your son interviewed is getting paid more than she is.\nSource: an uncle who is a trash collector and an uncle who is a teacher in the same city.", "NTA. You know who makes more than teachers? Trash collectors.", "NTA. That was a crummy classist remark. I'm a teacher myself and I think it's awesome that your son interviewed your garbage collector. I bet it made the garbage collector's day, too. \n\nWe *need* unglamorous blue collar workers, and they work their asses off doing useful things.", "NTA.  The teacher and school are out of step with the world.  That is elitist thinking and demeaning to people who do the \"dirty\" jobs that we all rely on.", "NTA! I am an educator and I think the whole “you must go to a 4 year university” push needs to STOP! There is NOTHING at all wrong with having a blue collar job. We need to be teaching kids about all different jobs and about trade schools. Not every kid is meant to go to college. Trash collectors can make pretty good money and there is absolutely NO SHAME in doing that as a career.", "You would think after the strike in New York during the 80s and the Memphis sanitation strike people would stop looking down on sanitation workers", "NTA. Teacher should perhaps consider what would happen to her life without those trash collectors she seems to belittle so. The same with janitors, or retail/service workers.", "NTA big time.\n\nWow, how classist and elite the school faculty is. \nThey’re churning out people who will have no compassion or empathy for people who do jobs seen as ‘inferior’ to the accepted job pathways.\n\nThis is why you have people who don’t respect retail workers, waiters, etc.\n\nGood on you for backing up your child.\n\n(PS, you’ll also find that there’s quite a few people who got sick of the corporate world and have thrown it all in for a good and regular wage.\nIn Australia, Garbos get paid about Au$65k and Accounts receivable gets paid Au$65k, so not much of a difference, and you don’t need to deal with annoying customers)", "“The average salary for garbage collectors in New York is around $76450 per year.”\n\nThey make more than teachers where I live lmao", "As a future educator, all we learn about is how to include EACH AND EVERY profession that's out there when working with children and allowing them to think that they can be WHATEVER they want WITHOUT restrictions. I wholeheartedly admire the way you called this \"teacher\" out on their BS, if the kid wanted to become a fucking garbage collector, then he should become kids should be able to become whatever they want and I am a firm believer of that. \n\nThat \"teacher\" isn't what a teacher should be and I feel sorry that your son felt discouraged about his project because it was so diverse and that's exactly what the world needs in classroom, more diversity. \n\nSo in conclusion, NTA but an amazing parent.", "NTA. This person is an AH and I’ll bet the lowly garbage collector has a better salary, no student debt and awesome insurance unlike the stuck up teacher.", "In my state, trash collectors make more than teachers. NTA", "NTA. I am both an aggressive defender of educators and an aggressive defender of blue collar jobs, but this teacher was WAY out of line. What an entitled thing to say.", "NTA\n\nLet her take a peek at the trash collector’s paycheck and benefits and I’m sure that’d change her tune.", "NTA \nI honestly gasped when I read her assessment and the principal’s comment. \nAbsolutely unacceptable. \nA vital, WELL-PAYING, labor-intensive, blue-collar job that is essential and necessary for a functioning, civilized society should NEVER be looked down upon or criticized, ESPECIALLY by those who would influence the opinions of future generations. \nImagine if one of her students has a parent who is a garbage collector or works for any other essential labor-intensive careers. \nShe’s a horrible educator if that’s her take on the lives and livelihoods of others.", "NTA and you were totally right. Was the assignment to interview people in three SIMILAR professions? No. The whole point was to compare and contrast. She was incredibly insulting of a career we ALL benefit from.", "NTA. As the adult child of a blue collar worker, she really isn't thinking about her biases and how the effect the class. Where I live trash is run by the city, it's a good job with benefits and a pension, because it's required for society to function properly. I wonder what she thinks of the janitors who work in the school, and clean her classroom? Or how she feels about other blue collar jobs, like construction laborers, mechanics or landscapers? All excellent and fulfilling professions, but some people will shit on anyone who doesn't sit behind a desk.", "NTA. Trash collectors fulfill an important and necessary job in our society. On a snowy day, I was stuck behind a garbage collection truck on a neighborhood side street. I waited patiently and was absolutely amazed at how the two collectors (driver & bin collector) worked safely and efficiently until they could pull over to let me pass. Wow! \n\nI'm so grateful to both trash collectors and teachers because both professions do integral work with little to no recognition in many countries. It is unfortunate that this particular teacher refused to recognize this fact. The moment a person thinks they know everything is when they become an idiot. It sounds like this teacher made a mistake. They put their opinions (beliefs) before facts (knowledge). Perhaps not getting their trash collected for a few weeks will shift their perspective and beliefs.", "NTA, Did you ask the teacher if they want to live in a world with garbage collectors?\n\nEdit to add: As someone in the education field (at least part time prior to husband's illness), I think if the educator is narrowing their projects based on types of jobs. I actually thought when seeing the three professions that maybe the problem was the two other professions may have been too similar.", "NTA. I wouldn’t want to live in a place that didn’t have trash collectors. It might not be a glamorous job, but it’s an important one.", "NTA she was dead wrong.", "NTA, thanks for standing up for blue collar careers and your son!\n\nSide note: when I was a waitress 20 years ago I had a regular that came in every Friday with his wife. He wanted fresh decaf coffee, she loved the crepes, and he always tipped me $20 on what was usually about $60 tab. He was a “trash man” his whole life, saved well and lived very comfortably in retirement.\n\nHe was also remarkably friendly and a great human all around. Unlike this teacher. Guess who chose the wrong career?", "NTA \n\nAnd lemme just say, it wasn’t the trash collectors who sent us into a financial crisis, now was it?! Poor lending practices and unscrupulous businesses fank the economy a hell of a lot more than my garbage man. \n\nAnd how dare she scoff at something so utterly necessary as trash collection? Like what in the actual dumpster fuck is her problem? Not just because it’s mean but those guys make pretty excellent money.", "NTA, no matter what job you go into, we all need sanitation workers even the school.", "Financially, in most places with public sanitation workers, they make a better salary and have better benefits, such as health and retirement, than teachers do. They have some of the strongest unions in America, coincidentally.", "NTA bullies often become teachers. I taught at a high school once and I saw kids experience real academic trauma at the hamds of some awful teachers. Your kiddo will remember more that you stuck up for him than the casual insult his teacher lobbed.", "NTA. Proud and engaged parent is awesome.", "Tell them they should cancel their trash service, as they don’t think it’s an important profession. NTA", "NTA. I’ve got a friend who has a waste management business and I’m pretty sure his kids aren’t going to starve anytime soon. It might be a dirty business, but it’s a necessary business, and it’s perfectly respectable.", "The teacher’s whole point was to show jobs have similarities while they seem different — except trash collector!", "NTA\n\nThat garbage man probably makes more than the teacher anyways", "I guarantee you that trash collector (especially if he has a cdl and is union) makes more than that teacher. I remember having shit teachers like that in middle school and it only made me resent them. It’s piss poor pedagogy.\n\nNTA", "NTA\n\nTrash collecting is a very important job and is a respectable profession. Not every student is set on college. I don't care if our society is low in lawyers but God forbid we don't have enough folks willing to collect the trash. You're right OP, teacher has a tiny mind. I'd be pissed that she was teaching kids to look down on trash collectors. Teacher probably makes less than a trash collector anyway.", "NTA. Trash collection is an important job and something that we need. There is no need to look down on them. I’m grateful for them. Does this teacher not have a clue what role they play? This is coming from a teacher.", "NTA. This makes me see red. My dad is a college graduate but he’s a firefighter. Looking down on jobs you don’t need a college degree to get is not cool. My family has several generations of trade workers/jobs that don’t require college and I am proud to be from a family of such hard workers and strong people.", "NTA.\n\nAs an educator I am embarrassed by her archaic thinking. Sanitation workers often make more than teachers do so she should educate herself. I am a CC professor and I always talk to students about spending money on college if it is necessary for the career they want or to take classes that interest them for self-enrichment and the development of critical thinking, but they should also consider careers in the trades as they are repectable jobs, with great pay and benefits, and a lot of times are great for people who like to be hands on, and more often than not won't leave them with crushing debt.", "NTA. She has no right to shame trash collectors while simultaneously using the service. I hope they forget to empty her trash bins at her house for a while. Maybe that'll help remind her that it's a very important job.", "Tell the teacher the trash collector probably earns more than she does haha", "NTA, she should not look down on people based on their professions. Unfortunately not a lot of people who are in the position as an educator but definitely not qualified for the job. A teacher should never laugh at their student for trying. You were correct to brought this to their attention. Apparently they forgot what it means to be a teacher.", "NTA  \nI get that everyone wants their children to grow up and have successful, 6+ figure white collar jobs. That isn't reality and it is like we learned nothing since 2020. The \"low class\" work trash collecting, food service, trucking, janitorial, etc is what keeps our society afloat. Without it we'd be hungry and living in squalor.   \nAlso, someone may want to inform her how much people in waste disposal make.", "Is no one impressed that he managed to find similarities between trash collectors and financier that is an impressive use of cognition. It is easy to be able to spot the differences, but to find the similarities is much harder.\n\nThere are students that we have hoped and prayed would become trash collectors. Steady work, good vacation days and excellent benefits with pretty good salary.\n\nNTA", "My former FIL drove trucks long distance for a living. He was also one of the most well read men I've ever known, and a fascinating conversationalist. Not everyone has an opportunity to go to college.  That teacher is being classist and teaching stereotypes. You did well to call her out on her bad attitude, OP.", "NTA.  The teacher is a snob.  I wonder how she would like her lifestyle if suddenly there were no \"professional\" garbage collectors?  Ever lived in a rural area where everyone has to collect his own garbage and haul it to the dump himself?  Not fun.", "NTA. While I don’t actually understand how waste station employees get used to the smell especially in the summer, I feel a much higher appreciation for them that they do it. Not only are they doing a job nobody wants, but a job so many people look down on. In my opinion, the teacher should reconsider working in education if she doesn’t understand how moronic her statement really is!", "I’m furious that the principal was in agreement with the teacher! The classism and elitist mentality is despicable. \n\nWith schools being more inclusive and aware of learning styles and diversity, they should celebrate that there’s a career out there for everyone. \n\nI think blue collar workers are incredibly respectable - they are the ones out there having to battle with the elements, work around a pandemic, work odd hours, etc. \n\nI honestly wish you could escalate it even more. Such bad teaching. \n\nNTA", "Literally had flashbacks to the meltdown that Edinburgh was when the bin men went on strike", "It was a compare and contrast exercise. If OPs was able to adequately accomplished this then he deserves praise especially for highlighting profession I’m sure no other student used and one that certainly isn’t shameful. NTA", "This was a VERY intelligent choice of interviews! It’s good to see what different people do and how they thing about their jobs. Could be the STUDENT decides he wants a white collar job … or something more active. \n\nWasn’t that the point of the assignment? Do the interviews and report the results?", "I'm sure the janitors in her school would like to hear what she said about trashmen, as they share some similarities. Every teacher knows you don't piss off the janitor or the school secretary.", "I agree that this teacher is very elitist, and I think all professions need to be open to students. I hate the \"everyone has to get a degree\" push and always have. However, maybe I am misinterpreting your comment, but it is also a bit elitist to look down on the middle school level. Again, not defending THIS teacher, but I am a middle school teacher for the first time after 7 years at the high school level. I made that choice because middle school (imo) is the final frontier of autonomy in teaching.  So, it isn't just a crappy gig you get stuck with...some of us crazies do choose it.  Also, many college teachers get paid worse and have it worse than K-12, so that isn't the ultimate goal either.", "It makes my blood boil when teachers are all \"university good, trades bad\". I'm an ex-teacher. Saying stuff like that is ignoring the individual needs and talents of the students. Some will be more skilled at trades. And probably earn more than white collar workers, with little to no student loan debt. Some will be brilliant horticulturalists. Sanitation workers. Some will prefer hairdressing. Some would like to be doctors, or lawyers. Whatever. Don't ignore the individual.\n\nI know that compared to other countries I have a low student debt, but I seriously wish I hadn't been pushed into a useless university degree because it was what we \"had\" to do and ended up with $40k of debt because i didn't have a clear idea of what I wanted to do. Regrets.", "trash collectors can make a lot more money than teachers do.  my uber driver told me he drives a trash truck and clears 75k", "Well…I currently teach at a university and there are A LOT of bullies and sociopaths who thrive in academia.", "Holy crap, in my small city, working as a garbage collector is actually a really sought-after union job with great salary and even better benefits. They make a hella lot more than most teachers. \n\nOP, definitely NTA.", "Trash collectors make six figures in major cities. Trash is big business.", "Teachers are elitists in general. The moment I told my education professors I didn’t want my own classroom, you could see their brains short circuit. They could not wrap their heads around someone wanting to tutor or work as an educational coordinator in a museum.\n\nThey wanted VERY little to do with me after learning about my career aspirations.", "Yes. There are so many jobs that support the fabric of a physically comfortable society. Want to pick up fast food, coffee, get gas at a convenience store,  flush your toilet? Drive on a road, not riddled with potholes? Walk into a grocery store, purchase neatly stacked and rotated fresh produce?  Dine at a nice restaurant on clean plates? Well, there's a dishwasher back there. Want to sleep on clean sheets, in a sanitary room in the hospital? Say thanks to housekeeping staff, laundry room employees.  \n\n\nFood workers, truck drivers, store managers, road workers, produce clerks, the list is very long and involved. We need and should respect everyone!", "No, they don’t. Median pay is sub $20 per hour.", "You’re all coming off as delusional. Nationwide median pay is 39K. Beyond that, it’s a low skilled job that is easily replaceable. Even if they are earning that much, they certainly won’t be in the long-term; our entire janitorial staff was lot go a couple years ago and replaced by a contractor company that pays their workers near minimum wage, near the same these low skill jobs are trending. It’s a pretty unreasonable expectation to put in these jobs.\n\nAnd jobs where garbage collectors are earning more, when I e asked, are almost always management positions. And of course the same of earning more in management in education or any profession also applies.", "The only trash collector I know has 2 houses and a beautiful family. It's a job that needs to be done and pays well through the municipality.", "I always treat the cleaners of any institution with respect. Especially when I work there. Why?\n\nFirst of all: Their existence is why the word 'middenheap' has fallen out of usage and I'm grateful for that. Hell yeah!     \nSecondly: They have all the keys and know more about what's going on than the high-minded white collar workers like me give them credit for.", "Was just talking about this exact thing with my nephew yesterday. How so many \"educated\" people look down on janitors and trash collectors and everyone who deals with waste, and that tells you just how out of touch those people are. Because if folks who deal with other people's trash go on strike, everyone fucking well NOTICES it pretty much immediately, because they are *way* more important to everyone's *day to day* life than most professionals are, and yet they get so much less respect. \n\nIt made sense to my 12yo nephew. If the adult teacher can't understand that shit, she's got no business teaching kids about values.", "Decisions like trash collecting seem to me like one of the MOST important roles. How sick would we be with no waste removal?\n\nI do Econ and I wanted to work in waste removal (the calculations - my back hurt to much to do the hard work) because its such a fascinatingly pivotal role in society.\n\nIts right up there to me with access to clean water, because without it, we don't have access to clean water.", "Yup! I work in finance and if I went on strike clients would take their money someplace else, leave some bad reviews, and move on.\n\nIf the garbage collectors went on strike, all hell would break loose.\n\nIt’s a hard job that has become pretty necessary for a lot of places to function and it can get gross, so the people who do it should get paid well and respected.", "I would actually argue that trash collectors are much more important. But that’s just my humble opinion.", "Pizza Rat is a case in point.", "Not only that but the son followed the instructions for the project and the teacher chastised them for it. If the teacher meant to exclude certain jobs or certain types of jobs (like blue-collar) then that should have been part of the instructions for the project. Changing the requirements after-the-fact is NOT good teaching.", "I would transfer the kid out of the school first.", "Or want an MD after their name.", "Mmmmmmmmm considering my dad has been doing it 20+ years, has to have a CDL and would get compensation for all of his experience + a clean driving record I’m going to go ahead and say I think he’ll be okay. There’s lot’s of different levels a trash collector can be. The point here is to not look down on a job just because it doesn’t require a degree. Teaching requires a degree and there’s teachers in rural parts of the U.S. making less than 39k.", "Yep. My husband and I work in my dad's auto repair shop/gas station. When our state basically shut down we were 3 cars deep in our parking lot and working nonstop. The gas purchases obviously went down but our repairs went way up. The jobs that people don't think are important were mostly the ones that didn't have to transfer to work from home or shut down completely.", "Right?! The closest dumpster at my apartment complex is always full before collection day and ends up overflowing. Our garbage collectors still take it all. They're champs and they're awesome. I appreciate not having to live with garbage, you know?", "And the same is obviously true for teachers, how much do you think a vice principal makes? Or someone at the school board level? \n\nBeyond that, in the US teachers are treated like garbage and it’s a job that people do for passion in a lot of cases, no one is passionate about garbage collecting.\n\nAnd obviously anyone with experience or management is paid a lot more than the median, so why are you people comparing someone with 20 years to a new teachers pay? It’s a silly comparison and the ceiling is much higher for someone in education compared to someone in garbage with no degree.", "💯", "2019? I was there near Termini. Hot as Hades & the stench was eye-watering. Ended up taking the train to Ostia and walking to the beach for a very pleasant couple of days.", "Ugh in Naples, too. It was disgusting. Garbagemen/women should never be treated poorly. They have a hard but necessary job.", "Ironically, they make about what many teachers make. I teach because I like kids, and I like the challenge of getting through to kids who have trouble learning. I have a master’s in special education and experience working with both profoundly disabled kids and kids in general education classes who come to my resource room to try to catch up to their grade level in reading and math.  The frustration is that being an excellent teacher doesn’t get you bonuses or raises, the way corporate types do. In fact, you get the same pay an unenthusiastic, minimally competent teacher gets, and if you work the same number of years, you get the same pension. It’s a lame set-up workers as essential as garbage men get. That is some brutal, exhausting work, but I’ve never met a garbage man who’s impolite or unfriendly. I don’t care what your education is; to be able to do useful work is a blessing. Would it be nice to make more? Sure. But we’ve got a pretty skewed system in the US.  The middle class has shrunk, the rich and poor classes have grown. I hope the pendulum swings back before my wee grandson has decisions to make about his work/education.", "Tell him to learn to scuba dive as well, he'll be making more than the average teacher in 6 months, sincerely a contract underwater welder who taught high school for a year and got the hell out", "The principal and teacher are wanna be elitists, and I will bet dollars to doughnuts trash collectors make more than teachers in some cases.  Personally, I think the son picked interesting professions to compare and contrast.  NTA, but those two petty despots are AHs.", "Trade school level ppl are essential to our society, as are so many others. Welders build things, like ships, care for power plants, probably maintain giant cranes, used to build expensive buildings. \n\nYour nephew is on a good track. The stories I could tell you about ppl with barely HS, almost HS, 2 yr degrees who have made good livings for themselves and their families. Trades are always in demand.", "My daughter is a hair stylist. She had a teacher in high school tell her “You are smarter than that. You should go to college”. Fast forward 6yrs to present day. She loves her work and looks forward to going to work everyday. And because she isn’t strapped down with student loan debt, she was able to purchase her first home at 22years old. I wish that teacher could see her now!", "My dad grew up poor. He joined the navy so he could use the GI bill to go to college. It was the only way for him to go. He became an electrical engineer and worked for the federal government. And made good money.", "NTA. My parents are immigrants (I’m first generation American). Both of my parents worked blue collar all of their life to help me and my 4 siblings have a better life here. My dad was an electrician and my mom was a 7-11 clerk. I find that teacher’s comment utterly insulting and offensive. And honestly, I learned many blue collar things growing up that has helped me in my adulthood- working on my cars, taking care of my house, using common sense in troubleshooting broken things, etc.", "NTA, at all. My work at a blue-collar job changed my life.  If my teachers had been narrow-minded dicks, I might not have had that opportunity.", "I don't know about other countries, but in Australia, they can make serious bank. Like questioning my own career choices type money. Way more than a teacher. \n\nNot to mention we all learned exactly who the 'essential' workers really are. And if I remember rightly, kids were home-schooled by their parents, but our bins were still collected, on time, every time.", "NTA", "ABSOLUTELY NTA and what the actual fuck.", "NTA and that teacher and the principal are classist assholes. Take this up the chain.", "NTA and that teacher should be censured at a minimum.\n\nFirst, what an awful example of a human, let’s just consider for a second a child that could have been sitting there with a parent in that exact job at the moment.\n\nSecond, perhaps she should google Wayne Huizenga. He started with a single trash truck one day. Since she seemed to be using financial security as a measuring stick, go ahead and measure against him.\n\nShe/he is a horrid example of what an educator should be, frankly.", "NTA. What if one of the students’ parents worked in trash collection? Which is a well paying job btw.", "NTA. What a weird, elitist thing to say to a group of teenagers. Trash collectors are a vital part of our society, it is a very dangerous job, and (at least where I'm at) they get amazing pay and benefits. I'm not just mad for your son, but for all of the trash collectors out there who don't get the respect they deserve", "NTA I wouldn’t want to live somewhere without garbage collectors", "It’s a WELL PAYING UNION JOB FFS", "Lol in my area sanitation workers make more and have better benefits than teachers", "NTA\nI'd like to see the garbage man skip her route", "NTA", "I appreciate and respect my trash collector and my exterminator way more than some teachers and all lawyers, or basically anyone else I have to deal with professionally . I would not want to go without either of them. Trustworthy hardworking and respectable!! NTA!", "NTA, and you sound like a great parent.", "NTA. \n\nThat teacher is a jerk.", "NTA most trash collectors make way more than teachers", "Educator here you are NTA. Never embarrass a student.", "NTA. You're right. This person should NOT be teaching", "NTA. The people who pick up the trash do one of the most important jobs in the community! That teacher is absolutely horrible and just plain ignorant for dismissing the whole profession.  Geez what an asshole.", "The funny thing is that your trash collector almost certainly makes more money than your son's teacher. Probably a lot more.", "NTA some of her kids have trash collectors or someone professions for parents and role models. She's just being the latest", "NTA - You did the right thing, what they both said & did should not be tolerated in Education. Heck their views are so toxic & small minded, I'd actually be having 2nd thoughts about the school if this is the reputation they want to carry. There is nothing wrong with a career as a Garbage Collector & who's to say a child that learns about it & is inspired by it grows up to be an Adult who changes the industry for the better or creates a business on garbage collecting, the child could turn out to be someone who minimises or creates a better recycling garbage system. Shunning & tearing down a kid is just not on.", "NTA. Take this to the district.", "NTA You were correct.", "Maybe that’s the problem. Not enough people think trash collection and education, so no one is looking for smarter ways to recycle and up-cycle our garbage. I hope your son invents some amazing solution that makes him so rich that he hires the financial experts and then tell this story on an international platform. “I had a teacher once who said _______” then give the “We all know who is right here” smile.", "NTA. I’m a teacher and this excuse for a human is horrible.", "NTA. I bet your garbage collectors makes way more money than your son's teacher. How the handled it was wrong", "NTA\n\nAnd I'm a teacher. I was fully expecting to side with the teacher based on the title, but not after reading what she and the principal did! Both of them are seriously in the wrong here and I'd consider escalating this to the superintendent if necessary.", "NTA. If you’ve described it accurately, the assignment was “speak to 3 people of different professions”, not “find 3 people who do a job you could see yourself doing”. Frankly, finding the commonalities between a garbage collector and a person in finance is a much more thought provoking exercise. It’s almost like the school told her that part of her job is to support the kids‘ career goals, and instead of sussing out interests and aptitudes she took the easy way out and made them tell her in a way that could be graded- ie no “extra“ work from her.", "A garbage man can make six figures. I’d say why not compare it? NTA, you’re right .\n\nBut, you might have made the rest of the year more difficult for your kid, although with a teacher insulting him openly I don’t think that’s a new problem to deal with", "You should consider reminding the teacher how the bubonic plague spread. You’re are not the asshole.", "NTA, your son did the assignment as asked.  Nothing wrong with sanitation workers, plumbers, mechanics, etc.  You should have asked her if she likes her trash getting removed or should it just stay in her yard or in front of her house?  If her car breaks down, who does she take it to get fixed, and I guess the teacher should also clean her own room and take out her own classroom trash.  One should NEVER put down another profession", "NTA.  If the teacher wanted specific jobs as part of the project it should have been defined as such and also shame on the principal for saying they didnt go hand in hand like ISNT THAT THE WHOLE POINT OF THE PROJECT?\n\n&#x200B;\n\nI thought the whole point of the project to describe how jobs would be both the same and different and with that in mind the fact that a job like garbage collection and finance dont go hand in hand to me almost feels like it would make a much better project to compare similarities and differences compared to somebody else picking 3 jobs in the same sphere of each other.\n\nIm not sure about the whole reconsider role comment but she definitely should look at the assignment parameters and realize your child did nothing wrong with the selections made and grade it appropriately.\n\nTeacher also should reevaluate the assignment and change the guidelines for future uses if they wanted to get specific about what types of jobs are acceptable or not although in doing so I think it would really handicap the students learning and creativity but if thats what this teacher wants its fair enough if its in the guidelines prior to the assignment I suppose.\n\nI mean really a good teacher would always be reevaluating any assignments after every single time of using them for potential problems or changes and grading etc....  but especially if there were issues.\n\nSadly in college I had a situation where the teacher refused to reevaluate my work when I misinterpreted a question when I knew the other interpretations answer as well and anybody I talked to agreed with me but I just hope they went back and made it more clear what that question was asking for example.", "NTA both the teacher and the principal are ignorant assholes.", "NTA. I'd have said meaner.", "NTA. The covid pandemic made it very clear that a lot of professions that people despise are actually the important ones in terms of keeping things running. Try going without garbage collection for a month or two, and see the diseases that spring up. \n\nOn top of which, your son did exactly what he was asked to do! It doesn't sound as if the teacher put specific professions out of bounds - so why was she criticising what sounds like a really interesting approach to the project?", "Speaking as I teacher, I say you are decidedly NTA. That teacher needed a reality check, and you provided it.", "I immediately thought that the son was smart to include a blue collar type of position because there must be some draw to why people do that. Plus it’s great to get a different perspective. You never hear about them being under paid on tik tok… jus sayin.", "NTA. I've worked as a trash collector and I have a masters. My dad works as a trash collector and he has several degrees in education and law. I have friends working as trash collectors who just bought a huge house with a pool (they are 26 and 27). Honestly, in most places trash collectors earn better than the average person. Fuck their classism.", "Lol those trash collectors have more secure jobs than that teacher does. Probably paid better too.\n\nedit to say an astounding NTA. Thanks for standing up for the \"dirty jobs\" out there. You're teaching your son valuable lessons.", "NTA - there are sanitation workers who pull in larger salaries than teachers and they don’t have college debt nor are they expected to foot half of the bill to do their jobs well. \n\nThe teacher was a snob and a half and deserved to be told about it. Also? Bullying kids in front of the whole class absolutely calls for reconsidering your career.", "In Australia, garbage collectors make at least twice what most teachers make, they also have licenses that could easily convert to a 200-300k a year job if they work fifo. This tracker is being elitist and the only vengeance is to let the janitorial staff at the school know, so they can appropriately clean her classroom. NTA and thanks for raising a kind kid", "I am an executive, white collar worker. Every trash collector on earth deserves more pay, benefits, and respect than I do, as well as any other ceo-type. NTA", "Nta: lowkey, just tell her that she would be lucky to be a trash collector, because if I remember correctly, they make more than teachers", "NTA. That teacher needed a reality check - our world needs all kinds of jobs to keep functioning and they are all important.\n\nA university degree doesn't make someone smart or a better person. And working a physical job doesn't mean someone isn't intelligent. \n\nThis teacher will have all types of jobs represented in the families of her students and it's important not to denigrate someone's employment.", "I would also check the pay scale for both teachers and trash collectors. I think thevteachervwill be shocked and hurt, but it might give her a sense of where society places value. \n\nYou are spot on, but its not surprising, teachers, while doing a noble and neccessary job, tend to walk around with a sense of entitlement, and as martyrs for their choices. \n\nNTA", "NTA -- tbh if a student found reasonable connections between three not obviously connected fields, I'd see a demonstration of critical thinking skills. There is also nothing wrong with sanitation work....sanitation workers are vital to cities and well paid. \n\n\\- Fellow teacher", "NTA. What’s her opinion of the school janitors? What a narrow-minded person. I’d really hate knowing this kind of attitude is being taken in by developing minds, it perpetuates so much of what’s wrong with our society\n\nCompletely separate from all of that, I would have a really hard time not straight up laughing at this person as they try to act smug towards a career path that makes more money than their own. They sound so snobby and foolish lmao", "Many trash collectors where I live (rural Kentucky) are in private business for themselves and do quite well. Also,  recycling and repurposing of many things ,like water bottles being used to make yarn, are becoming more and more lucrative over time. I would say your son maybe much more forward thinking than his teachers. NTA", "NTA. Firstly, she didn't specify any limitations on what profession to interview... If somebody interviewed an actress or performer or somebody in arts would she have shamed them as they are not in same category as a financer or business consultant..\n\nSecondly, she embarrassed a student in front of a class... If a child did that, they would be reprimanded but because she's the teacher it is okay?\n\nIf that was my kid, I would double down on the teacher... One thing that our country learned during pandemic is which jobs are actually essential and garbage collector is one of them", "You're perhaps being a bit precious. I have nothing against any career. However, OP, from the work you've said your son produced, he has potential to do well in a more professional career. Can you honestly,  with hand in heart, say that you would be delighted if he came home one day and said that was his chosen career, with his intelligence and potential?\n\nWe ABSOLUTELY need people to collect our rubbish, it's an extremely important role in any society, but will it give him career satisfaction?  \n\nWe are in danger of raising children who can't deal with criticism and being challenged, and they're not well prepared for the real world. The teacher may not have handled it the best way, but your reaction is over the top. You could have helped him learn how to deal with criticism instead.", "NTA. The teacher and principal are absolutely deplorable people. There is nothing wrong with being a trash collector. News flash: a person can be educated and a trash collector, if they so choose. Most importantly, as long as they are good human beings, it doesn’t matter their profession. I fully agree with what you said.", "This reminds me of a clip where the teacher says a guy will be trash man and guy figures out that they make more than a teacher. Seriously in NY at one point they went in strike and ppl caved in under 2 weeks, bankers in Ireland went on strike for 6 months before they feared that they would become redundant.", "NTA. Tell the teacher to become a trash collector. They make more money than her.", "NTA and I work at a Middle School. If you had met with my Principal, she would have had your back 100% Trash Collectors are hard workers and having tough jobs. No teacher should discourage any profession (except illegal ones) and frankly your son’s teacher AND principal are snobs. They both need to pick new career fields.", "OP could point out the teacher's snobbery more tactfully.", "INFO: Did you choose three people for your son to interview? Or did he choose them?\n\nI am wondering if the assignment was for students to choose 3 professions they are interested in for their future. Based on conversations with your son, she may have thought he was interested in other professions and the trash collector just surprised her.\n\nBecause if I was a teacher assigning this and a student has been talking about their interest in, let’s say, acting and film, but then present their project about an exterminator I’d be surprised enough to ask them about it. And not in anyway because there is anything wrong with being an exterminator.", "We need trash collectors! In my area, they make more than a lot of teachers. It’s a hard job, but what would the world be like without them? I imagine your trash collector appreciated being asked, as they are so often overlooked. A trash collector might not need a college education, but they need to be strong, reliable, a safe driver, attentive, etc. \n\nYour son’s teacher and principal are snobs and should be ashamed of themselves. Do they know the professions of every student’s parents? And aunts and uncles? It’s not impossible that at least one other kid felt shame while she was mocking your son’s presentation. even if none did, he fulfilled the assignment and she was out of line. Not every profession is white collar, and that’s okay! \n\nNTA", "NTA If she talks every kid out of trash collection, then 20 years from now she's going to wonder why her trash isn't getting picked up (unless robots have gotten a lot better at doing tasks like picking up trash cans).\n\nI wonder if it's occurred to the teacher that some of the students might have a parent who's a trash collector?", "lol yeah no, you're  NTA, that teacher is nasty and TA.", "NTA!!! They're just being snobs! Anyone who does an honest hard day's work deserves respect(!), even if their job isn't pleasant or ideal! These two would end up getting a new found respect for trash collectors, if suddenly that job didn't exist anymore and there was nothing to replace it! They sure wouldn't like to be dealing with all of the trash they create!\n\nAnd if anything your son's willingness to look at and consider these varied jobs does him credit, because he is willing to see the good in these professions, and compare them in an unbiased way! The difference between your son and these teachers, is that your son sees people who work in trash collecting as human beings, and those teachers see then as dirty, disgusting pieces of trash! If I was you, I'd use this experience as a teachable moment for your son, and show him that he's on the right path to becoming a good and respectable person, unlike his teachers who discriminate and condemn those they consider \"less\" than them!", "NTA. Also, garbage collectors where I live make bank. They make way more than starting teachers…not sure why the teacher is being such a  snob.", "NTA\nSomething something “those who can’t, teach”", "As an educator, NTA. Teachers should NEVER belittle students, their work, or their possible dreams. And claiming to uplift students to achieve their fullest potential while putting down people in careers they deem “less than” is disgusting. You’re a good dad and showing your son good values and how to treat people that with respect.", "Not only that, but isn’t there value in comparing the differences between things that are… Wait for it… Different?", "The sociological aspect is very true.  My BIL was dumped by his high school girlfriend for going into a trade because she \"didn't want to be getting her briefcase ready for work every morning while he packed a lunch pail.\" Work is work, but western society has expectations that university or college is the way to go, and undervalues any profession outside of that route.", "NTA I completely agree. \n\nNot all white collar jobs pay well and not all blue collar jobs pay poorly. \n\nI have an advanced degree, yet one of my good friends who is a master carpenter and barely finished high school makes nearly double what I do (he is in the high 6 figures). All because he learned how to do specialty antique restoration work. \n\nA lot of the old trades pay insanely well now because everyone strives for that white collar job instead of traditional crafts. It’s good to diversify.", "NTA. OP, I was a teacher and gave the kids a project every year to research a career they were interested in on a deep level. I never told the kids what careers were \"good\" or which careers I accepted. I wanted them to research something they might want to do as a career in the future. And I truly felt the whole class benefited by learning about ALL the different career options when they presented about them.\n\nI'd be mad at this teacher too.", "I’m pretty sure that trash collector makes more than that teacher", "Here trash collectors make more than teachers.... I wish i was a trash collector!!! Great benefits and income!", "She's a bigot and an elitist. Where do trash collectors start? In a classroom exactly like hers. How many trash collectors has she produced? NTA. You are right and she deserved it for her statement.", "Ah don’t worry, this dumbass teacher doesn’t even realize most garbage collectors make 5-10k/year more than she does", "Bet she’s the kind of teacher who treats teacher aides, groundskeeper and cleaners at the school like  they’re beneath her. Without them a school doesn’t function well. It pays to treat them with respect. You often get better treatment than staff who don’t when it comes to assistance. It doesn’t take much.  Plus not everyone is cut out for white collar jobs. So NTA", "Yeah. I'm a teacher, and giving precise instructions is my responsability. There's been assigments or tests in which students have not done exactly what I wanted, but after rereading instructions it was my fault not theirs. So I didn't punish them for my wrong and tried to be clesrer in future instructions.", "To be fair, if you’ve been to Rome, you’ve been to Rome when a strike is happening.", "Yes, this is the way. Consider sewer services, water, running our power plants. Need a new roof, carpet, painting? Fix your furnace, plumbing, remove trees that have fallen during a storm? Tow your car?", "Are you in Edinburgh? I never heard if there was a conclusion to the strikes over the summer but I’m glad that was the outcome! I was there in August and their absence was extremely obvious!", "OP doesn’t mention how the principal reacted (unless it’s in the comments?). Teacher was indeed elitist and 100% wrong. Not to mention, what if some of the kids in that class have blue collar families? Teacher made comments that could make them all feel bad.", "NTA because your son should feel motivated to do what ever he wants to. The teacher is not there to ruin his dreams they are there to teach. Ngl I do think she shouldn’t be a teacher if she treats her students like that. That’s horrid", "The ironic thing is, the trash collectors make a lot more money than the teachers do. NTA", "NTA. The teacher behaved inappropriately towards your son by calling him out infront of the class and then mocking, and belittling him. She also behave inappropriately by mocking refuse collectors. They are essential and should be well respected by all. I'm sorry your son was demeaned by this teacher. I agree, she needs to consider another career if that's how she choses to treat a child and how she teaches other children to behave.", "There’s no way this happened in 2022", "NTA\n\nYour son did his assignment, it never said any specific job should be or not be used as example. And this attitude with the garbage man's job is highly unprofessional. From both the teacher and the director!", "NTA.\n\n\"Those who can, DO. Those who can't, teach.\" There are so many \"teachers\" out there right now, from K-12, who have zero business teaching kids. My kid niece is bullied by the faculty in her school just as much as she's bullied by students. All because she speaks her mind and doesn't let people walk all over her, which is what she was taught by my family. The one teacher literally yelled \"Shut Up\" at her when she wasn't even talking. The teacher then asked, \"Did that hurt your feelings?\" My niece quickly replied, \"No.\" The teacher just said \"Well,\" in a disappointed tone. It's disgusting that these people think that because their job affords them the \"intellectual high ground\" they can behave in a way that wouldn't be tolerated from a minor or even an adult in a different situation. I'm all for home schooling if it can be done.", "NTA. I’m a teacher and I encourage my students to explore whatever career options appeal to them. I also model and teach them to respect everyone. We need garbage collectors and I’m grateful they’re here. 🤷‍♀️", "NTA. Setting aside the vital role sanitation workers fulfill - even if \"trash collector\" was exactly what this teacher has stereotyped in her mind, it makes a brilliant \"baseline\" to compare other jobs against. I.e. you want me to work 80 hour weeks for 3X with high stress levels when I could work 35 hour weeks for X and no stress...hmm. Education should be about exploring possibilities, keeping an open-mind, and discovering the unexpected. Your son created a teachable moment with the class and his teacher ignored it for a cheap laugh. She does need to reconsider her role.", "No, instead of listening to your valid concerns she was smug so isn't able to understand how she made your son feel bad as well as contribute to a negative view on people who collect the trash for us to children who might think that's ok to look down on other professions.  Honestly without them we would have to do more work dropping off trash in our own vehicles or it would just be a smelly world.  \n\nNow if she apologized and was nice I doubt you would have said that.", "NTA.\n\nWhat's wrong with being a garbage collector? Is it not a job as well? \n\nIf the assignment never specifies what jobs, why can't your son choose that profession?", "I came in all ready to tell you that you’re T A,  but then I read why you told her that. \n\nYeah, NTA. She has no place teaching children if she teaches through humiliation.", "NTA 100000% trash collectors make very good money and do you have any idea what the world would look like without them??? \n\nfurthermore the entire point of the project was to compare the jobs (she never even stated what kind of jobs either) for similarities and differences. he must have had some similarities between them and that should prove how vital that job is. \n\nadditionally, what if one of the classmates had a parent who was a trash collector and she just openly insulted them in front of the class? \n\nwho is she to judge someone’s profession? their way of living? their way of feeding their spouses and kids? \n\nthis is absolutely sickening and for her to be teaching this opinion to young minds who are going to grow up and think someone with that profession is somehow less than them is appalling. i am thoroughly disgusted by this teacher. not only are you not the ah, but i would like to thank you for standing up to the teacher and principal.", "NTA. That’s some classist bullshit if I’ve ever heard it.", "From a teacher - NTA.", "That was my first thought- what if one of her students is the child of a trash collector? Ouch!\n\nAlso, i don’t know anything about OP’s family’s social circle, but when I was thirteen I didn’t even know 3 adults who had high-paying sought-after impressive-sounding jobs. Just finding 3 people willing to take the time to be interviewed was an accomplishment.", "Honestly, I probably would have gone more scorched earth. I would consider going to your local new station that has like \"3 on Your Side\" or some other human interest regular piece where that total about local injustices. Name and shame the school, principal and teacher. Or go to the union for the sanitation department. I would report what happened, you sought resolution and support, and you got none. NTA.", "The teacher is a disgrace and OP was right. NTA.", "Exactly. They just taught a bunch of kids that this is a profession that they should mock. That's something that could impact how they treat people they run into, it could make other kids feel bad, and it's just such a horribly classist thing to think. \n\nNo one should be ashamed of honest work.", "Dude, we had a huge sanitation workers strike in Edinburgh at the end of a massive festival last year. It was awful. The city was covered in garbage.\n\nBin workers deserve CEO-level salaries. They’re invaluable.", "It's the old \"if you don't go to college, you won't make anything of yourself\" mindset", "The principal made the comment that education and trash collection don't go hand in hand.", "NTA. What’s funny is that most trash collectors make more annually than teachers do!", "Well damn said. Stealing that line for future reference!", "Maybe someone should let the teacher know that being 'just' a trash collector could earn them more money than teaching in some places. NTA, OP. The world needs to keep going, someone's gotta do the dirty jobs, right?", "Imagine a world without garbage collectors.\nWe would all drown in trash. It's such an important profession and still people don't want other people to work in those professions.", "NTA.\nI’m a teacher and I often encourage my students to look at a variety of careers and employment opportunities because, let’s face it, not every kid wants to go into further education after high school. And that’s ok! Our society would fall apart if we didn’t have people who enjoyed fixing cars or were employed in customer service or collect our rubbish. \nNo profession, no type of employment should be beneath anyone. Her comments weren’t called for and weren’t appropriate at all…", "NTA.\n\nIn fact it was a nice decision to include a trash collector. The distaste of teachers for human beings performing an important role in the community is sickening.", "NTA - but I understand why you’re asking. \n\nThe assignment was to compare and contrast different jobs. Your kid chose very different jobs. In my mind, that’s a better way to explore the assignment than someone who chose 3 white collar jobs. \n\nBut your question is about telling the teacher they should reconsider their job and that’s less clear. You were rightfully frustrated with the teacher’s attitude about your son’s report. I don’t think it’s about being an AH or not, it’s about asking the teacher a thoughtful question about the assignment. \n\nYour comment probably didn’t make the teacher think about what they asked of the students. It may have been more productive to ask what the purpose of the assignment was and how that fit with your son’s interpretation.\n\nWas the purpose to explore potential job opportunities?  Or was it to understand the role different people play in our society? Or what skills are valuable in different situations? \n\nTeachers (and parents) should understand that good questions lead to good answers. \n\nIf the teacher wanted them to explore job options, they should have asked a question related to the students’ futures. If it’s about society, the assignment should reflect that. \n\nIt sounds like the teacher asked a lazy question and expected students to read their mind instead of asking a high quality question that made the parameters of answers clear. Or worse, they asked a vague question but expected a specific answer. \n\nThe teacher was in the wrong, but your kid will be better off in their class if you forge a partnership that helps everyone learn.", "NTA\n\nYou actually made very valid points and weren't overly rude about it. You didn't say \"You suck as a teacher and should quit\", you told her that IF she's going to be narrow-minded, she should reconsider her job choices. I see nothing wrong with it given the situation and how horribly she handled it. \n\nThis whole situation would have and could have been avoided if she hadn't have been so judgemental. There's nothing worse than when people look down on the labor trades as if they're somehow sub par.", "NTA task wasn't about the roles, it was about comparing them to think about factors affecting different jobs. If she only wanted 'high status' jobs, she should have said that.", "NTA.  May I suggest, as a bonus assignment, having your son compare the average salary for a teacher in your area to the average garbage collection professional?  I know where I live which one makes more (and which one is likely saddled with student debt, too!). Let him turn it in to the teacher to show he’s really committed to exploring career options, lol \n\nEducators with these views are so harmful. She probably looks down on the janitors that keep the school she works in clean and functional. Not every student will move on to college, and that’s perfectly fine! It’s such a disservice to tell every student they *have* to go to college to have a successful life. Students need to be encouraged to find a career path that works *for them* and work towards that to the best of their ability. Sorry, I’ll step off my soapbox now.", "NTA! People like that really don’t need to have access to and authority over children.", "NTA.  I'm going to bet all of the money I own, which isn't a lot, but still, that your son's teacher has her trash collected.  By belittling that profession, she's belittling the person.  Fuck her for that.  She shouldn't be an educator if that's how she views the world.", "What the teacher said was extremely insulting. Garbage collectors are very very important for the world we.live in. \n\nThat teacher should not be an educator. NTA", "NTA --- she'd soon miss bin men if they stopped collecting", "NTA everyone looks down on careers such as trash collection and janitorial services until all the crap starts piling up! Thank you for standing up to these snobs and putting them in their places.", "NTA. The teacher and principal both sound incredibly pretentious. I fully believe in encouraging kids to pursue higher education but not at the expense of devaluing blue collar or trade professions when so many of those jobs are absolutely essential for our society to function. \n\nHonestly, I think you should send a complaint about this to the district office because it is absolutely not okay for them to be disparaging of any types of careers. What if one of the other student’s parents was a garbage collector? How would they feel hearing their teacher and principal mocking like this?", "NTA, teacher is an AH and horrible snob. Doesn't have the empathy OR reasoning skills for their job as a teacher!", "NTA and as a teacher I am appalled at this teacher’s classist attitude.", "NTA\n\nFirst, there's nothing wrong with being a trash collector, how dare she shame the job. It's hard work, and many would rather sit behind a desk, but that's a personal choice your son has to make.\n\nSecond, even within her narrow mindset, she should recognise the value of knowing more about it. Had your son some romantic idea about the job, without realising how much hard work it actually is, the interview would've set him straight about that.\n\nShe's wrong twice", "NTA. And you know you’re not the NTA. I’m concerned that the principal backed up the dumbass teacher on this, though.", "NTA. In the first place, not sure where these \"educators\" get off looking down on any profession, but sanitation workers are VITAL to our societal infrastructure. In the second place, isn't this the WHOLE POINT of the report? To learn about other professions, to understand what they do and what opportunities are out there? Better to compare 3 wildly different fields to understand the range of futures available to everyone. \n\nI'm sure the janitors at that school would be interested to know the teacher & Principal's POV on those who work in the field of sanitation. That's not a group I'd want to piss off if I were a teacher.", "NTA\n\nIts a pity your son didn't respond by \"you are right it would be more appropriate to compare garbage collector with teacher, since they earn about the same\"", "NTA\n\nMy teachers taught me the same way, and would even trash talk about the school janitors work right in front of him. Some people are just classist and cannot see past that. They're not worth wasting your time on and certainly aren't people who should be teaching anyone anything, but unfortunately there's just too many of them to do anything about it.\n\nPeople who cannot fulfill their role should not take it or be allowed to occupy it, it's really that simple. There's far too much of that going on in the world nowadays, and education is a sector we cannot allow that kind of thing to have a foothold in without it having massive negative consequences, which we're already seeing today. You're not wrong to fight that where you see it, and I wish more people would have the courage to do the same.", "NTA. I did a similar project where I compared commercial truck driving to being an author, and the pros and cons of each and why I chose them. My teacher ate it up. Kids should be encouraged to learn and ask questions, never shunned", "NTA and education and blue-collar jobs can definitely go together very well. Even disregarding education for things other than career.\n\nI have a friend who worked in somewhat blue-collar job for a few years instead of going to a university when they could. They saved for buying an apartment. Then they switched careers to programming. They are doing as well as those who studied STEM in university. Definitely needed and had use in highschool education.", "NTA does she not realize that the average trash collector in the USA makes more than the average teacher?  Plus teachers basically get laid off for two months of the year which isn’t a concern for a trash collector.", "NTA.   \nMost effective Union action in history was by \"trash collectors\". Society, especially in cities, is effed without them.", "NTA, she’s just jealous because the trash collector (known as a sanitation engineer where I live) makes more than she does.", "NTA\n\nGreat assignment to get kids thinking and exploring, horrible response from the teacher. Teacher is definitely the AH.", "NTA.  Your son’s teacher sounds like a real piece of work.", "NTA.\n\nWhen you are able, print out the story on Wayne Huizenga, a self-made millionaire who started off as a trash collector. He started a company called Southern Sanitation Service and then Waste Management Inc. \n\nSend the story to the teacher and principal and remind them since they surely are old enough to remember that he also owned Blockbuster video, the Miami Dolphins football team, the Florida Marlins baseball team, and the Florida Panthers hockey team.\n\n\nIt all started with a dumpster truck.", "NTA.  \n\n\nThe assignment was to interview 3 different people with 3 different professions. Your son did that.   \n\n\nHe went even outside of the box and picked 3 completely different professions to explore similarities that people might not see. It's seriously classist to say that a garbage collector is something less.", "NTA, speaking as a highschool English teacher you were absolutely right. Nobody should be in education if they feel the need to validate themselves by undermining their students' goals and sense of social equity, but a depressing number of my ostensible colleagues seem to think being a teacher is just a way to rehash their own shitty school lives with the authority they wished they could abuse when they were kids.", "NTA Who ae they to demean the work of trash collectors? It's hard work and physical. Moreover if they weren't there the streets would be a at-filled mess. I hate how certain jobs are looked down on when others are lauded as acceptable. Thank God for people who clear up the trash.", "NTA - My Mum always told us growing up, she didn’t care if we turned out to be CEOs or Garbage Collectors as long as that’s the path we had chosen and not been forced into as a result of not trying. It’s not up to the teacher to dictate what is a worthy choice of career", "NTA - and if I was your kid I’d be proud of you for doing what you did.", "NTA. \n\nAnd she is incorrect in thinkig garbage collector is something people do because they have no education and have no other choice. \n\nAt least in my country, where there is overabundance of collage educated people, jobs like garbage collector are very well paid because not many people want to do it.\n\nHigh shool teachers (I am one) are paid less than is average garbage collector's salary. Good for them!", "Definitely NTA. I believe strongly in education, but it was abhorrent for the teacher to basically declare to the students that there is something wrong with being a trash collector. What a snob! It is hard, honest work, there is no shame in it! And what if one of the students' parents was a trash collector? What message would that teacher be giving to that kid? That they should be embarrassed by their parent?", "NTA. I hate that attitude from the teacher. As a teacher I do a few things regarding talk about careers. \n\n1. I say \"whether you end up working at McDonalds or as president of the world, which may exist when you grow up, or anywhere in between it doesn't matter\". \n\n2. I praise retail and service jobs as great first jobs, and how many people keep going back to them because they are decent, honest work. \n\n3. I praise McDonalds as a good employer. \n\n4. I always make reference to university, trade school, apprenticeship etc. I never talk badly about any of them. \n\nEssentially, I try and show the kids that can end up anywhere and none of it is invalid or unimportant.", "NTA and fuck anyone who looks down on blue collar/trade workers. They are essential and often well paid. I know someone who was literally on a waitlist for over a year for a sanitation job opening because the compensation and benefits were so good. Also, imagine if one of the students’ parents was a sanitation worker. That teacher would be shaming that students entire family.", "NTA\n\nMy uncle started out as a trash collector, did that job for many years before he got promoted (not sure what exactly his current position is called but he's now one of the guys who gets called to fix it if watermain breaks.) He's always made good money working for the city, and has good benefits. \n\nHe owns his own house and two cars while his wife is a stay at home wife and always has been, his job wasn't really affected by Covid, my cousin always had all kinds of activities like tae kwan do and stuff (things my own mother couldn't afford.) It's a good job that pays well and absolutely has opportunities to move up the ranks, there is absolutely nothing wrong with it.", "NTA - you did the right thing.", "NTA\n\nYou should've invited the city manager of refuse collection in on the conversation... They have to deal with their shit every day.. They'd defo have something to say about it", "NTA - as the saying goes \"the world needs ditch diggers too.\"  I know a garbage collector, he gets up early and drives and truck around all day, removing our rubbish, he earns a respectable wage for his efforts.  This teacher and principal are out of line.", "I’m in Scotland and our bin men went on strike. The mess was horrendous. This is one of the most important jobs. They keep streets clean and vermin away", "NTA, and thank you for having such respect for sanitation workers! In NYC they’ve acquired the moniker “New York’s Strongest,” and we all know exactly where we would be without them! And in fact, I’ve spoken to a number of our sanitation workers in my time who are clearly interesting, educated people, so this teacher was just so wrong on so many levels! Great concept for the assignment; too bad her follow through was so crappy!", "I feel like there is some missing context here. What exactly was the purpose of this assignment? For which subject\\class? What did the principal mean by \"education and trash collection do not exactly go hand in hand\"? I agree with others that you're NTA, but as a teacher I sometimes have parents totally misunderstand an assignment from their perspective.", "Same here in the south except the pay gap is much larger. Our middle school teachers barely make 36k in Florida while private trash collectors are earning upwards of 200k.", "NTA\nForgot to add that", "There's no financial action that prevents disease, trash collection and sewage maintenance are vital in that area.", "Last summer the binmen in my city went on strike and the local news couldn’t stop going on about how awful it was and how tourists were complaining. I didn’t go into the city centre because it was so gross but it piled up everywhere. It’s such an important necessary job, she shouldn’t belittle it. If no one became a garbage collector because teachers told them it was “beneath” them imagine the state of our towns and cities.", "I was coming here to say similar. I live in a city with a huge international festival that lasts a month. When our bin collectors think they've had a raw deal, that's when they strike. And then they generally get paid. Doing a manual job doesn't mean you're stupid, and these guys know the value of their work.", "I will give you a like for like that happened in my country. \nThe rubbish collectors went on strike at the same time as the finance sector. One lasted 6 weeks, needed the army to step in and had national outrage. The other had a 6 month talk process in which time the people created a barter and credit system THEMSELVES. We would be surrounded in our filth were it not for the wonderful men (all my rubbish collection people have been male) that get up at stupid am in all weathers to wheel around large plastic containers that stink like gone off cheese to make sure we have room to do it all again next week! They deserve good pay, excellent bonuses and great pensions.", "I agree. With her horrible attitude, this teacher is actively teaching the children to have contempt for blue collar jobs. I would be furious too, if I were OP - who is NTA.", "They absolutely deserve it! So do most blue collar workers, much more than many white collar workers with their ridiculous  salaries.", "I work as a plumber, i made fun of plumbers when i was in middle school because?.....gross right? Till i met a plumber and put him through school. It was beyond fascinating. I met my husband 8-9 years ago....also a plumber lol (yes jebus i got the hint lol).... And we opened a business together, He's the best teacher, and its the best job I've ever had. And don't let me start on the pay. Blue collar jobs keep the world spinning. I learned a deep soul felt respect for anyone with a \"less than desirable\" job.", "When I was a kid it was my dream job! I moved on and am now a dog trainer (also looked down on my my swanky private school but who gives)", "UK based - I didn't have the grades for uni or any idea what I wanted to study after sixth form. I went the apprenticeship route and 10 years later know what I want to do and luckily I can do the degree via work :) \n\nIt might not be the smoothest route but it's worked out in the end!", "You are absolutely right! You are obviously a nice person and she is an absolute snob and shouldn’t be teaching. Does she want to pick up her trash every day and take it to the garbage dump every single day. I don’t think so. They perform an honorable and healthy profession, healthy meaning, they get rid of debris, garbage that can bring vermin and such. This just gets my blood boiling. NTA. NTA. NTA.", "NTA\n\nNo teacher should ever discourage a child from any future that they want to explore. Squashing any kind of ambition or potential in a child is the opposite of what they are supposed to be doing. Not everyone can work in finance or medicine or law. Just imagine. Hideous world.\n\nHave a word with your garbage collector and find out if he can arrange for collection from the school to stop for a little while. Then we’ll see whose job is essential.", "NTA", "NTA many in education have a bias against blue collar workers, especially those who earn substantially more than teachers.", "This. I am a teacher as well and OP is definitely NTA", "> they’re just as important.\n\nThey're way more important.\n\nYou can shoot all the finance parasites and business consultants today and tomorrow the world keeps turning.\n\nBin men go on strike and your city goes to absolute shit in a week, to say nothing of other sanitation-related employees. I shudder to think of what happens if water treatment shuts down.", "I actually love that OP's son interviewed a trash collector, because they are so undervalued and so unseen but so vital to our society. Just because they get their hands dirty does not make their job disrespectable in any way. They are equally as noble a job as any others.\n\nThe teacher is definitely the AH, and the fact that the principle cannot understand that we should all be grateful to all the services rendered by our fellow people, including garbage collectors.", "Yep. It was a great project as this child took 3 completely different types of jobs to compare. And was able to find the similarities, got to see blue collar , white collar, and self employed how they compare. It was impressive that they went and chose such diverse and interesting jobs. And I love how they went to an important overlooked and forgotten job and treated those worker with respect. Horrible teacher to not see and praise such work and thought", "There's literally an episode of Arthur about being a trash collector.  Francine is embarrassed about her Dad's job and her class visits and learns all about it.\n\nLike this quite literally a topic in an educational child's cartoon.", "Sanitation workers are contact workers which would mean an annual based salary.", "NTA. I remember seeing a story somewhere about a hospital where the service workers, including janitors, went on strike. No one to clean surgical rooms, empty garbage cans, refill things. \n\nIt lasted for TWO HOURS before the hospital broke and gave them their demands. \n\nI think you've taught your son some very good lessons about respect and seeing the importance of all kinds of jobs. Kudos.", "It's happened in New York City before. It got pretty bad, and even after just a couple of days the smell was awful.", "There are two groups you should never disrespect: those who cook and/or handle your food and those that keep you from living in your own filth", "Don't disrespect the people who make your world function. You put that perfectly!"]}