{"id": 6172, "submission_id": "100govo", "title": "AITA for putting parental controls on my TV and royally pissing off my FIL?", "selftext": "I (M30's) live with my wife (F30's). We have two kids, M8 and F6.\n\nMy wife's parents are staying with us temporarily as their home is having some serious repairs after a freak accident. It wasn't their fault and luckily they had insurance. The repairs should be completed in two months from now.\n\nI don't really get along with my in-laws, especially my father-in-law, but I agreed to let them stay because I thought the time would fly by and it wouldn't be that bad, but I'm posting here so I guess I was wrong.\n\nMy MIL doesn't have a job and my FIL works late shifts until around 11pm. When he gets home they will watch YouTube in the living room and play music on it at a loud volume with our speaker system, it's not \"college house party bass tearing apart the walls\" loud but it is still loud.\n\nMy kids are not light sleepers but this wakes them up, then they go wake me up because they want me to make it stop. My kids need to be rested for school and I need to get up in the morning to drop them off and go to work.\n\nMy wife works overnight shifts so she doesn't witness this.\n\nI've tried to talk to my MIL and FIL about it and asked that they please keep the noise down after my kids' bed time which is 8:30pm. I don't expect complete silence but I really don't think they need to have the TV on loud late at night.\n\nMy FIL argued with me and said that he doesn't finish work til 11pm, so I'm basically expecting him to not do the things he enjoys after work. I told him he can do it before work or on his days off or it's tough shit.\n\nHe complained to my wife who's now taking his side and saying that the kids need to learn how to sleep through \"a bit of everyday noise\".\n\nI told her it's not everyday noise and that he and MIL are being excessively noisy and inconsiderate, she's just not there to see it. My FIL has been sending me links to buy earplugs for the kids.\n\nI've gotten really fed up with this. It's not my in-laws' house and they're staying with us as guests and I think they're being really selfish.\n\nI decided to put parental controls on the TV so that my in-laws can't use it after 8:30pm, until 6am the next day. Between those times the TV can't be used without putting in the password and only I know it. This doesn't affect my wife as she doesn't get off work until 6am and isn't normally home until 6:20ish.\n\nMy FIL is now incredibly pissed off with me and said that I'm acting like a child and keeps pestering me, demanding the password. My wife is also mad at me for upsetting her dad. \n\nI'm just so annoyed at this whole situation and I'm sick of hearing about it so I just want to know if I'm morally in the clear.", "created_utc": 1672567767, "permalink": "/r/AmItheAsshole/comments/100govo/aita_for_putting_parental_controls_on_my_tv_and/", "score": 549, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I put parental controls on my TV so that my in-laws can't use it late at night\n2. I didn't consult my wife before doing it, and now my FIL can't use the TV at all after he gets home from work and he's pissed. I could've bought earplugs for my kids but I decided to do this instead because I think my in-laws are being inconsiderate.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - it was a perfectly reasonable request which they threw back at you and left you no choice. If they don’t like it they can go stay in a hotel whilst the work is done. \n\nAlso what kind of grandparents think it’s ok to have the tv so loud that they are stopping their grandchildren getting proper sleep before school. They suck.", "NTA honestly though I would take it off just so you can get videos of proof then turn the controls back on lol", "NTA\n\nMIL, FIL, and wife are all ah's. Not only is your wife the ah for siding with her father, but for insinuating that her children basically need to suck it up. She should be advocating for her children. Your in laws can either follow the house rules or find somewhere else to stay.", "Be petty. Take the controls off and record how loud it is. Show your wife if she still disagrees, hide the remote.", "NTA - it's pretty selfish of your IL to disturb your kids sleep.\nIf they're hard of hearing (not that FIL is likely to admit to it), it might be a reason as to why he needs the tv up so loud. It might be a reasonable level to him, and only him. Perhaps investing in some headphones that pair to the TV, that he can control the volume on (but keep the household silent late in the evening) could be a good compromise?\nSomething to consider...", "One thing… we had a tree fall on our house and were out of the property for six months. Insurance paid our hotel and rent costs. Why isn’t insurance paying their costs? It’s included in most policies?", "**NTA**, they can either abide by the rules of your home or get another place to stay. It really is that simple in this case.", "NTA. Send your FIL links for headphones.", "NTA, but if they have insurance, can the insurance pay for alternate accommodation while their house is repaired? They can go somewhere else if so. \n\n(Or is keeping the accommodation money while disrupting your whole house part of their plan?)", "NTA - if they be respectful they don’t get to watch tv.    \nIf they have insurance it may pay for alternative accomodation ?     \nThey wouldn’t have to stay with you ?", "NTA. Your FIL in particular is acting like a childish, selfish,asshole! I can’t believe he has the audacity to expect you to house him while he has a complete disregard for your families health and sanity. Your wife is ridiculous for not backing you up. I’d record the noise they make for several nights and show it to your wife. If he doesn’t like your rules he could always stay somewhere else. You have to put your children and their welfare ahead of your in-laws and wife. Your FIL is aware that headphones and earbuds exist, right?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (M30's) live with my wife (F30's). We have two kids, M8 and F6.\n\nMy wife's parents are staying with us temporarily as their home is having some serious repairs after a freak accident. It wasn't their fault and luckily they had insurance. The repairs should be completed in two months from now.\n\nI don't really get along with my in-laws, especially my father-in-law, but I agreed to let them stay because I thought the time would fly by and it wouldn't be that bad, but I'm posting here so I guess I was wrong.\n\nMy MIL doesn't have a job and my FIL works late shifts until around 11pm. When he gets home they will watch YouTube in the living room and play music on it at a loud volume with our speaker system, it's \"not college house party bass tearing apart the walls\" loud but it is still loud.\n\nMy kids are not light sleepers but this wakes them up, then they go wake me up because they want me to make it stop. My kids need to be rested for school and I need to get up in the morning to drop them off and go to work.\n\nMy wife works overnight shifts so she doesn't witness this.\n\nI've tried to talk to my MIL and FIL about it and asked that they please keep the noise down after my kids' bed time which is 8:30pm. I don't expect complete silence but I really don't think they need to have the TV on loud late at night.\n\nMy FIL argued with me and said that he doesn't finish work til 11pm, so I'm basically expecting him to not do the things he enjoys after work. I told him he can do it before work or on his days off or it's tough shit.\n\nHe complained to my wife who's now taking his side and saying that the kids need to learn how to sleep through \"a bit of everyday noise\".\n\nI told her it's not everyday noise and that he and MIL are being excessively noisy and inconsiderate, she's just not there to see it. My FIL has been sending me links to buy earplugs for the kids.\n\nI've gotten really fed up with this. It's not my in-laws' house and they're staying with us as guests and I think they're being really selfish.\n\nI decided to put parental controls on the TV so that my in-laws can't use it after 8:30pm, until 6am the next day. Between those times the TV can't be used without putting in the password and only I know it. This doesn't affect my wife as she doesn't get off work until 6am and isn't normally home until 6:20ish.\n\nMy FIL is now incredibly pissed off with me and said that I'm acting like a child and keeps pestering me, demanding the password. My wife is also mad at me for upsetting her dad. \n\nI'm just so annoyed at this whole situation and I'm sick of hearing about it so I just want to know if I'm morally in the clear.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - They may be in-laws but they are guests within your home.\n\nYou've asked them politely before and they've ignored you.\n\nTell them to read a book to keep themselves entertained.", "Are they hard of hearing?\n\n Can they wear headphones while watching TV?", "NTA\n\nEveryone needs to make an effort to make a situation like this as easy as possible for everyone involved. That means being a considerate person. \nIt seems as though your in-laws never learned basic manners. \n\nYour kids basic needs trump your FIL's wanting to watch TV at a loud volume in the middle of the night. Constantly disrupted sleep is bad for everyone, but for younger kids it's even worse. The kids shouldn't have to wear ear plugs. Your in-laws could get headphones instead.\n\nSo, good for you for drawing a line. They seem to not understand it any other way. If they continue behaving the way they have, they can look for another place to stay.", " TA has your FIL not heard of subtitles?", "NTA it is your home, you have school age children who need rest. I worked nights at one time got home in the middle of the night for my family and it sucks. Now I’m a early riser before everyone else so here I sit with coffee and all of you. They can get tablets and headphones or ear buds like the rest of us. You could look into some for tv too. It’s not their home which sucks for them too but that’s just how it is when you work nights.", "NTA. Your in-laws are rude and inconsiderate, and your wife should be managing them and backing you up in this. Had she done so, you would not need to take such drastic measures. Both you and the kids need your sleep. The in-laws are guests in your home. This is wildly inappropriate for them to act this way. If they don’t like the house rules, they can go to a motel.", "As a parent it's your job, your duty, your responsibility, to ensure that your kids stay healthy and get the education they deserve.\n\nSleep deprivation is a torture method, bad for physical and mental health, and will wreck their education.\n\nBuy your ILs two pairs of headphones and be done with it. Or they need to leave.\n\nNTA.", "Why don't you just remove the speaker system temporarily? Completely disabling the TV between 8:30 and 6 is too much, YTA.", "NTA but excellent play my friend.", "NTA. Your in-laws sound very entitled and have a lot of nerve demanding things in you and your wife’s home. You’re already doing them a big favor letting them stay with you.\nI hope you and your wife can get on the same page with this, she really needs to be the one to take ownership of this issue since it is her family.", "NTA it sounds like you are being quite reasonable and you are doing them a huge favor by letting them stay with you.  Did he even attempt to get wireless headphones rather than trying to get his grandchildren to sleep with earplugs in their own house?", "NTA. \n\nWho the hell stays as a guest in someone's home, knowing they have young children, and expects them to be okay with them playing loud music all night?\n\nEven without the kids in the equation that's still unreasonable and wildly inappropriate but it just adds another layer of assholery.", "NTA- and my husband says \"give that man a cookie! That's a grand Master level move there!\" ( his MIL lived with us for 2 months so he also says \"I feel that man's pain...the time never flies\") Idk what it is with some parents thinking they can do whatever they want to their kids families. ..it just confuses me. Do they have their own room? Maybe suggest they get a TV for their room to watch in instead.", "NTA you are a Saint. The link to ear plugs would have had me sending links to hotel rooms back.", "NTA\n\nStart sending them links for headphones. If they want to listen to music they can play it through that.", "NTA but your wife sure does suck.", "Or just be exactly that loud when she’s sleeping, which should be fine as she does night shifts. \n\nI’m serious book a couple days off work - then just be loud and annoying like her parents. \n\nAnd then chide her about how she needs to sleep through some everyday noise.", "Exactly. I wonder if their insurance thinks it’s paying for accommodations and FIL/MIL are pocketing the money?", "They don't have any hearing issues that I'm aware of.\n\nOur TV can connect to Bluetooth headphones. I hadn't thought to suggest it for an alternative before, but I doubt they'll go for it. My FIL is always going off about how he thinks airpods and headphones look stupid.", "FIL seems the type who would just blast it from the built in speakers. Sometimes nuclear options are the only options.", "It wouldn’t help with the noise, it would be just as loud in the bedroom", "It wouldn’t surprise me.    \nPeople do it all the time.    \nI’d call the insurance company asking for a quote and ask if their insurance comes with emergency accommodation.", "Good news for him is nobody else but you and his wife are going to see him. You're not telling him to wear them out in public. Asking them to turn it down or wear headphones is more than fair.\nBtw they're probably reaching the age where being slightly hard of hearing wouldn't be noticable outside of this. It starts with the TV for a lot of people, but they won't admit it or might not even be aware how loud they need it to hear it without straining. They still need to be quieter though, waking up your kids is not okay.", "NTA - It is your home, they are your guests and need to respect your rules.\n\nPersonally I would have had them moved out and into a hotel by now. One thing I absolutely hate is somebody disturbing my sleep unnecessarily so I would have had them out of there after the first time they refused my rules.\n\nI love the pettiness of putting a parental lock on the TV... The fact its a parental lock and you're locking out the parents it's extra funny lol. \n\nYour wife is being an AH for not defending you and your children! It's not just affecting you, it's affecting the kids too and your wife doesn't seem to care.", "NTA.  You have the patience of several saints, but even your patience was tried by these inconsiderate entitled louts.  \n\n1.) Keep the controls on the TV.  Period.  Finished.  It's your house, you need sleep, and your wife just can't stand up to her awful parents.  She's wrong.\n\n2.) Ask to see your in-law's insurance policy.  It should cover a rental during repairs.  Help them find a rental.  Call an Uber.  They've been there way too long.\n\n3.) If your in-law's continue to bug you about this insufferably, whether or not their insurance covers housing, first have a talk with your wife explaining that you don't want them there any longer so you'll have a united front.  Then give them a date when they have to be out.  Let them stay with friends, or their other offspring, or wherever people enjoy being awakened by children who can't sleep due to blasting TV in the middle of the night.  \n\n4.) If your FIL didn't insist on watching LOUD TV and keeping his grandkids up all night, you wouldn't be \"upsetting\" him with your very reasonable preventive solution.  I admire your creativity and your backbone.", "NTA - It's you( and your wife's) house. You're kids should always be top priority in a family. It's not like you banned them from watching TV after 11 before parental controls. You just asked them to lower the noise. They obviously didn't respect you and this should teach them a lesson.", "NTA but is is a AH move. Why can’t your FIL wear earphones ? He could listen as loud as he want and your family won’t be affected", " NTA. I love your solution - it’s my kind of petty 🤣🤣", "NTA your house your rules", "NTA start sending him links for headphones", "Send FIL links for bluetooth headphones. NTA. What kind of grandparents don’t care that they are disrupting their young grandchildren’s sleep??", "Lolol NTA. You opened up your home to them and want your kids to sleep well. The FIL is making it all about him keeping his routine. \n\nWhat’s so funny is that he can just watch on his phone", "NTA. They can stay at a hotel if they want things their way. \n\nYour wife sucks for not actually listening to your side of things. Your kids shouldn’t suffer their sleep just because their grandfather is being a stubborn ass. \n\nShort term - what about white noise for the kids? And headphones for your in laws?\n\nCan you record how loud it gets and send it to your wife?", "NTA. It’s your home, your rules. Your children need rest ready for school and you do too with work. Like you say, a little bit of noise is going to be made, which is fair enough if it’s unintentional, but it’s massively inconsiderate and selfish of your in-laws to just disregard their hosts and their own grandchildren’s need for rest by having the TV and music at ridiculously loud levels so late at night. I understand it might be difficult for your wife as it’s her parents and her family, and she’s not there to see it, but she needs to do the right thing and tell her parents that their actions are having an effect on her family.", "NTA!  hope the 'inconvenience' motivates your AH incredibly entitled and ungrateful FIL the heck out of your house quick! He values HIS entertainment over your kids' sleep on top of it!", "NTA - it is unfortunate your wife is not supporting you and acting as a unified front.   Your IL's are crossing too many boundaries in your home where they aren't paying any rent and acting as if their needs are more important than those of young children and the family who live there", "NTA. Since your wife thinks her kids need to adjust to everyday noise; make sure you watch TV at the same volume when she gets to bed.", "NTA it’s pretty wild that your kids grandparents are so hell bent on keeping the kids awake at all hours.", "NTA. I’m bewildered that your wife actually took his side over her children getting a decent nights sleep. Like is she actually serious? The whole 3 of them sound like absolute peaches. If only you could set aloud shit to come on at the times they’re sleeping…..", "Baked your own parents and family or someone else will. Period", "NTA Their insurance should cover accomodations for them so they could go either to an apartment or a hotel.  The second option would be to put the TV back on but with volune control.  Third option is they could use headphones. These options are cooperative rather than the punitive option of completely offing the TV.", "NTA! But you have a wife problem too!", "Nta. The kids need their sleep. I used to work that same shift and come home around 11:40 pm. I would watch TV. But I put on closed captions and had the volume up just loud enough that I could hear it if I was sitting right in front of the TV. I never once woke up my children at night because I had to watch TV or listen to music.", "NTA.  Your house, your rules!", "What setting is the volume on when FIL is watching? Just play that to your wife and see if she thinks it's \"everyday noise\"\n\nYour FIL is a guest in your house and should learn to be mindful of others. He could have lowered the volume but he didn't. If he can't play nice with his toulys, they will be taken away from him", "Absolutely NTA.\n\nCompletely inconsiderate in-laws.\n\nKick them to the kerb, you still won’t be TA.", "NTA. Tell the in-laws to get a hotel if they want to watch tv loud enough to wake your kids. Your wife is Also TA for taking their side.", "NTA.\n\nIf they do not like the restrictions on the television tell them to go to a hotel which should be covered under their insurance policy as the home is uninhabitable.", "NTA. With your wife’s hours I can’t think of anything else. Obnoxious guests. Interrupting your sleep. Not as simple with kids in the middle as a mechanism for waking you up, but that’s about as complex as the issue needs to be. They can get fucked. You don’t give a crap about their pastimes. Simple as that. 👏", "nta fil could use earphones", "NTA", "NTA. Tell your in-laws if they can’t be gracious guests then they can pack their bags and stay in a hotel for two months or find other family or friends to stay with. That is so rude it’s your house not theirs!", "NTA, any “family” that cares nothing for your children’s education and well-being is not family. Your IL’s are selfish AHs and don’t deserve your hospitality.", "NTA your children’s needs come first. If they don’t like it, they can find different accommodations.", "NTA\n\nBut I do wonder, your FIL suggests your kids should wear earplugs (which lets face it, they would have to wear whilst sleeping, and that would not be safe in the event of a fire or something as it would restrict their ability to hear an alarm or shouts), have you ever suggested he wears headphones when he uses the TV?", "Start sending them links for TV headphones https://www.bestreviews.guide/tv-headset-for-seniors?origin=google&google_params%5Bmatchtype%5D=e&google_params%5Bnetwork%5D=g&google_params%5Bdevice%5D=m&google_params%5Bcreative%5D=575251926656&google_params%5Bkeyword%5D=tv%20headset%20for%20seniors&google_params%5Badposition%5D=&google_params%5Badgroupid%5D=132414256779&google_params%5Bcampaignid%5D=15892277211&bs=&google_params%5Bfeeditemid%5D=&google_params%5Btargetid%5D=kwd-925240728958&google_params%5Bloc_interest_ms%5D=&google_params%5Bloc_physical_ms%5D=9018942&google_params%5Bdevicemodel%5D=&google_params%5Btarget%5D=&dest=0&sys_id=0%7C942&&origin=google&google_params%5Bmatchtype%5D=e&google_params%5Bnetwork%5D=g&google_params%5Bdevice%5D=m&google_params%5Bcreative%5D=575251926656&google_params%5Bkeyword%5D=tv%20headset%20for%20seniors&google_params%5Badposition%5D=&google_params%5Badgroupid%5D=132414256779&google_params%5Bcampaignid%5D=15892277211&bs=&google_params%5Bfeeditemid%5D=&google_params%5Btargetid%5D=kwd-925240728958&google_params%5Bloc_interest_ms%5D=&google_params%5Bloc_physical_ms%5D=9018942&google_params%5Bdevicemodel%5D=&google_params%5Btarget%5D=&new_api=true&dest=0&sys_id=0%7C942&gclid=CjwKCAiA-8SdBhBGEiwAWdgtcA-DCwN6dcfKJIF3Hr48vD3M0ZiikC4fy_ffWQDhKTejha7TRR4UvhoC90oQAvD_BwE&gclsrc=aw.ds", "Headphones for Gramps is the compromise, nothing less. NTA", "NTA. As I’m sure the in-laws have said at one time or another “my house, my rules.”\n\nYou’re doing them a courtesy. Tell them to deal with it or get out.", "NTA.  They can plug headphones in and listen to YouTube on their phones.", "NTA, ur in the clear. It's very problematic if your wife doesn't support your decision....", "Blutooth headphones? Everyone wins? NTA but you’ve got to interact with these people for the rest of your marriage so might be a middle ground solution.", "NTA.  Tell your father-in-law that you're not acting like a child, but like a parent, hence the parental controls.  If he wants to use the TV, he can go buy some headphones.", "NTA. These sound like the type of people who would have been quick to tell by their own kids \"My house my rules\". \n\nMaking noise after 11 in a house with kids trying to sleep is incredibly inconsiderate.\n\nIf you want to be petty (don't recommend) send FIL links to headphones as a reply to his last link for ear plugs.", "NTA\n\nFIL is old enough to know he's being disrespectful to you and the kids. He's a guest and this is behavior unbecoming a guest.", "ESH because you both are childish. Your FIL should get some headphones.", "NTA \n\nBest of luck dealing with the 4 children you care for.", "I wonder what would be your wife's reaction if her in-laws are staying in the house and being rude like this. NTA.", "NTA\n\nHave rarely heard of such AHs as these 2.\n\nSorry you are have all this stress after giving them a temporary home.\n\n\nYou'd think FIL would care about his grandchildren even of he doesn't get on with you.", "Tell your wife that daddy doesn’t always get his way 🤷‍♂️ She is the equivalent of a mamas boy and is the biggest ah in this story for prioritizing his youtube time over her children’s sleep. NTA", "They are lucky, as I might consider taking the electricity off from that room if FIL kept going with it. NTA", "NTA They should be using headphones, not buying earplugs for the kids. It is your house, your rules and they should be more considerate as guests. People who mess with other people's sleep are always AH.", "NTA, but did you think of just having him get headphones?", "Obviously NTA if they are waking up the kids", "NTA\n\nIf your wife can't see it, maybe she should just take a day off without telling her parents and hide. I dunno. \n\nI wish you the best, if they hate your requests so much they can eff off to a hotel.", "NTA It's almost as if FIL has no access to modern smart phones with a data plan, and headphones/earbuds. Even Bluetooth headphones synced with the TV would be good alternative to playing the TV loudly after the children's bedtime.", "NTA. Your FIL is being very disrespectful in your house. Why can’t he get headphones? Your wife is also an AH for not having your back.", "SOLUTION - Buy them wireless headphones.", "NTA\nWhat kind of grandparents value you tube music over their grandchildren?? Children need to sleep it’s a vital part of their growth and overall health.\n\nYour wife should not be taking any side because she is not home to witness it. The fact your children wake you up and ask to make it stop should be enough for her. \n\nYour home, your children, your rules. Your in laws should go and find a hotel or air bnb. They are disrespectful as hell.", "NTA.  Nice move with the parental controls.  Lol", "NTA.\n\nLeaving work at 11pm he would be watching stuff at home past midnight. That is not a time ANYONE should “learn to sleep through some sounds”\n\nDon’t budge until  FIL use a headphone.\nThen he can watch whatever as loud as he wants.", "NTA\n\nThe audacity to behave like this when they are guests. Keeping their own grandchildren awake!\n\nThey’re assholes big time.", "NTA. This is brilliant and if they don’t like it, they can find somewhere else to be.", "NTA. Your wife needs to tell her parents they need to go. Insurance is probably providing a stipend for a hotel stay, they should use that instead.", "NTA rather than getting your kids earplugs I would tell FIL he can have the password when he buys and actually uses headphones if he cannot hear the TV  at a reasonable volume", "Wife problem!", "NTA. You need to discuss this with your wife again though bcuz you are absolutely right and you guys need to be on the same page with this.", "I think you can also do something with your internet router so that traffic hosted by YouTube comes through at an unwatchable trickle speed.", "ESH - they're undoubtedly i the wring but i feel you could have handled it better, maybe reply back with headphones", "Just get some Bluetooth headphones and set the TV up so your father can watch with headphones. There are always some on offer in Amazon that are not expensive.\nIt's what we do and it works well.\n\nInstead of arguing ( even though you are NTA in this), find a solution that works for everyone. You are a little TA for not just getting headphones.", "I wonder if FIL/MIL steamrolled wife so much growing up that she has a hard time setting boundaries with them.  You are correct either way, but every time I see someone rolling over for their parents in posts like this, I have to wonder if that's what's going on because the ILs are obviously in the wrong.", "If they had insurance it would pay for them to stay at a motel or hotel. I wonder why the hell they don't.", "I agree OP is NTA, but just wanted to add a few possible solutions. \n\nIf FIL really wants to watch something after work, can't he use ear phones?\n\nAnd if your wife doesn't think it's so loud, record it and let her listen to it.", "NTA it sounds like you are being quite reasonable and you are doing them a huge favor by letting them stay with you.", "Be petty. Take the controls off and record how loud it is.", "Invite  your in laws  to move out somewhere  where they pay and such have all the freedom to do what they want without  disturbing your family.  Nta  they and wife are huge ones.  \n\nPs you should  record the volume  on the phone  from diffrent  rooms (how your fil used to)  and play it to your wife. She might be mistakenly thinking  that it's  not that loud.", "Sleep deprivation is a torture method, bad for physical and mental health, and will wreck their education.", "> ...and your wife should be managing them and backing you up in this\n\nI think part of problem is that OP doesn't get along with his in laws. We don't know the full situation, but if OP always has a complaint about the ILs or argues with them a lot then people will tend to think any complaints are because he doesn't like them.\n\nI understand why others might think he's the boy who cried wolf because he doesn't get along with the ILs, but I believe OP. With FILs comments about being able to do what he wants when he gets home after 11pm because he shouldn't be penalized for an evening job, OP is NTA here.\n\nOP, I know others have said to record when they do it but volume won't come across well. Buy a sound meter for like $20. Take a video of *that* when they're playing their music. Then show it to your wife and play music at the same volume to show her what it's like. (And if she says it isn't bad, you can always go scorched earth and play it that loud when she sleeps.)", "NTA. They denied Op's request, which was perfectly reasonable, leaving you with no choice.", "What kind of grandparents don’t care that they are disrupting their young grandchildren’s sleep?", "Hotels, headphones, articles about the impact of sleep deprivation have on children development...", "Or is there some reason FIL can’t wear headphones?", "Personally would rather read a good book than watch YouTube. \n\nAlso NTA OP. Your house your rules plus you are looking out for your kids. Fil needs to grow up, if he wants to watch YouTube them watch on his phone or keep the volume down (although I'm wondering if he has hearing issues if the volume is being put up so high)", " The fact its a parental lock and you're locking out the parents it's extra funny lol. NTA.", "NTA.  Your FIL's are crossing too many boundaries in your home where they aren't paying any rent and acting as if their needs are more important than", "Aye, make sure insurance pays you for their stay, st least get some benefit", "She knows how loud it is, because she lives there as well. She just doesn’t care because it’s her parents.", "Lol, I’m just imagining FIL giving the hotel person that knocks and asks to keep the noise down because there are complaints a link to buy ear plugs for the other guests!", "He shouldn't have to rearrange his home just so he and his kids can get some sleep.\n\nThe in laws are grown adults acting like spoilt and entitled children.", "You've asked them politely before and they've ignored you.", "Buy your ILs two pairs of headphones and be done with it. Or they need to leave.\n\nNTA.", "I was going to say the same thing.  2 months or better is a long time, their insurance should have covered the cost of a short term residential accommodations.  They would likely be able to get a small furnished apartment like businesses people stay in when sent on a multi-week/ month assignment.", "They're probably commiting insurance fraud by pocketing the money meant for accodmarions", "NTA I was just coming here to say THIS!", "I was surprised not to see any top comments here suggesting divorce,", "I agree but will say that recordings of \"noise\" are very difficult to make representative. Usually they don't do a good job of representing the real life noise level.", "Honestly her own kids voicing the discomfort should be enough; sure OP and FIL don't get along but there's no bias with the little ones... she's their mom, she should advocate for them like their dad is doing.", " Take the controls off and record how loud it is.", "Selfish, inconsiderate and immature grandparents.", "Really selfish ones. They sound like my paternal grandparents. NTA OP.", "I think they're watching YouTube on the tv, not on their phones. But headphones was my first thought too! Why send links for earplugs for the kids, when the obvious solution is to use headphones for yourself?", "I was surprised not to see any top comments here suggesting divorce, but your comment will suffice as a way to quickly get there.", "Might help if MIL has to listen to full blast Youtube at 12am in the same room. But my 1st reaction was: Jesus. Its like no ones heard of headphones.", "Agree to a volume lvl and have them used closed captions if they can’t 100% hear it- it’s what we do when my ILs visit and we keep the volume low because our little one goes to bed at 6:30. If they can’t do that then, tough… you will have offered several compromises.", "I’d tell him if you want to sit out there and watch tv that is the only choice.", "Don’t buy them text the FIL the link to buy them like he did with the earplugs", "This the way! Excellent suggestion!", "IANAL but I do remember reading on another post a long time ago taking the money for temp housing from insurance but pocketing it while staying with family or friends is actually insurance fraud.   Don’t take my word bc I’m just repeating what I read.   But if they are getting money for accommodations and aren’t using that money appropriately it could spell trouble.   \n\nSo between that possibility and their desire to be loud at night maybe a short term apartment rental would be the best option.", "Very unusual for this sub...\n\nI'll just add it here. OP should definitely divorce his wife over this and demand full custody, because obviously they can't sleep with her around and it's abuse. Falling that, OP should just eliminate her some other way. (/j, hopefully that was obvious)", "Bad comment stealing bot. Report this as spam -> harmful bots\n\nOriginal: https://www.reddit.com/r/AmItheAsshole/comments/100govo/comment/j2hplbk/", "Yes! This way, your wife can no longer deny it.", "TVs also use headphones.  FiL should buy a new TV and Bluetooth headphones if current TV can't accommodate them.\n\nNTA.", "I mean, we have a Bluetooth soundbar connected to our TV. So ... Depending on the TV, you could probably connect Bluetooth headphones to them. Or, if your TV is old enough, it probably still has an audio jack, so you just need a cable that's long enough. :D ... And headphones that still use a cable.", "You can still use headphones on your tv", "Perhaps the actual problem is allowing your parents to disrespect your kids and husband, overstay their welcome and invalidate your partners feelings. Not to mention the educational impact from having nackered kids in school for a prolonged time. \n\nRather than you know, a bit of pettiness to show her exactly what an ass she’s being and what she is doing to her family.\n\nHell he tried talking to her repeatedly, he’s been very reasonable. Now he’s looking controlling over the password; it’s kicking up a storm with the Entitled In laws -  I really think it’s just easier to show your wife what she expects you and the kids to go through every night, and then let her deal with her parents.", "Agree. Did you know that Samsung TV volume goes up to 100? Ask me how I know. \n\nMy FIL would fall asleep watching TV at that level. I would sustain hearing loss getting close enough to turn it off."]}