{"id": 6177, "submission_id": "100g9w7", "title": "AITA for telling my SIL to stop pretending to get pregnant at family gatherings?", "selftext": "My (23F) SIL(26F) keeps on pretending to be pregnant and announcing it at family get togethers. The first time she did it everyone got pretty excited when she told us because her and my brother(27M) had been trying for 2 years straight. And as you may guess SIL thought it was hilarious and started doing it at all of the family gatherings.\nAfter months of getting this joke at our family gatherings we all stopped reacting to it.\nBut then at one of our family Christmas party’s she called everyone into the dinning room and announced that she was pregnant again, by this time i was really annoyed at her and pulled her aside and yelled at her for toying with the family’s emotions. \nWhen i finished she burst into tears and ran to the bathroom.\nTurns out she apparently was pregnant this time and she thought that telling everyone at an actual family event people would take it seriously.\nNow everybody is calling and texting me calling me heartless and the book of names and “how could i yell at a pregnant women, and calling me an asshole, so AITA?", "created_utc": 1672565892, "permalink": "/r/AmItheAsshole/comments/100g9w7/aita_for_telling_my_sil_to_stop_pretending_to_get/", "score": 159, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1)I yelled at a hormonal pregnant woman \n(2) She did nothing wrong to me yet i initiated the argument and made her cry\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  Send everyone a copy of The Boy Who Cried Wolf.", "NTA. She cried wolf for funsies, and now is surprised that you didn't take her seriously? That's ridiculous. How were you supposed to know it was serious and not just more goofy jokes that aren't even funny?", "NTA. She is the one who pretended to be pregnant more than once as a joke.", "NTA. She shouldn't have cried wolf so many times.", "NTA\n\nEveryone and their mother is going to refer to a certain story from when we were kids. She very clearly didn't get it or never read the story. Either way, when you make repeated \"jokes\" people are going to stop paying attention. Quite honestly, that shit ain't even funny in the first place.", "NTA. You should all do it at every family gathering, men included.", "NTA, she’s an idiot. What does she expect?", "NTA. She brought this on herself.", "Based on the history of boy who cried wolf, fool me once kinda thing. Nta , she shouldn't have joked about that in the past", "NTA. She kind of did that to herself.", "NTA\n\nEven reading this, I expected it to be another joke. That's her doing not yours.", "If you want people to believe you about something important, then don't make a habit of lying about important things.\n\nNTA, you pulled her aside and didn't do it in front of everyone. That's pretty much the most a liar can ever hope for when people stop believing their lies.\n\nSerious advise for any other liars out there. Own your shit. Acknowledge and apologize for lying and insist this time is real. If it's not real though, expect never to be believed again.", "YTA.  I know people will disagree with me on that.  But let's say SIL is in the habit of randomly announcing pregnancy when she's not pregnant?  Who does that hurt?  The whole family was used to it, to the point where it didn't bother them.  It might  be an annoying thing to do, but the family was used to those shenanigans.\n\nSo come Christmas, you think she's pulling the same shit.  So what?  If she's bluffing again...no harm, no foul.  No need to get all up in her grill for being stupid.  If she's not bluffing, nobody will believe her at this point.  But it's not your problem.\n\nYTA not for what you did, but because it was not necessary, and so it just caused unnecessary drama.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (23F) SIL(26F) keeps on pretending to be pregnant and announcing it at family get togethers. The first time she did it everyone got pretty excited when she told us because her and my brother(27M) had been trying for 2 years straight. And as you may guess SIL thought it was hilarious and started doing it at all of the family gatherings.\nAfter months of getting this joke at our family gatherings we all stopped reacting to it.\nBut then at one of our family Christmas party’s she called everyone into the dinning room and announced that she was pregnant again, by this time i was really annoyed at her and pulled her aside and yelled at her for toying with the family’s emotions. \nWhen i finished she burst into tears and ran to the bathroom.\nTurns out she apparently was pregnant this time and she thought that telling everyone at an actual family event people would take it seriously.\nNow everybody is calling and texting me calling me heartless and the book of names and “how could i yell at a pregnant women, and calling me an asshole, so AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA that’s what happens when you repeatedly tell the same lie or as she thought joke. No one else believed her either you just spoke up. They all feel guilty about not believing her this time too.", "Next time you do something stupid, and you get a public, verbal beat-down, remember your SIL. Celebrate in public, critique in private. YTA", "YTA\nIt's been happening for months. You were annoyed by it, yet you did not talk to her. You expect her to know you are fed up with it. How would she know? You hide it from her. Then you snap. Whether she was really pregnant is not relevant. You would also be TA were she not pregnant.\n\nEdit: I feel a lot of the responses are based on the title and body alone. OP explicitly states SIL did nothing wrong to him yet he yelled at her until she cried. \n\n>OP has offered the following explanation for why they think they might be the asshole:\n\n>(1)I yelled at a hormonal pregnant woman \n>(2) She did nothing wrong to me yet i initiated the argument and made her cry", "> After months of getting this joke at our family gatherings we all stopped reacting to it.\n\nMild ESH. Since everyone stopped reacting to it, there was no point in making a scene. \n\nAnd the people telling you “how could i yell at a pregnant women\" seem to have forgotten that you couldn't have known that she was really pregnant *this time*.", "The whole family stopped caring, except OP. It happened over months, more than enough time to talk to her in a normal way. Absolutely a dick move to wait untill you snap.\n\nYou also misread. She is not a potential asshole for not taking it seriously. She is a potential asshole for yelling at her instead of taking one of the many opportunities to talk to her in a civil way.\n\nEdit: corrected gender", "A baby.", "I agree with this", "NTA - Nobody ever told her the story of Peter and the Wolf / The Boy Who Cried Wolf?", "Tell her about Ussop and the boy who cried Pirate.", "Why is she announcing it and not your brother?", "NTA cut her out of your life", "Wait a few weeks - she's probably pretending this time, too.\n\nNTA, obviously.", "Nta, that said are you even sure that she actually is pregnant?", "Nta", "NTA. What the hell is her damage?", "NTA\n\nHow the hell were you supposed to know that this time is no joke?! It's on her for joking about something serious numerous times...", "NTA - karma", "ESH\n\nShe wanted attention but this should have been stopped before it reached this point.", "Nta , she shouldn't have joked about that in the past", "Nta , she shouldn't have joked about that in the past", "SIL has issues.  Announcing fake pregnancies at family gatherings is not a \"joke\", it's weird.\n\nNTA.", "I came here to say that “the girl who cried wolf” can’t complain she she get called on it. \n\nNTA", " If it's not real though, expect never to be believed again.", "“The woman who cried baby”", "They all feel guilty about not believing her this time too.", "NTA that’s what happens when you repeatedly tell the same lie or as she thought joke.", "How would she know? Common fucking sense", "What’s even more of a dick move is to keep messing with people’s emotions for your own shits and giggles, and to keep doing the weird, unfunny thing even when people have made it very clear - by ignoring you and not laughing - that it’s not welcome.\n\nIf you do things that upset people and don’t take their cues to stop, you have no standing to be upset when someone finally escalates to something you can’t avoid noticing.", "OP is female.", "Or…\n\nDid she? (͡•_ ͡• )", "Healthy adults don't crop up annoyances until yelling is the only way out. She has a bad sense of humor, so what? If there is no immediate harm, there is no need for yelling.\n\nIf op also stated that she has been asked to stop and she's continuing just to be annoying, then it would be different. SIL could also be an AH, but there is not enough context to conclude that.\n\nPlus a dishonest title. If op wants to know if he's TA for yelling, he should put that in the title. \"Telling SIL to stop\" is what he should have done instead of yelling.", "Corrected, thank you"]}