{"id": 6191, "submission_id": "100ilh1", "title": "AITA for caring more about my kids than money?", "selftext": "My wife is currently pregnant. We live in a three bedroom home that is already cramped. My nine year old has his own room. Our three year old daughter and two year old son share a room. If we sell our house we will make around 75k after the mortgage is paid off. If we buy a five bedroom house and use the 75k for the down payment (we have enough in savings for closing costs) we will be paying a little less than 4k a month on the mortgage, which is double what we are paying now, but we make enough money to get approved for that mortgage.\n\nMy wife thinks the 4k a month mortgage is too much, even though we make enough money to afford it. Not to mention, we can refinance when mortgage rates go down and get rid of the private mortgage insurance, which will make it lower. My wife wants to buy a four bedroom house, and when the baby gets old enough to not be in our room anymore, put them with either our daughter or younger son, depending on gender. Then, when my oldest son turns 18, all the younger kids will get their own room.\n\nI see many problems with this. 1) what if my son doesn't move out at 18. 2) That would mean our daughter would have to share a room until she is 12 or our younger son until he is 11, even if my son moves out at 18. 3) Whichever of the younger kids has to share a room will feel they got the short end of the stick and be mad at the other, especially if it is our daughter who is a year older. I told my wife our kids are more important than money and we can afford the bigger house so we should get it.\n\nMy wife said I am an asshole for \"trying to take the moral high ground with her\" when we have no idea what might happen in the future. She said it is pointless to buy a house where each kid gets their own room when one will be moving out in nine years. Nine years is a long time! And what about when he visits? Where will he stay? I am thinking about the future, and she is just thinking about money.\n\nMy wife said I am being an unreasonable asshole, but am I?", "created_utc": 1672575940, "permalink": "/r/AmItheAsshole/comments/100ilh1/aita_for_caring_more_about_my_kids_than_money/", "score": 37, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am insisting we buy a larger house, even though my wife says I am being irresponsible. I might be the asshole, because I implied I care more about the kids than her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Info - why on earth would she think your son would be moving out at 18? That’s not the norm these days. Even if he goes away to college for 4 years, there’s still multiple breaks he’d have to come home for. Does she plan on kicking him out at 18?", "ESH\n\nA lot of people say NAH, but I think the way you're arguing about it crosses the line a bit to ESH.\n\nYou're think you're putting the kids before money. But your wife is concerned that if something bad happened (like you both got laid off in a recession), you wouldn't be able to afford the bigger house and you'd lose it. That is _also_ a valid concern focused on the well-being of the kids.\n\nI don't know your finances, so I can't say if one of you is overly optimistic or pessimistic. But you may want to bring in a neutral third party like a marriage counselor and/or financial advisor to help you sort this out. Right now you're just talking past each other, each thinking you're making a logical argument but really both coming from a very emotional place.", "INFO: can you instead of going for a 5 bedroom house go for a 4 bedroom house that either has an attic or a basement that can be remodelled or the idea what I wrote below\n\nI dont think anyone is an AH here, but I think financially your wife is more reasonable, 9 years is a long time but at the same time it isnt, especially for the younger kids and you can do a lot of things to make the room sharing a positive thing\n\nThe sharers get the biggest bedroom (minus the parents bedroom) you can use dividers to create a sense of separate rooms, each side can have their own decorations etc", "NAH\n\nI mean, I don't think anyone is being unreasonable, she has her points, you have yours. imo, every child should be have their own room and if you can afford it, why not? You can always sell the house in the future if it becomes too much", "NAH but this isnt something you need reddit for", "Info: is it realistic for an 18yo to move out on their birthday (or close to it). \n\nMaybe I'm old or too working class family if origin, but half my classmates had to share a bedroom and it wasn't seen as intrinsicallt damaging.", "INFO: what percent of your income would this $4000 mortgage be? Because if you are going to be overextended on that, I can see where she is coming from, especially if you don't have savings or retirement accounts", "Soft YTA for implying that you care more about your kids than your wife just because she doesn't agree with your plan. You both have your points and the kids aren't going to suffer by sharing a room. Most children around the world don't have their own bedroom. Find a financial advisor, not Reddit.", "NAH. A person doesn’t need to provide every child with their own bedroom to demonstrate that they care about them more than money. False dichotomy.", "NAH but if you got the bigger house would you be “house poor?” Someone should only be spending 30% of their income on their dwelling utilities and maintenance included.", "Both not the asshole. You obviously both care for your family just in other ways. I get that she wants to be carefull with money especially if u have 3 kids and i get that you want your kids to have their own rooms. Just talk it out.", "Slight YTA. It’s understandable why your wife would be concerned with doubling your mortgage when you’re about to have another baby, even if you can afford it on paper. Plenty of children share rooms with their siblings, it’s really not a big deal. I wouldn’t say your wife is putting money before your children, that’s a little extreme.", "YTA. I think you’re being wildly irresponsible with finances. Committing to DOUBLE what you’re now paying monthly is a huge risk. \n\nWhat it one or both of you are laid off, become disabled, or worst case scenario, dies? Would you or your wife be able to support those expenses on a single income?\n\nYour wife is right to be conservative at this point in time. You can always size up as your family and finances grow or adapt.\n\nAt some point ALL your children will leave and start their own families in their own homes. Think about the house you and your wife would like to retire in and consider the timeline in which you’d be done paying for the house vs how many children would actually still be living with you in 18 years (if you don’t plan on having more children)\n\nI think 4 bedroom is adequate for the size of your family and the ages of your children. The two youngest can share until the oldest is in their twenties if necessary and know they’ll have their own bedroom when oldest moves / get married / have their own home", "YTA - banks will always approve you for a higher mortgage than what you can actually afford. Your mortgage and utilities should target about 1/3 of your combined take-home income. What percentage is a $4000 mortgage plus utilities on a much larger house?", "NTA. You‘re not looking to be irresponsible with money and you’re trying to do your best for your kids.\n\nIs there any chance your wife is thinking about working less or not at all or at least wants the option? Do either of you work in businesses prone to layoffs or other job insecurity?\n\nThe moving out in 9 years argument is ridiculous. 9 years is a long time in the life of a kid. If you eventually find yourselves with too much house, you can downsize.\n\nBut I do want to point out that I have known plenty of families where some kids shared rooms and some didn’t, based on age and gender combinations and it’s been fine. Sure, some of them are happy when they can get their own room, but I’ve heard of situations like the ones you fear. I’m not saying it never happens, but this\n\n>Whichever of the younger kids has to share a room will feel they got the short end of the stick and be mad at the other\n\nisn’t necessarily so.", "Maybe another compromise would be a longer commute to work. A lower cost of living area where you both get the house you want.", "YTA - not a huge asshole, but I think you are taking the moral high ground.\n\nChildren will not suffer if they share a bedroom, especially when they’re younger. You’re making a lot of assumptions about how mad your children will be a decade from now or how much of a sacrifice sharing a room is for them in the future. You have no way of knowing this. Personally, I shared a room with my sibling until I was around 12 and loved it.\n\nIt is also a huge financial change to take on a mortgage double your current one, even if you can “technically afford it”. We’re entering a more unsure financial time, a new child will bring extra expenses, etc. Maybe it isn’t a huge burden, but given your wife’s opinion, it seems like a financial stretch that’s risky. Ending up housepoor just so your young kids can have their own rooms is a bad situation.", "I wouldn't go so far as YTA but I am with your wife. Just because you can afford something doesn't mean you should buy it.", "What you can potentially buy and what you can really afford are very different things. Your kids won’t feel deprived unless you educate them to have an expectation of a private room. Let them share for a few more years and save your money for - oh, I don’t know- college???? YTA", "ESH. Your wife is  a little naive if she thinks her teenage kids will be happy to share rooms forever - even though I know this is common in many households. \n\nBut you, by far, are the bigger AH. You’re basing your ability to pay off the mortgage based on current earning potential. What if one of you get laid off, or for whatever reason your earning capacity is reduced, what happens to your mortgage payments. It’s great that you want to do more for you children but it is wildly irresponsible to spend more than both of you are comfortable with. Money isn’t unimportant in ensuring the security and happiness of your children.", "Dude, your wife doesn't like your kid. That's what this is about.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife is currently pregnant. We live in a three bedroom home that is already cramped. My nine year old has his own room. Our three year old daughter and two year old son share a room. If we sell our house we will make around 75k after the mortgage is paid off. If we buy a five bedroom house and use the 75k for the down payment (we have enough in savings for closing costs) we will be paying a little less than 4k a month on the mortgage, which is double what we are paying now, but we make enough money to get approved for that mortgage.\n\nMy wife thinks the 4k a month mortgage is too much, even though we make enough money to afford it. Not to mention, we can refinance when mortgage rates go down and get rid of the private mortgage insurance, which will make it lower. My wife wants to buy a four bedroom house, and when the baby gets old enough to not be in our room anymore, put them with either our daughter or younger son, depending on gender. Then, when my oldest son turns 18, all the younger kids will get their own room.\n\nI see many problems with this. 1) what if my son doesn't move out at 18. 2) That would mean our daughter would have to share a room until she is 12 or our younger son until he is 11, even if my son moves out at 18. 3) Whichever of the younger kids has to share a room will feel they got the short end of the stick and be mad at the other, especially if it is our daughter who is a year older. I told my wife our kids are more important than money and we can afford the bigger house so we should get it.\n\nMy wife said I am an asshole for \"trying to take the moral high ground with her\" when we have no idea what might happen in the future. She said it is pointless to buy a house where each kid gets their own room when one will be moving out in nine years. Nine years is a long time! And what about when he visits? Where will he stay? I am thinking about the future, and she is just thinking about money.\n\nMy wife said I am being an unreasonable asshole, but am I?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: how did you conduct this talk? This isnt really about whether or not youre an asshole for wanting more space, and shes not an asshole for being fiscally conscious- which isnt “putting money before your kids”. Thats just the reality of life. Everything costs money.\n\nThis is where Im seeing the problem- Im wondering how many of these conversations youve had. Your points for space for the kids are valid, but so are hers- kids bunk up and your family isnt “less than” if thats what you have to do. So has this been a contentious point and has it been badgering, or did you just throw out decisions without consulting? How hard are you pushing?\n\nOther thing to think about is you might afford more space but then what will you not afford as a result? Theres always a cost. Do you think your kids would rather be able to say they had their own rooms growing up or talk about experiences you paid for at the cost of them sharing space with a sibling?\n\nI might lean away from your perspective, but holding it doesnt make you an AH.", "NAH - you’re both passionate about your thoughts on this. I think it’s normal for her to be scared about financial stability with a family that is growing in size, while you’re worried about the overall quality of their childhood. Keep discussing this with her, maybe get your children in the conversation too and have them weigh in on if they’d prefer their own room or share. Be transparent with them. Sometimes they might surprise you.", "NAH\n\nYou two simply have different ideas about what you want in a house.\n\nI personally opted to buy a cheaper house and have kids share rooms so the extra money could be used for other things, like memberships to museums, vacations, etc. I couldn't have predicted that I'd get divorced, that my older son and his gf would need a place to live, that the pandemic would keep my older daughter from moving out, etc. Having the kids being used to sharing rooms helped us navigate those issues more easily.", "NAH - Getting approved for a mortgage does not mean it is a good decision. Increasing stress in your life do to being house poor is a heavy load; every week. This is a quality of life discussion and you both have opposing views on what would be more enriching; another bedroom or avoiding financial stress.", "YTA.  Why is everyone acting like the only solutions are to buy another house or stay in this own forever?  Extending yourself too far in this economy to buy a house seems like a terrible idea - $75k is not enough to keep your equity afloat if rates continue to increase. It seems like you’re saving at least $2k for each month you wait.\n\nWhy not:\n   - Wait for an opportunistic foreclosure?\n   - Put an addition on your current house?\n   - Convert an existing room into a bedroom?\n   - Take on extra work to build your savings more quickly so you can afford a bigger down payment?", "Why would you expect a daughter and a son over a certain age to still be sharing a room. That's when then daughter gets the smallest room and the boys share. \n\n\nYou both wanted this many children, you both need to find out how to house them. Perhaps wife will be willing to take the smallest room then so that the kids can have sufficient space.", "NTA- Your wife see your son as a nuisance. Be very clear with her that he is not feel pressured  to levar home at 18 and he'll always have a home in your house. Watch out for the way she interacts with him. Your other children have two parents looking out for them, your oldest has only one. Cut that crap now before It gets worse and in the way of your relationship with your son.", "I have a friend with four children. Three bedroom house. They make good money. The boys share a room. The girls with a ten year age gap share a room. I bought a house with a basement. Had a bedroom made in the basement. All three of my girls shared a room with TRIPLE bunks for two years. Now with the basement bedroom house, each girl has their own room. My point is that people can make their situation work if they just try. You might think you can afford doubling your mortgage but you will be very surprised how difficult that is. Suddenly, there just isn’t as much money for vacations, eating out, buying little items, household repairs, etc. Financial strain is extremely stressful on relationships. Think about your options. Try to think outside the box. Can you find a house with a basement, attic, garage, porch, or bonus room that can be converted? Look around at your options. Don’t overextend yourself on finances. Edited to add: ESH", "NAH you both have valid points, maybe you should buy a bigger house in a few years?", "Esh only because you are not both really planning together. My parents tried to teach a simple rule. Can you afford it alone? Yeah I get that your married and have two incomes but with no way of knowing what the future could bring you should always ask that question with a house buying. If you or your partner can not pay half for some reason or another then can the other take care of everything by themself for a while. Only reason to not ask yourself that question is if you buy outright so no mortgage or anything of the sort.", "NTA. Bit of a red flag there that your wife definitely wants the oldest out at 18 and expects them to be. Also, it's rude to the other kids If it's possible for you to afford it. Plus, it basically means no more kids unless you wanna be right back in this situation again.", "Ugh as someone who was forced to share a room with my younger sister for 7 years (until I moved out)- please don’t do this. We fought non stop, and we don’t like each other now (10 years after the fact). I never had space to decompress, have privacy, or have a safe place to put my belongings (journals, diaries, sentimental items, etc) EVERYTHING I owned felt shared like I couldn’t have anything to myself, even being a few years older. Of course it won’t kill them to share a room, and sometimes there’s no other options, but if you could avoid having them share, why wouldn’t you? NTA.", "I know a few families who - once a kid goes to school or IF they move out - split up two kids that are sharing. The older sibling shares a room when they visit.\n\nObviously that’s only for kids once they move out, but OPs wife also said they can’t predict the future so it’s not like she’s making set in stone plans.", "this right here.", "This right here. Money is a huge stress on any marriage. This isn’t just about a single decision. That decision can affect many more moving forward. This isn’t about who is right, this is about working together to make the best decisions for your family in the long term.", "My sister and I shared a room as kids. We hated each other. Like just vile, seething contempt. When my older sis moved out, and my younger sister moved into that bedroom, we stopped hating each other and became best friends. Sharing a room can be incredibly detrimental to the relationship between siblings if they don't actively want to share.", "Personal Finance Reddit can answer this one. He'll have to talk Budget instead of A-holes. What does OPs monthly budget look like? Wife is worried house will be a curse not a blessing.", "Well that's part of the dispute. I don't think it's realistic. He is only nine. Who knows what his future plans will be?", "I just keep thinking about how much college tuition he's going to have to pay, or the loans he's going to have to cosign.  He'll have 3 kids in college at the same time, most likely paying at least $20k annually for each.  \n\nHaving a separate bedroom is nice. But what's even nicer is starting your adult life without a mountain of debt.", "Is the wife not also making some major assumptions presuming that an 18yr old is moving out in a world where that is increasingly rare? I dont think he’s an asshole for having differing opinions that arent based solely on money.", "So you dont think children deserves their own rooms?\n\nIts fairly common that kids live at home longer than the second they turn 18, might still stay at multiple years more", "how the fuck did you get that from this post?", "It's an ongoing conversation that began shortly after finding out about her pregnancy and is being discussed frequently and has just become contentious because neither of us like the ideas of the other.", "The way he positioned it, it sounds like in her head she has it set in stone in her head that he would be be moving out in 9 years. “Is pointless to buy a house where each kid gets their own room and one will be moving out in 9 years”.\n\nThere’s also nothing wrong with having a guest room/ home office space either for when he does move out eventually, which is unlikely to be at 18. Sounds like they’re cramped already in a 3 bedroom that will soon have 4 kids in it. Or they could split the difference and buy a 4 bedroom house.", "The bank will approve you for a lot bigger mortgage than you can actually afford. Mortgage rates are probably not going down. House values are probably no longer spiking up, so you won't get magic equity fast and will pay PMI for awhile. If you think you can afford $4K/mo do you make $15-16K/mo? Are you going to be house poor? Rooms are a single factor in your kids lives. Are you saving for college? Saving for retirement?  Go over on Personal Finance Reddit and show them your budget and ask them.", "Similar to the other comment.\n\nOP, you haven’t really given any information on whether or not you can truly afford it and I believe you are being highly naïve if you really thinks interest rates are going down. People have forgotten that historically normal mortgage rates are 7-8% and considering inflation is pretty high, rates will most likely go up for quite some time. So the plan to refinance later and it be “cheaper” is likely to be untrue. What happens if circumstances change? Someone loses a job or takes a paycheck cut (we are likely heading for a recession)? Or what if your new addition costs more than you think (for whatever reason)? \n\nOP, personally I would say if you need private mortgage insurance you probably can’t afford the house you are talking about. You aren’t wrong in thinking it would be nice for all your kids to have their own rooms, but it doesn’t sound like it’s a luxury you can afford.", "How much are you saving each month for college for him and his siblings?\n\nI think that YTA simply for framing this argument in a way that makes it sound as if you care about your kids more than she does.  Perhaps she's just looking at the big picture.\n\nWhat the bank is willing to approve is irrelevant. They don't gave your family's best interest in mind. They care only that your income will cover your mortgage payment. They don't care that you may not be able to afford groceries. Or extra curricular activities. Or a vacation. They aren't sitting there saying 'in 9 years he's probably going to have to figure out how to pay $25k per year for his son's college tuition and in 16 years he's going to have 3 kids to pay for.'\n\nThe general rule of thumb is thar your mortgage should be no more than 28% of your income. So your combined annual income should be around $200k.  If that's where you are and you're also saving for college and retirement, great!\n\nBut if not, think long and hard about it.  If you think you can afford it, then start setting aside the extra 2k per month now so that you can make a larger down payment . (Or make extra principal payments on your existing mortgage.)", "And what happens if one of you loses their job and you can no longer make the 4k mortgage payments?", "Your wife seems to think his future plans will involve not being in her house. You need to discuss that with her.", "Him moving out has nothing to do with his future plans, unless his plans are to win the lottery. It has everything to do with *you* being able to buy or rent him a place of his own. If you think you will be able *and willing* to do that in nice years, you can safely choose a smaller house now.", "Those opinions based on “money” are about them affording the home and being financially secure. That is a hugely important thing to consider and something that needs to be discussed.", "It's her stepson, OP calls him \"my son\" and the others are \"our\". She could be making assumptions or she could be stating what she expects.", "Children aren’t going to suffer because they share a room.", "I think the first priority is having extra money in the bank so you can enjoy life. Maybe kids need their own room if they play video games all day because they cannot afford recreation. \n\nThere are dozens and dozens of beautiful and modern room dividers these days. Much cheaper than upsizing the home.\n\nIf you push this, everytime you have to buy cheap groceries, your wife will resent the hello out of you.", "Because she thinks / is hoping that as soon as he's 18 (didn't even talk about going to college), he'll move out.\n\nShe doesn't care about his kid. She does not want to have an free room for him to come back for visits.", "Is there room for a compromise? How close are you to 20% down with your 75k so you wouldn’t need the mortgage insurance (or can you find a credit union that doesn’t require it but rate isn’t ridiculously higher).  \n\nYour wife is (reasonably) worried about the increased cost, especially with a little expensive present on the way. You are (reasonably) worried about your kids mental health and wanting them to have their space. So why not save the difference between current mortgage and 4k for the next 1 year? Baby isn’t here, doesn’t need a room yet and can reasonably be in your room first few months.  She doesn’t think you can afford it, you do. So… see if you can. In that time your current mortgage will go down so you’ll have more than 75k and you’ll have a higher down payment (ETA: you’ll have more equity plus the money you’ve been saving to get to 4k/month)- will it get you to that 20% down?", "Yeah I agree that assuming their child will move out is unrealistic.\n\nI think the wife’s idea of a four bedroom they could more easily afford makes the most sense. More space, fewer kids sharing rooms, and they aren’t as strained financially.\n\nI think the people here acting as if having your kids share a room is abusive need to get a grip.", "And it sounds like they are discussing it. Moreover we dont have enough info to know if the additional cost will put them in dire straits. \n\nIm more on the wife’s side as well, but Im not gonna call the gut an AH for having his reasons for wanting something different.", "That’s a huge stretch. I know plenty of families that shuffled rooms around so the kid that’s older and in college or living alone gets a smaller room or shares with a sibling when they come visit.", "Abusive to not have one’s own room? Lol. Hardly. Although it would be very awkward for someone to share a room with someone 7 years younger. \n\nI also got the impression that the older kid is just his from a previous relationship. He mentions “my nine year old” and “our three year old daughter and two year old son”. So, I wonder if the 9 year old not being the wife’s biological son has any influence on her having him out the door at 18.", "Of course It does. She is already counting him out. If I was OP I would watch out for this behavior before his son start to feel unwelcomed on his own house."]}