{"id": 6277, "submission_id": "101auob", "title": "AITA for complaining about a soiled baby on a plane?", "selftext": "So me (f21) and boyfriend (m20) have traveled to my home country today. As we got on the plane right behind us was a family with a crying baby. Now the crying baby in itself isnt the problem as I understand it cant control the crying however, we were making comments to eachother how parents shouldnt travel with children so young as it stresses them out and makes them and everyone around them miserable. The baby kept being raised in the air and was grabbing the hood of my boyfriends shirt and all the staff was giggling about it too, even tho he obviously looked annoyed at being touched. At one point one of the ladies turned around and told us in a Croatian accent: “can you shut the f*ck up?” to which we said “sorry but were allowed to talk about this its a public space”, to which she replied “i hope you have a terrible time in croatia cause ure coming into MY country”. That was my boling point as I have already been stressed out all day from traveling so I turned around and in perfect croatian said something in the style of funnily enough its my country too so ill have a lovely time w my family thanks.  She then tried to get the stewardesses to remove us from our seats as we have been making “inapropriate” comments, and tried to deny her baby grabbing us saying we made all of this up and should be removed or kicked out. In the next hour the baby proceeded to soil itself and was just left to sit in it for the remaining time of the flight. Every time the air changed the wiff of poo would come so strong it literally made our stomach turn, and there is a baby changing station in both toilets. For the rest of the flight the staff has treated us like we were the worst people to ever live, refusing to speak to us, ignoring our row of seats when passing drinks etc. So am I the asshole?", "created_utc": 1672660512, "permalink": "/r/AmItheAsshole/comments/101auob/aita_for_complaining_about_a_soiled_baby_on_a/", "score": 88, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I have been making comments on a plane about crying children while the mother sat behind me on a plane\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You should have kept your comments to yourselves.  I'm not surprised everyone was pissed off at you because of that.  \n\nBut the parents should have done a better job taking care of the kid.\n\nESH.", "ESH\n\nYou talked shit like a passive aggressive 12 year old and didn't expect a reaction of some sort? You started with the childish antics. Don't expect everyone to just sit there and take it. \n\nYou all acted terribly.", "YTA.\n\n\"As we got on the plane right behind us was a family with a crying baby. Now the crying baby in itself isnt the problem as I understand it cant control the crying however, we were making comments to eachother how parents shouldnt travel with children so young as it stresses them out and makes them and everyone around them miserable. \"\n\nDespite the post title, clearly your problem isn't with the diaper. From the start, you had an issue with the baby being there at all. For all you know, they were flying for a parents' funeral or something.", "YTA and your title is misleading. The altercation was caused by your comments, not your complaint about a diaper.\n\n\"Hey, could you please prevent your baby from touching us, we don't like being touched\" might have gone down better?", "ESH\n\nThey should have tried harder to keep the baby from being a disturbance and what they said to you about it being her country was rude... however...\n\nYou purposefully made aggravating comments to get a rise out of them because you don't agree with their choice to travel with a baby, which is none of your business by the way. You could have kept your thoughts to yourself but you chose to voice them (which is your right) to cause upset, which makes you equally the AH. \n\nSure it is annoying, especially when the parents are not doing what they can to keep disturbance to a minimum but a plane is public transport, these things happen, would you do the same if somebody was travelling by train or bus?", "ESH. You passive aggressively talked about another passenger within earshot. They should not be leaving their child to sit in their own mess.", "Maybe she told you to shut up because of addressing your concerns like adults, you continuously made snide and passive aggressive comments like a bunch of babies yourselves.\n\nI understand that babies aren't everyone's cup of tea, that's fine and perfectly acceptable. And I understand if your boyfriend didn't like that baby interacting with him, that's also fine and acceptable. But instead of making judgemental comments about what you think is the right thing to do with other people's babies, you should have asked the people to please make sure their baby doesn't touch them. Yes, it seems obvious that that's what they should have been doing to begins with, but they probably also didn't think that someone would have such a big problem with a literal baby playing with them.\n\nEHS.", "ESH. You were rude and self-centered long before the diaper, and they should have changed the diaper.", "ESH but you're worse. Did you really type all that out and think you weren't an asshole? Sometimes people have no choice but to travel with young children. You don't know their life so mind your business. Then you complain about babies making everyone miserable. YOU MADE EVERYONE MISERABLE. \n\nNow despite how horrible you and your boyfriend were being, they shouldn't have allowed the baby to grab at your boyfriend and they certainly should have changed the diaper. Next time, keep your complaints to yourself. You literally accomplished nothing but being the next story on r/entitledpeople", "YTA\n\nI'm not a huge fan of children either, but you shouldn't have loudly voiced your rude comments. Perhaps your own rude behavior resulted in the parent's actions as a means of getting back at you.\n\nIf your boyfriend was unhappy with the contact with the baby, he could have kindly asked the parents to please keep some distance as he felt uncomfortable.\n\nTravelers include all types of people - that includes children and crappy parents. We all have to learn to deal...", "ESH. \n\nYou were making nasty comments long before there was an actual problem - yeah in an ideal world no-one would travel with small children because it's stressful, but life happens when you're making other plans and not everyone can have someone else look after their kid when they need to travel - and that made the journey far more unnecessarily stressful for the parents, which in turn probably stressed the baby.\n\nIn turn, they shouldn't have let the baby grab at your clothing, they shouldn't have lied about you to the flight attendants, and they should have changed the baby immediately. That last one especially - that neglect was cruel to the child as well as everyone on the plane within breathing distance.", "ESH. You for acting like a judgmental, unsympathetic, immature brat. Parents for not changing the baby’s smelly diaper.", "You know you were being rude and unreasonable. This isn't hard \n\nEsh", "Wait... did the mom turn around, while sitting behind you guys? All I see is some exorcism-kinda horror. However, as annoying as it sounds you do seem to have the ability to use words. Did you or your bf ask them nicely to prevent the baby from touching him? Or did you just go directly to passive-aggressive comments about the situation? I think this could be a total non-issue, if you just communicated as an adult. But yeah, YTA", "YTA: I was gonna go with an ESH but from the way you told it, you started it. You wanna know what else is annoying other than getting your hood grabbed by a baby? Having people insult your choices out loud, and then act all defensive when other people respond to said insults.", "Nta, hope she stays in her country with her shitty attitude and shitty care provision for her baby..  Glad to here your family isn't as rude and obnoxious as the people you encountered and you had a lovely time with them\n\nNot caring adequately for you kid is ah behaviour, trying to get people kicked off the flight because you've been called out on your abusive  and inconsiderate words and actions is ah behaviour.\n\nThe cabin crew for not putting a stop to the unnecessary harassment of other passengers by the people allowing their child to grab the clothes of fellow passengers is asshole behaviour. Seems you were sitting in frontt of the dregs of Croatia on your flight.   Nta", "ESH\n\nMaking comments about how babies shouldn't be on planes right next to a couple with a baby on a plane isn't going to make you any friends. (Though honestly, I agree—babies on planes are the worst.)\n\nBut the parents were much worse, letting their baby soil itself and _not cleaning up_. They made everyone suffer, _including their own baby_. That's just bad parenting.", "ESH\n\nThe conflict happened *before* the baby got soiled so this isn't really about that.  Saying it to your neighbor vs saying directly to them is almost the same when they can hear you and you know it.\n\nYou are right about people travelling with babies on flights.  It should be a really important reason like moving, not just to see grandma because it is indeed inconsiderate to a lot of people.\n\nThe flight attendants shouldn't skip you for drink service.  Something seems fishy about that part.  Either it's not true, or you did something more than what's in the story for that to happen.", "Sounds like EVERYONE needs to do some growing up. \n\nI won’t be visiting Croatia anytime soon hehehe 🤭 \n\nAHs.", "NTA! People need to control their kids full stop. I don’t understand why CONSENT and personal space go out the window when it comes to small children and babies. I don’t want to be touched. I don’t want to be touched by adults or children in the like. I’m so sick of people who think that the world revolves around their baby and that means it’s okay for it to grab whatever it wants. The age of entitled parents is truly a horrible one. Could you have handled it better? Yes. But my god people, you wouldn’t get into these situations if you just ACTUALLY TOOK CARE AND PARENTED YOUR CHILDREN.", "NTA. Next time grab the mom’s hoodie…see if she likes it.", "YTA. Your use of written communication is seriously questionable. It shows that your capacity for human empathy is low or non-existent. This is why people were laughing at you and did not care enough to prevent you from being wronged. Its obvious you've increasingly ommitted details to try be more persuasive. You sound like a full on narcissist.\n\nSeriously?\n\n> I understand **it** cant control the crying", "NTA. x 1,000\n\nI swear to God, I'd be happy if I never flew again.  \n\n1. Parents with babies should chose to fly less often, due to the noise that babies will make when they inevitably cry.  (A lot of this travel is discretionary before people say some travel is essential.  Hence 'less often' not 'never'.)\n\n2.  I draw the line at any physical contact (grabbing your boyfriend's shirt) and soiled diapers.  Both can be addressed by proper parenting, unlike crying which is inevitable on flights (but see 1).", "YTA. A good indication is that people asked you to shut the fuck up and the staff treated you the way they did.\n\nIt is always rude to talk out loud about people around you. Babies are also paying customers. You don't go around saying old people / fat people / smelly people / people with large hats / etc. shouldn't travel by plane because it ruins your experience. You are not alone in the world, everybody is different and air travel is not just for the people that meet your standards.", "ESH but you’re the bigger jerk. Usually parents only fly with babies out of necessity, ex a funeral. You need to keep rude comments to yourself, I’m embarrassed for you.", "YTA 💯", "You are NOT the asshole. Send a letter to the airline", "YTA\n\nIf you cannot deal with the issues of traveling, don't travel.", "NTA\nParents who fly with their brats don't have a license to behave like assholes", "NTA", "NTA The parents are huge AHs. Not changing their baby's dirty diaper for seemingly no reason but to spite you, horrible parents. \n\nMy husband and I took our kids to see family for the holidays and my 5 year old soiled her pull up and we changed her as soon as we could. We new it would be cruel to force her to sit in her crap. I mean even just for basic hygiene purposes you should change a kids diaper when they need it.", "YTA Shit happens and keep your comments to yourself. Being rude is not a right.", "ESH, but them more so than you. Babies are annoying, especially on airplanes, so I get the comments but there's no point in passive-aggressiveness considering the baby is already there in the air. It's not like they can just throw the thing out a window and be rid of it... but at the same time, what kind of parent lets their kid sit in their own shit for an entire flight, especially when there are changing stations available?\n\nLetting your own child marinate in their crappy diaper and making them uncomfortable for the sake of getting back at someone for who knows how long is not appropriate vengeance. They're just gonna give their already upset baby more of a reason to cry and probably an infection of some kind, especially if the baby is a girl.", "YTA have you ever been a parent? I am hoping to become one. My friends have kids and travel often. Poopy diapers are part of it. Have some grace", "Nta babies and planes are a bad mix", "ESH. You were deliberately making passive aggressive comments knowing they could be heard, and the parents didn't change their baby's nappy. You're as bad as each other.", "I think your title here is purposely misleading a bit. You did not start complaining about the baby after they had soiled their diaper; you were speaking ill of the parents from the beginning of the flight. It’s not like that specific moment is what triggered your behavior and rude comments. \n\nSome people don’t have the option to not travel with their children, and if you’re so concerned about the “stress that traveling puts on a baby”, perhaps openly talking shit about the parents is not the way to go. I’m sure it made the experience much more tense, and while you can say what you want in a public space, a little situational awareness and overall politeness could have helped make your day much easier for yourself and everyone around you. \n\nYou ruined that flight for that family the moment that trip started because of your attitude, not because the baby soiled itself. YTA.", "ESH. They should not have allowed the baby to touch your boyfriend repeatedly (once would be an accident) and you guys with your passive aggressive judgmental comments are just as bad. Asking them politely to not allow the baby to touch you would have been more appropriate.", "If OP could smell the dirty diaper, then it’s likely the parents could too. Why the hell were they leaving their baby in a dirty diaper? \n\nAnd, if a full grown adult was pulling at someone’s clothes, would you all be so “suck it up asshole!” Doubtful. I get a baby doesn’t understand, but the parents *do.*\n\nESH. Parents should have kept the baby from pulling on the dudes clothes, been parents and not let their baby sit in a soiled diaper. However, OP, people aren’t mind readers. You were willing to talk ABOUT the smell loud enough so they could hear, you could have politely said “hey I know traveling with a baby is rough, but I think your baby’s diaper might need to be changed as we’re in a tight enclosed space and we can smell it”", "I don't like babies on planes, but you know what? I know the parents of the baby are super stressed out, so I keep quiet. \nWhich is what you should have done.\nYTA", "ESH:\n\nThem: not stopping their baby from grabbing your boyfriend’s hoodie and not changing the baby’s diapers.\n\nYou: passive aggressively talking shit about them so that they could hear you.", "YTA because you started it. Everything that happened after your nasty, judgemental comments is on you. What did you expect? Either you were spoiling for a fight or you wanted to humiliate the parents.", "YTA \n\n🙄", "YTA.", "YTA\n\nNobody travels with babies just for fun. I promise, if you think it is stressful, the parents are even more stressed, unhappy, desperate and caught in a situation where they can do very little right. You fly with a baby because that is the best and sometimes only option you have.\n\nNow, we don't know exactly how long that baby sat with the poopy diaper and how much time the parents had to fix it. It may have felt worse than it was, as you were already in a nightmarish headspace.\n\nAbout grabbing the hood of your boyfriend's shirt - I agree that was a bit much, but it happens, as it is impossible to do much without invading other people's space on planes. I had a guy slam the back of his seat into my knee, then bang it with his fist before he started complaining about me poking my knee into his back. This was a flight with shitty soft seat backs and no room what so ever for my legs, and he was a huge guy throwing his seat back hard before I managed to move around. Honestly? I was a lot more troubled by his aggression and force than by any poor babies and their stressed out parents on any flight I have taken. Sadly, selfrighteous aggressive men are still wecome on planes.", "YTA\n\n>however, we were making comments to eachother how parents shouldnt travel with children so young as it stresses them out and makes them and everyone around them miserable\n\nAnd little baby grab few times hood ? OMG what an inconvenience. just an excuse , god know what did you talk to each other in completely passive aggressive tone to be sure that people behind you hear that. Grow up", "YTA. Babies cry.", "ESH\n\nIt’s not appropriate to talk negatively about someone when they can hear you. It’s rude and probably one of the reasons why they were so annoyed.\n\nHowever, this doesn’t justify leaving a baby in a soiled nappy for an entire flight or the staff not speaking to you. That’s very unprofessional.", "ESH, though you moreso. You and your bf sound like immature brats talking shit about people you know perfectly well can hear you. You think the parents weren’t already stressed out travelling with a crying baby? The last thing they need is to deal with jerks like you making pointedly snide comments. \n\nI don’t understand the ‘babies shouldn’t be on planes’ argument. As others have pointed out, the parents could be going to a funeral, moving/work relocation, visiting elderly or sick relatives who can’t fly to them or a million other reasons that aren’t really anyone’s business. \n\nHaving said that, they shouldn’t have let the baby grab your bf’s hoodie and should have changed the diaper (assuming the fasten seatbelt sign wasn’t on).", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo me (f21) and boyfriend (m20) have traveled to my home country today. As we got on the plane right behind us was a family with a crying baby. Now the crying baby in itself isnt the problem as I understand it cant control the crying however, we were making comments to eachother how parents shouldnt travel with children so young as it stresses them out and makes them and everyone around them miserable. The baby kept being raised in the air and was grabbing the hood of my boyfriends shirt and all the staff was giggling about it too, even tho he obviously looked annoyed at being touched. At one point one of the ladies turned around and told us in a Croatian accent: “can you shut the f*ck up?” to which we said “sorry but were allowed to talk about this its a public space”, to which she replied “i hope you have a terrible time in croatia cause ure coming into MY country”. That was my boling point as I have already been stressed out all day from traveling so I turned around and in perfect croatian said something in the style of funnily enough its my country too so ill have a lovely time w my family thanks.  She then tried to get the stewardesses to remove us from our seats as we have been making “inapropriate” comments, and tried to deny her baby grabbing us saying we made all of this up and should be removed or kicked out. In the next hour the baby proceeded to soil itself and was just left to sit in it for the remaining time of the flight. Every time the air changed the wiff of poo would come so strong it literally made our stomach turn, and there is a baby changing station in both toilets. For the rest of the flight the staff has treated us like we were the worst people to ever live, refusing to speak to us, ignoring our row of seats when passing drinks etc. So am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH. Leaving the baby in poop is not okay, but your behaviour before that? Urgh. Have a good hard look at yourself.", "I have also sometimes felt my teeth on edge with a crying baby on a plane, but I'm going with YTA because it sounds as though you started everything by loudly expressing your disapproval of the baby being there. And that's obnoxious. People can't stop travelling just because they have children.", "Why should she?  She was dealing with an obnoxious situation.", "why would the reason of their flight matter literally at all?", "😂😂😂😂😂😭😭😭 no", "Seriously? I’m not someone’s personal baby toy!", "Yeah god forbid someone want their personal space respected", "I like babies, just generally speaking, but I still want to be left in peace. It's not the baby disrespecting my personal space when they touch me but their parekts and they are (hopefully) adults who know what is and what isn't appropriate.", "I really hope I don’t end up on a flight with any of them.", "Agreed. Also, if the flight staff was being so horrible to OP, perhaps they were a bigger AH than they’re letting on. I imagine they’re used to those types of comments.", "Miss me with the judgmental or unsympathetic part. There’s a screaming child touching OP’s boyfriend with its grubby fingers right behind their heads. SOME PEOPLE DON’T LIKE THAT. They’re fully allowed to express that they don’t like that. \n\nThe unsympathetic comment really grinds my gears. Let me guess, you’re a parent that thinks everyone should cater to them? Who are they supposed to have sympathy for? The parents who knowingly brought a baby on a flight? I certainly never feel bad for parents who make that decision. I feel sympathy for myself and those around me who have to be tortured by a child’s screams in an enclosed space for hours. \n\nNTA, not everyone wants to just grin and bear it when it comes to grumpy children in public spaces.", "Haha I was confused how the baby was grabbing his hoodie from in front of them", "I thought the same thing! How did they turn around to scold you, if they were behind you..?", "Yeah, no.", "Yeah, letter to the airline for the cabin crew ostracising them.", ">Though honestly, I agree—babies on planes are the worst.\n\nAgree with this.\n\nMuch worse by letting baby grab OP's boyfriend's shirt as well.  That's never okay.  Newsflash - some people do not like their personal space being invaded by anyone, including babies.  As babies don't know any better that's why parents actually need to parent and not assume everyone is okay with their little darlings' antics.", "I agree ESH, but what would you suggest to people with babies who's family lives overseas? Should they not meet the baby because it's inconsiderate to people? I'm curious 'cause I have a 9 month old. My family lives in Poland and both of my grandma's haven't met her yet. I've been postponing the trip because of people like this. Now, I wouldn't let me kid sit in a soiled diaper or grab onto people, but how do I go about having my daughter meet her great grandma's before they pass?", "Croatia is a lovely country. \n\nParents who let their children invade other people’s personal space are assholes no matter where they’re from.", "Nonsense.  You're probably projecting.", "I feel like a great business idea would be a childfree airline. I would pay a large amount extra to be on a flight with no kids/babies guaranteed. Especially in the age where it seems parents are happy to let their kids do whatever they want without consequences. \nNTA op. EVERYONE no matter their age needs to follow rules of consent, and if they are too young to do it themselves that’s why they have parents to teach it. I don’t want to be touched. I don’t care how old the person doing it is.", "This is such nonsense.  Parents fly with babies all the time for discretionary travel, holidays, etc.  I'm embarrassed for you making excuses for the disgusting behaviour of these 'parents'.", "That's a non-argument.  The 'parents' were behaving like assholes.  That's the question.  Travel does not need to be with asshole behaviour - that's on the asshole.", "They seem to be perfectly able to deal with the issues of traveling. They were simply talking about it, which is their right. \n\nLook at it this way: babies are allowed to scream even though it annoys other people - people are allowed to gossip even if it annoys other people.", "But OP and her partner *do* have such a licence?\n\nThey were openly slagging off the parents before anything happened with the baby grabbing the hoodie, or messing its nappy.\n\nOP - YTA. Perhaps if you hadn't been so rude and judgemental to start with, the parents would have been more inclined to help.", "I don't wanna smell \"shit\" happening on a long haul flight sorry. OP is still an AH but not the only one", "But changing poopy diapers is part of it to. My husband and I took our kids to see family over the holidays and when my 5 year old soiled her pull up we changed her because that's basichygiene that is needed. Not to mention how much she would have hated sitting in her crap for so long.", "Sure, babies use the diapers they're put in. Makes sense. But for the parents to leave their baby in a soiled diaper just to annoy OP with the stink? Not cool, that poor baby. \n\n I don't even like babies and I think that's cruel.", "Yes.  100%.  It's genuinely unpleasant for babies due to the air pressure changes.  They can't help crying.  But parents should travel less often (not never, clearly emergencies happen), to stop their babies being in PAIN and making the lives of everyone around them miserable.", "> Now the crying baby in itself isnt the problem as I understand it cant control the crying however, **we were making comments to eachother how parents shouldnt travel with children so young as it stresses them out and makes them and everyone around them miserable**.\n\nShe was making obnoxious comments *before* the baby or the family did anything.", "Since they're saying parents shouldn't travel with children so young. \\*If\\* we're going to make such harsh unilateral judgments about people flying with children,   \n then in my mind, it is perhaps possible to differentiate between taking kids to the Bahamas for vacation or flying internationally for a family crisis.  BUT the reality is that we fellow passengers rarely know for certain why other people are flying. So I think OP should have just kept her/his mouth shut. (And I hope if they are ever parents who want or need to travel long distance or internationally, that they will at least be consistent with their principles and make sure to go by car or trans-atlantic boat with their infants.)", "Correct.  Such 'parents' seem to believe everyone finds babies delightful.  I simply don't like babies and I don't like any stranger getting in my personal space.  But what if this happened to someone on the spectrum?  That could completely freak them out.", "I literally said it's fine if that's what they wanted. But it's not fine to make snarky comments aimed at someone in earshot the whole time.", "Assuming sarcasm intended, have an upvote.", "Lmao. Sometimes people have no choice but to travel with babies and it’s fucking hard. You live in a society with children whether you like it or not. You and OP are unsympathetic. Maybe next time you see a baby get on your flight you can not get on and save yourself the angst.", ">Let me guess, you’re a parent that thinks everyone should cater to them? \n\nOf course the poster you are responding to is.", "Maybe the mother has really strong arms and flexible shoulders and held the baby over her head really far back? Or maybe not... Glad I was not the only one confused about that!", "Agreed. I’d like to know too. Grandparents are very important, babies traveling only for emergency’s is extremely unrealistic.", "I would buy a plane ticket for grandma(s) instead.  Now if she's too old or not in good shape to travel and has not much time left and it's pretty much the only chance to see the grandkids, then that would qualify as important.", "Take shorter trips to see what baby is like on a flight first. Bring lots of stuff to distract baby. Bring earplugs for people in neighbouring seats if the airline doesn’t provide them. Be polite to people stuck near your crying child. Do not let your baby grab other people. \n\n\n\n\n\n\nCan your old relatives fly to you instead of the baby flying? \n\n\n\n\n\nBabies shouldn’t be banned from flights of course, but there are plenty of inconsiderate parents who don’t care that their child is causing a fuss and do nothing to mitigate it. If it looks like the parents are doing their best then other passengers normally don’t mind.", "They were trash talking the people behind them in such a way that it was obvious they wanted to be heard.", "Why are you responding to every single comment?", "I would like to see how you react on trash-talking that you took little baby to airplane. OP should be quiet and do not escalate situation", "Yeah, and the fact that babies are babies and not adults with a finished brain has nothing to do with that I guess /s", "They were trash talking the people behind them in such a way that it was obvious they wanted to be heard.", "As someone with a kid, if I had to be subjected to their horrible parenting in front of me I’d comment too. You can take your kid on a flight and be a responsible parent and passenger, a kid doesn’t give you a free pass to disrupt others flight.", "OP and her boyfriend weren't assholes.\nThe parents have a responsibility to deal with their brat.", "I’m going to go ahead and say that op is probably not a reliable narrator and she doesn’t state how long the baby was not changed for but I highly doubt the parents let their child sit in shit for an extended period of time just to spite her", "They might have not known.", "No they made those comments about what was happening, the line right before the one you quote says\n\n> As we got on the plane right behind us was a family with a crying baby.\n\nSo the kid was crying from the beginning that’s why\n\n> The baby kept being raised in the air and was grabbing the hood of my boyfriends shirt \n\nTo calm them down", "Perfectly sensible comment.", "Exactly! I don’t like being touched. Especially by strangers. I don’t care if it’s a baby or an adult! I’m not comfortable around babies either and I don’t find them cute or start gushing every time I see one. And I bet you anything if OP and her bf had said something directly to the mom…she wouldn’t have cared anyway because it’s “just a baby” and everyone has to put up with it.", "Does it really need to be directly communicated that you don't want a complete stranger grabbing you or your belongings? Baby or not.  \n\n\nRespecting personal space seems like common courtesy as well.", "They were making a reasonable point.  Glad they were heard.  Perhaps entitled parents will finally get the message, but I doubt it.", "I'm not saying babies and adults are the same, I am saying that other people doing things that annoy you is part of living in a society. You don't want annoying people - then go live where there are no people.", "So? If the people behind them can't stand being around annoying people, maybe they're the ones that shouldn't travel (just to apply your logic here).", "They were making the comments BEFORE the hoodie grabbing and pooping took place.", "I think they were. They deliberately made comments they knew would upset the parents. They'd decided to take against them whatever had happened - this was a self-fulfilling prophecy. They went onto that plane already dead set on hating on parents flying with their babies - then antagonised the parents.", "Well said.", "Good point. I'd like to know exactly when the seatbelt signs went on relative to when the baby needed changing.", "Yes. Also, according to OP’s version of events, they didn’t complain about a soiled baby smelling like poop for hours during the flight. I could have *maybe* got behind that. \n\nThey actually complained, audibly, about baby crying. That’s dickish. YTA", "Seriously?  That's your view.  Sigh.", "Then they’re not fit to be parents wtf", "I would like to give them the benefit of the doubt, but I find it hard to believe.  They are in close proximity with their baby (probably on someone's lap) and most parents know when their baby is doing their business - they know how their baby reacts to the action of pooping or peeing before it even happens - \"Thats his/her pooping face!\". Sure, its possible they didn't notice when it happened.  But to not notice the smell afterwards? 🤔", "No.", "Then comparing babies, who cannot help crying, with adults gossiping about people while said people can hear it is in NO way a fair comparison. I might find people annoying, but that doesn't mean I feel entitled to be able to say hurtful stuff. It is just not comparable.", "No. These parents are definitely the assholes", "I think OP is correct that if you have a very small baby you should maybe just not go on long flights for the first few years. It‘s stressfull for the baby, especially if something happens with pressure in their ears, and extremely annoying to everyone around you. Imo it‘s „dickish“ and selfish to do unless it‘s absolutely necessary", "This.  People are reaching to try to make excuses for the 'parents'.  But to say they deserve the benefit of the doubt as to whether their baby shat itself is batshit crazy.", "You're entitled to you view.  As am I to mine.  OP was completely fine to say what she did.", "Having a screaming, kicking child that smells like poop, and probably bothers the entire plane, and then having the balls to complain about people saying things that you don't like - that's the definition of living in a glass house and throwing stones. To me, THAT'S entitlement.\n\nAnd I'm obviously not comparing OP to a baby, but to the parents, who are of course responsible for the situation.", "> As am I to mine. OP was completely fine to say what she did.\n\nNo."]}