{"id": 6295, "submission_id": "101ejas", "title": "AITA for eating a meat burger with extra bacon infront of my SIL", "selftext": "English is my second language. So please ignore my mistakes. \n\nMy (23F) SIL (28F) is vegetarian and very proud of that. I am not, I love eating meat occasionally. \nWell we went out with her partner and my husband to a eat in a restaurant. \n\nWhile we were deciding what to eat she started to complain how much meat the restaurant offered and how the poor animals suffered and how non of us should eat meat …\nI seriously didn’t really listen I was to focused on the menu. And I was craving a burger with bacon for weeks. \n\nSo the waiter comes up to take our order and I order a burger with extra bacon. It was delicious and satisfied my craving. \n\nLater after the meal she pulls me aside to tell me what an AH I am for eating extra bacon and meat right after she told me about that we should not eat meat this time. \nI told her that my food choice did not include her and that I wasn’t really listening to her by the time I choose my food because I was concentrated on my food. \nShe was really mad and told my husband and her family and her other brother texted me (she also did) how childish and messed up I was to order meat just to show her she sucks. And that I should apologising.  \n\nAITA? Should I apologise?", "created_utc": 1672671413, "permalink": "/r/AmItheAsshole/comments/101ejas/aita_for_eating_a_meat_burger_with_extra_bacon/", "score": 551, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) my vegetarian SIL talked about how animals got hurt for us to eat beef and I orderd a burger\n(2) it seems to have offended her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nIt's her choice to be a vegetarian. She sounds super-sensitive and spoiling for a fight. \n\nJust because she saw you eating doesn't make it wrong. There's no law covering \"bystander trauma\" (Phil Hartman, RIP).\n\nIgnore her.", "NTA.\n\nShe sounds like a self-centred little brat. You ate meat not because you wanted meat but to show her she sucks. You made a choice, but really it's about ***her***.", "NTA lol, she is trying to enforce her being Vegetarian over you, and that is a BOUNDARIE you guys need to clearly talk about and set.", "NTA as a vegetarian (almost vegan) myself, I wouldn’t force my views on anyone", "\"I'm sorry you were offended in how I choose to feed myself in this restaurant \" would be the only apology she would get from me. NTA. Now if you were in her home and brought your own burger to chow down in front of her \"just to show her she sucks\" you would have been. \n\n>", "I’ve been a vegetarian for nearly 30 years. I do it for ethical reasons and because I can. I have no expectation that others do the same. Confronting people about their dietary choices is an asshole move. \n\nDoes she also accost people buying chicken or steak in the supermarket? \n\nIf you want burgers and bacon at a restaurant that serves it, then you have burgers and bacon. Doesn’t bother me, I’m not the one eating it. \n\nNTA", "NTA it’s her choice to be vegetarian she cannot make the choice for everyone else. Telling you what you should and shouldn’t eat makes her a major AH", "NTA\n\nHow does she function in life if she demands people eat like her? She must be constantly telling people they're assholes.", "Order a big steak next time you're around her\n\nNTA", "NTA\n\n\"Dear SIL, bite me.\"", "NTA as somebody who doesn’t like meat I wouldn’t be offended if you did.  Your choices are that.  Your own.\n\nIf she doesn’t eat meat that’s *her choice* she shouldn’t force that onto others.", "NTA. I’ve been veggie for 16 years now and wouldn’t dream of going to dinner and lecturing everyone about what they should and shouldn’t eat. Seems a bit self-centred that she believes you ordered just to provoke her when you just ordered what you fancied.", "NTA - and in fact, SIL is being a world-class AH herself. Being vegetarian was her decision, not yours. And to go to a non-vegetarian restaurant and all the while complain about how they shouldn't serve meat, etc and trying to force her views on everyone around her is ridiculous. If anything she owes you the apology (but if I were you, I wouldn't expect to get it)", "NTA\nShe agreed to go to a non vegetarian restaurant, so she accepted that people would eat meat.", "NTA. Veggies who spew this moralistic agenda on others are.\n\nIf anything, the only thing you owe anyone is explaining that you didn't even pay attention to what she was saying while you were browsing the restaurant's menu and to make clear to everyone that NO ONE is obliged to adjust their eating preferences because of someone else's views.\n\nDon't EVER apologize and don't let anyone give you the guilt trip over this.\n\nBy the way, is your husband siding with you or your SIL?", "NTA", "NTA. Given the majority of people eat meat does she do this every time anyone eats meat in front of her? You can eat what you want, she’s the AH for going on about it. You have nothing to apologise for.", "NTA, we all make choices.  Hers is vegetarian and yours is more omnivore.  If anything, she is TA for trying to push her agenda on you and getting everyone to gang up on you.", "NTA\n\nThe world is full of meat eaters. The world is full of vegetarians. They all manage to get through life without pulling each other aside and shaming them for choices.   \nShe’s not your mom, boss, or law enforcement. She gets no say in what you eat.", "NTA. You didn't tell her what to eat. What you eat isn't any of her business.", "Nta. Your SIL is allowed to not eat meat. She is not allowed to force anyone else to eat the same way. Tell her family that if they want her to dictate what they eat, that is their choice. But you will eat what you want.", "NTA\n\n\nTell her that trying to control other people is toxic af and she needs to stop that shit. On top of this, preaching is off-putting and the best way to make sure her friends order as much meat as possible around her, just to spite her.", "NTA. Not your diet, not your problem.", "NTA.\nIf she wants to be veg, that's fine.  She can't force YOU to eat what SHE wants while out at a restaurant.\n\nIf she wants to go somewhere that doesn't serve meat, she could find another place to go, presumably alone or enjoy the grass in the nearest park.\n\nI'm honestly so tired of people forcing their dietary belief on others like they're superior for eating broccoli for dinner.", "NTA.   \n\n\nYour meal, your choice. The audacity of some vegetarians/vegans is... I dont even know what to say. Her attitide is counterproductive, to say the least.   \n\n\nWBTA if you did it just to mess with her, but you did not.", "NTA. Her life choices aren't yours, that simple.", "NTA. Massive ego problem on her part, not everything is about her. Get a turducken next time.", "NTA And she needs to get over herself. My brother-in-law is a vegetarian, but my sister (his wife) is not, nor are their young children. He happily cooks meat for family and friends. He realizes it is a choice that shouldn't be foisted upon others.", "*My (23F) SIL (28F) is vegetarian*\n\nCool, good for her.\n\n*and very proud of that.*\n\nOh my lord.  NTA, just based on that.  Case closed.", "NTA. She’s in no position to dictate what you eat. One of my favorite jokes: A vegan, an atheist, and a crossfitter walk into a bar. Within 2 minutes, everyone at the bar knew…..", "NTA - she's entitled to her opinion, you're entitled to yours. Assuming eating meat isn't illegal in your country, you've done nothing wrong.", "NTA.\n\nI'm pretty sure that eating bacon is a constitutionally protected right.", "NTA.\n\nMy POV, she's projecting, and KNOWS she's being an asshole, but gets offended when it \\*fails\\*.", "NTA.  Your diet concerns no one else but YOU.  Others do NOT get to direct your food choices. No apology needed.", "While it is polite to order a more contientious meal when dining with others who have restrictions - it is not required.\n\nMeanwhile someone was actively attempting to change your behavior.  She was the real asshole.\n\nIt's like inviting a Muslim friend over to your house for a few days and then suggesting they only pray to Jesus during their stay.\n\nAt worst you were mildly inconsiderate. She is the real monster here.\n\nNTA", "NTA. Never police food.", "NTA\n\nYour SIL seems like she has main character syndrome, and that she is the center of attention. You stopped paying attention and ordered what you want, there is *absolutely nothing* wrong with that.", "NTA. I myself don’t eat meat but that’s my choice. I don’t push my own beliefs or preferences on other people. It’s wrong to guilt people on their dietary choices for whatever reason.", "NTA- (assuming you did nothing to goad her) from someone who has spent the last 25 years not eating most meat, for ethical reasons. I bet she’s a recent convert, ie <2 years. The early years of discovering the realities of animal husbandry practices can be a hard adjustment. It’s upsetting that no one else cares. That’s not an excuse for her to dictate your meals. Hopefully she will learn to adjust (as most do) or not go to restaurants like that anymore. \n\nThe number one lesson I learned is don’t talk about your veg*nism while eating, even if people ask. And people *will* ask. They will innocuously ask why, and if you answer, even in a vague, sensitive manner, they usually get defensive.  It’s a no win, don’t talk about diets (of any kind) while people are eating. \n\nTo the insistent people, I tell them to ask me for a link to resources later if they want to read up. Not one single person has.", "NTA\n\nShe's not offended because you ate meat, she's offended because you didn't give into her attempt at manipulation and control. She confronted you afterwards because she wanted a second attempt to rein you in and have you obey her.\n\nIt's nothing to do with animals or cruelty and everything to do with her wanting to enforce her will on others.", "I would have ordered a side of steak to go with the burger.  But that's me.", "NTA. Her choices have nothing to do with you.", "NTA her eating habits don’t extend to others. She is the AH.", "NTA. You aren't obligated to others' life decisions.", "NTA\n\nMy twin brother is a vegan, and my sister is a vegetarian.  I hunt and primarily eat land animals in every meal.  I call myself a meat-itarian.  My sister doesn't mind anyone eating meat in front of her, but my brother and SIL do.  So what they do, is either not come to dinner, move to another room when we are eating meat, or just deal with people who haven't made the same choice as them (this usually doesn't happen ever).  \n\nMaybe find a good argument for eating meat. So when your SIL tells you that you are living life wrong, counter with why people were born to eat meat and that we have been omnivores since the start of existence.", "Nta. It wasn't the burger ( now i'm hungry) that show her she sucks. She prolly wanted your extra bacon burger.", "\"Just to show her she sucks\"... I mean, those are his words not yours. It's telling what her own family thinks about her 😂 NTA.", "NTA - it’s all well and fine she wants to eat that way be she can’t force her ideals on other people and control them. She’s the AH. Glad you enjoyed your burger.", "NTA. You didn’t make her eat it. Just because she has a food preference doesn’t mean you need to be negatively impacted by this.", "NTA block them both. I don't understand people getting involved in situations that have nothing to do with them", "NTA. Are you kidding me? Vegetarian  and vegan people suck! And the way they try to IMPOSE their lifestyle to everyone else 🤦🏾‍♀️🤦🏾‍♀️", "Nta-meat is yummy.", "NTA - tell her you are a vegetarian through eating a cow who is a vegetarian....", "NTA, why do some people think its okay to push their believes or feelings about stuff down others' throats?? \nDon't apologize for eating something you like.", "NTA", "NTA\nShe is aware that you aren't vegetarian. What did she expect?", "NTA", "Screw her. Humans evolved eating meat and there is a history of eating cured and smoked meats that is at least thousands of years old. Are there issues with CAFOs and such? Sure. But there are issues with monocrop agriculture as well.\n\nNTA. Tell her to pound sand. She doesn’t get to make you a vegetarian.", "Hell no, NTA. She can eat whatever she wants and so can you. Can't stand people who want to dictate what others do or say. If I were you and thought there was a chance of seeing her somewhere, I'd carry some beef jerky in my pocket to whip out and eat in front of her.", "NTA, I would have stared at her while eating the burger and hoped juice ran down my chin with every bite.", "These people live in another planet . Fascist shit. That’s her choice not yours. Enjoy your burger homie.", "NTA\n\nHer views are hers. No one else need live by them.", "NTA. Honestly I would never share another meal with her. She way to self righteous, if she really wanted no one to have meat for this one meal it should have been decided before you got to the restaurant. That way y’all could have chosen somewhere that’s more vegan/vegetarian friendly. You don’t spring your choices on someone at the last minute while they are not listening because they are reading the menu.", "NTA - what you choose to eat is not dictated by her. You could easily say that you were offended that she didn't eat meat when the restaurant obviously served good burgers. How ungrateful! \n\nSeriously, though. Why does she think it's appropriate for her to constantly be preaching to everyone to adopt her lifestyle? That's rude as fuck.", "NTA. After you, an adult, made your own decision to eat food that you wanted, SHE was the one who decided to get childish and immature. The projection from her is very strong.", "NTA. Vegetarians still support animal abuse / murder, so she should shut up.", "This sounds like one of those neither or both situations.\n\nYou weren't paying attention. She interpreted your order as a response to her animal cruelty comments. That's two minor oops.\n\nMy judgment is that NAH. Just a standard social misunderstanding. If you want to help keep the peace, you could apologize for not paying attention, but not for ordering what you wanted.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEnglish is my second language. So please ignore my mistakes. \n\nMy (23F) SIL (28F) is vegetarian and very proud of that. I am not, I love eating meat occasionally. \nWell we went out with her partner and my husband to a eat in a restaurant. \n\nWhile we were deciding what to eat she started to complain how much meat the restaurant offered and how the poor animals suffered and how non of us should eat meat …\nI seriously didn’t really listen I was to focused on the menu. And I was craving a burger with bacon for weeks. \n\nSo the waiter comes up to take our order and I order a burger with extra bacon. It was delicious and satisfied my craving. \n\nLater after the meal she pulls me aside to tell me what an AH I am for eating extra bacon and meat right after she told me about that we should not eat meat this time. \nI told her that my food choice did not include her and that I wasn’t really listening to her by the time I choose my food because I was concentrated on my food. \nShe was really mad and told my husband and her family and her other brother texted me (she also did) how childish and messed up I was to order meat just to show her she sucks. And that I should apologising.  \n\nAITA? Should I apologise?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "No, You are not. I'm also vegetarian and i would never expect that other person changes their order for me. She's just a entitled little brat in a mask of animal lover.", "NTA-Your sil can be vegan, but she can’t pushed her views on you all. You told her your decision wasn’t about her. I would do one group text to all of them reiterating that your decision had nothing to do with her and while she is free to he vegan and have whatever views she wants to, she does not have the right to push her views on you or try to twist your actions to suit her fake narrative.", "NTA I am a vegetarian and I would never ban anyone from eating meat in front of me. And if she cares so much about the animals why isn't she vegan? Sounds a bit hypocritical to me.", "NTA .\n\nAs a vegan.. I am so sick of people acting like your SIL. She makes us look so bad. :/", "Lol, no. I'm a vegetarian,  and the last thing that would ever occur to me is to expect others to eat the way I choose.  That's just silly.", "NTA\n\nApologize for what exactly? Eating? You don't owe her an apology for anything you did nothing wrong. She needs to apologize to you for making up lies about you if any apology needs to happen.", "I decided to go vegetarian.  My brothers sometimes make jokes, but my younger brother also makes sure to have vegetarian options when we have Christmas breakfast and dinner together. They don't put me down for my choice. They make 1 or 2 jokes, but I can tell it's light-hearted. I also don't make a huge deal over them eating meat. I used to eat meat, I made the choice for myself. Not to use it as a weapon for other people's choices.", "NTA", "Nta. Her life choices don't dictate your life choices. She has made her own choice to abstain but that doesn't mean she can choose what you eat.", "NTA But the bigger question (at least to me) is why, given her devout vegetarian beliefs, why would she even consider even going to a restaurant that isn't strictly vegetarian/vegan with a group of people (family or not) only  to pull the \"let's not eat meat\" stunt? She was looking to either proselytize, bully, or be offended. Either way, it was performative bullshit and in the future, don't eat out with her. But always invite her to your barbecues...", "NTA. It’s no one else’s business what your eating. As a vegetarian I would never expect anyone to change what they eat around me", "NTA. Look I'm a vegetarian, and have been for more than 20 years. What you eat is up to you. People like what they like, and we live in a world where people eat meat. If you wanted to have a conversation about eating meat at some point, we could, but I wouldn't force that on you either, because having dealt with people who preach their ideals at me, I know it gets tiresome and annoying.", "Nta\n\nShe can choose what she puts in her body, not what you put in yours", "NTA whether it's a personal choice or a dietary restriction, sil needs to stfu and stop trying to demand others do what she says. Enjoy what you want, not what she tells you to.", "Cue jim gaffigan vegetarian joke right here.", "NTA. Vegetarians seriously need to get over imposing their food choices on everyone.", "Info: Was she, in fact, telling everyone what they should and shouldn't eat or was it more along the lines of \"I can't believe that in the year 2023 I'm still stuck to eating a salad because restaurants can't be assed to have vegetarian options.\" \nBecause been there, done that.", "NTA", "NTA being vegetarian is her choice its so annoying when people try to push their choices on others", "NTA. Who is she to dictate what you order? She's the one making a scene. If it bothers her so much, she should've discussed it with everyone involved before going to lunch, that meat bothers her so much so that if others are ordering it, she will politely decline to go. That she is asking for clarification so that she knows whether to go or not, but is not dictating other's choices.\n\nBut she clearly doesn't respect other's choices, she's there to make a scene.", "NTA; her food choices have zero impact on yours", "As a vegetarian for over 10 years, NTA. I do not care what others eat, especially when eating at a restaurant.", "NTA vut ifyou were in front of mr i would say YTA for not sharing one with me.", "NTA. People like your SIL are why people hate vegetarians/vegans.", "Here's how life works.\n\nYou can eat or not eat whatever you want, for whatever reason you want. But...\n\n...you don't get to tell me what I can or cannot eat.\n\nI would have made sure the burger was rare.\n\nNTA", "NTA\n\nDoes she expect no one to ever eat meat again in her presence?", "ESH.\n\nVegetarianism is a legitimate life choice on ethical grounds.  But people cannot force their ethical choices on these sorts of matters on others.  Being preachy is always a bad way to make a point as well.  Her choices are to respect your different choices or not have meals with you.\n\nThen again, you sound like you were rubbing her nose in it a bit.  So a mild ESH.", "NAH. You can order what you want, whenever you want it. Your sister can also choose to not eat around people whose political and moral choices upset her. In the future, maybe you should both do that, and eat fewer meals together", "NTA your food doesn't affect her", "NTA-Her running her mouth to complain about the amount of meat on the menu or telling all of you shouldn’t eat meat doesn’t mean you have to go along with it. Apologies are owed to you. You don’t owe an apology to anyone.", "NTA - someone can choose all day what they eat and cam be vegetarian. They cannot choose FOR YOU to eat in a way that pleases them.", "NTA. Her personal choice period.", "nta", "Making a life choice for yourself doesn't mean you get to force that choice on others. NTA", "She doesn’t get to dictate what others decide. NTA", "NTA\n\nVeg heads just being veg heads. Lol. Ignore them. I do", "Nta. She can’t enforce others to not eat meat, because she is disgusted by it.", "NTA, my gf is vegetarian and encourages me to eat whatever I want when we go out, meat or no meat.", "NTA If she was that opposed to anyone eating meat, then why did she agree to go to that restaurant? Why give the evil meat purveyors her money? \n\nIt is not like you brought a burger to a vegan restaurant, you ordered off the menu. She doesn't get to pick what others eat and it sounds like SIL wanted to try and shame people (in public no less) about their food choices which is a dick move. Hope she left the poor restaurant staff alone.", "Nta I eat meat in front of vegetarian friends all the time and they don't care bc *I'm not vegetarian*", "No, I would have ordered the same thing. My sister & her husband are vegans. If they don’t want to eat with me it’s their problem.", "NTA, I would have ordered a medium rare porterhouse. \n\nGood for you. \n\nShe should apologize", "Under no circumstance should you apologize!!!! No no no!!! She’s why vegans and vegetarians have a bad name. Her food choices are hers and your food choices are yours. My family had to eat gluten free. In our home we ALL eat gluten free. When we go out my husband is welcome to eat all the gluten he wants (even though it makes him feel crappy LOL...it’s his choice). I will never make a comment about his choice and neither will our kids (5 and 12) bc they understand why we can’t have it and that daddy’s body is different. In fact when we go out on date nights I encourage him to get whatever he wants even if it has gluten bc it’s not my job to monitor his food.", "NTA", "People that have dietary restrictions, either by choice or by misfortune, have to live in a world where other people get to eat what they want. That's just how life is and we need to learn deal with it.", "> There's no law covering \"bystander trauma\" (Phil Hartman, RIP).\n\nMy favorite from the Green & Fazio skits was [Chris Farley's claim](https://www.nbc.com/saturday-night-live/video/green-fazio-financial-security/2860968): \"The construction site was posted 'No Trespassing', but let's be frank: what does a 'no tresspassing' sign mean when you're as drunk as I was? They can have their 2.6 million back, but who'll give me back my tooth?\"", "[removed]", "If anything, the only thing you owe anyone is explaining that you didn't even pay attention", "The standing joke about vegans always going on about it is, in my experience, not true. I have many friends who are vegan or vegetarian and none have never moaned about me or anyone else eating meat in front of them (some of them will cook meat dishes for visitors (I never expect them to), in the same way, I would cook vegetarian or vegan dishes for them). \n\nShe should have suggested a vegetarian restaurant if she didn't want anyone at the table to eat meat.", "Or ribs.", "Bloody rare", "SIL can't bite her, SHE'S MEAT! lol", "Aww, thanks for the award, Anonymous Redditor!", "In most places, \"vegetarian restaurant\" isn't really a thing. But maybe the SIL should just go to fewer restaurants with others", "My husband ate just a portion of fries that day because he had a big lunch with friends normally he would alsoneaten something with meat if he wanted something savoury. He has my back that I eat what I want", "For every vegetarian/vegan person I met who behaves similar to that, I've encountered 50 meat eaters who do the exact same thing if not worse. You can't seem to have a meal as a group where the non-meat-eaters don't get questioned and pestered about their \"why's\" and slapped with whataboutisms. It's nothing to do with vegetarianism or veganism. It a problem of assholes projecting and offloading their insecurities onto others.", "One of my favorites is: you meet someone that is vegan and does Crossfit. Which do they tell you about first?", ">A vegan, an ~~atheist~~ evangelical, and a crossfitter walk into a bar. Within 2 minutes, everyone at the bar knew…..\n\nFixed that for you.", "May I ask what this is about atheist and crossfitters?", "That's pretty good.", "THIS is the answer... she's FAR more offended that you didn't cave into her manipulation than for anything remotely related to eating meat", "> Maybe find a good argument for eating meat. So when your SIL tells you that you are living life wrong, counter with why people were born to eat meat and that we have been omnivores since the start of existence.\n\nNo one has to justify their eating preferences. And the biggest problem with vegans who try to impose their agenda on others is this moral argument excuse, which leads nowhere. This kind of thing is best left at \"I respect your eating choices; respect mine. Thanks.\"", "Don’t argue. The point is no one should be discussing this at meals or feeling they have to justify themselves.  Don’t open the door to that. If she is well read on this subject, there is no argument you can throw she hasn’t heard before and doesn’t have an answer to.", "Most vegans/vegetarians are really nice", "The amount of times someone replies to someone who doesn’t eat meat ‘having a massive steak tonight’ is way more than I’ve ever seen a veggie or vegan comment under a meat eaters post \n\nGenuinely want to know where these ‘crazy none meat eaters’ are that everyone raves on about knowing", "Except for the ones you don’t notice, because they’ve never been an ass about it.", "You mean the same way people who eat meat impose their lifestyle on people who choose not to eat meat?", "OP explicitly states they stopped listening and that they had been craving a burger for weeks. How is that rubbing it in the SIL’s face?  The SIL had *nothing* to do with their burger order.", "It super sucks not being able to eat what others eat, but I also know I feel better when I don't eat gluten (celiac disease). So while my options are limited, I won't make a stink about others eating and enjoying gluten in front of me.", "BWAHAHAHAHAHA!", "Ordering veal would likely really get under her skin", "LOL", "LMFAO... You win!!! I came here to be like but she's vegetarian 😭🙄🤣", "It's good to hear he's with you on this. You did nothing wrong.", "Tell her she has nothing to say, she isnt even vegan. Consuming dairy and no meat is arguably worse than consuming meat and no dairy. Shes trying to look like a saint when she is really not.", "I have to agree to a certain extent and apologize for my wording, there are annoying meat eaters as well. There are assholes on both sides.\n\nEven though I still would differentiate. I have many vegan/vegetarian friends and they let me eat what I want and I let them eat what they want.\n\nBut then I also met vegetarians/vegans who really had the urge to shove their beliefs into my face, out of the blue - whereas most of my vegetarian friends dont even get recognised as vegetarians - they just order something without meat and leave the topic be. I think this \"being on a mission\" behaviour triggers a lot of meat eaters to mock them/ask stupid questions. Still not right, but I think there is a difference. And unfortunately (at least from my experience) it is true that many vegans/vegetarians need to let everyone know they dont eat meat and why and their conversations often seem to be centered around their lifestyle.  \n\n\nEdit: Typos, my English apparently sucks lmao", "Yeah I was vegetarian for a bit (still eat plenty of meals without meat) and people used to give me a hard time and act like I was malnourished or something or an affront to them just eating what I wanted and avoiding animal products. I’ve never been zealous one way or the other, but more “carnivores” (obviously omnivores but meat evangelists) have been annoying to me than self righteous vegetarians, especially when I was a younger woman and lived in the South. When I lived overseas, one country I lived in literally many people didn’t understand vegetarians don’t eat seafood either but at least they tried when I explained a little and had the language barrier as an excuse.", "Their MLM scheme.", "It's just a joke - vegetarians, atheists and crossfiters are very vocal (annoyingly so) about how they are in fact vegetarian/atheist/do CrossFit", "You are 100% correct.   No one HAS TO, but there are plenty of people that will tell you that you have to.    Not just about your diet, but religion or any political stance.  Just telling some passionate, inconsiderate person that you don't believe they way that they do on something will generally not end the conversation.  \n\nThat is the route that I take IRL, but I have a lot of patience and am not passionate about enough things, that people usually get exhausted trying to spread their wood with me.", "Exactly that’s why I’m confused on the comments!", "Ah! Won't even bother.", "We found the SIL!", "Same here. I can't eat any grain products or sugar. I leave others alone about their dietary choices and don't expect any special consideration for mine.\n\n But it really irks me when people wave sweets at me and say things like,  \"oh this one little bit won't hurt.\"\n\n Yes it will", "And a lot of meat eaters I know. It's super sad bro. Some things just aren't humane.", "What’s veal?", "Oh that would do it for sure.", "Can you even find veal any more?  Yum.", "And that's exactly why I said it.", "As a vegetarian, I'd say some of it is probably a learned trauma response. Literally half of the people I tell I'm a vegetarian ask me to immediately explain myself. Maybe one out of ten insists that they're going to eat more meat just to punish me for it. What you see are the occasional vegetarian/vegan who tries to treat others the way they get treated", "I genuinely want to meet one lol\n\n(Am on the side of NTA on this btw) just wondering where everyone in the comments is meeting these people and getting this idea from that they do that as I’ve never met a vegetarian/vegan who has\n\nUnless people just upset they’re not eating meat", "Lol not even close dude", "I didn't say that I agree with the methods of raising most veal, chief", "Veal is calf meat (young cows, not people legs LOL), usually taken at 6 months old or younger.\n\nThe young age that they are slaughtered is upsetting to a lot of people, but the bigger issue is the conditions that many veal calves are [raised](https://en.wikipedia.org/wiki/Veal). Some of the worst practices have been banned in most parts of the world, but even so many of the methods of raising veal are still considered cruel by many people", "It's beef that's under a year old. There are various types and most come from the dairy industry. It's easier to find humanely raised veal these days thankfully. A few years ago we got half a calf that acquaintances had raised until it was a just under a year.  It was delicious, but it also lived a happy little life and was killed humanely. Not everyone is going to be a vegetarian, but making sure you try to source your meat from ethical sources helps.", "Baby/young sheep. Supposedly its more tender than lamb\n\nEdit: apparently it's calf meat, not sheep. Whoops. I just knew its baby animal and expensive where I live. I don't personally feel right eating it for several reasons; killing something before it has a good chance at life is a waste to me no matter how good it tastes. I prefer wild game for that reason, or we buy discounted/clearance meat so the animal's death wasnt in vain", "Veal is calf meat, more tender than an adult cow.  My mom used to put veal and pork into her tourtières 🥧", "I think it’s deer or a baby cows meat.", "General practice for veal is to remove the calf from its mother within 72 hours of birth and raise them alone in a stall with enough space to stand, lay down, and stretch, but not much else. They are also usually fed a specific milk or soy based diet for their entire lives (3 weeks to 9 months.) The restrictive diet and movement restrictions in theory make the meat very tender because the muscles don't get worked very much.", "mmmm lamb  :)", "The way I read it in my head made it even more amusing. Thank y'all for a good morning chuckle🤣", "My sister is vegan for years now, and she mentioned it a few times, but that was it. I asked her whether or not she got a lot of stupid comments and she said not many. She is also annoyed with vegans/vegetarians who \"are on a mission\". Of course, we also dislike \"meat eaters\" on a mission. Its interesting, her becoming vegan also made me reduce meat consume because we used to casually talking about food and health, no blaming, no offending, no whataboutisms. But if I imagine her telling me to stop eating meat and trying to convince me, I probably would still eat as much meat as before, haha. Sounds stupid, but lets be honest, humans are kind of stupid. \n\nI dont know, for some, what you say might be true, but it still is counterproductive,  it becomes a vicious cycle in which both sides radicalize themselves. \n\nOf course, all of this is anecdotal. The reactions you get heavily depend on where you are from and what kind of people you meet. I live in a big, quite liberal city in Germany.", "sweet dude 🤙 glad to hear it", "Veal is calves, not lamb.", "deer is venison and it's delicious", "Thank you all for explaining.", "Yeah, Germany is actually one of the most vegetarian countries in the world (roughly 10% vegetarian). That's about twice the rate in the US, and while it's usually not that bad in the cities here, folks who just moved from rural parts of the country will get suuuuuuper nosy about my diet.", "Thanks for the correction! I edited my comment. Now I'm over here looking up whatever I confused veal with. Lol", "Her brother is right, his sister does \"suck.\" No need for any apology. She has a right to her choice and you to yours. What she doesn't have a right to is to expect others to live her lifestyle because she says so. She should have checked her privilege at the door.", "Man, I would have made yum yum noises after every bite. NTA. Now I want a bacon cheeseburger.", "Wait until she finds out what animals do to each other. NTA", "NTA\n\nBy her logic you could swap this saying that because you are carnivorous she offended you by not eating meat. Like everyone else here, her food preferences do not and never will dictate what anyone else in this world eats", "NTA \nI have been a vegetarian for 14 years and I would never dictate someone else’s food choice. My body, my choice and vice versa.", "Life long veggie here - NTA its got nothing to do with her what you eat. I was always pressured by meat eaters growing up to try some meat and now as an adult would never pressure someone into changing their lifestyle or diet.", "You may be the asshole, but I'm clearly a minority.\n\nYou're sister in law is passionate about what she perceives to be an ethical issue, and you (essentially) flaunted in her face that you do not care. Your sister in law should choose a better time than a meal to preach her beliefs, but you easily knew she would be offended by what you did.\n\nI think to understand if you really are the asshole you should consider how you would feel if someone flaunted a moral belief you hold in front of you.", "NTA. When did people become so entitled to the consideration of others on that level? If she was so bothered her ass could’ve left. If someone in public starts taking a dump I’m not going to stand there, watch, and say ew, I’m leaving.", "NTA her choices are her own. She can’t tell others how to live. If she doesn’t like it she can eat alone at vegan only restaurants.", "NTA, she's a pissy little shit", "NTA. You weren't being intentionally cruel or rubbing her face in it, and you hadn't agreed to forego meat in advance. I eat some animal meat, and while I personally choose not to do so around friends who are vegetarian/vegan, I would stop hanging out with someone who tried to control what I consumed around them. She lives in a culture in which that's normal, and she has to learn to deal with that. We all put up with stuff we disagree with; that's part of living in a free society. If she's that uncomfortable, she can choose to limit her circle, but has no right to dictate what those who are currently in it do.", "NTA, she doesn’t get to decide what everyone else eats.", "NTA, she sounds like an annoying person who can't shut up about being vegetarian, as well as trying to dictate what people can/can't eat.", "Absolutely not! Definitely NTA -  She’s a vegetarian , good for her, you’re not. So there’s no reason for you to not eat what you want. About telling you what you should and shouldn’t eat 🤣 what sort of entitlement is this. Next time tell her go eat her veggies and mind her own business", "I really want a bacon cheeseburger now. It sounds like it was delicious!", "NTA, Should've ordered some bacon to go, for the car ride back. eat whatever you want", "NTA: it’s her choice to be vegetarian and yours not to be. She knew that you were a carnivore when she agreed to go out for a meal with you, so unless you have come to an agreement not to eat meat in front of her you’re NTA.", "NTA- Yeah if I ate a whole vegetarian main my IBS would punish me for days. Bet she'd love it if someone described those consequences at the dinner table. I hope she pushes the wrong person one day and they get really graphic with her.", "NTA", "It depends on if you did it to spite her or if it was something you would have ordered regardless. As a veg, people will get a meat lovers pizza, shove it in my face, and “mooooooo”. And I don’t say shit to people about their choices. I just chill with my own food. So intention weighs more here imo.", "NTA. English is my second language too. I'm a vegetarian, and I would never be mad at somebody, becouse they ate meat in front of me. That's not right. Everybody has the right to decide what to eat.", "You are NTA, but she might have legitimately thought that you were doing what you did in order to provoke her.", "NTA and this is why people can’t stand vegetarians and vegans…their view is the ONLY view and if you don’t agree then you’re a monster, right?  \n\nInsufferable, self-righteous zealots. Your SIL crossed a big line and owes you an apology.", "No.  The world does not revolve around her and you need to tell everyone else that.  Tell her to eat what she wants to eat and you eat what you want to eat.  She does not have the right to dictate to you what you should eat while in a public setting with her.  When you eat in her house, then you eat what is given to you, but not out in a restaurant.  She has no say.", "NTA. She’s the reason why so many people hate Vegans and or vegetarians. They constantly shove their dont eat meat rhetoric down everyone’s throats and then wonder why people stop talking to them. To them I say for people who don’t eat meat you sure are obsessed with finding alternatives that taste exactly like it.", "NTA. You don't have to modify your diet because other people have chosen to modify theirs.\n\nMy husband and I are Jewish and keep kosher. We will eat vegetarian/pescatarian in non-kosher restaurants. I have had multiple friends get all nervous around us because they wanted to order something like a bacon cheeseburger or a bowl of clam chowder. I don't mind. We do what we do and they do what they do.", "NTA. But it probably wouldn't hurt to be the bigger person and apologize anyways. I'm not saying it is right but it is what I would do.", "Tell sis that you are a member of the SPVV - the Society for the Prevention of Violence to Vegetables.\n\nShe got to eat what she wanted, why can't you eat what you want.", "Did you suggest she order what you did?\n\nDid you suggest she order some other meat-based item off the menu?\n\nDid you stare directly into her eyes while taking a juicy bite of your succulent beef burger with extra bacon, and make \"[yummy sounds](https://youtu.be/xKpYI0mwdEs)\"\\* while doing so?\n\nIf you can answer all the above with \"No,\" then you are NTA.  (I'm going to go ahead and assume you can.)\n\nI may question the sanity of others for some of their choices, but I do it in the privacy of my own head.  If I made a choice, they can too.\n\nHer proselytizing for veganism/vegetarianism at a meal is very much AH behavior.\n\n\\* Thanks to Mel Brooks/Gene Wilder, and Marty Feldman.", "NTA. She has the right to her own personal beliefs but not enforcing them on others because that is what A H’s do.", "NTA\n\nNOTHING gives anyone else the right to impose their own life choices onto others, be that vegetarianism, religion, political views, or otherwise.", "Your body your money your choice. NTA", "I'm a lifelong vegetarian. You are NTA.\n\nAlso, if she cares so much, why is she not vegan? If you're feeling petty you can ask her why she drinks milk next time you see her lol.", "NTA. As I always say, if it didn't have to suffer and die to get on my plate, it doesn't belong on my plate.", "NTA\n\nSounds like she's a vegetarian for purely moral superiority reasons and ignoring her as you did is the worst possible crime you can commit against people like that. She doesn't give a shit about the meat, she's angry that you didn't bow down in awe of her piety.", "Like most people now ive been guilted to avoiding veal, but everytime that one aunt rides in all high and mighty I want to order a 72 oz veal with extra blood", "Nta!!! A vegetarian this side, all my friends are non veg eaters and they eat it with me being their with them. I dont go moping around them aa they eat meat", "NTA and your SIL needs to get over herself. I've been a vegetarian for over 50 years and I'm married to an omnivore. He has consumed meat in front of me for almost 40 years. It's his body and his choice, just like being a vegetarian is my choice. Your brother and SIL need a major reality check. They don't get to be the food police for anyone but themselves.", "NTA\n\nI was a strict vegetarian for 17 years. I *hated* when other people commented on what I was (or wasn’t) eating so I made a point to never comment on other peoples’ food choices. It goes both ways. \n\nIf your SIL finds value in making what she believes are more ethical choices, that’s cool. Trying to force that very personal set of ethics onto another person is never okay. \n\nBurgers are delicious. Bacon is delicious. Life is short and painful and you have every right to grab joy wherever you can. She had no right to try to quash that.", "NTA\nIf she’s concerned, then everyone should have gone to a vegan/vegetarian restaurant. People don’t get to dictate what you eat. She’s being a jerk.", "Nta and also lmao that it was the *extra* bacon that triggered her.", "NTA - she is not the one to dictate food choices. If she has a problem eating out with non vegetarian she should stop eating out with them. But why should you change to her like?", "NTA", "Yta, animal cruelty is no fun.", "Speaking as a vegetarian: clear NTA. Dietary choices are personal choices. Nobody should tell me to eat meat so I should likewise never tell anyone else not to eat meat.", "NTA.  Just because she doesn't eat meat doesn't mean you have to stop eating it too.  Dealing with people that try to force their lifestyle on you is ridiculous and exhausting.  Next time just tell her you will stop eating meat when cows, pigs, and chickens stop being delicious.  If she keeps harassing you just start texting her pictures of your dinner every night.", "NTA. I have a very good friend I’ve known for years.  My wife and I have probably been out to eat with him and his wife a hundred times. I’ll bet I knew him 10 years before I realized he was vegan.", "Vegetarian here, I never complain when others eat meat. It’s just rude. Your SIL sounds super entitled. I wouldn’t go out to eat with them again. Your life choices are none of her business. NTA", "NTA. She was shoving her beliefs down your throat trying to choke you…you ignored her and ate what you were craving.", "NTA\n\nCan someone please explain why it is in these stories that parents/inlaws/aunts/second cousins once removed pop out of the woodwork to chastise others?  I really don't understand this.  Doesn't anyone mind their own business anymore?", "NTA.  Don't apologize.  Everyone is entitled to make their own food choices.  Your SIL is a sanctimonious control freak.  What you choose to eat is none of her business.", "YTA", ">She was really mad and told my husband and her family and her other brother texted me (she also did) how childish and messed up I was to order meat just to show her she sucks.\n\nI believe that she showed you all that she sucks without needing any help from you. \n\nUnless the person I am eating with would be harmed by my choices (such as an airborne allergy where my food can cause them to have an anaphylactic reaction), what is on my plate is my business.\n\nNTA", "NTA - Sounds like the SIL needs a steak or ribs. Eating all that cow food is making her uptight. Maybe it's the carrots screaming before they are steamed.", "NTA. \n\nShe's allowed her opinion.  **So are you.**\n\nShe's allowed to eat what she wants to eat.  **So are you.** \n\nIf she's going to be offended by what you eat, knowing you eat differently than she does, why in the world would she agree to eat out with you in the first place?   \n\nThis is a matter of respect.  You respect her right to eat how she wants to.  But, for some reason, **she thinks she has a right to demand from you** that you do not eat what you want to, but that you comply with her demands.   **That's control issues.**  **It's not about the food anymore, but about her thinking she has a right to put herself in control over your decisions**.   She obviously doesn't.   Anyone who is complaining to you about your decisions, is joining her in demanding that she be in control over your decisions.  Don't listen to them  They are wrong.\n\n**Do not apologize.  The apology is owed TO you**, not BY you.  **She should apologize for demanding that you comply with her food choices, instead of respecting your right to eat the food that you like.**", "NTA if she wanted everyone to eat veggie go toa  vegetarian restaurant.", "NTA she doesn’t get to control what other people eat just because she doesn’t like it. I hate all fish and seafood but I wouldn’t go to a place that serves it and complain about anyone eating it.", "...then she shouldn't have gone to dinner with you, NTA.", "NTA! Everyone should be respecting eachothers diets and not going crazy about it. Even if you were paying more attention to her little rant about meat its your body. \n\nHope that burger was amazing!", "apologise? for what just cause she doesnt eat meat means everyone else cant. who does she think she is. if anything its her that owes you and apology for trying to force her beliefes on you", "NTA \n\nShe chooses to be a vegetarian just as you choose to eat meat, can't argue for freedom of choice and only tell people to eat as a vegetarian.\n\nNext time chomp on three burgers in front of her", "NTA\n\nHer lifestyle isn't yours to live. It's hers.\n\nIf she's upset it isn't because of the bacon (or not mainly because of it). It's in her wording - she's angry she failed to convince you. \n\nShe should've ordered veggie appetizers in advance to quell hunger before trying to preach her lifestyle if she wanted to be listened to.", "NTA. Do not apologize to family terrorists. On the other hand, also don't eat with them. I wouldn't invite such rude people to anything.\n\nYour SIL is exactly why so many people hate vegans and vegetarians, and I do mean \"hate.\" I don't hate them, but I don't eat with them after one experience with meal-shaming.", "Hi. Reformed vegetarian here. I stopped being vegetarian for health reasons. Years ago when I quit meat, I did it cold turkey and it was so easy. Today I wouldn't be able to. I fell in love with samgyupsal (Korean BBQ pork belly) and bacon and there's no going back. I totally understand the need for extra bacon on your bacon burger. \n\nWith that said, the world doesn't revolve around your sister. Your food choices have nothing to do with her, you would've ordered the same thing even if she wasn't there. So no, you have nothing to apologize for. NTA.", "NTA. What we each eat is determined by individual likes/dislikes, dietary requirements/restrictions, cultural/environmental/ personal beliefs. If you don’t agree with or like what I eat, that is your right, but your right ends at the inside of your lips…meaning keep it to yourself. I don’t have to listen or adjust my intake to your opinion. Rather…pray for my soul…quietly…to yourself, as I will do for you…for the things I don’t like or agree with where you are concerned.", "NTA\n\nI haven't eaten meat in over a decade, since I was a teen, and i would never be offended by someone eating meat at a restaurant in front of me. \n\nSeems entitled and like she's a real asshole here. \n\nIf I invite you to a homecooked meal that I'm making, I won't cook meat for you (genuinely don't even know how) but I would never ever expect you to not eat meat in front of me", "vegan for over 12 years here - you are NTA, but your SIL absolutely is. it is none of her damn business what anyone else eats. nobody wants to be preached at. \n\nalso, if she's vegetarian for ethical reasons and going so far as to harass people around her, she should probably look into how the dairy and egg industry directly contribute to veal and the murder of millions of baby animals lmao. will she still be so righteous when she finds out she's causing the very thing she's blaming others for?", "NTA. I'm a vegetarian and I have been one for nearly 40 years, yet I still cook meat for my son and his friends.\n\nI don't like the way meat is produced in this country and I definitely don't like the way animals are often treated in general, but I don't foist my beliefs and preferences onto others. I think that we vegetarians and vegans have the right to our own behaviors and attitudes, but we don't have the right to take a \"holier-than-thou\" stance and make life harder for others. It's obnoxious and unhelpful.", "NTA, next time order as much meat as possible and look her in the eye while eating.", "NTA. Even her brother and the rest of her family admitted that she sucks. At least that’s how it reads to me.", "Vegetarian here.\n\nNTA at all. Your SIL sure is though.", "Nta, obviously. Your SIL seems pretty entitled.\n\nYou know what would be childish and fun? Plan a trip to Germany and make a video of you eating a mettbröttchen. Its raw minced pork on bread, with onions.", "NTA. I'm vegetarian and wouldn't dream of policing anyone else's eating habits. Any time I go out to eat I'm always the only one not eating meat, and am just grateful if the restaurant has more to offer me than a salad or macaroni cheese.", "Definitely NTA. Other people are not required to abstain from eating meat because she chooses to be a vegetarian. If this is such a problem for her then she needs to only go out to eat with other vegetarians.", "NTA. The reason vegans and vegetarians have a bad reputation is the few people like this pushing their choices on to other people.", "NTA. If she wants to be one of those types of vegetarians, then she needs to not be accepting invitations to establishments that serve meat.", "NTA. Why do all these assholes think the world revolves around them?! You didn't order a burger to \"own\" her or prove any kind of point. You just wanted a burger!!", "as a vegetarian, you shouldnt. nta", "You had me at bacon….🥰\n\nYou think she’s bad now, wait till she goes fully vegan.  The wheels will really pop off THAT bus.", "NTA. I’m a vegetarian and would never dream of dictating what someone can and cannot eat. I’m not going to enforce it on others.\n\n\nIf it bothered her that much, she should’ve at least tried to find a vegetarian restaurant.", "NTA", "I’m vegetarian and my boyfriend is not and I never stop him eating what he wants, I do suggest he eats veggie food when I’m making a veggie chilli or bolognaise \n\nP.S on my boyfriend’s account", "NTA. Next time order a bloody steak and eat it slowly in front of her.", "NTA. And when people would say I exercise and I'm slender so I cam afford to eat the heavy foods or desserts they're pushing, I tell them I don't choose to eat them...that's why I'm strong and slender.", "NTA. Veggies who spew this moralistic agenda on others are.", "NTA. I really hate these kinds of people.", "This reminds me of the old religious adage:\n\n“My religion forbids this, so I can’t do it” (OK)\n\nvs.\n\n“My religion forbids this, so you can’t do it” (not OK)", "OP didn't even say that SIL sucks😂😂her family are the ones putting words in OP's mouth. NTA", "This would make you an asshole. If you change your behavior to spite and piss someone off, that's an asshole move. \n\nYou could be justified, but it's still petty.", "Damn, take my upvote", "I could go for a nice Prime Rib...", "Give it a back story, name the cow and give it a history etc", "Is it wrong for a person to talk about and propose to others to do what they understand to be moral? If you see someone doing something you understand to be bad should you not say anything at all? \n\nYou may take this to be an issue of diet only, but a vegan takes it to be an issue of animal welfare. You and OP's sister are both lacking in a willingness to understand others.", "Agreed \n\nI have an eating disorder, ARFID caused by my autism. \nI would LOVE to be able to eat certain salads, but I can’t because of the textures doesn’t matter that I think they look and smell great, if I put the food in my mouth I will start gagging until I’m physically sick. \n\nDo I stop people ordering them? No. I will sit with my safe foods or I will eat before hand (though my circle of friends are amazing at making sure I’m accommodated) \n\nPraise to her for being vegetarian, I believe everyone who can should try lower the amount of meat they eat or try buy foods local to them (like meat from the local butchers and vegetables from the local grocer)  but that doesn’t mean she can enforce her dietary choices on others. \n\nNTA OP", "You don’t have that discussion at a restaurant in public that you all decided to go to. If you’re that much of a shy violet about meat a polite “hey, I know this great *insert vegetarian/vegan restaurant here I want to try, want to have a food adventure with me?” instead of being a controlling dick about someone else’s diet.", "If someone asked me, \"Would you consider going vegan based on my arguments?\", I would debate the topic in a civilized way. But if someone told me I SHOULD go vegan, they can very well F off, because that is not proposing an option and it doesn't even mean they are right in their logic and that my current choice would be immoral, that is trying to impose their choice on others and it's wrong.\n\nAnd it goes the same when it comes to other topics as well. It's fine if you propose something, but the moment you try to impose it on me then we'll have a problem.\n\nAnd please refrain from making judgment about me.", "THIS. OP is the type of person who gives vegetarians a bad name. Quite a few members of my extended family are vegetarians. But they certainly don't go lecturing others about what they can and can't eat. SIL was rude as hell and way out of line. SHE owes YOU an apology. NTA", "In my comment on OP's post I did say that her SIL should have found a more appropriate or opportune time to preach her beliefs. No disagreement there. \n\nBut this isn't an issue of diet to the SIL, it's a moral issue more akin to abortion rights than a diet. Is there a wrong time to voice support for animal or human welfare? Gay rights or civil rights?", "You are right in that 'You should do x' is the conclusion of an argument and the person should offer reasons for why you should do something. You being offended at someone telling you that you should do something is telling. \n\nYou should respect others rights. You should not be racist, homophobic, and so on. You should deal fairly with other. You should not kill, rape, or steal. Are you offended at these 'shoulds' as well? I doubt you see much an issue with imposing these on yourself or others, so it seems the real issue is your disagreement with the content of OP's SIL's 'you should be vegan.'", "Yeah, I hate it when atheists knock on my door to tell me gods don't exist.", "Exactly. I really wish people would just respect my needs and not push that I can have just a bit.", "I've made choices that are more \"ethical\" than medical and it kinda freaks me out how people go on about bacon ... but I keep my opinions to myself in company, unless asked.", "You’re comparing things that aren’t on the same level, here. Please don’t be one of those people that equates POC/queer folk with animals.\n\nProselytizing at the dinner table about something someone eats is rude af when you agreed to go to dinner there with them.", "Now you're just engaging and words play. I clearly established the kind of use I'm giving to \"should\" by stating both scenarios, and you're twisting it with an equivocation.\n\nAlso, being vegan isn't remotely in the same ballpark of not being racist, homophobic, not killing, raping, stealing, etc.\n\nNice try, though.", "It still kind of boggles the mind that people still give people who are vegan/vegetarian crap. I'll admit, in my younger years I might have been impertinent enough to ask why someone is a vegetarian/vegan but it was just curiosity. These days, I don't even bat an eyelash. The only time further discussion would be warranted would be if we were going out to eat or hosting an event, in which case I may double-check to make sure there's something available for them to eat. \n\nHonestly, the vast majority of vegetarians and vegans I've known are pretty chill and are usually exremely grateful when folks take the time to accommodate them.", "They do that when they think you are on a weight loss diet. It's just plain good health for everybody to maintain their weight. But somehow people feel the need to sabotage weight loss diets. But not any other health issues.\n\n I tell people it's a medical condition. That helps some. Unless it's some extra delicious juicy dessert that they wish they had the willpower to refuse", "Good on you for taking your stand without being obnoxious", "Slightly off topic, but every time someone mentions veal, it reminds me of something that happened with a good friend and former coworker of mine who's French. She was at a work conference in Texas and there was an excursion for everyone to a ranch just outside of Dallas. They came across a corral with a cow and calf, and she pointed to the calf and said, \"Oh, how cute, a veal!\" Everyone was kind of shocked at first because they didn't know that \"calf\" in French also means \"veal.\" Needless to say it became something of a legendary inside joke at the company.", "That's exactly it. I have lost a significant amount of weight after diagnosis and now people are asking me for weight-loss advice. \nThe same people who have known that I spent almost 4 months in bed sick in 2022.\n\n\nThey think because my body is smaller that I am healthier", "I am not totally without obnoxity but I work on it :D", "I do several fiber arts and have always chuckled at the idea of sheep being \"pre-yarn.\"", "We are all improving at something if we are moving forward"]}