{"id": 6308, "submission_id": "101gg8h", "title": "AITA for asking my mom to just go along with my fiancee's boundary even though it is hurtful?", "selftext": "I am currently planning a wedding with my beautiful fiancee \"Annie\" My mom and Annie had a meh relationship. They aren't crazy about each other, not particularly close, but they don't have many issues. My mom and I have never been close, so it isn't like one of those crazy MIL situations, just everyone is luke warm about each other.\n\nAnnie has an anxiety disorder and does attend therapy, though it is not entirely under control. She tends to worry about situations which are very unlikely to happen. Annie recently found out that my mom at one point intentionally spilled something on a bride at her wedding.\n\nNow this was decades ago. She was 16 and absolutely obsessed with my father who rightfully wanted nothing to do with her since she was 16. She was extremely jealous of his first wife and \"accidentally\" spilled something at the reception. Annie only found this out because my dad thinks it is a funny story to tell. My mom was a completely bratty out of control teenager who did mellow.\n\nWell the issue is Annie now is worried my mom could do the same to her. I tried to reason with her that my mom in no way hates her and why would she. Annie admits it isn't logical, but claims she can't help it. She says my mom doesn't love her either and some MILs just get like that. She set a boundary that my mom can't have anything in her hand if she approaches us at the wedding.\n\nMy mom is obviously hurt as she would never do something like that. I get it is a hurtful assumption, but I asked her to just suck it up and deal with it. It is Annie's big day and she doesn't need any stress. My mom said I was treating her like she's crazy for something she did in high school and it is hurtful. My dad (who is paying for the wedding if it matters) is absolutely furious and currently won't even talk to Annie. I get their point, but I am still asking them to just suck it up and go along for one day.", "created_utc": 1672676261, "permalink": "/r/AmItheAsshole/comments/101gg8h/aita_for_asking_my_mom_to_just_go_along_with_my/", "score": 459, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am asking my mom to go along with a boundary which feels like a punishment for something she did at sixteen. I personally wouldn't like to be judged for stuff I did as a kid. I don't think there is any chance she would do that to Annie, but I'm still asking her to suck it up and just go along as to not cause drama.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. I have an anxiety disorder, it isn't up to other people to accommodate my distorted thinking. Your fiance is experiencing distorted thinking. Your mother has never done anything to harm your fiance, and holding the bratty actions of a teenager over their head 40+ years later is pretty ridiculous.   \n\n\nWe don't indulge distorted thinking. We use coping skills to see that thinking for what it is, and then employ even more coping skills to tolerate distress.", "INFO- your mom, when 16yo was at your dad's FIRST wedding ?   AND was so obsessed with your dad that she spilled a drink on the Bride's dress...?\n\nWtf\n\nNow you have  \"meh\" relationship with your mom... dude, get some therapy to unwind this f'ed up orgin story for your life!", "your fiancé needs help, as requests like this are only going to get worse and more unreasonable down the road. having a rule that your mother isn’t allowed to hold a drink in her hand around you is ridiculous. it’s condescending, and treating your mother like she’s a child because of one small thing she did *when she was a child*. \n\nYTA - and I can guarantee your fiancé will continue to push requests like this onto you in the future since you folded to this one.", "Big thing to ask of your parents who are footing the bill.", "INFO\n\n>they don't have many issues.\n\nWhat issues do they have?", ">It is Annie's big day\n\nPretty sure Annie isn't marrying herself. \n\nINFO\n\nYour mom knew your dad as a teenager?", "YTA. Annie can’t expect the world to bend around her anxieties. This is probably just the start of a long line of demands like this. If you think about your relationship, you’ll probably see that it isn’t the only time Annie expected other people to change to indulge her irrational fears. If I were your mom, I would probably roll my eyes & go along, not because I think it’s the right thing & certainly not out of any regard for Annie, but because you can’t fight irrational people. If Annie is hoping to improve her relationship with your mom, accusing her of planning to dump something on her wedding dress isn’t the way to do it. Your father already won’t speak to her.", "So your just gonna gloss over the whole your mom being 16 at your dads first wedding thing?? Curious Redditors need to know more about this", "YTA   I honestly would put a pause on the wedding until your fiance has had a chance to go to therapy. I have anxiety too, but I don't expect others to accommodate it.", "YTA - Elope or get more therapy before the wedding.  I'd rather unpack the whole \"my MoM wAS 16 at MY dAds 1st WeDdIng and spilLEd a dRInk on the BrIDe out of jEAlOUsy over yOuR DAd\".  Then married him!  Wow.  That is more than just High School hijinks.", "If you're going to hold something against your mom from decades ago before you were even born, be prepared for (and accept) that same treatment of your wife and her \"eccentricities\" in the future. YTA", "YTA to your mom and your fiance. I hope your father decides to back your mom and withdraw funding for the wedding. Maybe everyone's opinion will get more in line with reality.", "YTA for 1) undervaluing your \"beautiful fiancee's\" anxiety and 2) for using the \"beautiful\" adjective like you're trying to sell us a run down mobile home next to a freeway.", "YTA. I mean...your parents are paying for this and you and Annie have basically turned to your mother and said you don't trust her not to sabotage it. Yes, she's hurt and she has a valid reason to feel hurt.", ">My mom is obviously hurt as she would never do something like that.\n\nExcept that she did do \"something\" like that, didn't she...", "Yta\n\nThat is not a reasonable boundary. That is way outside reasonable. What’s next, mom isn’t allowed to open her mouth for fear of her spitting on Annie?  \n\nI’m assuming you’re mother is at least 34 years old    So to say that she has a propensity for spilling drinks on brides because it happened once 20 years before is like saying you have a propensity to wet the bed because it happened when you were like 4.", "YTA, you asked and hurt your mom, I hope she declined. This was a typical action of some bratty teenager, many, many, many moons ago. Your mom grew over that and Annie should maybe work on it in therapy. Or not allow anyone to approach her with something in their hands. Like, all or nothing. Why punish someone for something they did that long ago and had absolutely nothing to do with them?", "YTA and ESH, I think. Mostly you and Annie. Although I personally think it’s a pretty bonkers boundary, it is okay to ask your mother to respect it for one day. However, you can’t control their feelings about or their reaction to that boundary, so asking them to humor her is fine but you can’t expect them to just get over it. The lukewarm relationship is likely to deteriorate. I hope whatever consequences arise as a result of this boundary are ones you’re willing to deal with. Would your “furious” father decide not to pay for the wedding after this?\n\nEdited for clarity", "YTA. So is your fiance. Her irrational fears may not be her fault, but they also aren't anyone else's. Candidly, I'm not convinced you two should be getting married right now. My opinion obviously doesn't really matter, but in case it does: There seems to be quite a bit of baggage here that you're still sorting through. Best of luck, either way, but I'd suggest genuine caution about moving forward with this woman right now. Her personal issues are affecting your other relationships already; ask yourself if you truly believe that will get better over time.", "Oh fantastic another soon to be spouse who think that everybody should just suck it up and deal with complete bs, just because it is the bride’s big day. OP grow up and tell bridezilla to do the same.", "YTA That's ridiculously stupid and embarrassing.", "YTA that is completely unreasonable. \n\nThe thing is this \"boundary\" isnt even that weird if it was applicable to everyone and a bit less strict. You wouldnt, for example, go to *hug* someone in a super expensive white dress with a glass of red wine in your hand. Its fairly common sense to put your drink down before going over to congratulate people.  If she wanted to make that common sense into a spoken rule (for everyone) thats a bit antsy but not super bad. \n\n\"Approaches\" and \"anything in her hand\" is where it gets weird. Is your mum allowed to sit at a table with you with a drink? Is she allowed to carry water in your vicinity? What if you two approach her, does she have to throw it out? Very OTT and not fair at all. \n\nIt is also punishing her for what happened many years ago when she was a teenager. Again if this caused general anxiety about drinks thats less unfair but treating your mother like a time ticking bomb because of one story she heard about her is unreasonable.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am currently planning a wedding with my beautiful fiancee \"Annie\" My mom and Annie had a meh relationship. They aren't crazy about each other, not particularly close, but they don't have many issues. My mom and I have never been close, so it isn't like one of those crazy MIL situations, just everyone is luke warm about each other.\n\nAnnie has an anxiety disorder and does attend therapy, though it is not entirely under control. She tends to worry about situations which are very unlikely to happen. Annie recently found out that my mom at one point intentionally spilled something on a bride at her wedding.\n\nNow this was decades ago. She was 16 and absolutely obsessed with my father who rightfully wanted nothing to do with her since she was 16. She was extremely jealous of his first wife and \"accidentally\" spilled something at the reception. Annie only found this out because my dad thinks it is a funny story to tell. My mom was a completely bratty out of control teenager who did mellow.\n\nWell the issue is Annie now is worried my mom could do the same to her. I tried to reason with her that my mom in no way hates her and why would she. Annie admits it isn't logical, but claims she can't help it. She says my mom doesn't love her either and some MILs just get like that. She set a boundary that my mom can't have anything in her hand if she approaches us at the wedding.\n\nMy mom is obviously hurt as she would never do something like that. I get it is a hurtful assumption, but I asked her to just suck it up and deal with it. It is Annie's big day and she doesn't need any stress. My mom said I was treating her like she's crazy for something she did in high school and it is hurtful. My dad (who is paying for the wedding if it matters) is absolutely furious and currently won't even talk to Annie. I get their point, but I am still asking them to just suck it up and go along for one day.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yta she *knows* it isn't logical.  She can't help her anxiety but she 100% can help her actions.  She might be nervy on her wedding day but if she is this unable to control her anxiety then she needs to deal with it with more than what she is doing now.", "YTA mother-in-law troll.", "YTA, mil troll.\n\nPreemptively banning the mil because she \"might\" do something is a recurring theme.\n\nEdit - and OP's comments about his own fictional mother confirm it.", "INFO: MIL Troll, don't you ever take a day off?", "YTA.\n\nIt is wrong to punish an innocent party (mom) by forcing them to go along with a illogical demand.  And it's not good for your future with your wife to \"humor her\" on this, because you will be expected to do the same for the rest of your life.\n\nI'm not a therapist, but I think she needs to logically work her way through the scenario.  First off, having wine spilled on your wedding dress is not the end of the world.  The dress may be ruined, but not the marriage or even the wedding.  The person who spills in inevitably blamed even if it was an accident, and the person spilled upon is granted extra sympathy, especially when it is a bride.", "YTA\nYour fiance is being ridiculous. Anxiety is overwhelming however she needs to address this in therapy and she needs to realize that the world is not going to bend to her irrational fears. You validating outrageous fears will only help to strengthen their hold on her. There are many ways to support her and you should probably get her therapists opinion on how to do that so your not inadvertently making it worse.\nApologize to your Mom and expect your fiance too as well because that is offensive.", "NTA\n\n> My mom is obviously hurt as she would never do something like that.\n\nAgain.   You mean your mother would never do something like that again.", "I think I'm going with NTA.\n\nThey don't have a great relationship. Your mom said she \"would never do something like that.\"\n\nBut she did. She literally did that exact thing. This isn't a hypothetical. Your mom intentionally spilled a drink on a bride at her wedding. She has probably changed a lot over the years, but that's a particularly shitty thing to do, even as a teenager. \n\nSometimes, you have to live with shitty decisions, even if you made them as a kid. Ask anyone who became a parent as a teenager. It might not seem fair, but it's still the consequences of your actions.", "Your fiance needs a professional therapist.\n\nNTA to ask your parents to go with it for just a day while she gets therapy and learns to fight her irrational fears.  But if she refuses therapy, don't expect their patience to last forever.", "I'm gonna go with NAH. \n\nYour fiancee is fair in her concern, as there are plenty of horror stories. She doesnt feel your mom likes her and has a history, albeit it long ago. Your mom may feel hurt, but she also needs to understand if she hasn't welcomed/accepted your fiancee, she's justified to think there might be an issue at the wedding.", "I'm not really sure where I stand on this but I need questions answered... How old was your dad in his first marriage? Why was she at their wedding?", "That actually sounds like a reasonable accommodation. I was expecting you to say Annie did want MIL at the wedding. Tell mom to suck it up, and please support your SO. This is an easy way to show they support and love their new DIL \n\nYTA", "Ngl im so hung up on the fact that your mother was a teenager at your fathers first wedding, intentionally spilled wine on his brand new wife and yet he is somehow still your father, that i cannot focus at all on your partners issue omg \n\nLike i get that you had to explain that for this to all make any kind of sense but how am i supposed to get past that what", "There's something more going on here. You aren't being clear on your Mother's and Annie's relationship it seems like their relations are far colder then \"lukewarm.\" Your Mother's sounds like she has definite issues and with what you've said in other comments about your mom needing the spotlight, not liking your fiance, and having done this exact thing before, there's nothing wrong with your fiance being worried and setting this boundary. \n\nAs much as people are saying your fiance needs therapy I'm willing to bet she's got a fair perspective on who your mother is as a person.", "I mean, your mother did it once, to your father's ex-wife. Doesn't matter she was 16. This is weird and I get why your fiancée is anxious about your mother's behaviour at the wedding.\n\nNTA, and watch Annie's back (and front) on the wedding day.", "NAH\n\nHave pictures first, so there are definitely no spills. Then let your mom be a regular guest. It’s cruel to say no food or drink when near the bride or groom. Do you know how many things could go wrong, but rarely do?! (Yes, I know you do and so does your fiancee and this isn’t rational. But.)\n\nAnnie needs to forgive your mom for something that happened decades ago to someone else. Your mom deserves some grace and an apology. Annie deserves support, but not in this rule. You deserve for things to be easy but that’s not the family you have.", "NTA. Seems like a reasonable boundary. Not sure why you're mom is fighting it.", "YTA. This so called boundary is actually an insult. It implies something negative about your mother’s character. How would you feel if people started defining you by your mistakes? I’m sure your mother had been to other wedding since this incident. Did she spill a drink on those brides? Your fiancé needs to go to therapy to deal with her anxiety and I say this as someone who also suffers from anxiety. Also, if you allow this to happen you’ll be telling other members of your family that anything they say around Annie can and will be used against them later and because of that they’ll keep their distance from her. Is it really worth that?", "YTA.  You are not helping your fiancee by enabling her groundless fears.", "YTA\nIf we were all held to task for things we did as kids or teens… Annie is being unreasonable.", "YTA. I don’t get the expectation of being treated like a princess for a day. It’s rude to everyone who has to come and participate in the delusion. Insisting on your mom catering to the princess after she said she doesn’t want to participate in the delusion is a little much. If someone wants to invite you and your wife somewhere but said don’t actually approach me, would you go?", "YTA.", "I guess I don't see why it's that hard to put your glass or plate down just before you walk up to someone?", "NTA that boundary is pretty simple. let her know about the anxiety if she doesn’t already know…obviously she’s actually hurt that she thinks she’d actually do that to her and not that she has to put drinks down before she approaches your fiancée", "ESH. Your fiancé is getting therapy and working her way through her issues to the best of her ability. I would ask if she has discussed this boundary with her therapist and if there was a different option. \n\nYour Dad thought it was absolutely hilarious that your Mom ruined the dress of his first wife, well at least now he does as you say he was angry then. If your Dad can’t remember what it felt like then and understand why your fiancé doesn’t find the antidote funny, he doesn’t respect her at all. \n\nYour Mom made a mistake, a big one, but it exists and if she thinks that won’t follow her in the future she’s wrong. Sure she is more mature now and likely wouldn’t do anything, but she did before and I don’t see how she can’t simply agree to a boundary for a day. Does she need to have a drink in hand at all times during a wedding? I never once saw my parents with a drink at mine but I did see them with a glass I’m had on pictures. It isn’t a really hard boundary to respect. \n\nYou could stand to have a therapy session or two to better understand your fiancé’s struggles and how to best support her. It also wouldn’t hurt for you to know when people around you, especially your parents who you say you aren’t close with, make comments that are unnecessary and may hurt your wife in the future. Laughing about a truly terrible action on your mother’s part isn’t really funny and it begs the question what else will they think is funny at someone else’s expense", "NTA, it'll make Annie feel better on your wedding day, your parents are being childish about it.", "NTA\n\nIt seems like a reasonable doubt to me tbh so I imagine how likely it seems to someone anxious. It doesn't seem like that big of a deal to ask, I get why they might be offended but they really should suck it up for one day for the sake of their child and the person they're marrying", "NTA\n\nYou’re correctly prioritizing Annie over your parents.  If they have a problem with it they shouldn’t be allowed at the wedding and you should go NC with them (particularly your father).", "NAH I’m going to say, Annie is worried over something that she heard a story about that happened a long long time ago and needs more therapy to deal with her anxiety.\n\nYour mum isn’t an AH she is just upset something years ago is being held over her. How would anyone like having stupid teenage mistakes thrown in their faces. \n\nWe are all human and have done stupid things.", "ESH \nThere are legit boundaries and there are ridiculous requests. This is the latter. \nAnnie needs to get herself under control because she is projecting in a very insane way\nYou need to stop enabling her, there is no evidence your mother is interested in sabotaging your wedding. \nYour parents are responding appropriately given the batshit nature of the request", "Info: is your fiance in therapy?", "annie needs to run and never look back. your mom is nuts, you're obv fucked up, and your dad is a predator.......your whole family is a mess...", "Correct. Going along with this just reinforces the problem. Soft YTA to you both, and maybe find a better therapist if they are supporting these actions.", "I’m all for not letting the craziest person in the room make everyone crazy except it’s her wedding day. A wedding is super stressful and if she can’t get her anxiety under control having a massive panic attack at her reception would be terrible. I see no reason why OPs mom can’t just not have a drink in her hand while she’s around the bride. There’s a time to say no it’s your mental illness and I’m not bending over for it and there’s a time to suck it up and be the bigger person. Her wedding day isn’t a teachable moment. Although if her anxiety is this bad maybe a small court house wedding is the better option because she probably can’t get through the day without having a panic attack.", ">your mom, when 16yo was at your dad's FIRST wedding ? AND was so obsessed with your dad that she spilled a drink on the Bride's dress...?\n\nAnd then he later married (or at least had a kid with) that then 16yo???", "I wonder how old his father was when he got married to his first wife (and if the mother was the second or there were one or two more in between)...", "Dad could have got married at 18? 21?", "yep, I hope annie reads this and realizes either you join her in therapy or she RUNS. you're mother sounds like a long road manipulator best case scenario worst case your dad is scary AF", "My dad's first real job was working for my mom's dad. My mom was always hanging around and became obsessed with him which her dad thought was funny. He had to invite her dad to the wedding as he was his boss and a family friend and her dad brought her.\n\nI don't hate my mom or anything. She was just a hands off mom and always put my dad before us. She isn't a bad person but kind of spoiled and high maintenance", "They just don't enjoy each other's company. Annie thinks my mom hogs the spotlight and makes everything about her. My mom feels Annie is boring and too quite and of course people don't pay attention to her. My mom gives opinions and Annie hates that. My mom feels Annie tries to make us cater to her anxiety. Annie just thinks my mom is a bad person for stuff like what she did at the wedding and that she was a shitty mom for always prioritizing our dad over us", "> Your mom knew your dad as a teenager?\n\nHe used to work for her dad", "Annie is already doing therapy,  it's not a lot to ask   it's a simple compromise  .", "my dad's first real job was working for my mom's dad. My mom had a crush on him. My mom was extremely spoiled and did not take it well when he rejected her. Her dad thought this was all hilarious. My dad felt obligated to invite his boss to his wedding as it was just what you did in that circle and he was a family friend. My granddad brought my mom since he was single at the moment.", "Honest question, maybe I'm missing something: why to his fiancee ?", "When she was 16 years old. Most people don't like being judged their entire adult life for something they did as a child. Also she did it when she was extremely emotional, not that it makes it right, but she doesn't care about our wedding or Annie enough to do that. She isn't that invested or hurt by our wedding.", "> This was a typical action of some bratty teenager, many, many, many moons ago.\n\nI don't think it is typical for a 16 year old to not understand how extremely cruel it is to destroy a wedding gown, and it certainly isn't normal to see a couple getting married and accuse the bride of stealing your man when he was never yours.", "> having wine spilled on your wedding dress is not the end of the world\n\nto a lot of women it would be beyond devastating. For most people there are very few times you get to wear a gown like that and feel that beautiful. His first wife only took it somewhat well because she was a model/actress and got to do that fairly often", "At one point in your life you wet the bed. Doesn’t matter if you were 2 or 3, it happened once so will probably happen again.", "It's an anecdote from when she was a teenager that's probably been expanded and inflated as a running joke.", "He was 24. Her dad was his boss at the time and a family friend and brought her as his plus one since he was between marriages and thought this whole crush was funny", "No, there is nothing more to it actually. Some people just do not get along and that's ok, but my mom hasn't done anything to Annie. My mom is someone who naturally gets the spotlight. That is different than someone who demands it all the time. Annie even acknowledges this is based on her anxiety", "OMG this is hilarious that you think this. His parents are paying for the wedding. Why would they ruin it. LOL. So hilarious.", "It isn't hard. It is just hurtful to feel like she is still being judged for something she did so long ago", "OP’s parents are paying for the wedding. If OP and Annie don’t want to take OP’s parents’ feelings into consideration, they should pay for their own wedding.", "They’re paying for it?", "yes", "As someone with 3 family members that have anxiety approaching this level..\n\nFuck therapy.\n\nGet Lexapro.\n\nTherapy alone didn’t do jack shit.\n\nYes, this is simplified.  Not everyone is the same, yadda yadda.  But there are really effective medications out there, the answer isn’t always “therapy”.", "Yeah see this is where I'm sorta landing too. If a woman approaching you with a drinking glass is going to set you off into a panic, well, weddings are pretty notorious for not always going the way you planned. I don't want to say \"Don't have a wedding if you have anxiety\", but it's also worth examining \"Am I going to be able to enjoy my big wedding if something as simple and common place as holding a wine glass in my vicinity is going to make me this upset and paranoid?\" There's going to be drunk people. I have been to two weddings in the last five years where wine was accidentally spilled on the bride's dress and thank Gourd they didn't let it ruin the most expensive night of their lives.", "37?", "I noticed the lack of the word \"dad\" in the post\n....", "Ngl from an outside perspective this just sounds worse", "Seriously though.. therapy. This is more screwed up than you think.", "> high maintenance\n\nI mean one could argue your mother and fiancé have that in common. Your mother hasn't ever done anything to you or your fiancé.", "I can see why your mom thinks “Annie tries to make us cater to her anxiety”. As for “Annie just thinks my mom is a bad person for stuff like what she did at the wedding “, tbh, that makes Annie look bad, like a champion judgmental grudge holder. She’s holding something against your mom that 1) happened at least 25 years ago when your mom was a kid, and 2) didn’t even happen to Annie or have anything to do with her. I don’t envy you your future with Annie.", "Sounds like it really is your fiancé that has an issue with your mom.  Why would you make your mother pay for a wedding to someone who clearly has no respect for her? Imagine being expected to drop thousands of dollars on someone who believes your a bad person and shitty mom.", "Annie literally is making everyone cater to her anxiety so...point to mom for that, lol.", "I was expecting your reply to contain examples of where your mum has embarrassed or sabotaged Annie in some way, because that's really the only reason I would consider her boundary reasonable.\n\nYou say in other comments that you mum is spoiled and high-maintenance, as well as a disinterested mother in general, and I can understand why Annie would find her difficult to be around. However, that doesn't warrant a demand like this, and it really sounds to me like the anxiety is taking over and creating problems where there are none.\n\nAnnie really needs to talk this through with her therapist and work with them to come up with some strategies so she can manage her fears around this situation. She also has to understand that she's playing right into your mother's belief that people have to cater to her anxiety, which is only going to sour the relationship between them further.\n\nYTA", "Oh, I would do it, but like I said, it wouldn't improve my opinion of Annie. If Annie is concerned that, \"MIL doesn't love me\", and wants to improve her relationship with her MIL, then accusing her MIL of imaginary things that MIL might do or did do to someone else in different circumstances 30 years ago is not the way to do it.   Many people did stupid things as teenagers that they never did again after they got to be adults and 25 or 30 years had gone by.  The mom was romantically obsessed with the father. Is Annie implying that the mother is so obsessed with OP that she sees Annie as a rival for OP's love & wants to hurt Annie? That's just gross, and it's something they should sort out before they marry.", "It is a lot to ask. It implies that OP’s mother would spill a drink on her and OP’s mother says that she would never do that. OP’s mother doesn’t deserve to be defined by this one incident that happened before her son and DIL were even born.", "Your granddad brought your mom to your father's first wedding.\n\nAre you making this stuff up?", "Bruh lol wtf is up with your family", "I still think you have the wrong person solving Annie's problem. Judging by how hurt you say your mother is, she has learned her lesson about how cruel that is.", "Sounds like your mom should understand having thoughts that clash with reality. \nSeriously, I recommend therapy for yourself. \nYou grew up as a son of a stalker. Just because your father got a ring on his finger instead of getting run over with a car doesn't change the fact that your mom is unhinged. And your father isn't a good person. Even if we don't focus on the age thing, he cheated on his first wife, most likely, with a person who humiliated her in front of her whole family and friends. Then, he left her and married her bully. And then he had kids with the unhinged person. I guess there's nothing yummier for a man than a mentally ill person whose whole illness just fuels their ego. \nYou could try and explain to your fiance that your mom is obsessed with your father, so Annie is in the clear.", "Idk you and your relationship with your mother, but pouring wine on someone's wedding dress at 16 is not someone who naturally gets attention. I know you've said Annie is in therapy but are you?", "Lol, maybe. But the idea that dad could well have only been a few years older than OP's mum is perfectly feasible.", "We often are attracted to people that remind us of our parents… Even if it’s subconscious", "She has anxiety  , Annie can snap out of it just because it sounds unrealistic to other ppl .Obviously they don't understand how anxiety works .I  bet if Annie could snap out if it she would,  anxiety is not fun at all .", "You obviously don't understand how anxiety works. It's actually not much too ask,  she has a problem , she's doing therapy,  they should be more understanding. Anxiety like other mental illnesses can be crushing .I guess ppl these days just don't want to be inconvenienced by anything , how dare she ask for a simple request .", "lmao imagine defining someone by something they did at 16. I do like how you added the piece of fiction about him cheating though. Nice touch trying to make the ex into some huge victim", "what are you even talking about? You don't think people looked at her and talked about her when she did that? Also are you really defining someone's entire life by what they did at 16? I'm not even saying she is a good person, but she has a lot of charisma, interesting career, and grew up being paraded around because she got so much attention. She absolutely does command a room for better or worse.", "So play this out. A 16 year old is infatuated with an 18 year old, hounds him throughout his entire first marriage, something happens blah blah blah now he is married to her, they have a kid that they have a crappy relationship with, dad seems to be out of the picture, mom is right now crying because her relationship with her son is not so great and her soon to be daughter-in-law sees right through her.", "I understand exactly how anxiety works. Not only do I have a degree in psychology but I also suffer from anxiety myself. My anxiety is so bad that I have to take sleeping pills just to get a good nights rest and half the time they don’t even work. One of the things I’ve learned in my studies and in therapy is that you can’t allow mental health issues to call the shots. Doing that guarantees that you won’t get better.", "He also said that his mom wasn't a mom at all because she only focused on her husband their whole life. And I wouldn't be defining her by the thing she did at 16 if she then dropped it. Alas, years later, she's married to her obsession.", "Parading around is not the same thing as naturally drawing attention I don't even understand what kind of presence you're trying to convey for your mother.", "I mean that people that naturally get attention are not the same kind of people that literally steal attention by doing things like pouring wine on a bridge at her wedding. You're pretty contradictory with how you talk about your mother I'm wondering if you have a full scope of her or if your feelings are clouded because of your own complicated relationship.", "I don't know where you are getting any of this from. If you read the post, my dad is obviously still in the picture and married to her. They are very happy and I never even implied they weren't. My mom has never cried over our relationship not being great. she was a mostly disinterested mother and content to let nannies raise us.", "Fan fiction.", "My grandfather had three kids and paraded her around because she was some sort of trophy to him, because everyone loved her and she got all the attention. I don't even know what you are talking about, good or bad, people tend to love her and I do get why annie feels like she never gets a moment to be in the spotlight when my mom is around", "She didn't do it for attention. She did it because she was a troubled kid and in her mind this woman took something from her. Fucked up situation, but it has absolutely no bearing on the fact she gets a lot of attention.", "You're making some really weird justifications for your mom's actions. Of course your mom did it for attention. She was jealous and thought the bride was stealing her man. There's nothing about her actions that wasn't attention seeking. Everything you've said about your mom makes it sounds like she's a narcissistic manipulator and you just keep coming up with crappy excuses why she's not even though your own relationship is \"lukewarm?\" Something definitely doesn't add up here", "ok keep making your wrong assumptions. I don't really care, but it is pretty gross to label someone with a personality disorder for something they did at 16.", "Ok so it's not just that. You don't get into specifics but from you comments your mom\n\n-poured wine on a brides wedding dress\n-is extremely spoiled\n-gives her opinions on y'all's stuff when it's not wanted\n-has expressed that your wife is to boring and quiet\n-was a shitty parent who prioritized her prize over her children\n\n\nAlso you can say it's a wrong assumption, but honestly you seem very washy when it comes to your mom alternating between condemning her actions and defending them. Idk something's not clear here.", "Yes, she is spoiled. She is allowed to be. Her husband wants to spoil her and she isn't asking anything from me. The opinions are annoying and I've told her to shut up, but most parents do that at some point. She did tell me Annie is boring, but only when I asked her in private and brought up Annie's feelings about her. She was a shitty parent and we aren't close, but I think it is disgusting to define her whole life by something she did at 16 years old when every adult in her life had failed her.", ">My mom was extremely spoiled\n\nWas. Apparently still is.\n\n>My dad... is absolutely furious and currently won't even talk to Annie.\n\nHe should have kept his mouth shut. Him telling the \"funny story\" to Annie prior to the wedding is what set all this in motion. My guess is he's currently upset because it's pretty clear he's an AH, and he's trying to deflect blame onto Annie.\n\nYour mom and Annie each have a chance to demonstrate love toward the other. Annie could focus on managing her own anxieties and symptoms rather than insisting on accommodations from other people. Mom could simply agree to not be an AH toward Annie on her wedding day. Like you said, Annie doesn't need the stress. But neither one seems to want to bend. ESH, but your mom and dad seem to suck the most.\n\nDad told the funny story, and your mom seems to need to be the center of attention. She's making this all about her. Your wedding day is the one day of Annie's life when she should be given the most leeway. It's also the one day on which MIL should be especially kind because unnecessary conflict can create permanent rifts within families. Mom needs to remember it will be your wedding day, too. Assuming she loves you, she should make it as stress-free for you as possible regardless of how she feels about Annie.", "I find it WILD that anyone is saying Annie is NTA here. His mother was 16 when the incident occurred and she was chasing her now husband. WTF is Annie to her but her soon to be boring DIL? Sounds like OP doesn’t even like his Mother but yet the parents are footing the bill and they should just go along with this ridiculous request? \n\nThe entitlement is real. OP’s parents owe them nothing in this and I hope they decide to let them pay for their day. \n\nI have diagnosed anxiety and would NEVER even assume other people have to accommodate my warped thinking.", "Omg I thought I was the only one who has anxiety like the gf has 😲😲\n\nYTA", "What’s the point of therapy if you placate this. Your dad is spot on, your fiancé is ridiculous. YTA!", "YTA", "YTA.  \n\nIt sounds like Annie has some irrational fears around this wedding, and wants your mother to bend to demands that everyone (but Annie) knows are irrational.  I don't think Annie is ready to have this wedding as long as she can only manage it if she can dictate weird rules (not boundaries, sorry) that others must obey.\n\nP.S.  If Annie is doing talk therapy only for this level of anxiety with an irrational element, can she also please be evaluated for medication by a qualified psychiatrist?  It's possible that this could make her life a lot easier.", "YTA and your Fiancé is too. It a crazy unreasonable request. She needs more help.", "YTA. That request is completely asinine.", "YTA\n\nAnnie is a grown woman making a fuss about something that happened before she was alive. \n\nShe needs to get her anxiety in order. And from what sounds she probably will have more problems if she continues with this nonsense.", "YTA and the fact that your dad is paying for it and still has to suck it up is beyond me. Is this something you want to deal with in your relationship? She really needs some help if she's going to keep thinking someone's out to get her!", "YTA. It’s a huge hurtful ask. If you hope to have a relationship with your family going forward I suggest you try some other compromise that is actually a compromise that doesn’t massively hurt someone’s feelings. Are you sure you want a lifetime of your social circles getting smaller and smaller over her demands? No one who might possibly do anything ever allowed in? Eventually that’s everyone, dude. If I was your mother I would skip the wedding and maybe everything else, there would be little point in trying.", "YTA\n\nIf your fiancée is so distraught by something that happened before she was born to someone she doesn’t know then she’s not in a stable enough place to be making as huge a life decision as getting married.", "As someone with a horrible anxiety disorder I had to learn how to make situations ok for myself without expecting people to accommodate me. Annie suffers from a cognitive distortion called Catastrophizing. As a therapist I treat that almost on a daily basis because it’s so common. It’s absolutely possible to use cognitive behavioral therapy to treat and eliminate this distortion. Entertaining it makes the problem worse. I don’t know how long Annie had been in therapy or the style of therapy that her therapist uses so I’m not going to judge.", "YTA this is Annie's issue, and she needs to figure out a way to get around it.  If you indulge this, what's next?", "NTA your 16 yo mom was at his first wedding spilling on the bride on purpose? I wouldn't want her with food or drink near me, either. The ask was small", "NTA-but your idea on boundaries is wrong.\n\nYour fiance can have boundary that she does not want your mom near her with anything in her hand, but they your fiance needs to enforce it - meaning walk away.  You are trying to use boundaries to control another person but really boundaries are the limit of our tolerance and we have to exit if they are not complied with (or reasses and decide that the person can cross the boundary)\n\nI think you all need to stop the discussions and just act if this occurs at the wedding", "NTA I actually dont think thats a huge ask, its not coming from no where your mother has done this before, and her wedding day is already going to be stressful especially for someone with anxiety. I dont think its a huge deal.", "NTA, and the bride is entitled to make some requests, but man, this has to throw up some red flags for you. How much irrational stuff are you gonna have to deal with for your life? How many uncomfortable situations is she going to create because of her ‘phobias’ ? This is someone you are going to be catering to for the entirety of your marriage to them.", "I would just uninvited her if I was your fiancé bc it’s not worth the risk and especially since there’s no close relationship. NTA", "I meeeean it is safer in general to not be holding food or drink when approaching someone with an expensive outfit, so I don't feel like it's a huge ask? At least for this one day, anyway. I agree with other posters that it's something to be worked on, but you/she already know that and wedding days are stressful enough as it is. NAH.  \nEDIT: Eh, didn't spot the bit where they're paying for the wedding so I can definitely see why it's so hurtful. I don't know that there's any really good solution here, since even if say there's a general policy at the wedding to leave your drinks at your table or something, MIL already knows why that'd be the case.", "Correct , makes me wonder wtf he therapist is teaching her", "She's 53 now lol.", "Have you been to many weddings? What is OP's mother supposed to do, not consume anything at all for the entire day? At weddings, people walk around; OP's mom would have to be constantly keeping her eye on the bride, lest they get too close to each other while the mom sips her drink or eats her food and the bride melts down as a result. No, that's nuts. OP's mother should not have to either act like a paranoid stalker or risk fainting from low blood sugar just because her future DIL is unwilling to seek professional help for her obvious and extreme anxiety.", "24. From the comment below, dad is 8 years older than mom.", "How old are they? Your mom and dad.", "he's kinda both taking her anxiety too seriously and not seriously enough at the same time if that's even possible. lol", "Presumably MIL won't be around the bride before the wedding or the wedding photos.  The concern would be at the reception, when MIL should be allowed to enjoy her dinner and a drink without worrying whether the bride wandering within the \"exclusion zone.\n\nThe other reason that this is completely unworkable is this:\n\n1. If MIL does NOT intend to ruin the wedding, then the demand is insulting.\n2. If MIL DOES intend to ruin the wedding, then her promise is worth nothing anyway.\n\nPresuming MIL has learned at least a little restraint in the last 30 years, most likely the demand is insulting.  But even if bride is right about MIL, the demand is useless.", "Then why are you hurting your mother?", "Yes, but you can't say \"never\" when she did in fact do exactly that thing. You can say \"she hasn't intentionally destroyed a wedding in over 30 years\" but you can't she never did it.\n\nAlso, I don't like being judged for things I did in the past either, but that doesn't mean I can claim I didn't do them.", "Except she is still obsessed w/ your father and choose him over her kids. I never wanted kids, but I still find that behavior abhorrent. So after the 1st kid, she had to know she didn't want kids, so why keep having them? To make hubby happy? I'm probably about your mother's age. Birth control was readily available, lots of people were having only 1 child or no children. We even had a term for working couples w/o kids:  DINK - Double Income, No Kids \n\nYes, lots of kids are raised by nannies, but most of th don't come away knowing one of their parents regrets having kids.\n\nI don't know how much your mother has actually changed since she was an obsessive 16 yr old. It sounds like there really wasn't any reason for her to grow up.", "I hear that.\n\nAt the same time, Annie has said that she knows that her experiences with anxiety are causing the concern, and that she knows it's not something your mom would actually do.\n\nSo, it's clear (and admitted by Annie) that it's not actually about your mom, about judging her etc, but it's about Annie. And she's asked that your mom help her keep calm on that day by making an easy adjustment. Like you said, Annie is working on it in therapy, and this isn't a lifetime request, just for the event.\n\nWith that in mind, and the facts that your mom doesn't like Annie that much, and the two of you aren't that close, it seems odd that she'd be that hurt by this. It seems a little selfish, but not out of character for someone who loves being the centre of attention.\n\nI obviously could be completely wrong. \n\nEither way. I hope your mom can understand its really not about her being judged, and decide to extend a kindness that would be much appreciated by the bride and her son.", "You need therapy with the Lexapro. It won't magically solve your anxiety or depressiond (yes its used for both), especially depending on the cause of it. Also, it's really hard adapting to living with Lexapro. Been there, done that.", "Also make sure the behaviour is *actually* anxiety. I was misdiagnosed with anxiety for over a decade and doctors started using it as an excuse for any and all problems I had, including serious allergic reactions.\n\nMy actual diagnosis is ADD, which requires not only different medication, but different treatment.", "Dante?", "Yeeeeah this is approaching *my* family's level of 'wtf' and that's not good, friendo.", "What is that impossible here ?", "53 and 61", "I could see it as enabling it, but I'm no psychologist, and I have no idea how he'd be supposed to handle that properly, tbh. I personally don't see it as being an asshole to her.", "Are you okay?", "The thong is , se methods don't work for everyone. My son has co morbid anxiety and picks his skin raw from it , if I didn't make accommodations for him he would be dead . She's already doing therapy sometimes some understanding goes a long way , that doesn't mean you're not trying,  things are never so simple as you are trying to put them , ppl are nuanced , sometimes mental illness is going to get the best of you , it happens   that doesn't mean you won't make progress.", "You're replying to the OP", "Oh ,yeah. Didn't even look at who it was, just what the comment is. Thanks.", "YTA. Reading your comments make me think Annie is a huge AH and you're right behind her. I hope mommy and daddy aren't paying because you are both ridiculous.", "Info: has your dad already paid for the wedding or can he still pull out? I'm just wondering whether Annie has realized that this request may affect her wedding more than the scenario she currently fears (unless you guys are in a position to take over keying for the wedding).", "NTA - I’m reading between the lines that maybe your fiancé has experienced behaviors from your mother that makes her not feel well liked (“meh” as you call it) and she wouldn’t put it past your mom to do it again. Your mom did something terribly selfish at a wedding before, she may do it again. And the more she makes a stink about it, the worse of a situation she’s making it. Your fiancé has a  fear based on an action your mother has already done, not some hypothetical situation your fiancé is ruminating over. Your fiancé could use a bit of comfort and validation of her feelings and perhaps even a gentle conversation asking if there have been other things that have worried her or made her feel uncomfortable in the past about your mom that she has kept to herself (if you feel ready for that conversation.)", "Nta, but are you sure marrying someone w uncontrolled issues such as this is a good idea.", "YTA, extremely disrespectful to your mom. I don’t know a single person who would show up under these conditions. The implication here is atrocious. Also her behavior is a major red flag and you going along with it sets up precedent of what the rest of your life will look like. Soon she will decide you are not allowed to eat with utensils and you’ll go along with it.", "YTA. That’s irrational and has nothing to do with anxiety. She needs therapy and you need to apologize to your mother. Honestly!", ">She set a boundary that my mom can't have anything in her hand if she approaches us at the wedding.\n\nNTA\n\nThis is clearly a weird boundary to have, but it's not a big ask. People don't go around approaching others at fancy events with their hands full constantly. Most people tend to empty their hands before wandering around. This boundary simply means that you're asking your mother to make a concerted effort to do a thing she'd probably be doing anyway.\n\nYour fiance probably needs to consult professional help for her anxiety. Your mom being a teenager at your dad's *first* wedding is hella weird. It's unlikely that your mom is going to go out of her way to throw wine at the bride of her teenage crush because that isn't the case for this wedding. It's all **very** weird, but that doesn't mean you're the AH.", "YTA that is a unreasonable request, you should get support for your fiancés anxiety not feed into it. It does matter that your father is paying since you don’t have a leg to stand on.", "YTA, or rather, you and your fiancee are TA. Her for making an unrealistic and honestly unreasonable demand knowing that it's based in unhealthy thinking that has nothing to do with reality. If she's aware of her anxiety disorder, she's aware that indulging it is unhealthy for her.\n\nYou for letting her make ridiculously over the top demands for the wedding. What if all of a sudden she decided that men wearing pants make her anxious and demanded that all the guys have to wear kilts instead? And that they all had to match because random colors and patterns make her anxious? 🙄", "Yta it's not healthy to  feed into this kind of thinking and ur parents are also paying for this wedding.  So maybe your fiancee should suck it up", "YTA.\n\nFirst of all, this isn't a boundary, it's a rule. Boundaries are for autonomy and consent, they apply to \\*you\\*, not to other people. So you can't have a \"boundary\" that someone else can't hold something when you're near them, that's a rule.\n\nI agree, this was decades ago when your mom was a teenager, and it's ridiculous to hold this over her.\n\nYour dad is paying for the wedding too, which further makes Annie seem unreasonable.\n\nYou're allowing Annie to use her anxiety to dictate how other people behave. I don't want to be that guy on Reddit that says \"dump her\", but you need to be aware of how bad her anxiety is, how unreasonable she is, and look at how she feels she can set rules for other people, even when those other people are paying for the day!\n\nAnnie is unreasonable to the point of alarm bells ringing.\n\nYour mom and dad are right. You and Annie are wrong.", "YTA - The ask doesn't even make sense. If Annie thinks your wife might deliberately spill wine on her, why would the rule even help?? The incident was 37 years ago!!", "Seems like Annie is creating a self-fulfilling prophecy  situation.  Her mental issues are not a reason to accuse people of psychotic/improbable acts.  Obviously, this isn't going to happen. This was incredibly disrespectful of her.  What else? If someone had a felony conviction 50 yrs ago, they should approach her with handcuffs just in case. \n\nGood luck to you, this is just the start of her unreasonable demands and your enablement of them.\n\nYTA both of you.", "YTA. \n1) Your dad isn’t paying for the wedding. Your PARENTS are paying for the wedding. This includes your mom,  who you and your fiancée are treating horribly! Very sexist to assume the money is only your dads. \n2) You might see this as one small ask for one specific instance. But it’s not. You are missing the bigger picture. If your fiancée can’t manage this, what will happen in the future? With kids, other events, etc. This is not a boundary, this will be a way of life. Is that really what you want? \n\nYou are not only being an AH to your mom, but possibly an AH to your future self. How you handle this, how your fiancée handles this, sets the tone for your future.", "YTA. Annie is way out of line, she’s using this as an excuse to keep your mother from attending the wedding.", "u/DizzyCaterpillar3858\n\nI struggled a lot with anxiety this past year and I also am like Annie with stressing over the impossible.\n\nThis was a hard one to read through because I understand Annie's perspective.  Yet, I have been through therapy to understand that to some degree the handling in all of this by you, Annie, and your parents was poor.\n\nTherapy is only as useful if you apply the techniques outside the room.  And you raised a point I want to ask you on.\n\nThat point is that while Annie is in therapy, her anxiety is not under control.\n\nHas the counselor worked with Annie to develop coping mechanisms to calm her anxiety?  Has she actively used the techniques her counselor gave her?\n\nIf neither of these questions can be answered, then that will partially explain why the anxiety is not under control.\n\nBoundaries are useful when used in a reasonable setting.\n\nYour Mom is hurt because Annie set a boundary out of her own fear and anxiety.\n\nI have caved to my own anxiety before, but with a cool down, I apologize if I responded irrationally with a boundary and find a healthier option than what I sat.\n\nIn the moments I sat those boundaries, my anxiety felt so real.  It felt like a scary monster out to hurt me.\n\nYet, I let my own anxiety control me in those moments, which is not healthy.\n\nOP, Annie's fear is controlling her.  And, from my own experience, it will control others, including you.  It will become a wild dragon difficult to tame that will lead to isolation from others and hurt.\n\nOP, your parents have every right to be hurt.  Yes, Annie has the right to set boundaries, but she sat a boundary that was led by anxiety and you need to talk to Annie about this.  You need to do it in a way that communicates she is safe, but that she herself crossed a line.\n\nPerhaps you can talk to her to reason that your Mom shouldn't hold a drink while dancing.  That would make more logical sense than an outright ban. \n\nAs much as it feels impossible, Annie can learn to control her own anxiety to an extent.  She can learn to control her own fears and emotions.  It will take a lot of work and unpacking from childhood until now, but the attitude that she can't help it is not entirely accurate.\n\nShe is in therapy, which should give her the tools to help her control it.  If therapy is not helping and Annie is genuinely trying, then please seek other forms of help.\n\nIf Annie is reacting to long-term stress, it may be in the best interest of her and you to postpone the wedding until her anxiety is better controlled or do a shotgun like wedding.\n\nEveryone who expressed concern about her unmanaged anxiety causing a panic attack on BOTH of your wedding day has valid concerns.  Wedding prep is a stressful process.  I know that you want it to not be stressful for her, but the reality is that stress due to a wedding is unavoidable.  You can't avoid it or make it go  away.\n\nSo, while money might be lost, doing a small shotgun wedding or postponing the ceremony so she can seek help may be in the best interest of Annie.\n\nOP, I commend you for being willing to love and fight for someone with severe anxiety in closing. Yet, part of loving includes knowing when she is being unreasonable and holding her accountable to use her coping technique.\n\nThe reality is that Annie let her anxiety control her.  You ALL need to sit down and work toward a solution.  Both you and Annie need to apologize for the ban, while your parents need to be understanding how Annie's anxiety is warping her perspective.\n\nIf that doesn't work, be ready for the possibility that your Dad could withdraw financial support because of how both of you reacted to Annie's anxiety.  Both of you acted in a way perceived to be hurtful and disrespectful.  That will take time to bounce back from.", "I have a different take on this.  Would it be that terribly hard for MIL to not approach the bride on her wedding day hands free?  Does it seem silly - yes.  But is it really something to be offended about?  I just think people get offended over everything they possibly can, almost looking for something to be offended about.  \n\nThe bride has an anxiety disorder.  Asking her to not be this way is like asking a person with diabetes to not be diabetic.  This will cause no harm to anyone.  If you look at it with empathy for the bride and what she must constantly struggle with, is it not more hurtful to the bride to make an issue about this for her wedding day?\n\nNTA, and tell your mom to get over it.", "To add to this quote..... It's Annie's big day that YOUR parents are paying for and she's treating your mom like this? It's time to see the therapist and or consider different meds. It would be different if your Mom was disrespectful to her or they had a hostile relationship.", "I agree with pausing the wedding until Annie has better control of her anxiety. If she is like this now, she will most likely get more demanding and irrational. Any kids OP had with her either will inherit this anxiety or suffer because of Annie’s irrational behavior. OPA is YtA to his mom for enabling Annie’s anxiety and will be TA to any kids he has because he will be forcing them to endure Annie’s extreme behavior.", "At this point he would definitely lost money, but he has enough money that he might not care, and he has always been over the top protective of my mom", "Right, like this is insane. OP keeps running around talking about how no one should judge their mom because they were only 16 despite the fact that the pouring the wine clearly had long lasting effect. She's manipulative.", "> I just think people get offended over everything they possibly can, almost looking for something to be offended about.\n\nShe implied my mom would ruin her wedding gown just for fun. My mom has every right to be offended.", "This is what I'm hoping. That she was a 16 year old who barely knew a guy who was a couple of years older so he never paid attention to her, but he was cute so she had a 1 sided crush and then they got together later. It's a long shot but the only way this could be a \"cute\" story.", "Wish you weren’t being downvoted for this, it’s valid.", ">I don't think it is typical for a 16 year old to not understand how extremely cruel it is to destroy a wedding gown, and it certainly isn't normal to see a couple getting married and accuse the bride of stealing your man when he was never yours.\n\nI don't understand why you are getting down voted for this. That behavior was a train wreck.", " Isn't that what both you and your fiancée should have considered the bigger risk?", "Wetting the bed is an accident, ruining a bride’s wedding gown by maliciously pouring a drink on it is not an accident.", "No, because your mother did ruin another bride's dress intentionally, your fiance has anxiety that the same will happen to her.  You stated that your fiance knows that it is irrational.  So she is not stating or implying anything.  She is simply having anxiety over an unlikely possibility.\n\nI have MDD and GAD.  We do not blame or imply anything.  We simply try to control possible scenarios where we might be triggered.  If you don't understand this, you will not be a good partner for your bride.", "Or smoke a joint or take a Gummi.  Great for anxiety...", "Weird, because the words \"dad\" and \"father\" appear prominently.", "To be fair a lot of people believe in putting the marriage first. I don't know if I could, but it is a common enough belief. I wouldn't say that means she is obsessed with him. I don't know why she continued having kids. My dad feels every kid deserves a sibling, but I don't really know as he certainly didn't want kids. She does like babies and we are all close together.", "I don't think you can expect my mother to see it like that though. She's never been around someone with anxiety and she's allowed to be hurt", "Pretty magically solved mine! Which is good because my insurance doesn't cover therapy.", "It pretty magically solved my husband's anxiety.  Just sayin'\n\nEdit:  Why the downvotes? \"Lexapro wont work without therapy\" maybe true for some people, but I know for a fact it isn't for everyone.  For a lot of people it is pretty damn close to a miracle cure.  Think adderal for ADHD level of effective.\n\nFor the love of absolutes, I guess.", "Of course.  See a professional.  Keep tabs on effects. Adjust as necessary.  All that.", "Unless it just makes you paranoid.", "She can and she must. If she has anxiety at work, do you think her co-workers or her boss will accomodate her silly requests? I bet you that even Annie herself knows better than to ask there but she asks you because you allow it. In real life we don’t control the actions of the people around us and Annie has to accept that. Whether it’s therapy or medication or simply removing herself from the environment - she has to find a way of dealing with her anxiety and she can’t expect people to conform to her in these matters. YTA and if I was your mom I would absolutely not agree or simply not come to the wedding at all, nobody needs that sort of drama in their lives. edit: I would also not pay a single cent towards the wedding in this scenario.", "Some people believe the marriage comes first, but not to the point where the kids know they were regretted.", "Being hurt is understandable.  But your mom needs to understand that this isn't about her, as much as it is about mental illness.  It is hard to deal with these issues, but she is your fiance, soon to be her DIL.  Perhaps your family can try and learn about anxiety disorder.  I guarantee this is not the only time your fiance's medical condition will affect your family.  But gaining some understanding  of the disorder will make it easier to deal with going forward.", ">\"Lexapro wont work without therapy\" maybe true for some people, but I know for a fact it isn't for everyone.\n\nMy dog could eat chocolate no problem in small amounts.\n\nIn no way, shape or form I tell people to give chocolate to their pets because mine was okay eating it.", "Yes, see a professional.", "Please point to where in the post you got they're unhappily married and that his mom constantly hounded the married couple and it's not just one incident at the first wedding.", "Ok and that still doesn't mean she is obsessed with him. She chose work over her kids as well. She just didn't like being a mother", "YTA for allowing your fiancée to be unreasonable and not defending your mom. Judging an adult for behaviour as a teenager is wild as fuck. Your mom’s historical behaviour is irrelevant at this point. Your mom ruined a dress at 16 and your fiancée is holding that against her. Everything else is immaterial. Your fiancée acknowledges she’s not reasonable but you’re still letting it happen and embarrassing your mom. Have a damn spine and get your fiancée some therapy.", "YTA.  You need to get those two together, so they are comfortable with each other.  I feel like your method so far is making it more likely that they will have negative feelings. I think that entertaining the ideas, as though they are valid, is a problem.\n\nHas your fiancé considered medication?  I don't have the same kind of anxiety as you describe, but medication has really helped me.\n\nIf I were your Dad, I would not be paying for the wedding of someone with your attitude to your mom.", "Nta", "Not trying to put your fiancée down but this is very irrational. I think you may want to brace yourself for some troubles ahead. This is indicative of family drama. You may have to choose between Annie and your parents. I don’t really blame your father for being angry especially because he is paying!", "YTA.  That’s not what a boundary is.", "NTA doesn’t seem like that big of a deal", "Time for dad to withdraw the money and let you and Annie foot the bill. I bet the anxiety figures a way to have mom at the wedding with a drink. YTA", "I think it's interesting that your dad is furious but really this is largely his doing. Maybe now he'll stop telling that \"funny\" story...", "Indulging this kind of paranoia is not helpful", "Okay, I would suggest your parents both take some classes to help possibly understand mental illness even in the slightest.  I can see how they might take it personally, but it isn't.  Also, since you're getting married to Annie, having your parents become informed/educated about Annie's mental illness may help foster a better relationship between them.  What's the down side to that?  Regarding the 'boundary,' could you guys find a compromise? Maybe do some run throughs with your mom holding something that wouldn't harm Annie?  Y'all need to figure something out because Annie's anxiety about your mom (and now dad) hating her and out to get her is going to keep popping up.\n\nAlso, in the event Annie pushes forward and tries to ignore her anxiety to please everyone and something bad does happen, she will probably feel gaslit. Not good.", "ESH, if your folks are footing the bill and you know that your fiance is making an absurd demand I'm not so sure you should be placating it. What's next on her list of ridiculous demands?", "Mom can’t claim “I would never do that!”  She has. \n\nIt’s not exactly a big ask to be empty handed when close. \n\nNTA", "NTA - idk why everyone is saying asshole, maybe theyve never met someone with anxiety. No, you aren't required to accommodate for other peoples' mental illnesses. And if they ask something unreasonable, that's bad. However, this is both NOT an unreasonable request (just can't hold anything in her hand while approaching wife??), and not an unreasonable fear?? (literally exactly what she's done before)\n\nI think your mom should talk to your gf about this, and your gf should share her fears and why she feels your mom doesn't like her. Maybe she has good reasons.", "I'd say OP=NTA\n\nAnnie isn't asking OP's mother not to attend or NOT to be near her.  Just not to have anything(food/drink) when near her.  \n\nAnnie does need more therapy(which OP acknowledges) but it's not that big of an ask for Mother to not drag food/drink around but keep it at table.  \n\nI don't allow drinks by my computer except mine(bottle with cap), so to be honest, Maybe it's a good idea for NO one to approach bride with food/drink so that no accidents happen.", "YTA…this isn’t “Annie’s big day”.  It’s yours AND hers big day that includes the joining of 2 families. I get she has anxiety, but how does she have the audacity to request something so ridiculous? It’s not a boundary.  For f*cks sake your mom was 16! Maybe go over everything Annie did wrong at 16 and throw it in her face and let her decide if it’s fair or not. I mean is Annie going to flip out anytime she sees your mom taking a sip of anything that day? \n\n\nI could understand if your mom and her had a bad relationship, but it just sounds like they have no relationship. Maybe they both could make an effort to become friendly so she can see your mom isn’t like that. \n\nJust remember if you continue to indulge these kinds of things then this will be your entire life. Get her some help because it isn’t good for Annie’s sake either.", "NTA - and this is a Mom \"played stupid games, won stupid prizes\" moment. That story has been passed around often enough that your fiancee is worried about it. Right or wrong, your mother did do this. Right or wrong, your fiancee is within her rights to set boundaries and if this is the boundary she needs to keep your mother invited to your wedding and reception, than that's what it is.", "For the love of God just go do a court house marriage. Because if this wedding is making Annie's anxiety worse then it's giving everyone a headache that's involved or partially involved. Honestly, no one needs to tell your fiance anything that involves a wedding/party/funeral because she will think something similar will happen to her. Also go to the relationship advice thread. Not the asshole thread.ESH", "Yta for the repost. This story has already been published here", "Right? She literally did the thing your fiancee is concerned about. I know an awful lot of teenagers, and not a single one of them would do that. Even the ones that were super petty and spiteful wouldn't do that. She probably has changed an awful lot in the almost 40 years since and wouldn't do it NOW, but you can't say this is something she would never do. I hope your bride has a bridesmaid or dear friend who can help run interference at the wedding. You let them know that Annie is concerned, but you will be very busy that night. It is your wedding too, not just hers. Have a friend enforce it so you can focus on the celebration.", "The mom was SIXTEEN everyone on earth did something impulsive or rash as a teenagers his wife needs help", "I would agree with you, if this came up on the wedding day. It didn't -- this is well beforehand. Therapy and medication can be taken to help the person who is suffering from such awful anxiety.", "But did you catch OP’s reasoning—not “that won’t happen because my mom has matured and would never engage in that type of destructive, disrespectful, aggressive behavior anymore” but “that won’t happen because my mom doesn’t hate you” 😬😬 IMO the bride isn’t going to be the craziest person at the wedding.", "I'm figuring your family thinks this is a cute, funny story and told your fiancé.  Is your mom ok with people sharing this shameful act with people? It isn't cute or funny -- just saying.", "And you think you grown ass adult fiancés actions are normal? \n\nHave anxiety disorder as well, take meds for it. Guess what I wouldn’t pull this kind of stunt.\n\nYour fiancé is cruel and so are you. Your mothers actions can be excused since she was technically a child. Moreover, she has repented. Your ADULT fiancés actions can’t be excused. She should know better.\n\nGo apologize to your mother and tell your fiancé she is a horrible personal and you can’t marry her until she gets significant help. Otherwise YOU will lose your entire family due to your fiancés actions.", "The act wasn’t nice, but it was an irrational impulsive thing and that is somewhat typical of 16 year olds. It’s not like your mom brags about it…it’s your dad who thinks it’s funny. And now your adult fiancé is making a spectacle of your mom for no rational reason.", "Lexapro messed me more up then no meds and no therapy….worst couple of weeks of my life. I think the message should be meds and therapy.", "I am on therapy and anti anxiety meds and adhd meds . Agreed therapy isn’t always enough . A lot of the time the therapy can only help once you are on meds", "Lexapro gave me intrusive suicidal thoughts on a magnitude I’ve never had before so. No. Fuck lexapro, therapy is more difficult but at least you’re more in control of what’s happening.", "I'm also going to say that Lexapro alone won't do shit. Gotta learn those coping skills, but yes, meds absolutely can help make it possible to actually employ those coping skills.  \n\n\nEdit: Apparently for some people it will! Not for me though! I need both <3", "I always like it when the bride changes to something comfortable, and washable, but still special.\n\nEverything is less stressful when you're comfy", "Same. Gave me worse anxiety and panic attacks.", "Amen. I unzipped like half my dress at my wedding and popped a sweater on.", "I reckon it's efficacy varies depending on the diagnosis.", "Enabler he is I can see", "Man all this conflicting advice about treating anxiety is giving me anxiety but now I don't know how to treat it. Maybe I should just eat some chocolate. 🤣", "10/10 will help.\n\nMy doggo aproved.", "YTA. I have anxiety disorder. Your lovely fiancee needs to get over herself.", "YTA. But let me explain why because I don’t think it’s black and white. \n\nYour gf is responsible for controlling intrusive thoughts like that. Your mother has had literally decades to grow past that childish part of her life, and has shown no reason to do that to her. By telling your mom to fall in line with that thinking, you are basically reinforcing that fear for no reason, instead of helping her work past it. You need to try and be a mediator between them and help your future wife know that her MIL is on her side. I hope you all can make something work, and that your fiancée can grow past this.", "YTA. You want your dad to suck it up and pay for the entire wedding when his wife is being singled out in a weirdly conspicuous way for no reason. Your fiancee needs to deal with her issues. This is not a \"not entirely under control\" issue; it is a \"rampant symptoms that are causing problems in her relationships\" issue. If you and fiancee want to make unreasonable demands, you need to pay for your own wedding.", ">She was 16 and absolutely obsessed with my father who rightfully wanted nothing to do with her since she was 16. She was extremely jealous of his first wife and \"accidentally\" spilled something at the reception. Annie only found this out because my dad thinks it is a funny story to tell.\n\n\nYou gotta be fuckin' kidding me this has to be fake \n\nIt's like someone cut up bits of aita posts and made a salad out of them", "Your fiancé is out of line. I’m curious- how did your parents end up together? Obviously they were meant to be", "Question: how old are your parents?", "YTA and so is Annie. It's not the responsibility of the world to accommodate distorted thinking this severe. It's her job to work with her therapist to confront this irrational fear. You cannot begin your married life by giving in on this, because it will set a precedent that Annie's irrational beliefs will always be catered to. \n\nShe doesn't need your coddling, she needs you to say \"I understand your feelings, but respecting my parents is non-negotiable. Let's see what you and I can do together to help alleviate some of your fear without being insanely rude to my parents, who don't deserve it.\"\n\nAlso, you're using the word \"boundary\" wrong. That's not a boundary, that's a neurotic, tyrannical order.", "Absolutely, YTA. Can you honestly not see how crazy this is? \n\nAnxiety aside. Like this is fucking insane.", "And once again, we have someone with a \"mental issue,\" weaponizing it to control everyone around them. YTA. And your future wife is, too. Run, Forrest, run.", "Y’all are wild. NTA. throwing a drink on a BRIDE for a man that’s not yours is unhinged at all ages and I don’t think the request was crazy. It’s not a funny story; she has a history of ruining weddings. FMIL can gth.", "YTA", "NTA\n\nWow, this is such a minor thing for your mom to not do. I don't understand her objection... like, she is looking for a reason to be offended?\n\nShe spooked the bride, who has anxiety and that anxiety will be much, much worse on her wedding day. Why wouldn't she just agree and not do the thing? It's such a non-issue unless mom decides to make it an issue, which makes her the AH.\n\nI would suggest you instead elope and have a courthouse marriage. Take no gift from your parents who don't seem to care about your future wife at all.", "NAH.  I’m surprised by how much vitriol your fiancé is getting in these comments.  \n\nI don’t think you were wrong to accommodate your fiancé if she has a history of anxiety, and no history of pulling stunts.  I also don’t think the act itself of “just don’t hold anything when you’re near her” is exactly difficult to accomplish, so the problem isn’t that your fiancé is imposing a burden of some kind.  After all, if you made that a general rule for all the guests, no one would question it because people (generally) understand wanting to keep your wedding dress clean on your wedding day. \n\nThe problem is the sentiment behind imposing the boundary, and there I can understand why your parents would feel offended.  I wouldn’t like my poor past behavior being brought up and used against me either.  \n\nAnd then you (OP) are caught between a rock and a hard place because you either offend your parents or show insensitivity to your fiancé.  \n\nSo… my advice is 1). Your fiancé should keep going to therapy and working on these issues, and 2). Make it a rule that *none* of the guests should be holding drinks or anything else while around the bride.  I doubt anyone would blink twice at “the bride doesn’t want to take chances” because typically the dress is the one of the most important parts of the wedding to the bride.  (Of course, it would have been better to make that rule instead of starting with just singling mom out, because then your parents would be none the wiser.  But that ship has sailed)", "NTA\n\nAnd here is why. One, your fiance has anxiety issues which she acknowledges and is getting help for. Two, she also acknowledges this is an irrational fear but admits she can't help it. The fact that her relationship with your mom is \"meh\" doesn't help. Three, it is not such an inconvenient request. Approach the bride, put down the drink. It's not like you're asking her to not drink or eat.\n\nI get other people here have anxiety issues and think this is outrageous. Everybody's anxiety, traumas, experiences are different. It doesn't mean you should belittle someone else's issues. Especially if she acknowledges here issues. It is her wedding day. She should be able to feel comfortable. Any other ordinary day, sure maybe this is a little too much. Let her be comfortable at her own wedding. It's not an inconvenient request.", "It feels like a lot has been left out of this story, and the things left out would give more context as to why the bride feels this is necessary.", "Right lmao all these rich kids w their audacity", "You really think getting a drink spilled on the bride’s wedding gown, accident or not, wouldn’t be a big deal?", ">plenty\n\nWhat?", "His marriage was pretty much a sham from the beginning. She liked his family's money. He liked being married to a model, but they found out pretty quickly they didn't like each other. my mom went to college across the country partially because she was so embarrassed about this and a lot of her behavior. When she moved back my grandfather (his former boss and a family friend) asked him if he wanted to come with him to drop off some furniture for her because \"she was 23 and he could have her now\"", "53 and 61", "Dude... Annie literally asked for one of the most ridiculous concessions to her anxiety I've ever heard. Your mom is *right*. \n\nAnd it's pretty clear Annie dislikes your mother and is using the excuse of her anxiety as a means of keeping your mom away from the two of you at the ceremony. If your mom is always has to be the center of attention, that makes sense, but Annie went about it in such an unhinged way.", "MIL/Mother troll", "Everyone did impulsive and rash things, but few people did something as cruel and intentionally spiteful as trying to ruin someone's wedding by spilling something on their dress. That's a bit beyond a normal prank or even a fairly shitty thing a teenager might be forgiven for doing.\n\nLike I said, the mom has likely changed a lot. But she has in fact done something incredibly shitty to someone at their wedding before, so it's not out of the realm of possibility. Most people would consider that beyond what they would ever do. For her, it would be a repeat performance.", "Getting into a fight or stealing something is an impulsive/rash teen mistake.\n\nIntentionally (& successfully) trying to ruin someone’s wedding day and marriage is not a “impulsive teen mistake”. That is a calculated decision that she made.\n\nShe was 16, not 8. If she was old enough to drive a car and work a job then she was old enough to understand how fucked up it is to intentionally destroy someone’s wedding.", "OP says in an above reply that Dad is 8 years older than Mom. A 16 yr old intentionally spilling a drink on someone's dress is a juvenile act that shouldn't be held against someone. A 16 yr old being so obsessed with a 24 yr old that she intentionally spilled a drink on his wife is a major red flag. Since she's now married to him, I highly doubt she got professional treatment for her issues. (Yes, Dad later marrying this same person doesn't speak well for his character, either.)", "I see, from you stating that she was 16 and sabotaged your dad's first wedding I wondered how much older your dad was...\n\nI think that your parents somewhat over reacted but in my experience it would be best if the four of you could get together like at a park, restaurant etc... and simply communicate how you are feeling (especially your mom) you can work this out. I always tell people that if you get to the point where you no longer want to talk, you absolutely need to keep talking until you are all in accord.\n\nGood luck 🍀🍀🍀", "As someone with GAD, I second the Lexapro. It has helped me tremendously. Just be aware that it may or may not be right for you and if it isn't, you might have to try some other drug. Though I wouldn't dismiss therapy, she should try that too if she isn't already.", "I wouldn’t say therapy isn’t helpful, but meds can be really really useful for many people. My partner, for example, was in therapy for 5 years for her anxiety and still having panic attacks at work at least once a week. 2 weeks on Lexapro and suddenly no crying in the break room! She still benefits from therapy, but the combination is more effective than therapy alone.\n\nI personally am one of the unlucky people who gets all the side effects all the time and I had to try 15+ different mental health meds (I’m bipolar and OCD on top of being depressed/anxious, so that doesn’t help) to find what worked for me. Even after all that, literally years of bad side effects, including Lithium toxicity, I would still recommend medication, because I would not be where I am without it.\n\nIs mental health medication for everyone? No. The risks are real and you have to decide what’s best for you. But for someone with relatively uncomplicated depression or anxiety, there’s a close to 50/50 chance the first med you try will improve your life immensely, and for those with more complicated situations, the journey may be harder but the destination is worth it.", "Lexapro only filled my lungs with fluid and gave me double pneumonia. For my cptsd, I use a combination of celexa, trazodone, and seroquel off label as an anxiolytic. Yes, I know it's a lot, but they work and I feel saner and more comfortable in my own skin than I ever have before.", "She doesn't care that much. I think she is ashamed she did it but they are just playful in general and tease about everything, and she knows it feeds his ego. I think my dad is insecure and it makes him feel good.", "Honestly, I think it's going to depend on how bad the chemical imbalances are in your brain, along with a shitload of other factors that researchers have probably written hundreds of papers about.\n\n\nMy \"magic\" is bupropion + fluoxetine (okay, and a nightly benzo). Therapy was nice in a lot of ways, but for me personally it just reinforced my issues. Bupropion alone wasn't enough, but three weeks into adding fluoxetine and it's...wow. Gotta take it at the right time every morning, but so far it's worth it (and cheap! $10 US for a 90-day supply with no insurance!)\n\n\n\nIf it's available, therapy should always be an option, though. It rarely hurts to have a professional, objective 3rd-party to talk to. It's super sad that it's out of reach for a lot of people who might benefit from it. :(", "It greatly minimized my anxiety, it seemed magic, and it was not at all hard to adapting to living with Lexapro. I can't imagine what this means.", "Some of us are too screwed up for therapy to do any good. \n\nNTA. Stand up for your woman.", "Not all drugs work the same for everyone. For instance, lexapro works wonderfully for me, but before that I tried zoloft and it was a nightmare. Made my anxiety 100x worse.", "I like Lexapro quite a bit, but I tried Wellbutrin once and it was terrible for me!\n\nKind of fascinating the differences in this stuff due to individual chemistry.", "Same, and then Wellbutrin was added to try and fix the issues that Lexapro caused...and then it became a whole fucking nightmare.", "hey, the same thing happened to me when I was on Lexapro! most terrifying time in my life.  \n\n\nlike, I think meds can be great IF you can find one that works for you, and the right dosage... and that's really only something that can be done with the guidance of a professional, especially since they can need adjusting. and the side effects for ones that aren't a good fit are no joke.", "That was Prozac for me. Ugh.", "A 16 year old so obsessed with a 24 yr old that she did the spill-a-drink thing on his wife at their wedding has serious issues. Did she ever get treatment for them? If not, that is a valid reason for your wife to be afraid of her.\n\nI doubt she got professional help since she ended up married to the man whose wedding she threw a teenaged tantrum at, which doesn't speak well for your dad's morals, either. I'm sorry, but it's true. Voting NTA. It's not the fact that your mom did something mean and irrational at 16 but... all the other stuff that makes me think your wife is justified in being wary of being near her. Unless her past issues have been treated.", "Yes, I agree with you. \n\nI began taking it, and immediately everything was better.\n\nNow, I have pretty mild anxiety, but it was not hard at all to adapt to living with Lexapro (?) and it helped, almost magically, within a week or so.", "Have you tried Celexa, Trazodone, or Seroquel? I take all 3 in combination and they did wonders for my anxiety, nightmares and sleeplessness.", "yes she has gotten treatment. She landed herself in the hospital a couple years after that. Even if she hadn't, she did that out of a place of pain, and she doesn't even care about our wedding. We've never been close and she has no stake in this", "Glad to hear she got help.", "…as did my cat. :)\n\nSeriously, I had a cat who stole a fudge-stripe cookie right out of the tray and ate half of it…he was fine but I certainly wouldn’t give it to him…", "not if you're diabetic lol", "There's zero sugar chocolates out there, tho."]}