{"id": 631, "submission_id": "yh5s0k", "title": "WIBTA for wanting the rules of my lease to apply to the homeowner?", "selftext": "Disclaimer: I (32F) have NOT confronted anyone about this, but I may plan to depending on what the people say. Also, I have only been living here for a month.\n\nSo, late last night my roommate (50'sM) (I suppose you'd call him my landlord since I am renting one of his bedrooms for the time being) brought home a ton of drunk, noisy people around 2 am. I was already in bed and trying to sleep.\n\nBEFORE I EVEN MOVED IN, he established that I could have no overnight guests and that all current guests must leave before 10 pm. And that quiet hours need to be respected from 10 pm to 7 am all days of the week. I agreed and assumed that he would do the same. As stated above, that was proven to be a lie.\n\nSo I confronted him about it with a text. I kept it straight to the facts and avoided any negative or insulting language and, as expected he apologized and said he would try to avoid it in the future and hoped that this experience wouldn't make me want to leave. All that would have been fine if he hadn't also added the statement, \"I know the rules don't apply to me.\"\n\nSo, finally my question is this: Would I be the asshole if I expected the rules to apply to everyone since I am paying a lot of money to live here? I didn't pay to be woken up with a bang at 2 am. I paid to have a roof over my head and a safe place to sleep.\n\nAdditional details: His sister (50'sF) is also renting a room downstairs and is treated with the same expectations (no noise and no late night guests) as far as I can tell. And yeah, \"his house, his rules\" but I expected that to end when I stopped being a teenager (aka the responsibility of someone else).\n\nI'm about to head to bed so any needed clarification won't be addressed until morning.\n\ntl;dr I pay rent to live with someone who thinks the rules in our co-signed lease shouldn't apply to them. WIBTA if I wanted them to follow all the rules as I am expected to?", "created_utc": 1667108681, "permalink": "/r/AmItheAsshole/comments/yh5s0k/wibta_for_wanting_the_rules_of_my_lease_to_apply/", "score": 25, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > what action you took that should be judged - I am thinking about asking my roommate to respect the rules of the lease as I am expected to despite the fact that he is the homeowner.\n\nwhy that action might make you the asshole - as he is the homeowner he can do whatever he wants whenever he wants and my telling him to do as he told me to do would come off as controlling, demanding and/or out of line.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, but I think it's either leave or get used to it. He is taking the \"my house, my rules,\" approach, and in his mind, he has a set of expectations for you, and a different set of expectations for him.", "INFO: Is it a co-signed lease or does this guy actually own the house?\n\nOr is he the actual renter, and you and his sister are subtenants?", "NTA. Where I live tenants have the right to 'quiet enjoyment' which means the landlord can't do things which interfere with reasonable peace or comfort or privacy of the tenant. You may want to look into the laws in your area.", "NTA\n\nThis really depends on the location you live in.  \n\nInfo?\n\nHowever, assuming you are in the United States.  Federal and the supreme court have established what is know as  Covenant of Quiet Enjoyment. \n\nThe covenant of quiet enjoyment protects tenants from disturbance from a landlord, or an individual acting on the landlord’s behalf, by providing the tenant with the right to use the rental for its intended purpose. It is important to note that the covenant of quiet enjoyment is not a promise that the landlord will prevent all noise disturbances on the premises.\n\nHowever, if the noise disturbance grows to a level where the tenant is unable to use the premise as a residence, then the covenant of if the landlord does not remedy the problem.  They can be sued for the cost of relocation and possibly the difference in the higher cost of your rent for the remainder of the original lease term with the labdlord. \n\nGenerally speaking, there are five basic tenant rights that are protected by the covenant of quiet enjoyment. Those five basic tenant rights are:\n\nThe Right to Privacy: In short, a tenant has the right to be left alone. The covenant of quiet enjoyment protects a tenant’s right to privacy by preventing a landlord from entering the property only for specific circumstances, or with the tenant’s permission.\n\nThe Right to Peace and Quiet: Numerous tenants of rental properties often have complaints of a neighbor playing music too loud, or a landlord that constantly interrupts the use of the property. Under the covenant of quiet enjoyment, landlords must attempt to resolve issues of noise complaints between neighboring tenants, or other nuisances, so that a tenant may have peace and quiet.\n\nThe Right to Freedom from Discrimination: A tenant has the right to use the property however they like, as long as it doesn’t violate the specified terms of the rental contract, or create a nuisance to other tenants. This means that the landlord cannot refuse to lease a premises based on a potential tenant’s gender, race, religion, sexual orientation, or other protected classes. Additionally, once a tenant is leasing the property, a landlord cannot prevent them from using the land however they’d like.\n\nThe Right to Safety and Security: The property must be reasonably safe for the tenant. This means that the tenant’s use of the property should be free from threats from the landlord, other tenants, or hazards. Thus, failing to disclose a hazard, or failing to fix a hazard, may be considered a violation of the covenant of quiet enjoyment; and\n\nThe Right to Basic Utilities: Basic utilities, which include water, electricity, heat, and internet in some cases, are all protected under the covenant of quiet enjoyment. Therefore, if basic utilities are not provided, then the tenant may be able to break their lease and sue the landlord for the costs of relocation.\n\nAlso search your lease for any exceptions to these laws and ruling.  In some locations such as Arizona.  The courts don't give a flying 🐀🍑 what the lease says if it violates tenant rights.  For those who say it's a legal contact.  The state of Arizona has made it a class 6 felony and minimum sentence of 12 months forfeiture of rents for a landlord to require a tenant to waive rights granted to them by state law.  So again. Location. Location. Location.", "Argh. Tricky situation. He's being an A H by being a hypocritical meanie weenie and You're NTA for wanting peace and quiet. But I'm not in an apartment or a roommate situation so I don't know if you'd technically be TA for expecting him to live up to his own rules. In my eyes, you're NTA though.", "NTA - This man is an asshat.\n\nHe expects a situation where your money is going to his mortgage/pockets just because he has the luxury of owning a home. On top of that, he gets to enjoy it and impose on your peace while you have strict rules to follow.", "NAH. As the owner of the home (or primary tenant) he can set different rules for you than he does for himself. \n\nBUT, you can certainly state your grievances and negotiate! It's in his best interest to have a happy tenant. So, explain to him what needs to happen for you to continue to be both happy, and a tenant in his home. \n\nTo strengthen your bargaining position, you should have a plan in place in case you can't negotiate an agreement. \n\nBut *don't* play the \"this isn't fair\" game! That will get you nowhere. Remember that he has something you want (a place to live,) and that you have something he wants (rent money). You are two adults negotiating how to get what you want.", "It's his house. The rules don't apply to him.  However its rude of him. \n\nNTA find a new place.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nDisclaimer: I (32F) have NOT confronted anyone about this, but I may plan to depending on what the people say. Also, I have only been living here for a month.\n\nSo, late last night my roommate (50'sM) (I suppose you'd call him my landlord since I am renting one of his bedrooms for the time being) brought home a ton of drunk, noisy people around 2 am. I was already in bed and trying to sleep.\n\nBEFORE I EVEN MOVED IN, he established that I could have no overnight guests and that all current guests must leave before 10 pm. And that quiet hours need to be respected from 10 pm to 7 am all days of the week. I agreed and assumed that he would do the same. As stated above, that was proven to be a lie.\n\nSo I confronted him about it with a text. I kept it straight to the facts and avoided any negative or insulting language and, as expected he apologized and said he would try to avoid it in the future and hoped that this experience wouldn't make me want to leave. All that would have been fine if he hadn't also added the statement, \"I know the rules don't apply to me.\"\n\nSo, finally my question is this: Would I be the asshole if I expected the rules to apply to everyone since I am paying a lot of money to live here? I didn't pay to be woken up with a bang at 2 am. I paid to have a roof over my head and a safe place to sleep.\n\nAdditional details: His sister (50'sF) is also renting a room downstairs and is treated with the same expectations (no noise and no late night guests) as far as I can tell. And yeah, \"his house, his rules\" but I expected that to end when I stopped being a teenager (aka the responsibility of someone else).\n\nI'm about to head to bed so any needed clarification won't be addressed until morning.\n\ntl;dr I pay rent to live with someone who thinks the rules in our co-signed lease shouldn't apply to them. WIBTA if I wanted them to follow all the rules as I am expected to?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nIt is his house, but he would be incredibly hypocritical for trying to enforce these “house rules” on you, he himself don’t need to abide by.\n\nI would also suggest posting this in the r/landlord sub", "NTA.\n\nAs the tenant, you have rights. At this point, he might own the house, but he *shares* the home. Yes, he should be treating you and him as sort of equals when it comes to rules of the house.\n\nAs the tenant, you have a right to peaceful enjoyment of the property, and he can't just roll back with a group of drunks at 2am.", "NTA and depending on the state and zoning laws he may not be able to prevent overnigjt guests. Time to move.", "This isn’t an advice sub.", "NTA, but he's renting you a room, not a private apartment, in most jurisdictions he does legally get to set the rules.", "YTA. You're expecting a condition of you being allowed to rent a room to apply to the homeowner. That's not reasonable", "YWBTA\n\n&#x200B;\n\nWhy would the rules YOU agreed to adhere to as a renter also be applicable to the homeowner? HE did not agree to them.", "Yeah he's the AH.. but the power imbalance means it's unlikely OP will have any influence on his behavior. A shit situation.", "He had me sign his own original lease. I don't actually know if he owns the house or if we are subletters.", "Diffrent rules apply for renting a room in someone’s home to renting a self contained property", "Ah, but do any of these conditions apply when the landlord is renting out a room in his own residence? Shared accommodation changes the rules in many jurisdictions. OP needs to check in with a tenant advocacy group in that location.", "1) This is the internet, not America\n\n2) This is AITA, not r/legaladvice", "What might I expect if I post it there?", "Thankfully my lease is only 3 months. so I'll be working on it shortly.", "the power imbalance also means that I will be looking for my own place that much sooner. I am really just between permanent addresses right now.", "You can probably check it out online.  Your city or county might have property records online.", "Which was the first line of what I stated.", "This comment should go to the OP.  I gave the general rights granted by Congress and the US supreme court. However, I already noted that the location is vital.", "It’s a sub for landlords and landlord adjacent questions related to renting, leases, problems with renting etc. might give you some insight.", "Sorry pal, landlords suck. Good luck!", "You say that like I can just Google it or something. I don't even know how to spell this guy's last name.", "Not before the edit you didn't..  \nBut it's a very good edit. Good info :)", "You don't have a copy of the lease? That you signed? That's a problem, dude", "Actually in the first draft it only states NTA and asked for location.  \n\nThe edit contained us supreme court and Congress laws.  Good try.  Way to try to twist and turn my initials reaction into the absence of what was originally stated.", "how'd you infer that from my reply?", "You mean when you asked which STATE they were in... Okay.", "Because his last name would be on the lease?", "Still a request for location.", "Good point. Yes, he only wrote \"owner\" where his name should have been.", "With the implication that everyone lives in the USA.\n\nSo I'll repeat.\n\n*This is the internet not America.*"]}