{"id": 6328, "submission_id": "101qez4", "title": "AITA for buying the necklace I wanted when my boyfriend wouldn’t?", "selftext": "My boyfriend Nate and I (21M, 20F) have been together for over a year, but we met in freshman year of Uni.  We both have jobs outside of school.\n\nI’m not a big jewelry fan, but there was this necklace I really wanted ever since I saw it on Pandora.  It was love at first sight.  I asked Nate if he could give it to me for my birthday.  He didn’t want to spend a lot, so I found some alternatives on Etsy he could look into that were more affordable.  Think a $25 pendant vs $75 on the Pandora site.  \n\nSince then, my birthday, our anniversary and Valentines Day happened and I never got the necklace.  He gave me candy and a hat, which is disappointing when he treats himself to a PS5 and some new games.  \n\nSo when I saw my necklace for sale online, I decided “screw it, I’ll get it myself”.  I’ve been wearing it ever since I got it in the mail.\n\nRecently, my classmates asked me if Nate bought me the necklace for Christmas.  I proudly told them no, I got it myself.  They all know how much I wanted it and a few of them are now making fun of Nate for not doing the thing for me.  \n\nNate is upset that I embarrassed him in front of our class and friends.  He got even more upset when I told him that he had a year to get me the necklace.  He wants me to apologize, but I won’t.  As far as I’m concerned, I did what I had to do when he wouldn’t.  \n\nAITA?", "created_utc": 1672699926, "permalink": "/r/AmItheAsshole/comments/101qez4/aita_for_buying_the_necklace_i_wanted_when_my/", "score": 1155, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I bought a necklace I wanted when my boyfriend wouldn’t.  When my classmates asked where I got it, I told them the truth and now everyone is giving him crap for being a lousy boyfriend.  He’s really upset about it and wants me to lie.  Like hell I wjllz\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nMy husband asks me before every birthday/Christmas what I want, because he is clueless when it comes to gift giving. I tell him. He buys it for me. (Within reason… I’m not out here requesting crazy expensive gifts 🥲)\n\nYou told him, gave him alternatives, made it clear how much you wanted it. He didn’t get it for you. He got you other stuff. You got it for yourself. He got mad when people found out. End of story. \n\nWhy should you apologise for getting yourself something you wanted??", "NTA...he showed you how unimportant you are to him & he's just embarrassed that others found out. My question is why are with this guy when he's clearly shown you how little you mean to him. These little gestures or lack thereof are very indicative of how the relationship will go in the future. He'll spend a lot of money on expensive games but will not save to get you something you really want. \n\nMy ex would only have to mention that she liked something. She wouldn't even have to ask. Like she saw something she liked, expressed it and I asked to see, and for her birthday I surprised her with it. You specifically asked and gave him multiple chances so he clearly has no interest in your wants and needs.", "NTA you bought yourself a gift. One your boyfriend couldn’t be bothered with and he’s upset with you? Time to see the light.", "Nta. These are called natural social consequences.", "NTA - Sometimes we need to reach goals and do things ourselves. You stopped pining for him to make a decision. ENJOY!  You did what you wanted to do; no 'had' to. Embrace your independent self.", "NTA.  Nate embarrassed himself.  He should be apologizing to you.  If he could afford a PS5 and new games, he could have done without 1 game and gotten the necklace.", "NTA. You bought yourself that necklace, so when asked who bought it makes sense you would give yourself the credit.\n\nIf Nate cares so much about other’s opinions he should’ve bought it himself. He had plenty of time to, you even gave him cheaper alternatives. Enjoy your necklace!", "NTA and enjoy the necklace", "What?! NTA. Girl, treat yourself! So much better than having someone buy it for you anyway. Wear that necklace with pride. His insecurities are his damn problem.", "NTA for getting yourself something you want. Why on Earth should you wait for someone else to get it for you? If Nate's embarrassed, that's his problem. (and I don't think he HAD to get it for you either, but if he was going to get upset if you got it for yourself there is something wrong here)", "NTA. I don't think your bf likes you much. Breakup", "NTA \n\nWear the necklace and love it! Your boyfriend never had any interest or intention in getting it for you.", "NTA. First of all, good on you for getting yourself something you love, wanted, and could afford to\npurchase! I bought myself earrings that I love because I wanted to get myself such a gift (and my husband didn’t get his undies in a twist over that). \n\nYou BF could’ve saved for that gift. I understand money can be tight when you’re a uni student—but he also could’ve saved and purchased it as a combo birthday, anniversary, Valentine’s Day gift. Especially since he has saved and gotten himself tech/game gifts. He’s embarrassed because people see that he was inconsiderate and didn’t make the effort to get you what you’d wanted even after you provided affordable options for him to gift you. Enjoy that necklace. You have nothing to apologize for.", "NTA. You did the right thing: buy stuff you like; don't wait for others to do so. You didn't embarrass Nate; he did that himself.", "NTA. But I would urge you in the strongest terms not to make this relationship your last. You are 20, you're in school, and it seems like you are developing a solid sense of self and a sturdy backbone. The world is wide. Nothing wrong with dating him right now. That's a learning and growth experience. But unless he does some serious emotional maturing between now and when you all graduate... Just...secure your birth control and do not be measuring him for the wedding tux.", "NTA Nate had more than enough time to buy you the necklace if he wanted to. Told him to suck it up next time buy the thing you ask for instead of getting mad when you get tired of waiting on him and buy it for yourself.", "NTA - but if you are looking for the side statement - BF is the ahole and you are not going to see it change.  I would always ask the wife what she wanted and would get it - all the way up to numerous horses (yes, the real animal).  Run - it won't change", "Nope NTA. You did absolutely nothing wrong to apologize for!! Nate’s embarrassed because he has a few chances or more to buy the damn necklace and chose not to, now all your/his friends are giving shit for it.", "NTA he chose a ps5", "Come on. What is the internal conflict or dilemma here?!", "I’m going with a soft ESH, but the stakes are pretty low. Nate sucks for wanting OP to apologise and for giving gifts that lack thought, OP’s friends suck for teasing Nate for not buying a particular present, and OP sucks for not shutting down the friends and making it Nate’s problem.", "YTA and SMH. Your bf isn't obligated to buy you anything. You sound really entitled.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend Nate and I (21M, 20F) have been together for over a year, but we met in freshman year of Uni.  We both have jobs outside of school.\n\nI’m not a big jewelry fan, but there was this necklace I really wanted ever since I saw it on Pandora.  It was love at first sight.  I asked Nate if he could give it to me for my birthday.  He didn’t want to spend a lot, so I found some alternatives on Etsy he could look into that were more affordable.  Think a $25 pendant vs $75 on the Pandora site.  \n\nSince then, my birthday, our anniversary and Valentines Day happened and I never got the necklace.  He gave me candy and a hat, which is disappointing when he treats himself to a PS5 and some new games.  \n\nSo when I saw my necklace for sale online, I decided “screw it, I’ll get it myself”.  I’ve been wearing it ever since I got it in the mail.\n\nRecently, my classmates asked me if Nate bought me the necklace for Christmas.  I proudly told them no, I got it myself.  They all know how much I wanted it and a few of them are now making fun of Nate for not doing the thing for me.  \n\nNate is upset that I embarrassed him in front of our class and friends.  He got even more upset when I told him that he had a year to get me the necklace.  He wants me to apologize, but I won’t.  As far as I’m concerned, I did what I had to do when he wouldn’t.  \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  Enjoy the necklace!", "NTA if he’s embarrassed then he should be. You bought yourself something you wanted. You have nothing to apologize for he’s the one who should apologize.", "NTA. I used to constantly tell my husband how I would love to receive flowers from him. Yet he would very rarely gift me a bouquet. So I decided to buy them for myself once or twice a month. At first he was annoyed, but then he realized I got them to make myself happy, not to show him up. Eventually he got used to seeing flowers in the house and he started buying me flowers when he noticed the ones I'd buy were starting to wilt. So now I get flowers frequently, and we're both happy.", "NTA. I love this story. My great-grandmother fully expected my great-grandfather to get her a new ring for their 50th after talking about it for a long time. No ring came. She went out and bought it herself. I inherited that ring and I love the story so much, especially because that was a time when women in my family didn’t often stand up and do things like that.", "NTA\nYour friends are for making it an issue.", "This! All day! He doesn't value you and has a problem with you valuing yourself.", "Yes. This. He is embarrassed people know he sucks, he has zero regrets that he sucks.", "Nate made it Nate’s problem not OP. \n\nNTA", "… she didn’t demand him to buy the necklace, hence why she bought it herself. She then told people she bought it when they wrongly assumed her boyfriend did.\n\nYou could call the friends teasing the boyfriend about it AH’s, but what did OP do wrong?", "Correct, but why is the BF mad about it?", "Why is this not an ex-boyfriend?\n\nBuys for himself, and demands apology if you spend your own money on yourself?\n\nNTA", "NTA. A $75 necklace that you even tried to find a cheaper dupe for while he's buying video games?! He sucks. He owes YOU an apology. Show him the responses on here...", "> He wants me to apologize\n\nChrist.\n\nIt's only ever assholes who \"demand an apology\".\n\nNate isn't the asshole for not buying you jewellery, but he's an asshole for getting butthurt over you buying it for yourself.\n\nYou have nothing to apologise for, Nate is a clown.", "He couldn’t afford $75 for you but bought a PS5? FFS\n\nWell we know where his priorities lie. Not your fault he was embarrassed, he should’ve been. NTA", "He won't buy it and you are... not.. allowed to buy it?? \n\nSo basically...He forbids you to have it? \n\nNTA\n\nHas he more of such fine character trades?", "Why does he want you to apologize? NTA", "NTA and he embarrassed himself lol", "He’s embarrassed as a result of his own actions, not yours. NTA.", "NTA. Nate was selfish and thoughtless and and his friends called him out on it. Not your fault, not your problem. Do NOT apologize for buying yourself something nice, and don't apologize for telling the truth. (MAYBE apologize for having bad taste in boyfriends.)", "NTA. Nate is a cheapskate towards you, he embarrassed himself.", "NTA.  There is never ever anything wrong with buying yourself something nice.  If he can buy himself a PS5 you can do whatever you feel like doing.  Actually you don’t need any excuse to buy yourself something.  If your bills are paid you take care of you!", "You're NTA.  \nI was in a similar situation decades ago. Window shopping in New York city in the 80s and my gf spotted a lovely Javanese silver necklace with stones. Beautiful intricate design and quite possibly a heirloom piece (this was well before the modern fake aged made in China replicas started turning up). I noted the shop and we continued with our 'wouldn't it be nice to be rich' window shopping around the Village. Few days later she was bedridden with quite bad flu... so I took the opportunity to buy her the expensive necklace while out grocery shopping. Hid it in my luggage.  \n  \n\nI'll never forget the look on her face when she opened her Christmas present a few months later.", "NTA. The best gifts are the ones you buy yourself 'cause you can.", "nta. also stop buying him such expensive and thoughtful things when he won't reciprocate.", "NTA\n\nYou gave him a year. He decided to buy you random nonsense instead. He can't get upset that you bought it yourself. How exactly does he expect you to apologize? \"Sorry I bought that necklace that you spent a whole year refusing to buy me. How silly of me to think I deserve to have a nice thing.\"", "NTA. I think this was a great solution — now the necklace won’t remind you of an ex!", "NTA", "NTA\nWhy wouldn't you buy the necklace you've wanted so long? Nate doesn't seem to be very big on giving gifts. Why would you not buy yourself nice jewelry? Are you supposed to avoid whole categories of goods because a paramour might buy something like that? Even when yours doesn't? \nThat's some weird gatekeeping about what you can get and how you \"must\" get it.\n\nI suggest taking a page from Nate's book and match, don't exceed, his energy towards you and your relationship. It's really strange that he and your friends are spoiling your joy in your necklace by making it's not being a gift such an issue.", "NTA. He cares more about other people’s opinions than your happiness.", "NTA… He honestly didn’t want to get it for you and I doubt it was because of the money. You are better off finding someone who will actually care about the things that you want and they will want to get it for you because they love you ( within reason)", "Ha ha! NTA. Send this link to \"Nate\"", "NTA\n\nYour buying the necklace has nothing to do with him. You’ve wanted it, saw it on sale, and bought it. \n\nDo they fault you for not buying him the PS5?\n\nJust say I don’t know what you’re talking about, then change the subject.", "YTA. Not because you bought your own necklace, but you’ve been pressuring him for ages to get it when he said no. Your friends are also minor assholes for making fun of Nate", "You’re an adult with her own money. You should have bought it sooner", "NTA ,\nI have to be honest with you, this is a manipulation tactic that was used against me in an abusive relationship years ago. My ex would never give me what I wanted or asked for. He would tempt me with the prospect of elaborate gifts or promises and never deliver. When we were together for over 5 years he asked what I wanted for xmas and I told him an engagement ring. He told me he couldn't afford one and that was perfectly ok! However, the next week he had a $2000.00 laptop delivered to our house for himself. It made me feel worthless and stupid for wanting it. After we split up he told me he had bought me an engagement ring (which was a lie). It was meant to make me feel guilty and gaslight me. \nYour boyfriend knew what you wanted, he didn't buy it for you despite being an affordable request and now he is making you feel like the bad guy for treating yourself to something you deserve. He is gaslighting you. Find a real partner who makes you feel like a queen. You didn't ask for much and you shouldn't feel bad.", "NTA…I told my husband for about this beautiful Opal ring that I had seen at a local jewelers. It was only $800 and because my parents regularly shopped there, they knew us and said we could put it on layaway for as long as we needed to. \n\nMy husband told me he would get it for me. I waited for two years as he claimed he was saving up the money for it while he kept buying himself hunting equipment.  \n\nUntil they sold it. Then I found out he never had any intention of buying it for me.  So now we’re divorced. I wish I had just ignored him and put the thing on layaway myself, but I trusted him.  I was never his priority. Unfortunately it took me 22 years to wake up and realize that. \n\nMy parents realizing how hurt I was over this actually bought me a similar Opal ring. It’s not as pretty, but the sentiment behind the ring makes it mean so much more. \n\nYou might want to check Nate’s priorities.  Does he usually push off your needs?  Minimize your feelings?  \n\nHe could afford his PS5 and some games. You gave him cheaper alternatives, and even told him where they were available. Chocolates and a hat are generic. How many other underwhelming holidays or anniversaries has he put you through.  \n\nWhat gets me is that my dad treats my mom like a goddess!  So again, I have no idea why I put up with it so long. \n\nMy last two LTR’s both treated me like my dad treats my mom, so I know guys like that still exist. I wish I’d find my Mr Right.", "NTA. But why are even dating someone that cares more about the perception of your relationship instead of your actual relationship?", "NTA o", "NTA. I did the same thing when I was your age, but it was a ring and not a necklace that i bought myself. I still wear the ring every day 10+ years later, and that boy is long gone from my life. Enjoy your jewelry!", "Is no one going to ask for more details about the hat? NTA but I’ve gotta know more about the hat.", "NTA and please take this lesson for what it is: sure, you can give others ideas for gifts you might like. He never intended to buy that for you. Whatever embarrassment he has is self-caused. You did nothing wrong. Also, this is who he is. Don't overlook that fact.", "NTA. Dump the boyfriend. He’s not ready for an actual relationship.", "NTA.", "NTA - is there a jewelry tax? Because now I want to see it. Just lost my favorite necklace and I’m looking for a new one when “treat yo self” day rolls around.", "NTA and never apologize for this. Ever. You bought yourself a modestly priced piece of jewelry you wanted for a year. He bought himself a pS5. \n\nNate chose to give you other things, which is fine. You are allowed to treat yourself with your own money. His embarrassment here is weird and it sounds like wants to control how other people think of him. \n\nWatch out for more red flags 🚩", "Nate's got a lot to learn lol. What he spends on himself as a treat he needs to spend on his gf.", "NTA and I can’t believe the audacity of Nate. Expecting you to apologize is way too much.", "He got a ps5 and some games, and refused you a necklace? That's sounding kinda selfish if anything. It's just really odd to me he can buy himself a new console and games, expensive at that, but can't buy you a necklace that's worth significantly less? Tf? Nta. I'd go and get the necklace no matter what. Nta.", "NTA and go you for treating yourself to something nice! \n\nYour boyfriend brought this on himself. I'm assuming he must be a really good lay to make up for the casual selfishness and neglect?", "You should apologize \" I'm sorry that your embarrassed,  sucks to be you.\"\n\nNTA", "NTA \n\nI asked for a sunvisor for Christmas (a custom one for my car that doesn't fit the 9.99 regular ones so of course I have to spend at least $70) \n\nI did not get the sunvisor but I did get a gorgeous set of jewellery and several other appropriate gifts\n\nAm I going to have to buy what I asked for myself = yes\n\nBut \n\nIs my bf a cheap ahole who made me feel unloved at Christmas = absolutely not\n\nKeep the necklace, lose the bf", "NTA. And Nate should apologize to YOU for being the AH. Don't ever feel guilty or apologize to anyone for giving yourself a gift.\n\nIs this the guy you really want to do life with? Who doesn't listen to you, doesn't care about what YOU want, as long he makes darn sure to get what he wants?", "NTA. Treat yourself, but ditch the dead weight.", "People reeeeally don't like the consequences of their actions, haha. Honestly you deserve better than this guy. Men show you with actions how much they value you. It doesn't matter what they say or what excuses they give. Those are words. If the actions don't match up, leave.", "He bought candy and a hat? Wow, what great gifts for a year relationship. NTA", "Nta  dump him he don't appreciate you .", "NTA", "NTA.  PS5 for him - no $75. Necklace for you?  He would be my ex-boyfriend.  Dating is the time the SO impresses you and puts their best foot forward.  His best foot forward isn’t so great. -Maya Angelou, “When people tell you who they are, believe them-the first time.”  He 1. Bought his nice expensive game system he wanted,2. Bought you a hat and candy-not the necklace you wanted, 3. Wants you to apologize for his lack of care for you so he isn’t embarrassed.  He has told you THREE times who he is.  When will you believe him?", "NTA.  You even provided less expensive alternatives.  Hes a dolt, and sometimes they gotta learn the hard way.", "NTA\nTreat yourself instead of waiting around for someone to buy you something. If it’s your money and you can afford it, then why not? \n\nWith some people, you could wait forever and a day for them to buy you any kind of gift.  \n\nIf you want someone who’s more attentive (and generous), then maybe you should find someone else?", "NTA.  What does Nate think you should have done, lied and said he bought you the necklace.  \n\nP.S.  If you want a future with a generous guy, Nate is not the one.  Don't expect this to change.  Just saying.", "Nta. He embarrassed himself. If he doesn’t want everyone knowing he’s a lazy partner, he shouldn’t be a lazy partner.", "NTA girl please think long and hard about this relationship. He only cared because of public appearances and it made him look bad. He’s cheap with you. Basically gave you bubble gum and paper wrap. No thought into the gifts", "NTA you go girl . He’s kind of selfish buying himself expensive gifts and you even saw one at a significant discount & he still couldn’t bother .", "NTA. It's better that you got it for yourself so that if/when you break up, the necklace won't have any negative memories attached to it.", "NTA", "NTA. Reminds me of the time where I was $50 short for a hotel room at my tribe’s hotel for Valentine’s Day & I asked my ex boyfriend to pay the other half (literally $50. It was a $110 & I already had the $60..) & he refused. So we didn’t do shit & my best friend out did him with a GIANT Valentine’s Day gift basket. He didn’t get me ANYTHING but asked me to go half on a $2k laptop later that summer & refused to help me with any payments to bills. Noticed how I said ex? \nThat’s what yours should be.", "NTA. He's embarrassed you met your own desires? Real mature there...", "NTA and fyi there are guys out there who will go out of their way to make you feel special in emotionally healthy ways like getting you gifts you desire, cooking you meals, and planning special dates. This guy ain't it", "he got mad cz you told people you bought something for yourself? so what, does he expect you to just forget about it when he doesn’t buy it? lmao he should be embarrassed. he even got a deadline I’m crying 💀 pls don’t apologize.", "NTA. Maybe he shouldn't have been so cheap if he didn't want to be embarrassed.", "NTA. A ps5 is $500 RETAIL, did he get it when there wasn't any in stock and over paid cause he paid even more then. Even then the games are $70 not including tax, so basically if he can afford the games he can afford the necklace it's the same price. He's CHOOSING that your wants are not as important as his wants, think about that and think if this is the first time.", "NTA... ummmm does Nate even care about anything/anyone other than himself?", "NTA. Nate does not care about you. He cares more about his self image. Girl, run.", "YTA. All these N-T-A judgements are conveniently glossing over the fact that you essentially set Nate up to take the fall. First off, if you saw something you really wanted, why was your first instinct to ask your BF to buy it for you instead of buying it for yourself? Why foist that responsibility and expectation onto him, without any discussion or consideration about how he would feel about it? Then you proceed to just quietly judge him for a year for spending his own money the way he wants to, and on his own interests. Why did you think you were entitled to any part of that? Why should your necklace take priority over his PS5? And it's not that he hasn't gotten you gifts for those occasions you mentioned, they just weren't the gift you wanted.\n\nBut most importantly in all of this is how did your classmates know you've been wanting that necklace and that you expected Nate to buy it for you, if you didn't tell them? Clearly you've been talking about it for a year now, setting the expectation to them that you expected Nate to get it for you. So when they finally did see you wearing it, of course they assumed your BF got it for you, only for you to throw him under the bus. It's one thing if he promised to buy it for you but never did, but all of this started with your own entitlement to his money, your own expectations, and then you getting an entire class to now get behind your own selfish entitlement. But somehow Nate is the bad guy here. Nate is not upset because he is \"embarrassed\". He's upset because you set him up for a responsibility he never wanted, and then he had to suffer the consequences of said responsibility via social pressure. A social pressure you created and applied onto him. A social pressure that this sub gleefully lapped up and is now using to validate your entitlement whilst crapping all over your boyfriend.", "NTA but your friends are for making fun of him (and you by proxy). Bf shouldn’t be upset by you, but also he’s not such an AH. Be careful who you hang out with that would willfully make fun of him like chill out\n\nEdit: wow seeing a lot of NTA about bf not getting you a gift. Didn’t know gift giving was a huge expectation, if that is your love language, then that’s understandable. But I don’t think you should *expect gifts* from your loved ones. I wonder if your bf would’ve cared you got the gift if the friends didn’t make fun of him. Sounds like he’s TA for caring about other people, and also your friends are AHs.", "I have known guys that don't like to be \"told what to do\".  Guys like this know perfectly well what you want, but because you are being \"bossy\" (in their point of view) they won't get it.  I don't like to play this game, if someone won't get me what I want I'll get it myself.", "Will OP have to run all future purchases past her boyfriend to make sure she isn't going to embarrass him?  Ugh", "For real. If telling the truth makes someone think they look bad, we all know what (or who) the real problem is.", "My spouse is literally so bad at gift-giving, I have relieved him of the burden. At one point he asked what I would like for my birthday, and I replied \"Don't worry, you already got me something.\" He looked baffled for a moment then asked \"well did you like it?\" To which I laughed so hard I cramped my own face.", "Good on your husband!  Mine is similar.  We've been married 31 years in the next two weeks.  We have learned to literally \"cat finger\" the other person's eyes to what we want and say \"PUT THIS ON THE LIST I LIKE THIS WANT THIS\" or something like that.  That's all it takes for him.\n\nThat \"Nate\" didn't listen makes him a ripe asshole for sure.\n\nOP, you tell Nate he embarrassed himself.  Tell him the only apology he will get is that you are sorry you trusted him.\n\nNTA\n\nYou are worth $75, let alone the $25 replacement.  You are worth the time to order it.  You are worth the time to put it in a damned gift bag.", "Why even stay with him now?\n\nShe should dump him while she's at uni snd surrounded by thousands of people her own age - the biggest dating pool she'll ever live in.", "I broke up with a guy after almost 3 years, because there was a play I Really wanted to see at my city's orpheum. I had wanted to see the play for years, and he knew cause I'd talked about every single time it was in town. Well this time, it was in town on my birthday, and even had a matinee showing which I prefer cause then you can get dinner after and go home all fat and happy. \n  Anyways, I let him know thats what i wanted for my birthday, didn't hint or anything, over 6 months in advance. Tickets for decent seats at that time were about 60-80 each. Very cheap for the play (Wicked) and the area. And he hemmed and hawed for 4 months until the crappy seats were the only ones left for over double the price.  \n\n  I tried again then, and he told me he couldn't do it cause he had just bought himself a bunch of weed, and said that he was gonna share it with me for my birthday. I didn't even smoke back then. After that I knew, he wasn't ever gonna do a damn thing to make me happy. There was a lot more crap that I had dealt with from him, so that straw(one very very heavy straw) broke this camel's back, and I dumped him.", "Jesus Christ you're fucked up.", "She said she wanted it for a special occasion. She wanted it to be special to get it from him. Eventually she took matters into her own hands. And now it’s special because she bought it herself even when she wanted it as a gift from her bf", "How dare people enjoy gifts on gift-giving occasions.", "This!", "Did you ever get to see Wicked?", "Good! Glad you dumped that loser.", "Glad you found out before it was too late", "Some people don’t really understand gift giving and how important it can be to others. He definitely seems oblivious at best, but based on the post I would go so far as to call him an AH", "Nope! I missed that year's tour and it hasn't been back since, and that was ~5 years ago.\n\nIt'll be back in my city at some point though, hopefully, and I plan on buying myself the \"box seat\" tickets as soon as it's announced.", "Make sure you do! You are worth it and it’s definitely worth seeing!", "NTA\n\nHe wants credit for something without having to do anything. Think hard about where else in your life you give in to what he wants, how often he gets his way, etc. The one time you finally didn't - this is how he reacts. Marinara flags.", "INFO: why didn’t he get it for you?", "\n\nI'm not commenting to add to the dogpile here (obviously NTA) but.....\n\nWill someone please ELI5 exactly what OP is supposed to be apologizing for?\n\nI don't need to hear \"because he's a jerk/embarrassed,\" etc.\n\nI'm asking to fill in the blank \"I apologize for ______ “..... what?", "NTA. You explicitly told him what you wanted. When he didn’t listen you got it for yourself. He embarrassed himself, not you. And hey, since it’s not a gift from him if you guys break up you won’t have any negative juju attached to it.", "he wants YOU to apologize? for what? it's perfectly fine to treat yourself. NTA", "He was happy to not do a nice gesture for you until people found out about it, like others said it doesn't seem like you're a high priority to him. NTA", "Nta He is immature he cares about his wants like video games over you", "NTA. \nMy mom said once on her birthday:\"Where's my flowers?\" My dad quickly went out and got her a bouquet. He also got her flowers from then on on holidays, Mother's Day, Spring, etc. They were married for 51 years until he passed.\nOP, find a guy who treats you like that.", "NTA. He had a year, and he bought himself a PS5 instead. Hope he really loves that PS5…", "NTA. He wouldn't get you the necklace cause he \"didn't wanna spend alot of money\" but then buys himself a PS5, which is at the very least, $400. He sounds like a very bad partner", "NTA. At all. If he can spend hundreds on a game console and games, then he can spare $25 and even $75 for your dream necklace. Obviously seeing how much it means to you. He’s the AH for being ignorant towards your wants, because you weren’t even asking for much and even found a cheaper option for him to purchase. Find someone who treats you like a queen, babe.", "NTA. I have a similar story. Few months before this Christmas me and my bf gave each other a small list of what we wanted to receive for Christmas. He wanted some band T-shirts and a specific Blu-ray, and I wanted a limited edition item and anything cutesy or Octopus related. We wanted to surprise each other so we tried to misdirect the other. I got his best friend to ask him other stuff he wanted for Christmas and he got my sister to double check the stuff I wanted. Christmas came and he was extremely happy to get the band T-shirts he always wanted as well as the Blu-ray. He got me the limited edition item I wanted and he resorted to getting me an Octopus pyjamas which I absolutely adore.\n\nYou deserve to have a partner who will be excited to see the look in your eyes when you open a gift and inside that gift is something you've always wanted.\n\nSadly, I don't see Nate being that person.", "NTA. Many years ago my husband didn’t get me what I wanted for my birthday or some other holiday and I was disappointed. My mother in law saw this and told me to buy it myself and make myself happy. Which you did, you made yourself happy. And good for you.\n\nCan we get a little necklace “tax” and see what the necklace looks like? Valentine’s Day is coming up and I need ideas for myself.", "NTA. \n\nDump Nate. He doesn't care about you. He only cares about himself. He couldn't spend $25 for a necklace you wanted for your birthday? It's not like you asked him for it on a random Wednesday and wanted it right then.  \n\nHe's lazy and mad because he looks bad that you got your own. You do not want a future with anyone like that.", "Why on earth would you apologize to him for buying yourself jewelry you like? You didn't make him look like a jerk, you bought yourself a necklace. His response makes him look like a jerk and super controlling to boot. NTA, and do not apologize for his insecurity.", "NTA. And I’d drop homie. Especially if he’s splurging on shit, but whinging about that necklace/pendant.", "Is there a reason why you are staying with a guy who thinks so little of you and wants you to \"cover\" for his cheapness?", "NTA, you did not embarrass Nate, he embarrassed himself by being a clueless, uncaring cheapskate. Do not apologize to him for him being a looser but dump him and find yourself a bf that actually cares about you more that he cares about his PS5 and his games. He does not deserve you.", "NTA- Your young and can move on from this guy. He's known about this necklace for a year and you also found a cheaper version and he still didn't get it but managed to get himself a PS5. He's upset because your friends thought he finally got it for you but now looks bad since you bought it yourself.", "NTA. Treat yourself girl!\n\nIf he isn’t getting the hint to get you what you want (alternative or actual option), I say get it yourself. \n\nAs the great Beyonce sings in Run the World (Girls):\n\n“This goes out to all my girls\nThat's in the club rocking the latest\nWho will buy it for themselves and get more money later”", "I was in this position for many years. It doesn't get better. He knew you wanted the necklace. He doesn't care. If it's not important to him, he won't do it. He's just mad it made him look bad in front of others, as it should. A good partner would be supportive if it's something you care about. If you stay with him, you will be disappointed in gifts several times over. He won't change if this isn't his wake up call. \n\nNTA.", "NTA - you wanted the necklace for the sake of the necklace.  You gave BF a chance to get it for you, even giving him alternatives.  He decided to get you other things and missed three great gift-giving opportunities.  You still want the necklace - it went on sale, and you bought it for yourself.  You are allowed to gift yourself things you like.  You are a grown adult with a job.  \n\nYou didn't rub it in his face, nor bash him to your friends.  They asked a question, you answered honestly.  If the truth embarrassed him, maybe he should have done something during events 1 - 3?\n\nMy idiot husband completely missed my FIRST Mother's Day, as a mother.  When I reminded him, the day after, his first response was, \"Oh, I forgot Mother's Day; I need to call my mom!\" - no apology, no make up celebration.\n\nMy second Mother's Day, I bought myself a card, and a gift (one of those plaster kits for hand or feet imprints), and handed them to him.  I told him Mother's Day is this Sunday.  I expect this card to be filled out, and this gift wrapped and presented to me at dinner tonight (we were traveling, dinner would be out no matter what).  All he could do was say, ok, and thank you, for doing all the work for him.  You know what he couldn't and didn't do?  Get mad at ME.", "NTA... it's your independence necklace.", "NTA. On the one hand, his money is his own and he’s free to decide how much he spends on himself vs on you. On the other hand, though, you have nothing to apologize for if you asked him to buy you the necklace and he chose not to.", "Hubby loves when I ask for something. It literally shows on his face the way he smiles and lights up. I fight my hubby to NOT get me more jewelry unless I ask. He has kind of complied, getting me purses or clothing instead.  And a PS5? We both game and I was able to get one, which I meant to be for him (one per person) and he insisted I get the first one and he will get the next one we are able to find. Nate needs to be replaced with someone who appreciates and loves you enough to listen to you and wants to see you smile and be happy.", "Dump the boyfriend.\nNta", "NTA. Nate embarrassed himself.", "NTA.", "NTA. Women need to normalize being their own Sugar Momma. And yes, you gave him ample opportunities to buy it, but there's absolutely nothing wrong with buying it for yourself.   \n\n\nWhen my husband and I got married, he didn't want to buy a ring because \"it's a waste of money\". I found a very cheap ring I was willing to live with, which he bought me. It lasted 2 years before the diamond fell out and got lost. I waited 6 years for him to replace it, but he never would because he \"hates diamonds\". Yet I have bought him 20x that amount in video games, legos, action figures, comic books, etc. over that time period.   \nI finally heard someone say, \"be your own Sugar Momma\", and I realized they were right. I make a very good income (far more than my husband). Why am I waiting on HIM to buy me anything????? I am 100% happier just buying what I want instead of dealing with hurt feelings and drama, with the pride that I paid for it myself!", "NTA.  How dare he demand you apologize.", "NTA and he should be embarrassed!", "Nta ur young n dump him", "Ahem, I shall now quote the book of ye Destiny’s Child: section Independent Women part 1, chorus 1\n\n“And I say unto you: The shoes on my feet, I bought 'em\nThe clothes I'm wearing, I bought 'em\nThe rock I'm rocking, I bought it\n'Cause I depend on me if I want it\nThe watch I'm wearing, I bought it\nThe house I live in, I bought it\nThe car I'm driving, I bought it\nI depend on me (I depend on me)” \n\nThus from these teachings, as quoteth by the Prophet Kelly, and her then follower Farrah, ye be NTA, but a honey who maketh thy money. Amen.", "NTA", "NTA", "NTA. He needs to step it up. When I tell my fiancé I want something, he would go to the ends of the EARTH to get it (within reason).", "YNTA For too long women have waited for a man to buy something we want. He’s made it clear that he doesn’t intend to but it. You didn’t lie about where you got it which he seemed to expect. He’s had over a year and chose not to purchase it. Enjoy the beauty of your necklace.", "No sweetheart You Are Not The AH. He gave up his parental rights, the family called you a gold digger & has the audacity to question you about how you've been financially supporting your son. Fkkk them. You tell your son whatever you want right now & later on when he is old enough to understand you can sit him down & tell him everything.", "NTA There nothing to apologize for. If he was going to buy it for you, he'd have done it by now.", "NTA\n\nYou got something you wanted. He didn’t. That’s for you to decide what you say; he can’t tell you what to tell people.", "NTA Nate embarrassed himself he has had numerous opportunities to get it and chose not to.   \nDo not apologize for treating yourself.  You deserve it!", "NTA. And he wants you to apologize for buying something for yourself? Wow.", "NTA but Nate is", "ESH\n\nYour boyfriend should’ve put more thought into his gift giving it sounds like. However, going out of your way to embarrass your boyfriend over such a little thing is petty.", "NTA and I’d be shocked if you’re together by the end of the spring semester.", "He wants you to apologize?  What a whiny baby.  Please dump his ass.  It's better to be dating no one than someone so delicate that he wants you to apologize when he screws up.", "NTA. At least if it comes down to it, if y'all break up you won't have to look at that necklace and have negative thoughts on who got it for you. You did! Treat yourself, Honey.", "Nta but why are you with someone who doesn't consider you important enough to spend $75 on a dang necklace? When he will drop $500+ on a PS5 and then $60+ per game. And that's if he even got the console at store pricing, more if it was a scalped unit.", "NTA. You gave him so much time! It sucks he wouldn't get it for you , he deserves to be called out on this!", "NTA. \n\nApologise for what?\n\nProbably worth discussing your expectations re: gifting going forward though, so you won't be disappointed.", "This is just my personal feeling.....\n\nThe point of gift giving is showing that you put some thought, if not effort, towards another person.  If you are just being given exactly what you want, and you go out and buy it regardless, then that sort of defeats the whole point, doesn't it?  YTA.  If you don't like the gifts that someone gives you, then tell them not to get you anything: but quit wasting their time.  You sound entitled and ungrateful.", "Yup. Keep the necklace, dump the man. NTA.", "Agree.. and adding.. You (OP) did not embarrass him. He did that himself. \nNTA", "My husband and I do the same, but we basically just use the holidays to buy each other the stupid expensive things we won't buy ourselves normally.", "Husband vs boyfriend. Difference. I know Reddit says they are all the same blah blah. But I disagree.", "Yeah, this is the end of the discussion. \n\nHe embarrassed himself over $25 when he definitely had the money. \n\nThe candy and the hat he gave her were probably regifted if he was too cheap to get her even the $25 \"cheap Etsy version\". \n\nImagine putting in that little effort and expecting everyone to talk about how great you are.", "Off-topic, but you just reminded me of a sweet memory. My dad subscribed to a service that delivered flowers once a month, for my mom. He made sure to renew it for an extra year before he died, so she'd still get flowers from him after he was gone. 🥲", "NTA girl please think long and hard about this relationship. He only cared because of public appearances and it made him look bad. He’s cheap with you. Basically gave you bubble gum and paper wrap. No thought into the gifts", "My hubs isn't bad at gift giving, but I am a huge thrift shopper. It is not uncommon for him to come home to a bag on his side of the bed and me saying \"that's my birthday present from you\". Amazon wish lists are also amazing!\n\nOP, you're NTA. He had plenty of opportunities, he chose not to take them. Congrats on your new necklace! I'd love to know what it looks like 😬", "For our 33rd anniversary in November, I bought the mushiest anniversary card…for my husband to give to me!  :). He’s immunocompromised and I knew he’d want to go to a store to buy me something, but I prefer to keep him safe.  He laughed hysterically when he saw it and then wrote me a poem.  A good partner pays attention.  OPs boyfriend is not.  OP is NTA.", ">Not only that he didn't get her the reasonably priced(or cheap version) but that he was buying himself a PS5(approx $500), and I bet she's bought him nice gifts(tho she doesn't mention it).", "\"Leave the gun.  Take the cannoli.\"", "Absolutely right. He doesn’t care about the necklace. He cares that OP told her friends that he didn’t buy it, making him look cheap.  He probably was happy that she bought the necklace herself as long as he could front like he’s the big spender. \n\nOP - enjoy your necklace!  As for your boyfriend, you can do better.", "Damn. That reminds me when all I wanted to do was go bowling with my ex because I thought it sounded fun. I even had a coupon for buy one game get one free. He complained about the cost (I said I’d pay), then that he didn’t have time, etc. Asshole went and bought himself a second truck a week later, paid in full, with cash."]}