{"id": 6358, "submission_id": "101xy58", "title": "AITA for not wanting to eat what a 10 year old cooked on her own?", "selftext": "She made french toast and insisted I eat it but I am so afraid of getting food poisoning and missing work. I didn't say to her I didn't want to be sick but her family members (my friends family who I am visiting) tried to guilt trip me into eating it. Now they're saying I'm mean and should have eaten it out of respect. I see it as the little girl not being able to take no for an answer. And I never mentioned that literally out of respect for the family. I'm feeling kind of like an asshole but wtf.", "created_utc": 1672719710, "permalink": "/r/AmItheAsshole/comments/101xy58/aita_for_not_wanting_to_eat_what_a_10_year_old/", "score": 796, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I didn't eat the food. The 10 year old begged me to eat the food and it hurt her feelings when I didn't.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "from a bodily autonomy standpoint you have a right to refuse food, but i'm not sure how tf someone could manage to wreck french toast so badly that you had to miss work ...", "Info did it look very bad or something? I was cooking for others at ten and know others who were doing the same so like. Were you nervous for a reason or just on principle?", "YTA\n\nShe's 10 and made French toast. You were worried about food poisoning from eggs, cinnamon and bread?\n\nWOW...", "INFO: Did you see her make it? Seems like a dish that would be hard to screw up to the point that it could make someone legitimately sick.", "INFO did anyone ask you if you wanted French toast before she made it?", "NTA Especially if you didn't see them cook it. Unwashed hands dipping toast into egg wash 🤢 I feel like more people without children are apt to agree with you OP. I know I do.", "NTA as long as you gave a gentle no thank you. No one should be pressured into eating anything, idgaf if she's born again Julia.", "NTA - everyone has a right to decide what they eat. That doesn’t change because a child made it. I’ve literally read 2 other AITAs today where someone was being asked to eat something they didn’t want to and the responses were totally different than they are here. \n\nThat said, you should be polite in the way you decline it (example: “that looks great, but no thank you I’m not in the mood for French toast today”) because saying you don’t trust the cooking etc. can make you an AH.", "NTA. I don’t get all the Y T As at all?  Thought we all understood kids shouldn’t be forced to eat things and should have autonomy. Why would the kid not be able to understand “no thanks, I don’t want any” and apply the same concept to adults? Guilting OP is just gonna convince the kid that people are being mean when they have boundaries. If a kid made me a dish with raw eggs nobody saw them make I wouldn’t touch it either. Kids can also be germy as hell and not wash their hands or drop spatulas and keep using them. Perfectly reasonable to say no to food being offered by anyone for any reason.", "NTA. I can’t believe people think you’re an AH for not wanting to eat food- doesn’t matter who cooked it or what the reason is- just not feeling like it is a good enough reason. It sounds as if you declined politely (or at least you didn’t tell her your real reasoning), and her family members are the AH’s by pushing it and making the interaction weird. They missed out on an opportunity to teach the 10 year old about consent (asking someone something and respecting their wishes) and disappointment. Defiantly NTA OP.", "NTA. You are allowed to refuse food for any reason, because you have bodily autonomy. Eggs can give you food poisoning. Eating bacteria from a child’s unwashed hands WILL cause food poisoning depending on the type of bacteria. Just because your child can cook food doesn’t mean an adult should be FORCED to eat it? That makes no sense. There are many 10 year olds who eat their boogers, let dogs lick their fingers and take a piss without washing their hands. Food poisoning is severe. I wouldn’t take the chance either and we allowed to say no because it’s our body???", "Im going to say NTA not because a 10 year old is incapable of putting together simple ingredients. But what about hygiene? Are the utensils clean? Did they wash their hands well? Were they scratching their butt waiting for the toast to cook. These are normal things to consider. I wouldn't eat a damn thing given to me by any child unless I watched them make it or somebody I trusted watched them.", "NTA.\n\nI know the other posters will be against my opinon. But although you can't get food poisoning from toast, I too would have politely refused.\n\nReason: I'm over 18 and nobody can force me to eat anything I don't want.", "NTA\n\nI wouldn’t eat it either, lol!!! \n\nIt’s also a good lesson for her that not everyone will do what you want.", "NTA. You have no idea if she washed her hands, didn't cross contaminate utensils etc. Ingredients aren't the issue, a ten year old possibly picking their nose, playing with a dog, touching everything on the ground and then cooking is. \n\nYou don't have to eat something you don't want to any more than you have a right to force her to eat something she doesn't want.", "NTA. You don’t have to eat anything you don’t want, regardless of who cooked it. Everyone else there needs to get a grip and stop coddling a 10 year old.", "ESH\n\nYou shouldn't be pressured into eating things you don't want to eat, but I also suspect your concerns of food poisoning are completely overblown. There are many 10 year olds who know how to cook, especially simple meals like french toast. Her family is likely much more aware of her cooking abilities. And the biggest danger here seems like potentially undercooked eggs which plenty of people eat to no ill effect (think, cookie dough).", "YTA. My 5-year-old can cook french toast in a way that is reasonably safe without supervision. It would be a mess to clean up but perfectly safe. If the kid knows literally anything about cooking, your entire fear-based structure on eating means you should never eat anything you didn't see prepared. It should be easier to trust a 10-year-old's french toast than any burger joint's grill. I've cleaned them.\n\nYou could tell by cutting the bread if the dish was cooked properly. Literally nothing about your excuse structure has anything to do with the food. It is *entirely* based on a lack of trust that you chose to perpetrate without the slightest hint of effort to justify it outside of fearmongering.\n\nIf I were her parents, I would be wary of any interaction you have with a child going forward.", "NTA. As an adult, you chose to not eat.", "NTA free will, yo. Kids can be dirty", "YTA you're supposed to pretend to eat it then throw it out when the kid isn't looking if the food isn't edible.", "YTA have you watched Master Cher Jr? Some kids have talent!", "YTA\n\nIf a kid is making French toast, they aren't a beginner cook. Even if you don't like the food, you still take a few bites as thanks before discreetly disposing of it. Your excuse is BS.", "No. She asked if I wanted any and then demanded everyone eat it. She was persistent with me when I said no so it became a principle issue at that point I guess. Edit: I read that as if anyone else asked if I wanted any.", "INFO: Are you prone to getting sick from certain foods? Did other people eat the food and get sick?\n\nIf not, I'd say it's pretty hard to mess up french toast and you're being an AH for not indulging a kid.", "YTA for focusing on her age. If you are concerned about food poisoning you should be concerned no matter who made the food. If she can handle the stove and has made french toast then there is no bigger risk than eating something her parents or any other adult made. I am assuming you didn't turn down anything made in their kitchen and this is simply an attitude of \"kids can't cook,\" They can. They do.", "YTA.\n\nA ten year old making French toast is a big deal. There is almost no scenario where she could possibly give anyone food poisoning from it. That’s absurd.", "Thanks for the answers but I don't agree. Who knows what she put in it. I don't. I'm supposed to expect someone to instantly vomit when they put the food in their mouth and judge the food accordingly. I'm expected to trust this kids judgement on cross contamination? She could have made it in a dirty pan for all I know.", "Well, I don't think you're any more likely to get food poisoning from her French toast than an adult's, so the ageism here is a little troubling. I mean, lots of ten year olds can cook basic things like French toast, and you can look at it to see that it's fully cooked, for Pete's sake.\n\nAt the same time, nobody should shame you for your health concerns or dietary preferences. If my guest didn't want to eat something served, I wouldn't insist or allow my child to insist. I always tell guests, especially kids, \"at my house you only have to eat what you like. You can try any of the food and if you hate it, just don't eat it. I want you to like it here!\"\n\nESH. You for acting like because it's a kid cooking it might be dangerous and them for pressuring you.", "ehhhhhh I have conflicting feelings about this. Morally you are within your rights to say no I agree.   \n\n\nI just think your reason is trash.", "NTA\n\nKind of weird reasoning and I’m wondering if you have anxiety or something.\n\nBut honestly I wouldn’t want it, either. 10 year olds aren’t exactly known for having great hygiene. Chances of boogers or other grossness isn’t necessarily low.\n\nBut next time just say “it looks delicious, but…” you aren’t hungry or don’t like french toast or your stomach is upset…just any polite excuse\n\nThey should not try to force you to eat something you have declined. That’s very rude of them", "YTA unless you had a legitimate reason for thinking it was raw or unsafe. Most ten year olds are perfectly capable of combining bread, milk, egg, and cinnamon safely.", "Is this how you always act toward eggs? Because eggs aren't that scary- even made poorly. \n\nYta", "Leaning yta.... but Info- did it looked cooked? Because, most 10 year olds can make french toast....  Unless there is so big piece of info missing, like she had covid, the bread was super wet, she didn't put it on the stove..., yta. You prejudged her cooking. My daughter makes us eggs for breakfast all the time. And crepes. It's completely healthy unless there is information you aren't sharing...", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nShe made french toast and insisted I eat it but I am so afraid of getting food poisoning and missing work. I didn't say to her I didn't want to be sick but her family members (my friends family who I am visiting) tried to guilt trip me into eating it. Now they're saying I'm mean and should have eaten it out of respect. I see it as the little girl not being able to take no for an answer. And I never mentioned that literally out of respect for the family. I'm feeling kind of like an asshole but wtf.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, you don’t HAVE to eat anything. And I understand how messy kids can be, especially if it was unsupervised like you said. (Which really it shouldn’t have been considering she must have used the stove?) \n\nPolitely decline bro you’re good.", "NTA. \n\nConsent and boundaries matter, even for something like French toast. Your fears aside, “no” is a complete sentence.", "NTA- You Don’t Have To Eat Something You Don’t Want To", "NTA I think you're irrational but nobody should be forced to eat anything they don't want", "NTA. You simply have a right to not eat what you don’t want.", "NTA, No person should be forced to eat anything.   \nBut there used to be a thing called 'manners' which had magic words for such little problems. \"Thank you for your thoughtfulness in making me breakfast, Little Girl. But i feel a bit off this morning, so I will have to decline your kind offer.\" is the incantation for this.", "NTA all the y t a s are probably from entitled parents or people so used to getting their boundaries trampled they don't even recognize it anymore. It is in everyone's right to refuse to eat food they do not want to eat. OP is a whole ass adult who should not be guilted into eating some random dish some kid made. All OP needed to do to not be an asshole is refuse politely which is what seemed to have happened. Just cause a kid made it does not obligate everyone they try to push it on to eat it and lie about how good it is. Having boundaries is not rude.", "I’m going to guess you didn’t see her cook it. Do we know if she washed her hands beforehand? Did she use clean utensils? Did she pick her nose, pick a wedgie, etc. and then go back into the cooking? Did she get food on her hands, lick it off and then go back into it? At ten I know I had no sense of hygiene or any idea of hygienic cooking. I’m going to say NTA because I’m a person who barely eats out or eats any food people prepare if I’m not there to see it made and how it’s prepared. I wouldn’t have eaten it either.", "NTA\nYour reasoning is pretty stupid but you still shouldn’t have to eat something you don’t want to", "NTA", "Food poisoning and missing work is a stretch but NTA, OP. \nThese Y-T-As make sense only if you yelled at her or something for offering it to you.", "NTA - first off, no means no. What matters is that you didn’t want to eat it and they should have respected that. If it was me, I probably would’ve asked them to save me a piece for later (and hope they forget about it.) \n\nMost kids can’t cook and I’d be worried about the child staying sanitary in the kitchen. Just because a parent would eat their kids potentially germy food doesn’t mean everyone else should have to.", "No judgement but you are over reacting.\n\n10 is old enough to cook.", "NTA.\n\nWhy?.\n\nKids aren't exactly known for having a good hygiene. There's instances where they scratch every part of their body and yes that includes their butt and genitals, picking their noses, don't wash their hands properly and many more. \n\nThey don't know about cross contamination and I for one would never eat a child's cooking especially if I didn't witnessed them making it. No one can guarantee ( unless you witnessed it ) that the food will come out full of germs, plesant to look at, or if it even tastes good. \n\nThe fact that her parents enabled her to insist you eat her food when you already said NO makes me thinks the parents are the huge AH's for not teaching their kid that NO means NO. 🙄", "NTA. You set the boundary of not wanting to eat the French toast. Now, I don't know your situation. Maybe you are more responsible than me. Personally, I would've ate the French toast just to make everyone shut up about it, but a child hearing \"no\" is not the end of the world. In fact, hearing no even though they really really want you to eat it, can be a character developing moment. People saying that you're the asshole for not eating it \"just because the eggs might be undercooked\" and hurting the kids feelings need to get a grip and touch some grass.", "YTA my 7 year old knows how to make French Toast and I enjoy his cooking mind you his menu is limited but he knows how to cook some basics.", "YTA 10 years is old enough to cook basics. My kids were taught since early age to wash hands before preparing food and before emptying the dishwasher.  Not sure how you thought you’d get food poisoning… odd.", "Yta. You weren’t going to get food poisoning from French toast. Lol", "YTA\n\nYou have not stated how the food looked... if it looked OK , you should have eaten it \n\nFrench toast is literally pan fried bread that has been dipped in egg...a very basic dish my kids have been making from 9 or 10. \n\nYou seem to want to argue which makes you an AH too ... makes me think you would be like that irl too", "YTA.\n\nMost people eat eggs in a various state of undercookedness. Over easy eggs?? \n\nCome on . . .\n\nYou owe that little girl an apology.", "ESH. You don’t have to eat anything you don’t want to eat. But to assume that anyone’s cooking would give you food poisoning for no reason other than you didn’t watch her make it—c’mon. Many of us parents work hard to teach our kids to cook safely. And I have a feeling you wouldn’t have had the same level of concern if an adult made the French toast.", "Who ever heard of food poisoning from French toast? It’s not like she served you a medium rare chicken breast. YTA.", "No one is the asshole, but I think you might have an eating disorder. Would be worth it to check it out.", "Food poisoning from French toast? My kid has been eating steak tartare since she was like 3 made by restaurant chefs so professionals. Raw meat and raw egg. Get over yourself. It’s French toast and some 10 year olds can actually cook pretty well. You sound like an adventurous eater…./s  even if it wasn’t entirely cooked chances you will get sick from it are very slim to none", "ESH. She needs to learn to hear no and  be gracious about it. Also French toast isn’t going to make you sick. Her germy little fingers might get you get you sick but you didn’t say that. You talked about food poisoning.", "YTA. Your concerns were baseless. No reason to think it would make you sick, beyond the fact that the cook was 10 years old. As others have said, that's plenty old enough to be able to make French toast safely. \n\nDo you have the right to bodily autonomy and saying 'no' when offered food? Absolutely! But when your reason is stupid, doing so is asshole behavior. Not hungry? Fine. Not a fan of French toast? Fine. Don't feel like putting that much sugar into your body all at once at that moment? Fine. Going out to eat later and don't want to ruin your appetite? Fine. Thinking you'll get food poisoning for absolutely no reason? Not fine, and why you're TA.", "YTA. Chat a bit then say you need to finish getting ready before eating, return, and zap them in the microwave to “warm them back up.”\n\nIf you’re in the US the eggs are pasteurized.", "Yeah, that's kind of lame.\n\nYTA.", "Info: Did you let her eat the French toast? \n\nIf your reason for not eating it was the potential to get sick but let her eat it, YTA", "YTA", "I mean… at 10 years old I could cook an entire (simple) family meal. YTA.", "P", "Did you not want to eat it because of of the fact it was a 10 year old?\n\nI think ETA you shouldn't eat food if you don't want to for what ever reason but a 10 year old is able to be a good cook.", "YTA. Unless it was absolutely gross, you take a bite, smile, and gush if a child makes something - anything. They have enough time to be disappointed later in life.", "YTA because you allowed anyone, anywhere, to know your utterly specious reason for refusing. You’re allowed to refuse food any time, but if you feel a need to share a reason, choose a polite one. Say you’re not hungry or you don’t care for eggs or didn’t feel like eating something sweet, thank you. There’s no reason to fear food cooked by a child that age in a reasonably clean home. Your reason gave offense, and rightly so.", "Seriously, the risk here is the eggs, and they wouldn’t give you food poisoning. There’s a small chance uncooked eggs have salmonella, but it’s still rare, and it’s on the outside of French toast, so it’s the first part cooked. They could have taken one bite and known quickly if it was cooked or not.", "Don’t understand how this is top comment at all. When it’s an AITA about forcing a kid to eat something they’re refusing the adult is the AH. When it’s a kid trying to push food an adult doesn’t want they should be placated? Teach your kids to that no is a full sentence. OP could’ve had a million reasons or just not wanted to try it out of not liking french toast.", "I don’t think OP gives enough detail to indicate if there’s reason to believe anything was undercooked, but raw eggs can absolutely be a source of food poisoning.", "For eggs, you could even stick it in the microwave for a few seconds to be absolutely certain. \n\n(Source: I don’t like washing pans and frequently fry eggs in the microwave.)", "Honestly? 10 year olds aren’t known for great hygiene. They *are*  known for picking their noses, scratching their butts, touching who knows what…\n\nSure, OP could have made up some excuse to be polite.\n\nBut the truth is, it doesn’t matter what the reason is. If someone doesn’t want to eat something , you don’t pressure or force them. End of story. OP is not TA", "No one seen her make it", "I honestly did.", " All these parents talking about their amazing chef children. Yeah of course you eat your own child's cooking, you also kiss their germy hands and faces. It doesn't bother you because you all have the same germs from living together. Other people's kids are gross just like my kid is probably gross to someone else.", "THANK YOU! I was looking for anyone else to think about this! Kids can be so gross and so can people in general! The saying “you can’t eat at everyone’s house” exists for a reason and kids who drop stuff or put their hands everywhere is a really good reason. I wouldn’t eat anything a kid made unsupervised with their bare hands.", "You can get food poisoning from the eggs. And op said he has before. I agree with you.", "But their tender feelings!!! /s", "I love raw cookie dough. YUM!!!", "No one is required to eat your child’s cooking (and boogers and whatever else is in it).\n\nIt honestly doesn’t even matter why OP didn’t want to eat it. No means no.\n\nIf I were her parents, I would use this opportunity to teach her how to gracefully accept “no” and not force someone to eat something they don’t want to.\n\nI will concede OP could have made a more polite excuse, but 10 is a reasonable age to start understanding that things won’t always go how you want.", "Ten is too old to believe the “nom nom nom” pretend to eat it crap. Old enough to understand no is a full sentence and people don’t have to eat food they do not want.", "Why? It's a good lesson for a kid to learn that not everyone is going to do everything you say/want. He didn't want French Toast, he doesn't have to eat it. That's it.", "Yeah, and some kids have terrible hygiene. Or weird ideas about fun concoctions .  \n\nIt doesn’t matter, though. No means no. The parents were wrong to pressure OP and in doing so, demonstrated that it’s okay to push people’s boundaries instead of gracefully accepting when someone says no.", "When I was 10 I was getting recipes off food network from emeril lagasse’s cooking show. I would give the list to my mom, she would pick up the ingredients and I would cook unsupervised. Kids are a lot sharper than people think, and learning basic life skills is important.", "No. You are not required to eat anything you don’t want to. OP politely declined. That’s should have been the end of it.\n\nNo means no. This was a missed opportunity to teach the 10 year old this valuable lesson of how to be graceful when things don’t go how you want. And to respect other people’s bodily autonomy.\n\nIf anything, OP could have made up a more polite excuse to not eat it. But it’s ridiculous to say they’re an A for not eating it.", "My kids made you a booger salad. Indulge a kid. No one has gotten sick from it!", "There’s no “they can” and “they do” for all kids. They’re all different .\n\nNot that it matters. \n\nNo means no. You don’t force someone to eat something they don’t want to, whatever the reason is. Even if you think it’s stupid.", "Well why'd you bother typing this up and asking for input if you already knew the answer ahead of time?", "Have you ever eaten out, anywhere?", "She put food in it..she did what she was suppose to do on clean plates using clean pans, likely that her mother or father cleaned. No supervision doesn't mean the parents went to Mexico and she was left to fend for herself. There is almost zero risk of harm from this French toast. it's a very safe food choice for a 10 year old to make. Because, unless she started licking the bread she served you, put poop in it, you were going to be fine. Also,when I smell something I don't like, I still put a little in my mouth, nod,npushvit around my plate and throw it away. You honor their effort even if you won't want it.", "Your comment(s) violate [rule 3](https://www.reddit.com/r/AmItheAsshole/wiki/index#wiki_3._accept_your_judgement). Please review this rule, and be aware that further violations will result in you no longer being able to participate in your thread.\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You’re so right! You just forgot a few ingredients: boogers, toilet germs, butt hands, sneeze juices…\n\nNo means no. The reason doesn’t matter. This was a missed opportunity to teach a ten year old an important lesson about accepting “no” gracefully", "I do like eggs and I have been sick from eggs before.", "Oh good, another solipsistic parent who thinks their kid is the most special.\n\nI’m sure your 7 year old has perfect hygiene, too?\n\nEven if they do…it’s irrelevant. OP said no. Don’t you want to teach your kid that no means no? Or are you a do-as-i-say-not-as-i-do type of parent?\n\nFor your kid’s health and safety, set good examples of setting boundaries and bodily autonomy. No means no.", "Not everyone enjoys children’s cooking. It’s probably different when it’s your kid", "Well kids are known for always doing as as they’re told so I’m sure you’ve never inadvertently eaten their boogers or toilet germs!\n\nBottom line: no means no. I doubt any parent would teach their kid that no means yes. So why would you model that in front of them?\n\nThe reasoning is irrelevant. OP could have simply not felt like eating French toast. No. Means. No. Missed teaching opportunity.", "So we'll hand you something we say looks good and make you eat it, K?", "But, but.....FOOD POISONING!!!", "Well we all know kids always do things just how their parents taught them. They never take shortcuts or pick their noses or wipe their butts without washing their hands…\n\nRegardless, the reasoning is irrelevant. No means no. Even if OP simply wasn’t in the mood for French toast. Teach your kids to respect no.", "Lots of commenters here seem to know jack shit about food poisoning. Undercooked eggs and eating bacteria from a child CAN get you sick. Also OP has bodily autonomy just like everyone else. They have a right to not eat food from anyone for ANY reason.", "Ridiculous.", "That’s a huge leap.\n\nBut even if it were true, the parents are still the A. You don’t pressure or force someone to eat something they don’t want to eat. End of story.", "Some ten year olds can cook really well! And many of them don’t wash their hands after the bathroom! Or sneezing! Or picking their noses!\n\nKid could be a Michelin star chef. OP can still not want to eat it, and that should be respected. The reason is irrelevant. They could have simply not been in the mood for French toast. \n\nNo. Means. No.\n\nParents should be using these teaching opportunities to help kids learn to accept “no” with Grace. Not trying to force feed an adult", "Germs existing in food make you sick. Eating bacteria that’s been on children’s hands can cause food poisoning. This comment is dumb.", "What do you think food poisoning is?", "That’s BS. You’re allowed to say no for whatever reason you want. You don’t get to decide what’s a good reason for another person", "I don't believe p (or PEE) are ingredients in French toast, no", "I drank raw eggs, well, EGG....once. I do not recommend, but 1 raw egg won't kill you.", "I wouldn't worry about the ingredients I'd worry about hygiene.", "Salmonella IS food poisoning!", "Assuming it's not made with raw chicken, right? Lol", "Enjoying yourself?", "OP do you have this kind of fear often? This sounds really familiar to me as someone with a massive phobia of throwing up. It's possible you would benefit from therapy and/or learning more about anxiety and phobias and disordered eating.", "HOW do people not get this??? The possibility of food poisoning is irrelevant. No means no! End of story.", "I ate so much raw pancake batter last night when I made pancakes. I’d do the same right now if I had cookie dough.", "Most ten-year-olds can cook simple dishes and follow basic hygiene rules. You must be hanging with some seriously neglected children.", "I could very well be the asshole and not agree with the decision that i am the asshole lol", "With unsupervised 10 year olds making the food? No.", "After this comment I'm really glad I didn't eat it", "Right, but do you act like this every time someone makes you eggs? \nAnd do you eat eggs aunt aside up? Or only ever served over hard? \n\nBecause honestly, if this is an illogical fear (which i suspect- I'm guessing it's not logically consistent ) then i think self- identifying it as such determines the level of AHness", "Not really but my kid wanted to learn and I taught him. I want him to be a fully functioning adult when he is older. \n\nAnd there are many times I decline to eat his cooking. He understands and accepts the answer. \nAnd do you know why he accepts the answer becuase I tell him I appreciate his offer and it looks amazing but I'm just not hungry. And I tell him thank you for cooking it. \n\nHe is happy that he was acknowledged by his parent and he goes off to clean up and I will help him do so..\n\nThere are so many other ways to decline a child's food dish.", "If it was made by a family member and looked good and I knew the kitchen was cleaned.\n\nHe rejected it due to the age if the cook.\n\nSays he likes eggs, French toast etc.\n\nSo, yes...if I was at a family home and was handed food that looked nice... I would accept it", "Absolutely no means no—full stop, in any situation—hence my opening remark that OP doesn’t have to eat anything they don’t want to eat. However, the main reason OP gave for now wanting to eat the French toast is not having seen it made. We don’t see cooks or chefs make most meals unless in open concept restaurants. And we all know many adults do gross stuff as well. So by that reasoning OP eats nothing not made as they are watching by anyone?", "I don't want to be mean, Op. I mentioned eating disorder because I worried that you said \"food poisoning\" (very unlikely) when you actually meant \"too many calories\" ) definitely true). Denial is a powerful thing and I wondered if this might be the case.", "OP I’m going with NTA. Nobody should be pressured to eat something they don’t want, regardless of the reason. \n\nIt does seem though you’re mixing up food poisoning with children’s germs being spread through the food. You might want to make an edit to explain that you didn’t want the germs from the child in case they didn’t wash their hands (if that is what you meant). Many people seem hung up on the fact that you mentioned food poisoning, (contaminated bacteria in the food- not caused by the chef), which is highly unlikely with French toast.", "OP's reason was objectively stupid. Can a stupid reason be a good reason?", "I didn't even know I replied! 🤦‍♀️😂", "I did the math a while back cause I was drinking eggs to save time, if you drank 6 eggs everyday, it would take 60 years to come down with salmonella poisoning. So it’s pretty rare.", "i got salmonella once \n\nwasn't fun\n\ncook ur eggs", "My best friend and I used to do it all the time in the 70s. We’d copy her mother’s crazy diets sometimes and one involved blending a raw egg with Carnation Instant breakfast. I don’t recommend this but I never had any problems from it", "I'm a little surprised how focused on her age every else is. Some of the responses make me feel like I should have ate it for the sole fact that she is 10.", "*can* does not equal *do*\n\nYou must be in some serious denial about children. The kids I know have definitely been taught good hygiene. And yet I definitely see them violate the rules of good hygiene. I have also worked in schools and baby sat.\n\nYou think kids always follow rules and have good judgment, thanks for the lolllz", "You are, and you (CLEARLY) don't agree. \n\nYour lack of agreement doesn't make you not an asshole, in fact it makes you more the asshole", "So what is the issue? A possible dirty pan, possible cross contamination (from what, idk?), or simply the fact that the kid is 10? \n\nBecause dirty pans and cross contamination can happen anywhere…and I wouldn’t necessarily trust the judgement of every person preparing commercial food.", "Does this kid have behavior problems? None of what I mentioned would be a thing a normal 10cywar old would do. Most 10 year olds who want to cook are amazingly focused and know what to do. My daughter makes amazing eggs and cakes. Wouldn't let my 4 year old alone to do anything!", "This is the last response I'm going to make. First of all I didn't want it because I just didn't want it. Second of all the fact that she's 10 made me want it less. And finally when she begged me to eat it I wanted it even less than my two previous reasons. I guess I'm the asshole.", "Yes, there are many ways. One way is to politely decline, as OP did even if you personally don’t like their reasoning.\n\n But your vote suggests that OP is an A while the parents are not.\n\nThe parents were absolutely As for trying to force and pressure OP to eat the food. Sure, OP could have made up some other nice excuse. But OP wasn’t being mean. They literally had food poisoning from eggs in the past. I didn’t eat Thai food for months after a bad batch made me ralph like crazy.\n\nOP gave a perfectly reasonable reason and was polite. The parents and child were not.", "You’re entirely missing the point. The reason. Is. Irrelevant.\n\nAnd yeah adults do gross things but in restaurants there is oversight, checks, and a reputation at stake. It’s not a flawless system but at least you know the people in the kitchen are likely trained on food safety and are working in the presence of other adults who are also watching for problems.\n\nChildren are *known* for being poor hygiene germ machines. As well as “creative “ chefs (ie mixing up wacky concoctions. And for not having studied food safety. So personally, yes, I do eat in restaurants knowing there could be B an issue and no I would not want to eat from most 10 year olds.\n\nAlso, OP has gotten food poisoning from eggs before so no doubt they’re extra cautious.\n\nBut again, OP’s reason doesn’t matter. \n\nAnd yes, you are within your right to make any logical or illogical dining decision you want and it doesn’t make you an A. Unless you think all people with religious dietary restrictions are As.", "Lmao is this a joke?", "Salmonella is ON THE SHELL. If you clean your eggs with hot water you'll be fine. In Poland raw yolk is traditionally added to steak tartare (which is raw beef) and I never once had food poisoning from that.", "Me too. Nobody watched Rocky?", "If her mom had made the french toast would you have eaten it? \n\nDo you think ten year old kids can't cook just because they're ten? \n\nDid the FT look iffy?", "No. I wouldn't eat it either. You have no idea what gross stuff she touched before touching the food. It probably fell on the floor at least once.", "I feel like I can accept my judgment and still disagree with it.", "No, you aren't. Everyone is allowed to choose what they will eat and what they will not. A person can get very sick from improperly handled or undercooked eggs and if you've ever had food poisoning it sticks with you and is not something you care to repeat.\n\nI wouldn't eat things cooked by adults if I suspected they're not clean and kids are germ machines, not to mentioned less experienced and aware of food safety. NTA\n\nIf this was any other 'don't want to eat this food because reasons' post everyone would be on your side but because it's a kid people leave their common sense behind.", "You could have said \"no, it's not it\" instead of being offended, which was never my intention.\n\nBut take a look at what you wrote. French toast are notoriously calorie-heavy, but your worry (rationalization?) Is that it would give you food poisoning. That's what tipped me of.", "Eggshells are porous. If you clean your eggs with hot water, you will wash contaminants into the egg itself. This is *why* Americans are told to cook their eggs, and why British and most Europeans don't need to.", "If I declined and she persisted I eat it then definitely not.", "🤷", "That is the opposite if accepting a judgement. You clearly ARENT accepting it because you are constantly arguing with everyone who calls you an asshole for being mean to a 10 year old.", "Because she's TEN", "I literally just said where I'm from, but good to know you consider Poland to be America :D And no, you will \\*not\\* wash contaminants into the egg if the water is hot enough to \\*kill\\* the bacteria. Several seconds if you just rinse them with water above 80°C. Not long enough to coagulate the white, long enough to make sure no salmonella.", "I don't know why people can't take No for an answer.   It doesn't matter what the reason is.  You don't want to eat something that should be the end of it.  \n\nCoddling a kid isn't necessary.   If the parents are trying to show off that their kid can cook french toast, they need to find someone who is interested.  \n\nNTA", "If that's against the rules in here I apologize for breaking the rules.", "Because it's mean to not follow a 10 year old's every whim? OP didn't eat French toast the kid made, they didn't throw the dish on the ground, stomp on it, and call it trash. From what's been said, it sounds like OP politely declined. Whether the food poisoning concern is a big risk or not is not important. Just because a child is present does not make it so every adult must do whatever that child wants.", "And you thought she put old shrimp and rotten milk on the French toast? \n\nWhat kind of laughable phobia is that?", "Are people really this ignorant about food poisoning? Raw eggs? Cross contamination? Children’s poor hygiene?\n\njfc\n\nNot that it matters. OP said no. The reason is irrelevant.You don’t force our pressure people to eat something they don’t want to eat, no matter what the reason.", "Nta litte girl who don't take no for an answer is a serious problem just hope you were polite and encouraging like it looks good but I'm not hungry no thank you", "NTA. Kids are beyond gross. Who knows what else could’ve been in the french toast.", "NTA purely because everybody has the right to choose what they eat. As long as you're polite when refusing, NTA.", "NTA, I'm with you OP on this, not from the food poisoning point of you but basic hygiene doubt.\n\nIf parents tell you that they supervised completely the process and they can assure you that she watched her hands, didn't lick spoons in between or else then I'd consider trying a little bit.", "NTA because no one should force another person to eat anything they don't want. If it applies to evil step mothers forcing their cooking down step children's throats than it should apply to little girls cooking french toast. \n \nYou should keep your reasoning to yourself of course, because you don't want to hurt the girl's feelings when you can avoid it. A simple, thank you but I'm not hungry or I'm not feeling that particular food right now should always suffice for anyone. People should learn to accept a no. \n\nBut don't assume a 10 year old's cooking is bad enough to give you stomach poisoning just because they are young. People of any age can give you stomach poisoning. After working in a kitchen, you see some shit. Ignorance is bliss.", "nta. I don't eat a cheeto a 3 year old hands me either. if you feel icky about how your food was prepared it's really reasonable not to want to eat it. she's 10, she can learn to accept a \"no thank you\"", "NTA. Why couldn't literally anyone else eat it? You didn't say why you didn't want to eat it, you just said you didn't want to. That's enough.", "NTA. You shouldn’t be forced to eat anything just to appease someone. Just so long as you were polite I don’t see the issue. ‘Not really into French toast but thank you!’ is perfectly fine and not mean or disrespectful.", "INFO- who is this 10 year old to you? i’m alway iffy on food from new places bc idk what they clean like", "NAH. You shouldn't have to eat anything that you're uncomfortable with regardless of who makes it. Seriously, I'm not sure where to go with this. I won't eat anything my sister-in-law cooks unless I see her prepare every step. Why? I've seen her pet the dog and then turn around to the stove without washing her hands. A 10 year old cooking? That's a good age to begin to learn, but I'd at least want someone observing her while she cooked.", "ESH\n\nI get being nervous about what a young kid did with food.\n\nMy young cousin handed me a leaf and was telling me it would make my water yummy. I gave his mom a glance because I do not know what plant he gave me or if it is actually for normal consumption. She comes over and confirmed that her kids do know what they are growing and that it is in fact mint.\n\nThey shouldn’t guilt trip you, but it seems like you over reacted as well. You aren’t going to get food poisoning from French toast unless they literally didn’t cook it or used moldy ingredients.", "Y'all are out here thinking a 10 year old and a 6 year old have the same minds. \n\nYTA", "NTA you alone can control what you eat. Shaming you for not eating something is asinine. Your friends are stupid. Get new ones.", "A ten year old can easily make French toast without poisoning you.", "NTA. I’m going to get downvoted for this but you mention that no one has seen her make this. We don’t know if she washed her hands before cooking, etc.", "NTA- No means no.", "NTA - I wouldn’t be eating it, either.\nI think it’s more rude of the parents to try force you to eat it, to be honest.", "NTA you gave the kid an opportunity to learn to respect others choices. Refusing food for any reason is okay and you were totally polite about it", "Not the AH! NTA, @OP! First of all when you are a guest, you are required to be polite, not to drop your personal boundaries! You refused politely - you are not the AH! Also, children need to learn boundaries too. It is unhealthy for children to always have their way! What if you were a vegetarian and the child made you a stake? Is sending the right message to a child that you need to shut up and eat it, just because it is a child and therefore entitled? And weather or not you are a vegetarian or afraid of food poisoning does not really matter - you don't have to justify having your boundaries! I know i will get allot of hate for this comment, so - in advance - yes, I am a mother. And I think that the best thing for my kid is not making sure he always gets what he wants regardless, but to try and teach him values and how to be decent human being! Shame on them parents for giving you grief over this situations.", "NTA, I don't eat anything a 10 year old makes simply due to the fact that they don't have the same hygenic standards, which cannot be expected of them at that age. If there was adult supervision it would be different, but who is to say she didn't drop the toast on the floor and put it back on the plate?", "YTA\n\nEat a little, encourage her in learning to cook, give her the joy of success and move on.", "YTA.", "This depends completely on the child. I vividly remember that age. Some of my peers smelled liked old sweat and shit and had a nose filled with goop. I was (and still am) very hygienic at that age. I also learned cooking really early.  \n\n\nSo, clean and responsible kid: Yes, you're an asshole.  \nOr, disgusting and irresponsible kid: No, not an asshole at all.", "YTA.\n\nDude. It's a little girl making an incredible simple meal. Smile, 'mmmm', chew, swallow, repeat. It's gonna be fine", "Pro boxers drink three raw eggs every morning straight out of a damn glass... and you're worried about slightly undercooked french toast? \n\nSorry, but YTA. You should have at least taken a small bite and not be such an asshole.", "[deleted]", "YTA.\n\nYou were mean to a child over an irrational fear. Food poisoning from egg, milk, and bread? Some everyday spices? Unless the french toast in question was literally raw, no cooking whatsoever, then the worst you could experience is a piece of sub-par french toast.\n\nIf my nieces or nephews, literally any of them at any age, made something like that and wanted me to taste it, I'd eat the entire thing with a smile even if they'd spiced it so badly it secretly made me want to die. I'd then go back and be like \"Hey, that was good, but you know I make it this way!\" and give them a small lesson while \\*not being a dick to kids.\\*", "YTA. At 10 I was perfectly capable of cooking a meal. French toast is simple as. You were being ridiculous.", "As someone who makes (and eats) steak tartare and raw steak with sushi rice like four times a month - YTA. \n\nDo you also not sample cookie dough? Yikes.", "Some people are so ridiculous, food poisoning? Lol", "This!!! This is the comment, if she were making her versions of like beef tartare or clams or sushi or some sh*t…I would agree with you and wouldnt be apologetic at all. Yellowbunny is right, pretty hard to F up french toast to the extent you’re worried about and bunny also right about eggs! Ultimately, NTA and OP, work on being able to form better lies on the spot, whatever lie you told CLEARLY wasn’t good enough. Could have said there was a storm brewing in your belly and that you didn’t want urself or anyone to experience the fallout…don’t think they woulda pushed much after that type of comment and probably was better than whatever excuse you gave!", "You forgot the milk in your recipe 🤗", "The biggest problem with eating raw cookie dough is actually the uncooked flour.", "Hell no. NTA. Girl needs to learn how to take a no as an answer. She might be an amazing cook or she might not be, either way, you are not obligated to eat anything, doesn't matter their age. \n\nThere are people who I would never eat their cooking. I had a friend, late twenties, now mid thirties, who would pick his nose and eat it in front of everyone. Maybe he thought he was faster than our eyes could see or he was asserting dominance. Either way, I could never eat his food and he cooked often. \n\nIts not that I would not trust a 10 year olds cooking because they are young but because humans can be gross. It's ok with certain foods, but I would not touch french toast made by others unless I saw how they cooked it.", "I could cook many simple meals including French toast by the time I was 10. If the family of the girl was saying it was safe I am assuming this kid also regularly cooks.", "No means no.", "Saying no to something you’re uncomfortable with is mean now? OP didn’t tell the kid her reasoning, she just said no.", "No means no, even to children.", "*saw", "Exactly this - or just pop it into the microwave because you like it hot. Any risk is nuked out of it. \n\nYTA for not even humouring the child and pretending to try it.", "Yep. I am baffled by the overblown fears of food poisoning people online seem to have. \nFirstly there are many dishes that use raw egg. Tiramisu, whiskey sours, chocolate mousse, runny yolk eggs, steak tartare. Being prepared by a ten year old isn't going to amp up the salmonella risk, the egg is either contaminated or not.\n\nSaying that, I live in Europe and salmonella risk is very low. We don't need to keep our eggs in the fridge, and food poisoning is rare.", "They're also known for coughing freely whatever direction they want.", ">\tHonestly? 10 year olds aren’t known for great hygiene. They are  known for picking their noses, scratching their butts, touching who knows what…\n\nIf you’re afraid of this you should never eat out. Have you ever met a cook?\n\nEdit: https://www.newyorker.com/magazine/1999/04/19/dont-eat-before-reading-this\n\nIt’s a bit older and things have gotten better but read this hilarious piece by Anthony Bourdain.\n\nPeople should stop pretending that kitchens are sterile. They aren’t and it’s not necessary. People eat from food stalls and street food places, there’s wind, stuff gets blown on the food etc. It’s normal, don’t freak out over it.", "> OP could’ve had a million reasons or just not wanted to try it out of not liking french toast.\n\nBut the reason they stated was that they were afraid of food poisoning just because the girls 10.", "No isn't a full sentence, lol.", "People can be sooo gross! Kids of course, but I had a friend who would pick his nose in front of others and quickly eat it thinking that people don't notice? Or maybe he was showing his dominance. Either way, I did not eat at his house.\n\nEdit: he was about late twenties, now mid thirties.", "The biggest problem with eating raw cookie dough is actually the uncooked flour.", "Plus it is unhealthy in the long run to always make sure your child has their way. Children need to learn boundaries early, otherwise it is bad for the child and surrounding social environment.", "Basic life skills including: you don't get to push people around because you want to feel important.", "Username fits!", "It’s pretty normal to not want to eat food made by a child that isn’t your own (children are not hygienic)", "Most ten year olds have long since outgrown that. I taught ten year olds and they’re pretty fine on hygiene", "Any reason for not wanting to eat something is a valid reason", "That’s right. Would you like to try my freshly made French Onion Poup? Just taste it. TASTE IT", "We're focused on her age because you are using that as your main argument for not eating the food.", "Because her age seems to be why you didnt eat it lmao? You assumed it would give make you sick because it was made by a 10 yo didnt you?", "Growing up my grandmother made me ovaltine with a raw egg mixed in the blender many times.", "That’s not really how nutritional epidemiology works but I can see how you got there.", "When I was a lad I ate four dozen eggs every morning, to help me get large", "I have lived with grown ass adults who don't give a damn about hygiene when cooking, let alone children.", "Glad you’ve managed to come to the conclusion yourself despite all of your whining in your comments. 😊 \n\nIt’s fine to not want to eat the food because you didn’t want it in the moment. But, rejecting her food for her age and insistence is very petty considering you’re a freaking ADULT.\n\nWhat does her age have to do with anything? You’ve lived on this planet long enough to have a job, so you have to know what properly-cooked French toast LOOKS like. Her age literally doesn’t matter here.\n\nShe made something herself that she was PROUD of, and she wanted to share that with YOU. You decided -for whatever reason- that that was off-putting. But, you only made yourself look bad, so good job there at least👍", "I don't get how her age matters  as a ten yearvokdni could cook better than my boyfriend xan now at 34. But I get egg concerns are different in the USA. UOUR NTA for not wanting to eat something but to blow up like this, yeah it seems an AH reaction. The kids also an AH for not taking no for an answer.", "You could say the same for a lot of adults. Some people have awful hand hygiene.", "I come from Eastern Europe, too. Used to always wash the eggs. Used to drink raw eggs all the time. Once I got salmonella, since then, no raw eggs for me, thank you. That was more than 20 years ago and I still remember very vividly.\n\nSalmonella may be rare, but it is BAD.", "When I was a kid my great-aunt sometimes made me \"yema batida\"; that's an egg yolk beaten with sugar and vanilla, to be eaten with a spoon. I loved it.", "And now that I'm grown I eat five dozen eggs, so I'm roughly the size of a barge", "Are you roughly the size of a barge?", "[deleted]", "Gordon Ramsey has kids that age on a cooking competition, and they cook better than alot of adults", "now that's a good idea, I will try. I used to wash with tap water, around 40 C.", "Learn how to read, he didn't say Poland was America.", "Ever since I was a kid both my mom and grandma just rinsed the eggs with boiling or near-boiling water if they were to be used raw, so for me it was kinda weird people don't do that.", "Bro", "NTA so long as you were nice.  People don’t need to be forced to eat things they don’t want.", "Nope NTA in my book, I worked with 10 year olds at a local primary/elementary school and I’ve never come across a bunch so poor at basic hygiene in my life. If they made me food I wouldn’t touch it with a ten foot barge pole unless I could be absolutely certain they hadn’t picked their nose, scratched their ass or done otherwise unhygienic things while making it. Sorry her feelings got hurt but when it comes to food ‘No’ is a complete sentence regardless of who makes it", "NTA- I don’t really appreciate when I’m forced to do stupid shit for other peoples kids. But the food poisoning thing is a joke. Just tell them you don’t like it?", "It’s OP’s body. It doesn’t matter what OP’s reasoning for not wanting to eat the food is. No means no. OP is NTA. The adult family members are TA for not teaching their child no means no and for trying to guilt-trip someone to say yes to eating the toast.", "YTA", "YTA", "Why do Americans worry about raw egg so much? Do your chickens have more salmonella than the rest of the world? I love rumny eggs and here we put raw eggs in smoothies all the time (not to mention raw cookie dough/brownie /cupcake batter) Salmonella poisoning is very rare (and I used to work in labs testing for it) \n\nYTA op. You could have had a couple of bites. They were probably so excited to make it for you.", "YTA. Food poisoning doesn’t spring out of nowhere. If hands are clean and ingredients are not rotten, you’re not gonna get ill.", "YTA, you can take one bite. Wow, you're selfish.", "YTA the child is 10. I think someone would be with her while cooking to make sure it'll be safe to eat. At least that what I did when my kids were learn to cook.", "NTA. It doesn't even matter what your reasons were, if you don't want to eat something, no one can force you to. As long as you declined politely.", "NTA, I don't care how old you are. Learn to take no gracefully.", "NTA for refusing to eat food you don't want. But my lord, you're an idiot... food poisoning... from French toast???", "NTA. She 10. She should know what NO means.", "So once i ate a foreign tamal from an auntie and in the middle of eating it there was a pig ear inside, it sounds weird but not the asshole, you don't have to eat something you are not comfortable with .\nYou also don't know if she even washed her hands, you could be polite and say you are allergic to wheat or something to not hurt her feelings but just that. She can learn the meaning of \"no, i don't feel comfortable\"", "NTA.  People should not be pressured into eating anything they don't want to, No means No.  The little girl should learn this now instead of turning into the kind of adult who pressures and bullies people into eating her food against their will, of which there are far too many.  People need to accept that rejecting food you offer them does not mean they are rejecting you personally.", "NTA.", "NTA I don’t get ppl saying you should have sucked it up and ate it. You don’t have to eat anything you don’t want to. Teaching a child that sometimes people say no is a good thing, and a skill we want her to learn as well.", "NTA. You shouldn't eat anything you don't want to", "NTA. Kids are generally disgusting. They put their hands literally everywhere and I’m not very confident in their hand washing. Source: I’m a mother of four, a grandmother of two, and a teacher. Trust me, I’m an expert on how long it takes kids to adequately practice basic hygiene!", "Nta. As long as you weren't mean to her about her that's what matters. People need to learn to take no for an answer.", "[removed]", "YTA if my parents could suffer through the food I cooked growing up you can suffer French toast… especially if you eat mayo which is raw eggs..", "YTA.  She is ten, not two. At ten years old kids should know how to make basic stuff like eggs, pancakes, french toast, and other simple items. \nMy ten year old makes dinner once a week (under supervision).  \nThe best way to be a decent cook as an adult, is to start cooking as a kid.", "You take a bite and fake the rest! YTA. She worked hard on that.", "YTA. It’s toast with a bit of egg, which should be cooked in the pan. You overreacted", "YTA.", "NTA. You shouldn't be forced into eating something you don't feel like eating. Literally just a child who needs to take no for an answer every once in a while", "You were worried about food poisoning... from bread, eggs and a few spices? Yikes. YTA.", "Honestly NTA, I don't really blame you. When it comes to food, I'm more worried about getting sick from poor hygiene than from raw egg, and would probably refuse on that basis alone.\n\nYou can refuse to eat a child's nasty food without their family blowing up about it lol. It's not that big of a deal.", "YES", "YTA for assuming she cannot cook just because she is 10!! I was cooking and serving complex dinners on my own at that age. Yes, a 29 year old can read a cook book and grasp the basic concept of germ theory FFS.", "I mean, this is a little dramatic. I can safely say I've never gotten food poisoning from french toast. Though, I suppose I've never had a 10 y.o. cook for me, so theres still time. \n\nYta, in the spirit of things. You have a right to do whatever you want with your body, but I dont understand your reasoning for saying no. \n\nThis just seems silly, you're not going to have to miss work because you ate some bread and an egg. You're not in the wrong for saying no, though. If you dont want to eat something, then you dont have to.", "YTA. \n\n\nAnd frankly a little bit of a drama queen. My kid is 10 and makes some amazing French toast.  Seriously food poisoning???? So you naturally assume your friends place is filthy then?", "YTA. What's the worst that could happen? If it's under/overcook, then teach your daughter how it should be done.\n\nWhen I was a kid and I ask my mom to help her in the kitchen, she always tells me that I can help by not helping and to stay away from the kitchen. So I did not help. I only learned to cook on my own during college. Now that I cook, and when I cook for them during occasions, and she comes near me to help or to teach me something, I always ask her to get away from me because she didn't help me when I want to learn, now that I already know how to cook, all of a sudden she'll be interested in 'teaching' me?\n\nDon't be like that. If you can, make this a teaching moment.", "Lol I was making fry breakfasts and frying eggs at 8 years old. YTA - like you could have at least tried it. There's not much that can go wrong with French toast. I mean even raw egg isn't as dangerous as people make it out to be. Raw egg is in many many deserts and foods. But you'd notice soggy bread dipped in raw egg and not cooked. If it was on the pan for bit to make the bread brown you're at virtually no risk of food poisoning. Come on man make it up to her and apologise.", "YTA. I was cooking at 10. Tsk tsk tsk.", "YTA. You hurt a girl’s feelings over some BS excuse that may or may not happen.", "YTA for assuming that a 10yr old is an incompetent cook. NTA for refusing to eat the food.", "wait you said in a comment no one saw this kid make the food? like besides the hygiene issues she could have seriously hurt herself. what were her parents thinking????  \ni mean as long as you were polite about it NTA, no one should be forced to eat something they aren't comfortable with", "You're NAH because nobody should be forced to eat food but you are TA because of your logic. She's 10 so therefore she can't possibly know how to safely make food? I'm assuming you're in america because the only thing that could possibly give you food poisoning is the eggs, because of the way your country farms chickens and eggs, but like, anyone could cook anything wrong at any moment. The fact she's 10 doesn't mean anything. There's 10 year olds in other countries who have to make a whole day's worth of meals and they're not going around making everyone sick every day just cos they're 10.\n\nI know every child is different but unless she's given you any reason to think she's unhigenic and clueless, you had no real reason to believe it would make you sick. I'm going to assume you've never seen Junior Masterchef.", "Lol yta. My baby cousin is also 10 and has made straight pancakes with no assistance or interference and only supervision. I don't think they'll just let a child near an open flame or hot pots and pans if they didn't think she could do it. Also, on the other hand my 16 yo sister once made lemonade in a copper jar and almost killed my mom.", "YTA.   \n\n\nIt's just bread and egg. If the Egg is cooked properly the one think you are risking is that it won't taste good but that's pretty much it.", "Raise your hand if you eat some raw cookie dough you make, and are still alive and breathing ✋️", "Nah. Wrong. NTA.", "I’d be weird about it too - I’m around kids all day and I’ve seen where their hands go and how seldom they wash their hands. It’s not about the ingredients, it’s the probable lack of food safety.", ">YTA because you decided for yourself what food you put into your own body  \n\nIt's a strange opinion to hold, but according to the upvotes it's also a popular one. Can't wait to see the next post involving *anyone* forcing *anyone else* to eat something so we can see what the group thinks that time. Bonus points if the decision is based on religious or medical dietary restrictions.  \n\nPeople are entitled to bodily autonomy and its worrying that you believe there should be limits on that concept (as demonstrated by voting YTA to someone exercising bodily autonomy)", "Each time I’ve had Eggy Bread (which is like the more savoury version), I’ve had horrible episodes of vomiting. I don’t blame OP. \n\nThat might just be me but it’s not a pleasant experience.", "Do you not eat at restaurants then? Because you can't see them prepare the meals, either.  And don't say regulations.  We know not everyone follows regulations. 😂", "It's not the food, it's the fact that 10 year olds regularly go from using the bathroom to picking their nose to cooking you food with no washing of hands in between. I wouldn't take a regular cookie from a kid's hands, let alone something they cooked without supervision. I don't even trust most adults with that shit.", "I agree with all of your reasoning but not your judgment.\n\nNo matter what the food is or who made it, if you don’t want it you can say no.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "i mean you really shouldn't eat raw cookie dough, not because of the eggs tho(...mostly). raw flour carries E. coli", "Why couldn't the parents have submitted themselves to that challenge? Seriously, god knows if the ten year old knows the bare minimum about hygiene.", "Well the replies to the eggs are all over the place so maybe OP might not have been aware.\n\n\nI mean you probably don't know squat about ligma.", "OP says it isn't the kid pushing it but her parents. Who presumably know whether she is capable of preparing food safely.\n\nBy 10, my daughter knew to wash hands with soap and hot water, not cough into her hand, not continue cooking after coughing without rewashing, not touch her face or hair while cooking (something many adults do, yuck) and was perfectly capable of preparing a meal like french toast.\n\nYTA.", "A bit illogical, to blame just 10 year olds. Nearly half of all adults don't always wash their hands after using the toilet (and about a fifth never do). You actually touching whatever they touch throughout the day constantly - whether you also happen to eat a 10-year-old's cooking or not. And only 20% of adults even wash their hands before preparing food. Even though surveys find 90%-ish of adults pick their noses, etc. Yet you'd generally eat an adult's cooking, despite most adults not following perfect hygiene. \n\nSo it's really not an age thing - or even a food thing. It's a human thing, and it's illogical to assume a child's cooking is automatically less hygienic. As a 10-year-old, I was fastidious in hygiene/washing hands - because I had an anxious mother who drilled it into me. \n\nIn addition, if the food is hot enough, chances are many germs are dead. Unless the kid was picking her nose, then sticking her fingers right into that hot egg after cooking it - chances are that it's OK. But it sounds like this particular kid takes pride in her newfound cooking skills, so let's hope she's still interested in the hygiene rules.", "Fun fact, when you get sick from eating raw cookie dough it is often the raw FLOUR that upsets your gastrointestinal system! Nuke your flour in the microwave first if you're planning on nibbling while baking. (Or goblin eating a whole batch of dough.)", "I agree NTA for refusing.\n\nBut I also agree with the majority that fearing food just because of the age of the person preparing it is kind of absurd. Plenty of people raise their kids knowing basic food hygiene and how to cook simple recipes. And plenty of adults are shit at both.", "I forget the in other countries chickens aren’t vaccinated. In the UK salmonella risk is so low and non existent with eggs because of chicken vaccines .", "What is with this dumb comparison? Ten year olds aren’t running restaurants", "Is there a reason you think this? I’ve taught ten year olds and they are more than old enough to understand basic hand hygiene.", "This is the most laughable comment I’ve ever read. Diagnosing someone with an eating disorder because they refuse to eat food that a literal CHILD made", "Chickens are vaccinated in Europe, but often not in the US- so that’s a huge factor. And they are also washed here before being sold, which removes the protective cuticle. Also in the US, because they are refrigerated at the store, you’re supposed to *keep them* refrigerated before use because going from cold to room temp *causes condensation on the egg* which can lead to contamination. Basically we do eggs wrong here because “eww! Bird poop!”", "We used to put them in milkshakes when I was growing up.", "In a technical sense it’s actually not, it’s an infection that comes from eating food. Food poisoning, though sometimes colloquially understood to mean “getting sick from food,” technically refers to getting sick from eating toxins in food produced by bacteria such as Staph aureus. If staph has been in your food making the toxin and then you cook it, the bacteria will die but the toxin remains and makes you sick.", "I have, I work in a restaurant in a hotel.\n\nCooks wash their hands, and when they need to cough, they do it on their arm.\n\nI guess you must have worked in a shitty place, or simply never worked in a restaurant and made the whole thing up.\n\nEven better, with covid other colleagues are also very paranoid now.", "......have you ever met a cook? i work in the industry and i don't think i have ever seen a chef scratch their ass and go back to cooking before", "I have, they're clean. If the cooks you know are filthy, that's a skill issue, not an universal thing.", "She said she wouldn't eat it because she couldn't watch them prepare it.  So.... yeah. Her dumb logic caused the dumb comparison. Sorry you couldn't just see that.", "There is a reason and they are called 'brothers'. Also, my nephews didn't help either. I babysat them sometimes.", "And adults never make mistakes, or what?", "You put her age in the title and as a reason. How can you be suprised?", "Don't \"well *akshually,*\" food poisoning in layman means got sick from food.\n\nOP is NTA. The reasoning may be a little weird, but you don't have to eat anything you don't want to.", ">\tI guess you must have worked in a shitty place, or simply never worked in a restaurant and made the whole thing up.\n\nNeither. But as you say: There are places with high standards and there are others. Not always can you see it from the outside.\n\nSo yes, if you’re so worried about this that you can’t eat a french toast made by a ten year old you probably shouldn’t be eating out.", "10 year olds don’t come with food hygiene ratings", "Lol it’s a child so that’s a totally understandable concern. They’re not trained in food safety", "You need to use the eggs straight away (after washing) then as washing them damages the membrane and they can be more easily decontaminated", "Oh maybe world is black and white like you are claiming to be?\n\nFollowing your logic, if I don't like apples I should not be liking any other fruit either.", "American eggs are pasteurized so that’s not true. It’s a General recommendation out of food safety…", "No one shoots like Gaston", "And?", "Nope just eat it themselves and thank their kid. I agree  nta.", "This has nothing to do with manners. I never eat something that I don't want to. I just say no thank you and life goes on.", "You never said you were from Poland. He never said you were from America.", "**CAUTION: Not all American eggs are pasteurized.**\n\nhttps://www.fda.gov/food/buy-store-serve-safe-food/what-you-need-know-about-egg-safety", "Makes those beauts like Gaston", "It is strongly implied that the comment is from Poland. Don't play the semantics game dude", "I also didn’t assume the person was from Poland just because they mentioned a Polish custom. I don’t think that’s unreasonable.", "NTA\n\n1: she could've not washed her hands before touching the bread.\n\n2: she could've picked in her nose since 10-year-olds do it a lot\n\n3: she could've done something with the food\n\n4: she could've put an unedible ingredient in the food without anyone knowing\n\n5: if you didn't see her making it, don't eat it. Cause how do you know she didn't mess something up with it?\n\n6: no one can pressure/force me to eat something when I don't wanna eat it.\n\nBut if you genuinely know the girl and if you know she has good hygiene than I guess you could eat it.", "I don't get all the Y T A votes. As long as OP was polite,  no means no for whatever reason. The 10 yo didn't seem offended. Why were mom and dad being pushy? NTA.", "NTA, and for me age has little to do with it. You’re not obliged to eat food just because it is offered.", "NTA\n\nAs a father of an 11 year old boy, I'd eat the stuff he makes because he's my boy, but I've witnessed him do gross things so I wouldn't eat something made by someone else's kids which I didn't witness being cooked \n \n\nJust this morning I'm pretty sure he sneezed in the porridge I'd asked him to stir \n\nI'm also grossed out about this with adults too so when someone brings something they've baked into work, I'd still politely refuse. I ain't seen your kitchen or your hygiene standards so no thanks", "NTA. Eat what you want, don't eat what you dont want. Its a simple rule.", "NTA. No one should be guilt tripped into eating something they are  not comfortable with, not even to appease a child. \n\nThe parents should be helping their child understand why and how to deal with disappointment instead of teaching how to get their way through bullying.", "Needs more info:\n\n- was the food visibly uncooked or off?\n- did you have reason to think the kid lacked basic cooking skills? Did they say she/he was just learning?\n- is this a very unhygienic family who keep an unclean cooking space or who wouldn’t teach their child hand hygiene?", "What made you worried about food poisoning?  If you didn’t want to it you just do no thank you. And repeat as necessary. \n\nNow 10 year old can cook. Sometimes better than some adults. If the place was a mess that is different matter. But you never said that.", "NTA. I have an 11yo and have hung out with lots of families with kids, and teaching them to respect your decisions/choices is a big deal. (Full disclosure - my kid has only recently stopped pushing me to try/eat stuff, even when I say no, so at some point it becomes a power play thing I think, at least with her.) I probably would have taken a bite to taste it but not eaten a whole plate; the idea of undercooked eggs has always skeeved me out, and soggy French toast sounds super gross!", "Y’all just putting me off eggs in here", "NTA.\n\n\"I have responsibilities that I can't do if I get sick, so I don't eat anything I can't be sure of...\"", "NTA. I would also be uncomfortable with this. Not for the fact they may not cook well but because I find younger people quite unhygienic and no one should ever force you to eat anything you don’t want to eat, whatever the reason", "nta in the slightest.  You politely declined.  I don't eat anything I don't want to.  If children can decline food for any reason, so can adults.  Not everyone likes french toast.", "NTA\n\nI don't get the Y T A honestly. Your reasoning for not wanting the food doesn't really matter and her age definitely doesn't. You're allowed to decide when and what to eat and the one offering should be ok with as long as you're polite when declining.", "I feel the need to jump in here with an NTA… are your reasons perhaps a bit overly cautious? Perhaps. Does it matter AT ALL? Absolutely not. “No thank you” is something every child on the planet should learn to hear so they can become functional members of society as adults.", "NTA. I don't blame you. I probably wouldn't have either.", "NTA - you're allowed to set your own boundaries and you're not obligated to take any risk at all to indulge a child, especially one that's not your own.\n\nYou're not obligated socially to do more than say, \"No thank you, but that was sweet of you to offer\" or words to that effect.\n\nYou didn't give your reasons, but the family there should have respected a simple \"no\" - you could be scheduled for a team meeting at work where food would be served (former IT dude - happens more than you think - gotta get the nerds up and awake and thinking to solve problems) or starting a low-carb regimen or have a fasting lab you have to get done that day at lunch or any number of legitimate and none-of-their-business reasons.", "I’m gonna say NTA bc children are generally unhygienic. 10 is old enough to cook I’ve been cooking my own meals since I was 7 but I personally wouldn’t eat anything a child made.", "YTA , it’s like when a baby hands you their toy phone you answer the phone", "YTA  \nFrench toast is an incredibly easy food to make and you're unlikely to get food poisoning from it. Also, you told the kid that you do not like or value her efforts by refusing. You were mean and unkind. A slice or even half a slice would not have hurt you and would have generated a ton of goodwill with your hosts. Again. YTA.", "YTA - partially because you're worried about getting food poisoning from French toast but even more so for your automatic assumption that a 10 year old automatically can't cook anything.  There are lots of kids who are being taught to cook from a young age - I have friends who get full dinners cooked by their 10 year old every once in a while.", "YTA. Chances of food poisoning are so slim with that. Do you walk around outside worried of a coconut falling on your head and dying? Probs more likely. Probs also more chance that last scratch you had would end up gangrenous.\n\nIts simply ridiculous", "Soft YTA. It's soft because technically no one *has* to eat anything.\n\nIt would have been easy to tell from looking at the meal if the eggs (the only thing in it that could get you sick) weren't cooked. You refused on some weird principle that's not based in reality.\n\nYou could have said you weren't hungry, or you'd already eaten, or you had plans to eat with someone else, or asked for some for the road and then tossed it. Unclear from the post what you did say, so can't say for sure whether the way you did so was an AH move or not.", "YTA. French toast has so little egg and it’s easy to tell if it’s cooked. If it’s cooked you’ll be fine. Plenty of kids even at 10 cook regularly without issues.", "YTA. she’s 10. and can cook. You’re not gonna get food poisoning **” i kind of feel like the asshole-“** BECAUSE YOU ARE!!!!!!\n\nit’s not the fact that you turned it down, it’s the fact you’re acting like it could’ve been a meal that could’ve killed you. \n\nyou’re a grown adult. i’m sure she wasn’t unsupervised while cooking, & even then.", "YTA", "Dude I started cooking at 7. Breakfast was the first thing I learned. YTA", "you ever seen masterchef junior? YTA.", "YTA\n\nWhoever this child is, she's just learning how to be independent.", "Info: were you asked if you wanted french toast? Are you sure the adults didnt supervise? \n\nYou seem really quite paranoid about food poisoning  but I dont *like* french toast and also would have said no. You can say no for whatever reason. Theres no reason you should be guilted into eating it. \n\nIf, however, you said yes to french toast until you knew who made it then thats pretty harsh. You still dont have to eat it but you should make up a plausible excuse as to why you've changed your mind. 10 year olds aren't so daft they wont clock that its specifically because of them.", "Im not getting all the YTA.... eating egg if not cooked its very risky... also kids must learn to respect if you say no to them......... NTA", "INFO: have you gotten food poisoning from this family before? Was the french toast obviously undercooked? It's eggs, yes, but you should be able to see if it's runny or not. Did you observe any questionable kitchen techniques? \n\nIn other words, what exactly was your reasoning for thinking that her cooking was going to poison you?", " Yta. you could have taken half a bite and spit it out when the child was not looking. The parents handled this badly as well though. \n\nI was once fed what I was told was pancakes but it had pieces of meat and an abnormal amount of half-cooked potatoes. downside: it tasted weird and my throat definitely tried to punch my mouth a few times. upside: i got ice cream for eating two \"pancakes\".", "NTA no means no and you don’t have to eat anything you don’t want to", "what are you going to get food poisoning from in french toast lol", "NTA, you don’t have to eat anything you don’t want to", "NTA I'm baffled by people telling a person they have to eat something they don't want to.", "My husband was a picky eater and refused to eat what his two kids tried to make for him. Neither cook much now as adults and neither have quite forgiven him although he’s been passed away for years now. YTA", "NTA.", "NTA\n\nI have a 9yo who likes to cook with me, and if she offered someone something and they said no thank you, that would be the end because even if she tried to persist (which she likely would) I would step in to repeat \"OP said no thank you.\" and then it would be between me and her excusing you to move on.\n\nReasons don't really matter. No means no but I get your reasons, kids aren't known for having the best awareness of cleanliness. I really stress the importance of handwashing and really prioritize awareness of cross contamination but I still have to remind her when to wash hands, it's definitely not something she does in her own. If she just went into the kitchen and started cooking on her own (she is not allowed, but if she did) I would for sure question if she washed her hands, or cleaned the counter....and if someone said no thank you to her food because of those questions I would reiterate to her how important those things are and that it's okay if someone isn't confident in her awareness of those things (because she is not, unless I am reminding her)....although to be fair I more reluctant to eat food my husband cooks for those reasons then food my daughter cooked (only because I supervise my daughter.) fotbhese reasons lol. I don't trust that he considers cross contamination when cooking anything.", "NTA- nothing wrong with not wanting to put something in your body you don't want.  Plus, kids are gross, who knows if she even washed her hands. Regardless, you don't have to humor her, she can learn that no means no and she can't always get what she wants.", "My 10 year old made the full thanksgiving and Christmas spread. She asked and i agreed. All i did was shop for her list and clean up after. 10 year olds can be capable and quite good cooks. Yta\nEdit: spelling", "NTA\n\nBut not for the irrational anxiety of food poisoning. But because no one should be forced to eat. When u don't want to eat because u just don't like the dish, are already full, aren't hungry rn, or the food looks somehow suspicious (smells strange, is burnt or not thoroughly cooked, whatever) all valid.\nIts your reason that is ridiculous in my opinion.\n\nYou rather get food poisoning in a restaurant than from simple food from a 10yo.\n\nBut again NTA because u aren't obliged and never should be forced to eat, no means no.", "No one but my parents has ever successfully made me eat something I didn't want to.\n\nNTA, but knowing what french toast is, you should have been able to determine how cooked it was just by cutting into the french toast.  And if it wasn't cooked, say so. Or ask how they cooked it and if they can't tell you, use that as an excuse. It sounds far worse that you just flat refused.", "ESH… you shouldn’t have been pressured into eating something you don’t like, but it’s French toast… I don’t think you’ll get food poisoning from that.\n\nEdited to change judgement after reading some of OP’s comments", "NTA. It might be an unpopular opinion but no is a whole answer and you don't have to do anything for anyone if you aren't comfortable, it literally doesn't matter the reason. Everyone calling YTA are saying that it's okay to teach this little girl that someone will be forced to do something for her because it was a nice gesture. Yikes", "NTA, as long as you were polite and kind about it and did not in fact say you were worried about food poisoning.", "NTA children are gross and germ covered. We don't know how hygienic they were especially since no one even watched her make them.", "Its TOAST. You could eat it raw and still not get food poisoning", "Yta", "NTA", "YTA dude! bwahahah get a grip! or get help or something. even when you eat at the restaurant do you ever wonder if the cook washed their hands after going to the bathroom? or bled on your oysters? or sneezed in your salad? do you ever wonder in what condition your pipes are when you use your tap water? do you ever wonder if there were mice pooping in the ice cream factory where your chocolate chip ice cream is made? 🤣🤣🤣", "YTA - it’s French Toast, one of the first things children learn to make. It won’t kill you to try it.", "Dang. Wake up on the wrong side of the bed this morning? Calm down dude.", "NTA!!! \n\nI don’t know why the YTA’s are so zeroed in on the food poinsoning comment because that’s not the point. It doesn’t matter if OP could get food poisoning or not, and therefore that doesn’t affect whether or not OP is an AH. The question is whether OP is an asshole for refusing food. Period. Do we ignore the concept of bodily autonomy because it’s a child cooking? No.", "NTA I don't trust the cooking of most adults tbh lol", "YTA and a coward.\n\nSalmonella is only present on the outside of eggs. If the eggs were bought from a store there is a minuscule chance of it being present. Then if they were cooked through even that minuscule chance is gone. Do you use a food thermometer when you cook eggs? Get over yourself.", "YTA. My 10 year old could make big meals too.", "NTA. I would not eat food a booger picker prepared. Period.", "NTA.\n\nMy husband got hella food poisoning from french toast. He didn’t touch french toast again for over a decade. Don’t fuck around with french toast.\n\nBased on your comments you were also polite about your declining to eat it, and she was being rude about everyone having to eat.", "NTA. I’ve seen kids that age sneeze on the food and just serve it. Or drop it on the floor and put it back on the plate. I wouldn’t eat it either.", "NTA you don't have to put anything in your body that you don't want to\n\nAnyone here saying anything else is absolutely fucked in the head", "NTA. Child or not, if you think it’s going to make you sick, don’t risk it. The kid will learn not everyone wants to eat what they cooked.", "Info needed. Had the kid made this before? What did she put in it? Did anyone watch? Is the kid a decent cook generally or was this the first attempt?\n\nAt 10 I was making lasagna... So need some context to decide.", "NTA for not eating food that was offered you because people should always have control over what goes in their body, but you are being abnormally irrational about the food poisoning thing.", "Yta, my kid has been cooking with help since 8. Id be over the moon if he made me french toast.", "NTA. But next time, just say you are allergic. Easier out.", "NTA for refusing but your excuse doesnt make sense", "Depends on where you’re from but here in the uk salmonella is very unlikely. Either way you could have taken a bite, even if it was undercooked you wouldn’t have gotten sick from it. YTA.", "It's French toast not chicken. You over reacted and I fee l like there's more did you watch her cook it? Was there a reason behind your refusal or was it just she's 10 you don't think she's capable? Because at 10 I was cooking eggs and things for myself", "Eating non cooked egg its like the #1 food risk....... ??", "I mean I agree that her fear of food poisoning is ridiculous but should OP really have to eat something OP doesn’t want to in general? I disagree that OP is TA for simply not eating the food. Sure, OP should have known better etiquette while staying at someone’s house and if it looked gross I would have just “pretended” I ate it the best I could but I don’t think it makes OP an AH just for saying no. The 10 year old needs to know boundaries at some point. I don’t eat everything my 11 year old tries to feed me either. \n\nAgain though the food poisoning fear is a bit crazy but I do get not wanting to eat something a child made. More valid then food poisoning is when did the kid last wash their hands… 😂\n\nNTA but your reasoning made you sound a bit nutty.", "NTA OP is an adult and doesn't have to be force fed food for whatever reason.  As long as they aren't making stank faces, The 10 year old needs to learn how to accept \"no thank you\" as a response.", "The YTAs are about his reasoning. If he had just said \"no thank you, I'm not hungry right now\" that would have been the end of it and he wouldn't be the AH. He becomes the AH when he decides that because she is 10 he will get food poisoning from it, with absolutely nothing else to base it on. And then to say that part out loud just doubles down on being the AH. Even if he genuinely is afraid of being poisoned by toast, it's rude to say as much to a 10yr old child who made you something. Not assholes would simply say \"no thank you\" and leave it at that.", "I had to refuse food at a holiday work potluck because my coworker's kids WITH THE FLU helped her assemble some uncooked fruit based items. Hell no.", "I can’t believe I had to scroll this far to find this comment; it’s not just about food safety (the eggs), it’s about hygiene (the kid). Every time I’ve ever caught a stomach virus (norovirus, etc.) it’s been from a kid who has been at school, daycare, etc. and then not washed their hands properly. \n\nI wouldn’t eat anything from a child unless I’d watched them prepare it; of course the parents don’t understand this, they also cuddle their sick kids and are used to being in the same circle of filth with their family. \n\nBeyond any of that, no means no. The child is 10, she should be able to handle someone having autonomy over not wanting to eat something and saying no politely. Having boundaries is not being mean. No means no. \n\nNTA, OP.", "This 100%. The last thing you want to reinforce with a young girl is the idea that people can't say no because it's rude.", "OP says in a comment they politely declined.\n\nTbh, I’m getting some serious entitlement from the Y-T-A votes.", "Have you seen childrens' hygiene? No thanks unless I watched them clean their hands, everything they use to cook with, and watched them make it.", ">My 5-year-old can cook french toast in a way that is reasonably safe without supervision.\n\nFor household members sure, for others, not so much. I would refuse any meal made by *your* kid.", "This. I remember the lack of hygiene from my peers and siblings at 10, and I’m relearning exactly how bad it was again now that I have my own child.", "You sound like an idiot sandwich :)", "The bread is soaked in the egg mixture,  it isn't just on the outside of the bread. \n\nIf someone doesn't want to risk undercooked eggs by a child who probably doesn't follow good food safety habits, I cant really blame them. A person's health and bodily autonomy  (that includes what they eat) is more important than appeasing a 10 year old. \n\nPeople shouldn't be guilt tripped into something they aren't comfortable with.", "I've gotten sick off eggs more than once, to the point that I stopped eating them whenever possible.  I wouldn't touch the french toast a 10 year old made for millions", "Um, no. 10 year olds aren’t toddlers.", "It's not YTA for exercising bodily autonomy by not eating it. It's YTA for stating a silly and hysterical reason for not eating it. There's a difference. Not eating something for any reason including being put off the idea because a kid (or just another person) made it or just for the simple reason of I don't feel like it is reasonable. \"I am so afraid of getting food poisoning and missing work\" when talking about french toast is irrational silliness.", "That made me chuckle 😃 \n\nThanks for that", "Fuck off with this nonsense and learn about statitstics. There are 8 billion of us, some people will FOR SURE get sick from eating raw eggs. Statistical fact. Your comment is woefully ignorant.", "…still…*for now.*", "Thank you for such a well thought out rebuttal", "You do realize that the judgement of AH or not is for the op and but other commenters, yes? \n\nWell, maybe you don't", "He did say no thank you and his family continued to pressure him into eating it.", "You can also get food poisoning from poor hygiene, which is quite common among young kids. I wouldn't have touched that french toast, either. NTA.", "Exactly, they dont have a proper 'adult mind' to keep all the kitchen rules straight.", "Plenty of children have perfectly fine hyigene. She's 10, not 5.", "You can say no without invalidating someone, or, you know, the future of your society.", "\"I don't want to eat it\" is a perfectly valid, non-TA response. If OP had stopped there, different judgement.\n\nThe reason given, though, is TA. Let's just invalidate populations, no?", "Saying no is fine. Saying no just because she’s 10 and may get food poisoning is what makes her an AH. I’ve witnessed adults pick their noses. Saying no thank you is perfectly acceptable and leave it that… but vocalizing reasoning can make a person an AH.", "You take a risk every time you eat something with raw eggs. You think it's no big deal until it does happen to you or someone you know. \n\n\n The desserts can be made with pasteurized eggs instead of raw eggs, and some use gelatin instead of raw eggs as well. I make french silk pie by pasteurizing the eggs first because I'm not willing to risk anyone's health. \n\nAs for 10 year olds, they typically aren't very good about keeping their hands clean and following other food safety protocols. It's not even just about the eggs; kids are careless.  I wouldn't eat something a 10 year old made either unless I supervised the whole time.", "The only raw egg I ever ate was a Cadbury Crème Egg. 🤣🤣🤣", "One raw egg could indeed kill you.", "You have poor expectations of 10 year olds. They might want to put sprinkles on their cereal, but they should know how to be hygienic.", "Right, cus there are a half dozen hand sinks in this 10yo’s kitchen", "And? If I don't want to eat it I'm not eating it. End of story. No one is telling OP to throw the plate against the wall and call the kid a turnip. Just say \"that looks great but I just ate!\"", "And thats a completely valid reason. Food prep for others requires a mind older than 10", "That your child can do it doesnt mean every child can do it 😭", "He didn't *just* say no thank you. He said \"no, I don't want to get food poisoning and miss work.\"", "In the US it's not just chickens not being vaccinated, it's also that we wash our eggs.\n\nWashing eggs removes the cuticle. Once the cuticle is gone bacteria can get into the egg due to the shell being porous. So raw eggs can be a hazard just because of all the potential bacteria and not just salmonella.\n\nSalmonella is still a risk, but removing the cuticle just adds extra risk.", "Yeah that was my reaction but then I remembered we don’t have to refrigerate eggs in the U.K. (unless I’ve done the freshness test, but I use those immediately).", "I dont trust non-household member kid cooks, period. They are literally not mature enough to prepare food to non-household members on their own.", "Yeah an a lot of them have terrible hygiene.  OP is not an asshole for declining to eat what a child made out of legit food safety concerns", "Two wrongs don't make a right.", "Oh don’t worry you are the AH! \n\nWhat horrible thing did you do to that girl and/or her family to make you think she was going to poison you. Also why do you stay with people you can not trust to wash a basic dish. Such and AH!!!!", "How did you hurt this child? I can see no other reason to be such an AH if you did not purposely hurt her in the past and now your scared of her actions! \n\nKids all over the world cook much younger than this girl. Did your guardians not teach you to be responsible and learn to cook because as a child that is when you should be taught.", "In Ireland they're not vaccinated but they are very strict about culling birds and recalling products if salmonella is discovered so it's extremely rare. Campylobacter is the most common food poisoning here and it's almost always due to raw chicken being mishandled.\n\nYes I've read that about the egg washing, seems very silly indeed!", "If a ten year old was cooking something with chicken I'd be more concerned because there's probably the highest risk from them handling raw chicken. \n\nYou take a bigger risk eating bagged lettuce or prepared fruit salad than you would eating home made dessert with raw egg.", "Not really how probability works. What that actually means is that you would get salmonella once in 60 years, but you’d be just as likely to get it in year 1 as you would in year 60.", "Well then op should feel fortunate that he didn't ingest this fatal concoction of cinnamon, bread and super deadly egg", "That's a really interesting distinction I wasn't aware of, so thank you for the info!", "You don't even need a reason for not wanting to eat something. But that doesn't mean there can't be reasons for it that are silly/illogical/invalid. OP shouldn't have been judged or pressured for just not wanting to eat it. But if you choose to give a ridiculous reason people will judge that accordingly. People are saying YTA because of the hysterical reasoning of \" I am so afraid of getting food poisoning and missing work\" (which doesn't appear to be a general fear about food that OP has, but something she believes to be a reasonable way of viewing french toast cooked by a 10 year old as if it's a highly risky and dangerous thing), not just for not feeling like eating it.", "What do you mean my experience is not universal??? How dare", "You've never been on TikTok or worked in the food industry, have you? Kitchens are hot, sweaty places. If you think you've eaten out and not ingested some form of human byproduct (sweat, mucous, etc.) you're not informed. And that's if the preparer has good intentions. The comparison here is disingenuine.", "I use raw eggs in my mouse au chocolate and so far no issues. Simply use fresh eggs and if you are super scared get them from a reputable place.\n\nLocation: Switzerland.", "I love steak tartare but we call it beef tartare in Austria.", "Problem is that in America we pasteurize our eggs, so the protective coating naturally on an egg is gone. Washing our eggs basically does nothing because the bacteria would already be inside the egg by the time it gets to us.", "*I am not an expert by any means*\n\nI read at one point that the difference between North American and European eggs is that European egg-laying flocks are vaccinated against salmonella, while NA chickens are not. So the risk of getting salmonella in your eggs is much higher in North American commercial eggs.", "You don’t think a 10 year old May accidentally leave some small shell pieces in there?\n\nShe is 10, mistakes happen.", "Movies aren't exactly a good representation of food safety.", "You just said what I said, but dumber. 👏🏽 \nMy wording conveys the probability better than your crappy explanation.", "I’m making a point of its rarity for perspective. Not that it would actually take 60 years. Do I have to spell out every little detail?", "Super deadly COOKED egg.", "Its French toast. The egg is on the outside. The only issue would be if it was just simply not cooked at all. People don’t have to eat anything they don’t want but the given reason doesn’t really apply YTA OP", "Those 2 are not comparable lol", "It's mostly fine and most egg laying chickens in Europe are vaccinated against salmonella nowadays (I'm in the UK and all the lion stamped eggs are vaccinated, I'm sure there's something really similar in Switzerland) but some aren't, there's always some risk. The risk for healthy adults is really small, just vomiting and then you'll be ok. But food poisoning risk for elderly or children or pregnant women is much more significant, so for them it's not a good idea to have raw egg.", "You can not really get fresh eggs in stores here due to commercial egg farming even if they say fresh it is a lie. In America, the normal egg you bought at a store was almost immediately stripped and watched of it outer protective coating. Most commercial eggs are also not pasteurized here after the protective coating is stripped which makes it even easier for contamination. Then from there it takes 6-8 MONTHS for that egg to get to a store. Nothing is fresh about our food supply chain here. I count our family lucky because our son goes to a farm school and we get our eggs from there but most families don’t have that luxury.", "I leave small shell pieces in basically anything I cook with eggs. No reason to be scared", "It’s COOKED.", "💀💀☠️☠️☠️☠️☠️", "If the egg is only on the outside, you're not soaking the bread for long enough and the French toast will be gross and dry on the inside.", "so what?", "At 10 my niece could cook better than some of my exes.", "There are occasions when my senior colleagues would bring foods to work as gift for everyone, I got lectured about “it’s rude to say no if people offers you food”. BUT, this is such an old generation thinking. People can choose what they don’t want/like to eat, instead of me accepting something that I don’t eat and throwing it away behind you, I rather day no to your face.\n\nNo one should be pressured into eating foods that they don’t want to eat. However, I agree that it’s quite impossible for a 10-year-old to mess up a French toast to a degree that you’ll get food poisoning.", "American eggs are prewashed, so if the shell becomes contaminated afterwards it's vulnerable.", "Honestly this is not the answer. Firstly most egg producing chickens are vaccinated against salmonella so it is rare. But salmonella can exist both inside and outside of eggs. It can be inside the egg while forming and also on the outside of the eggs. \n\nHere's a bit from the usda\n\nhttps://ask.usda.gov/s/article/How-does-Salmonella-infect-eggs", "Then goes tromping around wearing BOOTS LIKE GASTON!", "i am american halfway lost in this convo but don’t y’all have pasteurized eggs? i’ve only ever eaten pasteurized eggs or ones my cousins have grown v rarely", "As a Scout leader, I have eaten many meals cooked by 11-year olds, OUTDOORS, over a campfire. Some of them have been pretty awful but none have given me food poisoning!", "My 11 yr old son cooks all the time. He loves making pancakes and eggs and even cakes. I eat it. Cause i am NTA. OP is TA for not eating it. French toast is hard to mess up.", "NTA. I wouldn't trust a kid to continuously wash their hands, and if I had a history of getting food poisoning before too, then I'd decline as well.", "You don’t have to eat anything you don’t want to eat, but you are overreacting. When I was 10 I helped my mom cater a 100 person party, it went great and we definitely didn’t give anyone food poisoning. At 10 I don’t see why a kid wouldn’t be capable of making an incredibly basic dish.", "My kids were perfectly capable of cooking simple meals by the age of ten. If your parents didn’t teach you by then, that’s on them. \n\nYou’re not required to eat anything you don’t want to eat, but YTA for basing someone’s competence solely on her age.", "YTA. You would know by cutting through the French toast if it was cooked through.  Spoiler tho if the outside is browned it’s most likely cooked! \n\nYou owe that well-intentioned, hard-working kiddo an apology.", "wtf NTA what does it matter that you are 10 years old you are not forced to eat food that you do not want and I am tired of excusing everything just because they are children. It's simple, you don't want to, you don't eat, you're an adult, you didn't say anything insulting to the child, you didn't kill anyone, you can say NO without everyone making you feel guilty.", "I don’t think anyone is an asshole Here it’s just weird", "NTA. Regardless of the reason, 10 is old enough to understand respect for boundaries, and to not push it when they get a “no, thank you”. \n\nEveryone giving you grief about not humouring a 10 year old needs to get a grip.", "NTA this comment section is wild", "NTA and for me it doesn’t have anything to do with food poisoning. You’re allowed to say no to things and no can be a complete sentence. Sure, you want to be tactful, but at the end of the day you shouldn’t be forced to eat something you don’t want. And that kid’s parents really missed an opportunity to model gracefully accepting someone not consenting to something.", "YTA: given the ingredients are being provided and eaten by her family, the excuse of possible food poisoning is just stupid. Way to go crushing a 10 year olds confidence.", "NTA", "YTA. I started cooking French toast when I was 7, my brothers were around the same age when they started cooking. It's one of the easiest things to make and it is VERY obvious when it isn't fully cooked. A 10 year old is 100% capable of understanding this difference. You were being an AH to a kid. Like seriously dude, take a bite and if it needs to go a little further just tell the kid or ask if you can throw it in the microwave or back on the stove yourself.", "YTA The chance you’d get food poising from it is incredibly small. It really just sounds like an excuse.", "YTA and don’t ever let anyone catch you eating cookie dough, or licking the spoon when baking a cake with raw eggs in it. \n\nOne slice of French toast that got cooked in a pan is not going to kill you.", "Nta asshole food poisoning sucks.", "Nta \n\nThis is purely a consent thing. \n\nDid you ask for French toast. No\n\nTherefore you have no requirement to eat the French toast. \n\nDid you ask for French toast, then change your mind. \n\nYou have no requirement to eat the French toast.", "NTA", "Jesus do you live in a bubble?", "YTA. Risk is very small for French toast, you are a guest in the house, and you turned a good chance to make her day into YTA in front of everyone.", "NTA. I wouldn't have done it, either.", "Probably NTA made me think of this old show. Children have bad hygiene. \n\nhttps://youtu.be/YrY8Vy83C8Y", "A five year old once tried to make me a waffle, sneezed on it, then handed it to me expecting me to eat it. That is not what is happening here. But if you simply said no thank you and they pushed then they are the AH. You do not have to indulge in everything a child does just because they're young", "I don't eat what kids <15 make, unless I see it, because I'm a stickler for hygiene, kids are fucking gross, and young teens are assholes.\n\nSo NTA imo.", "The lack of context here. Why did this even make it to aita. This is such a silly thing to post that I think it’s fake", "Yta, presumably you are not visually impaired.  It is very easy to tell if french toast is cooked or raw.", "NTA, but not kind. You could have pretended to eat it while leaving then spit it out and put it in the garbage outside. BUT she needs to learn how to accept no's, even if she's doing something she thought was nice.", "YTA - I worked at a Girl Scout camp and literally ate food prepared by children for months on end because that’s how it works, the kids do the meal planning and then with supervision they cook. Children as young as seven were cooking over a fire. You are being ridiculous.", "YTA. Ten year olds are capable of simple cooking like French toast. Even if this one did a bad job, it’s not a high-risk food and you wouldn’t have gotten sick. You could’ve taken a bite or two and made an excuse not to finish instead of hurting a child’s feelings.", "NTA. You're not required to eat something you're not comfortable with to spare someone's feelings. A \"no thank you\" is good enough.", "NTA I don't believe anyone should be made to eat anything for any reason, even for not hurting the feelings of a ten year old.", "YTA.  Kinda hard to get salmonella from French toast.", "I mean, this is one of those \"do you want to be right or happy?\" kind of situations. It wouldn't have killed you and likely wouldn't have even gotten you sick if she managed to butcher it.\nIt's already done and over with so I don't think you'll get a chance to remedy the situation unless she cooks often. You could tell her sorry if she was personally hurt but it sounds like your family was offended on her behalf. Next time, say you're not hungry, fasting, or you don't like French toast. Or just eat it.\nNAH but I would judge more harshly if you're over 25.", "NTA and obviously people who are saying so haven't gotten sick from a child's germs. It's the child's germs, not food poisoning from eggs. And I've absolutely gotten sick from eating after a child's dirty hands. You responded as politely as possible.", "If it's not your kid, then I would say NTA since you aren't going to see them again. If you are just visiting. But you could have done a better job of getting out of eating it.  Like make a big production how happy you are she made it And you are so late for an appointment or work you are going to wrap it up and eat it at work. Then praise her for how good it was (throw it out).   But to just flat out refuse was just rude and discouraging to a kid.  You should do something nice with her like cook something you know is done right and eat it with her.  Kids remember this stuff.", "INFO: Was there any reason, other than her age, to believe the french toast was dangerous? Did it appear undercooked?", "YTA - I made my dad a fruit salad as a kid and was super proud of myself. I worked hard to cut all the fruits into just the right sized pieces and he yelled at me for going into his office without permission (my mom was in the office at the time too and had said it was okay) and then got mad at me for crying after I dropped the salad. I refuse to make him anything special now. What my dad did to me is what you did to that child. You should be ashamed.", "Well, I once refused to eat cookies made by a 8 year old simply because I knew his hygiene-habits. I just couldn't bring myself to even try a little bit.\n\nSo, NTA", "At most the texture would have been iffy. YTA.", "10yr olds CAN cook. They parents would not have let her if she couldn’t. You’re an ageist & rude guest. You refused without trying. \nYTA", "NTA, you have a right to refuse food it doesn't matter the circumstances. The people say she is old enough to cook it well and it should be fine, should also realize that she should also be old enough to understand no and that people may not want it. What if I said no because of a food allergy???", "I am actually really upset by all the posts stating a 10 yr is unhygienic. It depends on the child. There are adults that have way less hygiene than a 10 yr old. YTA for treating a 10 yr old like this. Unless you know for a fact that 10 yr is unhygienic you are just being an ass assuming they are. My 10 yr old knows that if you cook for other people you wash your hands. My bro in law still hasn't figured that part out and he's over 40.", "NTA. I wouldn't trusth 10 yo's hygiene when cooking anything I didn't personally watch. Why doesn't the family eat it. Sounds like they tried to make you the sole consumer of that culinary attempt", "Not The Asshole\n\n1. You don't have to eat what you don't want to. Full stop.\n\n2. Kids are fucking nasty. Did they wash their hands properly? Is it well cooked? Who knows.\n\n3. Undercooked eggs can absolutely get you sick. It's rare, but it can happen.\n\n4. Your friends are assholes who dont understand basic consent", "Wow. A 10 year old is perfectly capable of making french toast. YTA", "nta", "NTA", "YTA, it's French toast, literally fried bread, there's nothing in it that can give you food poisoning, if you were talking a roast chicken dinner you may have some recourse depending on the kid, some can, many couldn't, but in this case, you're not only TA, you're also an idiot for thinking such could give you food poisoning", "As long as you answer was no thank you I’m not interested in eating at the moment. Then NTA. I just wanna say that if ever you don’t wanna eat food nobody should force you. People shouldn’t get their feelings too attached with a dish everyone may not feel comfortable eating.", "It's nobody's place to tell you what to eat. The lack of respect is on your friends insisting that you try it. To spare the girl's feelings maybe tell her you're not hungry, but NTA", "YTA\n\nYou wouldn't get food poisoning and more importantly it is rude to refuse food cooked for you eat a little if it tastes bad or undercooked say your full.\n\nEspecially because she is a kid", "NTA. And the people who are saying, \"My 10 year old cooks all the time....\" or \"You can't get food poisoning...\" are missing the point completely. You are not required to eat any food that you don't want to. Doesn't matter who made it or why, you are not required to eat it. The 10 year old needs to learn that she can't always get her way nor dictate what her guests consume. Her parents aren't doing her any favors by trying to guilt you into eating her food.\n\n\nPeople need to understand that no one has to eat their cooking, especially if it's unsolicited.", "NTA, kids are gross. I won’t eat children’s cooking until they are well in their teens.", "ESH, except the 10 year old. \n\nYou're allowed to choose what you want to eat, but your reasoning sucks.\n\nThey shouldn't give you shit for not wanting to eat something.", "NTA. \n\nYou have a right to refuse ANYONES cooking. PERIOD. \nIf an adult pushed their cooking on you everyone would say NTA but for some reason we cant teach a 10yr old boundaries??\n\nHer parents can indulge her by eating encouraging etc. but not force it onto others and making a scene or comment IS RUDE!\n\nSeriously with all the disgusting video of adults making monstrosity meals, no way I’m trusting a 10 yr old culinary abilities", "YTA I've watched cooking shows where 10-year-Olds are much better cooks than adults. How well do you know this little girl willing to bet not very well and I bet she had adult supervision while cooking so I don't see the problem at all. She did it to be nice and feed you are you serithat self-righteous that you couldn't thank her take maybe Teo bites and be done with it.", "INFO: does she know how to cook? Is this a meal she prepares regularly? Did you have any reason to think the food was unsafe, other than being prepared by a kid?\n\n10 is old enough to mix 3 ingredients, dip a slice of bread in it and fry it in a pan and there are plenty of kids that age who could handle significantly more challenging recipes.", "NTA. You aren’t obligated to eat food you don’t want and didn’t ask for.", "NTA. You don't have to eat anything you don't want to. Unless you watched her make it, you can't be sure she washed her hands prior either. Having worked in a kitchen myself, ive seen that's probably the biggest danger. \n\nI'd never eat something a child cooked unless they were taking actual culinary classes.", "I'm 59 and eat raw eggs (and flour!l) on a regular basis. It’s called \"cookie dough\".\nHad salmonella once, but it was a documented case from a restaurant. A couple hundred people became ill. One of the worst experiences of my life.", "YTA! \n\nYou could have asked one of the parents, quietly and politely if she had done this before or If she knew what she was doing. Seems simple compared to rejecting something she was probably proud of and wanted to make for you .\n\nMy nephew started cooking when he was 7 years old, he's 14 now and cooked all the dishes served at the Nobel Prize dinner last year and has a better understanding of gastronomy than me, I'm 42. Don't assume the level of knowledge in other people's children.", "I would say NTA, as long as 1: she is not your kid 2: you let her down easy with a no thank you.", "Clearly OP knows nothing about cooking to be worried about food poisoning lol. YTA!", "NTA- It really doesn't matter why, you said no and that should be enough. This is coming from someone who absolutely hates when someone offers me something and I politely  decline and they keep insisting. The fact that they are guilt tripping op instead of telling the kid to leave him alone says alot.", "YTA. I feel bad for the child, she must be so hurt", "YTA\n\nShe took the time to make food, regardless of it was for you or not. Dont be rude and reject her hard work. It diminishes a child's mentality more than you think when you do that type of stuff", "What does 10 years old have to do with anything?  **You think that adults can't poison you?**  lol!  I took care of my teachers nephew when I was 10 years old and omg! I fed him too!  (He didn't get sick even! omg Imagine that!)  My SO was the MANAGER of a fast food restaurant at 14 years old.  \n\nUnless you have always cooked 100% of your food yourself, you are being ridiculous.", "Dude she’s 10, 10 year olds are able to cook you know 😂 also don’t be such a little b. You won’t get food poisoning from that", "Wait, why would you be worried about getting food poisoning? Lots of kids no how to cook.  \nYeah YTA", "Nta\nKid needs to learn nos no\nEggs a risk\nKids pick their noses and scratch their arses with the same fingers \nI have food issues anyway so no way would i take it but i always say id love to but im feeling abit unwell maybe next time eventually they stop offering (no ine wants to make someone sick, and eventually twig you dont want to and just dont ask) best way iv found anyhoo", "As long as you were not rude when you declined it, NTA. Everyone is allowed to say NO", "I've been crapping my brains out since last night from a salad", "Makes me wonder if OP has ever eaten raw cookie dough?", "Dude, generally I agree with the rule that people shouldn't be forced to eat what they don't want to. But your reasoning seems kinda silly.  If you are that afraid of a 10 year old screwing up french toast so bad as to give you food poisoning, then you probably should never take the risk of eating out.", "He didn’t ask for it. Why should he eat it.", "OP could have always asked that she cook his extra.  Better that than what they did.", "NTA I would be concerned about hand washing, clean utensils; food prep is more than the ingredients", "I disagree. Just because she's 10 doesn't mean OP loses the right to say \"no thank you\". Definitely NTA", "I would also like to know. You can tell if something with egg is undercooked, so OP should have been able to see easily if that was the case or not.", "I'm generally not a fan of white lies but this would have been a perfect opportunity for some:  \n'oh, honey, I am sure it's delicious, but I cannot eat eggs /allergic to cinnamon/whatever'  \nor   \n'it looks so good, but I will be late from work, can I have some on the go?' - and trash it when you are out  \n'no, I'm not eating that (I don't want to get sick)' is somewhat rude, and you hurt a child's feelings for nothing, when there are alternative solutions and compromises available.", "Kids don't wash their hands. Kids then handle food with the poop hands. Adult gets sick. Why is that hard to understand?", "Depends where you’re from tbh, a lot of countries vaccinate against salmonella.", "Salmonella is on the shell. Raw eggs are fine.", "Because \"Oh no the poor kid's feelings\" > Bodily autonomy, apparently", "I eat raw cookie dough all the time and have never had a problem. But I watched my mom get horrifically ill after eating an egg dish at a restaurant. Eggs aren’t inherently safe just because you have never gotten sick.", "If you live in the US perhaps. In most other first world countries salmonella is not an issue you have to be afraid of. In Sweden where I live for example, salmonella basically non-existent in eggs due to very strict rules regarding handling of chickens in agriculture.", "I hate eating my kids germy food. I don't even like it when they kiss my cheek. But I teach my kids to wash their hands everytime they cook for someone else. I don't care if they didn't want to eat the food, I am a little pissed they are treating a 10 yr like a 3 yr old. Unless the 10 yr is mentaly challenged or a very unhygienic person, they are the AH simply for treating a 10 yr old this bad.", "Sometimes adults are way more gross than kids. Some kids are very clean, at least by age 10. Yeah maybe a 5 yr old is gross, but by 10 they are starting to care about hygiene. I'd rather eat stuff my 3 yr old helps me make than stuff my bro in law makes. He's gross.", "> Yep. I am baffled by the overblown fears of food poisoning people online seem to have. \n\nAmen, haha. I mean, yeah, its a valid fear, but I think its totally blown out of proportion on reddit. If you cook for others? Absolutely, be aware of food safety guidelines etc, but when cooking for myself? Or the times when I was in university and came home drunk at 3 am... these people would get a heart attack knowing what kind of shit I ate.\n\nBut I get it, every body is different, and thus every immune system is different, but yeah", "I regularly drink raw eggs, because I love them. Food safety is also really good where I live.", "Children have to be humoured or adults are assholes? What world are we in? \n\n10 is plenty old enough to understand “no, thank you”, and to respect others’ boundaries.", "I feel like this joke doesn't translate well in text. It's one of those that works better out loud.", "Yes. You have the right to refuse food for any reason. Including this one.", "See it would never occur to me that an adult picked their nose then plated my food. I can’t rule that out with a ten year old though.", "Even in the US, people consume runny eggs all the time. Egg safety has improved a lot since the 90s and salmonella in eggs is lower than 1 in 20,000. Much more likely to get it from poor handling, since eggs in the US are rinsed you can't get sick from dirt or bacteria stuck on shell, but the eggs are more delicate and bacteria can grow if the eggs aren't stored properly in the fridge.", "But how is OP supposed to know if this kid has been raised that way?", "It’s not the fact that she’s 10 that’s getting me (entirely) it’s that the logic doesn’t sound… completely true? \n\nGenuinely curious, how do you feel about eating cookie dough?", "I'm not diagnosing anyone. I said \"it's possible you would benefit from therapy.\" That is not a definitive statement on any level.", "Yep, I mean if I'm cooking for pregnant peeps (including myself now) or small kids or elderly etc I'd be extra careful and I would always tell people if I used something raw like eggs that might be a personal comfort thing for people even If not a big risk. \nBut redditors are like \"my housemate left a slice of pizza out of the fridge for 3 hours then ATE IT omg they are gonna die of botulism\"", ">You take a risk every time you eat something with raw eggs. You think it's no big deal until it does happen to you or someone you know.\n\nIf you live in the US\\*\n\nIn most of Europe for example, salmonella is not something you have to be afraid of in eggs, at all.", "How tf you get salmonella from eggs that only shows up from salmon it’s in the gd name", "Food borne intoxication (toxin from staph) and food borne infection (salmonella) are both food borne illnesses and both commonly known as food poisoning.  Sometimes you can get both from the same micro organism (yay for e.coli 157:57?)", "Why call then a turnip? I say get creative and call them a cardoon or a kumquat.", "Any time i see a comment like this I wonder how far you’re willing to take this argument.\n\n“Any reason”? Really? Including if the reason is just because the chef is a woman, for example?", "I currently teach middle school and I’d like to assure you that things have gotten worse.", "I was ordering a slice of pizza from a greasy pizza place popular at my college town and watched one of the cooks take some rolled pizza dough and place it under his hairy armpit while while wearing a tank top so that he could answer the phone.", "Just because you didn't see it doesn't mean it doesn't happen", "But there was that guy that worked at taco bell, and put his hands inside his pants to scratch his butt, and the video of it went viral and he got fired. Gross!", "How do you know anyone practiced acceptable food hygiene unless you watch them?", "And how would OP know whether an adult had been taught to cook well? The point is, the decision not to eat a 10 year old’s meal was arbitrary.", "Yes. Yes, I think ten year olds cannot cook at the same level of skill *and hygiene* as grown adults.", "> In Poland raw yolk is traditionally added to steak tartare\n\nNot only in Poland. It's standard for steak tartare.", ">Salmonella infection is usually caused by eating raw or undercooked meat, poultry, and eggs or egg products or by drinking unpasteurized milk.\n\nFrom the Mayo Clinic's website.", "Yes. It makes you an asshole and a misogynist but you still have the right to not eat food you don’t want to eat.", "I work with a great many adults and I'd like to report that it doesn't get better as they get older.", "You seriously believe there are no restaurants anywhere with stricter hygiene than an unsupervised ten year old?", "I take a wild leap of faith when I eat at restaurants staffed by professionals, who have been professionally trained, and are audited by health and safety professionals.", "You k ow you might be right, my 7yo has much better hygiene than some adults.", "Depending on where you live you don't have to worry about it at all.", "Macht ja nix\n\nEdit: Heißt bei uns übrigens \"Beef Tatar\", wenn.", "I know it was a joke, apparently it didn’t land very well", "I have had undercooked French toast, the egg can soak inside and still be runny. I don’t know if it’s dangerous at that point but I’m disgusted by runny eggs so I wouldn’t eat it.", "Or cross contamination. That said, I'd have taken the risk unless I had some reason to be extra careful like pregnancy or immuno complications.", "Ok is this sub “am I the asshole” or “do I have the literal human fucking rights to not do something I don’t want to do”?", "Please show me where I said that.", "They literally said the opposite. \n\n> There are places with high standards\n\nmeaning that yes, **there are restaurants with strict hygiene requirements**\n\n>and there are others\n\nmeaning there are also **some** without those strict hygiene requirements", "And my middle schoolers have much worse. Congrats.", "> Then from there it takes 6-8 MONTHS for that egg to get to a store\n\nSeriously???\n\nIf I get my eggs 4 days after they've come out if the chicken, I don't consider them super fresh anymore.", "Ah. It can be hard to tell with text.", "…ok? We judge each situation as presented. I don’t think the reasons OP gave make OP an AH. You gave me a completely different scenario. In your scenario, I do think you’d be the AH. Do you think this is some type of gotcha??", "You implied it when you stated that not wanting to eat food from a ten year old means that you can’t eat out at restaurants. The implication is that all restaurants have equal or worse hygiene to the ten year old. I used my reading comprehension.", ">Do you think this is some type of gotcha??\n\nNo, I think this means your original comment of “You have the right to refuse food for any reason” is pointless in the first place, because no one was talking about rights.", ">\tI used my reading comprehension.\n\nI‘d work on that.", "I use antlers in all of my decorating!", "Oh my bad for thinking we were having a conversation here. So sorry to offend.", "10 years old isn’t that young. I was left alone after school at age 9 and fixed my own snacks, including on the stove.", "Yep. I would understand it with a self picked mushroom omelette but french toast? Come on.", "Agreed. In general, trying to force someone to eat something they aren't comfortable with is a big nope, but these are valid concerns. NTA", "So she's a 10-year-old that's confident enough around the stove that she was able to make food by herself without causing a mess or burning the house down?\n\nThat's a kid who knows how to cook. Likely better than you do. Grow up, and learn how to be a decent person.", "The kid is 10 not 3. And they are a 10 year old that has lived with COVID for a significant portion of their life. They know hand washing.", "This is a 10 year old, not a toddler who’s playing with a  pamper full of crap", "This. Im strict about hand hygiene with food prep, kids aren’t 🤢", "That's a lot of words to describe exercising your bodily autonomy, which \"I don't want to eat that for any reason whatsoever\" absolutely is.", "Probably more likely to get sick from that than a real egg. :-)\n\nEverytime I see those, I always want one. Then I get one, take a bite, and am like \"Nope.\"", "It's a reason, not necessarily valid.\n\n\"Green is bad for my aura\" for example", "Any time i see a comment like this I wonder how far you’re willing to take this argument.\n\n“Any reason”? Really? Including if the reason is just because the chef is a woman, for example?", "Maybe the 10 year olds you know are just dumb…", "If a 10-year-old is confident enough to use the stove on her own and didn't cause a huge mess or burn down the house, odds are good the kid can cook well and probably better than OP or many of the commenters here.", "If that's what you think of 10-year-olds, you must have been a terrible child.\n\nBecause get this... 10-year-olds can be taught food safety. When my daughter was 10, she cooked well and safely, and can probably cook better than you can now that she's 16.", "Salmonella is in no way exclusive to fish. You can get it from chicken, eggs, handling reptiles and not washing your hands, etc. It was named for the veteranarian who isolated and identified the bacteria.", "You don't technically have to do anything. But not eating something just because a kid made it is miserable. And AH behaviour in my book.", "You have taken this in a very strange direction. Are you just looking for reasons to be outraged?", "Sure, nobody should have to eat anything they don’t want to.", "You do understand we are speaking statistically, right? Food safety is a game of numbers. You cant win (i.e. someone will always get sick at some point), you can only try and keep the stats down through vigorous food safety diligence. The risk of a 10 year old being plain ignorant of proper food safety is simply far too high.", "Depends on the kid and the adult.  My sons are better cooks than my mom's mom was but that bar was pretty low.  She burned everything.  My kids attended a Montessori school from 18 months to age 4.  When they were toddlers they were cutting up carrots to feed the class bunny without any supervision.  When I learned they were doing that in school I started them with simple kitchen tasks such as washing potatoes and went on from there.  They know about proper kitchen hygiene and can make a variety of simple dishes unsupervised.  French toast would have been a piece of cake for them at 10.  I view cooking as an important skill they need to master before I send them off into the world.", "That's nonsense.", "I had bad chicken potstickers from Aldi. I was hospitalized for 5 days and needed iv antibiotics. I lost so much potassium that if I hadn’t gone to the hospital when I did, my heart would have stopped. \nDon’t mess around with salmonella!", "Well I’m glad you think sexism and racism are acceptable reasons to justify some behaviors.", "> You do understand we are speaking statistically, right?\n\nYou do understand it’s some times questionable to apply statistics about a group of people onto an individual, right? \n\nUse your judgment about the individual kid and dish. It’s French toast. You literally pan fry it. If it comes out looking right I fail to see how the kid could’ve messed it up so badly that you get food poisoning.", "So you've never eaten at a friends house?", "The time frame is not true and if it is the farmer and distributor are violating federal law. For commercial eggs in the US, eggs are allowed 30 days from laying to carton, 30 days to sell once in the carton. Max, 2 months old, but usually not nearly that.", "So everyone in the family ate raw eggs so as not to hurt the child’s feelings? Or OP was just being an AH about something that wasn’t actually an issue? I’m thinking its the latter.", ">a group of people.\n\nyou mean all of humanity? Shes a human, she falls into that set.\n\nI would treat as sus any dish made by a 10 year old that has sensitive ingrediants like flour, eggs, pork and chicken.", "Friends who I know and trust? Sure. Food cooked by the young children of my friends? Maybe not so much.", "Plenty of people enjoy raw eggs. Plenty of people do stupid shit to appease others. I don’t see that as an indication that OP should have to have eaten something they were uncomfortable eating.", "I mean 10 year olds…", "How do you even mess eggs up so bad you get food poisoning? Do the 10 year olds you know regularly cover their hands in shit?", "I had assumed the OP was implying the kid would not be aware of cross contamination or would not have used proper hygiene. Most cases of food poisoning are from the fecal/oral route. AKA someone used the bathroom then failed to wash their hands then touched the food.", "Even with the higher risk in the states the cdc estimates that 1 in every 20000 eggs is contaminated. All said and done according to the fda only 79000 cases of food borne illness happen in year here so the risk of any food borne illness isn't super high", "'Not being comfortable ' about eating something a kid made is ridiculous, though. \n\nIt's food. Not jumping into a plane flown by a 10 yr old 🙄🙄🙄", "I've found that most kids that have endured COVID protocols are much more conscientious about hygiene than many adults.", "That's kinda my point. 10 year olds are getting all the blame - when logically, there's a high chance of it happening with adults, too. We're wading through/touching human germs (often from lack of hygiene) all day long. \n\nChances are high that you're going to touch a door, seat, table, whatever, that an adult touched - after picking their nose, not washing their hands, etc. You're likely to touch your own mouth/nose at some point (we all do subconsciously, dozens of times a day), and transfer the germs. If your body then doesn't have antibodies for those germs, you'll get sick.\n\nAt least the food being offered OP had been heat-treated. OP was probably more at risk from all the germs lying around their friend's house, than cooked food.", "I got you. Haha yeah, those are the posts I'm talking about. Honestly? I dont do it now anymore, but when I was 18-25 and in university, I often (drunkenly) threw some kind of pasta dish together and was too lazy to put it away. I ate it with no problems whatsoever the next morning straight out of the pan.\n\nI get that people have different tolerances for that type of stuff, but some stuff is just laughable.", "So in other words on average it would take Gaston only 6 years to come down with salmonella.", "No, I'm just tired of people latching onto the most convenient moral principle they can find to justify their stances without actually thinking it through.", "You’re the only one claiming anything black and white here lol. You essentially said “all 10 year olds are dirty, so never eat a 10 year old’s cooking” and “all cooks are clean, and anything to the contrary is made up.” The person you responded to pointed out that the second isn’t always true, introducing *grey* into your otherwise black-and-white view. If you don’t want to eat something that someone possibly unclean has cooked, then it’s true that you can’t *know* the person you who cooked your food is clean enough for you without having been involved in the process. And yes, I have 100% met 10 yr olds cleaner than some adults.", "2 months old max by time they hit the store shelves. Normally 1 month for grade A", "Get a grip. You're looking like a fool.", "With someone with so little confidence in them as an authority figure? Sounds about right.", "If you trust the friends, it's unreasonable to not trust the kid. If the friends have cooking culture, they will monitor and teach their child the same. They will *not* turn on the stove, throw a knife and say \"go nuts\".", "You think their math teacher recognizing their poor hygiene is… why they have poor hygiene? I’m retroactively sorry for anyone who had the misfortune to try to teach you.", "I’m can tell by your optimistic view of what children do unsupervised that you do not regularly work with children."]}