{"id": 6386, "submission_id": "102b4kd", "title": "AITA for snapping at my sister and telling her that her opinion on what my wife and I name our children will never be welcome?", "selftext": "My wife and I welcomed our son into the world in November. We did not tell anyone his name before he was born and he was three days old before we formally announced it because we decided to meet our son and feel out the name we chose first. Once we knew for sure our feelings were the same as they had been while my wife was pregnant, we announced the name.\n\nThe name is very different from my family's very conventional and classic/old fashioned naming style. The family has always followed somewhat of a pattern. For example my mom's family have Elizabeth, Bernadette, Patricia, Nigel, Kenneth and Gerald. Then my siblings and I are Charles, Kenneth, Patrick, Elizabeth and Florence. The name Elizabeth appears multiple times in our family, same for Patrick and Kenneth. Through cousins and and more extended family. Everyone in my family is very fond of traditional names and names that are more old man/old lady sounding.\n\nI have always hated it. I despise my name. Always considered changing it but when I talked about it as a teenager, I was told I would thank them when I was in my 30s and settled in my life. I'm not 30 yet but still hate the name.\n\nMy son's name is Cael.\n\nMy sister has been seriously outspoken on the name. She said it's not a name, it's wrong to break from the tradition, she asked my wife how she could put son through that when she's spent 28 years with a ridiculous name. I stepped in and told her that we did not ask for her opinion. She said giving her opinion is important after seeing what we were going to do to our son and how he'll hate his name in the future. I told her that could be true even with a name like ours, that I still hate mine, that just because they think these are the names the family likes doesn't mean everyone will. She told me she was entitled to give her opinion in response. I told her she was but it will never be welcome when it comes to what my wife and I name our children.\n\nShe said I was being an asshole. I told her she was sticking her nose where it wasn't wanted and is not appreciated.\n\nAITA?", "created_utc": 1672760234, "permalink": "/r/AmItheAsshole/comments/102b4kd/aita_for_snapping_at_my_sister_and_telling_her/", "score": 1686, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I snapped at my sister and told her that her opinion on what my wife and I name our children will never be welcome. I'm only checking if I'm TA or not because I am aware that sometimes people might choose names truly harmful/detrimental to a kid and pointing that out could be good. My sister isn't doing that. But I can understand that taking such a hard stance and getting so mad at her could come across as we would not want to hear the truth.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA it’s your baby not hers", "nta\n\ntradition is just peer pressure from dead people.\n\nhow you name your kid is nobodys business but yours. if they dont like it then its their problem.", "NTA.\n\nAs I said in my other comment, Cael is an ancient Irish name. You can't get more traditional than that. The only important thing that you have to worry about a name is if your kid is going to suffer because of it, and I don't see that happening. Your sister can name her children any way she wants, but she doesn't have a say in your child's name. That's a thing between you and your wife.", "NTA\n\nIts not up to other people what you and your wife's child is called", "NTA. Not her baby, not her business.", "NTA. When she has kids of her own she can name them whatever she wants. She can offer her opinion all she wants but that’s just what it is - an opinion.", "She is definitely not entitled to tell you or your wife how you should name your child. Sure, she can have an opinion but that's it. Snapping at her might not have been very nice of you but it seems like she simply wouldn't let go of it so I say NTA.", "NTA.\n\nNot her business or place on the decision.\n\nAlso, expecting forcing your kid to maintain a naming system that YOU already dislike yourself is entitled and asinine.\n\nSister can pound sand.", "NTA I mean Cael is an unusual but it’s not even weird or anything. I would only say something about a child’s name if it was wildly out of pocket and the kid was going to be teased. Honestly your son is going to be lucky not to be the 20th person he knows with the same name.", "NTA it's your child and it's not like you gave him a crazy weird or a name from a tv show or so", "Nta. I learned long ago not to offer any opinion other than 'What a lovely name' / 'what a unique name'.  Anything else is liable to cause offence.", "NTA \n\nDefinitely not.\n\nParents choose names for infants. No one else in the family makes that choice. You don't have approval before naming your son.\n\nYou aren't obligated to name your son a family nane. Your sister, rudely, shared her opinion of your son's name (Her actions were inappropriate). She shouldn't discuss it any further. She can move forward, and choose names for her own children. Your child's name is not her concern.", "\"She said I was being an asshole. I told her she was sticking her nose where it wasn't wanted and is not appreciated.\"\n\nYou are right, she is wrong.  NTA  Slam dunk answer, difficult family member.", "NTA. Your sister is an A. What a beautiful name, btw", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife and I welcomed our son into the world in November. We did not tell anyone his name before he was born and he was three days old before we formally announced it because we decided to meet our son and feel out the name we chose first. Once we knew for sure our feelings were the same as they had been while my wife was pregnant, we announced the name.\n\nThe name is very different from my family's very conventional and classic/old fashioned naming style. The family has always followed somewhat of a pattern. For example my mom's family have Elizabeth, Bernadette, Patricia, Nigel, Kenneth and Gerald. Then my siblings and I are Charles, Kenneth, Patrick, Elizabeth and Florence. The name Elizabeth appears multiple times in our family, same for Patrick and Kenneth. Through cousins and and more extended family. Everyone in my family is very fond of traditional names and names that are more old man/old lady sounding.\n\nI have always hated it. I despise my name. Always considered changing it but when I talked about it as a teenager, I was told I would thank them when I was in my 30s and settled in my life. I'm not 30 yet but still hate the name.\n\nMy son's name is Cael.\n\nMy sister has been seriously outspoken on the name. She said it's not a name, it's wrong to break from the tradition, she asked my wife how she could put son through that when she's spent 28 years with a ridiculous name. I stepped in and told her that we did not ask for her opinion. She said giving her opinion is important after seeing what we were going to do to our son and how he'll hate his name in the future. I told her that could be true even with a name like ours, that I still hate mine, that just because they think these are the names the family likes doesn't mean everyone will. She told me she was entitled to give her opinion in response. I told her she was but it will never be welcome when it comes to what my wife and I name our children.\n\nShe said I was being an asshole. I told her she was sticking her nose where it wasn't wanted and is not appreciated.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - its your baby and you can name them whatever you want. With that said, people can and will have opinions and it’d be naive to think they don’t BUT unless asked about the name, people should keep that opinion to themselves.", "NTA - It's not like you were naming your child \"Hufflepuff\" or those nonsense mix of letters that don't resemble at all the name they were aiming at.", "NTA. I would feel some sympathy for her if you were naming your child something that is likely to have a negative impact on them later on (for example something that has loads of unnecessary letters so is difficult to spell or pronounce or that looks ridiculous on a CV), but that doesn’t seem to be the case here. \n\nYour baby, you choose the name. \n\nIf, however, you are one of ‘these’ parents like the example below, then Y T A\n\n\"Jageorgeson. Pronounced Jason. The entire 'George' is silent. Parent actually got upset because it was mispronounced.\" https://www.buzzfeed.com/jennaguillaume/baby-names-people-think-are-the-worst-in-existence", "NTA but how is it pronounced?", "NTA. If your kid doesn't like their name, they will let you know, and change it later.", "NTA it drives me crazy how people seem to think they get to help name a child who they are not the parent of or if their opinion is negative it is ok to voice it to the parents.", "NTA. She’s given her opinion. She can stop now.", "Nta. I actually love that name! If I'd heard it 20 years ago I may well have called my son that. It's not even that out there. It's hardly Rainbow or leaf or some other hippy name. Nor is it one of those silly spelling names like nevaeh or some crap. It's cool and it's literally none of their business.\n\nI mean can you really call a little baby Kevin or Patricia?", "I can't speak to the name - I've never heard it and I'm not from an English-speaking country so I don't know if the kid will be bullied. Maybe other kids will make vegetable jokes, maybe not. \n\nBut to OP, I'm just saying - you could change YOUR name. I know/suspect your family would make a fuss. But. You could. I've known people who have. It's been pretty cool to witness and participate in their journeys, and most find it liberating. Plus, it's a bit sad that you hate your name. So good luck if you ever go that path.", "NTA. Your sister could have expressed her opinion once if she felt so strongly about it, and then let it go. Yammering on endlessly was completely uncalled for and you were right to defend your family against her.", "Your kid , your name choice. We got that from my MIL too , we never told anyone our names for this reason. It’s a very personal choice and one that you and your wife get to decide together. No one else’s opinion matters. And fuck it , it’s 2023 , break the tradition!", "NTA. I like Cael, it's a cute name and unless it create some sort of joke with his surname, I don't see the problem ( when I talk about joke, I mean like calling Rose someone whose family name is Pink. Pink Rose)", "NTA. Sister is TA for acting like anyone cares about her opinion or that it matters. For what it's worth, I think Cael is a lovely name.", "I live in a country where names have to be approved because some people aren't responsible enough to name a child. \n\n\n\nI had to look it up and it's a name from Irish mythology, which wouldn't be allowed, since it's mythos. \nFor me yta", " NTA but she isn't going to let this drop and will be ridiculing him as he grows up. You have to stamp this out. \nHow are you pronouncing Cael as you don't want it confused with kale, the veggie, so perhaps put an accent on a particular letter? Congratulations on your new baby.", ">tradition is just peer pressure from dead people.\n\nDamn, will be stealing this.", "Like Kale.", "I'm just hoping it's not \"kale,\" because it's otherwise an angelic name.\n\nDownvoted for making a point others are too nice to point out. ITA", "This sub is not “would OP be an asshole if this happened in u/K_DeSinaasappelen’s circumstances,” but way to make it about you lol", "Cael is an ancient Irish name, and perfectly valid. Just because there's a Fianna with that name, doesn't mean it is only from mythology. Or isn't Arthur a valid name? Or Hector?", "There is no law like that here.", "????", "will also be stealing this lol", "Nice! Perfectly cromulent Celtic name.", "How did you think it was pronounced?", "Athena, Iris, Daphne, Cassandra, Phoebe, Maeve, Luna, Aurora, Oscar, Finn, Jasper, Cora, Penelope, Chloe, Camilla, Damon, Cynthia, Conor, Diana, Dylan, Enid, Fergus, Helen, Irene, Hilda, Kane, June, Jason, Lara, Morgan, Selena, Sabrina, Tara, Tristan, Ulysses, Victoria.", "Kah-el? Like Superman's name, kinda.\n\nIt could also be pronounced as \"cal\" or \"chel\" if OP is reading this. It's possible the sister was objecting because she didn't want the kid to be teased for having a vegetable-sounding name.", "\"she asked my wife how she could put son through that when she's spent 28 years with a ridiculous name.\" Damn!  That was uncalled for. If I were OP's wife, I'd be NC with that obnoxious sister.\n\nOP, you are NTA.  You chose a name that you both liked, decided that it fit your child. That's the end of the discussion, but you can always remind your sister what they say about opinions...", "NTA.  Your baby, your choice.  If you’d named him something ridiculous I might have more sympathy with your sister, though she’d still be the A for making a fuss.  But that seems to be a traditional name, albeit not necessarily from your own heritage.  \n\nDoes your sister hate her name?  Because she seems to have an unusually strong reaction to something that’s not really her concern. If she does, that’s sad but it’s a her problem, not a you problem.  She can change her name if she wants to.", "NTA. One of our closest friends is named Kale. Spelled that way, too, ironic because I’ve never seen the man eat a vegetable or fruit that wasn’t mixed into a cocktail.\n\nAnyway, Cael is a fine name. Easy to say, easy to spell, intuitive to read aloud. He’ll have to tell people which way to spell it when opening accounts but that’s no different than a Sara/Sarah or a Caitlyn/Katelin situation. \n\nA fine name.", "NAH\n\nThis sounds like a sibling spat where each if you held your own. She can hate your choice and say so, that's what siblings do. You can tell her to shut it or you'll put gum in her hair, because that's also what siblings do.\n\nYou were evenly matched and neither sounds particularly hurt by this.", "Isn't Cael an old Gaelic name? So no problem? NTA but your sister is sure a stick in the mud.", "OP=NTA\n\nShe may be entitled to her opinion, but not necessarily to voicing it to you.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \n\nFreedom of speech is about freedom from governmental regulation, it does not mean you get to mouth off indiscriminately unfettered of consequence.", "Honestly, I'll say ESH here.\n\nYour sister is clearly an AH to force you to follow tradition and judge you for not following it.\n\nHowever, I feel like you're kinda guilty of the same thing than you accuse your family. You pick the name you want without really wondering if your son will like it in the future. I don't really care about how people are naming their children usually, and if your post was \"I named my son Cael, my sister is angry at me\" I wouldn't have said anything. But in your case, you seem to put a lot of importance in the fact that you hate the name your parents gave you, but doesn't explain why he thinks his son will like his own name.\n\nBy the name, I assume you're Irish (or live in Ireland), I just hope that your son won't dislike his name.", "NTA. Your sister thinks you’re an AH because you established boundaries regarding your child’s name and your parental decisions, but, somehow, she doesn’t see that she’s the AH for making rude and unnecessary remarks concerning your child’s name and your parental decisions? 🤔. This is a classic DARVO move on her part.", "NTA, she's giving unsolicited advice. She can f-off.", "NTA. If she wants to name a kid she can have one herself.", "NTA\n\nKeep the kid's name. Give the kid one of the traditional names as a middle name. \n\nOne of the reasons for giving middle names is to give the kid an alternative if he hates his first name.\n\nChange your own name if you dislike it.", "NTA. It's not as if you named the kid Voldemort or something.", "NTA\n\nEveryone has an asshole, but not everyone wants to hear hers\n\nSame with opinions", "NTA - my cousin and his gf named their baby a number name (have you seen Seinfeld? It’s that name). I think it’s the most ridiculous name ever and I’m frankly horrified they actually used it, but I will never say that to anyone who knows them. The baby already has the name, complaining about it to the parents is gross and inappropriate. Your sister is way out of line.", "Cael is a cool name! \n\nNTA Traditions are just peer pressure from dead people.", "NTA.  OP's sister doesn't get a vote on what OP and his wife name their children.", "NTA\n\nI have friends who had twins. The girl is named Audrey and the boy is Declan. They're lovely names for lovely children, and Cael is, too. Not your sister's business to want to saddle your child with a stodgy name he will hate.\n\nPS—I hated my name too. It's one of the ones on your list above, and I changed it. I can't tell you how happy I am with my new name.", "TBH I don't like the name you've chosen at all but this does not change my judgement: NTA. \n\nYou are free to choose any name you like regardless of what other people think. The only one who outranks your choice is your child. The child can choose what they wish to be called when they are old enough.", "NTA. I don't see it as that unusual, and I personally like \"traditional\" names. Other than maybe a bit of confusion on how to pronounce it, it is a fine name!.", "NTA. Sure, she’s allowed to have and give an opinion. And, as you pointed out, you’re allowed to not welcome it. \n\nFrankly, I would simply respond with “I’m sorry. I didn’t realize I asked for your opinion” whenever it comes up. \n\nYou’re not an AH for not welcoming her opinion. She is one for given an unsolicited opinion though.", " Info: is it pronounced like Kale?", "NTA\nTje only ah here is your sister. AND I would like to commend you for keeping your name choice to yourself until your baby arrived... imagine months of this whole arguement before baby even got here!", "NTA\n\nCael is a great name your sister is an AH", "Did I read that right that she also straight up INSULTED YOUR WIFES NAME? \n\n“She asked my wife how she could put our son through that when she has spent 28 years with a ridiculous name” \n\nWtf you are NTA but your sister is MAJORLY one to the point I would start considering no contact.", "NTA - You can never win with family and names, names our daughter a traditional name that had been in the family for multiple generations - grandparents on both sides with the name somewhere in their name and my MIL still argued about it. \n\nI’m glad for you that you broke from tradition and did something different, unfortunate that your sister feels like she has a right to share her unsolicited opinion. If you’d gone traditional people could have been upset because you chose “that” name instead of “this” name.", "NTA\n\nThe only times it’s appropriate to comment on a upcoming baby’s name is when the parents thinking of ridiculous names like Ganondorf or Abcde. \n\nPersonally I think Cael is a lovely name and I wish you and your (upcoming) family all the best!", "Presumably you don’t live in Ireland nor are you Irish? Because that’s a really traditional Irish name - I have 2 cousins with the name and I know at least 5 others. \nSo you have named your child a traditional name just one from presumably not your culture. Tell your sister to suck eggs NTA", "Yeah, no one in our family was fond of the name my cousin and her husband named their son.  It was an old fashioned, not common name. But not unheard of.  \n\nBut not my kid, so I never mentioned that I didn't like the name.  It kind of will grow on them after a while hopefully.", "NTA. And as others have pointed out, it is a perfectly fine name, however rare. \n\nBonus note: Cael Sanderson is Penn State's head coach of wrestling.", "NTA. Everyone loves claiming free speech, but then conveniently forgets that other people are allowed to respond back to you because they too have free speech. Also, freedom of speech =/= freedom from consequences.", "ESH. You for \"cael\" and her for her inability to mhob.", "Naming a kid some unique weird ass spelling of a name is a curse and unless he is really exceptional it will be a handicap for the rest of his life.  You are the goofy ass A.", "Yup. Good or bad, it is 100% the choice of the parents what they name their kid. \n\nI think some of the more modern name trends are dumb (like chosing random words for the sake of being _unique_), but if you spent 40 weeks baking a baby and then pushed them out of your body, have at it. \n\nI also feel really bad for all of the kids named Khaleesi or Denarys who will eventually grow up and watch the final season of GOT....", "*“My name is Jageorgeson. But, please, call me Bill.“*", "I knew a woman who named her kid Sephiroth. I still feel bad for that kid.", "If he is upset about the sister opinion, he should consider she only saying what most people are kneejerking, but are too polite to say out loud.\n\nMy first thought Cael... like Kale the vegetable?  WTF would you name your kid after a vegetable.  Probably from the US, they are known for being American.\n\nedit add.  I looked it up because I was curious if there was a history to the name.  However I don't think that is the norm, and most people would just assume the vegetable.", "I'd have gone with Kefka if they really wanted that \"Genocide the whole world for a power trip\" vibe. Sephiroth was engineered for it - born for it - but Kefka had to hustle to get where he got. He really had a love of the game.", "Hopefully they go by Seth.", "He is upset cause his sister is obnixious and sticking her nos where she shouldn't. \nShe needs to shut up, not her child she doesn't get a opinion.", "NAH.  I went to school with a girl named Polly Esther... Another girl I knew, her parents monogrammed EVERYTHING! She walked around with a backpack that read \"PMS\" until she graduated from high school.  To me, those parents suck and the second one was why each name I considered for my kids, I also looked at initials and monograms.", "It's your choice, definitely worse names out of there, Ngl does remind me of a vegan smoothy though lol", "Kale? Kah-el? Cal? Seal? Cay-eel? Sale?  Sa-el?\n\nNTA.  But I wonder if parents, who go for the really \"unique\" names, ever consider that it's their kid, not them, that will have to be the one to deal with the name throughout life.   Mispronunciations, comments, \"that look\" when people hear it, constant misspellings, etc.", "As much as she is entitled to have and voice her opinion, you are also entitled to ignore her or tell her to go fly a kite. It’s not her business which name you and your wife choose for your children.", "Lol NTA, because it is your child and that is your right, but let’s be real—Cael?\n\nI can see why your sister was upset. What’s the next one gonna be? Kabbage?", "Cael like the plant? (kale?) or how is it pronounced?\n\n\nNaming a kid is a huge responsibility.  He will be saddled with that name for life (unless he changes it like you wanted to for being stuck with a bad name). \n\nSo really, NTA for sticking with what you chose for your kid, but YTA for giving them a horrible name.", "NTA! What you choose to name your child is none of her effing business.", "I love when people hide behind \"I'm just being honest\" to behave like a dick. Well I'm being honest when I tell you your opinion ain't worth shit. \n\nNTA", "Should you want your child to have options between a distinctive name and a traditional one, give him a traditional middle name.  His entire name should have a good rhythm to it.  He will also have the option of using his initials; as in C.K. … or C.G. …\n\nYour son can be completely comfortable with the options and may switch among them as he grows up.", "NTA", "Good job OP. NTA and continue standing up for your nuclear family. You are showing great love to them by reinforcing this boundary early. If the rest of your family keep acting like that, then I would encourage going LC.", "NTA\nIt is a good name, in my opinion.", "NTA\n\nWe make mistakes as parents. We're going to even after they're grown. We make mistakes unintentionally with the best intentions behind them. Your kid will decide what he thinks if his name, him and him alone. It may be a winner in his eyes. This is advice coming from a guy who named his daughter Wednesday 8 years ago, now she has to deal with the hype from the TV show. Be thankful you don't have to deal with that! We just wanted a cool name that's unique. Now I fear Wednesday is going to be the new Hailey or Aiden 🤣", "NTA as someone who usually hates weird names Cael isn't that weird and I actually kind of like it.  She is interjecting herself in a place where it doesn't belong.", "I saw a baby named A kill eeze, ( one word) \nAt the hospital I worked at,  the loser father wanted the word kill in the baby’s name", "Nta Cael is a traditional name though? It's Irish.  It's not a huge favorite of mine, but it *is* a name.  It's not like you named the kid, 'ladle'.", "NTA! I LOVE THE NAME TOO!!", "NTA. Personally, I like the name! It's really none of your sister's business. I'd tell her, Okay, you've expressed your opinion. Now we don't want to hear it again. Ever.", "Honestly I love that name. I too have one of those names listed as both a first AND middle name. So I get where you are coming from. \n\nNTA", "NTA\n\nNot for this name. There are a few names that should be called out. The person who named their kid \"Asshole\" (not pronounced like written). Or like a joke I once heard. Don't take names from the cookbook.  Some one should have called out Frank Zappa on MoonUnit. \n\nThe sister is not entitled to insist on her 2 cents here.", "NTA - no one is entitled to an opinion except you, your wife, and eventually your son. As someone who hates my name, I agree it’s a crapshoot and you need to pick something you like, that won’t get your kid into trouble, and then also be okay if they want to change it later. Everyone else needs to shut up about it.", "I know someone names Cael and I never heard him being made fun of for it. It’s a normal name. Also none of your family’s business. NTA", "She’s entitled to her opinion. You are entitled to ignore it. NTA.", "NTA.  She stuck her nose in when it wasn’t asked for nor wanted.  \n\nIt’s a very beautiful name. Cael will like it!", "NTA", "NTA", "NTA\n\nYour child, your naming rights. But also, that kid (and you) can change his name in the future if he truly hates it.", "NTA\n\nRemind your sister, opinions are like assholes. Everyone has one, but they're best kept to yourself.\n\nIt's not like you named your kid Mailbox or Hailstone or Beeblebrox. Cael is a name, and a traditional one at that, just not from the set your family is used to. \n\nAnd we all noticed that she is assuming there's something wrong and traumatizing with your wife's name, too.", "NtA \n\nmy name is Mael and i seriously love it and always have. It's very unusual where I'm from and even tho you pronounce it exactly like the individual letters are pronounced in my language, people say it wrong the first couple times alllll the time, but I couldn't care less. \n\nI think it would be different if you named your kid something like KIIIVlyn (as in Kaitlyn but with the Roman numerals for eight - a name I've seen). like, I feel like that's a different category of \"unique\" name \n\nalso, your sister doesn't like the name, good for her, she doesn't have to name her own kid that. it's super rude of her to say those things to you and your wife, tho", "NTA - Cael is a beautiful name and it won't impact negatively your son's life. Your sister can have an opinion but forcing it on you is a huge no. And she was super rude about it : \"She said it's not a name, it's wrong to break from the tradition, she asked my wife how she could put son through that when she's spent 28 years with a ridiculous name.\" I'm sorry but she outright insulted your wife and her parents. \nAnd no, traditions can be broken, especially since you've founded your own family now. What matters is what you, as parents think as long as you don't do something disrespectful or set your child up to failure. \nThank god you didn't reveal the name beforehand.", "1) She's wrong. Cael is a name. I could link half a dozen notables with it, but I'll leave you to google that on your own.\n\n2) Colleen wasn't a name on record in the United States until the 1950s or so when an American woman remembered an Irish grandfather calling her his little colleen and liked it enough to name her child Colleen. It wasn't until they made a trip back to Ireland and introduced their daughter by that name that they found out it just meant \"girl.\"\n\nNow THAT's a name fail, but Cael is not. I chose Tadhg (properly spelled Tað) as my son's middle name to honor an ancient ancestor of that name. Just because there hasn't been a member of the aristocracy with that name doesn't make it any less a name.\n\nNTA", "This right here. You are totally NTA. Sis is a busybody who has no say here at all. Unless you chose to name your kid Xaiquiri (rhymes to daiquiri) of course. Then all bets are off.\n\nEDIT: Damn, looks like the post has been deleted because it was fake: [https://www.reddit.com/r/tragedeigh/comments/xo1xar/xpost\\_with\\_ops\\_permission\\_xaiquiri\\_pronounced/](https://www.reddit.com/r/tragedeigh/comments/xo1xar/xpost_with_ops_permission_xaiquiri_pronounced/)\n\nEdit 2:  I'm actually fine if someone wants to name their kid Xaiquiri, but that post and the comments that followed were truly entertaining. Hence my mentioning it, but its been deleted, oh well.", "Agree with this.  If the child could be teased about the name, speak up.  Otherwise, let the parents name the kid what they want.\n\nI have a difficult to spell/pronounce last name.  You get used to it.  It's really not that big of a deal.", "NICE!  That's deep...", "OP is NTA. But I am curious..is this name pronounced like “Kale” or “Kyle”?", "If our school that kid would be nicknamed Curly... just saying.", "Can sand get pregnant? Because sand being bang-able is news to me. \n\nAsking for a friend.", "Gives a whole new meaning to family tree. So would that make OP just a regular branch?", "Cael is a pretty common Irish name. I've seen it around a ton, so....", "I guess Diana is forbidden then, too.", "> Good or bad, it is 100% the choice of the parents what they name their kid\n\nThat depends on where you live.\n\nMy middle name was forced to French spelling despite being name for a grandfather who had the English spelling for that name because I was born in France.\n\nThere are some countries with fairly strict naming rules and very little appeal if you attempt to register names that don't follow them, Iceland (if I recall correctly) being one of them.", "Google says it's more like kayl or cale", "Cah-El. Like kryptonians.", "I'm Spanish, so... I pronounce it the way it should be in Spanish. Which is probably wrong. There is a page on Irish phonology on the wikipedia but...", "I'm crying cos a youtube video told me it was pronounced see-ay-ee-el\n\n\n\nETA: NTA, tell Bernie to mind her business", "The regular branch anyway. Stick in the mud is an old phrase meaning boring person as in' their about exciting as a stick in the mud'", "Boom Boom!!", "Maybe the next one you can name Spinach.", "A friend from highschool named his kids Sora, Riku, and Kairi. \n\nI feel bad for them. But not as bad as I feel for sephiroth.", "My brother and his wife had a name picked out for a son they might have in the future. Thankfully he's decided he is happy with the three he has and doesn't want any more. Why is this *thankfully*, you ask? The name they picked out was: Knight Shadow. Smh", "I know a guy who named his son Ragnorak. Not Ragnar. Ragnorak. He named his kid after the Norse pantheons apocalypse.", "Me too!", "A noble name that will embiggen the smallest man.", "That's the best description I've ever heard of those two.", "This sounds like a writing prompt", "When I hear Kairi I personally think of the one from Myth Busters, so hers isn’t that bad at least?", "NTA I mean Cael is an unusual but it’s not even weird or anything.", "NTA. People are only entitled to give their opinions when asked, standing up for themselves, or voting.", "Names seem to be a sore spot for many who feel like their opinions should be heard when it doesn’t concern them. I’m my family they all fight over who can have the most unique name and also outlandish. I think I threw in the towel when I heard one call their daughter I kid you not “Divine Heavenly Bleu” like the cheese… yes. I don’t give my Two cents to them. It doesn’t affect my life anyways", "NTA but your kid will hate you and change there name", "NTA only the parents' opinion really matters when naming the child", "Wow, your sister insulted the names of your nephew and your wife, *and* you and your wife’s judgment and decision making all in one go. And then hypocritically called you an AH for putting up a reasonable boundary. What a master class in a-holery!\n\nNTA", "NTA tradition is just a shitty excuse to continue doing things. I think Cael is a very cool name. This is speaking as person who has 3 first names and none are very original.", "Maybe Carl then. After the Swedish king from the house of Bernadotte", "NTA \n\nCael is a different but not extreme name. My name is unusual but not uncommon, even where I live. I learned quickly that not being another Sarah 3 in my year at primary or Michelle 5 in my year at secondary, was a gift to me.", "NTA obviously - Nigel in Australia means loner with no friends. You do you.", "NTA. It seems like she was unwilling to back off until you got a little more aggressive about it, and that's only on her. Unless you're asking for her opinion, she's not entitled to give it.", "Nta, I knew a woman with the name Karma", "NTA, it's not her child.  Also, Cael is a great name.  Congrats on your son!", "NTA, your sister sounds toxic. It’s a beautiful name btw.", "NTA, Cael is indeed a name, and a nice one. \n\nAn unusual name makes life easier, just on a practical level.We currently have 4 people named \"John\" at my workplace, and it's a pain. They're constantly getting e-mail meant for a different \"John,\" and everybody has to constantly specify which John we mean when we're assigning tasks or explaining who to go to for things.  It's hard on kids in school, too, when there's \"John B.,\" \"Other John B.,\" and \"John D.\" Everyone I know who has an unusual name is happy with it. \n\nOh, and OP, I have a friend whose mom wanted to name her a very unusual name, but got talked out of it. When my friend got to be old enough, she changed her name to the unusual name her mom had originally wanted, and is thrilled with her new name! It's *your* name, you can change it to whatever you want!", "NTA\n\nYou are 100% correct. Your son’s name is 0% hee business and she’s rude to comment on it. \n\nI don’t like any of the names my brother picked but he will never know that because it doesn’t matter!! I love his kids, he and his wife are great parents. That’s what is important.", "NTA\n\nCael sounds find to me.\n\nThere are definitely awful kids names out there. But generally people should mind their own business when it comes to babies names.", "NTA - I like the name Cael.\n\nReading posts like these I’m always scared the baby’s name is going to be x1245$ or braydhun.\n\nThat’s a fine name and your sister can get lost", "Nta, we named our son theodor and call him teddy as a nickname since he is not even a year old. Our families won't stop making comments about how he will be getting bullied. My sister even asked us once whether we couldn't call him theo or theodor when they are around since they hate teddy. No, we won't. What's funny is that outside of our family everyone loves teddy for a baby. So call your son whatever you like to for as long as it is reasonable (please don't call him Satan) and just be proud of him. He is your son not your sisters", "NTA. It's absolutely a name. Cael was one of the Fianna, so it is an old name, and not a ridiculous one at all.", "NTA", "NTA, you hit it on the head.  She's putting her nose where it does not belong.", "NTA.\n\nYour family with their new-fangled names, when YOU, sir, chose one with truly ancient origins. How dare they pretend THEY are the traditionalists!", "NTA Hey, it's an old Irish name, and it's lovely. He is going to spend a lot of time explaining that he's not called Kale when he gets older, but I'm sure he'll cope.", "NTA, but yeah. I'm just going to think of the green lettuce type stuff that tastes like shit when I first hear it.", "NTA. 1. She's being the asshole. 2. Cael is not that crazy. I've known 3 Cael's and they were all lovely men.", "NTA. That's a pretty bad name but you're allowed to call your kids whatever you want.", "Lol people gave me so much shit for my middle child’s name, but she loves it and she already knows, if she ever wants to change it that’s okay! Sometimes we grow out of the names our dads and moms give us, no big deal :)", "NTA. Your sister is entitled but not in the way she thinks. Her opinion matters absolutely zero on this matter. Congrats on your baby!", "NTA - Sister needs to butt out and shut up.", "NTA it's between you and your SO what you name your children no one else. \nAlso if you hate your name change it, ask people to call you by the name you want. I have had more than one person in my life ask to be called by a new name and I've never made an issue out of it. And if after a while you feel like yourself with your new name change it legally.", "NTA, and many congratulations on your wee one. His name is beautiful, as he is, do not let moaning myrtle tarnish these early months, precious times. Sis has no right to keep banging on about something that’s not going to change and is none of her business. If she still insists on brow beating you tell her it’s not appreciated and you will go LC if it goes on.  Sheesh some people can’t see the wood for the trees, an amazing new life is here. Celebrate it. Sighh. X", "NTA she was being rude and over the top about it.  Personally I lean towards traditional names, but this is your child, and your choice, and I don't think the name is even all that strange or off putting.", "NTA, and it's none of the rest of your family's business what you name your child.  And for the record, Cael is a very traditional name from Irish mythology, and it's possible it's been around as a name for longer than some of the so-called real names your family uses.", "NTA\n\nNames are weird, and honestly thinking you'll be grateful for a name when your older feels stupid, there is no way to know if anyone will like there name when they grow up.\n\nMy name is Matthew and I have met so many matts. I was on a team once where there were 7 of us. I heard my name called all day and I hated it. I moved to a different department, and there were only 3 Matt's on that one... We all shared the same birth month and two of us were chubby blonde dudes with the same initials. So I hate traditional name trends, but I actually like my name.\n\nMy wife has a unique name that's also an old Irish name. It means sad and she hated it growing up. It was always spelled or pronounced wrong by teachers. And kids made fun of her for it. She has grown to like it but it took a long time.\n\nI am curious what your parents thought about it tho.", "NTA \n\nAnd your sister is mistaken. She is entitled to HAVE an opinion. EXPRESSING one is a mater of etiquette.  Expressing yours unasked for is grounds for receiving snarky replies. \n\nHaving the ability to do a thing does not mean it’s the best idea to follow through.", "It's not some crazy make like so many today. I have a friend named Cale, in fact, and he's in his 30s.  NTA.", "NTA.  I have a Kael too! I loved the movie Willow growing up and would have an Elora too if I ever had a daughter.  Your sister sucks.", "NTA it's a very old Irish name, so pretty old fashioned if you live in Ireland, so tell your sister you have followed tradition", "NTA", "You are NTA for naming your child a name that you like. If he doesn't like it, he can change it when he's older. \n\nYou can change your name too. I've been talking about changing my name since I was a teen too, but I was also talked out of it. I just changed it last year--at 40--and I really wish I'd done it sooner. I enjoy introducing myself to people now, and it's starting to reshape my personality. I'm more outgoing and confident, and I'm starting to find myself. Maybe you'll feel differently in your 30s, but maybe you already know how you feel and you're allowed to trust your own feelings more than the predictions others hand you of what your feelings might be in the future.", "NTA - but your sister is super entitled, isn't she?  Does she actually think she has any weight or bearing on how your name your child or how you raise it?  \n\nYou don't have to justify anything to her.  When she sticks her opinion in it, just say, \"Thank you for your opinion, we will take that under advisement.\"  If she repeats herself, say, \"Thank you, I heard you the first time.\"  That is the fastest way to shut someone down who can't stop trying to control another person with their \"opinions.\"", "NTA, but I will say this, with a name like that your son is up for a lifetime of people mispronouncing his name. Remember he's the one that has to live with it.", "NTA. Your child, your choice.", "NTA — it’s a great name, super cute!!!", "ESH\n\nr/NameNerdCirclejerk", "NTA, and Cael is a great name.", "NTA.  She is entitled to have an opinion on your personal matters, she is not entitled to express that opinion.", "Lmao one of my mates is named Cael and he’s rad. World needs more cool Caels.", "She maybe *entitled* to an opinion, but she isn't *entitled* to express it and you are certainly *entitled* to tell her to keep her mouth shut and that her opinion has been noted and disregarded!", "Tradition is shorthand for expectations from dead people", "To elaborate a little more on this with my own two cents.\n\nHer opinion wasn’t asked for and definitely wasn’t an opinion based on the way she started to fight against your choice as well. Certified Grade A butthole behavior and you are definitely NTA for standing your ground. \n\nHell the name isn’t all that bad either imo, but what I think don’t mean a thing against what you want", "Quite a few countries put the right of the child to have a proper name that doesn’t lead to bullying etc. higher than the right of parents to name their kids anything.\n\nIn Germany every name for a newborn will be checked by the authority that registers births, marriages and deaths. They can and sometimes will deny a name.\n\nThe rulings are getting less restrictive but a lot of names from the US wouldn’t be allowed here.\n\nOP is of course still NTA", "Exactly, OP needs to set a boundary that the family is entitled to their opinion but if they are expressed time with his family will be limited", "I agree NTA... but as someone with an Irish name living in North America, he may have to deal with no one ever calling him his actual name. I respond to anything that remotely sounds like my name now because almost no one pronounces my name right. It won't be a detriment, but it's annoying as hell. For example, I know always when my Starbucks drinks is ready because of the instant confusion on that baristas face.", "Also comes with a hefty does of peer pressure from live people. My dad died when I was 16, when I was having my first kid my dad's extended family was so mad I wasn't considering his name. We have enough Michaels in our family! There's so many! \n\nI didn't opt for any family names. My uncle called my eldest \"Michelle\" for 6 months because he was mad about it. We don't talk to him anymore, for many reasons.", "Hahaha I came to the comments to say exactly this about peer pressure and dead people.  Well done.", "Exactly. I love a first - middle combo that has meaning because they are based on my grandmother and father’s names. But the initials would be MEH. Not going to do that to a potential daughter. And I don’t want to switch them. So we have another middle name picked instead. \n\nThere are lots of other considerations too - we won’t use a name (full or nickname) that starts with A because when written with just the initial and last name, it is too close to “Ahole” to want to saddle an actual person with it. It’s such an important decision and (hopefully) these potential issues are taken into consideration. But ultimately the parents always have the final say. I might think “WTF” to myself about a name, but would never be outright critical to the parent about it! OP’s sister needs to stay in her lane.", "Quote from other commenter:\n\n>Cael is an ancient Irish name, and perfectly valid. Just because there's a Fianna with that name, doesn't mean it is only from mythology.\n\nNTA", "Quote from other commenter:\n\n>Cael is an ancient Irish name, and perfectly valid. Just because there's a Fianna with that name, doesn't mean it is only from mythology.\n\nStop being ignorant. NTA", "This.  NTA.", "What???? I know of a family that has like eight kids (maybe more now,) and they all have wild “goth” names. One of them is Sephiroth. Another is Senester. I can’t remember any others, but they are all doozies.", "That’s a Halloween costume already sorted, and comes with its own music too!", "At least that kid's got a couple of passable nicknames they can go with:  Seph or Roth.", "Just decided on my son’s name, thank you.", "I still have childhood trauma from that game. 😂😂😂 I legit restarted the game when he took out Aerith because I thought I did something wrong. I haven't played the remake (since I have an aggressive work schedule and can't add another bad habit on top of reading AITA all day during my many useless meetings 😂), but I still side eye Cloud. Stole Zack's whole entire life.\n\nZack deserved better, but went out in the most savage way ever. 😂 I haven't played that game and Crisis Core since I was a legit little kid, but I'm still big mad how they did my boy.", "An oldie but a goodie:  [https://abcnews.go.com/International/story?id=82471&page=1](https://abcnews.go.com/International/story?id=82471&page=1)\n\nBut man, I've had a hankering to name a child \"tire of miracles\" for decades now...", "Add in all Biblical names too.", "Sephiroth is not fit to clean the sand off Kafka's boots.", "I went to school with a LOTR kid and several with ‘unique’ names from combining parts of the parents names (Fred and Jamie =Framie). They either went by middle names or nicknames and the first boy changed his name as an adult.\n\nParents should think of how their kids will feel in the when picking names but if it’s just a name you don’t personally like then no matter", "Is your friend Japanese?\n\nAlso setting aside the obvious issues with naming kids after famous and recent pop culture, it's gross that he named his kids after a trio that includes a romantic couple.", "I named a cat Kairi.", "I like those names. I have a made up name. I've never met anyone else with my name. I like my name. People usually mispronounce it when they first meet me but usually get it right after I say it. It has never bothered me. I am an artist and I like that my name is unusual. I think it looks nice on my paintings.", "Final Fantasy 10, right? I feel those are **now** obscure enough that only the gamers whose knees now hurt may remember. I don't feel like FF9 & FF10 & 10-2 has transcended generations like F7 (and maybe 8) did.\n\nEdit: Self corrected. I was wrong. Those names are from Kingdon Hearts..... Bless that man's heart. 😂😂😂😂", "Ragnarok?", "[removed]", "The one that works the best I think is my cousin and her parents. \n\nBrian + Deanna (Dee-Anna) = Brianna", "The one from MythBusters is Kari, not Kairi. Spelled and pronounced differently.", "Nope. He’s half Mexican half Spanish. His kids mom is white. And he looks white. \n\nSo the kids are just white kids named after a video game love triangle.", "He named his kids after a kingdom hearts love triangle. \n\nI know his kids get made fun of. Just cause you like the names doesn’t mean it’s appropriate to name white children after Japanese romantic partners", "You haven't been playing GOW have you?", "He’s probably responding to the misspelling, unless the kid’s name is actually spelled ragnorak, not ragnarok.", "Wow, I sympathize with you on multiple points. Hated my first name growing up and would only use the shortened version of my middle name. Even now, I’m not overly fond of my first name.\n\nAnd I got the same kind of flack as you for my sons name from my mom and some old biddies in the supermarket. His name is Tyran. I named him after the Tyrannosaurus Rex. Conveniently, I’ve found out it was already an established name, just very uncommon.\n\nI think it’s important that you and your partner like the name and are open to your kids opinions on the name as they grow. Other than that, tell others to go suck a rock, it’d be more useful.", "NTA.\n\nYour sister can name HER son what ever she likes, (Kenneth Patrick or Patrick Kenneth maybe?), and on the same vein you can name YOUR son whatever you like. Simple really.\n\nAlso, I love your son’s name, it’s lovely, I’ve never heard it before.", "NTA she is. Cael is a cool name. The birth of a super hero.", "NTA.  You sister is entitled to her opinion but that does not give her the right to voice that opinion when she knows it's not wanted.", "NTA,  your not entitled to act on to your sisters entitled comments on your sons name.\n\nCongratulations on your new born and wishing your family the best", "NTA -and she better get with it before she’s telling little Cael that she’s sorry he has a weird name and should have been named Patrick or Kenneth. She’s welcome to name her children whatever she would like.", "NTA. What a great warrior name.", "Nta. He is your son, you get to name him whatever you want. No other context necessary. Your sister needs to stfu lol. Also Cael is a hella cool name. 🤘", "NTA.. also Cael is beautiful", "NTA\n\nTell your sister to kick rocks. \n\nI use to coach a kid named Cael and they were the sweetest, kindest, most hard working kid I’ve ever coached so I only have good associations with the name", "NTA.  I don't understand why you're even entertaining her arguments about this.  This has been going on since November?  It's long past time to cut contact with her until she can learn some bloody manners.", "Long story short, sir you are not the AH.\n\n its none of her business what name you choose for your son/daughter, no one should ever have a say in that except you and your wife and thats it, they can give you some ideas IF YOU ASK FOR THEM.", "NTA. No one gets a vote on your kid’s name but you and your wife. Why can’t she just talk about you behind your back like a normal person?", "NTA\n\nAs someone with an Irish name, points from me for the old-style Gaelic name~", "Cael is a name. Irish/ Gaelic origin. So not does her opinion not matter at all, she is literally wrong that it isn't a name.\n\nGood for you and partner for choosing a name you like. Who cares what your family thinks. \n\nNTA", "NTA. It looks a reasonable name is it pronounced kay-ill", "NTA. Your sister is OVERSTEPPING. She dont have to like it but there's exactly squat she can do about it. I would tell her to stay mad.. and she dont have worry about it bc I wouldn't take my child near a hateful person that is supposed to be a loving aunt.", "NTA\n\n>My sister has been seriously outspoken on the name. She said it's not a name, it's wrong to break from the tradition, she asked my wife how she could put son through that when s**he's spent 28 years with a ridiculous name**.\n\nCael is an Irish name, so I presume that your wife's name is also Irish? \n\nAnd that your sister is a pretty monolingual English-speaker?", "Like…. Kale????\nNTA but it is weird if that’s how you say it lol", "Nta. I think what you said about having a traditional name and still hating it is very astute.", "The only one who has to like the name is your kid. If he doesn't, you'll definitely hear about it in  5-7 years. NTA", "Well, this is bizarre. \n\nYTA", "NTA. I hate that excuse 'I'm entitled to my opinion'. Like yes, you are but you are not entitled to share it where it hasn't been asked for it. Period. Full stop. Especially after being told you don't want their opinion. I have 2 kids and am pregnant now. My first was named after his dad so he got a normal ass name but my second is Niklaus and my third will be Itachi. Not normal names and people always question where the names come from and have something to say about it but as soon as I tell them it is what it is, they stop. Like the audacity to continue offering your shitty opinion after being asked to stop is beyond me.", "NTA.\n\nHorrible name, but NTA.", "NTA.  I happen to like that name. I do come from a family of traditional names but I also come from a family of old country names or names that reflect our heritage. So lots of Scottish and French names. And while my grandfathers offered input on my name (only child to be named after my late grandmothers) they were not the deciding factors. Stick to your guns. As I said, I like that name and it's a strong Gaelic name. Congratulations!", "NTA. You did nothing wrong in the slightest. Your sister was way out of bounds and she needs a reality check. The parents name the child, it's really that simple. She's allowed to think whatever she wants to about the name but she seems to think she has the right to object to the name you and your partner chose because reasons I guess? Hopefully she will have gotten over this by the time your child is a lil older. It would be a very sucky thing to tell a child that their name doesn't fit into their family.\n\nAs someone who also hates their name, I'd just like to say that Cael sounds like really cool.", "NTA. When your family brings up “tradition”, tell them your wife’s family has a tradition of having the parents name their child a name they like. \n\nAlso Cael is a cool name. I know a Kale. (Assuming it’s pronounced the same).", "Wait… so she insulted your name idea while also telling your wife that she has a stupid name? The nerve!\n\nNTA", "You're 100% correct, it is only you and your wife's business what you name your child. I'm just hoping it's not pronounced \"Kale\". Kids can be pretty mean 🤷‍♀️", "NTA, but also out of curiosity, is it like kale with one syllable, or like kah-el using 2 syllables? Honestly I love both, just wondering, and it's your business what you name him, not anyone else's.", "NTA. 1. It's nobody's business what you name your child. 2. Isn't Cael a very traditional Celtic or Gaelic name? So if they are so for tradition, throw that in their faces while you tell them once and for all to fuck off.", "NTA. Your sister can have all the opinions she wants, but she doesn't get to belittle and harass people with them.", "NTA", "I HATED my name growing up.  Not only was it old fashioned but I was the 3rd (my dad being Jr.).  My mom didn’t want to name me after my dad but relented in the end.  At 19 I legally changed my name to what my mother originally wanted (my middle name still honors my dads side of the family).  At the end of the day you can change your name; your son may some day choose to change his name.  Just because someone chose a name for you doesn’t mean you need to keep it for life.  So, you’re NTA.  Your sister, however, is one and should keep her opinion to herself.  When she pops a kid out she can name him or her whatever she wants.", "OP, NTA. \n\nYour sister got it half right when she said she was entitled  ~~to give her opinion~~", "NTA. She offered her opinion once, and then she should have let it go.\n\nThere’s a naming post from AITA not too long ago.  Your situations only share the similarity in that a loved one (your sister/that naming post’s OP) expressed a concern about the name of the new baby. My opinion on that is the same, that OP is NTA for bringing up her opinion about the name *once* and then letting it go. If I remember correctly, OP let it go and didn’t bring it up again until the parent asked her because OP’s concerns came to light. [link here](https://www.reddit.com/r/BestofRedditorUpdates/comments/ycf4yq/aita_for_raining_on_my_cousins_parade_regarding/)  That’s what your sister should have done. She should have let it go.  She’s an asshole now for overstepping her boundaries.", "Nta. Fun fact- my nephew's name is Kael. And I've heard of quite a few. It's not \"old person\" traditional, but it's becoming more common. That's why the \"top 100 names\" list changes every year, people's tastes change.", "NTA- Cael isn’t even that out there, and honestly some of those old fashioned names are awful, I know so many elderly people who even hated their own name so much the chose other names to go by", "Cael is a great name. NTA.\n\nI did a pediatric intern year, and some of the names I saw... Interesting choices out there.\n\nThere's a lady from Wisconsin named Marijuana Pepsi (first as middle name) She got a PhD and wrote about naming cultures.", "Problematic as most will think Kale", ">You can't get more traditional than that. \n\nRamses is also a good name.", "I thought that sounded Irish.", "Dependsnm on what wife's name is and whether or not she complained about it.", "Yes, see comment above", "That's not really fair to OP though. How can he explain why he thinks his son will like the name when literally no one can predict what their kids will like? You pick a name *you* like and hope for the best. That's what everyone does. I have a different name and I love it. There was no way for my parents to know if I would or not so they picked a name they loved and thankfully I love it too. As long as OP doesn't guilt trip his son in the future if he happens to want to change his name, then he's NTA.", "Believe it or not, there are people with different / interesting names that love their names and don't view them as a handicap. I happen to be one of them.", "OP makes it sound like this has been going on since the baby was born in November.  It's long since time to cut contact with obnoxious sister until she learns some manners.", "I would hate to live in your country. My name is in Greek mythology and I love it.", "There was young girl in New Zealand who had to sue her parents to change her name from ‘Tula does the Hula in Hawaii’. She was around 11 years old and when the judge awarded her the right he told her parents an 11 year old shouldn’t have more sense than grown adults.\n\nThis was back in the 90’s but I’ve never forgotten it.", "Xaiquiri is a Chinese name. 霞秋日. Let people name their kids.", "I keep reading it the way Cartman says Kyle on South Park. Lol", "I like it spelt like this and I know a Cale (spelt this way but I assume it’s pronounced the same).  He doesn’t hate his name and nobody said squat to his Mom when she named him.", "I'm a huge Sephiroth fan and would never.  What is with people naming their kids fandom stuff?", "This thread has tickled me. Im gonna now name my future imaginary kids like FF characters. In addition to little Squal, Laguna, and Raine, I'm gonna perhaps add an Ocean, River, Spring, and baby Sprinkle. \n\nGuess I gotta ditch them kids and ship them off to a military for good measure, too.", "Denmark has very strict rules and regulations of names as well. \nNames like Judas or Lucifer is forbidden but also names without any obvious negative “undertones” like Po, Bandito or Petit. There is an official list of approved names and you have to seek permission from the authorities if you wish to use other names or change the spelling of an approved name. \n\nLast names are also regulated although not as strict. But if less than 2000 people in Denmark is named a certain last name it’s considered protected. \nThis means that if you have no family connections to a person bearing the protected last name (think child/spouse/stepchild/foster child), you have to get written consent from ALL of the people above the age of 12 bearing that name before you can take it yourself!", "That's what I thought. \"Ahhh, Superbaby\"", "If it's Latin based (I don't know about the Irish one mentioned, and OP didn't mention it so I kind of don't think they go it there), the Latin root cael is the same one that became the word \"celestial\" and the Spanish work \"Cielo\", so it would be understandable to choose to pronounce it with an S sound.  It's not actually the Latin word, which would be a k, but a derivative of a long legacy of words that have a mix of S and K pronunciations.", "Sora, Riku & Kairi are all real names...\n\nSephiroth...not necessarily the energy I'd want to expose a kid to...", "🤣🤣🤣 that's what we named our dogs! Except we went with Sora, Kairi and Roxas instead of Riku lol", "&#x200B;\n\nThose are all legitimate names, but I hope for his sake that he or at least his wife is Asian.", "What accurate descriptions of both FF villains.", "Zack's death in Crisis Core was so sad. Even though I knew it was coming, it was still tragic.", "[Talulah Does the Hula from Hawaii](https://www.cbc.ca/news/world/talula-does-the-hula-from-hawaii-9-gets-court-ordered-name-change-1.745238) is the classic I remember.", "lolololol @ Framie just wtf lololol thanks for that at the end of the work day.", "Nah it’s still bad.", "I named the family dog Kairi and my current dog is Milla from Tales of Xillia.  \n\nIt's become a tradition for me!", " Kingdom hearts 3 came out like a year ago. Everyone and their dog knows those names….", "Dang, you guys got me, I had to go look it up. I thought y'all were talking about the mystical Kabbalah and the Tree of Life ... srsly.", "Sure, because Brianna/Breanna is a name. \n\nSome of these portmanteaus that people use are horrid. I can’t decide if I hate stupid names spelled reasonably (like naming a kid Apple) or reasonable names spelled stupidly (like kreey8tyveleigh spelling Kaitlyn as KVIIIlynn or Lucas as Luykacs).", "They are perfectly fine names. If you know of people making fun of children,  perhaps you should say something to stop it. Usually bullies stop if even one person calls them out.", "I added an edit before you commented. It's a fun lighthearted thread. I get that you know your gamer knowledge, but chill. 😂😂", "I think you misunderstood my comment, I wasn’t arguing.", "I think I would have to say the reasonable names spelled stupidly is more annoying, because the name will,sound the same as the traditional spelling but that poor kid will always have to spell the name out for other people. And will never find a keychain with his/her spelling of the name on it.", "Children are not billboards for their parents fandom", "Lmao no they don't and children are not billboards for their parents fandom", "Perfectly fine names for Japanese kids. Not so great for white kids with a Hispanic last name. \n\nYou know how I know they aren’t great names for these kids? None of them will answer to their real names. And all go by their middle names.", "Nah man. I was meaning to point it that their name sakes will never fade into obscurity at this rate. Those kids are gonna be free. They’ll be 50 years old and kingdom hearts 27.8 remix over sleep is gonna come out remind everyone their parents are weebs.", "You mean like the dude naming his kids after actors who played Robin in the Batman movies? And who lied about a dead relative to get his wife to go along?", "You are entitled to your opinion about the names but research shows that bullies do frequently back down if called out by an outside party. Bullies are usually the biggest cowards. The problem is that people do not intervene- they say nothing.", "OK super you win.", "My son's name is Cinna like cinnamon  my wife chose it, and it grew on me. When he was born the name seemed perfect for him so we kept it. We got alot of weird looks and asked \"what does that mean\" from family and friends but everyone now thinks it was the perfect name for him. Your not the asshole, your sister is kinda a asshole for being so agenst the name you picked like it matters to her in the least bit.", "Meh NAH I blew up at a goth artiste who announced that she was naming her son Satan. You're welcome, Atticus.", "NTA. It’s your son and Cael is better than what a lot of celebrities have named their kids.", "Your child, your business. Everyone else needs to butt out. NTA.", "NTA and I do think that sometimes parents should be stopped from their preferred names. Usually when it is a swear word or a slur and yes that happens. However what you chose isn't even that unusual, I've heard it before, and isn't offensive. I doubt it is even different to the level where the kid would be bullied in school. So your sister can keep her opinion to herself.", "NTA. I coached mini mite (3-6 year old) hockey a few years back, and one of the sweetest boys on my team was Kael. \n\nOne thing I noticed with those kids is that there were very few repeat names. I was born in the late 70s and parents obviously didn’t have the internet when naming babies, just naming books and word of mouth. So there were always like 3 Michaels or Kellys or Jennifers in a class of 25 kids. We would have 60 mini mite kids on the ice and no repeat names. Maybe a Jackson and a Jaxon. So, when everyone’s name is “weird”, nobody’s name is weird.", "NTA, your sister's opinion was not solicited and therefor should have been kept to herself.", "Nta", "The only problem he might have is finding a miniature license plate with his name on it NTA", "NTA\n\nShe offered her opinion.  And after you told her you were not interested, she insisted on giving it over and over again.\n\nIt's not her place.  And she was an AH for continuing to push her opinion on you after you made your boundary clear.", "My mother's family always used biblical names (John, Peter, Judith, Ruth, etc.) When I was born in the early 60s my mom chose a slightly unusual  victorian name for me. Something similar to Minerva. Her dad took her aside and asked her if she had become a hippy or had joined a cult (the same thing in his mind). But despite not understanding the departure from \"normal\" he didn't try to talk her out of it or ever made fun of my name. He understood it wasn't his call.", "Sister was an Asshat.  NTA", "If it was something stupid like Musk and Grimes’ kid name I would say you’re an AH but that’s a regular if not super common name. NTA", "[removed]", "NTA people are welcome to have their own opinions, they don't have an immutable right to share them whenever and with whoever they want.", "NTA. She can name her kids whatever she wants. This is your kid and your feelings are infinitely more important than her opinion will ever be", "Nta, but did you discuss this with the 3 day old (eyeroll).", "NTA, but Cael does sound like the vegetable??", "NTA. Unless a child is being named something outlandish like “Mushroom” you keep your mouth shut except for saying “that’s lovely congratulations!”  And even in the case of Mushroom you can’t do much about it anyway so just shut up and then be supportive of the poor kid.", "That’s an awesome Gaelic name. She needs to mind her business", "NTA. She's right, she is entitled to her opinion. She is *not* entitled to an audience to force it on.", "NTA. Cael IS a traditional name. In Ireland.  That certainly counts.", "NTA: I have a weird name, my husband has a common name. We both grew up hating our names, I now don't mind my name, it's better then what it could of been, my husband still hates his name.\n\nHow one feels about a name is incredibly personal and I'm sorry you don't love yours. I hope your poor child doesn't start having negative feelings about their name because their Aunty is a arsehole.", "NTA! \n\nIs anyone else sick of other people trying to tell the parents what they can and can't name their kids? Unless your the mother or father (or adoptive mother and father) then keep it to yourself.\n\nMy ex MIL told me that any daughters ex and I had would have the middle name Rose. I told her outright no and unless she was going to carry and birth any of our future kids then she wasn't name them what she wanted but if I was doing the heavy lifting then I or ex would name them. This lead to an argument because apparently \"it was decreed by his great grandmother!\" (Yes she said that and I laughed so hard). Jokes on her we didn't have kids at all and the daughters he already had disowned him the first chance they got so now she has no grand kids with that middle name!", "NTA. I worked with a guy who named his son \"Doc\".\n\nTalk about a lifetime of Snow White and dwarf jokes. Thanks, folks. \n\nBut if your son hates his name at 18, I'm sure you'll understand. And let him change it to William.", "INFO: are you or your wife Irish? If not, that’s a silly thing to name your son.", "Oh lord. There’s a street near me spelled Kail.", "NTA", "NTA. My advice is that rather than explaining to your sister why you decided to name your child the name you wanted is just to tell her to shut up whenever she brings it up. The more you explain the more she feels entitled to give you her opinion.", "Cael is a traditional name... Just an old fashioned Irish one that sounds lovely.\n\nNTA", "NTA, and honestly, she’s not entitled to give her opinion, and it’s not important. She can name her kids Kenneth and Florence, and I’m sure you won’t say a word.", "It's your kid but my sister is 0-2 with names and I refuse to call either by there names.  I call one renny and the other lucca.  Do what you want but I too will do what I like.", "From the OP's description, I was thinking this name would be some white Instagram mom nightmare. But Cael is of Irish origin, and means slender. It was in the top 1000 boy names for babys born in the US between 2002 and 2012. Sure it's not as common as Elizabeth or Patrick, but it's not like the OP is reinventing the wheel here either.", "I am sure I will be down voted but that is okay. I disagree, I think you have a duty to warn parents about abhorrent, or abhorrently spelled, names if it is not already too late (if it is on the birth certificate, it is too late, except I guess for incredibly terrible names - nothing comes to mind). \n\nBut that is for a tiny proportion of names and certainly doesn't apply here. It is a nice name OP. But once you have told them once and explained why then you need to keep quiet. I do think that trying to prevent a child from having a lifetime of misery is more important than the parent's feelings, but this only applies very rarely.", "NTA. Not her kid, not her call, she’s being the asshole here. If the kid regrets or doesn’t like the name, it’s your issue with him.\n\nAnd no, no one is entitled to an opinion. There’s a whole philosophical discussion on it.", "Yta for choosing cael. That's going to be a nightmare to spell and pronounce.", ">Presumably you don’t live in Ireland nor are you Irish? Because that’s a really traditional Irish name - I have 2 cousins with the name and I know at least 5 others. \n\nHow is it pronounced anyways?\n\nedit - nvm, OP said it's pronounced like \"Kale\"", "people forget about the initials so often. i don't have kids but if i ever did have a boy, my ideal name would have the initials CJD. like the prion disease. here's to hoping i meet someone with a good last name so I can still use it", "Wasn't there an AITA where someone was doing a monogram gift for a baby shower and got yelled at for trying to warn the parents the kids initials would be ASS?", "It’s a traditional Irish name. It’s not made up. It has a history.", "You could just Google it. Since it's a name.\n\nI don't see how it's any worse than Sean.", "Cael is a traditional Irish name meaning warrior. I knew many Caels growing up and one \"Kale\". It's not an uncommon name. Charles, Kenneth, Florence...now those are names that people make fun of.", "There is absolutely NO guarantee your kid will like their name. I can almost bet that everyone has hated their name at some point in their lives. My name sounds similar to \"liar\" so that's what people used to pick on me and it hurt. I now love my name because it's unique, but my parents LOVE(D) my name when they chose it.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "“People aren’t responsible enough to name a child”….Are people who aren’t “responsible enough” to raise a child allowed to have them? Just because names in your country have to be approved doesn’t mean that other names in other countries are bad.", "As someone who got saddled with one of these Eggstrah Speschul Yooneek names and had to go through the headache of changing it, I'll come right out and say, parents who do this are dumb and selfish. If you think such-and-such Sooper Cuhel Nahm is so great, change YOUR name to that. Then you, a fully formed adult, can deal with the mockery, inconvenience and embarrassment that inevitably accompanies it. But shoving it on a baby because you think it's just soooo neat?! On bird planet, this is considered a dick move. Just to reiterate, you're getting all the fun of using this Yooneek name, while your child has to deal with all the negative social consequences. \n\nTHAT BEING SAID I have never said this to a parent who has already given their kid the Yooneek name. What's the point? They're not going to change it at that point, and kid might end up liking the name. OP is NTA, and even though in my heart of hearts I agree with Sis %100, she is being pointlessly rude and troublesome. If I were in her shoes I'd wait to see what kiddo said in a few years, and if he started expressing dislike for his moniker, I'd quietly take him aside and just let him know there's money set aside to change it when he's ready. No family fights necessary.", "I was at work in the early 90s when I heard a woman call to her young son, \"come here, OJ.\" I still think about that poor kid sometimes.", "While I agree that op is NTA, I am curious where the line is in your opinion? Like, what is it that makes a name like Cael acceptable but Xaiquiri worthy of ridicule? Not attacking, just genuinely curious since it is such an arbitrary distinction.", "There definitely needs to be some rules in place for truly awful (or obviously fandom based) names so kids don’t grow up being ridiculed for their names. \n\nI think OP’s kids name is fine but I definitely agree that some rules are important.", ">If the child could be teased about the name, speak up.\n\n*Any* name you use for you child could get them teased.  It doesn't have to be an unusual name.  If the kids can use the name and make a rhyme out of it to tease their target, then they're going to do it.  My name is a common nickname for Margaret and Mary and the kids I went to school with added \"tallee\" to the end because I was the tallest in the class.", "I read it as kale tbh", "My favorite is \n\n\"Tradition is just stupidity on purpose.\" -Onos Toolan, Dust of Dreams, Stephen Erikson.", "I never said that it was made up.  I simply stated that while it may be traditional in Ireland, it is going to just cause confusion elsewhere.  And it's a pretty fair assumption that the OP doesn't live in Ireland.  I know a woman named Siobhan who loves her name, but hates that nobody knows how to spell it or how to pronounce it correctly when seeing it in wrting/print.  I know that it's a geographical/nationality issue, but I still stand by my comment.", "Which would be true should the name become common as Sean is.  But \"google it\" isn't a response that I'd want to saddle my kid with.\n\nBtw....  I googled it.  Two different sites told me that it means \"slender\", and provided no pronunciation.  I don't know that googling it is going to do this kid any favors.", "NTA - It's not like you were naming your child \"Hufflepuff\" or those nonsense mix of letters that don't resemble at all the name they were aiming at.", "This is so true. We tried hard to make sure our kids names didn’t rhyme with anything obvious, initials didn’t spell anything, couldn’t be shortened to anything bad. The kids will still find something, but at least they will have to work for it.", "No, Cah-el!", "Yeah you just showed extreme ignorance (and ethnocentrism)in the pronunciation. It’s not hard to learn how to pronounce names correctly. I taught at an extremely diverse school and learned to pronounce names of kids from literally 40+ countries over the years. \n\nIt’s not hard to do.", "I named a kid after a Dragonlance character.  He changed because he's a boy after all, but he still is especially fond of dragons.", "I have a student called Kairi, but it is also  the name of small town, where my student’s great grandad was a founding father in Far North Queensland, settled sometime after 1900.", "Psh, Emet actually managed to destroy 6 worlds (well, 7 if you count the 13th), and did it all with a glib glee.", "I went to college with a guy named Thor, who was specifically named after comic book Thor because his dad was a fan.", "Friend of mine bought it and shared it, it was ok until they started royally changing things", "Sams", "Exactly my point.  You LEARNED how to pronounce the names of kids.  How many of those did you, upon seeing the name in print, mispronounce, or had to ask them the correct pronunciation?  Or were you so incredibly intuitive that you immediately knew the correct pronunciation every single time?  Yeah....I didn't think so.  Now imagine how many times some of those children have had to go through with others, what they had to do with you.\n\nSo yeah, you just showed your extreme ignorance in missing the entire point of my original comment.  It's not about learning the correct pronunciation, which, I agree, is relatively simple.  My point is that every time this somebody reads this kid's name (school, job application, Tinder, arrest warrant, etc.) he is going to have to explain how to pronounce it, and also how to spell it when he tells it to people, etc.  That shit gets really old really fast, and now he gets to do it for his entire life unless he packs up and heads to Ireland.\n\nHow about if you, just for fun, learn how to read for context rather than just jumping to the conclusion that gets your hackles raised and causes you to come off as extremely ignorant.  But have a nice day anyway.", "They're all real names but even in Japan, if you name ALL THREE of your kids that, people are still going to look at you funny.\n\nNo one's going to bat an eye at a class that has 3 unrelated kids names Sora, Riku, and Kairi. People are definitely going to notice a set of siblings though.\n\nSeems like those kids are basically white too, in that comment.\n\nEdit: Dunno why I'm getting downvoted. I literally live in Japan and people can definitely tell you're a KH fan if you name your 3 kids after the characters. I mean, look at the poor Japanese kid whose parents named them literally Pikachu.", "Nice", "He’s half white (Spanish) and half Mexican. She’s 100% whiter than mayonnaise. They’re just weebs", "Before Kingdom Hearts, Kairi was a name used in Japan and Estonia, as well as a place name in Australia. I've known a Kairi of Japanese descent for years, and I think it's a cool-sounding name.", "I wouldn't put it past people to decide to call their kid Ragnarok and then spell it wrong - look at all the \"Naveah is heaven spelled backwards!\" people...", "I wasn’t taking it as arguing. :) Just a discussion. I’m sorry if you felt that I was being argumentative, as that was totally not what I was going for at all.", "I have a slightly unique name and every time I see something with my name on it I snatch it up cause yea I excuse. My ex named his son ehvaynne(evan) I think that’s how they spelled it and I’m just like that’s stupid. I’m down for unique but useable names that other people will have but not very often.", "Tell that to the Jesuses of the world, lol.", "Also you said that twice.", "NTA- But Cael ugh.  As someone with a unique name it always sounds a lot better to the parents, than it will to the kid who has to correct EVERYONE they meet how to properly pronounce their name. Shit gets old real fast.\n\nEither way your sister needs to keep her opinions to herself.", "If you are in the US then the name Cael is not life ruining. Your sister may not like it, and as it’s not a popular name, most people won’t like it and wouldn’t use it. But the baby is here and that’s his name, she should have kept it to herself. \n\nNTA and whilst she meant well she went in too hard and it’s too late to give an opinion.", "YTA You’ve hated your name your whole life, yet you give your son a name he’ll probably hate and no one will be sure how to pronounce?", "NTA. She doesn’t get to have an opinion in what you name your kid - and did I read that right, did she also insult your wife’s name while she was at it?", "Nah, it sounds like your family wants to control you. Speaking from experience, my wife and I had a child and named him after my grandfather and stepfather. I did this because these are 2 men I greatly look up to and admire. My mother and brother are the ones who took the issue and said it is wrong of me since I didn't ask for permission (my grandfather died 3 years ago and mystep father saw it for what it is and a CT of love I have for him). My brother just wanted to use the names later.", "You not the AH. Simple.", "She offered her opinion, you didn’t take it- the end. Your kid, your choice. NTA", "If sister wants to name a child, she should have one of her own. NTA.\n\n(Also, did I read it correctly that she also insulted your wife's name too?? Sister can sit all the way back down.)", "> She told me she was entitled to give her opinion in response. I told her she was\n\nYou are both incorrect about this. NTA", "NTA - congratulations on the birth of your son.\n\nYour sister can get BENT. \"Not a name\" what nonsense\nCael - from the Gaelic caol meaning slender. Also a character in Irish folklore (a warrior)\n\nMy family reuses names too, the last 3 generations have cycled through a handful of biblical or traditional Irish names. My cousins have recently started having children and have named their kids 'new' names that they like and feel suit their babies. No one went off at them bc it's not their business!\nYour sister doesn't have any say over what you call your son", "Lol NTA how is she entitled to shit?", "She can give her opinion, but you don't have to hear it. NTA.", "NTA\n\nIt's not her business. \n\nAt least you didn't call him something like \"Saint Prince\".", "Cael is a GORGEOUS name.\n\nNTA.", "NTA. I know it sounds easy, but best to try to ignore the noise. This is a crazy time for your new little family; emotions are running high, there’s a new baby to take care of, and all the stuff that comes with it (no sleep, hormones, etc..) For my best friend, her mom did the same as your sister - ridiculed the chosen name (backwards to your situation, the chosen name was a “old name” of Eliza). My friend said you better get used to saying it if you want to see her or me. That was the end of it. She would not allow any more talk about it and stuck to her guns. I wish you luck and congratulations on the new baby!!", "NTA.  It took three days to find a name for our second son.  Our first, I knew I had the name for either a girl or boy by my sixth month, and it fit.  Second baby, well, none sounded right.  My friend picked one out of a phone book, and it suited him to a t.  And neither first name has any connection to family names.\n\npoint is, you gave your child the name that fit him.  Her opinion is not necessary, and was not asked for.  BTW, I do like the name you chose, I read it is a the name of a great warrior in Irish mythology.", "Tell sis to stuff it. NTA.", "It's a human, not a dog. Your sister clearly understands bullying by school kids more than you do. I just hope your surname isn't Salad, and that you are prepared for him/you having to spell out his name for the rest of his life. YTA for naming your kid after a misspelled salad green.", "NTA - your child, your decision regardless of other’s opinions. \n\nMy dad likes to joke that he and my mom gave me and my brothers “strong Irish names” and I “picked one out of the Bible” when my son was born. I think the name you and your wife chose is absolutely beautiful and I might be a little biased because I think that an uncommon name is better than a common one. There are a million Johns but only a few Caels. He’s going to stand out in amazing ways", "How is Cael pronounced? Like Kyle?", "Kale", "NTA. I had a relative who objected to my child’s name because it was the same as her ex’s name. Who I never met, don’t know…. No man. No. I can’t think of a thing that involves other people less.", "I have to be honest, you're going to have your child's name mispronounced a lot. Did you think about that when you picked it? The way your sister went about it was not great, but did you even think about it?\n\nIs it pronounced Kale? Seal? ka-EL?  kell?You're catching my drift, right? \n\nThere's a difference from breaking tradition in picking a name that is not already in your family, maybe choosing a name from a spouse's culture if they have a different ethnic background, or something...or a name that means something significant to you translate it from a different language. \n\nbut to *try* to be very different just on purpose and saddling your child with a difficult name just to be different is a different thing.   \n\nSo ESH", "NTA - It's concerning that your sister is this deeply invested in *your* kids name. Does she have no life, hobbies, family, or anything of her own to focus on? Even if she doesn't like the name, the most energy a grown as adult should spend on this is 5 seconds and be completely internal.", "NTA - an unusual, but harmless, name doesn’t require unrequested commentary.  She needs to mind her own business.", "NTA tell your sister to eat shit. My own sister has a love/hate relationship with my wife. If you don't put your foot down she will always continue", "NTA and you were much nicer than I would have been", "Is Cael pronounced like Kyle or Kale or Kai-ell or something else entirely?  Just curious.", "\"It's wrong to break our name tradition\" is she fucking mental? NTA", "Dang I though you had some ridiculous name for your baby But nope….it is a solid name. NTA", "NTA She's entitled to HAVE an opinion, not force you to listen to it. Telling your wife she should know what it's like to have a dumb name was so far over the line that I'm amazed you didn't walk out, or throw her out if it was your house.", "So my name is Susan. I had 3 Susan’s In every class in school. I wanted my children to have different names, but that were easy to spell & pronounce. Many unusual name are too weird.\n\nWe named our son & daughter with less regular names, but with traditional second names if they didn’t like the original ones so they could use them as adults if they chose. But basically, your child, your choice. They can change it as an adult legally & everyone else can sod off", "NTA. Cael is uncommon, but realistic name.", "NTA. Your families’ names do tend towards the… classic. Some  might even say old fashioned/fuddy-duddy. Definitely Bernadette, Gerald, and Florence are old people’s names. Cael looks pretty - though is it pronounced like “kale” or “Kyle”? \n\nIn any event, it’s far better than Gerald, and it’s not your sister’s business anyway, so feel free to tell Gertrude, Martha, Agnes, or whatever your sister’s name is, to shove it.", "Agree!  Plus it’s a beautiful name.\n\n For additional information….”The name Cael is boy's name of Gaelic, Irish, Irish Gaelic origin meaning \"slender\". Cael is the name of the angel of the zodiac sign of Cancer and also of a warrior of Irish mythology. Its ascendance to the Top 1000 over the past decade probably has to do with its similarity to Cale and Kale (and Kyle and Cayden etcetera).”", "Lol the post was about how his sister’s input on naming wasn’t welcome and you think _yours_ is?", "OP is NTA. But I am curious..is this name pronounced like “Kale” or “Kyle”?", "From watching The Ritchies they pronounce it as Cal. No idea if that's correct or not.", "I dont remember that one!", "Please cut your sister some slack.  She was obviously trying to do right by your baby, which is a good thing", "Cael isn't a \"youneek\" name. Its Irish.", "Oh look another [comment](https://www.reddit.com/r/AmItheAsshole/comments/102b4kd/aita_for_snapping_at_my_sister_and_telling_her/j2sxta1?utm_medium=android_app&utm_source=share&context=3) you stole.", "You're right.  That was a really hilarious post with even more funny comments. Too bad it was deleted lol.", "That's really interesting - good to know.", "That was my first thought when I first heard of the name. Like way before I learned it was ancient Irish.", "Help me, I’m stupid and curious and j don’t get what this means.  What’ does it rhyme with?", "Oof. I wouldn’t hate it if they were Japanese but still…", "... what are his current kids names...?", "His oldest has the name of a Disney prince, and his two girls have fairly normal names save for a unique spelling.", "Lol at this entire rant", "My first name has a Greek origin, but people tend to skip the first letter since the rest of my name is a common name in my country, so I have to correct them when pronouncing it. My other name, my country tend to have people with two first names, is unique and I have to spell it to them. Everytime school starts and I have a new teacher, I would have to tell them how to read my name. When I go to places, I would have to spell out my name since they tend to get it wrong. Is is annoying? Yes. Do I have to move to freaking Greece because people can't get my name right? That's a bit too much. The kid have to correct people, yes, but that doesn't mean it's so bad. There's always a point in life where you can't help but keep correcting people over something that seems obvious. Besides, even common names need to be corrected. Take Alex for example. Pretty common name but the person might have to correct people over the spelling cause it might be spelled as Aleks or Alec. Then there's the fact that there are times people have to be told that it's short for Alexander, or Alexandre, or just Alex.", "It's always bugged me that Apple Martin's name is one letter away from being Apple Martini.", "They're perfectly fine names if you're Japanese. If you use them as a set like that they're also fine as long as you're okay with your children's classmates making fun of them because their parents are weebs.", "You sound dense", "No worries, I may have misinterpreted because I’m at work right now!", "It wasn't even actors it was straight up the comic characters names. In order!", "I thought Cael was a name? Anyways, NTA, your sister should mind her business.", "NTA. Sister can (ahem) *politely* share her opinion, but has no real say in your child's name and needs to respect that.\n\nCongrats on your new little one, and I happen to really like the name Cael!", "NTA! Yes I understand ur concerns about how a name can damage a child when they're older, but normal, everyday ppl are now calling their children outrageous names. Like a lady from England named her child bluebell and an Australian woman named her child Holden Commadoor (an Australian icon car). So ur chosen name is nothing compared to them. I just really think that ur sister is saying it will hurt him just to get her own way. \n\n U and ur wife are the parents u get all the say at what u name ur child. I'm sure she wouldn't like it if ppl got involved in her personal business, regardless on who it was that butted in", "Definitely NTA. Also not common it's not an unusual or outrageous name. Sister needs to get a grip.", "NTA! Even if I don't always agree with some name choices as I mentioned in the comments, parents have a right to name their child what they want. At least you went with what sounds like an actual name and not random words or pop culture icons.", "NTA. She is.", "I’m confused how do u say the name does it sound like kale ? Or how do u say it", "NTA\n\nYour sister is weird, and was being pushy.", "NTA.  Your kid, not hers.  I've hated my (rather common) name since I was a child, and would change it, if not for living on a fixed income.", "NTA. I would probably be your sister if my sister ever named her kid kymberleigh or some such but she would also be in the right to tell me to stfu.", "NTA. It's your/your wife's kid, so you get to name him. If your sister wants to name something, she can get a fish or whatever else.", "Definitely NTA. I'd say the title is misleading since it doesnt seem like you snapped, more like told her to keep her nose out of your & your wife's business, esp over something special like this.\n\nAlso I'd say if you still really don't like your name - theres always time to try out new names and find one that feels like *you*.\n\nAlso Cael is a really cool unique name!! :-) it's your kid, and if your sister is right about him not liking his name in the future he can always just change it.", "NTA,\n\nName what you want and keep standing up to your sister, when she has children, she can name them what she wants too.  You get to name your child what you want too.\n\nIn my family, Achellis, Broad, Rowe, Ralph (ok not that bad but still), and the topper was a Great Great Grandmother whose first name was spelt so many different ways that I think it was a made up name.\n\nAnd besides, if you child hates his name, he can use his middle name or pay for a new name when he's an adult.", "How about Gurumantra for a boys name then his brother Khartaputich and then their sister Sally? The boys had been born while they lived in commune somewhere in California and the daughter was born outside of the commune. Not making this up I taught KP swimming lessons and we ( lifeguards/swimming instructors thought KP was a topless girl because he had blonde hair all the way down his back😂The boys were good looking kids and Sally was a real 🥰", "As an Irish person Cael is very much a name and this is beyond insulting", "NTA at all. Near native English speaker here....how is Cael pronounced....like Kyle?", "Absolutely NTA.\n\nI'd love to know what the wife's 'ridiculous' name is if she's dissing Cael, which is 'traditional' in Ireland", "So very true, AND Your sister may have an opinion, but she should've kept it to herself. The only AH I see is her.", "Exactly, the name of your kid is not a decision for anyone else.\n\nYou are NTA.\n\nIt is you and your wife that will have to call out the name and look at it every single day. If your kid grows up hating the name and wants to get back into the family tradition, they can change it to something else.", "We gave my son a good, solid, traditional name that everyone is familiar with. Something like George. And kids teased him calling him George Washington (it was a different historical figure with the same name as my son.)\n\nAnd I’m like, the guy they’re comparing you to was extremely accomplished and is very respected. But it turns out that does not in any way factor into kid name mocking, and my son wished I had seen this coming. \n\nSo you could be fucked either way.", ">(like chosing random words for the sake of being _Yuneeke_)\n\nFTFY", "I worked with someone who's song as named Sauske.", "They aint Irish now are they?", "And they smoke meth and have neck tattoos.", "Yeah, I was named after a relative. I have no doubt great-granny was dearly beloved, but the name still sucks. No one could ever say it or spell it. And another close family member named after the same relative literally begged my mom not to saddle me with the name. She told my mom I would hate the name. She was right. I also disliked having the same name as a close relative because it was awkward. \n\nHowever in the last 5 years or so the name has become common enough that people can actually say and spell it. It doesn’t make up for decades of struggle. But it does help. \n\nParents, please don’t name your kids weird shit. They are likely to dislike their name, resent you, and unusual names actually result in greater problems getting job interviews. This is especially true of “ethnic sounding” names. :( A resume for James gets more interviews than the same resume for Tykwan. It’s racist, and it sucks, but it is a reality. If you are tempted to name your daughter something like “Candy” just ask yourself if the name works with Doctor, President, or Judge in front. If it doesn’t, skip the name!\n\nBut I confess I like Cael, depending on pronunciation. But yeah, the kid will have to spell it every time someone asks his name. That does get old fast.", "Wow, what a rebuttal. For a minute, I almost mistook you for an intelligent person.", "I chatted with parents at a park who named their twins Thor and Freya. Yikes.", "All I can say is Yikes, those poor kids.", "ah right, my bad", "I both do and do not want to know how they went from relatively normal (I'm assuming Flynn, Phillip, or Eric for the boy) to Knight Shadow. It had to be an interesting and horrifying thought process.", "I never suggested that the kid should move to Ireland.  I wasn't even suggesting that they not name their kid \"Cael\".  I'm just saying that parents, sometimes, should consider the long game versus being unique just for the sake of being unique.  Just ask any kid named after a LOTR character.", "Due to you not reading for comprehension, I felt there was an obvious need to spell it out for you.  Lol", "Actually no! And he had a very good (in his opinion) reason for giving his son the name he did. My brother also has a very unique name. He named his son after one of the very few princes to have their father named onscreen... And it was his name! So, he thought it would be fun to mimic that in real life. I was super against it when I first heard and thought I would use a nickname for my nephew. Surprisingly it suits him. \n\nBut... Knight Shadow? It doesn't even shorten into anything usable for a nickname. There is a difference between giving a child a name like OP did, and giving them a complex.", "I never put that together. Probably why they named her Apple. I feel so dense now.", "There is no way in hell I would ever get “Evan” from that letter vomit. Poor kid."]}