{"id": 6453, "submission_id": "102u5fo", "title": "AITA for not being rude to my cousin for not giving me a photo?", "selftext": "[removed]", "created_utc": 1672807329, "permalink": "/r/AmItheAsshole/comments/102u5fo/aita_for_not_being_rude_to_my_cousin_for_not/", "score": 87, "replies": ["Your post has been removed. \n\n#Do not repost this without contacting the mods for approval, including edited versions. Reposting without explicit approval will result in a ban.\n\nThis post violates Rule 7: There is no interpersonal conflict here for our community to make a judgment about. WIBTA posts must clearly state why the other party is likely to be upset at your actions.\n\n[Rule 7 FAQs](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_rule_7.3A_post_interpersonal_conflicts) ||| [Subreddit Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\nThis post violates Rule 11: No Partings/Relationship/Sex/Reproductive Autonomy Posts. We do not allow posts involving cutting contact, ghosting, breaking off friendships, and similar discussions. This includes going low/no contact with family members.\n\n[Rule 11 FAQs](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_rule_11.3A_no_partings.2Frelationship.2Fsex.2Freproductive_autonomy_posts) ||| [Subreddit Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n\n\n#Please ensure you have reviewed this message in full. We will not respond to PMs to individual mods. [Message the mods](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) with any questions.", "YTA , he sent you a scanned copy. Go to a print store and get it on some glossy paper and frame it. It’s his photo and he’s let you know he has no intentions of parting with it. Most likely because he shares the same attachement to it as you do. Go get your copy fancied up and be happy with that.", "YTA. Let it go. You were right the first time when you asked to be considered IF he was going to get rid of it. Now feeling entitled to it because you were told he wanted it is making you less than reasonable. It is his. Making a copy was very nice of him.", "YTA. It’s not your photo. You have no right to it. It’s not his fault his grandmother did a better job of keeping track of photos than yours.\n\nHe scanned it for you. Enjoy your eternal digital copy.", "YTA - \n\nYou've been complaining about family photos since at least October - and then when your Mom does give you originals it's not good enough because it's not 'Italian' - you're on another thread talking about throwing away a photo of your great grandmother .  Perhaps this cousin knows how ungrateful you are, and how careless you are about the family artifacts that are not your preferred ethnicity.", "You’re lucky he even scanned it for you - YTA", "Yes, YTA.\n\nThere are plenty of photos of people that don't belong to them.\n\nAlso, 9th cousin? That's just some dude you know that has historical pictures of your ancestors. \n\nIdk... Think of it like a museum. \n\nAnd Grow up.", "You keep replying that you want IT (the original) to pass down to your future kids (plural). So even if you had it, at some point the original would go to, say, your oldest - what do the other kids get? And their kids? Scanned copies, that's what. \n\nYou also say that the original photo is of your Great Great grandparents and all their children. So there will be dozens of descendants of the subjects in that photograph - even if the owner of the photo decided to give it away, why should it be to YOU?\n\nI've started an ancestry family tree and one set of my Great Great Grandparents have so many descendants I can't keep up. There are people I've never met and others I've never even heard of.\n\nFinally, we all take photos of other people were not related to. We own those photos, not the subjects.\n\nYTA.", "Yes, YTA. You were fine to ask him to consider you if/when he parts with it. It has been in his family for several generations and he intends to keep it. He does not owe it to you just because you value it or because it has your direct ancestors in it. He sent you a scan. Be grateful that you have this record of your family. Have it printed and framed. Be respectful of your 9th cousin's decision, for which he does not owe you an explanation.", "YTA it’s his photo to do with what he wants.", "YTA. It does not belong to you. You asked he said no. No is a complete sentence.", "Okay, so if this is even real how about you do an ancestry type test and get in touch with some of your Italian relatives in Italy, save up, go to Europe and visit Italy since Mexico is such an issue for you. Unfortunately the Italians will not see you as one of them, just another American (I’m guessing American due to the racism against Mexicans and opinion that 100 years is a long time). This is an important step in your personal development.\n\nActually get to know the countries of ancestors on both sides, not just from 100 years ago but much further back. Spain (where the more recent settlers of Mexico were often from) was a European superpower with a fantastic history of its own. There were plenty of Italian immigrants to Mexico too in the 19th century. \n\nYTA for threatening to throw out one historical photo (in your other post) and demanding the original of another. You need to travel and grow as a person. \n\nPlease give the Mexican grandma photo back to your mum and stop pestering your cousin. It would serve you right to find out Mexican grandma was actually descended from Italians if you do throw it out btw.", "YTA. It's his and he gave you a perfectly good copy.", "YTA.", "YTA. The original is his and he shared a copy", "Again, YTA...\n\nAnd you're super entitled.", "YTA\n\nIt's not yours. If you really want the original, try to make a deal for it. But ultimately, you're not entitled to it.", "YTA grow up..", "Ask your cousin to take the photo to a professional replication service   They will do a high resolution scan and print on archival paper.", "YTA. The photo does not belong to you so you have no right to it. Why do you want the original anyway, isn't the most important thing in the photo  the image it replicates ie the people in it, which you already have in the scanned copy ?   \n\n\nYou should be grateful of the fact that his grandmother and your cousin managed to keep the photo for so long, you got a chance to even see it and even receive a scanned copy, when your direct family probably lost theirs long ago.", "YTA… big time. Regardless of who is in the photo, it is a family heirloom that is important to him, and to quote one of your entitled comments “DNA doesn’t matter”, so that is his family too, regardless of if he’s your 1st cousin of your 9th. He was nice and scanned it to you. Tears or not, be grateful for what you have. Grow up. It’s not his fault your family didn’t leave pictures. Stop being bitter", "YTA. Grow up.", "YTA, it’s not yours. It’s his. It doesn’t matter that you don’t like it, you’re an adult, get over it. Stop pouting in the comments like a petulant child when people disagree with you. Don’t come on here and pout about your judgment.", "YTA, you had old pictures.  That you threw away because you consider your Mexican origins inferior.", "YTA. Is not yours, you are not entitled to it. He was nice enough to send you a copy, take it or leave it.", "YTA - obviously.", "YTA\n\nPrint the photo onto archival paper and move on", "YTA", "YTA for sure", "YTA\n\nYou don't have more rights to the picture than other descendants.\n\nBe happy with your scanned photo and stop throwing a tantrum.\n\nAnd if you can't get over it, get therapy because this is terrible entitlement.", "How old are you?!? You sound like a whiny spoiled brat wanting something that isn’t yours.", "YTA and mind blowingly entitled!\n\nYou don't get to throw a temper tantrum because your cousin is refusing to give you his property. The picture is his, he is part of the family, get over it OP.\n\nNo means no. You were fine to ask but as soon as he said no and gave you a scanned copy, you should have dropped it.\n\nSo what if you want it? There's a lot of things I want that I'll never get, and guess what....that's life.\n\nStop stomping your feet and complaining, at least you have a scanned copy 🙄", "YTA\nYou are acting entitled and incredibly spoiled. \n\nIt isn't yours. Settle for the copy and be grateful you have that.", "YTA and your other post was worse. You were being racist and ignored actual advice. enjoy never getting that picture !", "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’ve been being rude to a cousin of mine and upset about him not giving me a photo that is very valuable to me and I might be the AH by not seeing how he views it?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You need to spend the next several months going out of your way to think of others and not yourself. Do service work, help those around you. The entitlement that oozes from every post/comment you make needs to be exorcised post-haste!\n\nYeah, you're \"young\" but you're old enough you shouldn't be acting like a toddler. If you don't grow up life will quickly get too hard.", "YTA, he comprised and you won’t.", "Grow the fuck up. You aren’t getting it so time to put on your big boy pants and move on with life. How fucking entitled are you? It’s *his* photo, not yours. You have absolutely no right to be demanding him to hand over his property to your selfish ass. To bad you *\"wont be able to feel the texture of the old photo\" (or whatever bullshit you are going on about)* you shouldn’t even be touching it anyway. Do you have any idea how sensitive a 100 year old photo would be? And how easy it could break?? Yta", "YTA. He sent you a copy of it", "Do you seriously know that he is exactly your 9th cousin? Why do you care at all? Isn't it enough to say that he's some very distant relative? 9th cousin, I will go google what on the god's green earth that means... sounds crazy.", "YTA", "Why did you even post in here if you are just going to repeat the same sentences like a broken record? Grow up and let it go. Goodness, children are so exhausting. YTA.", "OP wants to throw away a picture of his mom & grandma. OP doesn’t deserve anything.", "YTA - He scanned it and sent it to you which was very kind of him. You need to accept that you won't be getting the original as it is sentimental to him.", "So is the whole point that you want the photo bc it's a picture of your Mexican half that your embarrassed about according to another one of your posts, and you just don't want anyone to have it? \n\nFrom both posts you're pretty immature and entitled but I doubt you care! Also racist apparently\n\nActually I think this is fake, your last post was 5hrs ago talking about throwing the pic away and this was 8hrs where suddenly your don't have the pic and want it", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nSo basically my 9th cousin has a lot of photos of my family and this one photo has my great great grandparents and all their children in a family photo. His grandmother was friends with the family back then and that’s the only reason he has the photo and when I told him that if he’s ever thinking about giving it away in the future to consider giving it to me he told me he doesn’t plan on giving it away at all. For some reason that got me really upset cause he thinks just cause it was his grandmother’s he shouldn’t give some of the actual photos to the actual family. There will be a time when he passes away and someone will get that photo and I don’t get how anyone like his kids will ever appreciate the photo other than the actual descendants of the family so I just completely stoped talking to him and I’m just so upset about it. \n\nHe scanned it and sent it to me but it’s not the same as getting the original and the little imperfections of the photo through age not being felt by hand just makes it bad. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "OP what are you not understanding about IT DOES NOT BELONG TO YOU? Jesus christ you sound insufferable, youre talking about wanting to be able to pass it onto your children but if youre as entitled, self centered and selfish as you are online then you can absolutely forget procreating. \n\nTry shutting the fuck up in the comments too, we arent going to agree with you.", "You can get vintage photos re-photographed and printed on a matte vintage style paper. They look fantastic and keep their vintage feel. You can check for a restorer near you. Of course you have now behaved appallingly, so I doubt he would be willing to lend the picture to this to do it. YTA", "YTA and why come here and post if you are just going to argue and try and justify your actions? Seriously take your judgement and go, arguing isn't going to change a thing.", "YTA. What makes you think you are entitled to anything?\n\nYou’re owed crap all", "YTA it is not your photo. He is under no obligation to give you a photograph of his grandmother. You should thank him for scanning a copy to you. I wouldn’t have based on how petty and entitled you are acting.", "You’re insane.", "YTA - it doesn’t belong to you or your family. You have no right to something that belongs to someone else. They have been very generous to scan and send you a digital copy when they didn’t have to do that. The correct response is “thank you”. You sound entitled and ungrateful.", "Why do you even want the photo when, I’m your words “why should I care about DNA?” \n\nYTA and an immature and exhausting one!", "Get a life- and let it go. Based on the comments especially, even more YTA. \n\nGrow up.", "YTA it’s a photo. You have a copy. You’ve asked, they’ve said no get over it. \n\nIs your obsession with this photo tied to the fact it’s your Italian side of the family not your Mexican? You should really think about what’s making you obsess over your (distance) Italian heritage rather than your Mexican heritage.", "YTA. A mega childish AH, based on your comments. Get some help and get over yourself.", "YTA. It’s not yours and it never will be so it’s time to let it go", "YTA. Yes, he's going to die eventually(!) and no, you don't get a say in who get possession of his photos. Yes, it's your grandparents too - and a lot of other people's parents/grandparents too, it sounds like - and no, you still don't get to call dibs. There is only one physical photo, so it can only stay in one person's possession.\n\nYour cousin did you a massive favour in sending you a copy, so try being grateful for it, instead of sulking that he won't give you the original.", "YTA You’re not entitled to anything ANYONE else has in their possession, no matter the value to you. Your cousin was gracious enough to send you a copy. Be grateful", "He gave you a copy. Just because your family is and it doesn't mean you deserve the original. YTA", "YTA. By chance did you never hear the word No before?", "Ask him to tell his kids to give it to you when he dies and just print off a scanned copy for now.", "To make it more like a 100 year old photo, get a matte finish. If you go to a real photo printer you might be able to have it on old style heavy photo paper.", "Couldn’t say better. YTA", "Like I said it’s not the same because there are little tears in the photo that makes the glossy photo look fake. It obviously it’s a scanned copy done a hundred years after.", "That’s so weird though. I hate that some descendants of the freinds of the family will have the photo", "I want the original photo", "right that post was so racist", "I don’t want the scanned version though I want the actual photo so I can give to my kids and they will give to their kids the actual descendants of the family in the photo. It’s 100 years old it would be so cool to have it", "Right? 9th cousins share so little dna it’s practically unmeasurable. Their last common ancestor has been dead for like 300 years. \n\nAnd museum is accurate since OP can look at his scanned copy but not some precious, slowly deteriorating original", "Yea my 9th cousin not just some dude? It’s a photo of my family and his kids would have it and that’s not right my kids and descendants the Actual descendants of the people in the photo should have it", "I just want the original it would be so awesome to have it it’s 100 years old and I want my kids to have it. It just sucks that I never got any photos of my ancestors.", "Doesn’t make it right tho", "I don’t want the 6 months old copy I want the original 100 years old photo something to pass on to my kids", "This is the way to go.", "The tiny tears are what give the photo it’s age and value", "OP has pictures from childhood but won’t accept them because that side of his family is Mexican. nothing will make OP happy except the original because of ~it’s value~", "Their last common ancestor would’ve been 8 ish generations back (usually a couple hundred years)", "It doesn't belong to you! He inherited from his granny.", "Simple solution: make multiple copies. Bend rip and tear them all until you find one that best matches the original.  You can request that original photo be given to you in the event of his death, but apart from that it’s his.", "Trust me, if not me then literally everyone in the thread downvoting you, the only weird thing is your obsession with wanting to physically own a photo so your friends of the family can't lol", "That's a you problem.Your weird feelings do not dictate how other people have to act. It's not like the photo holds their souls and they will never be at rest while an outsider has them captured. Photo Grapher get to keep their photos and their descendents get to have their work\n Some people just like old times photos and you don't get to play who would value it more to lay claim to it. It's not yours. Go spend time with your living relatives.", "Well you’re never gonna get it so you can either hold a grudge or get over it.\n\nPretend the photo doesn’t exist or that it got lost in a tragic house fire.\n\nThen you can print off a new copy, tear up the edges, rub some dirt in, and pretend it’s the real deal.", "I want a Ferrari. What is your point?", "Waaaaaahhhhhh!\n\nr/choosingbeggars", "You sound like 5 year old", "Well, sucks for you.", "OMG! I could hear you stomping your feet like a spoiled little child… YTA", "People in hell want ice water. YTA.", "And it doesn’t belong to you. Sometimes we don’t get things we want.", "Selfish much?", "As I say to my child, \"I want ,doesn't get'", "I want it more sir.  Do you understand?", "In my country there is a saying that roughly translates to \"the grass of want doesnt grow even on the king's field\". Nobody cares that you want it, its not yours.\n\nEdit:\nThe saying is in italian: \"l'erba voglio non cresce neanche nel giardino del re\"", "Did you just stamp your feet? 😆 You sound like a bridge troll YTA", "And? Why the hell would someone give you an old original photo when you threw away an old photo of your great grandmother", "You don’t own the photo. Be happy with what you got. And it’s his family too even if it’s distant", "Great then delete the scanned copy and just forget about that picture cause you are not ever going to own it. \n\nAnd I doubt your 9th removed cousin cares if you talk to them or not", "Yeah and you aren’t entitled to it. Print out your own version and give it to your kids. You’re 19 - do you even have kids?", "You can stomp your feet and say you want it to your heart's content, but your cousin isn't under any obligation to give it to you. YTA.", "Why are your descendants the \"actual\" descendents and his aren't? Isn't that his family in the photo? His grandparents?", "A 9th cousin shares so little DNA with you that it would be hard to tell you're related.\n\nLet. It. Go.\n\nAccording to ancestry.com, I'm 9th cousins with Demi Lovato but I'm not invited to that family reunion.", "But… it has his family in it too?", "Aren’t you the person who wanted to throw away your great grandma’s photo?", "You feel disappointed that you didn't get any original photos passed down, and you wish this photo had been in your family, who were the subject of it. The original *is* precious and it is sad that you didn't get it. That doesn't mean that your distant relative should give it to you. It has value and it is his to keep. Remember that you *do* have a photo: your distant cousin sent you a scan.  \n\nStop envying what you don't have, and focus on what you do have. YWBTA if you allow your negative mindset to take over your thinking.", "Maybe you shouldn't have thrown out old pictures, because the show you mexican site of the family.", "I bet no one trusts you with old family photos, seeing as you tossed your great grandma's photo just because she's Mexican.", "How many times can you repeat yourself?\n\nThis boring AITA. YTA. \n\nIt’s not yours. Get over it.", "Yes it does. You do not own the photo, you are not entitled to everything you want. There is no obligation for your _9th cousin_ to just give you this photo that their family had handed down to them.", "Doesn’t make it wrong either.  Your sense of entitlement is unbelievable.  And scary, as the root cause of physical and emotional abusers is entitlement.", "Okay, but you can't have it. Your choices are a perfectly good copy or nothing.", "You mean the hypothetical kids you don't and may not have? Good thing they wont give it to you since you think other special photos are worth throwing out", "An unedited, high-resolution scan will show the crackling.  That's actually, the best way to preserve photos to avoid further damage.", "One day, your copy will have the tiny tears too.", "Do you value it because it's a photo of your family, or do you value it just because it's old?", "Why do they care?", "I’m not going to be faking? The kind of tears the original had can only be done through time. It’s been very very well kept", "and when does get originals he doesn't appreciate them: https://www.reddit.com/r/AmItheAsshole/comments/102wk1c/wibta\\_if\\_i\\_threw\\_away\\_a\\_76\\_year\\_old\\_photo\\_of\\_my/", "You can actually work towards a Ferrari?", "He sounds like a spoiled toddler in his other post too 😂 YTA OP!", "In the Netherlands it's \"lieverkoekjes worden niet gebakken\" which translates to \"I'd rather cookies don't get baked here\".", "Be happy with what? My family sucks that photo should have been passed down", "I don’t want to give my kids a copy and I plan to have kids in the future. You can tell it was a scan", "Very very distantly and not direct descendants", "It’s more about what heritage we share and where we come from. We are the 8th great grandchildren of my 8th great grandparents. Our family comes from the same village I share 50% with my brother and I hate him", "Why should I care about dna?", "Yep same person lmao. Op is TA", "Nothing then", "Yea it does ofc show the little cracks but you can’t feel that so it just feels like a copy and it sucks.", "Based on his other post, racism probably", "Well I don’t know what else to tell you OP. It his photo. It could be a photo of Dame Judy Dench for Pete’s sake. Just because you really want it doesn’t mean you get to have it. That emotion you’re feeling about it, imagine him having that same emotion. Would it be fair if the tables were turned and you had an original photo of a shared family member and he was requesting you give it up so he could keep it?", "Forging is a thing. Believe it or not when reproducing a work of art you can in fact age it appropriately and make it look very realistic, rips, folds, and all. But I do have one question is this photo a photo of your small amount of Italian heritage? I mean I have to figure it is since you hate that you are majority Mexican and wanted to throw out pictures that showed your family's most recent heritage. I will be honest if you walked around Italy claiming to be Italian you will be called Italian names I can't write here for fear of being banned.", "This needs to be at the top", "Please make this it’s own comment.  It was collapsed for me and I never would have seen it otherwise.  YTA", "Sounds like OP needs some therapy.", "Ohhh there's so much more going on here! The cousin's photo is merely a chip on the iceberg", "Well I bet if you offered your cousin a Ferrari for the photo he would agree. So you could work towards it too.", "It was, just not to you.", "Please do not have kids until you’re mature enough to not pout over a picture you have no rights to. Not even though it contains a picture of your family", "LOL he thinks he'll have kids", "You literally said it’s his grandma… did you not?", ">Our family comes from the same village I share 50% with my brother and I hate him\n\nGee I wonder why", "because it's DNA that you have in common with your relatives?", "Y r u being such a puss lmao", "Nothing, just like your other family. You don't deserve the photos after throwing the photos you already got away. Just because you don't like Mexican people.", "You're parents failed so hard in raising you.", "You should never touch vintage photos with your bare hands.  They should be stored in archival covers and only handled with cotton gloves -- which is rarely necessary.\n\nAsk you cousin for a high resolution, raw scan (not a JPEG) and use that to get a print.", "You would just ruin the picture anyway. Because you don't touch 100 year old photos. My family has some that are older, and no one has ever touched the photo itself in probably 9-10 generations.", "LMAO this is the best comment ive read all day. thank you for the laugh!", "Yea to some “friends of the family”. Wtf that’s not fair", "Hahahaha ain’t no woman or person going to put up with this petty behavior 😂😂", "He specifically thinks he’ll have kids with an Italian woman in Italy 😂", "To give her credit, no, she didn't. She said his grandma *owned* the photo because she was friends with OP's great-grandparents. They're distant family who lived in the same area and were friends, and had photos of each other.", "In his other post he whined because he’s mostly Mexican but only wants to be seen as Italian despite having ONE great grandparent be Italian 😂", "because he’s mad he’s Mexican (check post history)", "Yes it is. It was their photo, they decide where it goes", "This dude is way to racist for any one to love him. The op is the very definition of a incel", "That's just wonderful. I don't think he's for real", "Oh god he is another one who is gonna ruin italians reputation"]}