{"id": 6484, "submission_id": "1039uzr", "title": "AITA for not inviting my nephew to come on vacation with us?", "selftext": "I am the child-free uncle of two children. Taylor is the daughter of my sister Mary and Ben is the son of my sister Yasmine. I love both of those children dearly. I held them the day they were born, changed their diapers, heard their earliest words, told them all sorts of absurd Uncle tall tales and generally watched them grow from babies to children and now into preteens. They are both 11, only 4 months apart in age but they are vastly different. Taylor is a fairly rounded out, she's into the typical pop culture preteen things you'd expect at her age & she also plays sports & has a strong interest in science & the outdoors as well, which is a subject we definitely bond over. \n\n\nBen is a different story. Since the age of 8, Ben has been glued to a computer screen of some kind and I can't recall the last time I saw him where he did not spend 90% of the time playing on a computer/ipad/etc. I’m not judging him for this, just a statement of fact, though I do think it's a bit concerning but that’s a issue for his parents. Additionally, though I love him, Ben has become more difficult to like lately. He’s often rude, sarcastic, and acts like a smartass. I know this is partially part of his age but his parents don’t push back against this enough in my opinion. Also worth noting is he is rarely ever wants to participate in any activities that aren't digital. For example, recently we had a family get together at a lake and Ben just stayed inside the whole time. \n\n\nRecently my family had a few get-togethers and at one my wife and I were talking about a trip that we are planning for the summer. We recently purchased a camper and we are going to do a road trip to a nearby state to do some rock hunting (We’re both amateur geologists) and we will also stop at some springs and parks and such. This is planned for early summer without solid dates yet. Taylor was very enthusiastic about the idea and asked if she could come along. My wife and I were both ok with this and told her we’d have to talk to her parents. This was done with pretty much my whole family around, including Ben who was on his computer. I know he was at least partially listening because earlier in the conversation he asked if we had a TV in the camper. \n\n\nLater I got a call from Yasmine who accused me of favoring Taylor and excluding Ben because I didn’t ask him if he wanted to go too. I told her that’s ridiculous, Ben could have said if he wanted to go and honestly he has never shown any interest in kind of things we'll be doing. Yasmine said we're still leaving Ben out, which I suppose we are but ultimately this is my wife and I’s trip and I don’t want to spend big chunks of the time dealing with attitude, or fighting to get Ben to come along with us, otherwise I foresee at least one of us having to miss out on many activities because Ben will refuse to do them and just want to stay in the camper. \n\n\nSo AITA for not asking (and not planning on asking) Ben if he wants to come along?\n\nEdit: We didn't invite anyone, Taylor jumped in and asked when we were describing the trip if she could come along.", "created_utc": 1672854456, "permalink": "/r/AmItheAsshole/comments/1039uzr/aita_for_not_inviting_my_nephew_to_come_on/", "score": 1522, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole for not inviting my nephew along on our trip that my niece asked to go on, and not really intending on extending an invitation to him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Why would you ask someone with no interest in an activity to come to that particular activity. Especially on a holiday you hadn't planned to invite them to at any point. \n\nYour niece asked, she was interested and you kindly agreed to take her. I see no issues with this. \n\nDifferent if you were doing an activity they both liked and purposely excluded one. NTA.", "**NTA** Surely it's completely normal for two different cousins to start doing different kinds of things?  Not everybody has to be included in every activity.  *Especially* if you're the uncle, not the parent.  Everybody knows children, especially boys and girls, develop at different rates at different ages.  \"When you want to join in with our adult-type activities, we'll be happy to have you along.\"  Over their lifetimes, there will be many times when one comes with you for something and the other does not.  This is just the first of those occasions.", "NTA. No favoritism exists here, because you didn’t invite either one of them. Taylor is going because she asked permission and everyone agreed. Ben doesn’t want to go anyway, and his mom is TA.", "NTA Methinks Yasmine wanted a week without Ben.", "NTA\n\nMy guess is Ben doesn’t even want to go, but his parents want him to.  He was there, didnt express any interest, and would likely hate it.", "NTA. It's obvious that Ben's interests and your interests are quite difficult and he wouldn't be a pleasant travel companion. Kid needs to learn that attitude has consequences.", "NTA, perhaps bad judgment that you asked your neices parents in front of everyone so that this did become a publically debatable event. I don't see how your extricate yourself cleanly by any choices now. Each road has bumps, but NTA.", "NTA.  Why invite someone who is a PITA?  You reap what you sow and Ben's surly behavior kept him off the invite list.", "NTA", "NTA. Why bring someone along who clearly is not into it. You are not favouring you are just being realistic. I'm sure you'd happily bring him along if you were doing some computer thing he would actually like.", "NTA. The difference is the niece enthusiastically asked to join while nephew didn’t show interest, and you know he won’t be interested in rocks and parks and campers. He’ll be happily playing call of duty while you’re happily enjoying nature, everyone doing what they enjoy. It does suck that now you have to bring an 11 year old on your intimate trip with you wife. You weren’t the one that showed favoritism, but rather the kids showed their interests.\n\nI grew up a Ben, when we would rent beach houses as a family I would bring my xbox along because I hated the beach. I had fun playing cod at home all day (besides shitty beach house wifi), everyone else had fun getting sunburned and sandy, then we’d all have fun going out for a meal. No point bringing someone to a situation you know they won’t have a good time being in.", "NTA and it strains the bounds of credulity that your sister could even suggest that. Taylor enthusiastically asked if she could come; Ben said: “Is there a TV in the camper?” Like what are you supposed to do here, beg a kid to come on a vacation that they won’t enjoy, which will inevitably lead you and you wife to not enjoy your vacation, just to give your sister a break?", "Definitely NTA. This was YOUR trip, not a planned 'with the niece/nephew' trip. Taylor invited herself and you accepted. Ben heard and could have also piped in that he wanted to go, but he piped in with his requirement (is there a tv) and when his requirement wasn't met, he didn't ask to go. If you ask Ben to go, I have a strong feeling Yasmine will pressure him to go, against his will, and he will be one unhappy camper. Maybe next year he'll be interested in other things beyond screen time, but it won't kill him to not go this time.", "NTA. Yasmine is mad that she won't have a chance to dump her irritating kid on someone this upcoming summer. She's not concerned about her kid feeling left out, she's concerned she doesn't get a kid free vacation. Ben would not bring anything to the trip other than attitude. Taylor is going to help make great memories. You didn't even ask Taylor, she brought it up. If Ben were interested, that would have been his time to speak up. \n\nNo, this is his mom upset she doesn't get rid of him. And an 11 year old being a rude and sarcastic smartass? That's not the age. That is on his parents.", "NTA.\n\nClearly, Ben will not enjoy and doesn't like partaking in outdoor activities.\n\nForcing him to come would make everyone miserable. Yasmine needs to entertain her own kid.", "NTA", "NTA.", "NTA\n\nYou can bring anyone you want.\n\nAnd how much fun would Ben really have anyway?", "NTA. You are allowed to ask/not ask whomever you want on a trip. I don't blame you for not wanting to deal with a nephews attitude while doing something you and your wife enjoy.", "Pull him aside and say “hey buddy, I’d love to have you along but it’s going to be an unplugged event for several days. You down for that? Pinky promise?”", "NTA for not asking him to come, but please be careful how you act/talk around Ben. You do come off as having a favorite, and that could really hurt him (and contribute to him being \"unlikable.\" I have a teenager and two pre-teens, so I definitely understand the attitude can be a bit much). Kids hear and pick up on more than you'd think.\n\nWith that out of the way, there's a difference between treating kids equally, and forcing one to do something the other likes but he doesn't, just to keep things \"even.\" It doesn't sound like Ben would want to go on a geology trip, because there's no internet connection in the camper. \\*However.\\* I do recommend you find some way to spend some one-on-one time with Ben and do something that HE would like. Take him to ComicCon, or something like Blizzcon, or purchase tickets so he can see the Overwatch League compete live against other teams, that sort of thing.", "NTA, Taylor asked to go and Ben didn't.", "Mmmm. I'm gonna say NTA. However. \n1. Taylor was too forward and a bit rude to invite herself to your vacation. Normal thing for a kid to do though and shows her enthusiasm for what you are going to do. She asked, you could've said no but you didn't so I'll assume it doesn't make you uncomfortable to take her with you.\n2. Ben would probably not enjoy it. BUT. The polite thing is to ask him. He can say no. I wouldn't ask him in front of his parents but I would tell him that if he wants he can come.\n3. If he did want to come with you, I would take BOTH kids and set some rules for the trip. Clearly and firmly. If there's something they don't want to do they are old enough to stay in the van watching a movie or whatever. \n\nAll of this assuming that he doesn't have terrible behaviour. Talking back to and having conflicts with parents as a preteen/teen is very normal but they usually don't have the confidence to talk that way to other adults, like uncles and such. You are the one who know him best but if you agreed to take him and laid down the rules and consequences he probably would behave.", "NTA! I think it’s toxic for people to expect other people to invite or include their kids. At the end of the day if it’s so important for her son to go she can pay up and go with him. Don’t give excuses or apologize. It is what it is.", "Gentle.  If he is asking if you  have a TV in the camper, you will be stuck with him watching TV all day, so I would not want to invite him, but next time do not invite others in front of him", "NTA at all. Taylor sounds like she has interests. Ben sounds like he has an addiction. Is it his fault? Probably not. \n\nTell him you’ll take him but there’s no iPad or video games allowed. Maybe that’ll open his eyes to the world.", "NTA. I would say you could take Ben on a \"starter\" trip to see if he is interested in these outings in the future. Something small and easygoing  to see if he even vibes with this sort of stuff once he is removed from everyday life.", "NTA in ANY way\n\nTechnically, you did not even invite your niece. You talked about a trip and she asked to come. If he wanted to come then he could have asked as well. He didn't. I would be respectful but advise my sister that it is your decision on what you do and who you are inviting. \n\nIf you bring a kid to something that he does not want to go to it WILL not be a good time for everyone else. Unfortunately, it sounds like your sister is making your nephew entitled. He obviously did not want to go otherwise he would ask to and then your sister calling you to try and make you feel bad about it. It does not look good.\n\nThe best case scenario is that he stays in the camper the entire time and you, your wife and niece go out and have fun. The worst case is you force him to go with you, he complains and argues the entire time. Everyone has a crummy time and then you deal with this on the NEXT camping trip you go on and he doesnt go.", "You will be the a-hole  if you don't invite Ben, but setting some ground rules on both kids attending may resolve the issue.  Tell both kids that this will be an electronic-free trip and that they will be required to participate in the activities . . . In other words, there will not be a situation in which the group has to be divided so that some can participate and others don't.\n\nI think if you set these requirements, Ben will naturally opt out if it is not his cup of tea and then the sister can only blame her son, and not you.", "I could swear I've read this one before a few weeks back.", "NTA but  mildly rude. Taylor was rude, too, to invite herself on your vacation, but she's a kid. However, you shouldn't have said yes in front of Ben without inviting him, too. You could have put Taylor off and addressed the issue with her parents and her later.  I would not want to bring Ben along either because he does sound like he would stay inside the whole time either watching TV or on his computer, and it changes the nature of the trip if one person refuses to join in. However, I disagree that you have to babysit an 11 year old who wants to hang out in your camper while you explore the park.  He's old enough to stay behind and watch tv or do whatever without you.", "NAH. I feel like your feelings are valid here based on what you've said, but I'd spend some time with him before and cater a day to his interests. Otherwise, you'd be TA.", "NAH. You might offer Ben but tell him there won't be any electronics allowed or working. He'll say no.", "Yta just ask him he would say if he wants to go or not and she’s right you are playing favorites", "YTA you have to ask him. Maybe he can tell that you don't like him a lot, and he notices that you are treating him differently. You have to treat them equally even when one of them is more \"difficult\"", "YTA\n\n>Ben could have said if he wanted to go\n\nIt is incredibly rude to ask to go on someone else's vacation. So no, Ben could not reasonably say he wanted to go too. And you were very obviously playing favorites.", "YTA, just ask if he wants to come too, if he doesn't he'll say.", "YTA- he’s a kid and it would be rude of him to ask to come along. As the adult, ask Ben if he’d also be interested in camping, hiking and looking for rocks.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am the child-free uncle of two children. Taylor is the daughter of my sister Mary and Ben is the son of my sister Yasmine. I love both of those children dearly. I held them the day they were born, changed their diapers, heard their earliest words, told them all sorts of absurd Uncle tall tales and generally watched them grow from babies to children and now into preteens. They are both 11, only 4 months apart in age but they are vastly different. Taylor is a fairly rounded out, she's into the typical pop culture preteen things you'd expect at her age & she also plays sports & has a strong interest in science & the outdoors as well, which is a subject we definitely bond over. \n\n\nBen is a different story. Since the age of 8, Ben has been glued to a computer screen of some kind and I can't recall the last time I saw him where he did not spend 90% of the time playing on a computer/ipad/etc. I’m not judging him for this, just a statement of fact, though I do think it's a bit concerning but that’s a issue for his parents. Additionally, though I love him, Ben has become more difficult to like lately. He’s often rude, sarcastic, and acts like a smartass. I know this is partially part of his age but his parents don’t push back against this enough in my opinion. Also worth noting is he is rarely ever wants to participate in any activities that aren't digital. For example, recently we had a family get together at a lake and Ben just stayed inside the whole time. \n\n\nRecently my family had a few get-togethers and at one my wife and I were talking about a trip that we are planning for the summer. We recently purchased a camper and we are going to do a road trip to a nearby state to do some rock hunting (We’re both amateur geologists) and we will also stop at some springs and parks and such. This is planned for early summer without solid dates yet. Taylor was very enthusiastic about the idea and asked if she could come along. My wife and I were both ok with this and told her we’d have to talk to her parents. This was done with pretty much my whole family around, including Ben who was on his computer. I know he was at least partially listening because earlier in the conversation he asked if we had a TV in the camper. \n\n\nLater I got a call from Yasmine who accused me of favoring Taylor and excluding Ben because I didn’t ask him if he wanted to go too. I told her that’s ridiculous, Ben could have said if he wanted to go and honestly he has never shown any interest in kind of things we'll be doing. Yasmine said we're still leaving Ben out, which I suppose we are but ultimately this is my wife and I’s trip and I don’t want to spend big chunks of the time dealing with attitude, or fighting to get Ben to come along with us, otherwise I foresee at least one of us having to miss out on many activities because Ben will refuse to do them and just want to stay in the camper. \n\n\nSo AITA for not asking (and not planning on asking) Ben if he wants to come along?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. If Ben wanted to come, he could have asked like his cousin did. You are under no requirement to invite people on your vacation.", "NTA.", "NTA  but sounds like the kid needs a break from his own head. Say if he comes there will be no screen time unless prescribed, he cant brings tablets or games or phones and I suspect he will make the decision for you. If he wants to go, tbh, this might be the break he needs from all that. Engrossed in gaming all the time can make people seem self centred, quick to anger,and he clearly hasn't had great limit setting from his parents. Perhaps this is what he needs to get him back on track?", "NTA", "NTA. It seems clear to me that OP was caught off guard by the request. Only in redditland do people have the perfect answer at the drop of a hat. There's also this idea that siblings need to be treated exactly the same otherwise the OP is a monster. Ben is an AH. There is mitigation in that he's a kid growing up and will presumably settle down and be less of an AH in the future but he's an AH now. I see nothing wrong in Taylor making the request, kids are cheeky acquisitive monkeys, always pushing at boundaries. It's a tough call as to whether OP would be an AH if she did not invite Ben but I am going for NTA provided this does not become a pattern.", "NTA but maybe you should consider better engaging with Ben in his interests. It isnt his fault that you don't have similar interests, but as the adult you could do more. Maybe see if there is a gaming convention in town or similar, he deserves your time and attention as well", "NAH  Your nephew asking about TV in the camper was him fishing for an invite most likely. It at least does show he has an interest in spending time with you all. Doesn't mean you have to invite him, especially if it means ruining the trip for any of you. Obviously your sis is mad because she feels like you excluded her boy, but has he expressed being upset he wasn't invited?  If yes then maybe talk to him only so the distance between you doesn't grow.", "You might enjoy the movie The Way Way Back.  Try to remember that every kid is different.  Give Ben an opportunity to shine (not necessarily on this trip).  Have you tried engaging with him on the things he likes?  Let him teach you a game?  I get that he’s not like you - maybe he needs someone to take an interest in what he’s interested in.  If no one else in your family is like him, and no one encourages his interests, that might explain why he’s not the friendliest kid.  Don’t discount him because he’s an introvert who likes video games.\n\nETA—forgot to say you’re NTA about the trip.  It doesn’t sound like he’d enjoy it.  But I do think he might feel left out, even if he doesn’t want to go (if that makes sense).  It’s hard to be the different one.", "NTA.\n\nI’d say Y-T-A of you had invited one over the other, but that’s not what happened. Taylor asked to come along and Ben did not. I’d tell Ben’s parents that if he comes to you independently and wants to be included you will of course take him, but if he doesn’t express any interest then you won’t force the issue", "I'm going to go with a very soft YTA, I can't blame you for not wanting him along but extending an invite to her and not to him, in front of him, is pretty insensitive.\n\nI realize she asked but you could have brushed her off and changed the subject to avoid hurting Ben's feelings and discussed it later.\n\nThat said, just because Ben doesn't outwardly express interest doesn't mean he isn't. He could just be shy and not want to impose. It's possible he has other interests he doesn't get to explore and finds electronics as his only outlet. I can certainly related to that.", "YTA, sorry he’s a moody kid? He’s at that age where it looks like he’s isolating himself but you’re treating him differently and basically telling him he’s not invited. Even if he says no, you should’ve just offered. What was the harm in saying hey buddy wanna come with? The worst thing he can say is no, but he’ll remember that you CARED ENOUGH TO ASK. Yeesh, who plays mind games with a CHILD? \nThe always online part isn’t good it’s pretty toxic for a kid to be online to begin with but it’s not your jurisdiction his parents will hv to deal with that.", "YTA for talking about it in front of Ben. Best response would have been, \"we will discuss if you can come along later\". That said, I get why you wouldn't want Ben on this type of trip. My son and daughter were polar opposites and my son hated outdoors activities. I mistakenly took them both on a trip that involved kayaking, parasailing and more and my daughter missed out on many activities she would have enjoyed as my son wouldn't leave the TV/condo. \n\nCan you find something in common with Ben and do that separately? Comic book convention? Video game convention? Ask him to teach you gaming?", "YTA.  You have your favorite, let's be honest.  I'm going to tell you that I know what it feels like when an uncle clearly has a favorite nephew/niece.  It's a crappy feeling.", "Very light ESH \n\nYes, it WAS your and your wife's trip first and foremost. However, that did change when you decided to allow Taylor to join even if you didn't outright invite her. At this point if you don't also offer for Ben to attend it would look like favoritism, even if it wasn't intended to be (although it looks like that's exactly what it was).\n\nParenting aside, they are both 11 years old and while they can understand a good bit at that age their brains are no where near fully developed to be able to fully understand the dynamics of this situation. You would not be TA if you invited both or invited/agreeed to take neither, but its an AH move to include one and not offer to the other.", "I didn't invite anyone, Taylor asked if she could come when we were describing the trip we were planning and after my wife and I exchanged affirmative looks we told her yes. If Ben had asked to come along we would have told him the same thing, granted we might have followed up with a conversation later in private about what the expectations were and all that, but I wouldn't have told one of them yes and then denied the other", "It's not his responsibility to take his nephew anywhere. Perhaps his mom and dad could do it?", "They don’t have to do anything. They’re going on a rock hunting trip; and this kid is balls deep into Roblox probably.", "Taylor asked if she could go and that’s the only reason she’s going now. They didn’t invite her, I think it completely normal, especially for children of the same age, to hear one person ask for something you’d think it’s okay to ask too", "He’s 11 do you think he knows what rude is? If he wanted to go, he would’ve asked to go when he overheard the plans. Kids do that all the time", "OP didn't invite anybody though, Taylor asked them. If Ben wants he can join 'em too", "What if he says yes, though? OP clearly doesn't want to take unethusiastic preteen who doesn't like outdoors on a trip.", "It’s always crazy that people think video game kids don’t like things outside. I grew up a video game kid and would have loved things like camping but my parents never wanted to do that stuff. Habits/interests can very heavily favor how much effort parents are willing to/can put in.  OP also claiming not to have a favorite while very positively painting one kid over the other night show how the kid is always treated so he becomes more recluse", "Did you read the OP?  The worst the kid could say is \"yes\" (not no) and actually come and then be a buzzkill the whole time according to the OP.  I don't see any \"mind games\" here at all.  \n\nIt is not the OP's child so there is no firm obligation exists and why should the OP have to potentially ruin their good time just to extend an invite to a kid who sounds like he would have a miserable time if he came, along with ruining everyone else's time.", "OK, I would have said, lets talk later.", "Bottom line, you're taking Taylor on a major vacation. Are you doing anything to give equivalent time to Ben or to engage with Ben in a similar way?", "It isn't responsibility no- but it never hurts to try and connect with a kid at something more their level if you want to be in their life. It's up to OP whether they want to try and nurture a relationship with Ben.\n\n&#x200B;\n\nand this is OP's interest. If they want to engage with their nephew this is one of many ways they could do it- show Ben that there is no game of favorites and that his uncle still wants to connect with him. I was just suggesting something that could help mend fences and help Ben explore and grow.", "Yeah, Taylor was rude when she did that. And OP didn't then look at whether the situation was equitable or feel out if the other kid had any interest. These are kids - to have a relationship with a kid, especially an introverted one like the nephew you can't just wait for them to come to you, or expect them to make the ask to spend time with you.", "Or he was shy or nervous of being rejected because he already has the vibe that OP doesn't like him as much - which was real clear from the post.", "I was the same at that age but would've loved to opportunity to to go out for the summer like that, being indoors a lot doesn't mean he wouldn't enjoy the trip, it just means its out of his comfort zone, it may take a day or 2 to adjust", "Yeah, I lived with my grandparents as a kid. They loved to criticize me gaming but all they ever wanted to do was watch TV. And to add on top of that they were super controlling and barely let me see friends. \n\nSo it was either TV, games, or go outside and kick rocks alone. I chose games but there was so much more I wanted to do. I was jealous of all the kids that got to go hunting, fishing, camping, etc. \n\nAnd now as an adult I'm stuck in the same loop because I don't know how to do any of those things ,where to start, or have anyone to go with. But that's totally unrelated.\n\nKids are products of their environment.", "It’s his nephew not some random kid. So what if he comes and is a buzzkill? He’s a KID don’t take it so harshly, be patient and he’ll come around", "sure, in hindsight. it came up naturally, OP responded to what was presented in real time. Later all the tangents poked their heads up. It's also true that one more is one more and two more is two more. Especially in a camper. Which is to say, one more might be tolerable and two more might not be. Depending on the camper and the campers.", "It sounds like mom and dad are the ones letting this young man get away with being a little obnoxious. It's not the uncles job to try and correct this.", "I agree Taylor asking was super rude and if I was in that position I would have said no because I want my vacation to spend time with my SO whether the kids doing everything with them or not it’s still babysitting. I’m just saying Taylor asked when people are saying it would have been rude for Ben to ask and that’s why he didn’t. It is rude but I can kinda see where since one child enthusiastically asked about their plans and if they could come and the other just asked if there’s a tv in the camper and then didn’t ask to come I can imagine OP thinking that kid wasn’t interested because he didn’t ask to come like his cousin just did", "It's only rude if the family dynamics make it rude. In my family, if you talked about something in front of people- like planning a party or a day trip- then people could ASK to come along too. If you talked about it in front of people, it was almost like you were inviting them along. \n\nSo OP gets to decide if it was rude of her, or if she acted like a normal excited young person who politely asked if she could come. OP doesn't seem to think it was rude at all, given how they wrote the post.", "No I don’t think 11 year olds pick up on unspoken vibes, I think he’d rather be glued to his screens than be a moody bored 11 year old in some state park somewhere he doesn’t care about. And OP here would also appreciate that.", "He might. He might not. It's hard to predict, and OP didn't even plan on inviting any of the kids in the first place, Taylor specifically invited herself.", "Yes. NEPHEW. Not his own kid, his nephew. OP is childfree, so it stands to reason that OP would want a limited amount of time with children.", "Agreed, which is why I said very soft YTA.  But I would not invite another kid who is likely just going to be a PITA", "I largely agree, and I don't think OP needed to specifically take the nephew on this trip. But if OP was fine to take Taylor on a week long vacation, he needed to make some effort to also connect with Ben one-on-one in an activity Ben would enjoy. That's where IMO OP started playing favorites.", "Taylor asked and after a discussion op said yes, at that point asking the nephew is the next obvious choice, not asking while he's listening to the plans is rude, even if he is 11 asking him can't hurt.", "Sure if spending time w his nephew isn’t enjoyable then that’s his personal right to not ask. But it’s called AITA not am I justified in not being very nice. At the end of the day, his call.", "He didn't ask his niece either.  She asked to come because she is obviously interested.  This would be entirely different if the nephew also asked and the OP said no but that isn't the case and I don't feel like the OP needs to ask if for whatever reasons he doesn't want to.", "Sure but it’d be nice to try to involve his nephew if his sister is already going. Agree to disagree: we hv different conclusions you don’t think it’s necessary, I think it’d be nice if he tried (as the adult he’s more emotionally composed than his nephew yes?)", "I would agree with you if they were just going to Disneyland for the day or something of the sort.  But to have to care for a kid who doesn't seem interested in what they will be doing for a whole week is a recipe for disaster for EVERYONE, including the nephew.", "NTA.  I would tell her that there is no way you two are missing out on activities that Ben will not want to do and you won’t have electricity or internet or even TV a decent part of the time.  (Traveled in a trailer and in vehicles.  Lots of places have no internet.  If campgrounds do have it, it is crappy or only on limited locations.  Some have TV connections, but it’s not like home most of the time and there are quiet hours, so no generators past a certain time if you have no electrical hookups.). Yasmine has no clue about any of that, so give her an earful.", "Nta", "NTA", "NTA your sister wants a kid free few weeks. If you take her kid you will have a miserable time.", "NTA. However, for the sake of peace I would offer to take Ben along with specific rules. 1) No electronics allowed on trip except for certain times (ex: while you are driving there and back, for an hour or so after dinner etc). The rest of the time electronics are LOCKED away. No exceptions. 2) All planned activities are mandatory to come with and no one is staying back to watch him because he’s not interested.\n\nI’d be willing to bet he won’t want to come if he’s that addicted to electronics. Your sister would have to back you up completely on this though and make it CLEAR she agrees with these rules to him before the trip. She’ll have to tell him point blank “don’t call me asking for him to bend the rules. It’s this or don’t go”. If she’s not on board and willing to help you enforce these rules then it’ll turn into him whining to mommy to get you to cave in. If she’s not willing to do that then she has no one but herself to blame for you not taking him.\n\nEdited to add- I also agree with many others on here that part of why your sister is upset might be because SHE wants a kid free vacation too. I’d make it clear to her that you aren’t ruining your vacation for the sake of giving her a “break”. If she wants him to come then it’s play by your rules or not at all.", "NTA. But you could have asked out of consideration, even knowing the answer is a sign that you care and would avoid drama.", "NTA but if you know Ben isn’t interested you can ask and let him say no to prove it to his mom.\nJust a thought", "NTA But i would plan sth for ben \nOr spend extra Time with him doing things he likes \n(Or get him sth he would want) \nOtherwise he will feel kind of left out even if he don‘t want to come along. He is just a Kid", "NTA. It's your trip and you get to dictate who gets invited to come along. If I were you, I'd flip the script on Yasmine: \"Yes, Ben's not invited, because he is a pain to be around these days and hasn't expressed an ounce of interest in this anyway. He's free to go spend time with rude family members who are glued to their screens like he is.\"", "Maybe send one day with both children and see how it goes.  If things turn sour as expected, explain this is why your not comfortable bringing him along.   NTA", "NTA I'd bet a good amount of money he didn't complain one single bit about not being asked and probably preferred it", "Nta but maybe tell Yasmine this will be a screen free trip and to ask Ben if he is fine with a screen free trip.", "NTA but don't complain if your relationship with your nephew never improves because you obviously prefer the other one more", "If Yasmin pushes it, be sure to emphasize (in front of Ben) there will be no TV, computer, bringing hand held electronics like a Switch, etc by decree.  As much as Ben probably needs to be unplugged for a week, he'll make everyone else miserable.  NTA", "NTA. I can't speak to Ben's mother's motives. However you need to learn a little bit more about Ben and what his interests in digital media are. Relationships are simply interacting with others bases on some shared interest, be it family, an activity or shard issues.", "NTA\n\nIt’s one trip. I grew up with a lot of siblings and cousins. I didn’t get to do everything the others did and visa versa. As long as you’re not systematically trying to bond with one child and not the other, then this is just how interests happened to align this one time. That’s life 🤷‍♀️", "NTA\n\nBen doesn’t want to go either.", "NTA. Do you want to squash four people into a camper when one of them has expressed no interest to you in coming, will most like have an attitude, and both will need supervision? I wouldn't enjoy the trip you're going on. You don't need to ruin your trip because your sister thinks it's not fair. She can express that opinion and you can ignore her. \n\nYou are not their parents, it's okay for you to say yes when one asks without having to follow up chasing after their cousin.", "NTA. \nHe wouldn’t enjoy it.", "NTA. Taylor asked if she could come, Ben didn’t.", "Nta, you didn't invite anyone. Your niece asked to go with. Theirs a very big difference. Also I would not take my nephew if I knew he wouldn't have fun with us and would be stuck to a screen all day. Nta, you did not invite anyone. I feel that it needs to be repeated. You're not playing favorites.", "NTA.  You didn't invite her, she asked if she could come.  And it's not like there will be reliable wi-fi in a lot of places to go camping, so Ben wouldn't have fun anyway.  At any point, has he even said he wants to go?  Doesn't sound like it.  I think his Mom just wants him gone for a week of free vacation.", "NTA\n\nYasmine is sick of him and wanted a break and used whatever hurtful words she could to trigger your guilt and because you seem to be a pretty nice person, it did work as you felt bad enough to post on here. All you'd be doing on the trip is stressing out.", "NTA Etiquette wise aunts and uncles can play favourites.", "yta. it’s a lot of onus to put on an 11 year old to\nspeak up and ask to come along on a trip they weren’t invited to, specifically one that seems to be fairly introverted. quite honestly asking to come on vacation can be seen as pretty imposing and rude, and I wouldn’t fault a child for not doing that, if I was taylor’s mom i’d actually be a little miffed she thought that was appropriate honestly. a lot of kids turn to online games when they don’t receive a ton of attention at home. it would be kind to atleast talk to ben and see where he stands, there may be reasons you’re unaware of of why he’s generally detached and this could be a really nice opportunity for him.", "NTA…. So Yasmine can’t figure out how to get Ben to put down the IPad get off his butt and get a little exercise, and learn how to communicate with the rest of humanity,  so let’s accuse the kind uncle of favoritism and guilt him into doing those things, so she and her husband don’t have to.  You are in no way favoring on child over the other,  you got your answer as to what Ben was interested in when he asked if the camper had a television.  Try this, tell Yasmine that you know a place where the can rent a camper and come along on the trip, that should be the last you hear of including Ben.", "NTA you didn’t invite Taylor, she expressed an interest and asked if she could be included. If Ben was also interested he would have spoken up.", "Just invite Ben - he probably won't come anyway. Its not the kind of thing he enjoys and he doesn't sound like the kind of kid who would go along with it just because.\n\nOn the other hand, his mother might try force him to go because she wants a break from him as another poster said.\n\nAlso consider - what if you invite him and he comes along, and enjoys himself? What if he comes out of his shell a bit?", "I also think this trip sounds like this kid's idea of hell. Not everyone has the same interests and obviously the OP is going to take the child who is interested.", "🥇", "I think if she tells him there will be no TV there, he won't come", "This is what my wife and I have been thinking. If Ben cares enough to ask or even just bring it up, we'll tell him he is welcome to come. Of course there will be a conversation later regarding expectations and all that. Summer is several months away, so plenty of time for things to change.", "Agreed, the mom KNOWS Ben wouldn't be interested, and would likely make the trip awful.", "many people would consider it very rude to invite themselves on a trip. especially a kid without even asking their parents. i’m not sure why you think inviting yourself in someone else’s vacation is appropriate but waiting to be invited is not", "it’s not normal at all, it’s incredibly rude", "And you’re aware he wouldn’t also be interested based on ...nothing.", "Why would op won’t to take a kid that is rude and dismissive anywhere? And why should he? And why should the neice that doesn’t have an attitude be punish for his bad behavior?\n\nThese kids are 11. It’s time the parents teach them if you are rude and have an attitude others will not want you around and you will miss out on opportunities. It’s time to teach actions have consequences.", "Again not his job- just if he wants to be an adult in this kids life and help him. \n\n&#x200B;\n\nGetting him some time away from his parents may be helpful actually. \n\n&#x200B;\n\nNot his responsibility but if he wants to have a relationship with his nephew he has to...do things with his nephew?", "11 year olds absolutely pick up on social cues are you kidding me? this is literally a prime age for bullying. they’re 11 not 2", "Bro she is not her sister.\n Taylor is Op's 1st sister daughter.\n Ben is Op's 2nd sister son.\nSee the difference.", "NTA for not inviting him, but I'm not sure why we needed a whole paragraph about Ben being on screens a lot - I think you love them both, but it really made me believe you don't view them the same way, despite your insistence that you do.", "NTA", "NTA", "NTA. Tell Ben that there will be no connectivity, and maybe even no cell coverage. That ought to make it clear to him that he doesn't want to come. At that point, Yasmine has nothing to complain about.", "Nta Taylor asked to join and Ben didn't. \nAlso you should mention to your sister if you ever agree to take her son with you anywhere, then he would need to participate in all activities there would be no negotiation.", "NTA, but I wonder if it might be worth speaking to Ben one on one and seeing if *he* actually has an issue with being left out or it's just his mum. Just frame it as something like \"Hey, I know Taylor is coming with us, I don't want you to feel left out but we figured it wouldn't be your sort of thing\" or something like that. Or if he's into 'digital' stuff maybe you can buy him a new video game to 'even it out' a bit?", "NTA...  I have 2 son and they both got mouthy at that age..  You could have asked well explaining that no electronics allowed..  He prob. would have said no at that...", "Nta", "Tell Ben and Taylor that the trip will be no-screens-allowed.  If Ben wants to go, it might be the best thing that ever happens to him.", "NTA. Ben would hate this kind of trip and everyone (including him) would be miserable", "NTA", "Just tell Ben no screens at all including tv in camper. He won't want to go. Problem solved\n\nNta", "NTA  Ben sounds like that \"vacation\" would be hell to him.  Taylor sounds like she'd enjoy it.  Different things for different children.  I have children more like Ben and more like Taylor, and it's very difficult to plan a vacation that keeps everyone happy, but you weren't trying to do that from the start.  Tell your sister that if you plan a vacation more along Ben's interests, you'll invite him along then.", "nta sounds like your sister wants you to take him so she can have some time off.", "NTA.  If he was your kid, you should bring him.  But he isn't.  You hold no sway over him.  And it sounds like an amazing outdoor themed adventure.  Bringing an angsty kid who only wants to be on screens, yuck.  I think you're right that one of you would have to stay behind to babysit him while he stays on the screen.  Or you force him to come along and deal with the major angst.  Either way, loads of poo on your vacation.  He didn't ask to go because he doesn't want to go.  I understand where his mom is coming from but she's making something out of nothing because again, her son doesn't want to go.", "NTA - come on, we all know your sister is looking for a vacation.", "Nta", "NTA. Tell his mom when he isn’t glued to a screen 24/7 you’re happy to have him on a trip in nature. But you’re not interested in being a babysitter and dealing with his attitude.", "NTA my mom used to pull this shit when I didn’t want to even go but she didn’t want me to Be left out", "NTA at all. Your vacation, your choice who you bring with you. My grandparents took all their other grandchildren on vacation except for me and my younger sister. They’d take two a year from oldest to youngest. My lil did and I are the youngest in the bunch. But they did not take us two when it should have been our turn because my younger sister had disabilities they weren’t really able to deal with. So they just decided not to take us. It’s not fair to blame them for it and I certainly don’t hold a grudge or think I was entitled to go.  It was their choice. Sure I’d have loved to go out west with them too, but it wasn’t my place to invite myself or for my parents to invite me along themselves. \n\nMy question is did Ben say to Yasmine he wanted to go too? Or is she just Stirring up trouble where there isn’t any? She sounds as if she has her nose out of joint by her perception more than Ben does. When he heard Taylor ask to go along, he would have said “me too” if he wanted to. He didn’t so he may not even care.  Especially when he hears it’s all about outdoor activities and not his interest. \n\nYour sister needs an entitlement reality check. She has no right to accuse you of playing favorites when you didn’t even do that. Especially when Taylor invited herself and you didn’t officially agree to take her. Even if you had, not taking Ben along is still not playing favorites. You could simply say,\n\n “I’d rather do something else special with him that is more align with his interests. He would probably not enjoy camping and I wouldn’t want him to be miserable”.  \n\nBut in the end, Yasmine is still wrong with her accusations and entitled attitude. Also, this is a great time to point out to her that her preteen son’s attitude problems and inappropriate behavior is consequently making him not receive invitations for vacations because no one should have to tolerate a misbehaving rude child.", "NTA", "NTA and I want to go rock hunting", "NTA. But maybe it would very much benefit Ben to go as long as you make it a no screens trip. I imagine the first day or two is going to be tough, but it would be really good for that kid to experience the world in person. \n I would invite him if I were you. You can do a lot of good for a kid who needs it! He might not know it yet, but digging for rocks and crystals is way more fun than video games! Regardless, I wish you all the best.", "NTA. I have a relative who is exactly like your nephew. His mother has always made sure he is included on every activity and trip. He’s hated every one and has whined and been an asshole every time. His actions ruined every family activity. His mother said to give him a chance. Also, that he would outgrow it. \n\nWell, he’s almost 20 now and still acts the exact same way! It still ruins all the fun! His mother is still in denial. I refuse to be around the guy.", "NTA.\n\nBen's leaving HIMSELF out.\n\nI think Yasmine just wants a little time w/o Ben around...which doesn't speak well of her / SO's parenting, IMHO.", "NTA.  My husband had 2 nephews that we spent a lot of time with when they were younger. At around age 11, we actually started offering them \"alone visits\" where each would come on their own and we would focus on that nevvie's specific interests and indulge spoil each one separately.  They loved it.OP, perhaps you can meet Ben on his terms and offer him something HE would like? It doesn't have to be a road trip. Maybe a sleepover at your place just playing video games and going to a cool movie. Or maybe even taking him to a fan-con (if your sister agrees).  You might all really enjoy it when he shares his enthusiasms with you.  \n\n\nEdited for phrasing", "NTA. But a few of these comments feel very comfortable judging an 11year old they’ve never met. This is the age where most mental disabilities/illness start showing symptoms. Not that he has any but, He like lots of boys his age sounds anxious and insecure. My advice would be trying to find something he’s into and doing that with him and your wife. He’s at a difficult age, if nobody breaks him out of shell and tries to see why he’s so rude and sarcastic he’ll probably just continue down the same path.", "Plan a trip another time wirh activities he will like (or could) \n\nFind an old style arcade. Take him to do some techie things. Maybe visit something space related?\n\nI see no reason for him to go on this trip, but you can probably put some effort into a trip he would enjoy. And that could entice him away feom his devices.\n\nNTA", "NTA. Talk to Ben, and tell him be is welcome to come. However there will be no screen time at all. And you won't bend. He will also be forced to participate in all activities.  Bet he doesn't want to come.", "Except that he's only 11. He hasn't experienced very much and he might actually like those things. Rock hounding is so much fun, a real life treasure hunt. I think most 11-year-old kids who got to try it would end up loving it.", "Why? OP didn't ask his niece to join him, she was the one who initiated the request. And honestly this is all OP's sister's action. Ben doesn't seem interested.", "I’m going to let you in on a secret, people are allowed to have favorites. Parents shouldn’t show favoritism, but other people are allowed to like kids for who they are. We’ve got to stop teaching pre-teens and teenagers that they can be rude and it’s okay because they’ll still get treated the same as everyone else. No. Their behavior matters.", "Exactly!", "The irony is the two sibling are fighting over this and ben probably doesn’t even wanna go", "Yeah the idea that an uncle can't favour one nibling over the other because they have a shared interest is ridiculous.", "Truth. Why does OP have to spend any fun money on Ben if OP is not interested in those things? OP isn't the parent.", "Relatives shouldn't show favorites either. It's damaging to a child's self-esteem over something they have zero control over (who they are and their hormones changing). And he wasn't being rude. If anyone was, the daughter was, by inviting herself on someone else's vacation.", "I doubt he'd ask. It definitely comes across that you don't like him", "I would have thought. Very brave of her, I am too afraid to do it as well. But maybe, they will ask me? Not everyone is the same.", "They aren't siblings, they're cousins.", "Based on the description that OP provided. If the kid can’t put down his iPad for an hour to hang out with family what makes you think he’ll be fine for a weekend going hiking or looking for rocks?", "I think they mean that the uncle and OP and his sister Yasmine are fighting, they’re siblings.", "asking him.... the fact he uses his ipad when no\none from the family makes an effort to interact with him does not mean he’s incapable of engaging when someone extends an offer in participating to him", "That does make sense....oops!", "Yeaaaaah NTA. There was a point in my life (not saying he’s at that point to, just pointing out similarities to my situation) where I was glued to a screen bc of my mental health issues and wanted nothing to do with outdoor activities. Honestly I think Ben would be happier at home where his computer and/or console is", "NTA\n\nDoesn't even sound like Ben wants to go", "NTA. this seems more like your sister wanted a vacation herself and is mad you didn’t offer it to Ben; so she could accept for him", "NTA. You didn’t even invite your niece. Precocious lil girl invited herself lol. You didn’t have to say yes but I understand why you did.", "NTA. The key here is that your niece expressed interest in the trip and asked to come. Your nephew could have done the same but he didn't, which if I were his mom I'd assume meant that he.....wasn't interested in going. There are many ingenious ways to make yourself miserable, but in my opinion as the parent of four kids, three of whom are between the ages of 16-11, the most reliable method is to foist on a teen or preteen some ongoing situation you know they'll hate. Works every time.  Your nephew is how he is right now, and there's not much you can do about that, but if your sister wants you to spend quality time with her son, rather than just fobbing him off on your for a few weeks, maybe suggest you come over anbd game with him or something from time to time. Meet him where he is and he won't forget it, even if he seems unappreciative or ambivalent at the time. But don't drag him along on your awesome trip when he obviously doesn't want to go. No one needs any part of that nightmare.", "NTA.  OP didn’t exclude Ben.  OP didn’t even invite Taylor.  She asked if she could go along.  Ben didn’t ask to go along so obviously he isn’t interested in going.  OP is not favoring Taylor over Ben.", "Ahh you r butthole.  Oh no ben likes games oh nooooo!", "NTA If Ben wanted to join he could and would have spoken up like Taylor did. If your sister is adamant about Ben going then make a condition of his joining be that he leaves all electronics at home. Ben will quickly decline to go.", "NTA - honestly Ben probably doesn't WANT to go.  If you invite him now, his parents will make him go to prove a point and you'll all be miserable.", "Tell him no computers on the trip and he’ll turn it down!", "NTA.", "NTA\n\nSounds to me like the kid is only interested in going (if he is interested) because of his cousin going.  I'm wondering, though, if he isn't being pushed to go by parents who are trying to get him away from screens for a while.  If so, Yasmine should be up front about that-- and it's still your decision.  Pretty sure the kid would be a wet blanket at minimum, if not an actual nightmare.", ">  Yasmine said we're still leaving Ben out   \n    \nNTA, Yasmine wants time away from Ben, and they saw that Mary is getting it and got jealous.  Unfortunately, they haven't parented in a way to make you want to do that.", "NTA. But to keep the peace you could invite your nephew, making it clear that he will not have the option to be glued to his smartphone the entire trip. That might be incentive enough for him to decline the invitation.", "No, that's completely normal for 11 year olds.  Yes the parents could teach them better, but 11 year olds are, in general, often little assholes.  11 years is that happy weird time when a kid is still a little kid but they're also becoming a middle schooler and growing up.  One day they're playing with toys and the next they're worried about their clothes and gossip.  It's a really awkward age and some kids start acting out because their hormones are just all over the place and life is extremely confusing.", "Eh, his mom could pressure him into going if she thought he had an invite.  It's also not bad that Ben learn that having a bad attitude gets you skipped at invitation time.", "this sounds like it will involve a lot of attitude and arguing which will ruin their holiday. i personally wouldn't invite him on any simialr trips until he shows he's out of his hormonal/computer funk and is willing to join in activities", "Because Ben is 11. He may have been too shy to ask.", "He might be too shy to ask. Wouldn't hurt to bring it up to him sometime when his parents aren't there (otherwise they may pressure him to go when he doesn't want to).", "Actually I think that Ben's mum wants to push the responsibility on making Ben interested in something else on OP. My family also has some gamers who are glued to their monitors and their mums would try out everything to make them get away from it - without much success.", "\n\nBen didn't ask to go so obviously he's not interested in going. OP is not favoring Taylor over Ben.", "He’s being “asked to participate” anytime he is out doing things with family so why would this be ANY different?", "I have a nephew like this, myself dh + our 3 kids, sister + her 4 kids & bro +1 booked a holiday for a caravan park(trailer park, they're used as holiday let's here, like a big hotel suite, lots of entertainment and pool etc on the grounds) to one relatively high in the Scottish Highlands, lots of hills to climb, forest trails to explore, lots of outdoors stuff.\nAll the kids but 1 were enthusiastic about it and loved it. \n\nNephew who was 13 at the time did nothing but sulk and huff because there was no WiFi, sometimes literally stomping his feet and screaming, fake crying,  shouting I'm tiiiirred after we hadn't even set foot outside of the camp grounds yet, less than a 3 min walk to the front gate. Ended up we all came home early because it was just ruined by his behaviour. \n\nI have a feeling that you might have something of a similar situation if you were to agree to take him. \nNTA", "NTA", "NTA. I think Ben’s mom is jealous that she’s not going to get a child free week like the other sister. Plan and simple. It’s not about Ben. It’s about her.", "NTA", "NTA \n\nBen was there to hear Taylor ask. If he'd wanted to go he would have asked. She knows he'd hate it and more than likely ruin the trip for the rest of you. She just doesn't wanna deal with her own kid for a week and Taylor possibly going gives her a way to get rid of him.", "NTA", "NTA\n\nTell your niece that you are sorry and something has come up, and you won't be able to take anyone with you.\n\nTell her you love her and if your sister says anything, let her know this is a mess of her making.\n\nGood luck.", "NTA. I wouldn’t take him either.", "NTA", "NTA \n\nI like what Atterfish up above said. \n\nInvite him if you wish with the caveat that he leaves all devices behind… and the at will be that. 😉", "Nta - my brother was like Ben . It’s just who he is , he is now thirty and living with someone and still prefers the digital world . He gets cross if you talk to him too much but we love him anyway . I don’t think you’re an asshole but I think you should make an effort with your nephews interests in case he does feel less loved but I don’t think you should need to take him on a trip . \nIf his feelings ARE hurt he wasn’t asked you still aren’t the ah but I would once again make time with him . Ben is still just a child and I’m sure he would like his uncle showing interest in his interests too", "Nta, sounds like Ben would not enjoy, and possibly complicate, the vacation. Not fair to have your trip ruined.", "NTA - tell him there is no Internet and any tv will not connect to games.     \nHe won’t want to go with you", "NTA, parents should treat kids as equally as possible, but aunts/uncles have no such responsibility. If you're happy to spend time with one niece/nephew, but not the other, that's fine.", "Tell her he's very welcome to come along if he leaves all his devices behind... something tells me that will be the end of it. NTA.", "I lol’d when I read this! Didn’t occur to me…but you are totally right! 🤣", "THIS. And also, lets face it, Ben would've hated the vacation. NTA", "Yup. The fact that Ben heard the entire conversation and Taylor ask to join the trip and stayed silent speaks volumes. He doesn't want to go. Mom insistence that he join would just be making everyone, including him, miserable. NTA", "That’s not fair, why do you say that? If my kid was left out I’d feel bad for them too, that doesn’t make me a bad mum", "He literally saw that’s how it’s done.", "He wasn’t shy about asking about a tv.", "Op isn’t going out of his way for either kid ones interest just line up that’s not bad op shouldn’t have to do extra effort for one.", "Perhaps Ben, in his shyness, said something to his mom when they got home and that drove her into irrational mode. \n\nI totally get what you are saying and you are 100% right. \n\nWhat is also right is a little boy has seen a series of exchanges and perhaps feels left out. And if the family is close, I’m used to a world where we find a path through that together. \n\nAnd there are 100 other things the OP can do to rectify. Last account I had, awkward as he may be, OP still loves Ben. \n\nThere are other paths than “fuck em”", "Earlier in the conversation, before Taylor asking. And it's an innocent enough question. There's a pretty big leap in asking about the camper and imposing on the trip itself.", "Ikr, Ben would probably want to stay at home.. poor soul. \n\nNTA", "All the kid wants is to stay in front of a screen so why wasting money on him if he can be as happy staying at home playing? 😂😂", "Agree.", "not necessarily. being dragged to a family event where everyone ignores you isn’t exactly being invited to participate", "Ah, yes. So dragging them into a different family situation will magically make him put down the iPad. Especially since he asked if they had a TV in their camper. Hint: it wasn’t for amateur geology videos", "i’m not sure where you’re missing the point of just ASKING him. I didn’t say force him. I said ask him. extend the courtesy of telling him what the trip will be like and what the expectations would be if he attends and ASK him if he’s interested. he’s free to say no. he’s also free to explore opportunities to enjoy something he doesn’t ususally. why are you so bitter towards an 11 year old? relax dude", "I’m bitter? I’m realistic about the fact that these people are under no obligation to parent a child for a day or weekend or week who clearly enjoys only one thing. If the parents were looking for a babysitter for a weekend then I guess they missed out.", "Clear say this is a trip with her and he gets a trip later in a tent with no electronics next!! Its the next trip on your list and its for him!!", "NTA but I think you should invite him - and tell him that it’s an electronics-free trip. If he decides to go, it will be a great chance for you to bond more with him and it will be so good for him!! But he won’t want to go.", "NTA. You could ask Ben if he wants to go. Be very clear with  him what the expectations are: there will be no wifi. He will be expected to go rock hunting, hiking, participating in all the activities and no staying in the camper.  He will probably decline.", "This would be like someone not inviting me to go camping (like actual sleeping outside camping). I have zero interest in it and everyone knows it. Camping is the last thing I would EVER want to do, and I’d be thanking heck I wasn’t invited 😂", "NTA at all, it’s fine to not have someone on a trip that literally doesn’t wanna be there. Ben is very blatantly not interested and I don’t see the issue.\n\nOne thing I will point out - please do not be harsh on him for not being interested in the outdoors like you are. I am disabled and have been for my entire life, but I had no idea of this until recently (I’m an adult now). I had no idea what was wrong with me, why I hated doing physical things that others liked. I felt pathetic and weak and like I wasn’t trying hard enough, so I would do my best and still get pushed to do more by my peers and the adults around me, and it made me really upset. With a disability diagnosis, all of it finally makes sense.\n\nI’m not saying Ben has an unseen disability, and him being a smartass does suck. I’m just saying please be careful when interacting with people who may not do a lot of physical stuff and may be very interested in a lot of screentime. But as far as this post goes I haven’t seen that you’ve done anything wrong.", "NTA. I feel pretty grossed out by the amount of people in these comments who think it's perfectly acceptable to shit talk an 11 year kid. Jesus. What's wrong with some of you?", "NTA. Taylor asked to go, Ben did not show any interest in anything except if your camper has a t.v.", "NTA. Taylor invited herself. Ben couldve. And, if he won't be interested there's no reason to drag him along just for some wrong-headed idea of equality. \n\nEquity over equality. \nMaybe there's another event you'll do with him & without Taylor. And maybe his parents need to be there to mitigate his troublesome personality quirks.", "So...you could simply invite Ben. 'Hi Ben, would you like to come on a trip with us where you won't be allowed any screen time except maybe a hour of tv in the evenings and you'll have to do lots of outdoor activities like hiking and rock fossicking?'\n\n'Hell no, uncle!'\n\nProblem solved.", "NTA, but I think this whole thing probably comes down to your sister being upset that you didn't ask Ben if he wanted to come along after Taylor invited herself. The equitable thing to do would have been something like turning to Ben and saying, \"What about you? Are you interested in a week spent out in the mud and rocks with no internet access and no electronics?\" and of course, Ben would say no because frankly that sounds awful (different strokes and all that.) But you didn't observe the niceties and someone's feelings got hurt. If it's just Yasmine that's one thing, but have you considered the reason she called you is that Ben expressed his hurt that you didn't ask him along as well? Maybe you should reach out to Ben and see how he's feeling.", "Goddammit marie! Theyre minerals!", "NTA - Sounds like your sister Mary is raising a spoiled entitled brat. I really hate parents like her. wanting to throw her kid in the mix to spoil someone elses vacation. \n\nActually, to be fair go ahead and invite him on the trip on the condition he leaves his electronic behind since the whole trip is based on outdoor activities. I bet he will quickly decline.", "NTA. You hit the nail on the head. Yasmine just wants to dump her brat on someone who will take him out of her range. No electronics policy will keep him from wanting to go. A signal jammer will help prevent a snuck phone from being used. \n\nBut another weird thought. Maybe an electronics free trip might be what this kid needs to connect to nature and live humans. It might be good for him, although more likely it will be miserable for OP.", "Don’t tell her! Talk to Ben directly. Explain the type of trip and that he’s welcome to come but her would need to leave all electronics behind. Tell him you’d love to spend some different time doing something he likes with him if that is what he’d prefer.\n\nIf you tell Yasmine she will make him leave his stuff behind and then he will be cranky he was made to go on a trip without electronics.", "I know that all kids aren’t the same, but, as someone with a game addict brother, leave the kid alone. Unless he expresses an interest, (he more than likely won’t) don’t force him to go on the trip and ruin it for everyone. \n\nMy brother is still a Ben but amped up. Mother would always try to force family interactions and he would sulk the entire time, and as soon as we got back to the house, video game. Trying to make him do chores, he threatened to kill himself once. There’s been many fights between them, especially once she threatens to take away or destroy his games. As we speak, he’s playing the shit now. Nearly all day and night. 🙄🙄🙄🙄", "A large part of it comes down to how they’re raised. I wasn’t an asshole at that age and neither were my friends. My little cousins are that age and are lovely to be around. Sure, they’re kids and have some minor attitudinal issues with their mom sometimes, but they still love telling her (and us) about school, friends, hobbies etc. They like to be involved with the family for dinner and game nights. Of course, my aunt has made it a principal to limit screen time every day so that they engage their minds and act creatively which greatly impacts their behaviour compared to their schoolmates. It’s interesting to see the difference.", "Would you feel that way if you knew your kid wasn't interested and would be bored? I think that's why people are saying she's doing it for herself and not her son.", "> A signal jammer will help prevent a snuck phone from being used. \n\nThis is such a bad, bad idea and likely illegal depending what your method is. Cell service can be crucial in remote areas. What happens if there's an emergency?\n\nIf it's got a physical SIM, remove it. No cell service (can use WiFi) but it will still be able to call emergency services.\n\neSIM? I'd figure out a different method (that also isn't such a nuclear method.)", "limiting screen time makes all the difference in the world.", "A kid having a bad attitude and their face stuck in electronics is well within their control. Short of any neurodivergence, that is. \n\nAlso, their self-esteem? Again no. Teach children that not everyone is going to fawn over them and isn’t going to always like them. They need to learn to deal.", "Exactly, the onus isn’t on OP to make Ben want to be outdoorsy kid just because Taylor is or because they want him to get off the computer or be more social.\n\nAnd while I do think it couldn’t hurt to limit his computer time a little at least in favor of another activity, even if it’s just reading, I will say:\n\nI was a kid who grew up in the early 90s and became introduced in the middle of my childhood to screen time but I was not born into it. I still always enjoyed solo activities, like drawing and reading. Once computers were introduced I began to enjoy reading online, and developing websites in basic form. I was quite introverted, but enjoyed socially with my very small friend pool. However, I did eventually grow to like hiking, paddle boarding and became more extroverted. I would know consider myself an introverted extrovert. I’m very good socially and had a life of the party phase, but I didn’t do it often and enjoy my space and get exhausted when to many people are in it.\n\nParents should always encourage activities to kids, but they need to ultimately let them make the choice for themselves, and there’s nothing wrong with putting a time limit or a “time and place” on activities that you feel they are either too engrossed or that can be unhealthy in excess, without pulling them all together or forcing them out of their comfort zone. I think part of the reason that I was able to come out of my shell was that my mom was really good about that. (My dad on the other hand tried to force every activity, they were all things HE wanted me to do, and would force me to do them for hours either because he felt they were more academic or because he wanted me to be better at them and thought forcing time into them would make me great. I wound up resenting those hobbies and him, and while I became or could’ve been extremely good at some of them, ultimately decided I hated doing them. It also caused a lot of unnecessary turmoil in our relationship. Some of them are things that I realize in hindsight I actually enjoyed and would like to do again, but I can’t get past the resentment they bring up.)\n\nIt’s *okay* to allow a time limit or a certain time for certain activities like tv and computer. It’s not okay to throw a kid at sports and summer camp or even theatre and expect them to suddenly like it or enjoy it. You wouldn’t take your sports enthused extroverted kid and throw them at a book club or a computer club right? Moderation is okay, introducing kids to the idea of new things is great, but forcing kids to do things they don’t enjoy is not only not okay, but will just make them hate those things.", "If he showed interest also and you didn't extend the invite then you would be more likely to be the AH, but I'm pretty sure he'd hate the entire thing.  Definitely NTA", "Nta it sound like your sisters were hoping you'd give them a break from their kids.", "Ask Yasmine why she isn’t taking Ben on a similar trip.", "NTA... you wouldnt invite a vegan on a hunting trip. \n\nYou have a trip planned around your interests and a granddaughter that is compatible.  \n\nMaybe you can look for a shared interest with him for another time. But this is your trip, not a babysitting stint.", "So does Ben even wanna go???", "NTA. It's your vacay you're free to take who you want. As you said, you didn't invite your niece. She asked if she could tag along. I assume your nephew heard this and didn't ask if he could. That's on him. \n\nI guess if I had been in your shoes, when my sister called to whine, I would have said \"he's more than welcome to come with us, but it will be an electronics free trip, and he will be expected to behave according to our rules while he's with us.\" I'm sure he would have declined the invite. \n\nMaybe find something he'd enjoy and take him at a later time.", "NTA. Even if Ben asked to come, you would be crazy to say yes. Agreeing to let an enthusiast Taylor join you makes sense. Her presence isn't likely to make the trip less enjoyable.\n\nBen would make the whole trip much worse for everyone.", "I agree but it doesn't sound like he even tries to bond with Ben cause he's not interested in the same things him and his wife is but Taylor is so maybe Ben doesn't expect his  uncle to want him to be there. As a mum of a 16 Yr old lad there attitudes start at 11 as there going to new schools with new friends(alot online friends) and peer pressure starts. Maybe the uncle could find out what games he likes and find an activity around that just for them. Cod, lazer tag/paint balling, superhero games, hero convention, racing, go karting. All he's says is he's got a bad attitude, OP do you not remember being his age and the changes you were going through", "Yes, this is the smartest way to ensure that Ben doesn't tag along and doesn't feel bad about being left alone because it was his decision not to come. Not offering at all will have the exact opposite effect (just as shown in this case) as he will feel FOBLO and will start acting insecure, LIKE TELLING ON HIS MOM, cuz well he's still just a kid.", "I agree 100%!  I’d make some comments about being in areas w/no internet access, no TV (or it’s not working), make it sound like these are great things since you’ll be so busy doing the cool outdoor shite then just ask Ben if he’d be interested lol!  Problem solved!!\n\n**However, I realize this could backfire so don’t take advice from this girl ;)", "Just tell Ben there will be no wifi.  Problem solved.  NTA", "Right?! Like can I go also? This trip sounds amazing", "My nieces are very into tech but hen they are on my sisters boat they have to put their phones/pads away and can only use them at night but during the day they are away. I agree however a kid who only plays on screens would go crazy in a camper especially if they are in a place without internet service and many camping locations are without service unless they are in a major campground or park.", "Thank you, I have not spent time with a Ben or your brother.", "Ben should probably attend a computer camp.   Get his focus on computer science and writing code.  Entice him by saying it’s better to create a game than play it.", "yes!! bens only 11, he needs to be properly disciplined and also supported in his interests!!", "Don't worry, Ben isn't interested. Yasmine is upset you didn't volunteer to take Ben off her hands for part of the summer, probably because it's not fair in her eyes that Taylor's parents get a break! If she cared about him enjoying summer break she'd send him away to some children's computer games camp. NTA", "Tell Ben no internet, no TV, no computer or gaming. Tell his mother the rules and she with be on standby to drive were you are to get him if he acts up.", "it kinda sounds like you like Taylor more than Ben.", "YATA. He's a kid. A moody one. It's on you to make the effort.", "NTA good time he learns that his attitude will effect his life in a negative way", "NTA. It sounds like Bens mom wants a vacation from her kid. And this sounds like a trip Ben would not be interested in.", "If Ben is a gamer, she could easily get a week without Ben by stocking the freezer with frozen food and teaching him how to cook Top Ramen.", "Parents with a child free sibling seem to want to position their kid as the one to inherit from the child free sibling.\n\nTherefore if the child free sibling is taking kids on something they want their kid involved.", "Ben has a mother and a father. If they are concerned about his screentime or that his attitude keeps him away from fun activities, it's time for his parents to take him to fun activities: lazer tag, hero convention etc. His uncle just told their plans of camping, not arranged something family related. One niece to join might not be a big deal, but even two equally enthusiastic nieces/nephews could be two much instead of a two-person trip.", "The trip would probably be Ben’s personal hell. Being in close quarters with people he doesn’t particularly care for, being nagged to do things he doesn’t want to do, with (most likely) insufficient internet. Maybe speak to him privately about the trip (mention the tech-free part of it) and ask him if he’s interested. Let him know there will be ground rules about participation and attitude. Please don’t allow yourself to be guilted into taking him along and ruining what sounds like a wonderful trip.", "Similar to the big sister that was asked to attend her step sister and younger sisters games, rehearsals and performances by her divorced parents (because she was only attending her younger brother's games since no one supported him there)... and it turned out her half and step sisters didn't care?", "He's the one saying about the screen time and I was just suggesting that maybe he would like to find a hobby they can enjoy together without a screen. I'm guessing uncle would love to find something he could enjoy with him like does wih Taylor other than a computer but I do agree parents should be getting him off comp and spending time with him as well", "Nothing makes gamers decide they do in fact hate outdoorsy stuff like a bunch of dorky old people taking away their internet access and forcing them to hike up a mountain, or dig through dirt for rocks, while they say things like, “wow, look at that view!” or, “isn’t it great to just get away from screens and enjoy the fresh air?”", "The choice between staying home and playing Minecraft (or whatever game young kids are into these days) or sleeping in a camper with no internet and digging through the dirt for rocks isn’t really a choice.", "Has anyone asked Ben what he thinks? Sounds like this fight could be solved by finding out if he feels left out or thinks a camper van holiday looking for rocks is his worst nightmare.", "NTA, doubt Ben actually wanted to go on the trip. Yasmine just wanted free babysitting.", "Well, to be fair, it would have been nice, in the flow of the conversation, to turn to Ben and ask \"Hey buddy, your cousin is coming on a trip with us, wanna tag along ? However, it's gonna be a no screen, no Internet trip. You down ?\" / \"Uh... no thanks uncle, but it was nice to ask\". \n\nNTA though, because you didn't invite your niece, she invited herself. Also I feel like an uncle should be allowed to have favorites...", "NTA Ben doesn’t want to go! Flat out ask him if he wants to go knowing that trip will mean no games or electronic devices?  Tell his mom to take him camping herself! \n\nI like the idea of computer camp better!", "NTA. There’s a strong possibility that this trip is his idea of hell and we had sitting there repeating “don’t ask me or don’t make me go” to himself.", "If you had asked one and not the other then yeah kind of the asshole, but you didn't ask someone else asked to join, it's not your job to invite everyone if you didn't plan to invite people.", "YTA. Ben did ask, but very subtly. He ask about the camper. He listened. He probably didn’t ask to come along because he didn’t trust your answer. \n\n11 is a really rough age. I wouldn’t be surprised if he frequently heard “why can’t you be more like your cousin” from parents/aunt/grandparents. He’s probably well aware that his cousin is the golden child.  And now knows that you think so too. \n\nStart spending time with him. Pick him up for dinner at your house and then talk/listen to him. Take him to a movie then ice cream after and talk to him. Show interest and demonstrate you care.  Then take him on a camping trip by himself where he can be the focus. Go to the beach or the mountains. But set expectations regarding screen time.", "NTA it sounds like Ben's mom has let the \"screen\" raise her child to the point that he doesn't have or isn't interested in social interaction and is now trying to pawn the task of teaching him to behave off on OP. Ben's only question was if the camper had a TV, clearly he's not interested in the activities OP has planned. Taking him would just ruin the trip for everyone else.", "Nta your trip your decision who’s going with you", "NTA", "I see why it's a problem for parents to show favoritism, but for uncles ? \n\nThey bond over shared interests, while the other kid just don't, I don't see what the problem is.", "You mean everything but turn the wifi off except set times of the day and/or taking electronics away!"]}