{"id": 6503, "submission_id": "103jq3v", "title": "AITA for “ruining” my brothers book?", "selftext": "Okay so my (21F) brother (18M) has a collection of books, he has been collecting since he was around 10, he reads almost every day and has 2 large bookshelves in his room. I’ve recently started trying to read more and I saw a book recommendation online, I noticed my brother reading the same book a few days earlier and instead of buying one online I thought I’d just ask him if I could borrow his, he said he’d finished reading it and to go ahead but just return it when I’m finished. There was no problem with this on either end. Anyways I was reading the book in the living room, my brother came in, no problem. I folded the paper over to keep the page and as I was doing that he looked over and started shouting at me for bending the page, he grabbed the book from me and stormed upstairs and slammed his door, I followed him up to see why it was such a big problem but he continued to scream at me for “ruining” his books, I’ve always done that with books and I don’t understand why it’s bad, I get that he likes his books but jeez.\n\nEdit - Thankyou all for the comments they were actually helpful, I didn’t think this would blow up but yeah I’m a complete AH. \n\nClearing up some things, my brother is autistic so that’s why he reacted the way he did. I’m not excusing my actions but I genuinely didn’t know and I have since apologised and I will be buying him a new book and getting myself some bookmarks aswell.", "created_utc": 1672877310, "permalink": "/r/AmItheAsshole/comments/103jq3v/aita_for_ruining_my_brothers_book/", "score": 11806, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Ig I could’ve just used a bookmark but I didn’t have one and I’ve always blended the pages, it was just to keep my place.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA!!! \n\nIt’s not your book so you don’t bend the pages!!! Use a bookmark,use a piece of paper,a gum wrapper,a receipt to mark your place,but DON’T BEND THE PAGE OF A BOOK THAT IS NOT YOURS!!!", "YTA. If someone borrowed your favorite jeans and cut them in half because they always make cut offs out of *their* jeans, would you be okay with that?\n\nNo. You don’t damage other people’s property just because *you* don’t mind your own being damaged. Offer to replace the book.", "YTA\n\nI would be pissed too, I HATE when people damage my books. If you can't return exactly how you borrowed it, you shouldn't ask for them (book or anything else).", "If it’s not your book the max you should be doing is flipping pages not indenting them", "YTA. The truth hurts but you did ruin the book. I can’t believe you didn’t know not to dog ear books. Sheesh.", "I'm surprised that you've reached the age of 21 without learning that people who are serious about their books hate – and I mean absolutely, to the very core of their being, HATE – it when people bend the corners to mark a page. Sounds like you've learned the hard way. To you, it's a non-event; to your brother, the book is now genuinely ruined. I vote NAH since you genuinely didn't know. But rather than going the \"Geez, what's the big deal, stop overreacting\" route with your brother, I recommend a sincere apology with the explanation that you honestly didn't know this mattered to him, and the assurance that you'll respect the way he wants his books treated in the future.", "YTA not your book. You don't fold pages of books that don't belong to you. Now go buy him a replacement.", "YTA I would make you replace it. This is such a hard line for almost anyone that collects books.", "Slight ESH. You need to respect other people's belongings and the book collecters don't like dog earing the pages at it eventually ruins the book. \n\nYour brother could have explained to you in a better way to not do that rather than spiralling out. Dog earing pages is usually normal and not everyone value books as much as a collector do.", "YTA... I dog ear pages, but with someone else's books, I would never, even if i noticed that the pages were already dog-eared", "YTA. Ever heard of a bookmark?", "YTA. From your response it's clear you do not treasure books as much as your brother. If you are borrowing someone else's belongings, you should be treating it better.\n\nDon't dog-ear the books, and don't open the book so wide as to crease the binding.", "YTA\n\nBookmarks are a thing. If you had done that to one if my books I'd be equally angry.\n\nYou didn't respect your brothers belonging and you didn't respect him.\n\nYou should replace the book and apologise.", "NAH. You’re not an asshole for folding a page the first time without knowing better. But now that you know, you should respect his property in the future and get a bookmark. Could an 18 year old have told you this without throwing a temper tantrum? Of course.", "ESH you much less so though.\n\nLook, we shouldn't touch other people's things and folding pages would be seen by alot of book readers as ruining the boom.\n\nBut WTF was that reaction?! That was one hell of an over reaction for a folded page over one book. Unless he has something going on with him then he's big asshole.", "YTA, fold your own books. If you’re borrowing something you treat it extra well.", "Dog-earer here. YTA. Never ever do that to someone else’s books. Yours, fine. But if you borrow a book treat it with respect. You should apologize to your brother, his book and possibly consider getting him a book as an apology gesture.", "YTA I also strongly dislike people that dog-ear pages in books. Always have and always will. I would be very upset if someone did that to a book I lent them, it’s disrespectful. If you bought the book, fine you can ruin the pages all you want. But if it’s not yours use a damn bookmark.", "YTA. \n\nHow would you feel if, say, you were a gamer, and he borrowed a classic ps2 game, played it, then scribbled “done” on the disc with a sharpie, then claimed “what’s the big deal, I do it to my games all the time?”", "YTA - I get that you had noget idea... But now you do!\nYou don't EVER do that to a book! Especially other people's books! I would have reacted in exactly the same way and gotten completely over-the-top protective of my poor book if someone I lend it to treated it so horribly. Yes, people who care about their books sees this as a capital offence, it might seem crazy if you don't have the same feelings towards books, but that's the deal. You should apologise - But not to your brother. You should apologise to the book!", "nta..been a heavy reader  for 50 plus years..my sis also lends me  boxes of books to read which i return. i use a bookmark, fold corners over or do what you did. i nor my sis has any issues with it.  You brother sounds like he has  issues.. and an ah too..", "YTA\n\nDon't dog-ear other people's books. It's blatant damage and is disrespectful to his generosity", "YTA \n\nHe probably should have told you not to dog ear any pages (some are ok with it, most aren’t) because it weakens the page and the crease will never come out. You know he has been collecting books for a long time, you should  know they are important to him and treat them as such. In the future return any books you borrow in the same condition you get them.", "I mean, I'mma give this one a considered ESH. You really shouldn't dogear someone else's book. It is an effective way of keeping your place, but it does damage the page. You wouldn't do it on a library book, don't do it on a book you're borrowing from a family member.  \n\n\nThat said, unless your brother is 12 or has trouble interacting socially, there's no reason to react this way. The proper response would've been to ask you not to do that. Which, again, you shouldn't do.", "ESH - I get you had no idea, and your brother WAY over reacted, but please don’t do that 😂 \nI got a brand new, kind of expensive cookbook, and my mom was looking through it so she could see if there were any recipes she wanted to use. She found one and she folded and hard creased the corner of the page. I also flipped out a little bc it hurt my soul 😬 I try not to lend out my books though, so maybe your brother should keep them to himself if he’s that particular about them!", "ESH. \n\nIt’s not your book, so you need to take care of it. Every personal librarian has different standards - for me, I like dogearred pages particularly if it was me that made the mark on a previous read, but others want their books pristine. Books can really be sacred objects for some. \n\nThat said, there should be a conversation about the expectation of how you return someone’s property. You suck because you are not returning something the same or better than you found it. He sucks for not communicating and reacting the way he did.", "YTA you dont dogear a book that isnt yours.", "ESH you shouldn't dog ear pages on books that aren't yours but he could of just asked nicely not to do that and it would have been fine", "YTA along with everyone saying ESH. When you borrow something from someone you prioritise getting it back to them in the mint or whatever condition you were lent it in, you don’t take it upon yourself to make creases where there were none all because it makes life a tad bit easier for you.", "YTA for damaging his property! That's what bookmarks are for. Heck, a tissue or square of TP or shred of junk mail would all have been much better choices.", "From one dog-earer to another, YTA.\n\nWhat your choose to do with a personal book (dog ear, write notes, crack the spine) is not ok to do to a borrowed book, especially if you know your brother collects books.\n\nBuy him a new copy.", "I get it, I always dog-ear my books. My kids are now doing it with their books too, but I’ve taught them to only do it to their books, not a borrowed book. \n\nApologize, and only do it with your books from now on!", "In this case YTA. It's kinda common courtesy when someone loans you something to return it in the same condition that you got it in. That means no folding pages. He probably overreacted, but I understand him being annoyed.", "YTA. There is such a thing as a bookmark I’m sure if your brother has that many books he has a few you ask to borrow or use a spare piece of paper you don’t dog ear books like a 5 year old it’s so rude", "Just to be clear, it sounds like you \"dogeared\" the corner of one of his pages?  And maybe even more?  Yes, YTA.  Bookmarking a page like that when it doesn't belong to you is not okay.", ">I folded the paper over to keep the page\n\nNever do this to a book that isn't yours. JFC, you don't have a single scrap of paper in your house? YTA.", "It takes a special kind of person to destroy other people’s property and wonder if they are TA! YTA", "YTA. Get a bookmark. Replace his book. You are a barbarian.", "YTA - my sister is a big big book reader me on the other hand I have zero interest in reading yet even I know you don’t fold the pages! If he wanted his pages folded you would’ve seen creases from when he’d done it himself. Buy a bookmark!", "YTA.\n\nThe whole page? Not just a corner? Wow.", "YTA! You should return all borrowed property in the same or better condition than when you received it.\n\nI’d be majorly pissed at having my book returned all bent up.\n\nYou have a bad habit and no respect for other peoples property!", "YTA. Who taught you to handle books. You’re brother is in the right", "YTA if someone \"collects\" something, anything, any damage done no matter how minimal is devastating to the collector, even if it's just a collection for private enjoyment and not monetary value. To you it's just a book. To them it's something precious.", "YTA. As a bibliophile, you committed a heinous crime against books!\n\nIn all seriousness, you should return an item in the same condition it was borrowed. Folding pages is a massive no-no and destroys the condition of the book. Think of it as someone borrowing a dvd or computer game and returning it with fingerprints on the disc.", "YTA. Do not fold pages. Especially in a book that does not belong to you. You absolutely ruined his book and you now have to replace it and you need to apologize.", "YTA. never bend another persons books pages.", "When you ordinarily borrow things from someone, wouldn't  you want to return it to them in the same condition if possible? Especially when you know that he really values his collection. Buy him a replacement and apologize without any weird excuses about what you'd normally do. His belongings deserve respect, as would yours. YTA", "YTA and a monster! How dare you treat books like that. \n\nUse a friggin bookmark! Even if it's just a scrap of paper or a post it.", "ESH. If you knew your brother is super protective of his books, you should have gotten a bookmark instead of folding the corner of the page. \n\nThat being said though, it isn’t “ruined” (and I’m a massive book snob) and the book will be fine even with a mild crease in the page. Your brother massively overreacted by screaming.", "I feel like most of us biblophiles audibly gasped at this post (I know I did). \nSoft YTA. It's common to dog-ear a page, but it's considered rude and damaging in most literary communities if it's not your property. Not entirely your fault for doing a mindless habit, but be sure to use this as a lesson. Apologize and keep in mind that, when you borrow something, return it in the same or better condition than when you got it.", "NTA you were just being instinctive and using what you could to save the page.\n\nYour brother isn't TA either though because some people are really strict about books and their integrity and we can't blame them. \n\nI'd suggest finding yourself a bookmark you want to use and talking to your brother about how you won't fold the pages anymore because you realise you can use a bookmark. \n\nSaving a books structural integrity and quality is important and something we don't prioritise in this century but it is important in the grand scheme of things. \n\nI hope you make up with your brother and finish the book!\n\nMake sure to apologise though because you did hurt him immensely even if you don't understand 😊\n\nEdit: So I'm getting a lot of downvotes.. what did I say that was bad/against reddit rules?", "YTA - it wasn’t your book. It was something your borrowed. You damaged his book. I would ah e been irritated to and you would never get another book from me.", "Yta", "YTA.\n\nYou are free to do whatever you wish when it comes to your own property, not someone else’s.", "You vile evil excuse for a human! Use a bookmark - that is why bookmarks exist.\n\nYTA\n\nHe entrusted you with his book, and you purposely creased its pages.", "YTA", "ESH. You probably shouldn’t have been golfing pages and should have shown a bit more respect to his property, but he also WAY overreacted.", "NTA, I don’t understand all the asshole comments. I’m an avid reader with multiple bookcases full of books & I also and keep my place by folding pages.  Not everyone is the same. If you don’t read much, you might not realize some folks don’t like this.\n\nScreaming, running off, slamming doors and more yelling is so unhinged. He could have been an adult & simply asked you to mark your progress with a bookmark next time.", "YTA I am just like your brother, I read my books in a way that keeps them in pristine condition and have blown up at people for bending my books before. Now I know better and show people how I read my books with the condition of replacement if damaged. For some people that is how we are, we love and treasure our books and want to make them last. Apologize for damaging his property and replace it.", "YTA.  I fold down the corner of the page, underline passages I particularly like, etc.  But only on my own books!  Books I borrow get returned in as close to the same condition as they were lent as possible.  This should always be your goal when borrowing any item from someone else.  Return it in the same condition you received it.", "ESH, but in a small way. You suck because you did cause some minor damage by causing a crease on a page of a book you don't own. (He's not a public library, so those damages are entirely on him.) Respect the property of other people. Folding pages over in books which you don't own is bad form.\n\nHis reaction was a bit over-the-top though - a single creased page in a paperback is meaningless. Was this a signed, first edition hardcover book? Is it a collectors item he wants to sell in 20 years? No? Then chill out brother!", "YTA\n\nJust because you’ve always done it doesn’t make it right.", "YTA. use a bookmark. Don’t dog ear books.", "JFC.\n\nYTA. \n\nPeople like you who dog eared books pisses me off. Bookmarks are invented so heathens like you doesn't destroy the value of books. Would it take you a day to find a Bookmark to put it in the pages? No, right?. \n\nYou just up and destroy a book because you're too lazy to properly bookmark the page!. 🤦🏻‍♀️\n\nI hope your Brother learned not to share his books with you again. And also, Congratulations, he now knows you're untrustworthy when it comes to properly handling his collection.", "YTA. When you borrow someone’s property, you should return it in the same condition", "Book marks are a thing even a scrap piece of paper \n\nyta for doing that it dose ruin books but your brother's reaction is a little extrem. Can't see him borrowing you Anymore books", "YTA\n\nHow can you be your age and not know that people that cherish their books don't fold the pages over? It's highly disrespectful to do to someone else's book that you borrowed. \n\nGo buy him a new one since you did ruin this copy.", "NTA - how often is he going to read it? You have to touch books to read them", "Listen it's not good to fold the pages but his reaction was extreme tbh. ESH", "YTA If you dog eared one of my books you would never touch another.", "YTA You don't dog-ear someone else's books, that's just common courtesy. I also borrow books from my brother, and while I dog-ear my own books all the time, I am careful to use a bookmark with his. Honestly, I don't even know if it would bother him, I didn't ask, but it's simply common courtesy to return someone's possessions in the condition you received them.", "YTA, a little bit.  Go buy the same book for him, apologize to him and explain your true ignorance.  Hopefully, he'll forgive and get over it, once you've replaced the book.", "YTA \n\nIf he’s a book collector you just ruined the value of that book. The bent page takes away its pristine condition which for some books can be hundreds/thousands of dollars difference. I realize this is probably a new book and not worth that much but keeping it in a good condition + time is how it becomes valuable.", "I’m probably gonna get a lot of hate, but you’re NTA. \nI love books, collecting them by myself and ok to share with others. And I do the same thing with pages, plus it’s never a problem when others do. \n\nIf he was so sensitive about it, then he should’ve warned you", "YTA\n\nIf the book is yours go ahead and dog ear the pages to your hearts content but when you borrow something from someone you should strive to return it in the same condition you got it. Which means no folding pages over. You damaged his book which makes you TA, and you’re acting like it’s no big deal that you *damaged his belonging* which makes you double TA \n\nIn the future, use a fucking bookmark if someone lets you borrow a book.", "YTA. When you borrow something, treat it the way the owner wants it to be treated. No matter how you would want to handle it. Apologize, this is entirely on you.", "Soft YTA, folding pages is damaging the book, you should treat his stuff better than you treat your own stuff since he lent it to you. Go to your local library or look for the E book online.", "YTA - I am also a book collector and reader. Dog-earring the pages is the bane of our existence. It creases forever, it makes it look less pretty, and if done enough it can lead to page tearing from wear. The issue isn't just that you made a mistake, it's that you won't own up to it. He walked away from you to get some space, give it to him, then apologize.", "YTA \" I don’t understand why it’s bad, I get that he likes his books but jeez.\" The problem to me is that you're not even trying to understand why this might upset him. You've basically decided he shouldn't be upset because you do it all the time. So in your thinking if I do x then no problem, who cares what someone else thinks! Try and be more empathetic and see why he doesn't like this.", "YTA. How are books supposed to last if you’re dog-earing the pages? I shudder to think about how many books you’ve done that to. Not to mention, you would think you’d take care of something that doesn’t belong to you a bit better. I think you owe him an apology", "NTA & YTA!\n\nComments are showing just one or the other (NTA) & (YTA). But literally fucking thousands of people fold page corners as book markers to keep their page wether its their book, a library book, friends book whatever. I have lent friends, family and even somewhat strangers MY books but never complained if there was a small corner of the page folded. BUT some people have a possessiveness over the things they own; meaning them getting angry over the folded page corners but i still understand that because the book is 100% theirs but its not in my personality to judge that.", "People who collect books don't \"dog ear\" the pages or break the spine. YTA, but just from ignorance, not deliberate spite. Apologize to your brother.", "YTA plenty of people despise dogearing pages. Your brother is one of them. Best thing to do? Return books in the same condition you borrowed them. Start using make-shift bookmarks instead of folding the corners of pages. \n\nFor the record, if I were your brother, you’d never be allowed to borrow my books again.", "YTA, that is what book marks are for. UGH!", "YTA. Seriously, you do this with other people's books? You can literally use any piece of paper as a bookmark. I use junk mail when I can't find an actual bookmark. Guess you're never borrowing your brother's books again.", "Yikes, way to respect someone’s property (especially when you knew he valued it)!! \n\nYTA. You either truly don’t care about his feelings, or are rather dense, and can’t read the metaphorical writing on the wall.", "YTA\n\nyou borrowed a book from someone who obviously treasures them, and then immediately damaged it.  \n\nthe fact that you don't respect books as much as he does, dosen't change the fact that the book is HIS property not yours to do your usual thing with. \n\nIt may not seem like a big deal to you, but you should always treat things you borrow with more care than things you own yourself.", "YTA dont fold other people books just don't bookmarker or a simple piece of paper would work", "YTA\n\nMaybe his reaction was exaggerated but i would be mad too if someone did that to my books.\n\nIf you borrow something from someone else treat it like its the most fragile thing on this planet", "YTA", "\"I damaged one of my brother's books, knowing how much he treasures them, and then he got MAD at me!\" Seriously? Obviously YTA", "YTA but not for folding the corner of a page, but acting like he had no right to be mad about it. I can see how if he didn’t specifically tell you beforehand not to fold the corner why you would just naturally do it. But when he got mad about it you should’ve apologized. It is his property after all. If he doesn’t want a corner folded then a corner shouldn’t be folded. I borrowed a book off a fried once and I turned it over and set it down open (pages face down). My friend immediately told me not to set it down that way so I picked it up and asked if there was anything else I should know. It was his property after all.", "NTA - do it all the time and never a second thought.  The brother overreacted and it is not \"ruined\".  If you were to spill taco sauce in it, then it is ruined....but not this.", "YTA. Get ready for the book lovers to descend on you. I also dog-ear my book pages, but they’re my fucking property, and I would never do that to a borrowed book. If you really want to fix it, I’d get him a new copy and trade it for the one you damaged.", "YTA. Use a bookmark. A receipt. A dollar bill. Urgh.", "YTA. You borrowed his book and you can't damage someone else's book. Most book readers including me would hate it if someone folded pages in their book.", "If you want to dogear pages to your own books, do it. Don't do it to other people's books. YTA.", "YTA. That is called \"dog-earing\" and it is a very disrespectful thing to do to someone else's book. Don't do it. You owe him an apology.", "I personally don’t give a shit about this, but as you’ve discovered many people really think it’s bad. I agree with the ESH crowd, his reaction is makes me roll my eyes but then also I would avoid doing this because I’ve seen people get proper bent about it.", "YTA wtf dude?!\n\nAnd to all those saying he overreacted, no he didn’t.  He just watched his sister deliberately damage one of his books.", "Sort of the asshole. \n\nHe clearly over reacted. Which makes him an asshole. Buy with cause.\n\nOn the other hand, they’re his books, and saying it’s no big deal and doesn’t matter is what kind of makes you the asshole. Whether you actually ARE an asshole completely depends on wether you realize that it does matter to him, you should probably apologize (to be fair he should too) and never do it again if he ever lets you borrow one again. \n\nEx: I have a very large library. If someone dog eared my books, I would not let them borrow them anymore, and I would be upset. Some people like their books in as good as condition as possible. I don’t even crack my spines. And the one time I lent a book to someone who did, I was seriously not impressed.", "YTA. Paper is everywhere grab a receipt, a piece of junk mail, that new business card your friend gave you that’s just sitting in your wallet. Anything but don’t fuck up someone else’s book.", "YTA. Bending pages, purposely cracking spines, anything like that, is exactly why I refuse to borrow out my books to anyone except one person. That one person who is allowed, also collects books and feels the same so it's a non-issue. Anyone else? No touchy.", "YTA \n\nBuy a bookmark dude!", "NTA-at least if he didn’t tell you not to fold the page", "Mild YTA. Don’t dog ear books unless they are yours. Bookmarks are the way to go.", "I was gonna give a N A H since you clearly didn't realize that this bothers a lot of people, but then I saw the ages. How can you be 21 and not know people don't like dog earring books? It's fine to treat your own books however you like but be gentle with other people's stuff. YTA\n\nApologize, say you didn't realize it bothered him but understand and it wont happen again. If you buy him a book he hasn't read as an apology present I bet he'll let you borrow them again.", "YTA. Some people don’t mind creasing the corners but clearly your brother does. You don’t get to shrug off the responsibility of your actions just because you don’t consider the book to be ruined. It’s his book and he does.", "YTA for not asking before doing it. It would have been pretty obvious as you were reading that the pages hadn’t been dogeared.", "YTA- grab a piece of paper for a bookmark. You don't fold pages on someone elses book.", "YTA. Don’t do that.", "YTA.  \n\n\\-- You took his thing without permission\n\n\\-- One of the things you know he cares about\n\n\\-- You damaged the thing\n\n\\-- Right in front of him\n\n\\-- And then made a surprised pikachu face when he wasn't happy with that\n\nYou seem to be vaguely implying that *he* should be OK with having his book's pages folded because *you* don't think folding his book's pages matters, but that's not really an argument so much as a weird, pointless flight of fancy. \n\n Beyond that, you don't present any kind of reason you might not be TA, so I'm unsure if you're just here because you *want* to have people tell you you're TA, or whether you genuinely have problems understanding books and property and actually *need* to have people tell you you're TA.  In either case, the most useful response I can make is the same:  \n\n\\*ahem\\*\n\nYou're TA.", "YTA\n\nI would be pissed too and demand you replace it. \n\nThey make bookmarks for a reason.", "YTA - Look I am a book folder as well and I don't care about the pages very much but at least I have the common decency not to fold other people's unfolded books. You can't go back and smooth that page out perfectly. That page will forever have a fold mark bc you were disrespectful with your brothers belongings. Apologize and don't do it again if he ever decides to trust you with his valued possessions again.", "YTA. Don't do destructive things to property that isn't yours. I'd freak out, too, if someone did that to my books. Your brother trusted you with something, and you betrayed that trust. Most people try to take care of things they are lent, not do careless things like that.", "Ohhhh dude YTA for sure.\n\nHave you not heard of bookmarks? It's not your book to bend pages on.\n\nI used to do this thing in middle school, where if someone would lend me their mechanical pencil I would snap the clip because I'd always do it with my pencils out of habit. This is a lot like that. It's not your stuff.", "Maybe I'm just uneducated but what an odd way to save your page in a book. I'm not an avid reader but why would you ever want to crease the pages in a paper book? I mean idk if \"ruin\" is the word I'd use but I hope you haven't been doing this with books that you don't own. If so, you've been an AH all your life.\n\nYTA", "YTA. This is why God created bookmarks.", "YTA, but softly in my opinion. You just don't realise the etiquette here with book borrowing.\n\nI fold the corner of my books to mark the page (I know - I'm a heathen). But I ONLY do that to my own books. I like that my books look read and used, honestly.\n\nLibrary or borrowed books - bookmark only. Especially if it is lent to me by someone who treasures and cares for their books as deeply as your brother seems too.\n\nAt the end of the day, it is your brother's book. You should apologise, and promise to not do it again. Though I don't think he will let you borrow it any time soon.", "YTA. You have committed a sin in the eyes of all bibliophiles. You never dog-ear the pages of a book. Worse still is that wasn't your book to ruin, it was your brother's. I would say use a bookmark next time, but he'll never let you borrow anymore of his books after this.", "Nta you follow the incomplete rules of your brother to take and Reed the book. Your brother should make library rules before share the book with you.", "YTA \nEVERYONE WHO DOG EARS A PAGE SHOULD BE SCREAMED AT MERCILESSLY", "i learned in ELEMENTARY SCHOOL that you don’t fold page corners on books that aren’t yours.", "YTA - people in this house do this to me only they place the books page down 😡 Spines absolutely mullered!!! Just get an old envelope, cut the corner off and place on the corner of the page as a bookmark.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay so my (21F) brother (18M) has a collection of books, he has been collecting since he was around 10, he reads almost every day and has 2 large bookshelves in his room. I’ve recently started trying to read more and I saw a book recommendation online, I noticed my brother reading the same book a few days earlier and instead of buying one online I thought I’d just ask him if I could borrow his, he said he’d finished reading it and to go ahead but just return it when I’m finished. There was no problem with this on either end. Anyways I was reading the book in the living room, my brother came in, no problem. I folded the paper over to keep the page and as I was doing that he looked over and started shouting at me for bending the page, he grabbed the book from me and stormed upstairs and slammed his door, I followed him up to see why it was such a big problem but he continued to scream at me for “ruining” his books, I’ve always done that with books and I don’t understand why it’s bad, I get that he likes his books but jeez.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. I’m not a reader and I still know not to do that", "YTA \n\nThat is damaging someone else’s property. Even if you do something everything doesn’t mean other people have to like it. He kept them in pristine condition for 10 years and you ruined it. \n\nI hope you apologize.", "YTA you don’t dog-ear someone else’s book. Use a book marker. You can literally stick any small piece of paper in there to hold your spot without folding the pages. I have books as old as 120 yrs. Please show respect for your brothers collection. Apologize and if needed, purchase the replacement.", "YTA You could have used any scrap piece of paper as a bookmark.", "YTA and really don't understand how someone can cherish a book.\n\nYou didn't bookmark it or even dog-ear the page. You folded the whole page in half like it was a Danielle Steele novel. I wouldn't let you get near my books.", "Oooooooo alls I can think of is if I did this my dad would be so mad! I am not a big reader but my dad looooooooves books, any time I did get a new book he would remind me “books are precious! Pleeeease don’t dog ear them, the corners will fall off!” So yeah, on behalf of my dad, YTA.", "YTA, if you borrow something it should be returned in the condition you received it in, regardless of how you treat your own possessions.", "ESH. I don't like pages of my books folded, but your brother didn't have to react like that. Just use a bookmark from now on.", "NTA-it’s clear to me that you didn’t know that he doesn’t like this. He could have acted more calmly, so he’s the AH for his behavior, but in the future, you need to ask before doing this. Some people don’t mind and some do and I don’t know how you’re supposed to know if you’re not told or don’t ask. I don’t like dog-earing books. I’d be annoyed about it-but I know how to handle it without disrespecting you.", "absolute insanity in these replies. NTA", "YTA \n\nI read a lot but I don’t collect books, I turn down corners in my books but I’d never going to do to someone else’s book. I do collect funko pops and marvel legends though and I would be pissed if someone damaged them.", "Gentle YTA. As an avid book reader, and in that category of \"you ruin my book, you buy me a new one\", the dog-earing of a page has never bugged me, however a single page having a rip or slight tear would send me on the rampage. OP genuinely didn't know, and she did learn the hard way that it's frowned upon at the very least by her brother. However, the \"it's not a big deal\" attitude doesn't do OP any favors. Just because you don't understand doesn't mean that it's not upsetting to the owner of the book. Go apologize!", "Yeah YTA / ESH\n\nHe overreacted, but many librophiles are very against damaging the books they read because they like them also as decor. \n\nApologize, admit that you didn't realize he cared for his books so well (DO NOT criticize him about it), and offer to replace it as an apology. He might not even want it replaced, and may calm down about it, but it would be the nonahole move.", "NTA. It was an accident. I absolutely LOVE to read, and I do that to my books sometimes.", "YTA. You are so utterly the A in this situation that there are no words. This is somebody else's property, and you are doing physical damage to it. You may not think it's damaging, but assuming a book was a collector's item, you just destroyed any resale or appraisal value.  You have caused a permanent physical change to his property. You owe him an apology and a new, undamaged copy of the book.", "I’d be pissed! \n\nYTA \n\nI keep my books in pristine condition. No folded corners, no marking in it, no page crinkled. That’s why I don’t share my books.", "Yta.  I hate hobby reading, and even I know dog earring a book is a dick move", "YTA", "Soft YTA because you weren’t aware that folding the pages was wrong. Use a bookmark in future, if he ever lets you read it again. And buy him a replacement. I’m sure he’ll appreciate it.\n\nPeoples reactions to this is kinda :/ though like most people are acting as if OP murdered something", "YTA for not respecting his property, especially something as important as being part of his collection… you can take steps towards repairing the situation by purchasing him a new copy, expressing remorse for not respecting something important to him, and then giving him the space to process it. It’s not a huge AH move by any means, but thoughtlessness can easily damage relationships.", "YTA I do the same thing with MY own books as a fidget but don’t ever do that with anybody else’s.", "INFO:  what’s something you like to do?  I’ll try to give you a comparison so you can understand why he’s upset.  \n\n\nThat book was really special to him, but he didn’t even hesitate to loan it to you.  You treated it carelessly, and damaged it in a way that can’t be repaired.", "YTA. If you don't have a bookmark just use a freaking shop bill or metro ticket. Folding pages is nasty.", "YTA - Book lovers, we are a special breed. Treat our books with gentle hands. No dog-eared pages. Don't lay it down with the book open and pages side down. Paperbacks - don't crack the spine. Well, in any book you don't crack the spine. If there's a book cover, don't bend or tear it.", "YTA\n\n\nYou should've been taught since childhood, when borrowing someone else's things you return them in the same or better condition. For books that means keeping it clean, dry, and not creased....\n\n\nIf you don't have a bookmark, literally any scrap piece of paper will do.", "YTA - sure I don't think it's the worst thing in the world but I would be bothered if someone folded my book. There are different standards for your belongings and ones you're borrowing from others.", "YTA- what you do to your books is up to you. If you're touching someone else's books or library books- use a bookmark, a receipt, a string, a scrap of paper- anything. But do not dog-ear a page or damage someone's property.   \nIn case he allows you to borrow books in the future- do not break their spines either.", "YTA - I love books. But I dog-ear, and recently I’ve been sticky-noting and have been looking for nice highlighters for parts of the book I really like.\n\nBut those are *my books.* I can choose to do that to my books. Not everyone is okay with that. I wouldn’t do that to someone else’s books.\n\nIt might have been absent-minded of you and you didn’t mean any harm, but his books are clearly very important to him and he wants to keep them in good condition. That’s understandable, when borrowing anything it’s expected that the item will be returned in the same condition it was lent, to the best of your ability. Try to be more mindful of this.", "NAH. Dog earing pages is a personal thing. You need to ask before you do that on a book you don't own. Bookmarks can be any kind of paper or thin object and are easy to find. His reaction might be an overstatement but he certainly could have mentioned he didn't like that.", "YTA. Bend the pages in your own books. Your brother obviously has a connection to his books.", "YTA. He overreacted a bit but why would you do that to a book that wasn’t yours? It’s like borrowing someone’s car and returning it without wiper fluid. It’s a HUGE deal but it’s a dick move.", "Dog earring a page is a sin for us book lovers. Bookmarks or look at page number! YTA", "Lol this is a weird lesson that everyone who knows a book lover has to learn. I did this to someone once and didn't get it either. Then started lending some of my favorite books out and they'd be returned creased to high hell (sometimes they'd even write in them) so now I get it.\nSoft yta but now you know, just apologize and don't do it again", "And, most importantly, apologise to the poor book!", "Glad I'm not the only one that doesn't bend a book backwards when reading it. People think I'm crazy for reading paperbacks only halfway open. The covers will get stuck.", "You're in the minority here, since most of us don't like our books getting destroyed. Just because you and your sis are ok with it, doesn't mean it's the norm.", "He probably didn't think he had to", "No one should have to tell you to respect their property. If you borrowed someone’s shirt, you wouldn’t return it dirty if you accidentally spilled something on it.", "^ THIS! I would have lost my shit too if they were my book! I have two pencil cases of bookmarks and every time someone in my house buys a book they also have to buy a bookmarker. Them’s the rules.\n\nYTA - I don’t care if you do that with YOUR books (well, that’s a lie, I DO care but they’re your books and you can do as you like) but you are an absolute monster to disrespect someone else’s property like that! You owe your brother an apology AND a new book!", "When its your book do what you want, when its someone elses book you return it in the same condition you received it.\n\nFrequent dog earing makes a book more voluminous/harder to close and shelve.", "It would be a very long time before there was a 'next time' if someone dared dog-ear one of my books. I don't always buy new books, some are from library sales, but once they are mine, no more dog-earring the pages. \n\nWhat you do with your property is your choice. What you do with someone's else property is whatever does the least amount of damage while properly using it. Bending page corners damages the book permanently.", "Exactly - there’s nothing morally wrong with dog-earing books in general but you also have to be respectful of borrowed property. \n\nOP you should apologize to your brother, offer to replace the book, and promise to only use bookmarks with his books in the future.", "I doubt it was a single page if OP has a habit of folding pages to make their spot. They’ve probably put the book down more than once", "I think the brother underreacted. This was an act of war.", "Agreed", "if someone wants to fold over pages of *their* book, then they are more than welcome to.\n\nhowever, OP was borrowing the book. it does not belong to OP. the rule of thumb for borrowing anything is to return it in the same condition (or thereabouts) as when you first borrowed it.\n\nYTA OP", "Maybe?  Screaming and yelling and slamming doors is totally unhinged.  NTA, but bro totally is.  I’m an avid reader and do the page folding thing. Not everyone is the same. All he has to do was ask u not to do that like a adult.", "I do it all the time as well, but to my own books. He has a right to not want his property bent in any way. It’s like how dinging a car you borrowed isn’t totally ruining it…but it’s still upsetting to now have a damaged car, even if only slightly.", "As a bibliophile, OP is TA in this situation. It wasn't her book to dog-ear, it was her brother's. If she wants to dog-ear the pages, she should get her own copy.", "They didn't take it without permission. \"he said he’d finished reading it and to go ahead but just return it when I’m finished\".\n\nThe rest stands though.", "I think OP did have permission", "Right? If everybody who read the book did that, so many pages would be creased. Just find a piece of scrap paper and put it in the page.", "You don’t start folding pages in someone else’s book", "And required to take excruciatingly long hot yoga classes.", "And replace his book...jfc YTA", "He was willingly damaging his property. I dont think that the brother is TA.", "When I borrow your car, I'm going to bump the back of the parking spot and make a dent. It helps me know if I'm parked right. But that's ok right? Because you didn't tell me you didn't like that.", "He didn’t overreact, he took his damaged book back and left the room. She’s TA, but yeah you’re right that book etiquette should be more widely known", "Folding a page is not an accident.", "> I folded the paper over to keep the page", "And folding the page wasnt even an accident. He did it Willingly and on purpose", "I know that as I read every day. OP said she’s starting to read so she likely didn’t make this connection. Regardless of if she knew or not, his reaction is so over the top absurd.", "Agreed. He doesn't mention how he folded the page, or if he only folded a single page or multiple pages. I'm assuming he only folded over one page as he had just started reading the book. However, he doesn't mention how he folded the page(s); a single corner isn't so bad but folding over multiple corners, or folding the entire page in half could make me irate too! Bookmarks people; use them!", "no it was a mistake that he should've told op to not do again. Normal people don't scream and shout the first time a minor offense happens.", "If it was a collectible book, OP destroyed its value.", "The problem is that she BORROWED his book and would not have returned it in the condition he gave it to her in had he not seen her folding the page.", "Cars and books are not interchangable.  Cars cost thousands and books are a dime a dozen.", "Minor offense? Capital crime. He should have annihilated OP from orbit.", "And screaming & slammed doors corrected that?  She’s not a normal reader so she likely didn’t even know what you’re saying.", "It doesn’t matter OPs brother care and it’s his books YTA  and you need to replace that one for him, it’s the least you can do.", "Not to someone that really loves books. It’s not about monetary value, if someone really loves something, they’d trade something technically more valuable for it.\n\nBut the car was just an analogy. It could be a small hole in a borrowed shirt, a scratch in a borrowed frying pan, light teeth marks on a borrowed pencil. All of those, in this context not done in an accident but done deliberately, would be disrespectful to someone else’s property. You might fidget with the loose threads on your shirt, but not someone else’s. You might use metal utensils in your non-stick frying pan, but not someone else’s. You might chew on your pencils, but not someone else’s.\n\nIt’s best to take care to remember that these borrowed items belong to someone else, and to treat them as such.", "YTA you don’t wreck someone else’s book like that. Do what you want to your own, but not other peoples", "I'd expect to have to inform a new reader that it's impolite to crease the pages of books. \n\nYou're not new. \n\nYTA.", "YTA. You did ruin the book. Might not be destroyed but who the heck taught you how to handle book?", "YTA. If you borrow anything you need to return \nit in as good or better condition than it was when you borrowed it. How you treat your own books is irrelevant.", "YTA\nIt’s not your book don’t fold or mark the pages. You could have gotten a bookmark or a piece of paper to mark your page, these wouldn’t have messed with the pages.", "YTA. \nYou're an adult, you should know better. You know books are important to your brother, and you've just changed that book from near-mint to practically valueless. Collecting books is like collecting anything else. \nYou don't damage people's collections.\n\nTreating books that way is savage.", "Yeah, use a bookmark and don’t damage others’ property. YTA, plain and clear.", "YTA\n\nYou broke book borrowing etiquette:\n\n1. always ask permission BEFORE taking someone else's books\n2. You MUST keep the book in the same condition as it was BEFORE you take it (no writing notes, underlining, folding pages, etc.)\n3. give the book back \n4. only keep the book for a short time.", "I too dog-ear pages, but YTA.", "YTA. Now you know. Apologize and move on.", "YTA. If you borrow something, you need to treat it with respect. You caused a permanent blemish in something your brother loves.", "Are we being punked?  I feel like we’re being punked. Ain’t no way someone thinks they’re in the right when they vandalized someone else’s property.", "YTA-but softly though because maybe you didn't know, books can be very important to people and sometimes, common things that are seen as normal can actually be very damaging to books, like bending the corner to mark where you were, in the future, it's best to use a bookmark instead, like an actual bookmark or a piece of paper of something, did you see any folding marks on the pages in the book when you were reading it? It's also the fact that it wasn't your book, it was your brother's, meaning you have to respect it and try your best to keep it in the condition it was when he gave it to you. He clearly loves his books and if he's been collecting since he was 10, they mean a lot to him so it can be upsetting to lend out a book and then get it back with a multitude of the pages bended and ruined. \n\nit's fine if you dog ear your own books if that's what you prefer but not everyone likes that for their books, you should apologize genuinely to him.", "YTA never ever fold the book of another person, without asking for explicit permission first. Buy a bookmark for fucks sake", "YTA find a bookmark. Even a spare piece of paper, a receipt, anything. Don’t mistreat a book that is not yours", "In a world in which bookmarks exist why would you damage a book by folding the pages? Hell even just using a scrap of paper gets the job done.\n\nIf it was your book then I’d still disagree with page folding but it’s your book so do what you want with it. If it’s someone else’s then you should have more respect for their property. \n\nYTA", "Yta. You owe him a sincere apology. You might not think it's a big deal, but you damaged his valued property.  It's a big deal to him.", "YTA. Do that to your own books, but if it's borrowed use a bookmark so as to not damage somebody else's things.", "YTA. Your book, fine. Someone else's book, never. I had a friend do that to one of my books. Never lent her another one again.", "you're pathetic. it's THEIR property, fold your own shit, use a damn bookmark", "YTA- It may seem dumb to you but as a fellow book reader, I'd be pissed too. Return a book how you found it, that's how they stay good for long periods of time.", "YTA YTA YTA. I am so protective over anything that belongs to me. Especially books! As he's your brother you should have known what he's like. My siblings know exactly what I'm like and wouldn't dare damage my property! Even if you didn't know, just ask - I always treat other people's belongings with such care. My sister doesn't much care for keeping books in pristine condition but I do so she always checks with me.", "YTA. You could’ve asked for a bookmark, made one yourself or just note the last page that you were in somewhere so then you could remember next time you read the book. This is not your book. If it was your book then you wouldn’t be TA. But it’s not yours, it’s your brother’s. He let you BORROW it just to read it.", "Yta, you're damaging his books. You know he cares about them. Get a bookmark, you could use a piece of paper, a ribbon, you could even use a tissue, you absolutely do not need to bend the pages. If you don't want to take care of other people's belongings don't ask to use them", "YTA. How are you 21 and seem to have no idea why this would bother your brother? It would bother anyone who loaned you a book.", "You *folded a page to mark your page* on a book that isn't yours? YTA.\n\nIt's bad enough to damage your own books, but hey they're yours so do what you want, but when you borrow something, it should be returned in the same condition it was given to you.\n\nIt's not so much about the book, for me, but that you're showing a lack of respect for other people's property.", "YTA. \n\nYou didn't ask, then mistreated the property. He finds satisfaction in those books where you see them as just things.", "YTA use a bookmark", "YTA you damaged his property without his permission. You should’ve simply asked before doing that since it damages the pages. Even if you don’t mind your books getting bent up, you should at least have the decency to understand that others might not", "I dog ear if it’s my own book. I would never do it to a shared book like a library book or something borrowed. YTA, but buy him a new copy and apologize.", "YTA\n\nYou really see no problem ruining the pages of someone elses book?", "YTA... it wasn't your belonging.  I'd get mad too, not even because of the damage, but the thoughtlessness behind it.  If you borrow something, be respectful and try to return it in the same condition you received it in.  Also... maybe try a bookmark, eh?", "YTA. Some people like to keep their books in like-new condition and they have a lot of emotional attachment to their books. You don’t dog-ear someone else’s book, period. You can use any scrap of paper for a bookmark, you don’t need to dog-ear", "YTA completely. Use a bookmark. A piece of mail. A length of string. literally \\*anything\\* to mark your place. Dogearing pages is actual damage to the book and you aren't respecting his property.", "Okay yes YTA. But like, the smallest negative karmic debt generated. As long as you apologize sincerely and don’t be a dick about it. Someone said buy him a new book lmao. \n\nListen the anti dog ear crowd, books are sacred and I could suck the far out of a sweaty dickens first print crowd, are going to overreact to a single dog ear. Maybe it’s a touch of tism, I dunno, but they are not a compromising crowd. Best to appease them and avoid them. They also say stuff like “rules are rules”. \n\nYou very mildly suck for not being considerate of someone else’s property but causing minimal actual damage.", "YTA. It’s fine to dog-ear your own book, but not someone else’s. It’s not that hard to use a bookmark.", "YTA. You don't fold pages in a borrowed book, you heathen.", "yta. you didnt stress him out intentionally, of course. but it happened. he collected books for the most part of his life so i get him. if you want to crack the spine or mess out with the pages, buy your own books from now on! you should apologize to him", "Yeah it is not cool to do to other people’s books. Use a bookmark or something else. Don’t bend them cuz the crease stays forever. YTA", "YTA. Get him a new copy and apologize. Use a bookmark from now on.\n\nPeople who collect books often do their best to preserve them. If you become an avid reader, this will not be the only time you borrow from someone who takes this seriously. Likewise, you should not bend pages in library books.\n\nIf it's your own book, bend away.", "YTA. This is why I don’t loan out books. That’s what libraries are for.", "YTA - if you can’t treat other people with respect (by taking care of property loaned to you), then you’re just a brat that deserve whatever ear lashing you receive.", "YTA.  \nyou do NOT do that to a book, much less to one you do not own.", "Wasn't your book and you treated it as such. If you borrow something, it's your responsibility to return it in the same condition you got it. Folding pages like that guarantees that the page will rip with age. If he's a collector, then it's likely that he hopes the books will have value when they go out of print. You folding the page decreases the likelihood of that. YTA.", "YTA, it’s not your book. It’s not that hard to find a piece of scrap paper or something to use as a bookmark.", "YTA. When you borrow someone's things, you should take care to return it in the same condition you received it. That includes not creasing the pages of books. Use a piece of paper as a bookmark if you lack one. \n\nYou're 21, this childish, I can't understand the consequences of my actions or how they impact others is way past its expiration date. Even after he told you what you did, you shrugged your shoulders because heaven forbid you show any self-reflection. Apologize and replace the book you damaged.", "YTA. Dog ear your own books, not other peoples. If he’s been collecting since he was 10 he’s extremely likely to keep them in pristine condition and by folding the pages like that you’re ruining his work in keeping them in good condition and, depending on the book, ruining their monetary worth and value", "YTA, never ruin a borrowed book. I absolutely hate it when someone folds “dog ears” a page in my books. Use a freaking bookmark, heck even a piece of paper. What gives you the right to damage something that someone loaned you? Some of us like our books in perfect condition. This is a huge deal to most book lovers, we collect and treasure our books. Exactly like other people do with their collection and nobody wants someone to damage their collection weather it be cars, toys, stamps or anything else people collect. What you did was 100% disrespectful and uncaring. Enjoy buying all of your own books in the future.", "YTA. Only monsters dog ear pages", "OMG. You bent a page from a book to mark your spot?! You are a blasphemous heathen and a huge  asshole.", "YTA, massive gaping asshole. You do not dog ear pages on someone else’s book without their express permission to do so.", "YTA.\n\nThat's not something you do to other people's books.", "NAH but you have to replace the book. I write in my books and it drives some people nuts. Some people want their books to be pristine. To him, it's ruined. It's a book collector thing.", "YTA I find it interesting that you clearly don't respect your brother's love of books. Let's say you had a car. You really like this car and keep it clean and tidy. Your friend borrows it and throws food wrappers all over, leaves crumbs and dirt on the floor mats, and spilled a drink in the cup holders and leaves it. How would you feel if your friend just shrugged and said, \"I have always done that in my car. It is not that big of a deal.\" You can treat your own stuff however you want. That was his book and you don't care how he wants you to treat his property.", "You fucking dog eared the page in someone elses book!?\n\nThats like the actual King asshole move. \n\nLike the FIRST thing you're ever taught in elementary school library is how dog-earing pages is a dick move.\n\nYTA.  BUY HIM A REPLACEMENT NOW.\n\nDog ear your own books, but doing it to someone elses is Destruction 100%, and you ABSOLUTELY owe him a replacement.", "YTA. You have lived with your brother for 18 years. You know how he cares for his books. You borrowed one and failed to take care of it. He will never loan you another book or anything else. I don't blame him.", "I dog-ear novels, but would never do that to someone else's book because it's their property, not mine.  You don't have to \"get it\" why he is protective of them, it's his property and you were disrespectful and did damage it by intentionally creasing the page.  YTA", "YTA. Most people (in the US) learn in elementary school not to dog-ear a page in books that are not yours.", "YTA, not because you bend book pages, that’s perfectly fine to do to your own books, but try not to do that to other peoples books. It was rude of you to damage the papers in your brothers book, you should replace it for him. Just respect other people’s property in the future 👍", "YTA replace his book immediately", "Don't take other people's shit and treat it badly, you're not supposed to dog ear books. We have bookmarks for a reason. If you're not going to be respectful of your brother's property, don't take it. YTA", "YTA have you not heard of a BOOKMARKER. \n\nYou don’t dog ear books!", "NTA. What even are these responses???\n\nIt’s not like you tore the page or did something that causes real damage to the book. Once the book is closed and the page is unfolded you won’t even be able to tell it was ever folded in the first place due to the weight of the book and any others pushed up against it. He never told you not to do that and you never meant anything by it. The book ain’t ruined. It ain’t that deep. He overreacted 100%. It’s a simple mistake and now you know.", "Ehhhhh. For me it’s a soft YTA.\n\nI read the bending down the page and actually gasped out loud. And I am the same with not cracking the spine (another commenter).\n\nHowever, I applaud you reading more and having dealt with a sister who well…thoroughly enjoyed my books. Sigh. Wine glass rings, overflowing toilets (that was a first edition too…it still hurts), melting the glue in the sun, the list goes on.\n\nI would recommend an e-reader. My favorite is the glow light by nook. Also, if you have a library card most libraries now days have an impressive selection of both e books and audiobooks.\n\nOr you can go the lovely route of physical books and get them from there as well.\n\nIF your brother ever lets you borrow another book, please be more careful.", "YTA. You *did* ruin his book since you damaged it.", "Yeah, yeah, treat items that aren't yours with care. Soft YTA.\n\nBut some of y'all are *completely* unhinged and irrational over the page folding of an inexpensive and easily replaceable object. (We aren't talking about rare, collectable, and hard to replace books.) I think some of y'all would rather have your car dinged.\n\nIt's certainly one's right to dislike page folding, and to have a preference of how one's belongings are treated, but I don't see how she was supposed to know ahead of time that this is *verboten*. (At least until the first time they see someone come unglued over it.)\n\nI mean, why stop there? Why not lose your shit when people don't use gloves so skin oils don't get absorbed into the pages of your mass market paperback? Doesn't that \"damage\" the book too? Shouldn't they have just *known* that?\n\nHonestly, why don't dings, bumps, and folds give a book more character? A mark of where it's been and who it was loved by? You'd rather have a sterile and pristine book on a shelf that looks like it's never been read?\n\nHave your preference, but at least recognize how objectively irrational your rage is. Calling page folders \"monsters?\" Get a grip.\n\n/rant", "He's the asshole here.\n\n1. Yelling at you?? Why not calmly explain to you why\n\n2. Why didn't he set the expectations to not fold the pages? Could've avoided all the drama\n\n3. If he so type A with his books, why let you borrow the damn book", "YTA. Do NOT dog ear books. That’s sacrilege and there’s a special place in hell for people who do this. Also NOT YOUR BOOK? Imagine getting an important document in the mail that you’re mad excited about and the mailman bends it just bc it doesn’t tell him not to.", "YTA only savages fold pages. This is not an acceptable way to handle books. Use a bookmark like a normal person.", "YTA don't be surprised if your brother goes NC you don't deserve him in your life", "NTA, just unlucky and foolish. Yes it's wrong what you did but he is overreacting. Ruining is like dropping it in a bucket of water or something. Maybe it's a very rare copy or it has some sentimental value to him but there is no reason to call it \"ruined\". Its damaged at the most. Just go apologise and explain you didn't think of what you were doing. And to be honest, you showed interest in his favourite hobby that should mean something to him.", "NTA because you didn't know. Now you do, so buy him a new book and some bookmarks and apologize for the mistake you made.", "YTA. NEVER 'dog ear' books! I can't stand it when people do this. And if you ask a librarian about it you will get an earful.", "YTA Folding the corner of the page is a hanging offence.\n\nETA NADT", "YTA. I would be livid if someone desecrated one of my books like that. Us book people are savages.", "YTA. Have you ever heard of returning something in the same condition you received it? How will you return the folded page to an unfolded condition? Do you have the technology to remove creases from a page? If not then you violated one of the fundamental rules of borrowing items, and henceforth will not be allowed to borrow items again.", "Folding over a single corner is not the worse defacement, but YTA for not recognizing that it was a precious object to your brother, and for not following the principle that anything you borrow should be returned to its owner in the same or better condition.", "Eeeech. Lots of triggered people in this thread. JFC. I would say his reaction is pretty over the top if it's a cheap $10 mass market paperback, but if it's a collectable that he spent a lot of money on I can see how that would upset him. I stand by my earlier statement that his reaction is over the top. He could have asked you kindly to not dog-ear the pages. The temper tantrum is how a 10 year old would react, not an 18 year old. I have a huge collection of books and lend them out all the time. I could not care less if someone dog-ears the pages. Shrug.", "YTA. How hard would it be to get a old piece of paper fold it a couple times and make a bookmark? Not very. You did RUIN his book, it doesn’t matter if to you that it wouldn’t be ruined as it’s not your book. You need to replace the book and get him a nice bookmark (I’m sure he already has some, but do it anyways) as an apology. It will show that now respect him and his book collection.", "YTA It is absolutely a crappy thing to do. Use a bookmark", "YTA. As a book collector this harms the books. It’s also not your property. You are BORROWING someone else’s book. Just like you wouldn’t paint a table that you borrowed from someone for a short time. You can use a lot of other things to save your spot that didn’t involve damaging", "YTA,  never ever crease the pages to save your spot. Grab a old receipt, a corner of a newspaper,  a piece of not paper.\n\nI would certainly call this sacrilegious", "I love books, I read way too much  \nAnd dog earing a book, *especially* one thats not yours, is an absolute YTA", "YTA. What you do with your books is your own choice, but you never ever ever do that to someone else’s book. Use a piece of paper, a paper towel, a receipt, anything but never damage someone else’s books.", "As a book lover, YTA. He lent you a book. It wasn't yours to alter in any way.", "YTA. You don’t do that to other people’s books. Use a bookmark.", "Yta", "Yta, my books are in pristine order. You use a bookmark. You need to apologize and offer and replace his book", "YTA.\nYou can dog ear your own books it ain't yours to do that with.  I had rule when borrow my books of no dog ears and don't fold my books or break my spins. Had one person break my spin of a book pages everywhere and was like oops. Yea never let him borrow again. It was his first and only borrow.", "YTA\nYou never dog ear a book that doesn't belong to you.", "YTA - have a bonfire with your own books but folding the corner of someone else’s book is disrespectful.  Every time the owner looks at the pages of the book, he will see the permanent creases in the book.  How annoying.", "I dogear my books. But I would Never do that some someone else's property. that is absolutely 100% YTA behavior.\n\nThe fact that you Knew already he's a Collector really makes it worse.", "YTA. You shouldn't do this to anyone, but ESPECIALLY someone who collects books! Replace the book. I feel bad for your brother.", "Do not dog ear a book that isn’t yours! Never ever. That’s how you don’t get to borrow someone else’s book! \n\nYTA. Get him a new book and yourself a bookmark.", "YTA . This is why I don’t like lending anyone my books", "YTA, don't  treat  other people's  things the way you would  treat yourself, treat them they way THEY would  treat them. Buy hom a new copy.", "YTA.\n\nHe’s a collector, and he generously let you borrow his books with no problems at all. This is something that’s virtually irreversible with books, once you fold it weakens the paper and lessens the value of the book (considering he’s a collector, it’s pretty important). It would not have been hard to get a bookmark, piece of paper, etc., or even just to write down the page number you were on.", "Use a bookmark", "YTA you could easily put a post-it note, piece of paper, pencil, ANYTHING to mark where you were", "Buy a damn bookmark, folding over a corner is an abomination to keeping books to begin with but doing it to someone else's book and showing no remorse is truly astounding. \n\nYTA", "YTA you could easily put a post-it note, piece of paper, pencil, ANYTHING to mark where you were", "YTA use a bookmark and buy him a new copy. You don’t do that to things that don’t belong to you.", "He's tweaking. It's just a book, you didn't do anything wrong.\n\nNta.", "Unfortunately YTA…But I don’t think you were aware nor was it intentional. But that doesn’t change anything. (PS-That’s why I have an e-reader…)", "YTA. You don't respect other people's property. You've heard of a bookmark, right? A small piece of paper would've also sufficed.", "YTA because you deliberately damaged his book. This isn’t that deep. Use a freaking bookmark. Use a tissue. Use anything.", "Totally YTA. How old are we?", "ESH I love books, but I’ve never understood the don’t bend the spine / pages. Unless it’s a rare book, it’s just seems silly. \n\nStill, it wasn’t your property. Replace it and apologize, then move on.", "Good on you for trying to read more! \n\nGentle ESH. you were borrowing something, so you should treat it with care even if you dogear your own books. However, if your brother is super specific about how he treats his books, he should have told you, “yes, but can you make sure not to hurt the binding, dogear the pages, etc.” \n\nThis isn’t an excuse to say, “sorry but you should have told me,” though. You should apologize, offer to get him a B&N gift card for his birthday, then ask him in the future to let you apologize and talk out problems instead of running away and shutting down. \n\nAhhh, siblings.", "Honestly\n\nYou knew that he had a collection and it means a lot to him, so you could have been more accommodating with the book he loaned to you\n\nBut\n\nDoggy earing a page isn’t that severe of damage. And he didn’t need to scream at you for that. That being said he could have explained to you not to do that considering he stopped you from folding the page\n\nPersonally I think you guys need that have a discussion about this and see what the rules are for borrowing. ESH", "Ntah. I’m a huge reader and I suppose I think.. it’s a book. I’d do the same so maybe I’m the asshole.", "ESH.  Clearly you are in the wrong.  Maybe you didn't know better.  I always dog-eared my books. But he overreacted by going straight to shouting over one page in one book.  \n\nIf he had said \"hey please don't do that, I'd like to keep them in good condition and they are important to me”, I’d exonerate him.  But you owe him an apology", "All these people mad at you for dog earing the page even though you had no idea it was a bad thing need to chill out good lord. You don't even deserve a \"soft yta\". Your brother flipped out for no reason after not even having given you a heads up. I hate dog earing now, but I used to do it exclusively! There was no way for you to know your brother would be so upset by that. Plus he totally overreacted. \n\nEven if this book was some crazy important/expensive collectible, he should have told you how he wanted you to treat the book or made sure you had a bookmark first. It's also your brother so he probably put a little extra pizazz in his overreactment cause that's what younger brothers do, but he's 18 there's no way a book collector like himself wasn't aware that people dog-eared book pages (especially if you live with him he totally would have seen you doing it at some point and like internally cringed). \n\nThis whole \"blame the uninformed\" rhetoric is an entirely backwards view on how these things get handled. You literally didn't know but I'm sure if he had said something to you you would have respected his property. This wasn't a willfull ignorance situation but that's what all these people saying yta are treating it like. \n\nYour brother was a little bit ta for overreacting like that right off the bat after giving you no warning. But it is his collectible that he cares about, so it was probably a heat of the moment reaction. You should definitely apologize, but it was an understandable mistake.\n\nNAH.", "Shocked by all the YTA here. I’ve always been a corner folder and found out quite late in life that some people have a problem with it. Your brother over reacted. He could have simply asked you, civilly, not to do it instead of throwing a tantrum. What sort of books are we talking about here? Hard covers, collectables, first editions? Apologise, and, obviously, don’t do it again but you made a mistake, you didn’t murder his puppy. Books are to be handled and read not some esoteric treasure.", "I swear to god this sub doesn’t understand proportional response. At best this is an ESH. And even then brother is the bigger AH. \n\nBrothers response was totally uncalled for and he over reacted big time. Should op have dog eared the book?  No but my god this sub and the brother are acting like she destroyed the book. \n\nThe proper response from brother should have been “ hey sis, can you not dog eat my book. Here’s a book mark if you need one.” \n\nGo outside and touch grass.", "[removed]", "YTA. As someone who likes their books as pristine as possible, this post makes me so freaking angry. When you borrow someone's book, you have no right whatsoever to modify or damage it. The fact that you are oblivious to that makes me even angrier.", "YTA. I'm an avid reader and I've always hated the dog ears people do! You are ruining his books. I'd be so upset/angry. I've worked around it by never lending out any of my books and he probably will also do the same after this. There are so many things you can use as a bookmark that doesn't involve ruining the actual pages of the book. Do whatever you want to a book you purchase for yourself but don't do it with books you don't own and borrow.", "YTA.  You know those books are important to him, know you have a history of doing it, and now you want him to explain why it's \"bad\"? You're not just the AH, you're the worst kind of AH.", "YTA. Never fold the corners down on borrowed books. Never. It's basic etiquette.", "YTA. It’s not yours. I feel like most these peoples parents never taught them manners", "YTA buuuutttt.... I feel like he overreacted. I would have just been a tad upset and asked if you could replace it or just never let you borrow a book again.", "You shouldn’t do it to library books, and you shouldn’t do it to other books you borrow. You’re damaging the books. What you can do to things you own is different than how you should treat borrowed things. Reading is good. Just grab a bookmark next time. Ask your brother if buying a new copy would repair the damage to your relationship. Be prepared for him to say yes, but still be annoyed. \n\nYTA.", "On one hand yeah it wasn't a good idea to do that, but it's not like you've done it repeatedly after he told you not to and you didn't do it maliciously just out of ignorance, so I'm not going to say YTA. That said he really cares for his books so I'm not going to say he overreacted either\n\nJust give him a sincere apology and offer to make it up to him. If he doesn't want to let you read his books anymore, you'll have to buy your own.", "YTA, \n\nIt's like someone borrow a shirt, shoes or something else and to be sure to not mixed it, they take a permanent pencil and put a big line on it and then give it back to you. Or you let someone take your favorite pencil and they put it in their mouth. \n\nIf it's not yours, you give it back in the same condition, otherwise it's not borrowed, you took it, did whatever with it and once you got bored of it, you graciously let the original owner take it back (exaggerated scenario but still)", "YTA- Ever heard of a thing called book mark ?", "Yta. You can treat your own books however you want but you should treat other people’s books with respect.", "YTA but it’s not a huge thing. I’d think about replacing his copy.", "YTA do you lick your fingers to turn the page too?", "YTA. You DID ruin his book. You may not care about the integrity of the pages, but it's not your book to mess with. Buy him a new book. I personally don't like when people do that to books in general, but do what you want with YOUR BOOK. But this wasn't your book, and the worst kind of book person is the one who does this to someone else's books.", "YTA! What you do with your own stuff is up to you, but that’s his property. You don’t get to say what other people should or shouldn’t value. When you borrow something, you always return it in the same condition. That’s just basic decency.", "YTA. Ever heard of a bookmark? Or a post it? Anything??", "Use a bookmark like a normal person, even if it's just an unused tissue.\n\nNot your book to damage.\n\nThis is something my brother used to do, mindlessly come in and start creating triangles with the corner of pages, he had no interest in actually reading one all the way through, it was just to indicate which ones he'd already damaged because that's the way he was with my stuff, he needed his pointless paper-folding to be complete.  It is bad because it's disrespectful and creates damage over time.\n\nI used to work selling second-hand books, any books that had light foxing, dog ears, overly bent spines and yes, folds in the paper which made those pages weaker and easier torn over time, would not be given a good grade for reselling.\n\nYTA.", "YTA. Agh, I’m a librarian: If you’re borrowing someone’s book you need to return it in the same condition you borrowed it in. I’ve never marked up, dogeared or broken the spines of my own books, I can’t imagine doing any of that to a borrowed one.", "YTA. My sister was equally protective of her books.  I was not a cautious kid and I was yelled at on more than one occasion.  I learned by the age of 10 to respect her items.  At 21, I would have also thought you would have learned.  Take this lesson moving forward in life.", "YTA but by accident if it makes sense. You had no clue that was a bad thing to do but you still ended up doing it which is still a bad thing.", "It's called a bookmark.  Your lack of care and respect for someone else' possessions is the issue.  You borrowed a book it is your responsibility to return it in the condition it was lent.\n\nYTA", "Use a bookmark, don’t be an uncouth buffoon.", "My sister gave me back one of my books with a cracked spine. I never lent her another book. YTA, treat other peoples things with better care.", "YTA. Just ask if you want to do that. Clearly none of the pages were bent so he is simply the kind of guy that doesn’t bend pages. Plus how hard was it to find something to use as a bookmark? Or remember the page number for two minutes?", "YTA Any scrap of paper can be used as a bookmark and won't damage the book. If you own the book and want to dog-ear the pages, have at it. When you borrow something from someone else, you have an obligation to treat it with care and return it in the same condition you borrowed it. Think of it like loaning someone your car and getting it back with a large scratch or dent on the side. That wouldn't affect the operation of the car, but you would be angry.", "As a person who has many floor-to-ceiling bookshelves packed with books, YTA. \n\nIf you're borrowing a book, don't overbend/break the spine, don't rip pages or the dust jacket, and DON'T DOG-EAR PAGES. Use a bookmark. If you're not going to respect HIS collection, buy your own book or go to a library. Thriftbooks.com is a good site for books at a decent price.", "YTA, do what you want with your own property.  But I would have the same reaction to someone dogearing a page as your brother.  Honestly it a big reason I don't lend out my things to others.  No one respects your property like you do, you will nearly always get your stuff back in worse shape then you lent it out.", "YTA for already stated reasons. FYI scrap paper makes a bookmark if you don't have one, just don't use newspaper  bc the ink bleeds.", "YTA.", "This is so not real. Nice try, troll.", "YTA - I don’t lend books to people that dog ear. Books are perishable they break down over time and some people are sentimental/anti-wasteful and want to give their belongings the greatest longevity they can.", "YTA\n\nThe ‘double-fold’ test is a test of a book’s condition that involves creasing the corner of a page, and then creasing on the same line in the opposite direction. Creased corners can actually break off. This does reduce the collectibility and resale value of the book. (Not that modern firsts are all that, but, you know, just don’t. It’s not yours. Use a bookmark.", "Bookstore owner here, while I am squarely on the team of maul your books all you want because the physical object isn’t the important part, the story is, YTA for not treating your brothers book with the respect due to a Borrowed item. \n\nApologize and offer to replace his copy of the book, and in the future use a bookmark in borrowed books.", "You should have used a bookmark (even a piece of paper can mark your place) rather than ruin the page by folding it. The crease you put in the page can't be fixed.\n\nYour attitude about destroying someone else's property and acting like they shouldn't be upset makes YTA.", "YTA. OP, people like you are why I NEVER lend my books to anybody. Look it’s ok if you want to dog ear your own books, but don’t deface other people’s books. \n\nWhen I was growing up, my mother used to absolutely destroy books. Every single book she had fell apart-hardback, paperback-it didn’t matter. They were all in pieces by the time she got through with them. And no, that’s not an exaggeration. I could never understand how she treated her books like that. And you could never read the book after her because there were literally pages missing! It still makes me crazy to this day. \n\nSo, go buy your brother a new book, and never touch his books again.", "I'm sorry but YTA. It's one thing to bed the pages of your own books, I do it A LOT, but you never bend the pages of books you borrow, doesn't matter if it's from your brother or the library...... that's a big no no. Use a bookmark or something.", "YTA. You NEVER dog-ear or mark up books, yours or other people’s. That’s horrendously bad book etiquette.", "YTA…I’m laughing right now because my son has banned me from his books because I do the same!", "Yta massively get a bookmark. You never band pages on borrowed books ( shouldn’t on your own but that’s up to you but never on a borrowed book) plead ignorance for your serious faux pas and apologise", "YTA\n\nIt’s not your book. You permanently disfigured your brother’s book by folding the page. You could have grabbed a paper towel to use as a bookmark at the very least.", "YTA but this seems more of an honest mistake than anything. Not everyone is aware of damaging books via dog earing. Especially someone who is starting to read more books.", "YTA!!! my younger brother did the same thing to my avatar the last airbender comics. when i tell you my heart dropped to the floor when i witnessed him bending the pages… despair. he ended up buying me another copy when he realized what he had done. it’s an easy fix if you’re sincere in your apology. us collectors can be very protective of our collections, it’s a leap of trust for some to loan or let others touch/use. i don’t think you were trying to be malicious in doggy ear-ing the page, but it definitely is hurtful from your brothers perspective.", "YTA. I too have often used this method to save my place in a book if it is *my personal copy*, I also fold paperbacks to the point that their spines crack, it is bad form to do either of these things to a book that is not yours. \n\nUse a book mark if you are reading a borrowed book of any kind (whether it’s someone’s personal book or one from a library). Replace his book and apologize.", "If you borrow something treat it at least as good as the person you borrowed it from. Ideally treat it better. \n\nYTA", "Pretty sure everyone’s made it clear YTA. You did kind of ruin his book. Especially since you know he collects them. You need to replace his book. Maybe buy a bookmark for yourself, too.", "INFO:\n\ndid he tell you not to fold the corners of the pages?", "Oh man.... \n\nI learned at a VERY young age not to dognear books. Not to open a paperback very far so the spine doesn't break. Not to crease the book cover. Not to drop the book and bend in a corner. To treat my Mama's books as if they were worth more than my life. LOL they weren't, BUT after a year of reading, they were an escape and I couldn't get enough! I read The Cycle of the Werewolf when I was 5 and never looked back. \n\nSoft YTA. Apologize to your brother.  Uy him a new copy, the exact copy!! And ask for his book rules. And keep a scrap of paper around you at all times!", "YTA \nIts not your book. You don't get to determine boundaries for someone else's stuff. Now you know, and next time you borrow someone's book I hope you do better.", "YTA, bending a book page can ruin a book for someone. You should treat books from other people the same way they treat their books, if they had dog eared it earlier or (if ur like me) spilled half a bottle of red gatorade on a book and then still lent it out it’s fine to dog ear. I literally keep a stack of bookmarks just for when I barrow books from friends it’s really just common curiosity.", "In my world your good. Books in my world are to be used, read, pass around so the words can reach as many people as possible. My entire Discworld collection is as dog eared and battered and as can be. Because they are well loved......\n\n\n\n Not your books. Use a bookmark.  Soft YTA.", "YTA doesn’t matter if the books are worth money or not they matter to him and the condition of his books matter to him \nYou borrowed it and it wasn’t your book or you place to do so", "YTA. It is disrespectful of other's property. You should always return something borrowed in the same condition that you received it.", "As a library worker, reading this pained me. Use a bookmark, a piece of paper, or just remember the page number", "YTA - You're damaging something you're borrowing.  It's really easy to find a scrap piece of paper to use as a bookmark.", "YTA, next time buy your own book.", "YTA because if it’s not your book you return it in the condition you borrowed it. I used to use scrap paper or old receipts as bookmarks. The fact that you care so little about it is exactly why your TA. Plus I feel like your glazing over how important these books are to your brother after the reaction he had.", "It wasn't your property. YTA.", "YTA you should never dogear someone else's book. How do you make it to adulthood and not know that? You should definitely offer to replace it or buy him another book as an apology.", "Folding the paper might not be a big deal to you but it’s clearly for your brother. Respect his things. YTA", "YTA. Not your book, you don't dogear it.", "YTA. \n\nThat's insanely rude. He'll never get that crease out of the page, and there are a million things you could use as a quick bookmark if you didn't have one handy. \n\nIf you did that to a book of mine, I'd be pissed, too. Books cost a lot of money, and if he collects, I'd assume he has put a lot of care into building his personal library.", "Whoah, no one should borrow a book without thoroughly studying Bookworm Etiquette. For example, NEVER DOGEAR A PAGE! Come on, even in all seriousness, it's someone else's property - you know you don't do that.", "YTA. This bibliophile has your brother's back. You fall into the monster category by dog-earing a book.", "https://www.amazon.com/s?k=bookmarks\n\nYou savage. \n\nYTA", "YTA. I would be livid if someone did that to one of my books. I hate when the pages get messed up. It seems like it’s habit for you which is an honest mistake, I’d just apologize and let him know that you didn’t realize he was bothered by it and then find a bookmark if you want to read one of his books again", "YTA! I'm a massive book lover and as soon as I read you folded the paper over I new then you fucked up. Take it as a lesson and next time use a book mark or something similar.", "From an avid reader who loves books- YTA. Sorry but you can’t mess up someone else’s property without being the AH and messing up something you know the person loves and truly cares about really makes you a giant AH. Replace the book and apologize. He trusted you with something he cared about and you messed it up.", "You never fold the pages of borrowed books. YTA. It’s like some one borrowing your clothes, purse, shoes and altering them, painting them, cutting them etc.", "YTA as it’s not your book to dog-ear. \nIf it was your book sure. But you shouldn’t do this with someone else’s book or a library book etc. \nHe kind of overreacted but he’s a teen and some people are really triggered by this. Especially if it was a book he really likes he probably didn’t want the book messed up. He could have just said hey don’t do that get a bookmark. But even after he was upset you didn’t recognize that you were the one who made the mistake or apologize for damaging his property so yes YTA.", "I bend pages. To be, a book should be lived in. But that’s only if it’s my book. This was someone else’s book. YTA.", "Yta I fold my own but not a book I borrowed!", "yta. And listen, Im guilty of this too.  Replace the book and by some nice bookmarks.  There's some magnetic ones that work pretty well.", "YTA. You don't vandalize someone's property and blame the victim when they're upset.\n\nI don't think there's much point of telling you to not do it the next time, because I doubt there will be a \"next time\". But maybe if you're contrite enough and replace the damaged item with a new one... (good luck if it was a signed copy or is out of print now)", "YTA. \n\nNo matter what it is, when borrowing something from someone, you should ALWAYS return the borrowed item in as good as or better condition than when you received it. This is Basic Courtesy and Respect 101.", "YTA. \nClearly the book meant alot to him. \nYou should invest $1 in a book mark or grab a scrap piece of paper to hold your spot. \nTo me it would be like lending someone your car on a full tank of gas and they bring it back on the brink of empty. Did they damage the car? No. But it was inconsiderate none the less to bring it back empty after they were kind to lend it to you. \nApologize for your ignorance and ask how to make it up to him .", "YTA. I had a cousin who did this to one of my hardbacks.  The book itself was a gift from an ex-gf who i still had a good relationship with.  It was hard to get hold of even as a paperback.  She spent, what at the time, was 3 days wages on this particular book and another by the same author for my birthday.  Ive not spoken to that cousin since the day he returned it to me with 15 pages that had been dog-eared like this.   I was beyond livid.  I still boil with anger 22 years later.", "YTA don’t mess up someone else’s book. Use a bookmark or remember your page", "YTA. I would never do this to a borrowed book, either from a person or a library. It's just basic book respect.", "Yah YTA but unless that book was a major collectors item then it’s really not a big deal at all. Just keep that in mind, apologize and refrain from doing it again.", "**If you can't read without dog-earing the pages, don't borrow books.** Not from friends, not from the library. You are permanently marking the book when you do that. I understand that you think you need to do it, but it's not something you should be doing to books that you do not own...and I say that as someone who had a \"rip chunks out of the margins and eat them\" phase. \n\nYTA.", "YTA. I have a large collection of books but each one is very precious to me. If I lended someone a book but it was returned with dog-eared pages or other damage, I would be very upset. This is all from experience from when I let my brother borrow a book and the condition it was returned in was so bad I thought he threw it off a building.", "YTA. Not your book, you don't get to fold pages.", "I'm confused with how people don't hust sort of intuitively know about where they are in books?", "You can use anything for a bookmark. I've used hair ties and receipts and hell even once when I was desperate I tore off a peice of a plastic grocery bag and used that. I've used a candy wrapper, a peice of string, and a picture. I am sure you have something around you 99% of the time that can be used as a bookmark. Don't bend the pages, and don't fold the books back. Especially if the book isn't even yours!\n\nYTA.", "YTA. Your brother is not only a reader, he is a collector. Collecting is a lot about taking care and preserving the items in your collection. Not many collectors are very open to lend their items, so you should think about how your brother trusted you with his book. Please, find a way to apologize and mend the mistake you made.", "YTA. I do this with my own personal books but never ever with borrowed books from friends, family, or the library. Always return things in the exact condition you received them or buy them a new one.", "I do the same thing, fold a paper as a book marker… to my own books. You never never do that to someone else’s books.", "When you borrow something you do not do anything that will cause it not to be returned in the exact same condition. This should be true of something like a car but even something as simple as a book, unless expressly told you can. Always keep this in mind when you borrow something. Now into this question, I'm a book lover I never ever folks pages of a book or fold it on the spine. I have collectable books and trashy romance novels none of them have folds or cracked spines, YTA.", "YTA- I thought it was kinda common not to fold the page? Grab a napkin to hold your place.", "YTA\n\nI’m hard on my books. I break the spines, i dog ear the pages, I write marginalia. But those are *my* books. When I borrow a book I do my damndest to keep them in good condition. I try not to break the spines, I use a bookmark instead of dog ear, I don’t write in them (and on top of that I *warn* people I often accidentally break spines while reading and let them decide if they still want to lend to me, I try not to with borrowed books but sometimes it still happens). You owe your brother a new book.", "YTA\n\nDog ear your own books, but never do it to one you've borrowed. My mom and I don't even dog ear each others books, and most of the time we share bookcases anyway. It's common courtesy.", "YTA for the reason of it not being your book. Do whatever you like with your own property, but to a collectors, dog-earing a page is definitely damaging the book. \n\nBut you can easily solve this. Ask your brother if you can replace it for him but you want to go with him. Ask him about books he likes; that’ll show you’re sorry and you’ll get a better understanding of why he’s so into books and why. \nIt could be fun for you too if you’re trying to get into reading more often.", "YTA you know damned well why he was upset.", "YTA. Have you seriously never heard that you should return a borrowed item in the same condition you received it?! If you damage it, you replace it. Use a bookmark, they don’t have to be expensive and you can even use an envelope or scrap of paper. And yes I say this as someone who has 3 bookcases full of books in my office that may be dog-eared with the spines broken. If I borrow a book from someone, I’m careful about how much I open the book and I use a bookmark. Your brother was right to get upset. You showed no respect for his property.", "I fold pages in my books to keep my place, but ONLY books that I own, and not books that I plan to sell later (like textbooks). I would NEVER do that to someone else’s book or any book I don’t own. \nYTA. You always treat someone else’s property better than your own", "YTA as someone who takes care of her books, that would make me really mad. I do my best to keep my books in good condition, I use bookmarks and I don’t bend them back. Respect his belongings, you’re too old to think doing that to another persons book is okay", "YTA. You knew he collected and treasured the books and thought this was ok?!?! I would never lend you anything again, book or not. Literally anything else could have worked as a bookmark without damaging the property you were borrowing.", "In case it's not clear, OP, folding the corner down actually weakens the paper at the fold.   If your brother is a real collector, things like that can lessen the value of the book, in addition to upsetting your brother.\n\nAdded: I work at a library.  We don't have rare or valuable books, but folding is one of those things that makes the book less appealing, especially when people turn down every third page and don't fold it back.  I'm one of the people who ends up unfolding all the pages.", "My hubby is a book binder (binder and finisher by trade). HUGE no-no. Especially if it's not your book. YTA.", "Exactly same here. I’m totally a dog earer/ spine breaker, but ONLY with my own books. Def buy him a new one!", "Yep, YTA OP. When someone lends you a book, it is a thing of trust. You obviously knew your brother cared a lot about his books. While I treat my own books badly ( dog earing, cracking the spine, spills, or even just beat up in a bag ), I know that if someone lends me a book it’s probably because they really like it and want to share it with me. I make sure I treat it like it’s sacred. I feel like that’s pretty much an unwritten rule among book lovers. Treat your own books as crappy as you want, but never ever harm a borrowed book!", "I dog ear my books, I'd never dream of doing it to a book I didn't own. OP is nuts.", "This! One of my best friends loves to crack the spine but I like the books to stay looking pretty, we just simply wouldn’t share books.", "Exactly this. I only ever dog ear books that I own, or that I've borrowed from my mom cause she dog ears too and doesn't care. The idea of dog earring someone's book is crazy to me. I'll make a bookmark out of a torn off corner of paper or snap a picture of the page I was on.", "I work at a library and you’d be SHOCKED at the amount of people who dog ear library books.", "OK but like, OP is a new reader. (Or at least, reader-for-pleasure). He may not have known. Brother's reaction was weirdly over the top. Coming from a massive book collector with a sizeable library, who used to own a bookstore. Anything extremely valuable or irreplaceable, don't loan it out. Anything replaceable, replace it when it gets damaged or ruined. \n\nESH. OP was an unintentional AH who learned that dog-earing ruins books and he shouldn't do it to borrowed books again. Brother flew off the handle and had an overdramatic reaction, when all he had to do was explain it to OP and ask that he replace the book.", "I remember talking about this with my parents and I always avoided breaking the binding. My dad took my book and said “The first thing I always do when I get a book is this” and he tried to crack the binding and accidentally tore the book in half.", "And some post-its, next time, just move the post-it.", "And yourself a bookmark!!", "'Dogearing' is worse than 'bookmarking', it's vandalism, my kids knew that from their first books, even my grandkids know not to vandalise books. OP, YTA definitely. Buy Bro a new copy and keep the damaged one to remind yourself to treat other peoples' property with respect.", "to add onto this: I've legit  used a folded paper-towel or toilet tissue as a bookmark. It's not hard", "Treat it so you return it in the same condition it was given to you", "Agreed immensely. If I want to bend the page in my books, I will. If I don’t, and somebody does, I would be cranky. \n\nOP, don’t bend the pages anymore.", "Or borrow a bookmark because no way the brother doesn't have a collection of those, too. OP, YTA - be better when borrowing other people's things.", "That’s what got me. 14 year old, ok… 21????", "I cherish my books and fold the pages down. Still, not cool to do it to someone else's books regardless. Even if they DO dog-ear. My dog ears mean one of my favorite scenes is there. It would be confusing to find random scenes dog eared", "Is this something taught in school in your part of the world? OP is clearly new to reading for pleasure and doesn't have much experience with the \"culture\" or etiquette around physical books. Someone who only read for school wouldn't automatically know about folding pages, regardless of their age. \n\nPeople who assume babies are just born with innate etiquette knowledge are weird to me. Everyone learns things as they experience them.", "I Just left a comment about my use of TP as a bookmark before seeing yours lol. But to add, anything that does not damage the book works - paper or otherwise ( piece of cloth, yarn, charging cable, shoelace....you get the point).", "Or find a piece of paper or a post-it-note even! Pages rip much more easily after being bent. YTA", "I've been known to use anything I had on hand at the time - even a square of clean toilet paper. I am not one to \"dog ear\" pages, and I immediately judge anyone who does it to my books. OP, if the book did not have visible signs of bended page corners (which sounds like it is the case), then YTA. Like so many others have said already, if it's someone's personal possession, you should treat it with a bit more deference and respect.", "That’s what I do. Frequently an envelope from a bill ends up being a bookmark. And those are my own books!", "OP is 21, not 6. So not only did she do this to his book, it also sounds like she has done it to every other book she has been in contact with, whether it's from the school or the library.", "I’m an elementary school librarian. This is part of our book care lessons at the beginning of every year.", "You might have, I didn’t. Not everyone learns the same things.", "YTA", "I'm sorry, but no. Even if they didn't know, is common courtesy to not damage in any frigging way an object that is not yours. The same way that you wouldn't touch a gaming controller that is not yours with sticky fingers stained by Cheetos, is not that difficult to consider using absolutely anything other than the page itself as a bookmark.\n\nPeople like OP don't respect other people's possessions because they are careless and don't care at all about the fact somebody else is the owner of that object, and not their entitled ass.", "its not that book lovers 'hate this one thing' \n\nits fucking damaging the book.", "Yea I’ve reached the age of 22 and don’t know any religious book readers. Most people would never know or think it’d be that big of a deal and I wouldn’t either (tho I’d prolly use a notecard or something myself cause it’s easier to find in my opinion). I’m glad you realize that op is NTA. I think their “Geez, what’s the big deal, stop overreacting” route came because she was confused and shocked by his reaction.", "OP murdered a book!!!\n\nNah, but seriously. Book people are funny about books. I said somewhere up there that it would be fine if I dog eared a book but if I allowed you to read a book that was in pristine condition, I would be ropable if it came back all bendy. \n\nIt’s still damage to a person’s property.", "This thread is wild. I truly didn't realize there were so many people who were this triggered by dog-earing a page. I say this as a lifelong reader with a big library of books.", "Hi I'm a librarian! Do not dog ear library books, or books you have borrowed from other people.\n\nDo whatever you want to your own books. Dogearing isn't a crime.", "Do you really think she's going to be allowed to touch any of his books in the future?", "I agree. Yeah folding pages is bad but it just makes her ignorant and not necessarily the AH. It sounds like she did it on instinct the same way I did growing up until I learnt what a bookmark was and how cherished books should be. She made a mistake, her  brother was (rightfully) upset and she should just apologise and use a bookmark from now on.", ">But literally fucking thousands of people fold page corners as book markers to keep their page wether its their book, a library book, friends book whatever.\n\nThousands of people also litter everyday, that doesn't make it okay.", "Proper response to seeing someone (mindlessly or not) damaging your borrowed property is politely asking them to avoid doing so in the future? I don't think so - especially if it was clearly in mint condition. They're not borrowing anything from me ever again, and I'm reclaiming that item at the earliest possible moment.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "In high school we read the abridged version of Les Miserables and I really enjoyed it so the teacher lent me a copy of the unabridged version. I accidentally dropped it and dented the spine and I felt so bad I bought her a new one lol.", "Librarian and archivist here. I do have rare historic books and documents that I'm responsible for.  A folded page is a missing corner of text in the future. A cracked spine is a missing page in the future. Don't get me started on tape, staples, or paperclips.... books can last for hundreds of years if you take care of them. No one wants to read a book that's all used and abused. \n\nOp YTA. Buy him a replacement and never again borrow a book unless you change your ways.\n\nEdit: Wow! Thanks for all the upvotes... normally 100 likes is a lot for my comments. To clarify, many of us history nerds love the abused books that are old and tell the story of our shared cultural. Many of us love the story a used book tells with its wear and tokens left behind. We do not damage new books that don't belong to us. Cheers to all the book lovers!", "Omg I can't imagine dog-earing a library book! I only started going to the library but I feel so protective of the books they've been so kind to let me borrow, I'm so scared to damage them.", "Elementary media specialist here. I teach my students not to dog ear the pages.", "Oh, broken spines are my pet peeve! Someone returned a book I had loaned them in almost mint condition and it looked like they had folded it like a newspaper.", "I will do the same thing only occasionally, and only with books that are mine.  If I borrow a book, then I make a quick bookmark by braiding some ribbon.  If I forget to take out the bookmark when i return the book, then I hope they enjoy their new hand made bookmark.", "This exactly. You can look through my bookshelves and it’s very obvious which ones have been read over and over. But a borrowed book is a gift and should be treated as such.\n\nYTA, OP. Buy your brother an exact replacement.", "I buy used books & most of my used books are in better shape than my wife's new books", "This is pretty much demanded in our family: \n\nhttps://www.museumbookstore.com/blogs/blog/how-to-open-a-new-book-properly", "or you know, any scrap of paper lying around.", "Receipts and train tickets are common bookmarks in my house.\n\nI bought a second hand book once mostly due to the bus tickets I found marking different pages. There were several different copies of the book, but the one with bus tickets was a. The most charming, and b. Had the least amount of damage to the pages.", "I used a flattened box from a tube of lip gloss as a book mark *for years*, my husband will often use a cigar wrapper to mark his place. \n\nIt was actually a pretty cool box from a limited edition Wonder Woman lip gloss and I’m bummed I lost it at some point.", "I often tear off a piece of whatever random junk mail, envelope, or other unimportant paper happens to be nearby. There's always something you can use.", "yup, and even if you lose your spot, it isn't the biggest deal. It takes one minute tops to find your place again.", "I use tags from clothes and also sometimes stickers that I’ve randomly gotten and don’t know what to do with", "I use that thin, multicolored yarn you can get at Walmart.", "I've been using the Health & Safety Guidelines from my Switch as a bookmark ever since I bought it. Tons of things can be bookmarks - 9 times out of 10, I can find something to use as a bookmark just by glancing around me.", "At what age is someone taught this knowledge?", "Same. I dog ear my books most times to mark where I'm up to. It's fine, because they're my books and it's my choice. I collect books, but not for monetary value - the value is intrinsic to me and the enjoyment I get out of them.\n\nYou know what I do if I borrow someone else's book? Use. A. Fucking. Bookmark. \n\nThat said, there's a special circle of hell reserved for spine breakers.", "Huge agree. My most beloved books tend to be the ones that are super beat up. Bent pages, cracked spines, maybe some writing, or even a coffee stain. Personally I see that as well-loved and the pristine ones as too clinical.\n\nTo each their own, though. I would never do any of that to a loaned book.", "Yes, etiquette is learned, but I do find it hard to imagine that a 21-year-old needed to be told to use a bookmark when borrowing a book.  When you borrow anything, you don’t damage it, even if it’s a minor thing like a folded page, and a bookmark is easy to get, there’s certainly no shortage of scrap paper.", "on the VERY first trip to the Library in elementary school its taught.\n\nSame kids missed this as the \"dont hit, dont be a dick, and return things in the condition they were lent\"", "If I was the librarians of the library OP visits, I'd ban them forever if it was in my hands. They don't deserve to access any books that belong to somebody else.", "The issue is it isn’t her book to dog ear.", "As someone who owns like 2 bookcases of books...if all your books look pristine that tells me you aren't reading them. If all your books look like they were just unwrapped from plastic straight from the store, it makes me think you just keep them for show and don't actually read them. Plus I love writing notes about stuff in my books, and I hold them open a lot and that isn't good for the spine lol.", "He could have just asked her to please use a bookmark and not bend the corners. He didn't have to snatch the book and stomp off on a huff. But I don't think he's wrong for not wanting the pages bent.", "My Gran did the same thing when my copy of Good Omens got coffee poured on it by the guy next to her on the plane. She even made sure it was the same version as it was a particularly nice hardback (had a ribbon and everything)", "Kudos to you for understanding the importance of looking after something that you have borrowed", "This is the way 🫶", "I borrowed a copy of white oleander from my English teacher. My dog destroyed the dust jacket and part of the cover so I went and bought her a new one. She told me I didn’t need to do that but I felt completely awful about her book being destroyed in my care", "As a medievalist and historian I do kind of want to read used and abused books - give me marginalia all day long - but I’m very much a rarity 😂 and I do feel sorry for the archivists who have to handle some real crap when looking after books.", "I wish I knew you when I tried donating a valuable copy of an Edgar Allen Poe book. I couldn't believe no one in my county wanted it.\nI gave it to a serious book collector who will take excellent care of it. I stopped hunting rare books awhile ago", ">books can last for hundreds of years if you take care of them.\n\nAnd de-acidify the paper", "Preferably of same printing and edition.\n\nI'm not a huge collector but I have a few fairly recent (1990s and early 2000s) first editions that are worth more than MSRP.\n\nAnd I doubt this is the case here but a few artist monographs where because they're first printings are an order of magnitude more.\n\nI'm not looking to sell and so let folks look through them, but I would be pretty miffed if someone were careless in a similar way (crack spine).", "I loved a BookTok post that circulated awhile ago about how to stretch the spine of a book to open comfortably for reading without cracking or breaking the spine.\n\nFolding corners is an atrocity to me, but I've loved some of the older books I've bought. I've found amazing impromptu bookmarks someone left in spots.", "OPs brother is 18. His collection of Ayn Rand and Heinlein is not ending up in the special collections.", "I always use the library receipt for my bookmark.  Added bonus I always know when they are due back!", "Those lessons stick!  I’m in my forties and I remember the school librarian teaching my kindergarten class about library etiquette, including not folding the pages. \n\nIn middle school we learned how to read a full sized newspaper in a confined space", "My kids use some weird/crazy things as bookmarks but I have never seen them dog ear a page. I attribute it to awesome media specialists and teachers who buy their own books because I have never had to address it. From 3 on they say things like \"we be nice to books\".", "Oh no! \nMy husband hates seeing me break them. But I only do it to my books, never a loaner!", "You would hate what I do to magazines then. I take them and take the cover and fold it over. I only do this though because I have a bad neck so folding it makes it easier for me to read with out bothering my neck.", "This’s what it looks like. This one’s in real good shape because I just did it but some of my Play magazines are pretty beat up dude to this.\n[https://imgur.com/a/LjhV4lS](https://imgur.com/a/LjhV4lS)", "My sister did that with 3 books of mine. I had loaned her the first 3 in a series and I had bought them brand new, they were in near mint condition when she got them. She broke the spine on all of them so badly I still haven't gotten over it. That was the last time I loaned her anything of mine, least of all my books. It's so infuriating when people have no consideration or care for other people's things when it's entrusted to them.", "Just FYI, the corners of used envelope make excellent bookmarks.", "Love thrift books.com for used books!  Such good condition they look brand new.", "Same for me. I cherish books", "My best friend and I bought the same book to read together, and I’ve been using the receipt I got from the bookstore that day as a bookmark. When I was little I used a square of toilet paper, for some reason", "Hell, I've used a tv remote when in a pickle looking for something.", "3rd grade when you’re forced to go to the library to pick out a book, just dont fuck with stuff that isn’t yours, it’s not a hard lesson.", "I also break spines 🤣 I read a lot of mass markets.", "That's my point, don't borrow a book and fold pages, common courtesy. My favorite books are all trashed too, I don't fold pages but they're well loved I'll just say lol I should have used different wording.", "I'm getting down voted to hell bc ppl here aren't very mature and think it's fine to scream about minor problems", "Yes! Thank you for being a fellow sane person in this thread. Books are tools meant to be used. I annotate a lot of the non-fiction I read. I travel a lot, so books are always getting thrown in my carry-on bag. I am not careless with my books and they are all in good condition, but they are certainly not in mint condition- even the autographed ones. If I lend a book to a friend, I'd probably be a little annoyed if they wrote or highlighted in it, but could not care less if they dog-eared a page.", "Don’t get me wrong, I agree with you and /u/lemonycricketLegs Some people are thoughtless and inconsiderate. But it’s not malicious, it’s purely selfish. Sadly, I think that thoughtlessness, inconsiderateness, and selfishness are more common than “common sense” and “common courtesy”", "Best book I've ever personally read", "People just need to make sure their marginalia is sufficiently juicy to interest future scholars 😁", "I have a couple books I read so often I started writing little notes in. for future me to enjoy as I inevitably reread the books again. Sometimes the damage is character, even though it makes it harder to preserve. \n\nBut the idea of doing anything to someone else's book is just. no. unacceptably awful. ahhhhhh", "I’m not even into books but come on bro that’s definitely one anyone should want", "I’m internally squealing because I collect Poe books. Pick me pick me!", "And your point is? Collecting books is special to his brother. He never said he planned to have a famous collection one day. He only mentioned that his brother collects books and clearly cares that those books are preserved.", "Regardless of intrinsic value, they have value to him. I have paperbacks that I read when I was a kid and I will treasure them until I die.", "Of course, no 18-year-old has ever saved up for something expensive.", "Being 18 doesn’t translate to that stereotype.", "Regardless of the assumptions you're making, the collection is important to the brother and the book is not OP's.", "Me too💖💖", "Mom???\n\nMy mom used to use the TV remote when I was a kid and she would finish a book a day. I however have been known to stick my DS, and then later my 3DS into books in an emergency. The list of stuff we've all used to mark our places is definitely long and some of them are slightly weird, but they've always been our books if there's risk of damage.", "Plus like...dog earing or folding a page can easily be fixed? You just have to flatten the page in the book and put something heavy on top of it. Or use a low setting iron over a towel on top of the page.", "I really enjoyed the series on Prime.", "Yeah it's absolutely one of my favourites if not my favourite. My almost gf and I both love reading so we've agreed to exchange copies of our favourite books for Valentine's. She's going to get Good Omens and Neverwhere", "Lol tbh if you are a scholar of marginalia or social history who wants to learn about how people use books it’s so so useful. I love when books have a whole list of names showing who they’ve belonged to over the years.", "If I had an award to give, I would. Thank you.", "Absolutely - I would never ever do something like that to someone else’s book. University books that aren’t rare may have the occasional note *in pencil*, that’s my limit.", "You could literally have used like a random piece of paper as a book mark. The book isn’t yours so you don’t get to dog ear it. YTA", "You can use ANYTHING for a bookmark. I would replace his book. I’m sure you meant no harm but I too am fanatical about my books!", "YTA    \nIt's not your book, don't dog-ear it and act surprised when he becomes angry. Ever heard of a bookmark? This is probably the last time he will lend you any books, and rightfully so.", "YTA. You can’t fold the pages of a book that is not yours! It does ruin the book and it’s disrespectful to the owner of the book.", "YTA. \nEspecially for the \"but jeez.\" Is it really that much of an inconvenience that you hurt your brothers feelings? Where is your empathy?", "YTA- buy a bookmark", "YTA- you ruined his book. How can you not see that?", "You fucked up. Respect people's property. This is why I don't loan books. People love to get chocolate on them, tear pages, dog-ear everything, and fuck the cover up.", "Yta. Dog ear a book. How dare you. Shame. Shame. shame. So glad I have a kindle.", "YTA - anything can become a bookmark. Use one like same people do.", "Not me looking at my two book shelves and getting concerned if any of my book pages are messed up more, I have a signed hardbook of the Harry Potter series with all the actors except jk and I keep. That in a locked box it is my most prized books. I", "I love to read and I often dog ear my own books. I've borrowed a lot from my family and friends, but NEVER would  it occur to me to fold, bend, or crease their books. Cmon. It should be common sense to treat other people's possessions with care and make sure you return them in good condition. YTA", "YTA: You never harm a book. My husband almost got dumped very early in my the relationship when I saw him dog ear a library book. I told him I'd give him a pass if he did it to one of mine, but a book that is going to be read by a ton of people, you got to respect them so they can be used forever (I think it was something along the lines of \"do you know how many arseholes are going to read this? Don't be one of the arseholes). He's now so careful with books and winces if I'm a bit rough with one. \n\nThe school librarian was my safety net in a tiny high school. Don't think she liked me that much, but she knew I was badly bullied, and wouldn't rat me out when I was skipping class so I heard a lot of muttering about how animals would treat books better and always strived to not hurt them.", "Yta ughhhh I hate when people do this.", "I dog ear books. Crack spines. Highlight. But not the ones I collect. The ones I collect are pretty special to me. Most money I ever paid for a book was close to $200. I HATE to let people borrow my collection books. They always either return them damaged or just fail to return them at all. When people ask to borrow one, I usually just say no. The books I don’t intend to keep I will recycle, donate, or give away. People who “borrow” anything should always strive to return that thing in the same condition it was given to them. Also, people who constantly read tend to be picky about that sort of thing. Your brother should have warned you about how he feels on such things. Still…..YTA", "YTA. Folding the page of a book creates a crease that is impossible to get rid of completely. If you want to make changes to something, buy your own. Don't make permanent changes to another person's belongings without their consent.", "YTA\n\nYou owe him a new book.  \n\np.s. I bet you you're one of those philistines that crack the spine too!", "op=YTA HUGELY\n\nYou don't bend pages of books.  Unless they are your own(and that's still being a bad owner).  It's like letting your pet get mats in their fur.\n\nIt is so easy to just tuck a piece of paper in as a book mark, a piece of thin fabric, an ACTUAL BOOK MARK.\n\nWould you loan out a bicycle and be fine with the person returning it with huge scratches and a flat tire?\n\nWould you loan out your Ipad and be okay with it coming back with a scratched up screen?\n\nWhy would you think it okay to damage someone else's property when they were kind enough to loan it to you?\n\nAPOLOGIZE to your brother, but don't expect him to ever trust you again with books he's been collecting for 11 yrs.\n\nEDIT TO ADD: If you want to read current books, update your library card and get ebooks online--you can't BEND their pages.", "YTA. First rule of using a book, especially someone else's, you NEVER EVER fold the page over. You use any flat piece of paper as a bookmark if you don't have one. A receipt, a piece of notebook paper, a photo, a list, etc. My kids were taught that as littles.", "Ok, technically YTA, that said I do feel like your brother could have at least tried explained to you why he was so upset about it and made it clear it was forbidden with his collectible books.   But then again, you probably had, or should have had, at least a vague idea that he cares a lot about the condition of his books since he collects them. Is this really the first time you've ever seen him obsessing over the condition of his books?", "YTA. It’s his property, you don’t get to choose how to treat it and expect him to fall in line. That was inconsiderate and it’s a little surprising you don’t see that. Buy him a new copy, apologize, and probably don’t borrow books from other people from now on.", "As a book lover/collector myself, here's a tip: return things the same way, if not better condition, than you received them. \n\nUse a bookmark next time. YTA.", "YTA for ruining his book. How hard is it to use a shitty peice of paper or something as a bookmark?", "YTA. You only can do that in your own books. At least should have ask beforehand", "Look, YTA, but by your post I'm thinking you didn't mean any harm. It was just a force of habit. Just be more thoughtful in the future. It seems like your brother really treasures his books and we all have things we want cared for in a certain way. Hopefully you can both move past this. Go back and tell him you thought about and you are really sorry that you didn't consider how he might feel about that and you certainly would never do it again if he trusted you to borrow one of his books again. You invalidated him a bit and he should know that was not your intention.", "YTA  Any piece of paper can be a makeshift bookmark.  Damage your own things, not his.", "Good to see an aita post about reading.\n\nIf your brother is a collector and treasures his books, definitely dog earing it amounts to misuse.\n\nThere are bookmarks, you know. Plus even if you've always done it, you simply don't do it with other people's books. Not done.\nYTA", "YTA. Don't dog ear other people's books. It's heretical to bibliophiles 🔥🔥🔥", "YTA, use a damn bookmark you heathen", "YTA! I fold the pages of my own books, but never any borrowed either from a friend, family or library. The general social contract when borrowing something, is that you should always return it in the same or better condition.", "This is a tough one, but YTA but your brother is the bigger asshole, he let you borrow his books, you should have been more thoughtful, but if you have an ignorance to the value of those books it is acceptable, if he had calmly said \"please don't do that\" and you said \"ok\" that would have been fine, if he told you not to do it, and you did it anyway than he would've been in the right. But if you are giving someone your valuables it's your responsibility to make sure they treat it correctly. Yes I realize he values his collection but I was raised with people who yell and scream constantly, and I've learned that people who think they can verbally abuse people for anything they care about are the most immature fuckers in the world. If your brother is like that just don't deal with him.", "YTA. You don’t do this to someone else’s property, I’m surprised it needs to be explained to you. Just because you don’t mind a messy car doesn’t mean you can borrow his and spill coffee all over it (intentionally even). Do this to your own books, not someone else’s, or even a libraries. It’s just disrespectful.", "Hmm, I feel like some are being a little to generalist in their dis-avowing of dog earing. It's only bad with collectors and expensive books for display imo. \n\nIn my family books get handed around all the time, no one really expects them back, we are just happy to read the same book, and they all get dog eared.  There are certain nice collectors edition books that sit around for show but not really read. We get cheaper versions for that and pretty sure my family has gone through like 3 or 4 iterations of the wheel of time paperbacks over the last 2 generations. \n\nEven at my grandfathers house just this week I was looking through his ancient library filled with near or over 100 year old books. One I was reading published in March, 1917, had underlining in the first few pages that looked like it came from a ballpoint pen, and a few creased corners from dog earing lol. \n\nAn Aunt casually suggested I take it with me to read but I declined since I feared it was too delicate and would be damaged. Things feel more like history pieces rather than things to be taken around in a bag to be read.", "YTA for not asking to borrow and then damaging his personal property. I totally get why you think dog-earing isn’t a big deal (I do it!) but you really only have the right to do that with your own books. You should offer to replace and buy yourself a bookmark.", "NTA- it’s a dog eared page. Let’s keep things in perspective.", "YTA, albeit a very small AH-- please learn from this newbie mistake and don't let it translate to books you borrow from a library. It's the WORST when I go to read a book and it's warped. It drives me nuts.", "YTA. It’s one thing to do that to YOUR OWN BOOKS, it’s a completely different story when you’re talking about doing it to SOMEONE ELSE’S books. I mean the fact that you opened a book he’d ALREADY READ and THERE WEREN’T ANY BENT CORNERS it should’ve occurred to you that he doesn’t want his pages messed up like that. He’s been collecting his books for a decade and you just started reading more, you didn’t think maybe he actually likes keeping them pristine??? I mean just Pat a tiny bit of attention and maybe don’t damage other people’s belongings. How hard is it to get a scrap piece of paper or jot down a note/take a picture on your phone? I’d have reacted the same way. You just don’t fold other people’s pages 🤦🏻‍♀️", "NTA - No offense to everyone here but yall (including her brother) are too sensitive 😂", "NTA. If you didn’t know any better, you should get a pass on the first time it’s OK for your brother to be upset, but he shouldn’t have started screaming at you like that.", "ESH. You borrowed his stuff and damaged it. You shouldn’t damage other people’s stuff just because you don’t think the damage is a big deal. He screamed at you and then screamed at you some more for dog-earring a book. Unless he has either already had this conversation with you and you continued doing it or the book was an expensive first edition, his reaction is totally unreasonable. You shouldn’t have done it in the first place, and he easily could’ve just said “hey please don’t do that”.", "Not judging you , but I too prefer that you do not fold the page to book mark it. I do not do it. I expect others to not do it , when they borrow my books.", "\nNTA as someone who reads a lot and collects books. If a sibling folded down a corner of the page I would just ask them not to do it again. It really isn’t this huge deal everyone is making it out to be. The way he reacted is not appropriate unless it’s something you do often and that he has already asked you not to do. You would the AH if you continued after being asked not to.", "NTA. If you didn’t know any better, you should get a pass on the first time it’s OK for your brother to be upset, but he shouldn’t have started screaming at you like that.", "NTA. Some of these responses are completely ridiculous and over the top. Only on reddit would you get called barbaric for folding a book page. \n\nYou shouldn’t have folded it over but I don’t think you’re at fault for for not knowing. It’s not like you did it maliciously. Mistakes happen. Definitely apologise and ask if he would like a new one though, as it’s still his book and he views it as damaged by you.", "And a bookmark while you’re at it.", "I’m hell on books. I buy the rattiest used copy I can so I don’t feel badly about the wear and tear I’m going to cause and I *still* don’t dog-ear pages.", "I too dog-ear my books but they're *my books*.\n\nTreating other people's property with respect is something one should learn in grade school. \n\nSorry bud but.... YTA.", "I had a former childhood neighbor friend borrow a then favorite book of mine as a teen.  A few weeks after loaning it out, I see him again and asked how he liked it.  He admitted to spilling ramen broth all over it. Livid was an understatement.  Id read that book cover to cover multiple times and it was a fascinating read and he'd destroyed it. \n\nHe offered to buy me a new one and i took him up on it.  I never saw the new one,  but 3 years later he dropped the damaged one on my porch as he moved out.  Still highly damaged. Yellowed,  crinkled where it didn't dry properly on all the pages.  It's like he didn't even attempt to clean it up when it happened and had dropped it in the bowl to soak instead.   Stupidly enough i kept it,  because i still loved the book and we didn't have amazon as an option quite yet.  Still mad nearly 13 years later. I haven't touched it since.", "Don’t just buy him a new copy. He’s a collector, and they’re probably a very nice version of each book. Get the same exact copy that he has since you did ruin his book. YTA", "I fall asleep with my books and wake up with the trade paperbacks bent and crumpled under me.  I do try to treat my hardcovers better though.  I would NEVER do that to someone else's books.  It's barbaric.  It's BEASTLY.\n\nBEASTLY, I say!\n\nYTA.", "I always write quotes from the book in the front and rear cover that I found striking.", "Like holy fuck, find a bookmark. I’m very fastidious about maintaining my books’ conditions, especially since several of them are signed. I’d probably lose my marbles too if someone mistreated one of my precious books like this.", "Or just take a picture of the page you’re on. You almost always have a phone within reach these days.", "Like really. Pretty much anything that won't damage the book is a book mark. Clean wrappers, tickets, gift cards, other books, scraps of paper, bills, envelopes. Anything. I have even used a really real bookmark once or twice.", "If it’s not your book then follow their rules! My younger sister used to lend me a bookmark along with each book to make sure I was equipped (not necessary but it is a kind gesture).", "I normally just remember approximately where I left off and shuffle through the pages until I get there.", "This is the complete problem and why OP is TA. If he’s not much of a reader then he is probably not well versed in book etiquette. Which is totally fine if he were to use this situation as a learning experience and do better in the future. Instead he thinks it’s the brother’s problem which it isn’t. If you borrow an item, you return it EXACTLY as you received it.", "Dog eared lmao that’s a new one for me", "I was reading earlier today on the couch with my cat, had to grab a drink, and used her tail as a bookmark because my lovely floral bookmark was temporarily eaten by the couch.\n\nDidn't phase her.  She just kept snoozing.", "I thought the same thing lol", "I don't dog-ear, but holy crap I love my paperbacks carnally.  The hard covers get all my courtly lovin'.\n\nReference:  Ex Libris by Anne Fadiman", "He didn't need to say it for OP to realise that is common courtesy to not destroy other people's possessions. But is pretty clear that OP doesn't respect either their brother nor his hobbies, and that's why their first reaction was to mock him, same as they did in the post.", "There are some excellent page marker stickies for note taking. My teacher friend uses them for signatures, but they are amazing for marking the start of a passage. BIC makes an amazing set of highlighters, but they might bleed; Mr. Pen does a good set for bibles that shouldn't bleed (super thin pages) but might be a bit light.\n\nOk, I'm done being off topic. My teacher friend was obsessed with pens and highlighters, so I picked up a lot from her and her organization habits.", "Wow, just wow.  You are kicking the puppy of fate on this sub.  Just a bear you don’t want to poke man.  I’m going to guess you get at least 20 angry replies before all is said and done off this comment.  You don’t mess with Redditt and their books man.", "That’s amazing! I love that the way your family has engaged with the books over the generations has given them history and character that you can feel connected to. I do agree that most families are a little less particular about personal books, so if it wasn’t a proper “fancy” collection it’s not as big a deal", "My mom was a librarian and I am an avid reader (book a day.) folding pages is disgusting and irresponsible. Period.", "I worked in a bookstore, at my first job you wouldn’t be surprised how many people tried to return books after they read them, and there were so many dogeared pages not to mention what it does to the spines when you open up too much. No folding down the pages.", "Hes a collector of books, but the brother is 18. I kind of doubt this is and expensive first edition of an older book. Obviously repurchase the same book/edition, but I'm guessing this is a simple amazon repurchase", ">there’s nothing morally wrong with dog-earing books in general \n\nI do believe there's something morally wrong with dog-earing a book or tearing pages out of one. But I also know that it's not my place to impose my morality on others. \n\nExcept, maybe, about books ;)", "i like leaving commentary in the margins of my own books so when I re-read them I get to ride along with past me's thoughts.\n\n\nalso when I lend my books to friends they often send me pictures of passages and my reactions with their thoughts (sometimes agreeing, sometimes disagreeing, sometimes making fun of me) and that always makes me feel nice knowing they're thinking of me", "I bend the fuck out of my own books, but if I borrow a copy from someone you enter believe that ho is half open and has a bookmark in it", "I lent a paperback to someone once. She tucked the cover and pages so far back, they touched the back cover. It wouldn't close after she had it, it was permanently curled. I was furious.", "A friend loaned me the first book in a series that she had. They were really nice special editions that had never been opened before and the cover and spine were so unbendable that I was terrified the entire time I was reading it that I was going to open it up too much and break the spine. I had to angle the book just so so that I could see the words towards the inside of the pages. It was so stressful that I didn't even try to ask to borrow the other books in the series. But guess what? That one book went back to her in perfect condition with no damage whatsoever from my reading! Was it maybe more effort to go to on my part than my friend would have expected? Probably. She probably wouldn't have been upset if it was a little more worn when I gave it back. But I wasn't about to mistreat it!", "I actually had my Harry Potter #4 tear completely in half along the spine from people breaking it.", "but not too thick!", "Depending on the book, post-its will remove print and possibly rip the page when you remove them.", "Once when I was reading at the couch i had to stand up and legit used the tv remote as a bookmark.", "This is kind of an insult to 14 year olds... if they are taught basic manners, they know", "21 and can’t understand why he “ruined” a book, ugh", "Even I knew as like a 12-year-old not to dogear books I knew as a six year old not to fold the pages in books. It’s a little bit more understandable if they weren’t taught book etiquette, but their brother clearly loves books like come on.", "Oh, I have so many great memories of my elementary school librarian.  My class went once a week, and she taught us the proper care and feeding of books.", "I let a friend of mine in high school borrow a book and she returned it stained with Cheetos. She said it shouldn’t matter and that it was “just a book”. I told our mutual friends what happened so they would know before lending their books since I was the first she borrowed from. She was so angry that she never spoke to me again. I heard several years later she did the same thing to another university student’s engineering textbook.", "I'm pretty sure this should be a war crime.", "\"willingly damaging\" dog earing is normal. You act like og earing is like bombing a hospital bruh", "I loaned a book to a friend one time and a few days later I saw him reading it with the spine cracked in *four* different places. Like, that many cracks had to be intentional, right? I was furious. But being the nonconfrontational person that I am I didn't say anything then or when they gave the book back and just bought myself a new copy. (It wasn't a rare or expensive book, thankfully.) But that was also the last time I loaned a book to anyone except the people I know take care of their books like I do.", "Agggh can you help me dear librarian?\n\nI was taught to \"pre-crack\" the spine of textbooks to avoid those large lengthy cracks. I was told it loosens the glue all over evenly to prevent it from cracking in one spot and losing pages in that spot.\n\nHave I been a fool to some shit advice? I did notice I got less large cracks up the spine when I started doing it. And I imagine since textbooks are open to a page longer than reading books it might be different?", "You're lucky you can go to the library and *borrow* books.  Once a book crosses the threshold of my home, it is mine . . . .  It is now a part of my book hoard.  **Forever.**\n\nYeah, I can't go to libraries anymore.  \\*wistful sigh\\*", "My ex-friend in college used my The Count of Monte Cristo as a coaster.  One of the best books ever.  I could have bludgeoned her with it.", "I once lent someone a book in perfect condition. As a lender, I have reasonable expectations that the book might get a bit worn in the process. But this book came back like it went through the wringer—broken spine, water damage, dog ears, etc. Surely there should be a minimum sense of responsibility and care when using someone’s belongings? \n\nAnyway, I stared at the book briefly and diplomatically said that I had a second copy; they could keep that one.", "Nerd.", "I’ve used boarding passes as bookmarks before.", "OP could have also made a note on her phone to remind her which page she's on if there weren't any nearby papers lying around to be used as a bookmark. There were a whole lot of other alternatives she could have used to bookmark her page, no need at all for the dog-earing. YTA OP.", "I’ve had countless receipts and gum wrappers over the years that have been used through many books before finally being discarded.", "Oh 100% I used yugioh cards as a kid cos the librarian yelled at me for dogearing library books LOL", "You don’t just borrow someone’s stuff, especially a paper product, and just start folding it? Folding it causes creasing, creasing weakens the paper.", "Of all the things I'm going to hell for, breaking the spines of my own books so that I can enjoy them more comfortably is by far the dumbest.", "I have teeth marks from my niece. One of my most treasured books. I'd never lend it out.", "God that would have been great for me to give as a Christmas gift to my SIL. \n\nAhh Reddit a cruel mistress of what could have been", "This is the way.", "Y'know, people can cherish books without being obnoxiously anal about it. Loving a book is about the experience and connection you have while reading it. Just because a book doesn't come out of that experience in pristine condition doesn't mean it's not cherished. \n\nMy mom, for example, almost exclusively reads in the bath. All of her books are waterlogged to shit but to her that's just evidence of how much they've been cherished. I've cracked the spine of every book I've ever owned and honestly there's nothing I have that fills me with more nostalgia and affection than my copy of Catch-22 that's literally held together with masking tape. It's been with me through some real shit in the decade since I bought it and by god does it fucking look it. Its resell value is absolutely zero but it's priceless to me.\n\nTl;dr: get over yourself and let people read however they damn well please.\n\nETA: For the love of god, stop telling me people shouldn't do this to borrowed books. I am well aware. That goes without saying. This comment isn't directly related to OP, it's literally just about how people personally treat their private personal property. Stfu already.", "When I was little, my sister used to randomly tell me to remember a number, and then ask me the number a few hours/day later. It took me an embarrassingly long time to realize she was using me as her bookmark. Thankfully, she also taught me how to take care of my own books (over a thousand now—I’m a low-key book hoarder), and how to remember what page I’m on when I don’t have a mark handy.", "Receipts for the book are my go too book mark as well", "I've used gift tags, receipts and sometimes even old perfume samplers.", "Glad I’m not the only one", "Ooooh scaaary folded paper ooooooh", "I like my marginalia frozen with salt on the rim.", "If Fermat's marginalia wasn't so fucken banal they would've solved his last theorem much earlier.", "I found a really beautiful hardback edition of a book that had apparently been on a high school lit reading list in a secondhand shop. Opened it and absolutely covered in enormous messy notes, highlighter marks and dogeared pages messily folded back again. So sad :(", "There's a difference between reading something so much that it no longer holds together as well as new (for paperbacks, at the least) and abusing a book after reading it once. I have books that I've read a hundred times that look better than my MiL's books after one time, and that's saying something since the paperback covers on those books are about to fall off.", "Treat my books amazingly Well. Don't care how you treat your own fuckin books", ">she was using me as her bookmark.\n\nThat's hilarious.", "That's a lot of trust to put into someone else's memory. Is the method she taught you of remembering the page the same one she used?", "that's hilarious. I was just coming in here to say \"or remember the page number\" lol that was something I could easily do before having kids.", "Good grief that's funny and smart of your sister 😂 I remember being in third grade and seeing a girl in my class use pencil to circle the page number of a book she was on, and I was absolutely appalled.  Not just that she'd do it to a library book, but a book in general!  Little third grade me, clutching at my pearls 🤣🤣", "I have had books with inscriptions to unknown people. It’s really cool. But I am buying those books that way. People aren’t putting things in after I buy them. That’s the difference.. OP, YTA.", "That's tragic. I don't think I started writing notes in any of my books until they were already er, showing their age. \n\nI remember one of them the cover had started to fall of first! lol. I loved that book and am rather sad it started falling apart because it was so unique to me. It was an old hardcover. A pink fabric texture rather than paper Leather. With no title on the front, just a gold embossed picture of puppies and One-Hundred And One Damnations on the spine. I've never seen another like it.", "And I have books I've read at least a hundred times that are dog eared and messy, the pages might be crumpled. They're absolutely not in pristine condition, but they are still cherished possessions. \n\nI certainly wouldn't treat somebody else's books the way I treat my own, but judging people for how they treat their own books isn't necessary.", "Okay. Cool. Not everyone's goal when reading is to keep their book looking as pretty as possible. It's chill if you want all your books to look like they've been hermetically sealed since printing but it's also fine if I like to go full Bane on my books' spines, my mom wants to waterboard hers to death, and your MIL thinks it's fun to rip their faces off. All three are equally valid ways of enjoying one's personal property. As long as she doesn't maul one of yours then the only problem I see here is your weird, misplaced sense of superiority.", "K.", "I've dug through piles of books in flea markets, antique shops, etc looking for inscriptions. I like the little window into the previous owner's life. My favorite I own is a copy of The Odyssey a Katherine won in a 1906 spelling bee.", "You don't cherish a book if you destroy it after reading it once. You might cherish the *story* but you don't cherish the format that story is in. I never said anything about keeping the books looking as pretty as possible, but you might want to take some of your own advice. People are allowed to care for the medium of the story just as much as the story itself.\n\nAnd she did maul one of mine, that's how I found out.", "For an alleged cherisher of books, your reading comprehension is absolute shit", "YTA \n\nFirst and foremost, that isn't your book. Be respectful. I'm betting you'd feel the same way if the tables were turned and it was something of yours. \n\n2nd, and it's just my preference: don't EVER do that to a book. UNLESS, it's a manual or a textbook and one you are never getting rid of. \n\n3rd, If you really didn't know that was a big yikes, be honest and tell your bro that. It was a mistake and now you know not to do it again. \n\nOverall, try to be more aware that just because it doesn't seem a big deal to you, it doesn't mean it isn't to someone else.", "YTA. You never ever dog ear someone else's book. Not okay. Keep it in the same condition as when you borrowed it, or you owe them a replacement. It's not like you didn't know his books were important to him.", "YTA, its ok to do that on your books but not on borrowed ones", "If only they made something that could mark your page in a book and thus save the book from dama-\n\nWait…\n\nYTA. Not your property and part of a COLLECTION. Apologize, buy a replacement, and never treat his property (or anyone else’s) like that again.\n\nOh, and get a bookmark!", "YTA. Books should always be treated with respect, even if It was yours. But It is your brothers book, who also collects them. You should be ashamed of yourself. Apologize and buy him a new copy.\n\nY\nT\nA", "If someone dog-ears my book, they are dead to me. YTA.", "My mom was a big reader and so am I. She would tell me as a kid to NEVER dog ear books unless they were mine so book marks are awesome  and come in many different designs. \nMy sister borrowed a first edition that was autographed and dog eared it. It cost me $700.00 off the value. So yes YTA but someone should have told you not to damage stuff that isn't yours.", "YTA - I actually read this earlier and was so upset for your brother I had to put this down and come back. I would rather purchase the book for someone then lend out one of my special books. I have had books returned damaged (bending the corners counts) and in some cases not returned at all with the excuse, I didn’t realize you wanted it back. Apparently “lend” means something different in their world. Sincerely Apologize to your brother with the replacement for the book you damaged in hand. Don’t ruin your relationship by your disregard of his feelings and property.", "YTA. If you brother borrows your favorite shirt, but decides to alter it in a way that can’t be fixed and made it so you can’t enjoy it the same, how would you feel? Same rule applies.", "YTA.\n\n\nYou are damaging the book.  It IS a big deal.  Use a bookmark and don't be an asshole.", "You damaged the book by folding it aka dog ear folding to keep your page. This ruins the value of both the singularity book and the entire collection. \n\nYTA but it’s because of your lack of knowledge on respecting books. \n\nFolding the pages or creasing them cases the paper to weaken or tear as well as making them seem thicker once could say. And these creases over time deteriorate the paper and looking at the closed book it will appear damaged. The same goes for opening a book too wide or other things such as handling the book with greasy or dirty fingers. \n\nCollectors like their books pristine and well kept so they can last longer. Also possible resale value is a big factor. And I’d definitely recommend buying a new copy for them, preferably the same cover art, title, font, and if it was a hardback then get a hardback copy because that’s important to collectors as well. \n\nAlso I would refrain from asking to borrow a book again and they may have trust issues with you for a while.", "You’re not only YTA, you’re a monster", "You dog-eared someone else’s book?! That’ll earn you a lifetime borrowing ban from me. YTA.", "And this is why I don't lend books.", "Yta.  You can do whatever you want to your own books, but don’t do things that harm other people’s books.  When I lend books to people, I make it clear they are not to fold the pages, write in the pages or bend them backwards.  All of that makes them fall apart way quicker.", "YTA. It's not your book so in no way is it okay to damage it. The fact that you keep putting ruining in quotes makes you an even bigger asshole, you are not \"ruining\" the book, you are ruining the book. I'm assuming since he was so upset he doesn't mark his pages like that which should have been the first clue that you shouldn't have done that. What makes you the biggest asshole of all is \" I get that he likes his books but jeez \" so you borrowed his property, damaged it and then have the audacity to tell him he's overreacting? Get a clue and get some respect. I hope you buy him a new copy of the book and never ask him to borrow anything again, that's the least you could do after giving him an apology.", "YTA I can't imagine being 21 and not knowing to not fold pages of a book that don't belong to you. Elementary school libraries usually have that rule because folding the pages damages and lessens the lifespan of books. You knew those books were important to him, why purposely damage something you know is important to him?", "I haven't loaned a book out in 20 years.. The last time I did, the person brought back the book with all of the pages wavy and water-stained because they decided to read it in the bathtub and dropped it.\n\nI have some books that I bought as paperbacks over 30 years ago, and they're still in good condition because I use bookmarks (even if it's a scrap piece of paper instead of an actual bookmark!) and avoid breaking the spine.\n\nBuy your brother a replacement. YTA.", "It depends.\nAfter you realized he got angry because of how you treated his book, how did you approach him?\nSee, I get it. “It’s just a book” but it’s still HIS book. So of course he can forgive you for mistreating one of his books if he sees you realize you made a mistake, and are genuinely sorry, but if you approached him with the “it’s just a book”, or “why are you overreacting?” Attitude, then YTA.\n\nIf a friend of yours borrows your favorite shirt, and returns it with a small, but indeleble stain, her being actually sorry vs. minimizing the damage done to your shirt makes the difference between making a mistake, and being TA.\n\nIf he told you before and you still did it, then YTA.\n\nWe all have the right to value different objects as more or less important, and take care of them accordingly. If someone lends us an item that is high value for them, but low value for us, we treat them up to their standard, or we don’t borrow it.", "YTA. How about he folds your hats in half and puts a big crease in them.", "YTA if you want to highlight dog ear or do anything else to a book buy your own copy. You know it’s something he clearly cares about and can’t even respect him enough to stick a piece of paper or anything else to mark your page instead of damaging it. I absolutely love finding leftover bookmarks or notes etc in second hand books and will seek out books with a lot of wear and tear but your brother clearly doesnt", "Yta: bookmarks exist for a reason.", "YTA. It’s not your book therefore you return it in the same condition you borrowed it. Aka don’t write in it, don’t fold pages, don’t let it get wet or food on it.", "NTA. Don't kowtow to autistic behavior.", "YTA. When I was 12 someone took my book from me and started to dog-ear it to keep my spot and I have never been as close to throwing hands as I was that day. I settled for yelping and grabbing the book back. Don’t screw up peoples books like that", "Even with my own books I just put something- anything- in as a bookmark. Receipt from the grocery? Sure.", "Also, please don’t lick your finger to gather a page to turn it.", "Op your YTA \n\nAlso, I tend to be the first one to read all the new anime and dairy of a wimpy kid books at the library. I’ve gently crack the spin of each of those books with a method not to cause creases in them before I even start to read. Most of the books there are broken due to people not knowing to to properly crack the spin of the book.", "Same, I do it too, but I'd never do it with a book I borrowed.\n\nYTA", "Exactly this. I dog-ear my books. Spines are regularly broken. They're my books.\n\nI'm very careful with borrowed books, even library books that have been dog-eared before.\n\nYTA for not taking care of someone else's book, OP.", "Yup I had a friend do that to a book I let him borrow.  I never let him borrow another book again to this day.", "There used to be a woman in my bookclub who would take borrowed books into the bathtub with her!  Or to the beach!\n\nWe learned pretty quickly to never loan a book to her.", "Where did you get that he took it without permission? OP clearly says permission was asked and granted as long as the book was returned.", "Even if what you said was true. Why is your verdict N T A? It should be N A H", "Me too. Unless they’re special editions/expensive etc, I will happily dog-ear my own books, crack the spines… I would NEVER do that to someone else’s book or a library book. It’s just not ok.", "May i ask what you consider \"bookmarking\"? To me a bookmark is a piece of paper or thin cardboard you place in the book to keep your place in it.", "I think it's totally possible the brother doesn't have a collection of those. I own a ton of books, but often don't actually use formal bookmarks", "Eh I've dog eared library books before, those books are meant to be reader copies. I do have my reader copy vs display copies for my own shelves though.", "I used to fly a lot for work back before e-books.  20+ years later I'll still find the occasional boarding pass bookmark when rereading something.", "Yep, you don't *damage* the book, you could even put a bit of tissue in there to mark your place if you don't have spare paper. I even use my glasses earpiece at times.", "A tissue would do in a pinch. A receipt. As long as it is stuck in the closed book, sticks out and doesn’t damage the book it’s fine.", "Same. I have only 1 bookmark. I've used old folded lollipop wrappers before. Once I even used an old game guide. I haven't dog eared a book since 2nd grade. I only underline books if they're for school projects and I will never read them again. The rest of my books I keep in the condition I got them. I always buy used, but I do not like messing them up anyways.", "Nice try, shill. Don't you know promotion is prohibited?", "I do love a well loved classic paperback.  It reminds me of borrowing my required reading books in high school.  \n\nMy little ratty paperback of Jane Eyre that my mother bought me 32 years ago would be something I would save in a fire.", "Fellow lover of used and abused books here. There's something so... extra.... in character when a book has clearly been well loved and frequently read. Reminds me of the velveteen rabbit. Like, those are the books that become Real.", "I love this shit so hard. Give me hand written margin notes. Give me commentary. Give me someone who interacted with the book. It says so much more than just the book.", "I have a first printing of *In Cold Blood,* and before I understood what I had, I let my husband...\n\n...take it to war in Kosovo.\n\nHe wrapped it in plastic, so the dust jacket damage was minimal.  \n\nI feel stupid writing this, but commit the crime, do the time, you know?\n\nAnyway, now that I have collected other books like it, I only let someone touch them if I am present.", "The Gutenberg Bibles are almost 700 years old, there are ways.", "I lent my dad my copy of American Gods and he left it in Paris for someone else to read.  It was a signed copy with my name in it.  I was so sick when he came to central Illinois on his tour...but I went to his reading anyway! I am still angry about that.  Hug your Gran!!", "And literally anything could be a book mark.  Just a piece of recycle paper can do the trick.", "My mom has done this with any book of mine that I have lent her. I no longer loan her books.", "My MIL broke the spine of a book I lent her in several places. Never again.", "As do losing lottery tickets. It makes them not a complete waste of money, they're a 1 dollar bookmarks.", "I did this with the library receipt I’d get from the library up until I got metal bookmarks from Amazon.", "In the tenth grade, I needed a bookmark for my math textbook and grabbed the closest thing - the bottom half of a Barbie bikini. Forgot about it till it fell out in class the next day", "Same, because I used to sit on the toilet for hours reading with the door locked so I could avoid my noisy family.", "I once used another book as a bookmark. I have absolutely no idea why I did that since they were the same size, but", "I've used my cup of tea in a desperate movs", "The way you phrased it originally made it seem like both dogearing and bookmarking are bad, but dogearing is worse, which is why they asked what you consider \"bookmarking\"", "Sure. But don’t do that shit to someone else’s books.", "I think what your missing is it’s not her book. I agree you want to crack the spine or waterlog your own book, great, but if it’s not your book it should be returned in the condition you receive it. The get over yourself works both ways…he’s allowed to not want his book pages folded.", "I have a fairly old copy that belonged to my great aunt and I love it! I don’t read it much because of age mostly and wear but might have squealed when I found it in her things.", "Sometimes I write things like \"you know what you did and I'll never forgive you for it,\" or \"I'll never be able to look at gear again thanks to this\" without any context just to fuck with whoever goes through my book stash when I die.", "If your marginalia doesn’t have surprising combos, like people riding on the backs of snails, or animals with inexplicably prominent genitalia, I’m not interested!", "Back then paper wasn't acidic. It's only in the last 100-200 or so years that mass produced paper has the properties that make it deteriorate so fast.\n\nObviously there are other factors that need to be accounted for, but acidic wood-pulp paper is why modern material degrades so rapidly.", "“Art thou a witch, olé?” cracks my shit up every time, no matter how many times I read it.", "There was a guy who used a lottery ticket as a bookmark. The book was boring so he never went back to read it after popping it into a drawer. He came across the book while decluttering and decided to check the ticket out of curiosity, not really expecting much. Luckily, he had decided to declutter just before the one year deadline for claiming prizes. He had won the jackpot.", "My sorry. On re-reading I did phrase poorly, I was responding to a single post.", "There’s also a difference between how you treat your own books and how you treat someone else’s. Just like any other belongings. If I want to dye my white shirt blue there’s nothing wrong with that — but if I borrow your shirt and dye it a different colour I’d bloody well better be planning to buy you a new white shirt.\n\n\nETA:  OP, YTA", "My cookbooks are full of notes. Stains. Marks. Tears. But they are MY cookbooks. I know it is a good recipe by how dirty the page is.", "You gotta make use of your younger siblings somehow LOL", "I never did. Where did I say they had to be in pristine condition? Especially after having been read dozens to hundreds of times?", "I get being mad about your own books being damaged but you get no say in how she should treat her own books.", "They're her books; I don't care. It's called an example from personal experience. I don't let her borrow books from me anymore, I just buy her copies of her own.", "Yours is, actually, since the covers of the books falling off that I mentioned were *my* read-to-death paperbacks. Also, this all got started about someone dog-earing *another person's* books, not their own. Read your own books how you want, but don't read a borrowed book like it's yours unless you can afford to replace it.", "YTA. Apologize for your brother and ask if he wants to replace it. If you want to keep reading, any books borrowed from someone else or the library, and don't have a bookmark...even something as simple as a torn scrap of paper can become a bookmark. Or take a picture of the page you were on.", "YTA OH MY GOD IM MAD AND YOU HAVE 0% TO DO WITH ME IRL", "YTA. Books that belong to a book lovers are sacred. You’ve unintentionally ruined a piece of his collection. You cannot dog ear pages or crease spines. The books must look like they’ve never been read. Buy him a brand new book. The exact same size, cover, everything. Hope that ONE particular book didn’t have significant meaning to his collection. Then go apologize.", "YTA. You ruined a book that didn’t belong to you that he has intentionally kept in that condition. I would be livid. Buy him a new one.", "Before I lend a book to people I ask them if they dogear or use a bookmark. If they dogear I say no. Even if I borrow a book from someone who dogears I still use a bookmark because I know it weakens the book.\n\nIt wasn't your book to decide what was okay to do to it. Apologize and replace the book. YTA", "YTA. \nRespect other people’s stuff. Plain and simple.", "YTA\n\nDestruction of property is a crime.\n\nHow would you like it, if i asked to borrow your plates, and then cut them in half, because i only need half the space.", "If you’ve borrowed a book, no matter who from, never, ever crack the spine, bend the pages, underline in it or anything else that may be seen as defacing or damaging their books. It’s a pride of ownership thing and you broke that rule BIG! Please buy your brother a new copy of the same type (hardcover, softcover, trade, etc) that you damaged and in the future, use a bookmark. YTA", "YTA how dare you dog-ear someone else’s book.", "YTA \n\nDo what you want with your own stuff but it's embarrassing that you find \"don't damage or wreck things you've borrowed\" complicated.", "YTA JFC", "YTA. Just because it is your habit doesn’t make it his. Some people like to keep their books in good condition, folding the page like that ruins them. And please for the love of god don’t ever lay the book flat enough to crack the spine, he would write you off as a sibling. It takes five seconds to grab a bookmark. Use a piece of kleenex, a scrap bit of paper.", "YTA. I'm a casual book collector. I once lent a book to a family member and they had crossed out a mis-spelled word and re-written the correct spelling above it. For the life of me I still cannot fathom why you would do that to a borrowed book. Like the mis-spelling bothered them that much?? \n\nDon't modify borrowed books!!!", "Looks like you were accidentally inconsiderate, meaning you didn’t think about what you were doing and didn’t realize it would be upsetting to someone else. \n\nBut now you do know and hopefully this thrashing from Reddit will make you realize that 1) you owe your brother an apology, 2) you need to be more respectful of other people’s property and 3) you need to adjust your attitude.\n\nThe accidental inconsideration should have immediately resulted in an apology from you, but instead you don’t even seem to understand that you are 100% in the wrong. Geez indeed. YTA", "YTA. Buy him a new copy and bookmarks for yourself.", "People like you is why I don't let absolutely anybody to borrow my books. Ever. People like you doesn't respect other people's possessions and think that they can lose, break or do whatever with them, because you're all selfish entitled AH.\n\nHow would you like it if your brother took something of yours that you cared for and broke it? Would you like it?\n\nYes, YTA, and I hope your brother never again lends you anything, seeing as your answer is to mock him when you actively destroy something of his.", "YTA. A beloved book is like a dear friend, and to lend one to someone is a sign of trust and affection. Your brother trusted you with something he cared about, and you disrespected and damaged it, thus disrespecting him and thumbing your nose at his trust in you. Shame on you.\n\nI stopped lending out my books to friends or even family because they always returned them in deplorable condition, without exception. Every torn page and scratched cover was heartbreaking. The only hands that handle them are mine.", "I learned to not dog ear a page of a borrowed book in seventh grade. YTA", "“I’ve always done that with books” \n\nIs this your book to be doing it with? The answer is no. YTA", "It is a nasty habit. Only do it to books you own. They make book marks for a reason.", "It doesn’t matter how YOU treat your books, it’s not your book. It’s HIS book. He doesn’t want the pages folded, I’m an avid reader and the same way, I’d rather use a bookmark because I’m particular and like keeping my books in pristine condition (unless they’re second/third copies for reading and carrying around). \n\nIt doesn’t matter how you feel about it, it’s not yours. Apologize and get him a new copy. Then you can keep the old one. Now you know how to treat others books in the future. YTA", "YTA if he borrowed your car and returned it with a scratch you'd be upset", "Kiddo, YTA\n\nYou may dogear your own book pages, if that's how you roll. \nYou never ever leave marks or damage that can't be undone on borrowed books, whether officially borrowed from a library or informally borrowed from someone you know.\n\nBuy him a new copy, and promise never to disrespect his books again. Commit to never borrowing one unless thats a habit you can break.\n\n(If this were the norm, and permitted, bookmarks wouldn't be a thing, and they wouldn't hand them out in every bookstore and library. )", "YTA.\n\nAs a fellow bibliophile, I would never lend a book to you again. The only thing worse is when borrowers crack the spine to leave it face down.", "Some people collect first editions and folding down a corner of a page devalues it. But I am surprised when people do this. My entire first grade class learned how to handle books on our first visit to the library. Turning down pages was a big no.", "Two words: Nietzsche’s umbrella.\n\nThat said, OP, YTA.\n\nPlease take better care of other people’s books. \n\nBuy yourself some bookmarks (there’s almost no learning curve in how to use them).", "YTA. I... Ok I realize you arn't a reader so you are probably thinking oh this isn't a big deal BUT ITS A VERY BIG DEAL FOR A COLLECTOR. \n\nIf you fold the pages in your own book I might subtly judge you in my own head but that's fine cause it's your book and you can color it for all anyone cares. But you BORROWED A BOOK. THAT AINT YOURS FAM. Treat anything borrowed with the best respect and try to give it in the best possible condition...", "NTA but next time get clarification on what can be done with what you’re borrowing.\n\nBTW, is your brother ADHD?", "I’ve been called a monster by complete strangers in public for doing this to MY OWN books!", "some people dont want you to even bend the spine if thats even possible", "YTA. You do not own the book. Always be careful with books that you borrowed. \n\n\nI always buy from used bookstores so most of my books are worn and battered. But when I rarely buy new books from bookstores, I'm always mindful in reading them, not cracking spines and folding pages.", "Just like when you look at a new book at Barnes and Noble and don’t crack the spine, you certainly don’t dog ear pages. Especially someone else’s book! YTA.", "INFO: did you genuinely didn’t know not to do that to books? \n\nIf you didn’t know, the ideal situation would him just saying “please don’t do that it’s not good for the books” and then you’d be like “ok I won’t”", "YTA, what you're doing is ruining the books and you are in the wrong buy him a new copy.", "YTA\n\nI dogear my books and only my books. I think it's a silly thing to be upset about personally but their book isn't my shit to do whatever with.", "Is that your book? No.\n\nDo you treat it the way you treat your stuff? Also no.\n\nHow do you treat things that are not yours? Better than your own stuff, you give them back in the very exact conditions you've received the item.\n\nYTA\n\nJust because you don't care and don't get it it doesn't mean you can do whatever you want. Jeez.", "This is just poor etiquette in general, even if he wasn't a diligent collector. Use a scrap of paper, cut strips from plain birthday cards (No glitter!), or spend $3 and buy a bookmark. I've literally grabbed a clean tissue from a box of Kleenex to use as a bookmark. Show respect for others' belongings.\n\nYTA.", "YTA. I dogear all the time. But only on my own damn books", "Years ago there was a poster in my elementary school library that said something along the lines of \"a book is not a dog and should not have ears\"\n\nDon't dog-ear another person's book. It's rude as hell. Just like writing in them is damaging, so is bending the corner. It weakens the fold. If your brother really collects books, you owe him a new one and you can keep the one you damaged.\n\nHe's obviously very upset with what you did and you need to apologize ASAP.\n\nYTA.", "I gasped when i read your crime. YTA. And a barbarian. who does that! YTA", "Of course yta. Why would you damage other people's  things...", "Op...it's called a bookmark. Get any piece of paper, a ribbon, ect and use that instead. I like to buy the copies with the paper cover over the hardback and use that to mark my page. If I don't have that USE A BOOKMARK! \n\nYTA!", "This exactly. Do what you want to your own books, but don't dare do any of that stuff to MY books you borrow. I own every book by Stephen King and take the cover off so it doesn't accidentally get ruined by constantly opening the book to read at night. And other paperback books I have do not even look like they've ever been read.", "fr, a piece of toilet paper will do, there is zero excuse for destroying books", "And a replacement copy of the book to go with that apology.", "Exactly. OP is dismissing the reaction because to him it's just a book, but it doesn't matter. It's not your property, you don't get to decide how other people want their property handled.", "My dad done this to one of mine once (it was a 1st edition hardback) and I went mental but unlike OP he understood and immediately ordered me a replacement even if it cost 6x the original value as it was 1st edition. OP is YTA", "It is even easier than that. Everyone of her age should know that you return any borrowed item in the same state as it was before. Everyone should also know that if you fold a piece of paper it will never be as it was before. And everyone of her age should be able to connect these two things and then be able to treat borrowed books right. It‘s just decent behavior and basic thinking, it is not even needed to know about the specific preferences of booklovers. Just in case she wants to „explain“ her behavior like „oh, I couldn’t know my brother wouldn’t like that!“. Yes, you could, remember decent behavior and basic thinking.", "> Get ready for the book lovers to descend on you\n\nNo worries we are gathering the barrel of tar, and feather.", "Especially since it’s not his property.", "He probably assumed OP was not raised by wolves, seeing as they had the same parents. But I dunno. OP seems to be feral and unfamiliar with actives such as borrowing books.", "> Think of it as someone borrowing a dvd or computer game and returning it with fingerprints on the disc.\n\nNot fingerprints, scratches.", "It’s more like returning a car after deliberately denting it and asking what’s the big deal.", "Elementary school kids know better.", "OP is definitely old enough to know better.", "Kindergarteners are taught not to bend corners on borrowed books. I have seen them able to follow this instruction. OP is supposedly an adult.", ">\tand promise to only use bookmarks with his books in the future. \n\nHonestly, I strongly doubt that their brother will lend them a book, or anything other cherished by him, ever again. \n\nOP clearly showed that they can’t be trusted with borrowed things in generell.\n\nEdit: OP YTA and I completely get your brothers reaction. I would react the same if someone dog-ears my books.", "There's a publisher in my country that was infamously known for the shitty quality of the paperbacks. Cracking the spine  or bending the covers back was a 100% guarantee way of losing a whole chunk of pages.\n\nI've now moved to ebooks as I'm blind as a mole and I can up the character size to ridiculous levels but I would have been so mad.", "I don't work in a library. But, I know this is wrong. OP YTA you need to buy him anew book for his collection. And if he ever loans you a book again, use a bookmarker.", "Can confirm as an origami enthusiast paper weakens when folded 😭", "I let someone borrow a manga volume once.\n\nIt came back dog-eared.\n\nA comic book!\n\nManga volumes have thicker pages than regular novels too!\n\nIt happened 17 years ago, I don't even have the book anymore, but it still grinds my gears.", "Omg not the spine breaker😭, I buy a whole new book if mines break or fold too much", "Honestly I don't really like borrowing books from people for this exact reason.", "Sorry if sounds like a stupid question but what advantages does cracking the spine have?", "Don’t put post its in there. The glue transfers to the pages. Just use normal paper", "I own bookmarks galore. I still regularly use random things like candy wrappers (of individually wrapped packs, like starbursts), receipts (often of the book I'm reading), or like my most recent option - a \"genuine leather\" tag from a purse (because it was on the counter when I needed to put the book down).\n\nAnything can become a bookmark so long as it doesn't disintegrate or leave a residue everywhere.", "My 6yo knows not to fold pages! If she can get off her ass and find a scrap of paper or piece of string to use as a bookmark then OP definitely should be able to.", "Did OP never visit a library growing up? Every kid learns from librarians how you should treat borrowed books.", "Little nitpick, OP is a woman. The rest you are correct on.", "There is something about really making a book your own that, while I don't like to do, I *get*. Like writing notes down in the margins, highlighting passages that really stick out to you, etc. Especially if you like to revisit the same book over the years, they can bring you back to your mindset when you first read it, or help you see something in a different way.\n\nBut only in your own books. Don't do any of that shit in someone else's book.", "Tearing the pages?? That’s freaking chaotic evil right there.", "Would this not just crease the spine faster? Usually I just don't flatten my new books all the way.", "I lent a book to someone in middle school and they left it in an outdoor locker in Florida for a month. That’s how I learned humidity makes the pages all wavy lol", "Tape, staples, paperclips……and rubber bands.", "<<*they had folded it like a newspaper.*\\>>\n\nWhimper! Whimper!", "This is the worst! I still haven’t forgiven my 7th grade friend for the way she returned my pristine copy of Interview with the Vampire. It looked like she put it through the wash.", "I try not to break the spine as I know it’s important for longevity but you can definitely tell which books I’ve read many many times (and enjoy) because the spine is really broken in. I do need to think about replacing a few.", "Yes! It’s where I get all my books.", "I've gone through 5 copies of that book due to gifting them, spilling coffee on one, and dropping one in the tub because I couldn't stop reading it long enough to take a bath. One of the best books ever.", "I agree! When you borrow something it's your responsibility to return it in exactly the same shape as you received it. That rule goes for any borrowed item, not just books.  I'm probably not as fussy with my books as some but even I don't want my books returned in worse shape when I lent them out.  Some people haul their collection of books from place to place until they reach 55 and say \"To hell with that, my back is breaking\".  I'm joking of course but sorry YTA and you need to buy your brother a new copy of the book and a cookie or fudge brownie as an apology.  Warning:  do not put the book and the brownie in the same bag!!", "What a great idea!!", "A college roommate of mine did that to one of my volumes of Lord of the Rings and after she read the first one, she put it back on my shelf and then went and bought her own set. I took her new volume and switched it with the one of mine she had trashed. (She kept hers in great condition). We kept swiping the good one back from each other - never talked about it - I finally went and bought another set. This was way before the movies (except one very weird animated movie). She was a very close friend so it was more of a joke than a serious grievance but I seriously could not bring myself to read that book that was so unnecessarily damaged.", "I can see why she's an ex-friend", "Years ago, my roommate at the time had some folks visiting and one of them grabbed one of my books to read after I’d gone to bed. I woke up in the morning to find a completely demolished spine on a previously pristine book, and am slightly less bothered about it over a decade later, but only barely. I had bought that copy in another country, so there was no way to properly replace it so that it matched the other books by that author.", ">Tl;dr: get over yourself and let people read however they damn well please.\n\nPeople can read **their own** books how they damn well please. They sure as shit can't read **my** books how they damn well please.", "You are speaking of your mom's own books and your own copy of catch-22... not someone else's book. That waterlogged book of the masking tape will mean nothing to the owner someone borrowed it from.", "I once borrowed *Invisible Monsters* from a friend. When he came to drop it off he was like careful with it, Chuck Palahniuk signed it. I was like oh God what? I was so fucking scared to ruin it I would read it at night then gently place it on a high shelf as I had a toddler. Got through the book as fast as possible and brought it right back. Too much responsibility lol. Great book though", "I have one where the typesetters(?) got some of the lines of text out of order. Like 1,2,6,7,8,3,4,5,9 kinda thing. I've added arrows to direct so I can re-read then in order...", "You have to admit that's an excellent story - an unknown Capote taken to war, wrapped in plastic more out of love than money, but nevertheless coming back relatively unscathed.\n\nI think the story might be worth the $500 (?) scars the jacket took!\n\nBut I hear you on supervision. For most people the first jacket is just that extra bit of advertisement that is a decent bookmark. And that's because in most circumstances that's right. So education and care is in order.\n\nSame thing is true for collector cars, fountain pens, furniture, clothes. They're all made to be used, but sometimes they mean more to people. So it's important for owners to educate and friends and family to listen and respect that.", "I have the uncanny ability where if I accidentally drop my book and it closes, I somehow can open it up to EXACTLY the page I ended on. No idea how. Still use a bookmark every time though.", "Someone on the socials a few years ago posted a pic of her mom using a Kindle as a bookmark. 😅", "Yeah that was really confusing", "that was a lot of trust he out in you.", "I'm always a witch, love", "My kindle has been unused on my nightstand for years. Every time I fall asleep reading my guy uses it to mark my place lol. Even then he’s nice enough to only us the cover so it thinner between the pages", "No worries! It happens a lot", "I know I was shocked. I was so relieved when I handed it back in perfect condition.", "I don't remember the last time I saw my Kindle. LOL", "I love buying second hand books and finding little scraps of notes in them. A transfer from public transit that's 15 years old. Someone's grocery list. A receipt from someplace that seems very far from where the book was obtained. Part of a recipe. A pressed leaf or flower. My favourite was a letter someone left in a book on the psychology of military incompetence; it was from one WWII veteran to another. I can't recall the exact content of the letter, but it definitely spoke to a shared understanding of a specific grief and experience. Profoundly intimate, especially being handwritten.", "YTA. How hard is it to use a bookmark? Anything will do! A scrap of paper or a piece of ribbon or summat", "So... Kinda curious. You know that when someone is a collector of something, that means they like to keep it in pristine as close to knew condition as possible, right?\n\nThis is like borrowing someone's car and returning it with a scratch. In the short term you might not think it's that big of a deal, but it does lower the value of the item and even a small scratch can damage the car longterm by giving rust an avenue to set in.\n\nWhenever you borrow something you should always return it in the exact same condition, if not better condition where easily possible.", "YTA\n\nDo whatever you want with your own books, but respect books you borrow.\n\nIf your brother collects books he probably buys first editions of his favourite authors. If kept in good condition these will increase in value in future. Not if they have been abused though. People borrowing and ruining books is a real bugbear for people who love and cherish books. When I read a book you can't even tell its been read. When I lend them to anyone, they usually come back looking like they have been dragged through seven levels of hell, if they come back at all. I rarely lend books out any more.", "Librarian here and I write in my books and dog ear them as well. That’s my prerogative because they’re mine. Chances are you know your brother isn’t the dog earring type. The bottom line is the book wasn’t yours. Get a bookmark. YTA.", "YTA. My book collection is the one place I let my OCD rule since it’s not a very harmful hobby (willfully ignoring all the trips with heavy boxes of books every time I moved). It would hurt me to see you damage my books. The level of emotion he’s displaying doesn’t match the level of physical damage done to the book in your eyes but the emotional pain of seeing you damage the thing he cares about and let you borrow matches the emotion you’re witnessing.", "YTA. As a book collector, I'd have freaked out also.\n\nI don't even let my wife borrow my books anymore because she dogears pages. If it's your book? Do whatever you want. But when you're borrowing someone else's book, return it in as close to the condition you received it in as possible.\n\nMake amends by buying him a new copy. And don't be stingy about it...if it's a first edition, replace it with a first edition. Replace it with the same version of the book... If it was a nice hardcover, don't replace it with a shitty economy paperback.", "YTA. It’s not your book. You know it causes a permanent line. don’t play dumb.", "The rule of thumb has always been return an item borrowed in the same condition or better than you received it. You treated someone else’s property with a lack of care.  Your concluding “ jeez” is very telling - you just didn’t care about his book, his property.  YTA.  Apologize and buy him a new book.", "Flip it around.\n\nSay your brother borrows something you treasure, and returns it damaged.\n\nGet it now?\n\nYTA", "The 9 Circles of Hell are not hot enough for this.", "I'm just going to say that I myself wear examination gloves when I read so I don't get sweat from my hands on my books.\n\nHaving said that, I don't think you need to hear from me what so many others have said. \n\nBut they are all 100% correct.", "YTA\n\nWhen you wrong someone unknowingly, don't get defensive or minimize their feelings. Apologize and correct your mistake. You didn't mean to harm your brother's book, but you did. You didn't mean to upset your brother, but you did.\n\n>I’ve always done that with books and I don’t understand why it’s bad\n\nHow you treat your own property does not matter. When you are borrowing from someone else, you need to care for it like *they* would.", "People who dog-ear pages in books are assholes.  You are one, and you did damage a book that was not yours to abuse.", "You’re a monster. Use a bookmark, especially if it’s not your book!", "yta. 'but jeez' ? it's his book not yours. you are damaging his property. if it was your book...fine, but it's not.", "YTA I don’t let people borrow my books for this reason. Dog earring and breaking the spines on my books are a no no\n\nYou owe him a new copy", "YTA\n\nYou sound entitled since you destroyed some one elses property and just dont care.", "You bent the page. \n\nYou damaged the book. \n\nThis is a HUGE deal to a book lover.  \n\nEnd of story.\n\nYTA", "YTA. Dog-earring a book tears it up. Learn how to use a dang bookmark like a normal person. You can even make your own with any scrap of paper. Don't go around damaging things that don't belong to you.", "YTA. You don't dog-ear other people's books. Books are expensive and he obviously takes care not to damage them. And even though you might think that some creased and folded pages aren't a big deal, that's not for you to decide if the book isn't yours. Only because you don't mind the damage to your own books it doesn't make it okay to damage his. \n\nJust treat things that aren't yours with respect ffs, that's super basic manners and I'm honestly shocked that you managed to go 21 years without your parents teaching you to take good care of borrowed things. Apologize and buy your brother a new book.", "You didn’t “ruin it” you actually ruined it. How inconsiderate, he is clearly a collector. Replace it.", "YTA \n\nYou dog ear your OWN books like a godless, feral heathen. You treat EVERYONE ELSE'S books like they're fragile and expensive, even library books.", "YTA.\n\nYou need to learn to treat others' property with the correct respect. A while back, I lent some of my books to a friend of my ex-husband. I got the books back with the spines all cracked and dog ears all through the books. I was just in shock I didn't say anything. I brought it up with my ex and he said (nearly verbatim here), \"What's the big deal? They're only books. Suck it up. What do you expect Frank to do, buy you new ones or some stupid shit like that?\" Yes, actually, I did expect them to be replaced.\n\nInstead, I divorced him. One of many reasons.", "YTA majorly. I’m not even a huge collector, but if someone borrowed one of my books and did that I would be furious and demand they buy me a new one. I can’t comprehend why you would think this is okay to do to someone else’s property. I guess that’s a bit far, but I’ll leave it at, what you did is incredibly rude and an apology and a new copy would be a very appropriate way of recompense.", "YTA. Buy him a replacement, and do it with a smile on your face and a gut full of regret. It’s a lesson in respect. When you don’t show respect in the smallest of matters, you damn well won’t for the big things either.", "You did ruin his book so YTA here. If it’s your own book do whatever you want with it no one would care but this isn’t yours. You should show more respect to other people’s things.", "YTA and I would be furious too if someone borrowed something from me and damaged it on purpose. How can this be so hard to grasp?", "How inconsiderate and unaware can you be\n\nYou know he collects books, you know the book is his. You damaged something that to him is very important. Learn to have some respect for other people's belongings, you are very much the asshole", "treat other people’s property as they want it to be treated (or better)\n\nIf you can’t do that, get your own or borrow from someone with the same standards as you.", "YTA, use a bookmark, and show respect for the property of others.\n\nBuy him a new copy.", "I hope you plan to purchase  a new book with same edition as a replacement. Its obvious he treasures his books. Its one thing treating your own books a certain way. when you borrow someone elses book knowing he's been collecitng books for a while and fold the page makes you a HUGE AH. You need to learn to respect other peoples property when they let you borrow.\n\nYou posting this question here makes you look soo clueless and entitled.", "YTA. This is why you should never lend books or records. People don't have the same care that you have with your things", "“I don’t get why you’re upset I fucked *your* wife, I fuck *my* wife all the time!”", "I don't understand how you can vote NAH and then in the very next sentence actually explain why OP is in fact the AH", "Did he replace it?", "Noooo! They'll stick! Just get a nice bookmark, or any scrap of paper", "I like the magnetic ones with the arrow so I know what line I left off on", "See, writing notes to me is a lot more acceptable than dog-ears. Notes are preserving your ideas about the book. A dog-ear just weakens the page, and will eventually tear off at the fold. \n\n(not to do in someone else's book, obviously)", "It works best for hardbacks, but this csn indeed help with the flexibility of a paperback", "I agree there is different ways to cherish books. To each their own. \n\nBut we should still be respecting other people's property how they want their own property to be treated as. The condition of the item borrowed should be well taken of and in the way the owner wants. It's not gonna be the exact same, but returning in the closest to same condition is ideal. \n\nDog-earing pages/cracking spines/bending causes more stress to a book than normal wear and tear. Especially if it was not in that condition previously. That type of damage can be avoided by never doing it in the first place. Any type of expected damage should be communicated before hand. Even more so, when people's care of their books is so varied. (Hey I'm using your shovel, of course dirt is getting on it vs can I try your drink, do you mind if I drink straight from the cup/straw or do you want me to waterfall (pre-covid ofc))\n\nWe should be comfortable in using our own property but when borrowing, our comfort should not be at the expense of the person who is letting you borrow.", ">the paperback covers on those books are about to fall off.\n\nYour MiL is probably reading \"perfect\" binding paperbacks - a little joke in the bookbinding world. They're not meant to last more than one or two readings, the cheap glue gives out and the pages fall away, leaving behind just the cover.", "Notes in library books are my sole reason for buying post-its.", "YTA\n*hisses*", "I'll be honest, I dog ear all my books and... Yeah, it ruins them over time. It's kinda easier to keep track of my place and I'm lazy, but it makes me sad that all my paperback books from my childhood are in tatters from repeated reading and my casual abuses...\n\nSo YTA, but an apology and an effort to understand the issue and not hurt the books would probably get you a chance to finish reading the book?\n\nTip for bookmarks: use something you really like, like a card from a game you enjoy a lot, or a picture of someone you like. It feels easier to not lose track of the bookmark. Alternatively, bookmarks that gently grab onto/clip into the book are also kinda nice if you'd really rather not worry about losing the bookmark at all.", "Go post this is r/books just to be sure lol", "YTA!!! Get a book mark. What kind of uncivilized person are you", "Voracious reader and book collector here...\n\nI NEVER lend books to anyone anymore - if I really think someone will enjoy a book that I've also enjoyed, I try to hunt down a good 2nd hand copy to give to them, and save my own copy.\n\nI've had friends ask if I've actually read any of the books in my library, as they look like they've never been read - the spines have never been 'cracked' / paged dog-eared, nor books left open and turned over to save the page - I always use a book-mark.\n\nOP sounds like the devil incarnate...", "When you borrow someone else's stuff, you treat it like they treat it, or better. YTA", "This is the gospel. Mass markets will always experience a creasing of the spine but generally be gentle with books. Same goes for library books!", "Yeah, I never understood the phrase/instruction\n\n>Treat it like it was your own\n\nMost people treat their stuff like shit. \n\nI'm definitely not totally innocent in that regard, but with my stuff, I'm only accountable to myself.", "There are some people I would never loan things to, including books and dvds. If the state of their own possessions is not what you want yours to look like, then don't loan them those things. Habits are unconscious - even if they don't do it intentionally, it will probably still happen.", "Ouch. This reminds me of the time my sister lend one of my books to a friend of hers (without me knowing). It was just a YA paperback, but still. I treasure my books, especially since it's part of a series. All the books in that series looked 100% in good condition, and then there's that one. With a broken spine. Every time I saw it it hurt me again.", "Can't help but picture Frank Costanza reading this.", "Depends on the book. I crack the spine of every cook book I own because I ain’t got time to be MacGyvering paper weights so I can look at a recipe.", "Better if possible.  Ie. Full tank of gas for borrowing car.", ">Even if they didn't know, is common courtesy to not damage in any frigging way an object that is not yours.\n\nYeah, I was never taught that this is rude/not accepted, but I understand that I do not permanently alter something that isn't mine in ANY way, no matter how minor it may seem to me. Even if the person I'm borrowing from already does this to their own books, I still wouldn't do it without permission. It's just common courtesy in general, it's not just about books.", "Sometimes bookmarks are too thick and can lead to a damaged spine.", "I've used a single strand of horse hair more than once.", "Most modern papers used for books are acid free these days. It’s modern construction that will be a book’s failure. Perfect binding is the most common form of construction and it is the opposite of perfect. \nThere is definitely issues with paper from certain time periods where paper was more acidic. \nI have books that are hundreds and even thousands of years old in my care. It’s all a big it depends. \n-your local friendly bookbinder/conservator", "I don't personally know a single person that hasn't somehow had at least one copy of Good Omens damaged, lol.", "Similar issue. Sis had a bad habit of leaving her books all around the place, including the floor of the bathroom which, well, can get wet (and occasionally the drain of the bathtub backed up, flooding the floor). Several of her books wore marks of that. \n\nI raised hell when I found out that she just took a book of mine (without asking for it) and handled it like she would handle her own. Luckily no damage was done as I found the book in time. (But for some reason I was the problematic one in my parents' eyes? Because she did not like to read and at least was reading something, so why did I cause a scene?)", "I believe this but I'm awful at losing my bookmarks in my bag so I buy paperbacks I can write and dog ear whilst I'm out and then 'inside' books that are hardcover and I only read at home that stay in mint condition. Mostly of ones I read again like Alice in Wonderland", "I saw a bookmark alignment chart where remembering the page was lawful evil. I identify with your sister and that chart.", "> When I was little, my sister used to randomly tell me to remember a number, and then ask me the number a few hours/day later. It took me an embarrassingly long time to realize she was using me as her bookmark\n\nBrilliant", "Yeah I love my books and they're very well worn, to me a well worn book is the sign of a treasured book. I buy a lot of used books from the 1800s-early 1900s and I love seeing the notes people have made in the margins and the dog eared pages and the spines that have been opened and shut a thousand times. Books like that tell far more of a story than a pristine copy imo. \n\nI'd never dog ear somebody else's books tbf, but it isn't a sign of an unloved book to me.", "I do the same! If I'm not close enough to my jar of bookmarks then I will use whatever is close enough to rest slightly inside to keep my page marked, like my phone, Chapstick, hell I've even used other books before! 😂", "Well, yeah, duh.", "Exactly! I just hate the implication that being a little rough on your books means you have no respect for the medium when, in fact, it's just evidence of you fully engaging with the medium.\n\nHonestly, I've never been able to get into ebooks specifically because they offer no tactile connection. They don't remember you or your time together. They're just words that exist in the ether until you look at them for a minute before disappearing again. \n\nBut yeah, obviously never abuse someone else's book. Personally I feel like that goes without saying but I'm also the type who would never borrow or loan out a book just because they feel so personal to me. And the last time I broke that rule my book got abandoned in the woods and the fucker never even had the decency to replace it.", "I inherited a recipe book from my grandma, and I love her handwritten tweaks she added to the recipes. My favourite page, though, is the one where she has scribbled all over the recipe and written “Rubbish!!!” In the margin.", "Mine are the same way. My 43 years old\"Joy of Cooking\" has been used so much that pages are stained and some are falling out. I still use it and I love it.", "My best find so far was a four-leafed clover,  dried and pressed", "I love used book ephemera! I was just organizing my bookcase and remembered that I found 2 Praha postcards in a copy of Václav Havel’s Disturbing The Peace that I found at a goodwill years ago. I love that someone brought the book with them on their trip to Prague.", "THIS is it!! Borrowed things should be taken care of better than your own! Also as a book lover double YTA. OP go and buy a new copy for your brother and one extra book as sorry! Or a gift card.", "As a general rule of thumb, if you’re borrowing something from someone treat it as well or better than they do and return it before they have to ask for it back, or upon an agreed upon date.", "Or, if you really “have no bookmarks”, just note the page number in your phone, take a picture of the page number, etc. There’s zero excuse for dog-earing others’ books.", "That’s like borrowing someone’s laptop and giving it back with a keyboard that’s sticky from spilled orange juice. ‘But I always drink orange juice while gaming, I just spilled a little, I don’t understand why it’s bad, I get that you like a clean laptop but jeez’.", "This is something you shouldn't need to tell people. If someone borrows your book without dogears, they should keep it in the same condition.", "Especially while eating Cheetos and reading a first edition Hemingway.", "This is an unwritten rule about *anything* you borrow. Try to return it in better shape than you got it, or at the very least, in the same condition. If you damage it, then buy the lender a new one.", "Omg reading all of these comments is making me feel so bad about this one time when I sat on the couch in my living room. I live with my bestie and she had been reading a brand new book that she had just gotten like two days prior. There’s always blankets, pillows, and stuffed animals (yes we are adults, yes we have stuffed animals) all over our couch, so I just shifted it all to the middle seat and sat down. (She sits on one side and I sit on the other). She got upset because I had moved the blankets and things on top of her book and bent the cover a little bit. I felt so bad then because I hate it when my books get bent like that, but especially because she was so upset. But like I didn’t know it was there 😭 but now I’m feeling extra bad, I didn’t even think about her caring so much about her books", ">Not fingerprints, scratches.\n\nAnd they made those scratches by mishandling the dvd and throwing it here and there because they don't care enough to put it carefully in its case when they don't want to use it anymore.", "I’ve not stepped foot in a library to read books ever. Some people are not avid readers and don’t share the same love for the physical book as others. OP should apologize for it and say they’ll use a bookmark next time. Also why are you guys acting like there aren’t so many adults who dogear? I know a ton of them", "Nah. Objectively there is nothing morally wrong with it. It is a book. An inanimate object. If you own it you can do whatever you want to it because a book cannot feel or care and there are many other books. Destroying a mass produced book that you own via dog ears has 0 moral implications. If I dog eary book, it doesn't speak to my character in anyway. The only moral issue that arises is when you do it to someone else's property that they cherish", "> dog-earing a book or tearing pages out of one\n\nI mean...you can't seriously feel these are equivalent. I've never had any sort of issues dog earing my books. Zero impact on usability whatsoever over decades and hundreds and hundreds of dog-eared books. OP is obviously still in the wrong but I can understand their surprise at the vehemence of his brother's reaction.", "I genuinely had to ask a friend to replace my book once because she did this. It hurts.", "I just don't get the sense of entitlement people have over someone else's objects. For me it's so intuitive that if it's not yours, don't damage it.\n\nAnd people do other weird shit, like taking stuff out of your fridge without asking. Even my very good friends automatically as \"I'm gonna make coffee, okay?\".\n\nSavages. Barbarians.", "I did this accidentally to a friend's book.\n\nHe lent it to me, and knowing it was winter I'd wrapped it in a plastic carrier bag whenever I took it out of the house.\n\nWhen I went to return it to him water got inside the bag and the pages went wavey.\n\nI felt terrible, I'd tried to make sure it didn't get wet and failed at it. I wound up buying him a new copy because I'm not a jerk, but thereafter I always make sure to use sealable bags rather than carrier bags from a supermarket(I should have known better the first time to be fair, I just assumed that the carrier bag would be sufficient).", "The main issue with creasing books is not so much having any creasing of the spine at all, but that really extreme \"break\" where the whole book is separated into two pieces only held together by one piece of paper or card.\n\nHaving that extreme break will actually make the book fall apart quickly, and it comes from \"cracking\" the book open when it's new and inflexible. Working it open more gradually (as the link suggests) prevents big structural breaks to the spine.", "I read this as “I’ve used a TV remote and a pickle” and didn’t know whether to be weirded out or applaud the creativity.", "I was going to voice this sentiment exactly!\n\nAs long as the crease isn't near the writing the book still serves it's purpose", "Marginalia are brilliant. Missing corners and missing pages are not.", "The first Shakespeare play book I ever bought was from a used book shop. It was one of those that had the 'translations' on the right side and the text on the left, and whoever had that book added their own notes. It was like having a private tutor. I felt like that person was helping me understand the language (and the plot - it was R&J but I was like 10 when I bought it).", "There is a difference between wanting all of those things and also to not want people to damage manuscripts in the first place. Turning down a page corner is not the same as leaving a note, or doodling penises as the monks were wont to do.\n\nImagine if we had the full text of so many wonderful or lost works!", "Another Librarian who works with old books here. \n\n-\tMarginalia ? Yes. Acceptable. \n-\tStrange bookmarks ? Yes. Amusing. \n-\tDirt ? I have a special cleaner for that. \n-\tStickytape ? Oh I will stab you to death with my stapler here. I *loathe* stickytape. No. Just… no.", "Eh, this is the thing with books though: what's valuable is going to be extremely subjective based on cultural trends, location, scarcity, relevance to the institution looking at the donation, physical condition, etc. There are plenty of rare and/or old books that aren't worth very much. It's just the way it is.", "I mean, really? The guy said he barely reads, and that he recently saw a book recommendation that his brother was reading. It's not like it's at all likely to be a first edition Anna Karenina. But, sure, OP, go out of your way to buy the same 2022 printing from Barnes and Noble.", "You can thank Ms. McCrady of [Abbey Publications](https://cool.culturalheritage.org/byorg/abbey/) for the fact that acid-free paper is the modern standard.\n\nShe was batsh!!!t, but she did know what she was talking about when it came to paper preservation and would educate you on it whether you wanted to know or not!  I still have one of the pH pens from when I worked there.", "I would read in bed and would use the top of the sheet as a bookmark if I didn’t have scrap paper handy.", "I love the ‘weird medieval guys’ Twitter account", "Nothing will beat the nuns casually picking penises from the penis tree!", "My mom was horrified I wrote notes in the catholic bible my now husband bought me. He is catholic. I fall somewhere in the Protestant but still nondenominational group of Christians (my mom was raised catholic and converted in high school). So I use the ESV version of the Bible. My mom saw me marking the catholic one and git angry at me. Apparently you don’t do that. And said i would mark up my esv. I pulled out my esv and showed her the marks i made in that. And then my dad (very very devout, not a bible thumper, just devout) admitted he also wrote in his king james bible (for non Christians none of this is important they’re book titles in this context not starting or desiring a debate). My mom backed off embarrassed.", "I found a serious book collector to care for it. I stopped dealing in books after fighting off thieves online. It just wasn't worth the aggravation anymore", "Sorry. I found a serious book collector to give it to", "I read my copy so many times it's actually falling apart. I brought it to a signing years ago, and Sir Terry himself laughed at me, then sniffed it to see if it 'fell into something'. I need to get Gaiman to sign it. Pratchett wrote '333' next to his name. I'm hoping Gaiman will add the other 333.", "Neverwhere is such a fantastic read! I really enjoyed the BBC radio play with James McAvoy, Natalie Dormer and Anthony Head", "I lived Neverwhere too!", "No, thats Margarita. Marginalia is the delicious savoury tomato sauce that often comes with meatballs.", "To be honest, holy books are the only books I don't hesitate to write, highlight, fold corners and even stick things onto (like heavy duty post it tabs that won't fall off). I think it's because first I treated them as textbooks for a subject I was trying to understand. and then merely citations for things I have no respect for.  ╮( ・￢・)╭", "Yeah there is some insane gatekeeping around this. You can't be a *true* book lover if you don't fucking barely touch a book while you read it. I personally find it magical and personal to have a well-worn book, that's a sign of love to me. Evidence it has been poured over, considered, cherished over the years. Me personally, at least. People who try to shame that because they personally need an impeccable book are rude as hell.", "In later editions there is a forward where Neil actually talked about how common it was that they would go to a signing and be presented with copies that were falling apart because they had been read so many times", "I try and use mildly interesting bookmarks for this reason.", "/r/foundpaper", "I checked out a book from the university library. It’s quite old and has a to-do list jotted in the back. One of the items is “get cat food” another is “manicure before big date” with hearts all around it. I’m obsessed.", "I have a book with a small white envelope with \"this should help you with your troubles\" inscribed in perfect cursive. I've held it up to a lamp and I'm pretty sure it's money but it's more awesome unopened imo.", "Folding the corner, while still bad, isn't nearly as bad as what one person that borrowed a book from me did (she's now banned from ever borrowing from me again).  Instead of dog-earing the page she'd *rip the corner off* the page.  She didn't get why I was so upset and does it to library books as well \"and they don't have a problem with it.\"  She seems completely oblivious to the fact that the library won't let her check out any of the rare/historical books in their collection.\n\ntagging u/NobodyButMyShadow, u/longpas", "I literally cringed when i read that, i would have been so upset if that was my book!", "This. YTA. And I would be very careful to lend you anything else since I couldn't be sure you take care of my stuff properly and do your best to return it in the condition you got it in", "Whelp, I just found tonight's \"staring at the ceiling in mortal shame\" topic for the night. I've done this exact same thing with pencils and pens (or absentmindedly put them in my mouth) countless times. I mean countless.. even still. I'm so sorry to the probably hundreds of people's pencils and pens I've broken/dirtied/accidentally stolen and immediately lost through all of my schooling.", "Most of my books at home use the receipt from when I bought it.\n\nI have bookmarks, even fancy ones, I can just never find them when I need them.\n\nThe rest are yu-gi-oh cards. Those were the things I could never stop finding.\n\nI swear I had like 10 copies of that \"Defend\" trap card in different books.", "> offer to replace the book\n\nDon't *offer*, **because that places the responsibility on him to accept your offer** (this applies to many things in life actually). Just replace it, apologise profusely and make it clear you understand now why what you did was wrong. This is the way you rebuild trust.", "to be fair, even soft cover books were glued together better back in the day and one was able to do that without immediately breaking it, as long as you were gentle. the joy of slightly cheaper manifacturing :/", "My BFF does this with manga & it drives me INSANE I refuse to let her borrow my books now lol", "I refuse to read a book only half open. I always crack the spine in multiple spots so that the paperback is easier to read. I've always been of the opinion that hardbacks are precious and to be protected, and paperbacks are the book you read on the go, in the bath, outside, at a bar, etc. One of my favourite paperbacks has a spine so cracked it's hard to read the title, it has fallen into a bathtub more than once and also has blood on the cover lol. Paperbacks are meant to live life!", "My books are well loved but look pristine. They ultimately last longer this way!", "Same!!", "This is horrifying! Are you sure this lady isn't a serial killer? I honestly think that this is antisocial behavior and would never let this person watch my pets.", "I can’t actually remember. It was a used paperback, probably less than $5. All of us were shocked that it split in half. That was how “well read” it was by the people before me. \nHe definitely apologized. I just don’t remember if he replaced it or I just taped it up.", "Thank you for taking good care of library books. I work in a library and so many people don’t.  We really appreciate people like you 😊", "Don't be too hard on yourself! It was an honest mistake. \n\n*Hugs*", "Even my 3 year old knows not to fold pages in my books. Her own books are usually made with cardboard-like thick papers so they don't fold :)", "My heart hurts reading this, but I'm glad you got free of this AH that on top of that gets offended when they are called out.\n\nLife's too short to deal with this people.", "I cherish books. A lot of mine are abused from years of rereading. The book I cherish most is one that my rabbit ate the corner off as a child. Cherishing books doesn't mean they have to be in perfect condition.", "Or are too hard and can damage the pages", "Yup bookmarks were invented for a good reason!", "💗💗", ">and how to remember what page I’m on when I don’t have a mark handy.\n\nSo who’s your “bookmark” now?", "They say a thousand books makes a library, so congratulations. You're a librarian.", "Precisely this. I love my books hard and that's what I like about them. They're dog eared, there's notes, sometimes I crack the spine so I can read them more easily one handed.  \n\n\nThat's part of why I love them, geez. They tell a story beyond the narrative of them, they tell a story of me reading them. They are not sacred relics, they are objects to be enjoyed.", "Sometimes I buy a specific edition simply because I like the cover art more. Ruin my book and buy me a replacement with the movie iconography instead of original art? I will be giving you the stink eye for at least a week.", "My brother did that to my Fellowship of the Ring, except it was right after the movie came out, so I had all these beautiful LOTR books and one Elijah Wood cover after my mother bought me a replacement. The one he cracked the spine of had Glorfindel on the spine! I'm still salty...", "This happens to most people, especially with new books! It’s because the already read pages end up being less tight and pristine than the ones that haven’t been read yet. And if you were holding it open on a page for a minute and drop your book, the spine doesn’t entirely sort itself out in a couple of seconds it’s dropped, and it kind of remembers your page for you.", ">I buy a lot of used books from the 1800s-early 1900s and I love seeing the notes people have made in the margins and the dog eared pages and the spines that have been opened and shut a thousand times.\n\nThese are the only kind of books I collect!! My motto when buying is \"The more beat up, the better!\"", "My university has an illuminated manuscript from idk the 15th century with plans for someone’s garden scrawled in it. So cool.", "Reminds me of elementary school when you’d check out a book and see the names of those that like the same kind of books it was an easy way to make friends. OP YTA it’s your brother’s property respect it", "Omg that’s painful to read! Similar happened to me when my kids started reading my books. Luckily everyone in the family likes similar books and when we downsized our home, I found multiple sets of LOTR, HP, Eragon, Ursula LeGuin series, etc. And some books I’d kind of forgotten about and am happy to keep. For me, it’s a little easier when damage is from kids than from dibs because having kids was my decision 🤣", "Me too! My favourite thing is when a well worn book has a note written in the front. I think my favourite was beautiful handwriting saying \"Dear Margaret, you bring me joy. Love always, your Tom\". Made me smile so hard haha.", "Yeah ebooks just don't hit the spot for me either, even the smell of books brings joy when reading. \n\nLending them out is risky yup, if I ever lend anybody something I make sure I'm comfortable with the idea of not getting it back the way I gave it out. Some people accidentally damage things and then other people are just careless but either way it makes me hesitate when lending.", "Marked and dog-eared recipe books are the exception here", "Cookbooks are a bit of a special case. :)", ">\"Dear Margaret, you bring me joy. Love always, your Tom\". Made me smile so hard haha.\n\nThat's so beautiful! I would treasure it forever", "I once borrowed a book to read, from an associate. Not thinking, I accidentally dog-eared 1 page, (I forgot my bookmark 🔖). When I returned said book, it completely slipped my mind, to tell her what happened. The next day, she screamed at me in front of her Book Club Friends. Calling me all kinds of nasty names and such. (All while laughing). I bought her a brand new hard back copy (she had a paper back copy). With a Starbucks Gift Card. I apologized to her and walked off. Without giving her a chance to say anything. She tried calling/texting to apologize, for the way she reacted. I simply stated \" you said what you felt and how you truly felt about me, no need for you to apologize.\"  I have never borrowed another book from any person after that.", "That is awesome. What an amazing inheritance.", "Similar story, but not my family. \n\nI found an very old (1909) cookbook from France called \"Cuisine de la Campagne\" (Country Cuisine). \n\nOn one of the margins next to a recipe for Bouillabaisse Marseillaise is a little scribble note that reads \"C'est degueulasse!\" (It's disgusting). \n\nSomeone had very strong opinions on seafood stew.", "Wow that is wayy overboard of a reaction, sorry that ruined your experience with borrowing books!", "Screaming at someone over it (unless maybe there’s evidence they had malicious intent) is ridiculous — I had a friend who used to eat chocolate chip cookies etc while reading my books. After a few came back with chocolate smears on the pages and crumbs in the gutters she was only allowed to borrow on the condition that she return me a book in clean “Gwendle Approved” condition — either mine or a new copy. Otherwise the Gwendle library would be closed 🤷🏻‍♀️\n\nWhen we were about 14 she borrowed a brand new book that I hadn’t even read yet (I got it as a gift and she was further ahead in the series than I was) it was the first time she ever read a book and kept it in perfect condition — no spine creases, no chocolate or crumbs, no dog-ears or tears. She was so proud of herself she phoned to tell me. Before she’d returned it to me her mom decided to read it. In the bath. And dropped it. \n\nShort story long her mom bought me a new copy 🤣", "I got so aggressive when I read he dog-eared it.", "It's more efficient to just stick your tongue to the corner of the page and turn it with your head.", "People so often seem to think that because a thing or a material *can* flex or bend or fold that it is somehow meant to or is otherwise unbreakable by doing so. Which is just... Not how anything works.\n\nBend paper enough times, it will tear. Breaking the spine of a book is so called because it literally breaks the binding of it, making it less structurally sound.\n\nAnd this is entirely setting aside that it wasn't OP's book. If you borrow something from someone you treat it with the utmost respect because **you don't own it.** The way you treat that object becomes a proxy for how you can, would, or do treat or think of that person. If my brother lent me a beautiful paintbrush and I squished the bristles into the wall I wanted to paint on because that's just what I do when I paint, I would be an absolute ass. What I do to my things is entirely removed from how one should treat the belongings of others. Period.", "Public use gets the public treatment unfortunately, and I'm not shocked at all. =(", "When I was 14 every time I started a new book I drew and colored its own personal book mark with title, author, series number, start and finish dates, and doodles from the time I was reading it. I wish I still had those.", "Thank you for this. This is not something I knew, and I needed it.", "Exactly!!", "I do this all the time. Also, in my experience, libraries almost always have bookmarks on display for you to take. Usually they’ve got seasonal images or event reminders or program information on them. I grab, use, and lose these basically constantly.", "It somehow bothers me more that that person went on to study engineering with that mindset. :(", "You are 100% right, me and my sister are both huge into reading, and she actively encourages me to \"give some character, make some memories\" with her books, and well I dont trash them, I dont care about them, I throw then into my bag without care, I leave my bookmarks in them, I take them out during bad weather, and in the end, she has books that tell two stories in them.", "hot take and contrarian opinion: good omens is worse than the majority of discworld books. Gaiman detracts.", "Would you not be better off with something like a Kindle instead for out and about?", "I’m so happy you did! I’m positive they are thankful!", "My best find was a cutout newspaper article from the opening of the Empire State Building I found in copy of Minute Wonders of the World.  It also came with an inscription from a teacher to one of her students.", "Ok, this may be a hot take, but everyone sucks here. \n\nYou did damage his property and especially if he is a collector or reseller of books, you owe him a new copy. \n\nBut Jesus Christ, what is wrong with some of you people? So many in the comments are screaming about how \"14 year olds have better manners, you should be ashamed of your inability to respect other people's property, I'm glad you're not in my family, etc.\" Don't any of you think that is a bit excessive? He did not \"destroy\" his book. He bent a single page once. I understand he outright should not have dog eared the page,but I'm sorry, screaming at your brother and locking yourself in your room like a goddamn 5 year old is immature as hell. What he should have said is \"Hey! What the hell! Don't dogear my books if you wanna borrow them. Get a bookmark.\" Not shout and scream as if he just threw it into the fireplace. Because believe it or not, not everyone has the same passion for reading, and surprise surprise, not everyone immediately knows book etiquette. I just can't throw too many stones at someone who is not a reader for not knowing bending a single page would warrant this kind of reaction.\n\n Granted, i will openly admit right now that I am likely not as passionate about books than many commenters and especially the brother. My collection is quite small, and i mostly have print versions of my favorite books while others i read are on my tablet. But I'm sorry, even if my collection was bigger and i read significantly more, there is no way in hell I would react that way to one bent page.\n\nBuy them a new copy and apologize OP, but ESH.", "You know I need to be doing that with the highlighter.  There are a heap of books on my shelves that have been read so many times that they have no collector value, but I should highlight the parts that I really love.\n\nI have bought old books because of the comments in the margins and the underlining - it is probably time I started underlining and highlighting my favourite books, that have been read too many times to be worth anything.  For prosterity's sake.", "This is the only rational top comment damn. Everyone else sounds like they're gonna gut OP with a spoon", "\n>YTA and a monster! How dare you treat books like that. \n\nGranted not his book so he's in the wrong but there is no correct way to enjoy your own books, it doesn't make you a monster.", "My library has a box at the checkout desk full of family photographs used as bookmarks and removed by librarians.", "cookbooks are special tho,  if they  don't have notes and stains and evidence of use,  then it probably wasn't a very good cookbook", "Has nothing to do with being autistic. I would rage too if u would destroy something I collect for 10 years", "I'm not autistic but if you folded pages in my book, I'd yell at you too. Get yourself a bookmark or something 🙄\n\nYTA", "No, she's just completely clueless.  She's the nicest person you ever met and will give you the shirt off her back if you ask.  She just lacks common sense that if it isn't yours *don't damage it.*  Her whole family does stuff like this and can't understand why people won't loan them their things anymore.\n\nPets she's absolutely wonderful with and when you come home you have a happy, healthy pet that's been brushed and given a bath if they need it.", "Hello! I had to pop on to comment, even though I haven't read Good Omens specifically. My husband and I very much *do not* like Gaiman's writing either. He seems to be an absolutely stand-up guy, and we have no ill will toward him. And both of us absolutely lost it partway through American Gods when it sexualized an 80 year old lady in a nighty. We have yet to find anything by him that we like.\n\nIt's become such an odd topic of contention in our friend and family group because everyone else we talk to absolutely *adores* Gaiman's writing. It's so frustrating.\n\nPratchett though? That man is a genius.", "I mean... to be honest, I'm 41 and a bookworm and this is the first time I'm finding out that people have such strong opinions on dogearing. I'm surprised by the reactions telling her to replace the book. Assuming we're talking about a garden-variety paperback, a folded corner doesn't mean the whole book ruined! The words are still legible which is the point of a book. I understand that the brother's upset, and I think a heartfelt apology is all that's really needed here. It was an honest mistake. Now she knows and she won't do it again. Buying a second book would just be wasteful.", "This is the one sane comment I’ve read on this post. I understand he shouldn’t have creased the page but come on, the book isn’t ruined. One page is creased, buying a new book would be a waste.", "Like, this really is just a communication problem. If I was this protective of my books, I wouldn’t lend them out without clear instructions of how I expect them returned. All the brother would need to say was “hey, I don’t like my books dog eared, can you please not do that”? Throwing a tantrum is so over the top. It is, at most, $20 if you absolutely insist on getting a brand new copy.", "Yesssssss!! And for me a huge part of reading is relaxing and getting totally absorbed. How the fuck am I supposed to let go and get lost if I'm preoccupied with fussing over perfectly preserving the structural integrity of the book the whole damn time??", "I have a box of index cards from my great-grandma that has recipes on one side and on the other were client's names and measurements from when she ran a business as a seamstress in the 20's and 30's. I also have a cookbook that's a lot like yours, minus the \"rubbish\" lol. Sadly, it's falling apart because the glue on the spine got so old, but I won't ever get rid of it (because my mom also used it a lot)- even if I don't cook at *all.*", "Yeah, books like that are treasures even if they are very broken!"]}