{"id": 6514, "submission_id": "103gnbg", "title": "AITA for not inviting my ex-boyfriend to my wedding, even though he paid for my engagement ring AND we have a child together AND he is one of my closest friends?", "selftext": "I recently got engaged to my current boyfriend, who I have been with for  over a year. However, my engagement ring was actually paid for by my  ex-boyfriend, who I dated for three years before breaking up with him.  We ended things on good terms and he has been very supportive of my new  relationship. We also have a child together, who he is very involved in  raising. Despite the breakup, we have remained close friends and he is  one of my closest confidants. However, now that I am planning my  wedding, my ex is asking if he can come. My current boyfriend is okay  with me inviting him, but I feel like it would be inappropriate and  uncomfortable to have my ex at my wedding. I'm worried about how it will  look to other guests and I'm not sure if I'm ready to see him in a  romantic setting again. \n\nAITA?", "created_utc": 1672870065, "permalink": "/r/AmItheAsshole/comments/103gnbg/aita_for_not_inviting_my_exboyfriend_to_my/", "score": 74, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am wondering if I am the asshole in this situation because I am not sure if my actions were considerate of my ex's feelings or if they were selfish. On the one hand, I don't want to hurt my ex by not inviting him to the wedding, especially since we are still close friends. On the other hand, I want to prioritize my own comfort and the overall dynamics of the wedding. I'm not sure if I made the right decision and I'm worried that my ex or others might think I am being an asshole for not inviting him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Let me get this straight—he can buy your engagement ring to marry another man but it would be “inappropriate and uncomfortable” for him to be a guest at the wedding? I think you have your wires crossed.", "YTA, and  it seems to me you're not ready to get married yet as you have some issues to resolve.", "Yta. \n\n>I feel like it would be inappropriate and uncomfortable to have my ex at my wedding\n\nIs it not uncomfortable and inappropriate that he paid for your engagement ring ??", "Info - how is that your ex paid for your engagement ring?", "YTA.\n\nyou guys have a kid together, he is going to always be part of your life.  You still get along and are friends. your soon-to-be husband is okay with it.  \n\nbasically one of your best friends and father of your child wants to be at your wedding, and you are not going to invite him.. why exactly??  cause someone might judge you poorly?", "You know what is inappropriate at your wedding?\n\nUsing the engagement ring that your ex boyfriend paid for and proposed to you with.\n\nWTF is that about?", "YTA.  You're comfy enough to take his money for a ring, but not comfy enough to spend money on his wedding invite dinner/drinks?", "Um, you’re going to wear an engagement ring paid for by another man, and your biggest concern is what people will think if he is at your wedding??? Just invite the man. After all, you’re wearing his ring.", "Edit to add: I clearly missed the last line lol. Yeah, maybe you're not ready to get married. \n\nHe's your friend. He's your childs father. He is supportive of the relationship. I think it'd be weird NOT to invite him. \n\nNot sure how old your kid is, but I think it'd be great way to show a healthy coparenting relationship as well. \n\nYes, YTA. The wedding is for you and your partner. Not anyone else. Who cares what they think. Invite who you want and who is important in your life.", "Yes, you would be. You’re on good enough terms to have him in your life and be “best friends but not romantic” and to take his money for your new relationship, which he appears by your own admission to support and celebrate, but cannot publicize that there might be maturity after a breakup due to “appearances”that you are only projecting anyway. Clearly the post-breakup maturity is purely one way and you left a good dude for what seems like a decent dude, and from the attitude in your post, you deserve neither.", "YTA.  With all that he's done and the good positive relationship as well as a child together, I can't see any good reason why he can't come.  And what kind of a groom doesn't provide his own engagement ring?", "YTA You are using the engagement ring he bought and you'd be uncomfortable having him at the wedding vs the thing on your finger that will be a constant reminder throughout your life (not withstanding the child). This seems like a very odd choice to make given everything you've said but honestly at this point not the weirdest one I've read all day, not even close.", "YTA\n\nYour husband-to-be should be paying for your engagement ring. At the very least since you've allowed your ex into your life the way you have you should invite him as a guest. He obviously values your happiness which speaks volumes for him as a person. And make sure that man catches the bouquet", "YTA no problem with taking his money for an engagement ring but you draw the line at an invite?\n\nI'm embarrassed for you.", "YTA - you are \"not sure if I'm ready to see him in a romantic setting again\" indicates that you aren't 'over' him.  Add to that that he has cut the legs out from under your fiancé, by paying for the wedding ring!  That is just messed up!  You have emasculated your future husband and still have feelings for your EX.  You are NOT READY to get married!", "YTA for allowing your ex to pay for the wedding ring, undermining the whole ceremony. Set that right. Don't invite the ex, set boundaries.", "lol", "YTA if you only care about what it looks like for outsiders. You know your situation with your fiance and your ex best.\n\nYou describe him as one of your closest friends and confidantes. They should be present at your wedding. Unless you still harbour feelings for him, but then you need to come clean and decide whether you want to get married to your curreny fiancee anyway.", "INFO: HTF did your ex wind up paying for your ring?\n\nAre you sure there’s nothing left there? The last few lines of your post seem a little sus.", "YTA if you are comfortable with him paying for your engagement ring but not treating him even remotely like the “close friend” you say he is. I’m not sure what your angle is here but if you aren’t friends and aren’t comfortable, fine, but then stick to that and don’t say he is one of your “closest confidants”? You’ve gotta pick one.", "So how long have you been sleeping with your ex?", "See, here's the thing, he's the father of your child and you're still friendly. How will it look? Like you're a mature adult with an awesome coparenting friendship with your ex. And while the setting may be \"romantic\" that's because it's romantic with you and *your fiancé*. Ex would be just a guest. NAH but I think you're waaayyy overthinking it.", "YTA how are you going to let someone pay your engagement ring but not invite them?! Pay him back because no", "YTA.  If you want to keep the good relationship with your child’s father, invite him to the wedding.  \n\nAnd for the love of God, don’t use your engagement ring from your ex in your current relationship!  That’s inappropriate.  Your fiancé should be weirded out by that, unless he’s cheap.", "YTA. And an oblivious one : you explain in your own post why he should be invited.", "YTA \n\nYou should give him his ring back. Or at least not be wearing a ring he paid for to marry someone else and commit to them. \n\nInfo - how old are you guys?", "So he can buy you the ring but he can't actually go see you get married? \nNothing you say here makes any sense. \n\nYTA.", "YTA with a twisted perspective on things. You’re okay with him helping out financially on one of the most meaningful and intimate object aka the ring but don’t want to invite him as wedding guest? Like what? Please sit down and think through how irrational and illogical you are", "NAH\nBut \"I'm not sure if I'm ready to see him in a romantic setting again.\" makes me question whether you're ready for marriage to your current bf", "so its inappropriate for him to come to your wedding but its okay for him to pay for your engagement ring to another man?  \ntalk about doing things at your own conveniences   \nYTA btw", "I won’t call you  an AH but I’m getting mixed signals from you. You say he’s a great friend, fiancé is fine with him at the wedding yet you don’t want to make anyone uncomfortable. Are you the uncomfortable one? You also mention not wanting to see him in a romantic setting. Why does that matter? If you’re just friends you should want him there. I suspect you aren’t over him and that’s why you’re bothered.", "YTA--you feel it's appropriate to be his \"friend and confidante\", and to take money from him for your wedding, but somehow having him there is not appropriate? You were not worried how him paying for the engagement ring of another man \"looks to other guests\"?", "YTA. Surely your ex will be there with your child? If you and your husband can take his cash to buy an engagement ring, you can have him at the wedding with the child you share.", "YTA \n\nIt is respectful to invite the father of your child. It is disrespectful to invite someone that you still have lingering feelings for and whom you would be uncomfortable with in a “romantic setting.” You said it would feel inappropriate to see him in a romantic setting, which you wouldn’t care about if you had romantically moved on from your ex. \n\nYou would seriously be disrespecting your fiancé to have your ex there, and even more of an AH if you married your fiancé before fully resolving your feelings for your ex. I mean, come on…your ex bought your engagement ring, the most romantic gift ever. I have no idea how your fiancé is so chill about all this.", "YTA you’re using him for his money, if you truly were uncomfortable with him attending the wedding then you wouldn’t have accepted the ring, but you did. I hope he finds this sub so he sees how you see him.", "You’re worried about how having him at your wedding will be perceived while wearing his rock on your finger? Along with the lack of invitation return that man’s gesture of goodwill and set him free. YTA, now and when you find it appropriate for yourself to accept warm gestures from him only when it serves your selfishness.", "YTA- one for not returning the engagement ring\n2. Holy heck your trash for marrying another man with it\n\nLawd you move fast. Every thought about actually getting to know someone before you idk marry them. \n\nWhat are you 21", "YTA and a hussy apparently", "Wow. That's a lot.\n\nYou kept the engagement ring!?\n\nWhat says your soon to be husband to that?\n\nChild and ex boyfriend are past of your life. I feel in the future you will be sad not to have them both at this important day.\n\nYTA (softly)", "It is wise of you not to invite some one with romantic connections to your wedding.\n But are you sure that you guys are really over . From your post i get a vibe that there are a lot of things under the surface that you are trying so hard to bury but not very successfully. NTA by the way ita your wedding. But you will have a lot of drama wether you invited him or not", "A gentle YTA.  You don't OWE him an invite, but if your fiance doesn't mind and he is a close friend - even without considering him buying the ring and being the father of your child - it would be the kind thing to do.  I'm sure he will be very hurt if he isn't invited, and it will likely affect your friendship going forward.  Are you ok with giving that up just because you are concerned what other people will think?  I'd be more concerned about inviting people that you think would judge you for being friends with your ex.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI recently got engaged to my current boyfriend, who I have been with for  over a year. However, my engagement ring was actually paid for by my  ex-boyfriend, who I dated for three years before breaking up with him.  We ended things on good terms and he has been very supportive of my new  relationship. We also have a child together, who he is very involved in  raising. Despite the breakup, we have remained close friends and he is  one of my closest confidants. However, now that I am planning my  wedding, my ex is asking if he can come. My current boyfriend is okay  with me inviting him, but I feel like it would be inappropriate and  uncomfortable to have my ex at my wedding. I'm worried about how it will  look to other guests and I'm not sure if I'm ready to see him in a  romantic setting again. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[deleted]", "YTA\nHim paying for your engagement ring is TOTALLY weird. \nYou have a child together.\nGrow up.", "So you can be close ,being your confident and have him in your life but not in your wedding? It's non sense so yeah YTA !", "[removed]", "YTA, for all the reasons you listed AND because you had to ask.\nYou win my Asshole of the Day award. Congrats.", "YTA - BIG TIME!!!  It's interesting that your ok taking his freaking money but not ok having him around. If you don't invite him you should give back the ring you weirdo.", "Yta and Yta for not giving that engagement ring back. Using that with current boyfriend is asking for a bunch of bad ju ju. How is this not jinxing the marriage?", "YTA. He paid for your engagement ring? That's weird. That's the only part of this that's weird. Him coming to your wedding if he is your friend and your fiance doesn't mind is not weird.", "YTA the only person who thinks it is inappropriate to have the father of your child at your wedding is YOU. You need to dig deep and be honest with yourself about WHY this bothers you.\n\nAnd while you’re at it, return the engagement ring or have your fiancé pay your ex for it. Your ex paying for another man’s engagement ring is beyond weird.", "If current finance can't pay for a ring, he can't afford you and a child (from a past relationship).  Hard pass on this.  YTA.", "YTA. He paid for your ring, is the father of your child, you’re on good terms, and your fiancé is fine with it. All things considered it seems weirder to *not* invite him. \n\nIt’s inappropriate to accept things from him, use what he bought, and have the dynamic with him yet not invite him over…what others may think? Residual awkwardness that indicates you may not be over him enough to get married? I really don’t get it, especially when you have a child together.", "So your ex purchased your engagement ring for your fiancé but he’s not good enough to come to the wedding. YTA.  I don’t understand how you think it’s appropriate for one man to buy your engagement ring to another man.", "YTA- You're contradicting yourself... is he your best friend or not? Why is it OK for him to finance your engagement ring but you have weird feelings about him coming to the wedding? You're contradicting in your description of your relationship with him.", "I’m so confused. Ex bf buy ring. I’m lost for words. This has to be fake bc it’s so weird and ridiculous", "YTA his money is good enough for you but not his company lol", "You can have him be your best friend and buy your engagement ring but he can't come to your wedding? I am not sure what the logic is here? You can't have it both ways. \n\nYTA\n\nWhy did he buy your engagement ring?", "YTA", ">I'm worried about how it will look to other guests and I'm not sure if I'm ready to see him in a romantic setting again.\n\nWhat? Did I read it right? You are NOT SURE whether you are ready to see him in a ROMANTIC setting again? Can we please note that the romantic setting refers to OP's MARRIAGE to ANOTHER man? Are you sure you are over the relationship? Isn't that the actual question here? That's a marriage not a date or fancy dinner with just you two, smh.\n\nYour soon-to-be-husband is cool with it, your ex is cool with it, you are the only one trying to create drama... or deep down, you are still not over your past relationship and still try to marry someone else. In both cases big time YTA.\n\nThe only question you have to ask yourself is: Why do I feel uncomfortable inviting Ex to my wedding although everyone else is okay with it? Look past this \"not ready to see him in a romantic setting\"-BS because that is not the real reason. It's also not the reactions of the guest because guest don't care about that and most guests would consider it cool that baby dad and new husband are in an amicable relationship. (And has anyone else wondered why OP is concerned about the guests' reaction about her ex' appearance at the wedding but is cool with the fact that ex bought the engagement ring? That's cognitive dissonance right here.) There is a technique in coaching that's called the \"5 W's\". It is usually used to get to the real motive of a client's request. So ask yourself the 5 Why's and look why you *really* don't want to have him at the wedding.\n\nEDIT: Forgot to explain how the 5 W's actually work. So in this example: \"I don't want to invite my ex to my wedding because I'm not ready to see him in a romantic setting?\" -> Why? (the first why) -> \"Because XYZ\" -> Why? (2nd one) -> \"Because of this ABC\" -> Why (3rd one) ... until you reach the 5th Why and answer that.", "YTA\n\nI'm not sure I understand it all here.  BUT, one, the engagement and wedding rings should be from the individuals getting married, or from their families.  The engagement and wedding rings represent the love each has for the other, at least in most cultures.  You could even choose to go ringless.  But, to use the ring your ex bought for you?  Eww.  I can't even fathom your new fiance being ok with it.\n\nThe father of your child attending the wedding is perfectly normal, and probably not unusual these day.  If he's a fully involved co-parent, his absence will actually suggest something is weird. \n\nFrankly, you've got it backwards.  Return the ring, or save it for your son to use.  Ask your current fiance to buy a ring for you.  Invite your ex to the wedding, tell him you'll be happy to have him there, but your attention and time will be focused on your new husband.", "YTA and an absolute train wreck", "YTA and I feel horrible for both your ex and the person you're marrying. The fact that you're calling him your \"current boyfriend\" and not your fiance but you're okay with letting your ex pay for your engagement ring to someone new, and you're not comfortable seeing your ex in a \"romantic setting\" are enormous red flags. It also sounds like you're concerned about needing to keep the peace in the co-parenting relationship with your ex, which is another, redder flag.\n\nIf you and your fiance are not in counseling, you'll need it soon, because you can be pretty damn sure he is harboring a lot of resentment that he's afraid to speak up about, because you're apparently manipulative enough to get your ex to make a huge purchase on your behalf as a gesture of romantic faith.\n\nINFO - is there a cuckolding/throuple agreement between your ex and your fiance that you didn't mention?", "YTA. The whole my ex bought my ring, you can marry another man and wear exes ring while doing so?", "Sounds like she’s forcing this new man to marry her and he must not have the funds…. Cause ain’t no way!", "YTA - if he can buy the ring for you to be engaged to another man and you not be worried about discomfort or how it would look to others he should be invited. You’re also an AH and shouldn’t be getting married if you’re worried about seeing your ex in a romantic setting….. while you marry another dude.", "You're wording is interesting. Why is he your 'current boyfriend', and not your fiance?", "YTA- what man in his right mind would allow another man to pay for his futures wife engagement ring?  If you don’t get married who gets the ring, ex fiancé or baby daddy?\n\nIf you truly are over the baby daddy and good friends now then there should be no reason not to invite him. \n\nJust feels like you still have some feelings for him.", "Easy YTA. This man isn't *just* your ex. He's supporting your relationship, is pretty much your bestie... paid for your ring and is a good parent to your child.\n\nI would be *ashamed* to even consider not inviting him. It sounds like he's contributed more to your wedding than your fiancé did.", "If you’re not ready to see your ex in a romantic setting why are you marrying someone else?", "YTA. If you’re still at the point where you’re not comfortable being around him in “a romantic setting”, you’re not over him and not ready to marry someone else. Oh and how on earth are you still wearing his engrangement ring? Who are you marrying here?!", "Info: how and why did he pay for the engagement ring? \n\nAlso, why do you think that your wedding to a whole different person constitutes a romantic setting?  Like, he's a guest, not your date (or the groom).", "Man support a family without realizing", "INFO: are you saying your ex \"paid for your engagement ring\" because you kept a ring he bought you before you broke up, and you're using it as your engagement ring? Or did he actually give money to your current fiance to buy you a ring?\n\nI'm inclined to say YTA either way. If you're uncomfortable about seeing him in a \"romantic setting\", you clearly aren't over him and shouldn't be marrying someone else.", "NAH. I think what's really throwing me for a loop is being comfortable with using his money/ring for such an intimate and integral part of a wedding ceremony, but not being comfortable with him being present for the part where you are using it as a symbol of your marriage to someone else. \n\n\nYou are allowed to feel like you don't want him there, but you risk coming across as someone who is willing to use your ex for his money - at best. At worst, you come across as someone who is still incredibly entrenched with their ex and doesn't feel comfortable with him being present at your wedding to someone else because it should have been ex and you can't handle addressing those feelings so you choose to remove the trigger. \n\n\nI'm not saying either of those is TRUE. But it could certainly appear that way, and this whole situation is just begging for drama and gossip. If that's your jam, go for it. If not, you should probably rethink the ring at the bare minimum. Then decide the deeper reason for why attending your wedding was the first boundary you wanted to enforce.", "He could watch your child at the wedding for you.\n\nI'd invite him.", "It all sounds toxic, selfish, and entitled.", "YTA - this is concerning on so many levels. I really don’t think you are ready to be getting married based on some of your statements. Maybe you and your fiancé should really look at your relationship - I can see this getting out of hand fast.", "You're weird. YTA", "I need more info on why he paid for your engagement ring before deciding if YTA or NTA", "YTA. If you thought highly enough of him to consider him good enough to potentially be your life partner, why wouldn’t he be good enough to be a good friend that you would invite to your wedding? I’m still very good friends with quite a few of my exes because they are some of the best humans I know and would invite them all to any milestone event.", "This is bait, theres no way this is real", "Not going to pass judgment, but I find it very heartwarming that you've had a breakup and maintaining a good relationship, and your new betrothed is supportive rather than jealous. That's super healthy and will avoid adding even more stress to your child.", "NTA. I would suggest a different ring, or no ring, though. That your ex paid for it seems inappropriate to me.", "NTA  \nBut if you, your fiance, and the ex are all comfortable with him being there, who cares if the other guests are uncomfortable? Ask yourself why those guests might be uncomfortable and then you can decide if those reasons are valid or not. The only valid reason I can come up with is it was an abusive relationship. Other than that, why let other guests decide who is or isn't welcome?", "Don't listen to these people lol. NTA, first of all, it's your wedding, you are allowed to invite or not invite whoever you want. I think your future husband is really lucky that he met someone who is considerate enough to see that inviting their ex to their wedding would be questionable at best. \nThe only thing is, you should really pay him back for thah engagement ring, for all the reason everyone has posted above.", "As an woman whos ex got married. I was willing to go to show my kid i supported his dad and the relationship. My ex wasnt comfortable with that. And i was aok with this because i could show my kid at home that i supported his dad. I think this is a comfort thing. Not everyone is comfortable having the ex there. And thats ok imo.  NAH", "He’s your child’s father. Anyone who thinks it’s weird and tries to tell you that needs to get over themself.", "And you’d be uncomfortable seeing him in a romantic setting… eyebrows raised.", "This!!!!!!!", "YTA I was thinking the same thing.", "I am struggling to determine if I am the asshole in this situation because I can see valid arguments on both sides. On one hand, I believe that my decision not to invite my ex to my wedding is necessary and considerate given the context of our relationship and the potential for discomfort and conflict. My ex and I have a child together and are still close friends, but our dynamic has changed since the end of our romantic relationship. My current boyfriend is aware of the situation and is supportive of my decision, which I believe shows respect for all parties involved. I want to prioritize my own comfort and the overall dynamics of the wedding, as it is a personal and important event for me. However, I also recognize that my ex might be hurt by not being invited and that my decision could be seen as selfish or unfair. I am unsure if I am the asshole in this situation because I am struggling to balance my own needs and desires with those of my ex and the potential impact on our relationship. I am open to hearing other perspectives and considering different points of view.", "I understand your perspective, but I do feel ready to get married. I just want to make sure I handle this situation with my ex in a way that is respectful and considerate of both of our feelings. It's a difficult balance to strike, but I'm trying to figure it out.", "Agreed. What sort of friendship is this where he buys her a ring but can't come to the wedding?", "This is the only question I have!!!", "I'm stuck on this. I guess I'm confused on whether he bought it for her for THIS wedding? Or is this a reuse?", "Yeah, I’m wondering the same thing. Are they just recycling the ring?", "Info: can he pay for mine too?", "INFO. also really wondering this.", "Yes, just how?", "Thank you for your question. The circumstances surrounding my ex's payment for my engagement ring are complex. To provide some context, my ex and I were in a long-term relationship and were engaged at the time he purchased the ring. However, our relationship ended before we were able to get married. Despite the end of our romantic relationship, my ex and I have remained close friends and co-parent our child together. He offered to pay for the ring as a gesture of goodwill and to support my current relationship. I understand how this situation might be confusing or seem inappropriate to an outsider, but I hope this additional context helps to clarify the circumstances.", "Not sure if OP cares about others judgement or that anxiety is from her own feelings because she’s not ready to see him in a romantic setting…", "> Clearly the post-breakup maturity is purely one way and you left a good dude for what seems like a decent dude, and from the attitude in your post, you deserve neither.\n\nLove this!\n\nOP you’re making issues where there’s none. YTA.", "I'm not sure if I'm ready to have my ex attend my wedding, but I also don't want to hurt his feelings or jeopardize our good coparenting relationship. I'm not sure how to balance these conflicting priorities.", "Thank you for your understanding. I value my ex's friendship and hope that he can understand my decision not to invite him to my wedding. I am trying to respect his feelings and do what is best for all parties involved. Thank you for your perspective.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "This doesn't sound like a healthy relationship, this sounds like she's willing to use his friendship and resources when convenient but not reciprocate.", "It would be heartwarming if it went both ways. Her attitude suggests that her ex is a stellar guy who is deserving by her own words. Her actions indicate that she is a receiver and not a giver and is fine taking his time and money but makes zero effort on her own. Her ex is mature enough to be an adult, that’s heartwarming. OP has the attitude of a child and in an adult that is just off putting", "Thank you for your kind words. I am glad to hear that you view our situation as heartwarming and healthy. It has definitely been a journey to get to this point, but I am grateful that my ex and I have been able to maintain a positive relationship for the sake of our child. My ex has always been a supportive and involved co-parent, regularly attending school events and extracurricular activities for our child. He has also been understanding and respectful of my current relationship, and has even offered to help with wedding planning and other logistics. I am grateful for his continued support and the positive role he plays in our child's life. I also appreciate the support of my current partner, who has been understanding and accepting of our unique situation. I believe that this positive dynamic will benefit our child and help to minimize any additional stress in their life. Thank you for your understanding and support.", "Yup. She’s not over him.", "Why aren't you uncomfortable with him buying your engagement ring - arguably one of the most romantic purchases a person can make.  You're comfortable taking his money to get engaged, but not comfortable inviting him to the wedding for the same engagement?", "if you don’t want your ex there, you and your fiancé need to pay him back *for your engagement ring*. it makes it sound like your ex is good enough for you for paying for your engagement ring, being a good coparent, & being a good friend, but he’s not good enough to be at your wedding.\n\nYTA and tacky af for your fiancé being ok to use your ex’s money for your engagement ring but not letting him at the wedding as a “good friend.”", "The only unfairness here would be marrying your fiancé while you are still hung up on your ex. The fact you aren’t ready to see your ex in a romantic setting is quite telling. And that your ex purchased your engagement ring to your fiancé is bizarre.\n\nYou aren’t obligated to invite anyone to your wedding. It isn’t selfish or unfair to not invite an ex. Most people don’t. If you don’t want him at the wedding, don’t invite him. It’s unlikely any of the guests would even notice his absence. If your ex is at the wedding, guests will likely think you have a good coparenting relationship and nothing more. This is a decision strictly between you and your fiancé. Your ex’s “needs and desires” are (or should be) totally irrelevant when it comes to your wedding to another man.\n\nA great coparenting relationship should have boundaries, especially when it comes to each other’s separate romantic lives. The lines here seem too blurry and it isn’t fair to tangle someone else up in it.", "What sides though?\n\nYour ex wants to come and is supportive, your current boyfriend is fine too. There are no sides. And he’s the involved father of your child, not some random dude you banged. Presumably he’s going to be there with your son too. \n\nIf your ex is fine seeing a ring paid for you by your ex on your finger every day, and a little fusion of you and your ex’s looks watching Peppa Pig in the living room, I think he can cope with the ex in the back of the room. You’ll both be so busy you’ll unlikely get to speak for him more than 10 minutes.\n\nNo, you’re scapegoating the wedding for the real problem: you’re so enmeshed with your ex and have rushed headfirst into another commitment with a new man before you’ve truly disentangled yourself fully emotionally. You went straight from lovers to best friends, and even though you may love this new man, you never gave yourself long enough to move on. *Thats* why it feels weird seeing him in this romantic context. \n\nYou should really consider postponing the wedding and having a nice long engagement. You owe it to all 3 of the main guys in your life to truly sort out your feelings and appropriate boundaries before you sign up your kid to a new stepdad, and your new spouse to a stepkid with a woman who’s not fully disentangled emotionally from the father of her child", "YTA,  You can stop struggling.  You used me, my or I at least 15 times in your short paragraph.  You are fantastically self involved, which is why you are \"struggling to determine\" if you are the asshole in this situation.  Stop using people with the same carelessness as you use the first person.  This isn't your movie.  Your ex isn't an extra.", "you’re really odd for being okay with taking his money which i’m surprised your fiancé didn’t have a problem w either and not inviting him. YTA", "Struggling? Let us help then, YTA, Massively", "Why don't you invite him to the reception if you're both past it and at the point of being genuinely friends? It sounds as though you have some feelings there that he may not .", "This answers nothing.", "Basically, you are comfortable using him.", "I think you should have had this debate before he bought the engagement ring for your fiancé and you. YTA.", "It is respectful to invite your child's father.", "If you’re comfortable enough to have your ex pay for your engagement ring, you’re comfortable enough to invite him to your wedding.", "You feel like you're ready, but neither you or groom-to-be could afford a ring? Get a grip.", "What balance? You're over him. (Allegedly) He's over you. He asked to come see you off and celebrate your special day and you're saying no. For reasons.\n\nYou keep giving non answers that aren't giving any reasons as to why.\n\nWhy is it uncomfortable to be around your \"best friend\"?\n\nWhy is it uncomfortable to have the father of your child involved in a moment of family blending?\n\nWhy are you comfortable with taking his money to help jumpstart your special and involving him in the process, but uncomfortable with him being there?\n\nWhy are you the only one uncomfortable?", "Why are you rushing this? You’re not over your ex, you’ve only been with this man for a year, and most importantly, *you have a child*. Slow the fuck down. \n\nYTA", "It sounds like you're the only person with an issue here.", "Six uses of I, me or my in three sentences.  Three uses in one sentence.  Balance is easier to strike if you acknowledge other people exist.", "It's extremely disrespectful and inconsiderate to not invite him to your wedding considering you let him buy your engagement ring. Why is it okay to take his money but not allow him to attend the wedding? You are taking advantage of his kindness and I hope he wakes up soon.", "Pay him back!", "The kind of friend who is more than a friend in the bride’s eyes. I don’t think she’s over him but telling herself that she is.", "Is there an alternative life style involved here? Closest confidant with an ex and child and so on sounds at minimum that one or both haven’t moved on fully.  Reusing an engagement ring is extremely strange", "Info: can I also get in on this?", "Uh, no. That still sounds extremely strange and inappropriate.   Your wedding rings should come from your future husband and ONLY him.", "So you're wearing your ex's engagement ring to marry your current partner. That is extremely weird.", "PAY👏🏼THE👏🏼MAN👏🏼BACK👏🏼FOR👏🏼THE👏🏼RING👏🏼IF👏🏼YOU’RE👏🏼NOT👏🏼INVITING👏🏼HIM👏🏼TO👏🏼YOUR👏🏼WEDDING👏🏼\n\ny’all look tacky, cheap, and hypocritical with “oh he can pay for my ring and take care of our kid and be my confidant, but he can’t be at my wedding.”", "How do you do the mental gymnastics to make him buying the ring okay but not inviting him? It seems inappropriate to outsiders because it is inappropriate. Either lean into the fact that you and your ex have an \"unconventional\" relationship or put distance between you two. You just sound greedy here.", "Sorry, kept digging for more info and now on YTA.\n\nJust to give some other perspective. I had an ex who was my friend and was my friends for many years. He was introdused as my friend and an ex way back in the day. There doesn't seem to be any reason for drama unless you bring the drama. He sounds like a good friend and a supportive ex who is the father of your child. Not many people have a good working relationship that is at a level where people would even entertain the idea of inviting an ex to their wedding. In this case though, I would find it odd if he wasn't invited.", "This additional context does *not* clarify anything. You and your ex were previously engaged, so is your current engagement ring the ring your ex proposed to you with and he just allowed you to repurpose it at an engagement ring from your new partner? Did your ex purpose with one ring and then buy a second one for you current partner to propose with when your relationship with him ended? \n\nWhatever the circumstances are, I don’t think the father of your child attending your wedding is that unusual or inappropriate. And it’s really nothing compared to whatever else is going on with the ring.", "Pay him back then, him going to your wedding is as inappropriate as buying your engagement ring, you can’t think one is ok and the other not.", "So was the ring already purchased before you met the man you are now marrying? Was it purchased with the intention of your ex using it to propose to you, then things went south and you split up but you kept the ring and the guy you’re now marrying never bought one because (if we’re being real here) you already came with one? In that case you’re kind of twisting words here. Your ex didn’t buy you your engagement ring. Your marrying one man and wearing the ring of another.", "then you need to return the ring/money if you’re not going to invite him. it’s shitty to be okay with him giving you a large gift but then specifically exclude him from the event he was trying to support. you’ll destroy your relationship with your ex if you do this", "If you don’t want him at your wedding then you need to return the ring and any money he has given you and strictly stick to coparenting.", "If you don’t invite him. Either you or your partner need to reimburse him for that ring.\n\n(Of course, that should actually happen either way)", "Honestly, it sounds like you're still harboring feelings of a kind for him. You don't talk of any ill feelings or resentment which I'd understand.", "If you're not going to invite him, give the ring back and stop pretending to be his friend.", "Wow! six uses of I, me, my in two sentences.  Five uses in first sentence.  This really is your movie.  Enjoy the show at \"my wedding.\"  Are you marrying yourself?", "You sound absolutely ridiculous. Why wouldn't you be ready to have him at your wedding? Unless you still have feelings for him (or that you are using his feelings to take advantage of him like getting him to pay for an engagement ring for your current relationship), there is zero reason to be uncomfortable with him there.", ">I am trying to respect his feelings\n\nHis feelings tell you that he wants to attend the wedding. He literally asked you. So no, this is about you and what you want, not about giving him respect.", "I think it crosses a line when you’re ok with your friendly ex paying for your engagement ring to another man. That’s when it sounds less like friendly coparenting and either taking advantage and/or still having romantic feelings..", "Yeah, I was thinking more along the lines of she sounds like a user who managed to sucker two poor saps into doing anything at her whim. It's really bizarre", "I was seeing this more as the weirdness of it all, since exes are supposed to hate each other, and \"what would people think\" seeing them get along at her wedding to a new spouse.\n\nPersonally, I would invite the man, and let others deal with their own wrong notions of exes needing to hate each other.", "I would suggest, as others have, that you invite him. Anybody else who is weirded out by an ex being there, that's on them, not you.\n\nBut if you are weirded out by it, you need to understand it...the ongoing relationship is not a mere event.", "But not to use the ring he wanted to marry you with!!!", "No, it's complex. /s This is is some impressive mental gymnastics to avoid giving back that ring. I'm sure the ex decided it wasn't worth the battle since they have the kid together.    \n\n\nThis is a YTA for me. This seems like this ex is trying to maintain a friendly relationship but OP is really making that a struggle. This must be some ring if she's willing to use it for a different marriage. Sheesh.", "Sounds sexist I think", "I literally was going to type the same thing. What in the hell are any of these people thinking?", "Him attending the wedding is WAY more appropriate than him buying the new engagement ring.", "Yeah I am struggling to envision how this proposal with the current fiancé went. Did she give him the ring beforehand knowing he was gonna propose? This is extremely odd", "THIS!!!", "Nope.  Spouses should buy each other the rings, the only exception is when they gift family heirloom rings to each other.  Exes buying rings, or using the EX's ring for the wedding is hella weird.", "Lmao", "Yeah friends get invited to their friend's weddings. Friends don't buy their friends engagement rings"]}