{"id": 6518, "submission_id": "103ml3r", "title": "AITA for asking my son & his wife to pay rent", "selftext": "I'm a single dad, my son is 20, as is his wife. His mom has never really been in his life so I truly did the parenting solo. My approach, especially when he got older was that I will give him the freedom to make his own decisions, but, the consequences are his as well. \n\nHe met his now wife when they were both barely 19, 6 months later they were married, he said it was fine, he was in love, she was great. He told her she didn't have to work and, rather than get an apartment, they were living in the renovated basement of one of his childhood friends, paying him rent.  \n\nHe lost his job in November. I will say this, it sounds like it was kind of a shitty situation because the manager who hired him quit a month after hiring him, and it sounds like the new manager was looking to clean house, so, they started with him.\n\nHe immediately calls me, tells me he's fired and wants to come home. I thought at that moment that, this was a massive blow to him, and that I'd be a terrible dad to turn him away. I also figured that he would be super motivated to find another job and get out of my place.\n\nIn the almost 2 months they've lived here, he hasn't looked for a job, nor has she.From what I gather, they sleep until lunch, then just hang out.\n\n When I bring up jobs and rent, he tells me he just needs a little \" breathing room\" or his wife will tell him I need to give him \" time to bounce back\".\n\nYet, when I ask them to do chores, oh, then it's \" I can't do all these chores & job hunt\" and with her it's \" I've never done (insert any chore here). \n\nA couple of nights ago, I told them they were going to start paying rent, whether that means he or she take a job they don't want, I don't care. He argued it would screw up his resume, her response is just \" I don't want to\". I said that they can pay me using their savings. They said that wasn't fair.\n\nAITA?", "created_utc": 1672884770, "permalink": "/r/AmItheAsshole/comments/103ml3r/aita_for_asking_my_son_his_wife_to_pay_rent/", "score": 486, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole for not giving him more time.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You were a good dad, stepping up when he was in this tailspin, but, he is lazy, and his wife, just going off of your post, sounds worse than him. She can't be bothered to step up at all.", "NTA. Your son is acting very entitled and is taking serious advantage of your generosity. Asking him and his wife to pay rent and do chores is the least they can do to help with their upkeep. And seriously, even that is very generous offer; my parents didn’t make me pay rent, but that was because I was going to college/university full time and I was responsible for most of my tuition outside of scholarships/grants/loans. I also still worked almost full time as well!", "Nta. You shouldnt have to support two adults refusing to improve their own situation. Good dad for being a safe fall back when he lost the job, but with neither of them looking for work you are NTA for pushing them to do something more.", "NTA The two of them want an adult life but are expecting the benefits of being cared for like children. Time for them to step up and provide for themselves.", "NTA.", "NTA, and I’m glad this is coming up after two months and not have two years. If they are old enough to be married, they are old enough to provide for themselves.", "He is right it isn't fair...to you.\n\nThey are he and she mooches. They need to pay rent, do house work and be good guests. Otherwise they can start the hunt to  find a fair landlord who will cater to them and not expect payment. Maybe the new landlord can pay them, seems fair.", "OP be firm.  Give them a deadline to get a job and pay some reasonable rent. Or they'll be out. Right now they're just taking advantage of you. NTA", "NTA.  But...\n\nYou just don't start with \"now you have to pay rent.\"  You start with your boundaries.  \"If you are going to live here rent free I expect a, b, c.  If that doesn't happen, pay rent.\"  Give them a timeline, like a day.  \n\nHave you explained that not looking for a job is unacceptable?\n\nIn addition... they are married, I would expect them to be on their feet.  If they are old enough to get married, they are old enough to live on their own.\n\nAnd, as someone with kids similar age (they live at home with clear, specific boundaries that they follow) sometime to love them you have to do the tough thing for them.  They won't realize it's out of love.", "NTA\n\nHe needs to get a job *and* contribute to the household.\n\nHaving a large employment gap is way worse than having a job that you’re “embarrassed” of for whatever reason. It shows you have work ethic and want to be employed, and if you’re transitioning into another field you can tell the hiring manager that you were working at x place until you got the job you really wanted. \n\nAnd if for some reason he’s embarrassed, just don’t put it on your resume.\n\nAnd as for her - she can learn. She’s an adult. The internet exists if she really doesn’t know how to wash a plate or vacuum.", "NTA. A family friend went through something similar and forced his daughter and son-in-law to pay him rent. When they finally moved out, he gave them all the money back plus the interest it had accumulated since he had been putting it in a high-yield savings account.\n\nI'm not saying you should feel obligated to give any of the rent money back, but if you don't charge them rent, they will never grow up and take financial responsibility for themselves.", "NTA - this stuff is literally why people have savings. Not working is one thing but refusing to help out around the house and being unwilling to learn how to contribute is quite another and they are crossing a line with that attitude.\n\nIt would be worth pointing out to your son that having an unexplained gap in his resume will look a lot worse than having taken a “filler” job - employers like proactivity even if it’s not in a directly related field, and he might even find a new direction by taking a job he doesn’t feel too invested in to begin with. It’s understandable if he’s feeling underconfident after his first major setback but that isn’t a reason to expect the world owes him a favour in return.", "NTA. For asking for the rent money.", "NTA dad!\n\nAnd make sure he gets a job and they start helping out before they decide it's time for a cute little baby to play with!", "NTA - but now you have a couple of squatters. Be very careful.", "Nta I love my kids but this wouldn’t fly.", "NTA, it’s a reasonable request and unfortunately you are needing to set firm boundaries. If you could use the money, by all means do so. If this is to help give them the push they need to get back on their feet, maybe you could gift the money back to them at a later time.", "NTA.", "Absolutely NTA. These individuals are taking advantage of your kindness and their behavior towards you and disrespect of your home is wholly inappropriate. It is normal for kids to push envelopes and see what they can get away with, but they are married adults and I encourage you to continue to create (and enforce!) boundaries with them.", "NTA\n\nSet a timeline for when you expect them to start paying rent, draw up an agreement. ie, it's January, and you expect them to start paying rent in March.  Set a timeline for when you expect them to move out, ie, they will move out by August 2023.  Assign chores in lieu of rent?  Keep it simple and direct, and let them sort out who will look for a job and who will continue to be a lazy ass.  Keep in mind, you might eventually have to evict them, are you ready to do that?  \n\nOne thing to consider, if you can afford it.  Take that rent money you're asking for and save it in a separate account.  Then choose how to give it back to them, either as a car, or as a deposit for that apt they'll have to move into, etc.  (I'm not sure you can trust them with lump sum cash though.)", "NTA and if you don't force this you will be enabling both of them. Tell them bluntly that they will pay you $X per month in rent, each of them will have assigned chores, and they have 6 months to be out of your house. No excuses and no exceptions. ANY failure on their parts to do those things prior to the 6 month deadline will result in them being out on their asses immediately (or 30 days if they force you to evict them). Remind your son that he is an adult and you expect him to act like one.", "I would think him having a gap in his resume would look worse to future employers than having some short term/not glamorous job on there. I get wanting a bit of a break, but he’s only 20, he should be working. The time to practice fending for themselves is now, while they have you for backup. \n\nShe should also be working. *“I don’t know how to do that chore”*, holy hell! Then ask for a tutorial, or YouTube it, little girl! I can’t imagine you’re asking them to build something crazy as a chore… but even then, they could probably YouTube it.\n\nAbso-frickin-lutely you are NTA. \n\nMy brother has always been unemployed, even now in his mid 30’s, and my parents made a *huge* mistake in not enforcing that when he was younger and still living with them. I’ve been working since I was 14. The contrast between us is vast. Be firm.", "NTA, he's an adult and so is his wife.  It's one thing if they're trying to get a job and it's a real tight labor market but it's really not.  They need to get off their asses and get going which unless there's some downside unfortunately some will just sit back and enjoy the free ride.", "Absolutely NTA. You did the right thing by taking him in when he was down. Now, he is taking advantage. I personally feel when you get married you have to take on the responsibilities of an adult, regardless if you want to or not. Her saying “I don’t want to” is not only disrespectful, it’s concerning. Stand your ground, it’s not fair for you to have to support 2 20 year olds.", "NTA, they’re taking advantage of you.  What resume?  He’s barely 20. Tough love time.", "NTA - you need boundaries, and they need to experience the consequences of their actions.  You gave the, a place to stay because your son freaked when he got fired.  \n\n20-20 hindsight is a wonderful thing… if instead you had said to your son, son, you are an adult now with a wife, you need to figure this out.  You need to get a job any job to make some income,  there are jobs out there, you might not like it but you have to do what you have to do to earn enough to pay the bills.  son, I need to see your budget.  What is your income and expenses.  If you don’t have one, then since your wife doesn’t have a job, her job is the house work including finances, so have her put together a budget of income and expenses.  You are married now, you have to learn to solve these things on your own with your wife.  And having a stay at home wife is a nice thing if you have the money to afford that luxury, but If you are unemployed and need a place to live, then you were living paycheck to paycheck, and that isn’t sustainable.  What is sustainable is her getting a job to earn some income to build up your savings, until you have 3 months of savings in the bank.  I would also suggest that the income from your wife is what you can use to build up savings for a house, vacations, etc, whi,e your income pays the bills.  This is what adults do.\n\nSo, you didn’t have that conversation before they moved in.  You bailed him out of his mess, so he hasn’t learned the consequences of not having his wife work, which they can’t afford, and it doesn’t sound like she knows how to keep house either.\n\nI would suggest that you tell him, that he is an adult and married,  he and his wife don’t get to lay around and do nothing at your house that you are working to pay for,  they both need to go out and get jobs, any job to start earning income now.  That they have 1 week to get any job, there are lots of jobs in food service. Now is not the time to be picky,  they are unemployed, and they both need to be employed to earn enough to move out.  They are married adults, they chose this.  They need to work and save money to get their own place.  They are no longer kids.  This is what adults do, you get fired, you get another job, any job to pay the bills.\n\nCharging the, rent isnt going to solve the problem, they will just lay around until their savings is gone and then cry that they don’t have any money.  As long as they are under your roof that you are paying for, they need to follow your rules.  If they don’t like it they can move.  The first order of business is for both of them to get jobs, and then show you a budget plan for getting out on their own again.  I would suggest that while they are still In Your house you need to discuss with them career paths and learning marketable skills to get better jobs.  Tradesmen make great money.", "NTA \n\nBut you now have two adult leeches in your house that are egging each other on and enabling each others behaviour at your expense. \n\nYou are in for some trouble my friend!", "NTA. Tough love is what they both need. Give them a timeline, they both need to be working and contributing to the household. His wife needs to work, they are both broke there is no reason why she's at home not working for their own place. Give them 6 months to save and move out, whatever time frame you give them you need to stand your ground.", "NTA\n\nWow dear God, your son is really taking advantage from you.\nOne thing is taking time to recuperate, but two months and not looking for job neither helping with chores? What a lazy mf lol", "NTA. You have a shared list of job opportunities yet? Sounds like he needs structure and a nudge.", "NTA.\n\nSounds like your DiL needs to grow tf up. And your son, too. \n\nI'd give them a month and if they weren't both employed with a goal in life they're out the door. If they're not working at all you should be coming home to a sparkling home and dinner waiting for you every day, full stop. They're taking advantage of you, and it sounds like she's taking advantage of him, too.", "NTA - it's well past time for your son and his wife learn to be adults.  Stop enabling them.\n\nAnd next time your daughter in law channels Bartleby the Scrivener, with her \"I don't want to,\" tell her that she can start to contribute or get out.  And while they are looking for jobs, they have to help our with chores. \n\nYou aren't doing your son any favors by coddling him.", "NTA. You did the right thing by letting them stay for awhile. You’re not in the wrong for expecting help with chores or rent two months later.\n\nTo be fair to them though, 20 is still so young. Too young to be married, possibly too young to be easily making it on their own, and many 20 year olds today still haven’t moved out of their parents house or finished their education or learned basic life skills yet. So technically it may not be wrong of you to help them out a bit more. \n\nBut your son made the choice to move out early, and become a working adult and get married super young. So he needs to learn and accept the responsibilities that come with being an adult. And good parenting requires teaching them independence. \n\nBut It’s super messed up that they won’t even help with chores. That’s a red flag. That to me, is completely ungrateful, worrisome behaviour and without knowing them I can’t jump to conclusions but it almost sounds like they have the potential to become lazy ungrateful people who will just continue to take advantage of you. \n\nSo I think you should definitely set firmer boundaries with them. Chores or rent or they’re out of there!", "NTA \nGive them a deadline and if they don’t start paying evict them. The next thing you know she’s going to come up pregnant", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm a single dad, my son is 20, as is his wife. His mom has never really been in his life so I truly did the parenting solo. My approach, especially when he got older was that I will give him the freedom to make his own decisions, but, the consequences are his as well. \n\nHe met his now wife when they were both barely 19, 6 months later they were married, he said it was fine, he was in love, she was great. He told her she didn't have to work and, rather than get an apartment, they were living in the renovated basement of one of his childhood friends, paying him rent.  \n\nHe lost his job in November. I will say this, it sounds like it was kind of a shitty situation because the manager who hired him quit a month after hiring him, and it sounds like the new manager was looking to clean house, so, they started with him.\n\nHe immediately calls me, tells me he's fired and wants to come home. I thought at that moment that, this was a massive blow to him, and that I'd be a terrible dad to turn him away. I also figured that he would be super motivated to find another job and get out of my place.\n\nIn the almost 2 months they've lived here, he hasn't looked for a job, nor has she.From what I gather, they sleep until lunch, then just hang out.\n\n When I bring up jobs and rent, he tells me he just needs a little \" breathing room\" or his wife will tell him I need to give him \" time to bounce back\".\n\nYet, when I ask them to do chores, oh, then it's \" I can't do all these chores & job hunt\" and with her it's \" I've never done (insert any chore here). \n\nA couple of nights ago, I told them they were going to start paying rent, whether that means he or she take a job they don't want, I don't care. He argued it would screw up his resume, her response is just \" I don't want to\". I said that they can pay me using their savings. They said that wasn't fair.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "Ever seen the movie Parasite", "NTA. I would give them a list of chores to complete to earn Wi-Fi the next day. No chores, no internet. I'd also start only buying food you know they won't eat or putting a lock on the fridge and cabinets while setting out ramen for them to eat for lunch and dinner. Start making it extremely uncomfortable for them so they'll want to work and hopefully move out.", "NTA he's using you and should be making his own way at 20 with a wife.  He's got a man up and take care of his family", "NTA, you need to do more than require rent! They either BOTH get jobs AND pay rent or they are out in 30 days! How ridiculous that he married her before he was old enough to be at all stable but also told her not to work! They both have a ton of growing up to do and apparently staying with you isn't helping.", "NTA. She doesn't want to🤣🤣. Simmer down little girl time to grow up.", "You are definitely not the asshole. You are absolutely right in charging them rent! Stand your ground, they're being ridiculous.", "NTA. Your son and his wife are very entitled and lazy. I actually wonder why your son was fired. Something tells me he didn’t want to work/was slacking off on the job.\n\nThey have to start paying you rent and contributing to your household.", "NTA. Sometimes a big push is the support you need. Also, tell that lazy girl to watch a YouTube video when she says she's never done a chore.", "NTA. You don't \"bounce back\" by just chillin'", "YTA, only two months? Do you really expect your 20 year old son to have everything in order in his life?", "You also have to think about the fact that his son actually told his wife that she didn't have to work.\n\nAnd now he is expecting his dad to support his wife who refuses to work.\n\nI agree. This is definitely going to end up in a clusterfvck situation for OP. His son clearly is immature, as is his wife, and they have no business being married to be honest.\n\nHowever, I vehemently disagree with allowing them to stay there rent free. They need to learn how to be responsible.\n\nI also strongly disagree with OP being forced to support his son's wife, especially since she is lazy, refuses to do chores and work, and she thinks that it is OK for her to leech off her FIL.", "Sounds fair to me", "Agreed, NTA.  The decision is fine but the manner in which the message was delivered could have used a bit more tact as well as exploring other available possibilities like ExCaliNowAZ suggests.", "It also doesn't help that, in my opinion, his wife for lack of a better term, babies him and tells him he's earned as much time as he needs to get back on his feet", "He just wants effort. Any effort. Is being a mooch ok?", "He could have started looking for a job at least, or started doing chores to help out.", "What? Come on my man. Dad isn't being unreasonable here. He's asking son and wife to get jobs and pay rent. Not to have their entire future planned out. SMH. NTA", "Why not?", "Most people start working when they're teenagers", "Wouldn't surprise me that she prefers having him around to relieve the boredom of being home alone with nothing to do.\n\nYour job as a parent isn't over yet and holding them accountable is one of the hard jobs parents get to do.", "Yup. It looks like son and his wife are taking advantage of OP at this point.  Son's wife's response when told to find a job is telling: \"I don't want to\". NTA", "Life isn't fair. It's too bad you didn't require rent as a condition of moving in. Not all jobs end up on resumes but working often looks better than not working.\n\nNTA the only aholes here ate your son and DIL for thinking they can laze about on your dime.", "Wtf?  Please let this be fake.  If not, NTA.  They are adults acting like toddlers.", "NTA, if they are adult enough to get married then they both need jobs and to pay rent.", "NTA. If you do not push they could devolve into freeloaders. If they eagerly helped with chores or anything you could give them more time, but “I don’t want to” is just lazy.", "NTA. Time for the baby birds to fly. You have been very understanding but to continue to allow them to live this way would be enabling them to be overgrown kids for the rest of their lives.", "NTA...But dad... you do know that the pre-frontal cortex takes 10 years to develop, from ages 13 to 23? The pre frontal cortex is the part of the brain that lets you understand that actions have consequences.  Law may consider them adults, but science doesn't.\n\nThese are two children playing house... in your house.\n\nSeems like you've had it rough so far. Seems like there's more ahead.\n\nI wish you all the best.\n\nMay your kids grow up soon.", "NTA you are walking a fine line of being a loving father and enabling them to not take responsibility for their actions. They are old enough to be married they are old enough to be adults and that comes with responsibility. Did he apply for unemployment has she ever done anything. Either put up or get out. You have already gave them breathing room hell she can do music reviews and surveys on her phone is not much but when I was hurt I made $50 a day out of boredom because I hate not being productive.", "NTA  Sounds like they haven't fully baked as adults yet and are going to need the push to do so.   And the \"I don't want to\" is classic teenager response.  They won't get past it unless you stick your ground and shove them out of the nest.", "NTA.  You've given them 2 mths grace, it's now time to sit them down and make your expectations clear.  ie.  Look for work, pay rent, help around the house (you aren't their servant), move out date.  Yes he is your son and you want to help him, but you do not have to support him and his wife just so they can lay around doing nothing.  They are both adult enough to get married, they can work and support themselves.", "NTA... turn off the internet cancel the cable. :Stop cooking with cherse\" \n\nGive them eviction date along with a list of emergency shelters.  \n\n\"Its time to be an adult. Both of you get a job immediately or move out sooner then later. You can choose not to work, but not while on this property..\"", "NTA Tell them they don't have to pay you a dime but they got go now.", "NTA and I think they are riding this Gravy train for as  long as they can", "Stop paying for any non-essentials. If they're accessing any streaming services you pay for, change the password. Cut off their access to WiFi unless they're using it to apply for jobs, and even then only allow them to use it for a limited time each day. Don't buy them any snacks or other extras. And give them a deadline to move out. If they refuse to leave, evict them. They'll get mad and guilt you, but as long as they can mooch off you, they have no motivation to work. NTA", "He can include whatever work experience he wants on his resume. He doesn't have to include Burger King if it's not relevant to the job he's looking for so that excuse is crap as are all the other excuses.", "The answer to never having done a given chore is you tube.", "NTA, \"can't do chores and job hunt\"?\n\nUnless he's mentally or physically disabled, this is ridiculous.", "That's the child you raised.", "NTA. But I have to duh you for even asking. These two don't sound like they're going to make it in life. Enabling them will ensure it.", "They are both 20 years old. Adults and old enough to marry means old enough to get jobs and pay rent. NTA.", "Totally agree. NTA, OP. I transferred to a different office and the elected attorney who hired me retired 3 weeks later. The new elected did the same thing to me and a bunch of others that happened to your son. I had a job within 2 weeks because I hit the ground running. Your son is capable of doing that. He's choosing not to. Beggars shouldn't be choosers and both of them should be working hard to get themselves on solid footing and gladly paying you rent. The wife sounds like a real piece of work.", "Write out a contract with goals together. They can both create their own reasonable timeline on obtaining a jobs, and how much each chores will go towards paying their food and rent. This way everything is in writing, and you’ll agree. Good luck!", "It seems to me that the people who have someone in their life like you really don't appreciate how kind you're being. \n\nMy dad literally kicked me out of my house when I was 16 and my mom blamed me...\n\nIf I were in your son's or DILs position your house would be spotless, groceries would \"magically\" appear and you'd have a hot meal every night...\n\nNTA", "He's 20 and seemingly not a rocket scientist. The only thing that \"screws up your resume\" at that age is an employment gap.\n\nNTA.", "NTA. They need to get they're free loading asses out", "NTA Give them formal, written notice. They will sign a renter's agreement, with rent of $x/month, beginning February 1 - or they will be out of your house on February 1.\n\nI know it's really hard to imagine kicking your son out, but he's not even trying to take any responsibility. Don't know if his wife is a negative influence on him or if they share this deadbeat perspective. Doesn't matter. They both need a cold splash of water. You don't have to be mad at them; just matter of fact. You've offered them support, and they have had a free ride for the past few months. They either used that time well or they didn't; but the ride is over.", "Unpopular opinion: YTA for letting it get this far. Your “technique” of letting your kid do what they want and face the consequences ended with him married at 19, telling his also basically a child bride she doesn’t need to work, and unemployed. “Because management was looking to clean house”… sure. \n\nDespite that, your magical thinking continued and you “assumed” (despite clear evidence your child makes poor, illogical decisions) that your child would be motivated to get a job. \n\nNow you have two barely adults who don’t work, aren’t seeking education, are unable to manage a household, and are MARRIED living with you and pouting about being asked to be adults. \n\nHow do you think your kid found himself in this situation and why do you think the ask of paying rent will fix it? What do you think this way of living has taught them about providing for themselves in a meaningful and independent way? How is this a consequence for them when you appear to have supported and now enabled his irrational, and failing approach at adulthood? \n\nKick them out. It’s time for him to understand the real consequence of playing head of household with a wife is that he is SOLELY responsible for figuring it out. That’s what you claim your approach to parenting is, and might actually teach him something.", "Agreed with everything said here. I’m single, but when I moved back from LA after the entertainment industry tanked during COVID, I had a job within 2 weeks also. I needed to bounce back, and this was me bouncing back. NTA.", "Oh, wow. Honestly, that sounds like an amazing idea.", "I think you made a good comment for OP. I liked what you said.", "Lmao mess up his resume that’s classic", "NTA. sadly it seems like your son has made a stupid decision which is going to cost him. Youve offered to support him as long as he is actively looking for a job and working towards improving his situation. \n\nWould suggest you look at moving them out. Maybe that will open his eyes to the reality of his situation", "NTA.\n\nThey're taking advantage of your kindness. Especially since they're not even helping out around the house.", "Nta. They are leeches", "NTA. They need a reality check. Your son is either naive or stupid or both, to think that at 20 years old they are in a place his wife doesn’t need to work. Especially when there isn’t children+childcare in the picture. Which lets hope that isn’t the next announcement…", "NTA At least the wife is honest. I am cackling over a 19yo thinking that he can screw up his resume. Were you suggesting cat burglary or stripping as occupations?", "NTA pay or leave once kids are married they need to support their family", "NTA", "NTA  \n\n\nYou gave him the breathing room. Two months was very kind. \n\nWhen you do charge rent, charge a reasonable amount (not a bare minimum) and then save half of it to give back when he moves out. That will likely be the only way to get him out.", "NTA. You son decided to get married and advise his wife that she didn’t need to work. He lost his job and hasn’t made an effort to get a new one. He needs to face the consequences of his actions. \n\nTough love is what needed here. The longer he is able to mooch around with no job, the harder it will be to get motivated and get one in the future", "NTA for sure. Yikes.", "NTA - but did you ever give your son advice on any decisions he made? If not, that’s shitty parenting.", "How would working be worse for his resume than not?\n\nNTA though I wonder if making their own mistakes has included useful advice or actually letting them go free range. You can lead a horse to water but you can't make it drink. But if there's no water it won't drink.", "NTA, and it'll screw up his resume even more the longer he stays unemployed, at least with an \"irrelevant\" job he can show that he did what he had to do to pay the rent, any future employer will respect that. \n\nIf they won't do anything, drop them off at a shelter.", "You have yourself a couple of free loaders here and they will not do anything unless you force their hands so given the complete lack of ambition between the two of them I don’t see how you could possibly be an asshole here.  Old enough to get married, then old enough to get a job!\nNTA", "NTA.\n\nLike some others have said, it's time to lay out the rules.  Give them a date and amount for rent, list out the household expectations, and make them sign the agreement or they have 30/60 days to vacate.\n\nHere's the thing, OP.  That's not being mean or unfair, it's actually a loving decision.  It sounds like your son is caught in a cycle of helplessness and passive resistance.  He got married at 19 and doesn't sound like he has the maturity to handle the role he thought he wanted - provider and husband.  It's easier to move back into your home where they can regress and act like teens and not have all these adult responsibilities being a buzz kill.\n\nBut enabling that is not going to help him in the long run.  He has to be able to handle the decisions that he makes and allowing him to hide in your home isn't going to do that.   So he's going to need a firm nudge that will eventually have to become a hard push if needed.\n\nGood luck, OP.", "NTA- rent and chores sound fair. They are adults now.", "It would be reasonable to expect, in that circumstance, that you could tell her that if she wishes to live as a child in his house, or they both do, then you will be treating her as your own child and giving parental advice and instruction for the duration, and expecting her to learn the required chores and/or get a job along with your son. This could include, for example “homework” sessions each evening to ensure they complete a quota of job applications (no matter what for) under supervision.\n\nIf they wish to live there as adults then they can make the required changes themselves with less supervision, and you could offer them a discount on the rent for helping with the chores, but the expectations you set for them should apply to both of them equally and should be non-negotiable.\n\nApart from anything else, they are still quite early in their life together and the lifestyle they have fallen into is one that leaves them open to boredom, low self-esteem and depression in the longer term - but they don’t know that yet because they haven’t the experience to reach that stage, so it’s going to be beneficial to all of you if you help them to avoid the worst consequences of their own apathy.", "I'd still expect rent (and the other stuff), but save and let them use it a start up fund when they move out.", "NTA. And having seen a sibling behave similar I'd be wary of believing his version of being fired unless you know the manager who did it personally. Given his laziness it could be he and said manager were cut from the same cloth and fired for that reason. \n\nMy sibling certainly gave a good story but reality is somewhat different.", "Nta. Buy them a tent and tell them as married adults it’s time to go build their own life. It seems drastic but this level of entitlement is also absurd.", "NTA - They are adults and need to provide for them selves.", "NTA", "NTA. Sounds like they both want to stay children and be taken care of. They need to pay rent including utilities. Life is real", "NTA. Make it clear they have 30 days to either provide rent money or pack up their things 🤷‍♂️\n\nAlso, of his wife refuses to do any housework and has never done basic chores before, why is your son fine with her being sah??? What does she bring to the table other than entitlement???", "NTA, Are you feeding them? Stop doing that.", "NTA. His wife is lazy AF and his is taking full advantage your hospitality.", "NTA most people don’t have the luxury to just not work for months on end with no true employment prospects in sight. Welcome to the real world, son and DIL. It’s also dangerously optimistic for a couple to agree to one of them simply not working and sitting on their ass all day unless they’re a trust fund baby — breadwinners die, lose their jobs, or become ill all the time. They should’ve learned this as it just happened to them.\n\nTime for tough love.", "I think you're NTA.\n\nAnd I'm super-stuck on how a 20YO person have never done a single chore ever.", "Nta. They either pay rent or this is their 30 day notice. End of discussion. No one gets to live somewhere for free.", "NTA. Welcome to reality and being an adult! They need to either work, or help out around the house. The next time she says she doesn’t know how or she’s never blank before, tell her she’s gonna learn today! Grown enough to get married then grown enough to take on the responsibilities of having a family. Don’t feel bad for making them pay rent. Sit them down and tell them things are going to be this way and if you don’t like it, there’s the door. Harsh but life isn’t easy on anyone.", "NTA \n\nYour son and his wife are acting worse than children. If they are old enough to be married, then they're old enough to get jobs and pay rent.", "Yeah it’s crazy she is sah when she apparently has zero idea how to do housework 🤦‍♂️ What does she bring to the table??? Because it sounds like she is just a parasite", "According to my son, she brings, \" being hot\", \" fun\", and \" spontaneous\"", "Doesn't sound like he knows what spontaneous means", "That's his answer?!  Your unemployed son has a trophy wife? 🤦🏻‍♀️\n\nI'd make sure to explain to the two of them that until they can buy a house of their own, (good luck with that,) they are going to have to live in shared housing, IOW, with roommates. No roommates are going to be happy living with two people that don't pay rent and utilities or help keep things clean. Explain to them that you're actually doing them a favor by teaching them how adults manage to live together happily. \n\nNTA.", "So in other words, she brings absolutely nothing to the table 🤦‍♂️ All I can say is yikes, at least these two garbage people found each other instead of ruining someone’s life that is actually a productive member of society 😂😂", "I would make them both get jobs. Either both jobs out of the house, or one out of the house and one as a home maker - clean, cook and do laundry. There is a lot that can be done in 8 hours a day", "“Your unemployed son has a trophy wife?”\n\nLmaooooo"]}