{"id": 6523, "submission_id": "103nqwo", "title": "AITA for Refusing to watch my younger sister for a week?", "selftext": "I’ll try to keep this short, my parents are going on vacation to Jamaica in 2 weeks (I had no idea) and needed someone to watch my 13 year old sister. We’ll call her Jane. Jane has a troubled history already at her age, drinking and doing minor drugs (weed) point is she isn’t trusted.\n\nI get a call from my dad today with no notice of needing someone to watch her. I said absolutely no problem I got it covered and that the only issue is she needs to spend the nights at my house. I live 30 minutes away but work in the area during the work week so it’s no problem to get her to and from school etc. My girlfriend and I have a 3 month old and I will NOT leave her for a week to care for a baby by herself.\n\nMy dads response was “Jane won’t like that but I’ll think on it for a few days.” He offered to pay me $150 a day and I declined.\n\nI call my mother to establish a game plan and her response was “no way are you going to make her wake up earlier and disrupt her life so you can be home”  I was dumbfounded and she got pissed off and hung up the phone on me.\n\nSo my dad calls me again and he’s with my oldest sister, may. May is a clinically diagnosed bi polar. She is unpredictable and overall a very bad person (I have very little contact) hence why they asked me to watch Jane. \n\nMay is in the background saying “ew no way he lives in the ghetto Jane isn’t staying there” when she lives in a shitty apartment on the shitty side of their city. I live in a farm town with about 6k population. I don’t even know where she got that from? We’re Very safe. May also has done every drug in the world and is of the mindset that “I did drugs at that age and I turned out fine” great person to stay with right? \n\nI got so sick of it I said “dad I’m so sorry to add stress to this but I’m done, count me out I will not be helping. I will not stand mistreatment and being pushed around. Once again I’m sorry but this isn’t how it’s gonna work”  and he was confused and I hung up the phone.\n\nI feel bad for not being the one to help when I know I’m the trusted person in the family to take care of things but I refuse to be pushed around over a 13 year old who won’t sleep on a different bed for a week, she’s extremely pampered and it shows via my mothers attitude about the situation. I’m torn on this one but I laid my foot firm. \n\nIt’s amazing to me that they put that much drama out all because Jane would have to wake up a half hour earlier to get ready for school, and not sleep in our spare room, but they want me to uproot my life for a week so I can play babysitter when I have much more responsibility, I can’t just get up and leave for a week. \n\nAITA for refusing to watch my sister?\n\nEdit: I forgot to include they also need care for there 2 dogs which I adore them and they love coming to our property they like to run out and be free. Once again I had no issues with the dogs coming as well but I was told by mom “that’s to much”", "created_utc": 1672887953, "permalink": "/r/AmItheAsshole/comments/103nqwo/aita_for_refusing_to_watch_my_younger_sister_for/", "score": 318, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I put my parents in a bad spot with “childcare” because I refuse to watch her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. A lack of planning on their part does not constitute an emergency on your part.", "So let me get this straight… you have a newborn at home and they not only asked you to babysit your troubled teenage sister, they think that you’re out of line for wanting her to stay at your house so that you can also… checks notes… help care for your child? NTA at all.", "NTA.  \n\nYou offered a very reasonable accommodation.  You would be providing supervision, a safe stable home, and rides back & forth to school for 5 days.  Your parents should be thrilled. Especially with how little notice they've given you.  Sure the 13 year old 'might not like that' but - tough.  She's 13; she doesn't get to dictate this.", "NTA but your parents sure are.\n\nLet's get this straight- Jane getting up slightly earlier is a huge problem, but leaving your wife with a 3 month old baby isn't? \n\nIf they don't want to have Jane make accommodations during the school week- which objectively disrupting a kid during the school week isn't the best idea WHY THE FUCK ARE THEY GOING ON VACATION DURING THE SCHOOL YEAR?\n\nThey need to actually prioritize their daughter. They're pissed that you won't step up for them.\n\nYou did the right thing OP", "NTA. I’m confused why they planned a trip without first ensuring Jane would have somewhere safe to be… much further out than two weeks. Guess they’ll just have to take her lol. You have your own child to worry about. Let them figure out the situation with their child & maybe they’ll be smarter next time. You already made last minute accommodations for her with a three month old, & they didn’t like it, so that’s their fault!", "Quite frankly, she's not your child and not your responsibility.\n\nNTA", "NTA\n\nIt’s short notice for a long visit. Why not arrange for childcare prior to buying a plane ticket? They’d risk going out of country before ensuring their kid would be cared for?\n\nTheir 13 year old’s needs are not to be placed above your three month old’s (and wife’s) needs.\n\nTheir lack of planning is not your responsibility.", "NTA. I’d still let her stay at your place though when they finally see the light.", "NTA good on you for sticking up for yourself and if your mom has such a problem with where she will be staying then they should just bring her with them", "NTA, your parents are ridiculous, I think they thought that if they turned it into a high pressure situation and made it feel like there was no alternative, you would have to step forward.\n\nI would literally say to them “I’m married with a baby, my priority will always be them, so if you make it a contest, you’re going to lose every single time. Pressure me again and I’ll go no contact for at least six months.”", "NTA— you’re doing the right thing by staying home with the baby. They gave you barely any notice and want it to benefit them in every way. Keep that foot firm", "NTA, but if they call and ask you to reconsider I would agree only as long as there was no pushback about Jane staying at your place. I would probably pushback a little by insisting that Jane have a clean drug test before they leave too, just to make my point. You have a tiny baby and a contact high for a 3 month old or smoke exposure could be very dangerous so you really wouldn’t be out of line. I would still go through with watching her in the end, but I’d make them all work for it a little as a reminder that you’re doing them a favor here and that they should at least be acting grateful. Make the rules Jane will be expected to follow while in your home and under your care clear to her and your parents too beforehand. It really sounds like your little sister could use a good influence and even some temporary boundaries in her life, which is a big reason that I would say to agree when they ask you again to watch her. May sounds like the worst person June could end up staying with when she’s already doing irresponsible things at a very early age.", "NTA.\n\nYour parents shouldn't have arranged their vacation without first arranging for someone to care for their minor child. Buying tickets, and then hoping that you're available to care for her is absurd.", "NTA. It’s not your responsibility to organize where Jane will be while your family is away. It would be different if you were living in the same house as Jane to begin with.", "NTA \nThey can hire a baby sitter, leave her with May, or take her with them. Not your kid, not your problem.", "NTA- your wife and your child are your number 1 responsibility. You offered a generous option that would work for everyone and they refused. Their lack of planning is not your problem.", "NTA it's not your problem", "NTA What was that saying about gift horses and looking into their mouths? I think your parents are about to figure out its meaning.", "I think if you'd have just said\n\nno way are you going to make me wake up earlier and disrupt my life so you can be on vacation\n\nyou'd still be NTA, you were very kind to make them a reasonable offer, and very right to put your own child first.  It somewhat sounds like they never did that themselves.", "NTA - you offered, and were ready to go above and beyond and they didnt agree and then you were insulted. Youve done enough.", "NTA You have your own family and that is, and should be your priority. You are willing to make compromises to help out your parents, but that wasn't good enough for them. They wanted you to abandon your SO and child for a week in order to accommodate them which is unreasonable. \n\nIt sounds like you are a good person who is willing to pitch in, but have healthy boundaries. It is great that you are standing up for yourself, and not allowing yourself to be coerced into doing something you are not comfortable with.", "NTA.  Take the dogs and the rest will work itself out. Your folks have alot on their plates to be running off for 2 weeks without all this sorted already.", "The fact that you have a three month old and even offered to take Jane in for free shows what a good person you are. At the end of the day, it's not your responsibility to solve this problem. Now that you have your own family you need to prioritize them and not feel guilty about it. NTA", "Definitely NTA. Not even close.\n\nYou have your own family now, you have your own responsibilities that are more important.\n\nFirst, they couldn't be bothered to give you proper notice that they needed help with your sister. They waited until the last minute so that you would feel bad saying no.\n\nSecond, they know that you have a 2 month old baby.\n\nThird, your sister is a drug addict and alcoholic and probably also steals.\n\nFourth, they expected you to ditch your wife with the baby and leave her alone for an entire week because your sister should not be expected to wake up a little earlier than usual.\n\nOP, you need to stop letting your parents walk all over you.", "NTA\n\nYou were willing to help on your own (very reasonable) terms. If that’s not good enough for them then they need to find a new solution. It’s not your problem to solve.", "NTA\n\nThe real problem here is your mother, not Jane or the dogs. Your mother's pampering Jane and May is playing along with it. Jane might actually benefit from spending a few weeks under your roof and playing by your rules.\n\nStand your ground - either Jane stays at your place or your parents have to find someone else to watch her. You might want to talk to your dad, without May or your mother around, and explain again that you won't let your mother or May push you around.", "NTA\n\nThey gave you 2 weeks notice when you have a young child, *and you accepted*, and then they decided that wasnt good enough?\n\nYour mom is TA here for getting pissed off on the phone. Asking is ok, telling you certain solutions wont work is ok, not accepting that finding a solution is their problem not yours is not OK.\n\nWell done for being a responsible parent and partner. Tell your parents they should give it a go sometime. [edit: This is meant tongue in cheek, just adding emphasis that its their responsibility, not yours. You mention your dad is always there for you so I dont want to be too harsh]", "NTA your mom is the problem and big sister too, no wonder your little sister is so out of hand. Stand your ground.", "NTA If Jane is so precious that her life can't be disrupted in any way then obviously your parents need to cancel their holiday so that Jane's life can continue as normal. \n\nYour parents seem to have lost the plot and your mother was plain rude to you.", "NTA\n\nTell your dad that your child takes priority over his child. There is no way you will leave your child for a week to babysit his child.\n\nAt 13, why can’t she stay with a friend?", "NTA your obligation is to your family, meaning your wife and child.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’ll try to keep this short, my parents are going on vacation to Jamaica in 2 weeks (I had no idea) and needed someone to watch my 13 year old sister. We’ll call her Jane. Jane has a troubled history already at her age, drinking and doing minor drugs (weed) point is she isn’t trusted.\n\nI get a call from my dad today with no notice of needing someone to watch her. I said absolutely no problem I got it covered and that the only issue is she needs to spend the nights at my house. I live 30 minutes away but work in the area during the work week so it’s no problem to get her to and from school etc. My girlfriend and I have a 3 month old and I will NOT leave her for a week to care for a baby by herself.\n\nMy dads response was “Jane won’t like that but I’ll think on it for a few days.”\n\nI call my mother to establish a game plan and her response was “no way are you going to make her wake up earlier and disrupt her life so you can be home”  I was dumbfounded and she got pissed off and hung up the phone on me.\n\nSo my dad calls me again and he’s with my oldest sister, may. May is a clinically diagnosed bi polar. She is unpredictable and overall a very bad person (I have very little contact) hence why they asked me to watch Jane. \n\nMay is in the background saying “ew no way he lives in the ghetto Jane isn’t staying there” when she lives in a shitty apartment on the shitty side of their city. I live in a farm town with about 6k population. Very safe. May also has done every drug in the world and is of the mindset that “I did drugs at that age and I turned out fine” great person to stay with right? \n\nI got so sick of it I said “dad I’m so sorry to add stress to this but I’m done, count me out I will not be helping. I will not stand mistreatment and being pushed around. Once again I’m sorry but this isn’t how it’s gonna work”  and he was confused and I hung up the phone.\n\nI feel bad for not being the one to help when I know I’m the trusted person in the family to take care of things but I refuse to be pushed around over a 13 year old who won’t sleep on a different bed for a week, she’s extremely pampered and it shows via my mothers attitude about the situation. I’m torn on this one but I laid my foot firm. \n\nAITA for refusing to watch my sister?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA Your parents shouldn't be planning and taking two week vacations when they are responsible for the care of a minor.", "NTA. Your mother might just have to reap the consequences of her own actions and miss her vacation. If I were you, I would let my dad know about the phone call from mom.", "Nta, you are an adult with his own responsibilities", "It amazes me when people expect a solid to be done for them while placing unreasonable conditions for your assistance; also when they get angry when they are in turn rebuked.  I mean, the audacity for OP to turn down an offer to sister sit for free for a week with no notice. \n\nNTA.", "NTA \n\nThey want you to leave your newborn and house to look after a 13 year old and dogs that can both be housed at your house. Also they gave you zero notice. \n\nHahahahahahahahahahahahahahahahahahahaahhaha\n\nOhhhhh man!!!!!!", "This.right.here. I love this saying and I often forget about it. I need to work it into my repertoire more.", "Almost quote for quote what I said to my mother “tough shit, she’s 13 and has no say” \n\nThey live a very “rich” white collar lifestyle and I’ve always hated it, so we moved onto a small farm and it’s not there cup of tea so they don’t visit / stay much.", "Black and white I 100% agree with that. I just know if I ever called for help my dad would be there in a minute flat so I don’t mind helping when needed.They’re just DEMANDING to much.", "I don't think it was a lack of planning but more of ambushing him with this last minute in hopes that he feels forced into doing it. \n\nNTA", "Of course, my doors are always open.", "This.", "I'm thinking part of the reason she wants to stay home is - she might be thinking it's easier to sneak out / sneak friends in if the folks are gone and you're the only one there.  She'd be waking up 45 min early for 5 days the world wouldn't end.", "If they’re “rich” then they can afford to pay a service for a temporary nanny. You are so very much not the asshole.", "INFO:  If they called back and apologized and accepted the very generous offer of her staying at your place would you say ok? \n\nAsking because I'm guessing you're going to be getting this last moment call because your older sister will likely flake. \n\nYou should hold your ground as far as she must stay with you, your first responsibility is to your baby & partner.", "You are good!", "absolutely NTA.  You're a good brother.", "NTA but why did your parents orginise a holiday without sorting child care in advance? \n\ni wont even book concert tickets until i have sorted childcare let alone two weeks away", "NTA... you found a way to say yes but it wasnt good enough. They can work out something that works better for themselves then\nWell done on your NO", "NTA you didn't refuse; they did, because they weren't happy with your reasonable terms", "I can see why Jane is the way she is.. She shouldn’t be made to get up a half-hour earlier to accommodate your schedule and you’re the one with a newborn? GTFOH.", "Your mother sounds dumb. NTA", "NTA. Their demands for how they wanted you to look after their kid and dogs were outrageous.", "They want you to do them a solid, but it comes with many rules and regulations.\n\nNTA as you were willing to provide care for the week", "Only disagree with one thing here- unfortunately June's overly permissive parents are probably the worst people she could stay with. Doubt there is any easy fix for that though. \nSeriously, if waking up a bit earlier for school is already too rough on precious June, how much discipline does she actually get for her actions?", "NTA but it's a bit much to label a 13 year old that has snuck alcohol and pot a \"drug addict and alcoholic.\" More likely a troubled teen with idiots for parents.", "I didn’t mean to imply that the parents are ideal, or at least mom sounds problematic. Mornings are notoriously tough for teens, but if the parents are so concerned about her getting up half an hour earlier they could always cancel their vacation to avoid inconveniencing her /s. Hopefully they start holding her responsible, although that seems unlikely considering they haven’t in 13 years.", "Honestly, this was over the second I read 'three month old'.\n\nNTA. Your priorities are in the right place.", "NTA\n\nWait for the panicked phone call from Jane or even May when something goes terribly wrong.", "Choosing beggars much?", "NTA. You’ve offered an excellent solution, more than many would. Especially with a new baby. Your mothers response was ridiculous. \n\nCongratulations on escaping that dynamic and establishing healthy boundaries ( and on the baby!)! You have the right priorities, good luck continuing to navigate! Seems like LC might be a good choice.", "So cause of where you choose to raise your family your parents don't come to visit there son and grand baby and as for watching your sister honestly I wouldn't want her around my home, 13 drinking and getting high is not a good thing for your family and there who matters. Your mum sounds like a snob, your older sister shouldn't be looking after anyone she clearly can't look after herself and your dad sounds like he just does as he's told by your mum. Unfortunately lc maybe a good idea here for your families sake and your sanity. Your parents should be helping there 13 yo not leaving her with someone who clearly is OK with a child taking drugs but I maybe way off 🤷‍♀️", "NTA having grown up with constant drama as a child until I got out at 19, I made a vow to myself never to accept any more as an adult. Keep your foot down firmly and live a peaceful life.", "NTA, does your mother even want to go on vacation?  You were being more than accommodating.", "NTA. You were clear on your terms in the first conversation so they knew you weren't willing to stay at their place. Getting up 30 minutes early for two weeks won't hurt your sister, so insisting you have to go out of your way to help them is unreasonable.", "NTA! OP, you are truly a good man!  I wonder why your sis cannot get her teachers to give her assignments for the time the parents are away.  I cannot help but to think that getting the sister away from bad influences and indulging parents will be a good thing!", "You were  too for them until they started  with the unreasonable  demands  op. You did say yes and would  have pulled  through  for them despite  the  lack of respect  for your time and more so your family  if they only brought  your sister and the dogs to your home.  If they (your mother and sister) are entitled  ah s then they can get a service  that they actually  pay for your sister  to have 30 min more to sleep  for a week.  \n\nNta at all. Your wife and baby  need  you your  mother and sister  apparently  not. (Beggars  can't  be choosers and they aske you for a favor)", "Yep Sis has plans and OP is standing in the way.", "Oh but it totally would.🙄 I am totally be sarcastic but I as a 13 year old I would’ve HATED to have to get up an half an hour earlier for school. I also had undiagnosed sleep apnea so that definitely played apart in me not always wanting to get up in the morning.", "NTA “no way are you going to make her wake up earlier and disrupt her life so you can be home” \n\nSo it's okay to disrupt your life but not a 13 year olds. Ridiculous.", "Two things stand out for my in this post. OP wrote:\n\n 'Jane has a troubled history already at her age, drinking and doing minor drugs (weed) point is she isn’t trusted.'\n\nand\n\n'I call my mother to establish a game plan and her response was “no way are you going to make her wake up earlier and disrupt her life so you can be home'\n\nOK, so I think we can see why Jane has behavioural issues. She's allowed to do as she pleases and suffers no repercussions for her actions.\n\nNTA, OP. Stand your ground. Your parents need to learn a lesson that they can pass on to Jane - actions have consequences, and people don't always give you what you want.", "NTA.  You told them what you could do and they turned it down.", "NTA. They're being unreasonable, and are trying o cheap out on a real babysitter for someone they clearly haven't put enough effort into.", "NTA. You have an entire life now that's seperate from theirs. You agreed on something that would inconvenience you a lot and they aren't even willing ti be inconvenienced a little. That's on them completely.", "NTA\n\n&#x200B;\n\nBut there is no need for drama: They asked, you offered, they declined your offer.\n\n&#x200B;\n\nSo they will have to find another solution, or not go on their vacation. NOT YOUR drama either way."]}