{"id": 6528, "submission_id": "103gx2l", "title": "AITA for telling my sister not to use a certain name for her baby?", "selftext": "My (M45) youngest sister (38) announced at Christmas she’s expecting her first baby. \n\nPreviously she said it’s unfair to bring children into this world, they are a drain on resources, etc. Even when my wife or other sisters were pregnant, she said this. So we were surprised when she announced her pregnancy, but she seemed happy, so we were too. \n\nShe’s already 6 months along, with a boy, who she wants to call him “Greg” (not the actual name) after our brother, who died when he was 28. \n\nThis shocked me, because my sister and Greg were not particularly close. They got on, but spent the least time together out of all of us. When she was born, Greg was 7. We went to boarding school at 8. Obviously we saw her at breaks, but didn’t really grow up together, in the way we did with each other and our other sisters. \n\nGreg and I were identical twins and exceptionally close. His name is a trigger. I have PTSD from discovering his body. I can think about my brother and his life with not *too* many intrusive thoughts, but when hearing his name I get flashbacks. My sister knows this. I get therapy, but the issue remains. \n\nAlso, my sister would always say she feels naming babies after people is old fashioned. Yet now she wants to do this herself, the exact thing she said “strips babies of their individuality”. \n\nI was really upset by the entire interaction and my knee-jerk reaction to her baby name choice was to blurt out “no, you can’t call him that”. Obviously my sister didn’t react well to this, saying that I don’t “own” my brother’s name and I’m not the only one who misses him. She is right, I know that. But she doesn’t know what it’s like to have panic attacks and flashbacks when hearing his name. She doesn’t know the horrific scene I walked in on. And she doesn’t know what it’s like to lose a twin.\n\n I acknowledge she has as much a right to mourn our brother as I do, but he and I shared a flat, we were always together at home, at school, in the womb. We were best friends. It’s hard enough seeing his face when I look in the mirror, without hearing his name too. I don’t feel “possessive” of him, as my sister claims, but he and I *were* always closest. That’s a fact. That doesn’t negate his bond with our sisters, but we were the most important people in each other’s lives. Does this change because he’s dead? \n\nShe said at least *someone* would be honouring him (a reference to me and our sisters not naming our kids Greg). This really upset me. Life is a constant struggle since he died. Very often I want to join him. Her suggestion that i don’t care really hurt. I admit it was wrong to reply she is doing this whole thing for attention, but she just made all these announcements, on Christmas Day no less, and caught me off guard. She hung up and hasn’t spoken to me since. I’ve tried to reach out several times. \n\nI’m worried I’ve ruined our relationship and/or ruined the name for her. I don’t know what to do? AITA for my reaction? ", "created_utc": 1672870693, "permalink": "/r/AmItheAsshole/comments/103gx2l/aita_for_telling_my_sister_not_to_use_a_certain/", "score": 168, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I automatically responded “no you can’t call him that” when I heard my sister was naming her baby after our dead brother. 2) obviously she can call her baby literally any name she wants and it’s not my place to comment on this. I accept that, and I probably am TA for the way I responded, and phrasing it as a demand in the way I did. But she does know that the name of my dead twin makes me have really bad flashbacks. And she knows that he and I were extremely close. But he was her brother too and I don’t own him, or his name.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "This is truly one of the saddest posts I’ve come across here. I’m so sorry, OP - saying the obvious, NTA, seems insignificant. All I can suggest is you either write to her what you’ve said so well here, or if you think it would be better, ask for a talk and tell her why this would be so painful for you - even tho I agree that there’s something very off in her even thinking this might be a good idea. In either case, I would suggest not speaking at all about her relationship with you late brother. Only tell her about your experience, losing your twin, and having to find him in death; surely she would want a name for her baby that doesn’t carry so much heartbreak. She’s bringing a life into the world, that baby needs the chance to make a wonderful new story all his own, without any tragic weight attached to his name. Again, I’m so sorry for what you went through, and are going through still.", "NTA. But this is above Reddit's pay grade.\n\nI mean, it's true nobody owns a name; but your situation is totally understandable and your sister should be more sympathetic in this regard.\n\nIMVHO, it might be good that you seek therapy to see how you can better cope with your loss. It's clear this has been affecting your life, and I think your brother always wanted you to live your life to the fullest (this doesn't mean you have to forget about him).\n\nI'm so sorry for the things you're going thru and wish you the best!", "NTA\n\nAnd my condolences. Losing a sibling is losing a piece of yourself. Losing a twin? Can't even imagine. A half of you that made you whole is gone.\n\nI get your reaction. It was spontanous.\n\nMaybe someone else of your family, your wife maybe, can reach out and explain the PTSD? Can explain your nightmares? Can explain why you will never forget, never not mourn, and need therapy?\n\nI hope she'll come to her senses.\n\nIf I were her, I would have asked you privately what you think about naming him. Heck, we name our son after a King, a German Emperor, and a Caesar, and we still checked in with every friend of the same name if they would mind, including all the family members, before announcing the name.\n\nIn case of a death, you should check in with the closest relatives. She didn't.\n\nPregnancy hormones are no excuse for being insensitive. I hope she'll come around.\n\nYou won't have another chance than cutting contact else I'd fear. With everyone in the family who doesn't get it.", "You’re not the asshole but your sister absolutely is. My sister died 7 years ago. I miss her but I know for a fact her death was much harder on her identical twin. I will never pretend it wasn’t or that she should “be over it” at any point during our life. They were always the closest to each other since birth. She still cries on their birthday every year. I make it a point to call her every year on their birthday and the day that our sister died. At the funeral, my sister had a woman hug her for a long time while she pretended that she was hugging her twin one last time. She also had a little girl cry because she saw her and thought she was seeing the ghost of her twin. I will never deny that it was wholly more traumatic for her than it was for anyone else and that’s WITHOUT having found her body herself like you have experienced. I am pregnant now and I did consider naming the baby after our sister. Ultimately I am not, but if I had planned to go through with it and found out that my sister would not like that then that would be it. I wouldn’t do it. And if I had hypothetically decided to do it anyway then I know I wouldn’t be able to expect my sister to have anything to do with the baby. \nYour sister is being selfish and inconsiderate of your very real feelings and trauma. I think it shows how much she actually cares about her siblings to begin with. I’m sorry, I wish you the best OP.", "NTA for your feelings. But your delivery left a lot to be desired. Maybe you could write her a letter about how you feel. Leave all the personal judgements out, though. She may not fully understand the depth of your trauma. I hope not. Otherwise, she's being a selfish jerk. But let's hope for the latter.", "NTA.  Your sister sounds so full of herself I don't even know where to begin.", "NAH\n\nI do think she was a bit rude in her responses, but it’s kind of understandable after your bit of an outburst.\n\nAt the end of the day, everything you pointed out is true.  She’s allowed to pick whatever name she wants, and she can grieve and honor her brother however she wants.\n\nBut the same applies to you.  *Your* grief is also valid.  It’s not like you’re not doing the work to make peace with your trauma, but it was *fucking traumatic*.  That shit sticks with you, and it can take a long time to get to a place where you have all the coping skills you need.  \n\nSo, yeah, she can name her kid to honor her late brother if she wants to.  But if she wants you to have any sort of presence in your nephew’s life (and vice versa), then she needs to be considerate of how that name will affect both you and her son going forward.", "NTA\n\nI will add that pregnancy is a highly vulnerable time. You say you are not as close to your sister because she is much younger, she might be wanting to call attention to herself in a effort to recreate family proximity. \n\nConsider getting together with your other siblings and having people explain to her how your PTSD affects you. It’s important for her to know that you will love her and her baby and of course you will be there to with love for your nibbling. \n\nI am so sorry for your loss and hope that your family can all navigate this and welcome the new member with love.", "NTA\n\nI think it's a pain she clearly can't comprehend from her own experience, which is unfortunate. As another commenter suggested having someone else reach out to help explain your reaction might be helpful. \n\nA compromise could be giving her son the middle name Greg instead of first name. For me that is something very common in these situations. I also think she isn't considering how it will feel for her saying his name a million times a day to someone who isn't her brother. Personally that would kill me inside. \n\nI hope you can figure something out. I do think your sister is being quite selfish though and not considering anyone else's feelings. It also feels like she wanted the attention as well.", "NTA.  I sort of get her reasoning, to her Greg was the cool big brother that would drop in for a few months, then be gone again, but to you, he was the other half of your soul.\n\nPlease please please find someone to talk to about this.  You need that more than you need her right now.  And a big hug as well.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (M45) youngest sister (38) announced at Christmas she’s expecting her first baby. \n\nPreviously she said it’s unfair to bring children into this world, they are a drain on resources, etc. Even when my wife or other sisters were pregnant, she said this. So we were surprised when she announced her pregnancy, but she seemed happy, so we were too. \n\nShe’s already 6 months along, with a boy, who she wants to call him “Greg” (not the actual name) after our brother, who died when he was 28. \n\nThis shocked me, because my sister and Greg were not particularly close. They got on, but spent the least time together out of all of us. When she was born, Greg was 7. We went to boarding school at 8. Obviously we saw her at breaks, but didn’t really grow up together, in the way we did with each other and our other sisters. \n\nGreg and I were identical twins and exceptionally close. His name is a trigger. I have PTSD from discovering his body. I can think about my brother and his life with not *too* many intrusive thoughts, but when hearing his name I get flashbacks. My sister knows this. I get therapy, but the issue remains. \n\nAlso, my sister would always say she feels naming babies after people is old fashioned. Yet now she wants to do this herself, the exact thing she said “strips babies of their individuality”. \n\nI was really upset by the entire interaction and my knee-jerk reaction to her baby name choice was to blurt out “no, you can’t call him that”. Obviously my sister didn’t react well to this, saying that I don’t “own” my brother’s name and I’m not the only one who misses him. She is right, I know that. But she doesn’t know what it’s like to have panic attacks and flashbacks when hearing his name. She doesn’t know the horrific scene I walked in on. And she doesn’t know what it’s like to lose a twin.\n\n I acknowledge she has as much a right to mourn our brother as I do, but he and I shared a flat, we were always together at home, at school, in the womb. We were best friends. It’s hard enough seeing his face when I look in the mirror, without hearing his name too. I don’t feel “possessive” of him, as my sister claims, but he and I *were* always closest. That’s a fact. That doesn’t negate his bond with our sisters, but we were the most important people in each other’s lives. Does this change because he’s dead? \n\nShe said at least *someone* would be honouring him (a reference to me and our sisters not naming our kids Greg). This really upset me. Life is a constant struggle since he died. Very often I want to join him. Her suggestion that i don’t care really hurt. I admit it was wrong to reply she is doing this whole thing for attention, but she just made all these announcements, on Christmas Day no less, and caught me off guard. She hung up and hasn’t spoken to me since. I’ve tried to reach out several times. \n\nI’m worried I’ve ruined our relationship and/or ruined the name for her. I don’t know what to do? AITA for my reaction? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA I’m a twin and I can’t even imagine losing her . Your sister probably doesn’t understand how close twins are, only twins get it . It was completely selfish of her to tell you this with no warning whatsoever. I hope you’re able to talk to your sister and get through to her about your feelings", "NTA. Your sister sounds awful.", "NTA... OP I'm sincerely so sorry for your loss and for your hurt. From what you've said, I think your sister might have misunderstood some things. If she truly just wants to feel like your brother is being remembered and honored, I think it's time to have a conversation and be more open about your feelings. Apologize for your reaction - as you said it was just a knee-jerk thing. Giving her the benefit of doubt, your sister may not know just how difficult and painful it is for you to hear that name. There's unfortunately nothing you can do if she decides to go ahead anyway, but talking to all your family members about the impact could get her to hopefully rethink her name choice.", "NTA and sorry to say your sister is a huge one", "NTA. I don’t know what it’s like to lose a sibling, let alone find your twin, but I can understand from your explanation of the situation how this impacts you. It is insensitive and does seem like she is grasping for attention for whatever reason. If she really wants that bad to honor “Greg” in name, she could use it as a middle name.", "NTA. I'm so sorry for your loss. I hope you are getting the help you need.\n\nThat said, I have a terrible...premonition? Feeling? That sister is going to be upset with you down the road, when she wants someone to watch little baby Greg, and you can't because of panic attacks. I sincerely hope I'm wrong, but she sounds completely self-centered.\n\nGood luck. I wish you the best.", "NTA. She could make it his middle name if anything, although I don’t necessarily recommend that.\n\nMy middle name is after someone my mom knew who committed suicide, and I hate having that middle name. It feels like I’m carrying around a weight. My mom made her friend’s name my middle name because she felt so much guilt about her friends death, that she wasn’t able to prevent it. She basically passed the guilt to me by giving me the name. \n\nI had an ex who was named after his uncle who died after being hit by a drunk driver at 19. He hates being named after his dead uncle. He told me that hearing his name at family gatherings always makes his entire family sad, and causes them to start reminiscing about his dead uncle, and sometimes even cry about him, even though he died more than 30 years ago at this point.", "I'm going NTA even though I don't believe you can stake claim to a name. Being that you're twins I could see this as upsetting. I'm sorry about your brother and I hope you can figure this out peacefully.", "INFO:  \"*She doesn’t know the horrific scene I walked in on\"*\n\nWhy haven't you told her about her brother?  Why are you keeping this from her and then get angry when she wants to honor him with the memories SHE has of him?  \n\n\"*she doesn’t know what it’s like to lose a twin.\"*\n\nHave you communicated this with her?\n\nIt seems you have bottled up a mess of things regarding this tragedy which is un-healthy.  Please get counseling so you can get over this and move forward.", "Huge huge huge NTA. I’m so sorry for your loss and that your sister is being so unbelievably selfish", "YTA but my heart goes out. You went through a terrible experience and still have a lot of scars from that. That being said you can’t gate keep grief. Nor can you control your sister’s relationship with your brother’s memory. It’s up to you to get the help you need to move past this. I hope you heal and can honour your brother by being the uncle he would want you to be.", "NTA. I would highly suggest therapy if you aren't doing it already, OP. I would have called your sister NTA too, but her reaction and acting as though you don't care is just hurtful. You both need to understand that you are both grieving, and doing it in different ways, and that neither way is inherently wrong. Yes, you may have been closer to him, but that doesn't mean she's not allowed to grieve too. Once you're at a place where you can talk to each other without hostility, i'd suggest telling her how her child will feel knowing his aunt will never be able to see him or say his name. I'd also bring up the risk of her projecting your brother's image onto her son. I've heard tales of grieving parents naming their kid after deceased loved ones, and then unintentionally putting expectations on the kid to act just like those loved ones. That kinda thing can really fuck up a kid.", "NAH, yet.\n\nYou have very good reasoning to not want her to name her child after your deceased brother; now, blurting it out that way immediately was not a tactful way to handle it, but it doesn't make you an AH, especially because this gets into a very traumatic area of your life. Her comment about someone honoring him was worse, but family pain around grief in an environment where people are reacting quickly in an argument is understandable to me. I get that she would be instinctively defensive as she was clearly excited about this, and just because you don't think she was that close to him, he still may mean a lot to her. \n\nI think if you explain your thoughts to her like you have to us, calmly and while acknowledging her grief, my hope would be she would change her mind (or maybe compromise, would a middle name straddle the line between her being able to honor him while not having to trigger you nearly as often)? Also, I hope she'd apologize for her comment. However, if she still is defensive and unwilling to acknowledge your pain/reasoning, I'd change to NTA (meaning she'd be the AH)", "NAH\n\nShe may not know what's it's like to lose a twin, but yall both know what's it's like to lose a brother.\n\nPeople grieve and honor ppl in different ways. You can talk to her about all that stuff you mentioned but like you said it's her decision. Maybe the name is trigger for you and painful, but maybe for her it's a trigger for happier memories that she shares with your brother. \n\nAll in all communicate and all that shii is important but please don't get angry (not saying you cant be upset) at her if she still chooses the name .\n\nMy uncle Raphael died before my lil bro was born and my dad decided to name him after his bro, and sometimes he'll tell us a story out uncle randomly hearing the name. Theres pain yes but also happiness. \n\nSo ye NAH", "YTA unfortunately. It’s not your place to tell your sister what to name her child. And she was his sister too.", "Sorry but it's not your baby. Sister may not have been \"close\" to Greg, but he was still a part of her life. She thinks naming the baby after him is a good way to honor his life, and she's kind of right. \n\nNow about the PTSD, have you tried getting help for that? I understand that you lost your twin and best friend, and it is okay to grieve about that. However, you cannot stop other people from grieving/honoring him the way they want to. So with that, I say YTA sorry.", "NTA, this is a whole bag of red flags on her part!", "NTA for feeing the way you do and being triggered but have you ever told her that? Does she know exactly how it affects you? Maybe a calm conversation with just you and her over coffee would do some good.", "NTA\n\n\nYou don't need to name a child after him to honor him. You can do that by remembering him when you feel able and by living your life. \n\n\nLosing a loved one, a family member, can do things to you and your mind. Fuck up your emotional state. That adding to a pregnancy. She might be more emotional over the loss that she's shown. But with knowing how the name, right now, affects you. It would be very careless and hurtful for her to do so. Do you think she had wished she were closer to him during his life and this is her way to get closer with him gone? \n\nUltimately your sister will chose whatever name. But you are NTA for having this reaction to *this* name because of *that* reason.", "NTA but I think you need to sit down with your family and explain to them how his death has actually affected you, they obviously dont understand the deep trauma and depression its caused. \n\nBut talk to your therapist about it first and if they agree ask them to facilitate a family conference, do not try talk to your family about your trauma without a trained professional there to mediate, this is crucial for you and your wife as she is affected by this as well so she should be part of the conversation not the mediator, as I am sure she would try do to as she obviously loves you and wants to help you.", "In my family, all the oldest male children are named after my grandfather.  So I have cousins called Peter Jl, Peter H., Peter 1, Peter 2, etc.  In my own family my oldest brother was named Peter, and he died when he was six months old.  2 years later my parents had another boy and named him Peter, as well.  A couple of my female cousins ending up marrying guys named Peter, too.  \n\nNo one \"owns\" names.  I see all the time on reddit how people claijm someone \"stole\" the name they chose, when it was never theirs to steal in the first place.  Name your kid whatever you want, the only opinions that matter are yours, (and your child's, don't give him/her an embarrassing name they can't take to the playground).", "NAH - apologize to your sister for the knee jerk response (which undoubtedly hurt her feelings, when she prob thought it would be a loving tribute) and talk through the issues. It might be cathartic to share with her and hear her memories of him in turn.", "I think that is a good idea, to focus more on me and him, and less on him and her. I really do want to avoid minimising her relationship with him, because of course they loved each other, they were siblings and our parents were bad, so we only had each other. I know she loves him and she misses him. I don’t want to downplay the validity of her feelings (which I realise I may have done in my post). I will tell her about the physical and mental reaction I have when I hear his name. She already knows that I struggle with it, but maybe she doesn’t realise the extent. \n\nI agree, the baby deserves a name with positive and happy associations, or a name with no associations at all, so he can grow into it. Not one shrouded in misery and grief.", "Yes.  In many cultures one doesn’t use the name of someone who died young for various reasons..including what you said about saddling a child with such negative memories.", "I think she thinks I should be over it already, but my wife says that is just me projecting my own issues onto her! \n\nStupidly, I had avoided therapy for years, but I started it about 8 months ago and it has been really helpful (but also dredging up a lot of very difficult issues). We’ve mainly talked about my childhood S A, but I do need to face it eventually and talk more about my brother. I have been avoiding opening that box, tbh, because it is just too much.", "It was completely spontaneous, you’re right. It was a complete shock that she was pregnant, let alone so far along, and then the name announcement was just so much. If she had told us (or ASKED, like you say!) beforehand, then we could have had time to prepare and I could have responded diplomatically. Instead she makes a group announcement on Christmas Day, via video chat with over 20 people in total. I don’t know what she was thinking. My in-laws were there and witnessed the whole exchange, my wife had to take my 5 and 6 year old kids out for a post-dinner walk, so that I could have a chance to cry and hyperventilate and then to try to get back to normal for them coming back. It was so selfish of her to choose to tell us like that, and like you said, it was insensitive. \n\nI very much hope she changes her mind and she doesn’t keep ignoring me. I love her and it is so sad if she won’t let me be a part of her new family because of this.", "This ^^^\n\nShe doesn’t own a name but maybe her sister doesn’t understand her trauma. \n\nBoth need help with this", "That is what my wife thinks too, that this is my sister’s misguided attempt to be closer to us. She should know how badly I am affected by the name and the associations, but maybe she thinks because it was so long ago I am fine now. And I probably *should* be better with using his name, because it’s been nearly 17 years, but I just can’t. I think it’s maybe because I was screaming his name when I found him, but I’m not sure really. Anyway, you’re absolutely right that I desperately want to be there to support her and my nephew. She lives quite far away from us, but we would love to be a big part of his life, if she would allow it. Right now she’s ignoring my calls and messages.", "Exactly! If it was a middle name then she would still be honouring our brother, but without it having to be used all the time. I would be happy with that, but first name is just too much. And I agree that using it all the time for a new person would just be horrible. To my mind it’s not even a tribute to the dead person, it’s like slightly erasing them, by making the name associated with someone else instead. \n\nI love her, but she has always been someone who enjoys attention, shall we say. Which is fine, if it is trivial stuff, but not something like this. I shouldn’t have said she was doing it for attention though, because I don’t know her intentions and it’s not fair of me to make that accusation. She does love “Greg”, so I don’t think even she would use his death for attention. Hopefully. The baby’s birth will be milked for all it is worth, mind you!", "Well she knows the basics, obviously, like he took his life voluntarily and he died by blood loss. She doesn’t know about his blood spattered up the walls and on the ceiling and the light shade, or the landlord making me get new carpet and underlay, because his blood had soaked through that one. She doesn’t know about him looking so grey and hollow or the way his eyes stayed open and he looked so haunted, but obviously lifeless. Depressed even when he had supposedly escaped it all. Or the way his mouth gaped open and he looked so troubled and contorted and horrible. She doesn’t know he had wet himself and he was still holding the knife because his death throes must have caused him to change his grip and his hand had contracted around the blade, embedding it in his palm. She doesn’t know how much blood an adult man contains and what it looks like when it’s decorating your walls and ceiling. I would tell her if she really wanted to know all of the horrible details, but I don’t see any positive that would come from her knowing all that. I am not trying to keep anything from her, so much as spare her the trauma (although I don’t have enough words to adequately describe his face). \n\nI don’t know how to describe what it is like to lose a twin. I would tell her if I could. It’s your best friend, brother, constant companion, other half. I suppose it’s like if someone removes your soul, shatters it into pieces and gives you just a tiny, mangled fragment back. And really you are just a shell, trying to pretend you’re a person. And every single thing in your life has so many memories of them. And the new things are devoid of meaning because they’re not there to share it. But that all sounds stupid and dramatic and ungrateful, because I am so lucky to have my wife and children, I know I am. I can’t say any of that to my sister, because I don’t want her to think I don’t value my family. \n\nI have bottled up a lot, you’re right, because it’s too hard to say. But she knows I have PTSD (from this and also childhood trauma), and she knows I get panic attacks, nightmares and flashbacks. I’ve told her and also she has witnessed this, and also my five year old likes to tell people “daddy shouts in his sleep”, ha!", "Stupid asshole", "What makes me say NTA is the blatant hypocrisy from the sister. She looked down on having kids and reinforced it when family members got pregnant. Called naming babies after others old fashioned but then does it and shames Op for not naming one of his children after the brother.", "He is the one that found the body. No amount of therapy will fix that. He’s allowed to feel how he feels.", "Dearest OP, i just read through a number of your previous posts, bc I didn’t understand when another comment mentioned how awful things had been with your parents. Sorry to comment again, but I’m astounded that you have survived, not only survived but have concern for your sister - and you’re succeeding in a loving marriage, devoted to your kids. You’re absolutely extraordinary, more than that. I couldn’t help thinking that perhaps one day you’ll write it all out, a few of those posts are truly unforgettable. In any case, I want to say - hold on tight, you’re needed here; and after all the darkness you’ve already had to live through, you deserve nothing but light and love for the rest of your days.", "Hello. Thank you for responding to my note. I didn’t intend to minimize your sister’s sadness, only that the issue of the name is obviously different for you, and she seems not to be getting that. I hope this gets sorted, and that in the long run, you can enjoy this new addition to the family, OP. All the best to you.", "Totally understandable.\n\nI hope you can sort things out with your sister. Perhaps your wife can help by giving her a better idea where your coming from; everybody deal with loss in different ways and your sister may need to get a better picture.", "You need to tell your sister all of this. Whether she wants to hear it or not. This is the only way for her to even begin to have some sort of understanding of what you are dealing with. You are NTA. She is and she needs to know why she is.", "Oh no, sorry, I meant that I had minimised her sadness, not you. I was just trying to say that I like your idea of just having a conversation with her about what he and I meant to each other, and maybe leaving her relationship with him out of it, because I would then run the risk of maybe being a bit like “you barely knew him”. Which would be awful of me (and I feel like a horrible person for even thinking that way). I would be so unkind to make her feel like her feelings are less valid than mine. And I have no idea how anyone else feels anyway, maybe she is just as devastated as I am. \n\nMy wife thinks that my sister is well aware of the fact she barely knew him, and that’s why she is doing this, to feel closer to him. I think that is possible. If she would stop ignoring me then I could try to talk to her about it properly. I don’t know what to do, I guess just give her time and hope she will speak to me soon.", "Could always send her a quick apology email along with a link to this post. \n\n\"Sister, I'm sorry for the way I responded to your announcement on Christmas. Our brother's name is still very triggering to me. When you get the time please read this post I made on reddit and my comments too. I need you to know my trauma.\""]}