{"id": 6534, "submission_id": "103u5k2", "title": "AITA for ‘screwing over’ my SIL?", "selftext": "I (26F) have been married for 7 years. My husband and I were young when we got together, and as a result I became like another kid to his parents (but that’s a story for JustNo) \nAnyways, I never thought of his sister (27F) as anything less than my own. So when she had her kid (2M) I was excited. I’ve got my own kids but I was happy to have a nephew. \n\nSo my SIL lives next door with her parents. The issue is that I’ve become the baby drop off center. ‘I need to run to the store’ turns into me texting her 4+ hours later trying to figure out where she is. It’s always someone else’s fault on why she’s late. I am in college online tho and can’t exactly do my work when her kid is on a sleeping schedule of 2 am- 8 am. My kids attend school and need their sleep (they have a decent bedtime) I’ll also add I have a hard time telling people no (currently in therapy for that among other issues) \n\nBecause of those reasons, when she came to me saying she had a job offer she asked which of 2 schedules worked for me. Didn’t ask if I would be the babysitter. I told her neither did. So we agreed to a schedule where I’d watch him half the schedule and her parents would watch him the other. Usually her parents back out but I told her that wasn’t going to be able to happen. \n\nWell her first interview/training is today. She told me days ago her dad was watching her kid since he’d probably still be asleep. Okay awesome. Then at 2 am the day of she messaged me and said ‘you’re still able to watch him tomorrow right? I hope so cause I have no one else’ I was pissed and I told her so. I told her I’m being taken advantage of and letting me know last minute she wasn’t having her dad watch him isn’t ok. (Dad isn’t sick, just didn’t want to) I told her how is it isn’t right that everyone else can say that they don’t want to and it’s ok cause she knows I have a hard time saying no. \n\nIt ended with her apologizing and begging me to keep him, but I still said no. She told me she will lose the job if she can’t find a babysitter and I told her he isn’t my kid so it’s not my issue. My MIL then messaged me telling me she’s going to straighten me out and that if my nephew is such a bother then I just won’t keep him anymore. She also told me I’m an awful person for screwing over my sister and she expected more from me . \n\nMy husband agrees with me but won’t say anything to his mom and sister. AITA? Should I watch him anyways? TIA", "created_utc": 1672908551, "permalink": "/r/AmItheAsshole/comments/103u5k2/aita_for_screwing_over_my_sil/", "score": 1603, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because my sister will lose her job if I don’t watch him\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\nBoth you and your husband need to stand your ground. You aren't responsible for SIL kid. If your MIL is so upset why doesn't she look after her grandchild? \nBoth you and your husband need to start setting some boundaries with SIL otherwise they will continue to take advantage of you not being able to say no. \nYour kids and your family comes first\n\nEdit to say your husband is TAH for not backing you up here. He may agree with you but him keeping quiet is just as bad. He needs to grow a back bone and speak to his sister and parents", "Massive NTA. She’s taking advantage of you, pure and simple. And your MIL’s behaviour is also appalling. Why doesn’t she watch him? Please keep standing up for yourself.", "You are not going to watch him anymore? OK, MIL, you can do it then and not back out.\n\nStraighten me out? Naw lady, I am straight a line about my personal space and not watching your grandkids.\n\nAwful person? Cool, don't call or message me anymore if I am awful.\n\nNTA.", "Oh my...the entitlement for me is mind boggling. NTA\n\nYou NEED to hold your ground. You weren't planning on having the child and you never agreed to be back up this day. What if you did have plans? They just assume you don't, or that it's not important. Does she pay you, or would she be paying you for these days? I mean babysitting occasionally as a favor is one thing, or both babysitting/helping each other - but regular child care, expecting you to be available as back up on demand - that should be compensated.\n\nShe needs reliable childcare, or a more flexible job. You aren't obligated to do it. And if this happens day 1, you KNOW it will continue to happen and is not something you agreed to or should make your problem.\n\nEdit to add. Your husband absolutely needs to speak up as well. It's his family and he shouldn't let them guilt you or bully you into agreeing. She is taking advantage of you and it's not OK.", "Is she paying you to look after him? Either way, NTA, she's been massively taking advantage of you. You are not her private day care centre.", "Why won't your husband say anything? That seems like a total ah move from him.\n\nYou on the other hand are NTA. Grandma needs some straightening out, though. If she's that concerned about her grandchild, she can be his full-time unpaid nanny.", "NTA.\n\nYour SIL needs to respect your boundaries, and your husband needs to help you enforce them.", "NTA. You’re trying to establish boundaries.  Your SIL keeps crossing those lines.  \n\nYour husband is a bit of an AH for not speaking up.", "NTA  your MIL is just pissy because she don't want to step up so she's trying to guilt-shame you into flushing your boundaries down the toilet.  Don't do it- they'll figure it out and maybe next time not take you for granted", "NTA and they're all taking advantage of you.", "Nta, you're not their personal babysitter. If they so desperately need a babysitter that often, they'll have to hire someone. Again NTA.", "no NTA.   how can MIL say those things to and about you - when she and her husband refuse to watch him??   when she called you awful for screwing over your sister, you should’ve just said right back at ya. Why won’t the two of you watch him - you have the time?   you don’t have other little children to raise (other than your SIL who sounds quite immature)\n\nand I’d call her bluff about them not letting you have him anymore. There’s no way they would do that because then they’d have him all the time. \n\ni mean in a pinch, if you can/want to do it, then do it.  you don’t have to die on this hill, but it should be your own choice.\n\nI too have trouble saying no, so I’m really proud of you for standing your ground. Keep it up.", "NTA it’s time to be extra firm and cut down on any babysitting. They’ve pushed the boundaries so much that to them there are no boundaries. Even as family you are not obliged to do anything and expecting it is an AH move", "NTA\n\nYou didn’t screw her over her Dad did, just keep repeating that to them", "NTA.  Tell you SIL and MIL to FUCK OFF!", "NTA, the only one being screwed over here is you. You’re her free/forced childcare, she doesn’t even provide basics and the grandparents are meddling but not willing to step up themselves? Toxic bunch of AHs. And your husband may not be as bad as them but he’s still an AH for letting you fight this battle alone.", "NTA. \n\nMIL can put her money where her mouth is and have the child herself.  I'd be texting her and asking for more details on how exactly she plans to straighten you out and when it's going to happen, because you'll need to get some popcorn ready.", "NTA \n\nMIL can have the toddler. \n\nYou have kids, schools, a sleep schedule, work, online training. \n\nSay no now. \n\nIt will only get worse. \n\nStick to your guns. \n\nLeave the house. Work from cafes!", "You're NTA but I would say maybe do it for her first day (or even week)on the job but make it clear she needs to make other arrangements after that. You don't owe her that but giving them some notice at least shows how serious you are and that they need to find other options.\n\nAs others have said your husband is massive AH for privately agreeing with you (or at least saying he does) but not having the balls to say anything to his family.", "NTA\n\nShe's taking advantage of you, your husband needs to have your back.  This involves HIS family.\n\nDon't watch nephew.  \n\nDon't be a mat so that others can wipe their issues on you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26F) have been married for 7 years. My husband and I were young when we got together, and as a result I became like another kid to his parents (but that’s a story for JustNo) \nAnyways, I never thought of his sister (27F) as anything less than my own. So when she had her kid (2M) I was excited. I’ve got my own kids but I was happy to have a nephew. \n\nSo my SIL lives next door with her parents. The issue is that I’ve become the baby drop off center. ‘I need to run to the store’ turns into me texting her 4+ hours later trying to figure out where she is. It’s always someone else’s fault on why she’s late. I am in college online tho and can’t exactly do my work when her kid is on a sleeping schedule of 2 am- 8 am. My kids attend school and need their sleep (they have a decent bedtime) I’ll also add I have a hard time telling people no (currently in therapy for that among other issues) \n\nBecause of those reasons, when she came to me saying she had a job offer she asked which of 2 schedules worked for me. Didn’t ask if I would be the babysitter. I told her neither did. So we agreed to a schedule where I’d watch him half the schedule and her parents would watch him the other. Usually her parents back out but I told her that wasn’t going to be able to happen. \n\nWell her first interview/training is today. She told me days ago her dad was watching her kid since he’d probably still be asleep. Okay awesome. Then at 2 am the day of she messaged me and said ‘you’re still able to watch him tomorrow right? I hope so cause I have no one else’ I was pissed and I told her so. I told her I’m being taken advantage of and letting me know last minute she wasn’t having her dad watch him isn’t ok. (Dad isn’t sick, just didn’t want to) I told her how is it isn’t right that everyone else can say that they don’t want to and it’s ok cause she knows I have a hard time saying no. \n\nIt ended with her apologizing and begging me to keep him, but I still said no. She told me she will lose the job if she can’t find a babysitter and I told her he isn’t my kid so it’s not my issue. My MIL then messaged me telling me she’s going to straighten me out and that if my nephew is such a bother then I just won’t keep him anymore. She also told me I’m an awful person for screwing over my sister and she expected more from me . \n\nMy husband agrees with me but won’t say anything to his mom and sister. AITA? Should I watch him anyways? TIA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Wow NTA. I’ve read the comments and your responses and this is just ridiculous. The first thing I think you should do is find out when story time is at your nearest public libraries and you’re going to start having regular appointments throughout the week. You and your laptop can sit where you can see story time while you get the chance to work on school a little while your little one is happily distracted. Absolutely do not tell the family that your new standing appointments are to attend story times though or they’ll ask you to take your nephew too. \nIf your sister-in-law can’t afford daycare then she can apply for programs that pay for daycare. I’m assuming that you’re in the US because of the times you mentioned and I believe that all 50 states have programs connected to Medicaid and Food Stamps and similar programs that pay for daycare costs while you’re working or going to school for low income households. She can do half an hour’s worth of paperwork and take her child to someone who won’t put up with her flaky nonsense.", "NTA! Stand your ground!", ">My MIL then messaged me telling me she’s going to straighten me \n\nI wouldn't take kindly to being threatened like that. \n\n>if my nephew is such a bother then I just won’t keep him anymore\n\nYou don't want to be an unpaid babysitter? Then fine! You won't be *allowed* to be an unpaid babysitter! So there!\n\nNTA. Stick to your guns.", "NTA. What language is ‘straighten you out’ ?", ">So my SIL lives next door with her parents. \n\nThis line is so telling. It's 2 seperate things: \n\n1 Your SIL still lives at home, with a 2 year old. So she's started a family without being able to provide for it for 3 years already. \n\n2 You and your SO moved into the house next to your in-laws. \n\nYou need to move. Put some physical distance between you and your inlaws, as they clearly have outdated ideas about how the world works.", "NTA So it's ok for MiL husband to screw SIL but you aren't allowed? Double standard. And would she do the same for you if you needed help with your kids? \n\nINFO where is child's father? Why can't he watch  half time? If she is single parent and don't have enough money can't she apply for social help(we have it in my country).", "NTA\n\nYou aren't a homemaker. You're a student investing in your career prospects. It feels hypocritical to tell you to put your nephew before your studies to further her career instead.\n\nEven if you were a homemaker I would say that your time is more valuable than MIL and SIL are showing it to be.\n\nHonestly, my mother thought she could have my time on her terms too, now she gets none of it whatsoever.", "Agreed. If op's husband doesn't talk to her parents, they will continue to take advantage of op's inability to speak. This will not end op's problem.", "MIL is one of those ‘I shouldn’t have to, but you should’ people", "We’ve been at each others throats for some serious overstepping she did a few months ago, finally made peace (not made up- I’ll never forgive her for what she did) and now she’s gonna straighten me out because she’s sick of me ‘thinking I’m better than everyone’ lol\n\nThis isn’t the first time she’s said that. It lasted a day before I had my nephew again", "She does not pay me, feed him before sending him to me, or change him before sending him to me. She only started providing diapers when my youngest was potty trained and I refused to buy diapers for her kid, which was an argument as well.", "He thinks that it’s ‘childish drama’ and that it just needs to be worked out. This isn’t the first time hes been like this (and not the most severe situation he’s kept quiet about) but I didn’t want to get the post removed for justnoso behavior", "Sadly they already figured out my issues with boundaries, I’ve watched him since he was 6 months and he’s about to turn 3. More than once she would start dating a guy, leave work to go see him before coming and getting her kid, then ‘fall asleep’ and not be back for hours. Latest was 2 am. Finals week I told her I couldn’t watch him- got guilt tripped into it. They know the background I come from and they use that since she’s a single mom. She tells everyone it’s cause her bd ran off, it’s actually because she told him he wasn’t the dad", "It’s college, but I still have a toddler of my own so I’m finishing this degree so when I go for higher education   in person my toddler will be school aged. She’s already freaking out about that because her free ride babysitter won’t be available. She says ‘you’re the only one I can count on to stick to their word’ but I never gave my word!!", "I already told her that I would watch him from the time she leaves work till my kids calm time before bed (so around 2-7) then her parents would take him till she got off work (11) it was mutually agreed to by everyone, but now her parents are going out of town next week so SIL keeps asking me what we are doing like it’s my job to make arrangements. I’m on my last week of winter break before spring semester starts so they all assume it’s fine", "Stand your ground and polish your spine.\n\nDo NOT take your nephew again.\n\nAs for your MIL, her language toward you more than justifies cutting her off for a while and not allowing her to be around your child. SHE FUCKING THREATENED YOU!", "You need to stand your ground and either tell them that they will contribute or you can't watch him anymore. It seems like she is using guilt and gaslighting to get her way.", "Wow, she really has been using you badly. If she wants you to look after him again (and you're willing and able to do it) give her a cost per hour for the work. If she complains, point out how many meals/diapers/hours she's had for free already.", "I'm sorry to hear that. You deserve a better husband. He seriously needs to step up.", "That’s just an excuse lazy men say when they’re too weak to stand up for their partner", "I don't wanna encourage petty behavior but ... Maybe bd should know that he could be in the picture? Could solve the childcare problem for ya but it's a pretty big bridge to burn... \n\nYeah maybe just stick to setting firm boundaries lol\n\nEdit: NTA by a long shot. When do you get start living life too? You're not a slave!", "You need to curb this now. You have a toddler and uni and a husband. You may have a second kid and a job and your life is tied tk this person who drops off a kid and doesn’t return for 4 hours. \n\nYou need to nip it in the butt now or this will be your life forever! \n\nI know saying no is hard. But safely it’s your choice. And get your husband to back you up!", "NTA. OP, I'm very proud of you for setting boundaries. I know I would've given in after the apology. What you did was perfect and it shows that you've grown a lot considering your problem with telling people no.\n\nYour husband needs to talk to his sister and mother. Your SIL doesn't sound like a bad person, but she needs to understand that you're not a her personal babysitter. And your MIL sounds pretty fucking crazy if you ask me.", "Put their calls on mute (you don’t need to see their requests or their abuse) and stop opening the door. They’ll have to figure out alternative child care. NTA", "NTA. And your husband needs to grow a spine. Looking after your nephew simply isn't your job.", "NTA, but your husband is an even bigger A-H thank you MIL & SIL for not standing up for you.", "nta", "NTA. No, don't watch him anyway! Don't roll over now! Your SIL has no respect for you or your time. She wouldn't get away with treating paid childcare this way, so why is it okay for her to treat you this way?  Actions have consequences. MIL was out of line too. The very generous deal was made with You and your In Laws having set times - the importance of those times was clear.  In Laws' are backing out for No Good Reason, and have the audacity to give YOU a hard time because you uphold the deal?? MIL is a hypocrite, and your husband needs to speak up - this is HIS family abusing his wife!", "Nta. Keep your boundary, or it will only get worse. Your husband, by the way is a asshole for not supporting you to his parents.", "NTA. Your in-laws are all awful and taking massive advantage. Also, your husband is letting you down. I’m sorry to hear you’re being so disrespected and devalued OP. Good luck out there.", "NTA.\n\nI think you should've helped her for one day as she was having her first day/training and couldn't do it then. And could've declined to do anymore babysitting at all because of things like this keep happening.\n\nBut yeah, it would've been a help you would've done for her and not a job. You are still not the asshole.\n\nIf you MIL is so much concerned about your nephew then tell her to go off at your FIL. You have work to do of your own too. You can't just accept all of this without halting your own life and life of your children.\n\nAsk your MIL about who will take care of your children if you were busy with your nephew and studies, and ask for her to give you suggestions.", "NTA - Keep working and practising saying no. Practice on your husband who seems to have trouble supporting his wife...", "There are three full-bodied able adults next door to handle one child. No need for you to be involved in what seems to be the largest capacity.\n\nSince saying no is hard for you, keep them at MIL's word at this one boundary, which is maintaining her threat.\n\n\"MIL and SIL, MIL is right. I just won’t be able to keep him anymore.\" One text. Do not explain. Do not caveat. Just be simple and refuse any conversations about it beyond, \"MIL was right.\"\n\nGenerally, seems best not to live next door to people who constantly manipulate and take advantage of you. The best boundary is distance. NTA", "You are right. Husband's silence regarding his sister and mother's behavior is the same as his consent.", "Nah, give an inch and they'll take a mile, IMO.", "NTA. They're all using you for their own gain.", "Then he can watch nephew. Problem solved.", "Do not follow this advise. You struggle setting boundaries so if you give in then you'll be the full time babysitter. Tell her you cannot give more time then you agreed to so she must make a plan", "NTA.  Be strong and non-apologetic.  They will do to you what you allow them to do to you.  If you allow them to take advantage of you, they will.  Stop being guilt-tripped.  Stop arguing and negotiating.  Stop trying to explain yourself to them.  They know what they are doing.  If I were you, I would absolutely and without any question, refuse to baby sit your nephew again, without exception.", "NTA. Tell your MIL to ask her husband to honor his commitments.", ">that if my nephew is such a bother then I just won’t keep him anymore\n\nWOOHOO don't threaten OP with a good time MIL. Let her follow through on that threat.", "NTA \nIf you if you agree to watch him now, it’s never going to end so this is the best time for you to put your foot down insist that she find a babysitter. \n\nYou cannot be her on call babysitter just because you live next door, it’s just not a realistic expectation. \n\nYou have a life and responsibilities the same way she’s trying to have a life so she needs to find a professional to take care of her child and stop imposing the burden on you.", "NTA, you need to move further away asap.", "NTA. Don’t back down. Your SIL is TA, so is your MIL and also your husband for not backing you up. You need to have a serious discussion with your husband. Also, look into moving so they’re not right next door to you anymore.", "NTA. Your SIL and MIL are. You aren't a babysitter and you're being treated appallingly.", "Your husband needs to grow a spine. There are far too many people who think any female relative is automatically obliged to offer free childcare day and night. You aren't. NTA.", "NTA\n\n&#x200B;\n\nSet your boundary now. OR you will be her fiull time babysitter for the next 10+ years.\n\n&#x200B;\n\nYOu are fine to have your own life .. jsut make it a NO. STOP babysitting. Or find a number in your head ... one that you like ... and limit your babysitting to that number a days a month, \"emergencies\" included.  MAybe 1 or 2?\n\n&#x200B;\n\n&#x200B;\n\nYour SIL AND MIL Are AHs. Set harder boundaries\n\n&#x200B;\n\nAnd maybe move so you live farther aywy from them? That will make your life enormously easier.", "Excuse me...straighten you out??? What nerve!! You have your own life and children to care for. Tell your husband to straighten out his mother and sister.\n\nNTA", "NTA. Please don’t be a pushover and let them run you around. Stand your ground. She’s fully taking advantage of you.", "NTA. A One thing that really pissed me off is \"My husband agrees with me but won’t say anything to his mom and sister.\". I'm sorry your husband is a coward.", "Stop opening the door for her. Don't answer the phone. Nothing. The cheapskate daycare is closed. Let her pay a real babysitter. Better yet, make her sign a contract you get x per hour and failure to pay will result in small claims court. NTA but stop being a doormat to someone who doesn't want to take responsibility for opening her legs up. Or better yet, drop the kid at your husband's job since he doesn't want to open his mouth.", "NTA. If you don't stand up for yourself and cave instead, this will never stop happening. There will always be a \"really good reason\". Because she knows you'll do it.", "NTA. I would take what your MIL said about not keeping him anymore and run with it. No, sorry, you told me I'm not allowed to keep him anymore.", "NTA. I'd stop answering their phone calls and ignore knocks at the door. Also get the husband to stop hiding from the issue and speak up in your defense.", "NTA.\n\nWhist I am sympathetic towards single mothers and how hard it is to raise a child or children alone, SIL is definitely taking advantage of OP.  \n\nAs for MIL, don't worry about her.  MIL and SIL just received the gilt of the middle finger from OP.  \n\nYou love your nephew but he is not your child.  End of story.\n\nAlso OP, you have a husband problem.  It's  appears the women in his family run the show, which is why he acts \"subservient\" to them.  I could be wrong but it seems to come across in your post.\n\nTrend carefully OP, a woman can only take so much , especially if a husband fails to stand up for his wife,  time after time.", "NTA", "NTA. Your in-laws had a free baby-sitter, it was good while it lasted. Now it's over, because they killed the goose.", "NTA. Your MIL said if your nephew is such a bother you won’t watch him anymore? Tell her not to threaten you with a good time,", "NTA. Sounds like SIL has made some poor choices and continues to not take responsibility. The in-laws continue to enable her behaviors and count on you to be there for Sil's child. Pretty presumptuous of all of them. I agree that you should move out of the immediate area if possible. You're too close and convenient.  SIL doesn't sound like she's got her act together and probably won't until she's forced to figure it out. Your husband should be backing you up on this.", "NTA sounds like you need to move.", "NTA stick to your guns!!! I have a hard time saying no so I get it. The kid lives in a house with 3 adults and he’s already pawned off on you all the time?! You did not agree to parenting another kid. Just read your comments about diapers and leaving him until 2 AM, and my mind is blown. I grew up learning family helps family, but it’s her fault that you can’t trust when it’s actually a childcare emergency because she’s taken advantage of you so many times.", "NTA but your husband needs to stick up for you wtf", "NTA. Respond to MIL: “don’t threaten me with a good time.” And wtf is up with the veiled threat? Is she going to hurt you?", "NTA. Wow, you need to go NC with MIL and SIL.  Anyone who would threaten you isn't worth your time. That is just disgusting behavior from them. Tell your spineless husband either stick up for you or your walking. You have friends or family that is nice don't you?? Please get some help from them, and a place to go. It makes me so upset that they are so mean to you. Especially a lousy husband that cares nothing for you.", "Giving notice by caving does not show she's serious. Arbitrary deadlines that can be walked over mean nothing.", "Right? OP has mentioned in a comment that this isn't the first time husband has kept quiet about something and also not the worst. Seems like hubby is either a spineless coward or is taking advantage of OP just as much as his family. Definitely a massive red flag 🚩", "Don't know where you live OP but in the states the government helps pay for child care. Tell your SIL to go apply as you have your own responsibilities and it isn't reasonable for you to be her full time sitter.", "lock the doors and close the blinds/curtains and ignore them. disconnect the doorbell if you have one. if they knock and yell turn up the tv/music and lock yourself in another room to study.  \n\n\nyour husband is a TERRIBLE husband. the inlaws match him", ">He thinks that it’s ‘childish drama’ and that it just needs to be worked out.\n\nAsk him if he'll be ok if your mom or dad told him they'll \"straighten him out\" if he didn't do something they ask him to do?", "It does need to be worked out...by him growing up and talking to his family.", "Any opportunity for you and you husband to move? Being next door to this madness can’t be good for the situation and even moving across town might be better.", "You and husband should move.\n\nThis will continue as long as you are both convenient and a total pushover.  The pushover part doesn't appear to be changing any time soon.", "Ok you have a sil issue and mil issue in that they are taking advantage, not respecting you or you other commitments.\n\nBut you can’t solve these without your husband- and him backing you in private but not to his family means you now have a husband issue. \nNta", "NTA but…OP, I’m going to kindly, gently, and with a mother’s love, say this:  you need to sharpen and polish your spine, Girl!  If you don’t this family is going to make mincemeat of you.  You need to accept that in order to make yourself happy, your ILs are going to be UNhappy.  That’s a fact, and you need to get comfortable and ok with it.  Practice your serious face in the mirror:  stand there and say, “watch my child” and then practice a simple, straightforward No.  No-no-no to anything and everything they ask.  NO is your best friend, OP.  No!  And don’t ever ask them for anything because it will be used against you!  Just No.  You need to do this, not just for you but for your children.  They will be furious - that’s not your problem.  THEY are not your problem.  You, your future, your children, your husband - that’s your priority and anything beyond that get’s whatever you have leftover.  Please start standing up.  I know its hard to say No, I used to have that same problem but I practiced and I swear - No will set you free.", "NTA & no....  stick to your guns...\n\n& maybe remind your husband to a divorce with child support and alimony is a hell of a lot more expensive then sticking up for his wife (which he should have been doing from the start.)", "Your don’t have a sil or mil problem you have a husband problem. You need couples therapy", "NTA - and who in the heck calls someone at 2am to confirm babysitting the next day???  plus, where is baby daddy in all of this?  she should be putting the kid in day care instead of relying on you for FREE babysitting", "NTA  I see you are feeling defenseless, because all these people in your life know how to get to you.  Please start thinking about the words, YOUR LIFE.  Is this how you see spending your life, at the beck and call of everyone, or do you see yourself as a person who has their own needs, thoughts and desires that are not related to their wishes and demands?\n\nYour SIL made a decision to have a child.  This was not your decision, but she is burdening you with the consequences.  Please focus on you.  Make a list of what is important to you.  Is it keeping your SIL and MIL happy.  Is it keeping your husband not annoyed, because you don't do what everyone else wants or is it to:\n\n1. nurture and love a new human being, your child\n2. have a loving, caring and respectful relationship with your husband, \n3. committing to your personal growth and financial security by continuing your education, etc.  \n\nOnce you make this list, you will know where your SIL stands in your priorities.", "It’s long past time to stop watching your nephew. Not for an hour, not overnight. I would also demand some genuine apologies before I engaged with my in-laws again. NTA.", "NTA.  Shut this down NOW.", "NTA- keep standing up for yourself, and tell your husband he needs to speak up to his family.", "NTA. Stand your ground. MIL wants to fix something. She can start babysitting. Husband needs to man up and back you. I support you but won't back you is blowing wind.", "NTA.  So you’re screwing her over when the one who said he’d watch the kid just decided he didn’t feel like it?  Yeah, no, not how things work.", "Nta. Your husband is an ass for not having your back.", "NTA", "NTA\n\nYou're allowed to say no.  If her parents can refuse to watch the kid, so can you.\n\nCan you move away so you're not right next door?", "NTA. You need to 1) have your husband provide care for your nephew and 2) don’t communicate with your SIL or MIL. directly - let you husband handle it. \n\nHowever the big situation is that your husband needs to grow a spine. Don’t accept his dismissal of the conflict being childish drama. Your response needs to be “if it’s so trivial you can handle this then” and step away- no child care, no responding to texts other than “husband is handling this / will watch nephew - please work with him”.", "NTA. And this is your HUSBAND’S family!!! He needs to get a backbone and handle this.", "N O\n\nNTA, you and your man need to tell people you have you own lives and schedules to live! Don't let them manipulate you like this", ">She says ‘you’re the only one I can count on to stick to their word’ but I never gave my word!!\n\nActually, she's counting on you to not stick to your word when you say, \"no.\" You're the only person she can consistently bully into watching her child for her.\n\nIt's horrible that she's used you to provide free daycare for three years. It's also quite bad that MIL and FIL won't babysit on demand but they will help to bully you.\n\nFor me, the worst part is FIL decides he just doesn't feel like doing what he said he would and MIL calls you an awful person, not him. You apparently live in DARVO-ville where everything that goes wrong is your fault not SIL, MIL or FIL.\n\nTotally NTA.", "NTA but your husband is. He’s leaving you to the lions. Call out your MIL about them just not wanting to babysit either. And your husband needs to grow a spine and tell your family to lay off.", "NTA tell MIL that was FIL's day on the schedule.", "NTA \n\nGood for you.", "Why is MIL angry at you and not her husband? NTA", "NTA\n\nThis gets better for you when you stand up for yourself and tell them you're done being a free babysitter for people who use your kindness against you.\n\nUse those words in a text if you need to.", "NTA\n\nStand your ground and state that if they can't abide by your terms, then you are unavailable full stop. \n\nIf your husband isn't willing to back you out loud, then make it clear to him when you have refused to babysit going forward. If he 'agrees' with you in private but undermines this decision, you've got bigger fish to fry.\n\nYour MIL and SIL don't respect you. There are no bridges here that aren't already burnt from their sides, so it's time that you acknowledge that reality.", "NTA.  stop living next door to them. Move to another place, preferably far away", "Tell mom today was her husband’s day so she’s reaching out to the wrong person. Tell her you understand how she made that mistake and to have a good day. NTA", "NTA... \"NO\" is your super power. You just need to learn how to use it.\n1. \"No\"\n2nd time. \"I've told you that doesnt work for me, stop asking\"\n3 rd time. \"Because of your inability to understand the word no, I will not babysit anymore until I make the offer.\nDO NOT EXPLAIN, or make excuses or reasons. Learn to walk away, hang up, block.\nEmbrace the uncomfortable silence that follows no. Be matter of fact about your answer. Do not waver.\nThe magic happens once you are consistent.  The harrassment stops. They believe you when you say no. They appreciate you when you say yes. Practice your superpowers!", "NTA. It's not your child. You aren't obligated to babysit her. You have your own things to do.", "NTA.  You've set a boundry and she doesn't want to follow it.  OP is right, OP is not responsible for SIL's kid.\n\nFor some reason - while hubby agrees with OP he's not supporting her by telling his mother and sister to back off.  Hubby needs to step up and do better.", "nta \n\ntell your husband if he doesn’t say anything this time then it’s time to move away. you don’t wanna live near by anymore so he can allow his family to take advantage of you! \n\ntell you sil the agreement stands no more hours then you agreed. like it or lump it. \n\ntell mil she should be having her grandchild! \n\ntell fil he’s a prick! \n\nthen proceed to send all the above the link to your reddit account…..\n\nentitled fuckers!", "NTA\n\nYou are not screwing over your SIL, you are simply refusing to be stomped on by her any longer.\n\nYou have your own children and work to do that does not include her child.  She needs to find a care provider for her child, or her mother can watch the child, because you no longer can", "NTA.  And don’t watch him.  Your mother and father in law should watch him.  Your sister in law can apply for state aid to help pay for daycare.  You & your husband need to be a team & your husband needs to tell his parents to back off.", "If possible, move, if not, stand your ground.   NTA", "You need to say to your Mil, oh so you’ll STRAIGHTEN this situation out by taking him?!, OP, nta.", "NTA\nStand your ground.. And may i say, You need to move away.. like a good hour awa at least..", "NTA but your husband is a coward and your in laws are bullies\nAre you able to look after your children with zero help from them? If so I'd personally look at moving. \nOh, and your marriage is going to explode once you get enough self esteem to say no", "NTA nice of MIL to offer to take over the babysitting. Not your kid, not your rodeo.", "NTA.  You're not, anyway.  She should have asked and took your answer into account, and either way should have had another option other than you and her parents.  She is the parent, it is HER RESPONSIBLITY to make sure her child is minded.  The quiet AH here though is your husband.  He needs to be backing you up and getting them to step off.  They never will if it doesn't come from him, the blood family member.  Think long and hard about whether you want this to continue for the next ten years.  If he doesn't put his foot down now, it will.", "Nooo don't. \n\nThey are using and abusing you. Let clever-full-of-good-ideas MIL pull her finger out and care for her grandchild.\n\nYOU are entitled to a life.\n\nAnd your husband needs to woman up and speak up for you.\n\nNTA", "Yep to this and also, OP you need to move so you're no longer literally next door to these people, either with your husband or without him. I imagine it would do him a world of good to get some separation. NTA", "You suck for this comment. OP struggles with boundaries, which has clearly been stated in the comments. You really think SIL won't bully OP because shes already been watching the kid, so what's the harm in continuing? OP owes no notice. NONE. It isn't her kid, so it isn't her problem. She's been bullied for YEARS with no support or backup from her spouse to watch this child. The only way OP won't have to watch said child is by saying no and sticking to that. The mother needs to figure out childcare. End of story.", "Yup. I'll bet MIL and FIL never really planned on taking the nephew half the time. More like whenever they felt like it. And SIL basically lied to OP about that.  Good on OP for being firm and she should continue to be, because it looks like her husband doesn't have a backbone. NTA", "I love her \"threat\" to make other childcare arrangements.\n\n\"Oh no! Not that! *Anythiiiiiing* but that! Don't find another babysitter for this child I can't babysit! How can you do this to *meeee*?\"\n\nPlease.\n\nNTA", "Your biggest problem is your husband. He needs to take care of it for you.", "She is going to straighten you out? Lol, NTA!", "Ah, so a hypocrite, then?", "It's actually very easy to work out. As it is now becoming a continuous issue regarding time schedules and last minute changes you are now not available at all for any babysitting. At all. \n\n\nAnd then you are not. No but it's my only solution. It's No. I am not comfortable with that arrangement and will not be available. \n\nThat said - what is good for one is good for the other - and be prepared to arrange all your baby sitting needs with non IL family. \n\n\nNTA. Your IL have no respect for you or your DH if they continue to expect you to roll over and play door mat. Remember the moment someone gets upset over realistic boundaries - it's because they have grown accustomed to misusing you.", "Your husband sounds like a big part of your issues here and maybe a smidge sexist.", "The only reason he gets to say this is because he’s not the one doing the work. \n\nSomething tells me, if SIL dropped off his nephew at his workplace he wouldn’t be calmly saying this is “childish drama” that can be slowly worked out by being a doormat until the kid starts kindergarten. Make no mistake, that is exactly what he is saying.", "Getting child support from the baby daddy, not to mention possible visitation, could solve some of your problems.\n\nYou alluded to a big violation of your trust by her in the past.  I'm usually not one for two wrongs making a right, but does she really deserve you keeping this secret?\n\nAlso, aren't you kind of hurting your nephew by denying him his father?", "Why does your husband not see this as a serious issue? Does he also not respect your time or studies? Because that's what his actions say", "\"She says ‘you’re the only one I can count on to stick to their word’ \" \n\nWell too bad you can't count on her to stick to hers.. \n\nNTA, keep setting those boundaries.", ">I would say maybe do it for her first day (or even week)on the job but make it clear she needs to make other arrangements after that. \n\nPlease do NOT do this.  She will never make other arrangements if you do.", "Or he is just like his wife, someone who also cannot say no. I don't see how he is any worse than OP. I have an easier time saying no to my MIL than my own mom, so just because it's his family, doesn't necessarily make it easier for him.", "Especially since it looks like this 2am childcare was supposed to be free", "Maybe it’s past time her dad “straightened him out” \n\nWTF does that even mean?", "The other situation had me in a crying panic attack for days, I was vomiting from the stress and anxiety that his parents solely caused, I stopped speaking to them and even told both of the what they could do to themselves. My husband told me it was time to make peace because the stress was keeping him a nervous wreck at work. So yeah, he definitely isn’t the most supportive", "Completely agree with this.  Also, based on the post and OP's other comments about SIL, burning a bridge seems like a good idea.", "Umm without too much so i don’t get removed for Justno stuff, no he doesn’t, he is upset about this situation solely because that means I won’t have time for HIM", "Really not trying to be annoying…but it’s “nip it in the bud” although in this case maybe SIL need a nip in her butt. She’s already a pain in OP’s.", "That may be true, but that still doesn't excuse it. OP is actively working on putting boundaries in place and learning to stand up for herself despite her difficulties. Husband is letting his family take advantage of his wife's kindness and not making the effort to help OP. \nHe is putting his family's selfish needs over his wife's comfort and boundaries and making her look like the AH when she has no obligation to look after his sister's child. \n\nHe needs to step up and do his job as a husband and a father.", "You may want to look into some marriage counseling. Some definite red flags here. NTA", "But when does he have time for you? Another red flag.", "Well, and at this stage, it’s not just a bud, it’s a full grown invasive plant that has taken over OP’s life and home.", "I'm just saying that he is probably not putting his family's selfish needs over her wife's, bur simply putting his own discomfort over setting a boundary. Or nonw of them have simply never learned to say no. Nontheless, she is the one, who are suffering this cause, therefore she is the one who needs the most to say no. I know she says is difficult for her, but even if her husband says no, the SIL ask OP directly and OP still says yes, I'm sure SIL will drop kid off at OP's place, when husband is at work..", "What do you mean? I guess whenever we spend time together, doesn’t that count as time for me? We’ve been together since I was 15 & he was 18 so he’s had to deal with a lot from me", "When you are married, you become a team. You help eachother out when one needs it. Yes she is the one to put those boundaries in place but he should at least have her back and support her which is not what she is getting. \nShe should not have to bare the brunt by herself. \nIn OP's comment she mentioned that her husband finds the whole situation childish drama and should be just be worked out. He's not concerned because the situation does not affect him. I'm sure if roles were reversed he would be singing a different tune.", "I didn't read the comments, that sounds stupid. It's not childish to be burdened by someone's child. It's more like one of the biggest issue of having children - in the US at least. In order decent countries, child care is payable.", "I rest my case", "Send SIL info on some decent daycares. NTA.", "NTA. Your husband needs to grow a backbone and set boundaries with his sister and mother.", "NTA - you are not obligated to babysit. She can pay a sitter if her parents don't want to.", "NTA.\n\nI'm guessing you're having assertiveness training. Keep at it. It prevents these entitlement creeping situations. Being agreeable early on causes these things to snowball.", "NTA and I'd recommend moving as far away as possible", "100% NTA and you haven't \"screwed over\" your SIL.  You inlaws are definitely in the AH zone and your husband is not far behind them.  You are in a tough position as it seems obvious that you love your nephew and still want time with him but she is absolutely taking advantage of you.   MIL and FIL need to step up and help their daughter instead of trying to bully and badger you.  Your husband needs to step up and have your back on this.", "Her screw up is not your responsibility. Ber dad commottes & backed out. Again, not your responsibility. She will continue to change the times she needs you & will not push against any of her other childcare people. Your MIL will \"messaged me telling me she’s going to straighten me out.\" What the fuck is that about?! And why won't your husband say anything, won't stick up for you when ha agrees with you!?", "NTA\n\nNot your kid, not your responsibility.", "Taking a one-month trial at at workspace would force her to come up with childcare arrangements that don't involve you. You can be back at home when  your own kids get home.  It's an added expense, but it may pay off in establishing a boundary because you don't have to say NO, it's because you're not going to be around.", "NTA but your husband needs to stick up for you here.  They are all taking advantage of you, and none of this is your problem.\n\n\"if my nephew is such a bother then I just won’t keep him anymore.\"  Problem solved. Thanks, MIL!", "NTA.  You're being taken advantage of, and your husband isn't helping you by staying quiet.  Tell your MIL to go f\\*\\*\\* herself, and she's welcome to watch her grandchild if she's so concerned about this.", "NTA…stuck to your boundaries.  If you want to watch nephew at all, let her know what works for you and she will have to get a job accordingly.  But she is 27?   She is an adult.  Old enough to research daycare options.   You are not the cause of her losing her job.  Her actions or lack of are.", "they are all taking advantage. Hold your stance. Its ok to be the villan in someone else's story and the hero of your own", "NTA - But your husband is.  He should be your defense here, he should be shielding you from this kind of bad treatment.\n\nSince he won't, I'd actually be telling him that I want to move.  The ideal buffer zone is 90 minutes (I have a 2 hour one just to be extra safe). It's close enough to do a day trip for holidays and special events and far enough that you won't have them dropping by to take advantage of you.  \n\nTell your husband that if he won't take measures to protect you from his family that you'll be your own advocate and this is your best option.", "NTA\n\nIt’s time to move so you’re not just next door. It’s a lot harder to drop a kid off when you have to physically load them into a car first.\n\nHell, I’d consider moving towns if it’s a possibility.", "NTA stan txt (real)", "> My husband agrees with me but won’t say anything to his mom and sister.\n\nDoesn't actually sound like he agrees with you now does it?", "Am I reading this right, she's messaging you at 2am?", "I'm sorry OP, I'm laughing at your MIL threatening that you'll never watch him anymore because of this. Hold her to that. Make them take on the babysitting for a while if they refuse to let you keep him. See how they like picking up the slack. NTA.", "NTA but you’re a doormat keep working on that like you said you are because this situation sounds insane that you’re taking care of her kids part time . That’s what day care’s are for maybe once and a blue moon babysitting is alright not being her co parent id you shouldn’t baby sit anymore and your husband should stick up for you fully in this", "NTA", "NTA.  Your husband NEEDS to say something to his mom and sister.  He is being a coward and you are bearing the brunt of his family taking advantage of you.  Why can't your husband watch the nephew?  Do toddlers frighten him?", "You should start dropping your kids off at her house all the time. Her parents are only upset because they don’t want the burden of the child", ">\tMy MIL then messaged me telling me she’s going to straighten me out and that if my nephew is such a bother then I just won’t keep him anymore. \n\nTell your MIL not to threaten you with a good time. NTA.", "If he won't say anything, then he's telling them the same thing he's telling you. NTA", "NTA. Oh the nerve. You need to grow a spine and tell these freeloaders what you really think about their horrible behavior.", "NTA.  You're the aunt, not the mom. You deserve to have boundaries and have them respected.\n\nYour husband needs to speak up if he agrees with you.  You don't deserve to be left to fend for yourself against MIL and SIL. If he doesn't he's TA along with your SIL.", "NTA. Where is SIL’s husband? And why is she letting her 2 year old stay up until 2 in the morning. This woman needs structure in her life and she can’t blame you when she is the one living in chaos.", "Nta it's not your child.And she is not paying you. slavery is illegal in a lot of country", "Nta and why doesn't the mum look after her grandson if she's so concerned", "NTA - I'd just tell them not your crotch spawn, not your problem. And then proceed to ghost them all. Not worth it.\n\nIt sucks that we often have to ghost family or the family of our SO, but it is what it is. They will continue to pry & use you until you completely cut them off.", "Don't watch this kid.\n\nNTA.", "OP, never watch the kid again. It's clear they don't appreciate it. Any time you say no, you're the bad guy, so just don't do it again.\n\nAnd your husband needs to say something. HE needs to tell them that you're done being their unappreciated babysitter, so never ask again.", "And this is why I refused to live across the street from my mil!!! \n\nOP NTA. Everyone else in this story is", "Correct", "SIL should just hire a babysitter if no one else in the family is going to do it.", "A quote from a Karen Kilgariff song applies here: \"...and I know it's taboo, but if you don't like it, you can, f@ck you.\"\n\nMIL & SIL's father need to put up or shut up.\n\nThe schedule doesn't change & try to default on OP just bc they decided in the moment they don't want to.\n\nBoth women/ families deserve equal support. \n\nOP has a job & school commitments. She isn't sitting home doing nothing.\n\nIf family can't be reliable then maybe SIL can't have that job.", "You need to stop taking your nephew altogether until they learn to respect your boundaries.", "It gets worse!\n\nNot your child so not your problem. NTA at all\n\nEveryone else is though - including your husband", "Ok, well that's disgusting for a start, maybe your phone needs to be put on do not disturb overnight. \n\nYour SIL is incredibly selfish and entitled. You are definitely NTA. Stand your ground.", "OP needs to stop being Jane and her husband Bingley from Pride and Prejudice, where they *talk about* asking unwanted guests to move on, but cannot bring themselves to actually do it.\n\nOP, NTA - maybe moving, even if it's only a mile away, will stop the presumptuous expectations of your inlaws?! Being nextdoor certainly is playing in their favor!", "Well, back in the day parents used to say that when you were about to get the ass whooping of your life with a come-to-Jesus meeting.", "🚩🚩🚩🚩🚩🚩🚩🚩", "You need to read this book OP— it’s a freee pdf\n\nhttps://ia800108.us.archive.org/30/items/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf", "I mean you are giving more than you're getting from him emotionally. Hes letting his mom and sister run all over you to keep peace so he 'doesn't have to be stressed'", "> We’ve been together since I was 15 & he was 18\n\nHuge red flag.\n\n> he’s had to deal with a lot from me\n\nI’m gonna guess you think that because he says that to you a lot.\n\nNot gonna lie, it looks like he groomed you. Now he’s deeply unsupportive and a terrible partner—you could do a lot better. You shouldn’t be forced to put up with abuse from your in-laws and he’s the one complicit in that. I’m so sorry.", "\"deal with a lot from you\" wtf does that mean? he is an AH. E.S.H. EXCEPT YOU  and the kids", "18 and 15 seems a bit much to throw grooming out there imo. I thought grooming was something that takes place over years in which case he would've started it as a 15 or 16 year old himself.", "Thank you, you said it better", "I mean, if he started when he was 15 she'd be 12. Grooming is more about using authority and someone's age and lack of experience to your advantage.\n\n3 years doesn't seem like a lot in established adult relationships (24 and 27, 38 and 41, etc), but the difference between a 15 and an 18 year old is *massive*.", "Wait, wait, wait so your FIL who is the father of your SIL and the Grandfather of your nephew had nothing to do and had told his daughter he would watch his grandson but decided he didn't feel like it and they claim you are the monster for not helping. Please explain why the FIL is not being cussed out and you are. NTA but your husband's family is a group of huge AH. Stand your ground and ask you husband to help with his family's attitude.", "NTA. Time to move away.", "Nta", "NTA\n\nYou drew your line in the sand and she just had to step over it. Good for you, sticking up for yourself. :)\n\nYour sil has been taking advantage of you for far too long already. So have your other inlaws, feeling comfortable backing out of babysitting commitments because they know you will cave and do it instead. \n\nThey are only angry because you are no longer thier doormat.", "Your husband is useless, why do you even keep him?", "MIL can watch the kid if she's so concerned.  NTA", "\"My MIL then messaged me telling me she’s going to straighten me out and that if my nephew is such a bother then I just won’t keep him anymore.\"\n\nThe moment your husband's mom said that to you, your husband should have been in her face telling her how out of line she is and that they need to leave you the F alone from now on. If your husband didn't or won't, then he is just as much and AH as his sister and mom.\n\nNTA", "NTA\n\nYour husband is being a pushover too. I think you have a problem with him as well since he won't stand up for you. Honestly I think you need to move. With our without your husband.", "Your MIL saying she will straighten you out is telling. She then threatens you with never taking care of your nephew again because he is such a burden to you.\n\nThat she believes insuring you no longer take care of your nephew will be perceived as a grievous loss to you lets you know that they’ve rationalized your babysitting as s favor they are doing for you.  That is your out!\n\nMIL will have to take on care if your nephew in order to deprive you of his company.  That is good news!\nShe is expecting you to beg forgiveness and not let that happen.  Just don’t do that.  Don’t worry about the strain on your relationship that results.  It will be temporary.  MIL will soon be worn out by how confining her new job is and she will be looking for you to feel cooperative.  Hopefully, this will also rebalance how you are perceived.  \n\nYou also need to be firm every single time.  If SIL needs you to babysit, ask her how ling.  Tell her if she doesn’t cone back on time, you will not babysit again.", "NTA what was MIL doing that she couldn’t take the kid? Honestly their threat of “well we will never use you as a babysitter again” doesn’t sound like much of a threat. Without unreliable her child care is I’m guessing she only sticks to that for a day or two. Also where is this kid’s dad at? Of everybody you listed, you sound like you would be the person with the least amount of responsibility for this kid.", "NTA and quite frankly I think you are being used, gaslite and straight abused by this family.  MIL said she is \"gonna straighten you out\" ma'am this is straight up abuse and I'd consider leaving your husband unless he stands up for you. This behavior is NOT ok.", "NTA and congratulations for finally growing a backbone. You should have said no 2 years ago and not let yourself be used like this.", "NTA. After such an incident my door would be closed to them (except for real medical emergencies). Not your kid, not your responsibility, concentrate on your school and your own kids.", "Tell your hubby to grow some backbone and start supporting you against them or you're out. He's also an issue in this. Your MIL threatening you is a huuuge problem.", "Stand your ground they don’t see you as person but a thing that can be useful to them like a doormat that can be stepped on. And have a talk with your husband him not speaking is him taking his mothers side. He wants yo be the good guy at both sides. He probably goes to his mother and say she is right and he just don’t want to get involved.\n\nThat is 2 faced behavior. So if he cant stand by you than you need to step up and stand for your self. So never babysit or do anything else for your In laws.\n\nBe the bad guy they calling you to be cuz rather be bad guy than a doormat. Hope everything works out for you", "MIL SAID “if my nephew is such a bother them I just won’t keep him anymore”.\n\nProblem solved.  Just remind her of that when she tries to guilt you.  NTA.", "NTA - sorry this is happening.  Unfortunately you are going to have take the lead here as your hubby can't or won't.  Cancel all babysitting,  if she tries to drop the child off,  don't answer the door.  If she still drops them off,  call the police for child abandonment.  \n\nIt is horrible that you have to do this,  but this is extremely bad behavior and it is very unfair on you as well as your children.", "You are NTA. \n\nReply to MIL and thank her for being understanding of your schedule and taking over babysitting nephew.", "\"NO\" is a complete sentence. Don't fall for any of them trying to guilt you into anything. Tell them from past experiences that her disregard and disrespect for your time has shown them that they are the AH.", "*I have gone out of my way to always help out with SIL's child.  But she has taken advantage of my kindness at every term.  She treats me as if I am her employee and not someone who is helping her out or doing her favors.  She'll drop the child off with me for what she says is a quick run to the store then will spend hours doing god knows what while I try to figure out how to go to school and watch her child.*\n\n*So with respect...how about you tell your daughter to stop treating me like shit and start being respectful and appreciative of everything I do.  And for the record, I don't appreciate you just blindly taking her side without even taking a second to look at things from my perspective.*\n\n*We are family.  Family does not treat each other the way your daughter is treating me.  Both of you owe me an apology*\n\nNTA", "NTA I'd tell mother in law her husband screwed over their own daughter and not to blame you, that kid isn't your responsibility and you already do too much. If this is the entitled attitude they're going to have I'd refuse to babysit anymore, I'd tell her to look into daycare or have her parents handle it all since the baby isn't at all a bother for them.", "Op tell your MIL to go get the kid then and if she EVER threatens you again you will take it to the police and get a restraining order. Tell her to play some fuck fuck games and watch the shit roll down hill. You are NOT a daycare center, let alone why is the child sleeping only 2am to 8am who in their right mind puts a child to bed at 2am??", "NTA and you have a husband problem, not just a SIL issue", "NTA. And she went and tattled on you to boot! When you have a kid, that kid is YOUR responsibility. You have to work your life around that kid. It’s not up to the free world to accommodate you. Period. She’s lucky she gets what she gets because daycare is expensive.", "NTA and u have a husband problem. Hes the one who needs to also set the boundaries of your house and straighten out his family. I honestly would be relieved at this point. Ooo ur not gonna drop him anymore. Great. Works much better for my schedule.", "NTA. What does \"straighten me out\" mean? Fuck her. Tell her to take the kid not your job. Also your husband is an A H for not speaking up. Doesn't matter if he agrees with you if he won't speak up.", "There are no bad in laws only bad spouses. If your spouse doesn't have your back and can't stand up for you against his family members when they are wrong then you are fighting a losing battle. \n\nHe has to tell them to stop bothering you. Plus good on you to stand your ground against your sister in law.\n\n From now on if the situation arises where you are put in a difficult spot tell your husband to do the work they want you to do whether it's baby sitting or something else then let's see if he will still keep quiet or speak up.", "No it is not, that is such a stupid argument because to his mom and sister his silence would be consent to OP refusing. There is more than 1 POV and perspective in each situation/argument and not choosing a side is never choosing side \"A\" or \"B\" no matter what side you're on. \n\nBiggest example I can think of is with voting. The left says by not voting you are supporting the right...the right says that by not voting you are supporting the left. Its hypocritical and borderline bully like behavior to tell someone \"by not taking my side you are taking their side\" when someone does not want to be involved. You are forcing their involvement. Now you can always argue that by not being involved is right or wrong but thats a totally different argument.", "It might even be worth it to block SIL (and maybe the in laws) on everything for a few weeks. (And don’t answer the door if she shows up). It will give OP time to breath and get SIL used to OP not being available.", "What does it even mean to straighten out someone. This archaic language belongs to people who think physical punishment is justified or some other bullshit.", "ughhh and they're next door?? Have you looked at other housing options, far away", "Quit being a pushover OP! Stand your ground!", "Great! Then HE can look after the kiddo. See if he can still say that afterward.  …and don’t you dare take over for him when he slithers out.", "Childish drama? Good. Then from now on HE is the “baby center”. He can take care of his nephew.", "I mean you did give her your word - you told her that if her parents weren't available at the last minute, it wouldn't be your problem. So this was you sticking to your agreement!", "Why are you answering her at 2AM?", "Agreed. And if it needs to be worked out then fine, OP’s husband can go work it out seeing that these are HIS parents and sister", "He's worse because it's his family and he is allowing them to burden his partner. It would be one thing if he was taking on the needed tasks himself, but he's not. It doesn't inconvenience him in any way and he's allowing his partner to suffer.", "You need to move.", "I'm sorry but if someone is making you vomit from stress and causing panic attack for days it's time to go NC. Therapy is definitely helpful but these people will keep doing the same thing over and over again you need to distance yourself from such things and people", "WAIT, you were 15?\n\nThat's rape. that's the definition of grooming. \n\nI'm guessing you've never been with anyone else? He trained you to be just for him? \n\nthat's some incel level creeper grossness. AndAND he expects you to bend over backward for His family?\n\nDo you even get to interact with your family (provided you want to, and weren't isolated, and groomed to avoid them)", "Well, I broke up with him for a short period of time during which I was with someone else. He holds it against me (me being intimate with my ex) though even though it was 8 years ago. He’ll say things like ‘at least I can say that I’ve only been with you. You can’t say that huh?’ \nI turned 16 the year we met, like a month after we met actually. And he turned 19 a few months after that. \n\nHe doesn’t stop me anymore but he used to, he does get angry if I message them too much though and says that I’m ignoring him even if it’s just them messaging me and me not replying. I never looked at it as grooming because I wanted to be with him", "nope, that's still grooming, especially if he controlled her social dynamics from Middle school on up. \n\nI was in high school in the 1980s, and saw plenty of this sort of thing, where a guy would decide a girl was his, and make sure he love bombed her, isolated her and then married/impregnated her as close to graduation as possible, thus trapping her. \n\njust because it's not a 40 year old latching onto a 12 year old doesn't make it any less nasty. \n\nI mean, seriously, a 12 year old? Not even talking about frontal lobe development, that's like not even done with puberty.", "NTA - But your husband needs to step up and deal with his family. They shouldn't be your burden. If he can't defend you, maybe he should go live next door for a while, so he can watch his nephew. And please DON'T watch the kids anymore, or she will be dumping him in your lap for the rest of your lives!  \nWhat does MIL mean \"she’s going to straighten me out\"? Is that a threat? See how she likes it if you go NC will all 3 of them. Don't answer the door, calls, texts, until they get the idea through their thick, entitled and abusive heads that you are not their slave!", "NTA. If her parents are so upset they can babysit.", "NTA.  No seems to be the hardest thing for ppl to say to another person. It's a great skill to have and it will give you great freedom and power over your life. \n\nRemember, you owe no one an explanation when you say no. It's actually a form of disrespect to you when ppl don't except your no. This is why it's so crucial to learn to say no and stick to it.", "NTA just tell her flat out will not watch the baby again. Your husband needs to grow a spine.", "NTA. Honestly I'd respond back with \"I love taking care of kiddo, but if SIL decides that she doesn't want me sitting for kiddo anymore, that's her choice and there's nothing I can do about that. I've explained the times that I'm available to help that work for our family. If you think that someone needs to be available to SIL at all times, I'm sure she'll be excited to hear you volunteer.\"", "NTA:  you did not screw anyone  over.  You set a reasonable boundary.  You are not a permanent free day care center.   Don't let them move in and live rent free in your head.", "NTA. I would not watch the nephew AT ALL anymore. This stops now. When SIL texts you, you say no and stop responding. Don't respond to anyone about it anymore. If you can'd/don't want to, \"no\" is a complete sentence. If they are going to abuse you, you don't owe them any favors (especially unpaid ones).", "NTA - Boundaries are important and so is your husband's missing spine.", "I would ABSOLUTELY call MIL out for saying she would 'straighten me out'    HECK NO!  \n\nyou are not the A$$HOLE!!!!!!!!", "NTA-  but after reading your comments about your husband trying to keep you away from your family and being mad that you had another boyfriend as a teenager - I think your in-laws are your least important problem. Your husband is the problem. I’m worried about you. Everything you say about him sounds abusive.", "NTA, and I think couples counseling might be a good route to take if you haven't already. Your husband needs to stand up for you.\n\nAnd I think you need to stop babysitting. Your in-laws are taking advantage of you.", "NTA - Your husband needs a backbone and to deal with his family taking advantage of you. Since he refuses, you're doing the best you can. You still have a major husband problem here.", "NTA. She needs reminding you are doing her a favour and have zero responsibility over him. What time is your DH home from work? Why doesn't he help his sister? At this point, I would just say you can do what you agreed to or nothing and let her choose. But ii would be tempted to say you will do nothing since she doesn't appreciate it and can redirect your boundaries.  Especially if she is being rude to you.  \nYou should remind DH, if he is not sticking up for you, he is allowing his family to mistreat you, and there is no middle ground.", "NTA.  Her own parents don't give enough of a damn to keep their daughter from losing her job, but YOU'RE the asshole?  Screw them.  But this should help you telling her \"no\" in the future.", "NTA\n\n Let MIL have her way and never watch the nephew again. You can do what I do and make the policy that I communicate with my family and partner  communicates  with their family.  This policy is because I am lazy and don't want to keep track of my parner's family stuff, but a lot of other people do it because they have conflicts with their in-laws.", "NTA\n\nHow did she want to hold a job, if she have not worked out the child care?", "Yeah if ANYONE told me they were going to \"straighten me out\" I would've replied *\"with what? The giant stick up your ass\"* and then a lot of cuss words, packing my shit, my child, and leaving while slamming the door. \n\nThis honestly made my blood boil hearing some entitled pinecone threaten you for setting some pretty normal boundaries. \n\nSooo NTA, but absolutely everyone else is *including* your husband. \n\nDo you really want to live with this much stress on your shoulders ALL of the time? Sounds like you haven't been truly happy in years and I'm so sad for you. I know this is said way too much, but honestly, if my husband treated me like this all of the time, I'd 100% leave him with a smile on my face. Even if I was still in love with him. Patterns don't break unless the person with the pattern wants to change it.", "In past experiences it usually means she’ll message me on FB and be passive aggressive or wait till I’m pulling out of my driveway to run outside and yell that I’m a petty b*tch, make a fb status about how you can love someone and treat them as your own but they will screw you over and prove what they thought of you the entire time, etc.", "OP please dear god, do NOT take your nephew. Even on the days you said you'd take him originally. Set the boundary that this last stunt was unacceptable, you have been once again threatened by the family and that according to them, you shouldn't even be watching him anymore which is more than fine by you as you have your own kids and your own schooling to focus on. Set a FIRM boundary. I know it is hard, but you need to. And talk to your husband, let him know he needs to stand by you during this time and take your side in this because it's not fair for you to take all of this bashing on your own.", "I put my phone on silent starting at 11pm every day but have it so that four people can break through the silence if they need to get to me at 2am.  Otherwise, my sleep is more important.  If you don't go NC with these folks, at least look into this feature", "No is the word you can stick to.", "Good Lord she sounds exhausting. Is moving something you guys can do or would consider? Sounds like space is needed here.", "But he doesn't watch the kid she does, so his silence is volunteering her to babysit. Seems like an asshole move, especially considering he knows and agrees its screwed up", "How funny! I wrote bud, then went “ohhh that looks wrong”. Butt it is. \n\nOops!", "You are in an abusive relationship with both your husband and his entire family. Please for your sake and your child's - make a plan to get out.", "You know this makes your husband sound way way worse, right?", "This makes it so much worse. I'm so sad for you. \n\nThis is abuse.", "NTA. That title belongs to your husband blatantly allowing his family to manipulate you.", "NTA that's not your child not your problem\nHowever your husband is TAH for not backing you up clearly\n\nAnd you SIL is an AH and so is your MIL", "NTA and good for you for standing up for yourself! Keep doing it -you deserve to have your time respected. Someone else not wanting to do something isn’t your problem and you don’t have to clean up everyone else’s mess/problems. Also, your husband is a real piece of work-he should be standing up for you to your in-laws and shutting them down. Your husband is your real problem.", "Your husband needs to speak out for you", "NTA but your husband needs to make it clear that he supports you and stands by your decision.", "NTA - but you and your husband need to move. Move far away from them.", "NTA, your momma's boy husband is a massive asshole for dumping his problems on you to deal with.", "NTA. And hon, you really need to move.", ">She told me she will lose the job if she can’t find a babysitter and I told her he isn’t my kid so it’s not my issue.\n\nYou are so correct here, it's not YOUR issue that SHE can't find childcare for HER child!\n\n>My MIL then messaged me telling me she’s going to straighten me out and ***that if my nephew is such a bother then I just won’t keep him anymore.***\n\nI mean, sounds like a great offer, I will take never babysitting my nephew for Peace of Mind Alex (RIP 😭)\n\n>She also told me I’m an awful person for screwing over my sister and she expected more from me .\n\nYou didn't screw anyone over, you set a reasonable boundary and they don't like that. \n\nKeep standing firm, keep setting these boundaries. Also, it sounds like you need to move to a house not next door to them. I get that might be tough but if it's something you can do in the future, it might be good to set that goal. \n\nNTA", "🥳 Good job! NTA. You said no, and guess what? It worked. Keep that back bone!", "NTA. Keep your spine nice and shiny. I’ve also seen more spine in jellyfish than in your husband. He’s horrible wtf it’s his family and HE should be the one dealing with them.", "NTA. Go low contact with the whole family then.", "NTA- they are but that includes your husband who is a noodle spine and won’t back you up.", "It’s his family, right? His family = his responsibility. He’s the one who’s supposed to deal with this sh*t, not you, OP.", "That’s abuse not love.", "\n>SHE FUCKING THREATENED YOU!\n\n\"Re: your intention to 'straighten me out', and purely for legal purposes as I otherwise have neither wish nor intention of further communication with you, please provide a detailed list of the steps you intend to take.\"", "Nope:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/103u5k2/aita_for_screwing_over_my_sil/j3123et/", "She really does!"]}