{"id": 6589, "submission_id": "104f97g", "title": "AITA for not wanting to engage with my niece about her birthday?", "selftext": "My niece's birthday is in mid-December. My son was in the hospital almost the entire month of December. During that time I rarely went anywhere except for work and occasionally home to get clean clothes. My dad and sister also frequently came over to help with things, bring food, sit with him while I took a shower, things like that.\n\nI did not attend my niece's birthday, wasn't even thinking about it at all. I also forgot to text her happy birthday. My dad also missed her birthday because he was helping with stuff at the hospital. So no one from her mom's side of the family was there, except for her mom.\n\nNow that my son is back home, my sister and her husband brought my niece to visit. At one point after my son fell asleep, my niece said to me \"just so you know, it really hurt my feelings that you didn't wish me a happy birthday, not even a text.\" I was a little miffed that she would hold onto something like that when my son and I just went through something horrible, but birthdays are a big deal when you are fifteen. So I just said \"It slipped my mind. Happy birthday.\"\n\nMy brother-in-law said \"she was pretty upset no one from your side of the family was there.\" I just stared at him for a second. \"Yeah, I was at the hospital, with my son. Kind of weird that you forgot that.\"\n\nHe said \"I didn't forget, but you took over everyone's attention for a month. I don't think it's too much to ask that you apologize to my daughter for making her grandfather miss her birthday.\" My sister said that we should talk about something else, but I said I thought it would be better to cut the visit short, since my son was already asleep anyway.\n\nMy niece said \"so you would rather us leave than acknowledge you hurt my feelings?\" I said yes. My sister gave me a hug and said they would visit at a better time, but her husband said \"don't worry, honey, your uncle is just a jerk. It's nothing to do with you.\" Then they left.\n\nNow, could I have apologized for missing her birthday and technically being the reason my dad did? Sure. Should I have? She's fifteen. One would think she's old enough to understand extenuating circumstances. Is that an unrealistic expectation?", "created_utc": 1672964668, "permalink": "/r/AmItheAsshole/comments/104f97g/aita_for_not_wanting_to_engage_with_my_niece/", "score": 324, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I missed my niece's birthday, forgot to text and am part of the reason my dad wasn't there. She is upset and wants an apology, but I refuse.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your BIL is the AH for instigating an issue. You are not an AH for forgetting the birthday or making your dad miss the birthday, and your niece isnt an AH for telling you it hurt that she didnt even recieve a message. But your BIL was really trying to instigate, and that comment when you asked them to leave? What an AH. I do have to say, you kinda suck for saying \"shes old enough to understand\" you never get too old to get hurt over being forgotten.", "You argued with a child. I feel like this is one of those situations where all it would take is a hug and an \"I'm sorry\" instead of digging heels in and butting heads with a teenager but maybe that's just me. Not like it would've hurt anybody to just tell the little girl you're sorry and that you love her\n\nEdit: ETA", "NTA, and her father is raising her to be a self-centered AH.  Hard to tell what's going on with the mom, since she seemed to want to end the encounter.  But yeah, 15 is old enough to be told \"big things were happening, don't take it personally\".", "NTA. I can see where your niece gets it from, seeing her father's behavior. \n\nDid they visit your son at the hospital? Offer to help you out? (I see your sister did, but did your neice and BIL?)", "NTA\n\nThe 15 year old isn't an asshole. She is 15 and is a little self centered, but she has time to grow out of it. She doesn't have the life experience to truly understand what you and your family have gone through. In her head you weren't the one sick so why did you forget about her?\n\nHer parents on the other hand are HUGE assholes for not correcting her when she brought it up and then not explaining to her the reason why people were busy was someone was very sick. If she was still hurt- maybe they could have thrown her a half birthday party in 6 months when your son was hopefully feeling better!!!", "NTA.\n\nEntitled and absolutely rude to put a birthday over caring for your son in the hospital.\n\nInsufferable AHs especially for the \"took everyone's attention\" remark. She's old enough to know better", "YTA.", "It’s okay that your niece reached out to you and expressed her feelings. It shows that she likes you and she was expecting to hear from you. She’s 15 though, not 5. She should be able to understand why you forgot. NTA", "NTA, if the roles were reversed, they wouldn't be acting that way.", "NTA. If your niece had a problem with the attention your son received on her birthday, it was your sister and her husband who should have handled the emotional situation. Bringing it to your house like that was ridiculous. And immature.", "NTA. For gods sake, your son was in the hospital. She is completely entitled and so is BIL. Her emotions don’t need to be validated, she needs to learn some empathy and that she isn’t the center of the universe. She is gonna have a hard time as an adult if she continues to act like this.", "NTA- wow, just wow. \nThe entitlement. The self-importance. The delusion.\nYou could expect it from a 15 year old, but her father? Really? When she mentioned her hurt feelings, it would have been a good time for him to teach her about empathy for others going through difficult situations, not jump on the bandwagon and uphold her understandable immaturity.\n\nI am shocked. A loved one spending a month in hospital is a very long time. A very scary time. As your family, you would expect support, not recriminations. And if they have an issue about the grandparents, they should bring that up with the grandparents, not with you. I am disgusted.", "NTA what an awful family.", "Yeah no. NTA. Your own child being in the hospital trumps everything else. I can see where the niece gets it from with her father’s response.", "This is why YTA. You couldn't even validate her feelings that her grandpa didn't remember her birthday.\n\n\n>\"so you would rather us leave than acknowledge you hurt my feelings?\" I said yes.", "first I'm glad your son is home and I hope he is doing well. being 15 and being able to understand situations doesn't prevent them from getting their feelings hurt by not being acknowledged on their birthday.  as you said you could have said you were sorry, but you chose not to, that alone makes you YTA. you  were there, they were there, it would been nice if you thought of their feelings a bit now that your emergency was over.", "yikes. NTA, obviously. Sounds like your niece takes after her dad.  For your BIL to be upset and say it's your fault the grandpa missed her birthday is so outrageously out of line.  You weren't forcing your dad to be anywhere, and you certainly aren't responsible for him remembering/not remembering a birthday.", "NTA.  I'd have a very serious conversation with your sister about how you'll continue a relationship with her, but you'll never be in the same room with her asshole of a husband again.  \n\nAlso, how old is your niece??", "While you're not the parent, 15 is a highly impressionable age. It could have been an opportunity to acknowledge the hurt feelings, but also give a chance for niece to learn that sometimes in life, focus must shift to accommodate extenuating circumstances. A gentle conversation about that, could be instrumental in helping her gain some compassion. \n\nMaybe pull aside sis and BIL for a similar conversation. \n\nTo be clear, I think NTA. But left to the sole guidance of her father (& I can't tell if your sister behaves similarly), niece might turn out just like him. Not to say that a single interaction with you will turn the tide, but you can plant that seed of insight in this case.", "NTA", "NTA she's 15 she knows better.", "NTA, they are raising a little monster.", "Yeah no, NTA, if I had said that to my uncles when I was a kid and one of their kids was sick I would have been grounded for the rest of my life.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy niece's birthday is in mid-December. My son was in the hospital almost the entire month of December. During that time I rarely went anywhere except for work and occasionally home to get clean clothes. My dad and sister also frequently came over to help with things, bring food, sit with him while I took a shower, things like that.\n\nI did not attend my niece's birthday, wasn't even thinking about it at all. I also forgot to text her happy birthday. My dad also missed her birthday because he was helping with stuff at the hospital. So no one from her mom's side of the family was there, except for her mom.\n\nNow that my son is back home, my sister and her husband brought my niece to visit. At one point after my son fell asleep, my niece said to me \"just so you know, it really hurt my feelings that you didn't wish me a happy birthday, not even a text.\" I was a little miffed that she would hold onto something like that when my son and I just went through something horrible, but birthdays are a big deal when you are fifteen. So I just said \"It slipped my mind. Happy birthday.\"\n\nMy brother-in-law said \"she was pretty upset no one from your side of the family was there.\" I just stared at him for a second. \"Yeah, I was at the hospital, with my son. Kind of weird that you forgot that.\"\n\nHe said \"I didn't forget, but you took over everyone's attention for a month. I don't think it's too much to ask that you apologize to my daughter for making her grandfather miss her birthday.\" My sister said that we should talk about something else, but I said I thought it would be better to cut the visit short, since my son was already asleep anyway.\n\nMy niece said \"so you would rather us leave than acknowledge you hurt my feelings?\" I said yes. My sister gave me a hug and said they would visit at a better time, but her husband said \"don't worry, honey, your uncle is just a jerk. It's nothing to do with you.\" Then they left.\n\nNow, could I have apologized for missing her birthday and technically being the reason my dad did? Sure. Should I have? She's fifteen. One would think she's old enough to understand extenuating circumstances. Is that an unrealistic expectation?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta.  Wow!!!", "NTA. Your son was **in the hospital**. That takes precedence over literally everything else, and anyone who doesn't understand that has some serious growing up to do.\n\nDid your brother-in-law, sister, and niece visit you and your son at all while he was hospitalized?", "If I had to guess, I would say brother-in-law is pushing these feelings/ideas on her behind closed doors instead of explaining the situation to her and helping her to manage her feeling and disappointment in an age appropriate way. \n\nNTA obviously.", "NTA, and I hope your son is doing better.\n\nOn the other hand, you could have told your nice she is very important to you and it wasn't lack of love for her that made you forget. Her parents, however, they're definitely the AHs and need to get over themselves.", "NTA Your Son was in hospital for an entire month and this is what they care about? \n\n\"don't worry, honey, your uncle is just a jerk.\"\n\nWHO SAY'S THAT? Whilst in hospital with a sick relative??????????? \n\nYou owe no one ANY type of apology. They owe you, if they can't see, well good luck to them.", "ESH your BIL more than you but when your niece said you hurt her feelings you shouldn't have just blown her off. Apologize and let her know it was a hectic time for you. Then if she's still rude sure but she didn't seem that rude to begin with. Kids and teenagers are self centered and sometimes need things explained more clearly that you weren't trying to hurt them.", "NTA!\n\nOMG, the audacity of your BIL saying it was *your fault* that your son was in the hospital, resulting in the niece's grandfather missing her birthday. Like ... WTF?!? Who thinks like that?\n\nYour BIL is an AH, and so is his entitled daughter. Not one bit of sympathy for your son or you for the ordeal you went through.", "NTA\nYour son was in the hospital naturally you are going to focus on him and hardly anything else. You also didn’t make your dad miss your nieces birthday he wanted to be with his sick grandson, he was not forced to stay with your son. Your brother-in-law clearly only cares about his daughter’s feelings and not really considerate of others. I get that your niece’s feelings were hurt when family members weren’t there for her birthday but she is old enough to realize that there are more important things going on in life than her birthday.", "NTA and I’m sorry you guys had such a rough December. Go LC until they pull their heads out of their entitled asses.", "OMG what an entitled brat! She's plenty old enough to understand that she's not the centre of the universe but with an enabling father the him, I guess there's not much chance that she will. He just missed a great teaching opportunity and used it to kick you while you're down.\n\nNTA - obviously!  \n\nI hope your son is recovering well and that your relationship with your sister will be ok.", "ESH, softly for you. \n\nYou all behaved poorly, in my opinion. I get why you behaved the way you did, but she's 15. It's not exactly and excuse, but it's an explanation. Relationships that mean something to us deserve respect and take work, including apologizing for things when we know we should. It sounds like you were being too proud to apologize, and that never really helps anything. \n\nOn the other hand, her father was being a huge AH. He had zero sensitivity for your situation with your son. A sick or injured child is a miserable thing, and he's not considering how hard it is for a few days, let alone a month. It's not like you asked for it, and Grandpa wasn't just bumming around, he was helping out and doing work. I don't think you owe him anything, and I partially got the feeling he was phishing for an apology for himself rather than his daughter. I may be wrong, though, I don't know him. \n\nYour sister sounds like she might get shut down by him. It sounds like she's been understanding but isn't allowed to voice that opinion. Am I right?", "NTA\n\nI think it's fairly obvious that a birthday does not take prority over your son in the hospital. Tho I can understand that your niece feels hurt she should be able to see reason in this situation especially with 15. But the entitlement of her father is beyond unreasonable. How is it your fault that u took atention for a month when ur son was hospitalized? You had no say in this and I bet you'd have gladly skipped out on the attention if it ment your son wasn't in the hospital.", "NTA well we know where your niece gets her audacity.", "1. Do *not* apologize. \n2. She’s 15 and knows the difference between right from wrong. She’s morphing into a giant asshole just like her father.\n3. Your son being in the hospital takes much higher priority than your pathetic BIL’s excuse that, “*Waaahh, you stole my daughter’s attention.*”\n\nYour BIL and his daughter need a lengthy time out. Sounds like you’re dealing with a family full of toddlers and not a group of decent human beings who care about people other than themselves. (*not including your sister since she’s a decent human being*)\n\nDon’t feel bad. Do what you have to do, and BIL and your niece can stfu and get over it. Just to drive the point home, I wouldn’t ever celebrate this kid’s birthday again period anyway after this.\n\nNTA.\n\n**Edit:** sorry for the confusion over my wording. I think OP’s sister is great and is the only one in her family that is actually a good person who, unfortunately, her daughter isn’t taking after since she’s clearly learning awful behavior from her father. BIL is a giant asshole who sounds like a narcissist.", "I was imagining that your niece was 6 or 7, for her to have “hurt feelings” because you missed her Bday…certainly didn’t imagine she was 15! Your BIL is an ahole for saying what he did, and for encouraging his daughter’s rude behavior. NTA.", "NTA. Shame on them", "NTA. BIL and his daughter thought they could bully you by demanding an apology. I admire your restraint and not telling them kindly to fuck off. Especially when BIL insulted you.", "NTA. My mom has missed several of my birthdays due to work. And this was when I was younger than 12. Did it hurt my feelings? Yes. But I also understood that she was the reason why we were able to have food on the table and a roof over our heads. I still had my other family members to celebrate with me. She’s 15. She can understand that your child was sick and that your dad was helping you out with him.", "I would guess BIL has been moaning about the attention OP's son got in December which has probably influenced the niece's view. NTA", "Niece wasn't allowed on that unit. Visitors under 18 are only allowed if they are the child of a patient. Brother in law did come twice.", "How is she gonna grow out of it with parents like this?", "Why?", "Didn’t validate her opinion that OP was the reason her grandpa forgot. Compassion for a seriously ill child was the reason both forgot. A 15 year old should be able to comprehend that and not try to make either of those people feel guilty. Validating self-centered behavior is a bad idea. Gross.", "If you think that makes him an asshole, you must be really fucking easy to manipulate.", "he said the niece is 15", "15", "He told her it slipped his mind, I think his son being in hospital is a lot more important than his nieces birthday but maybe that’s just me", "My sister isn't an asshole, she helped out a lot.", "Validating her emotions takes literally nothing away from OP", "He", "15 is a shitty age.  I'd forgive her, but not right away.  However, with such a shitty father I'm not optimistic about her adulting out of it.", "I'm not saying it's less important or that he should have celebrated her birthday. I'm saying he handled this poorly. \"It slipped my mind\" is not a good response when someone tells you it hurt their feelings that they were forgotten. Again she's a teenager. All he had to say was \"I'm so sorry I missed your birthday -kids name- was very sick in the hospital and things were very chaotic for me.\" It's shows the girl that they didn't mean to, it was not because they do not care about her, and that sometimes things aren't about her without being cruel.", "I fixed my comment. My Reddit is acting wonky and reposted my comment again lol\n\nYour sister wasn’t included in what I stated. I forgot to specify and I’ve now corrected it. You have a great sister, and I know she would appreciate you standing up for her like this.", "OP’s son was in the hospital for a month and his niece is complaining about hurt feelings over a missed birthday text. Are you serious? These things aren’t the same", "Thank you, that's nice of you to say", "NTA\n\nI thought your niece was going to be like 5 or 6 this is a whole teenager. The fact that your own sister wasn’t mad or bothered tells me your BIL is the asshole filling his daughter head up with BS.", " \"I didn't forget, but you took over everyone's attention for a month. I don't think it's too much to ask that you apologize to my daughter for making her grandfather miss her birthday.\"\n\nThis was not your fault, you didn't choose anything in this and they are being Ridiculously self absorbed\n\nNta", "NTA. 15 yo is capable of understanding the severity of what was going on, she wasn't even allowed to visit. She has all the right to be upset but this clearly wasn't out of cruelty on anyone's part. BIL is an asshole.", "NTA. Your kid was in the hospital. She’s FIFTEEN. She can surely overcome her disappointment and understand that you were preoccupied. Christ. I can’t believe this is even a conversation real people have.", "Right now i’m inclined to go with a soft ESH, but….\n\nINFO. When things calmed down with your son, were you planning to acknowledge her birthday belatedly? Maybe her grandfather and you taking her out to dinner? \n\nI think it is great that she felt comfortable enough with you to discuss her hurt feelings. If she had said this a month from now when you are hopefully back in a normal daily life cycle with your son, would you have been more receptive to explain why events like this happens and it’s important to have compassion for people going through a rough time. Acknowledge her hurt feelings and offer to celebrate her birthday in the near future. As a teacher, there are a great many 15 years old who are still learning empathy and compassion.\n\nNow her father is an absolute A H! So feel free to be livid at him!", "nta.  But the real asshole is your brother-in-law.  At 15, she would be very disappointed. But, her parents should of helped through that and it seems like he nursed a grudge.  Your child was in the hospital.  Wtf is wrong with them?  You should of acknowledged her feelings.  But, I don't think that makes you an asshole.  You were tired, stretched thin, scared.   and then when you get over that hump, they corner you in your own house.  The thing that takes the cake is how he said you took everyone's attention for a month.  What a jerk.", "NTA \n\nShe is 15. Old enough to have some compassion. And certainly old enough for her parents to explain to her what was happening and why it didn't matter that you missed her birthday.\n\nYour brother in laws comments makes it pretty clear where her selfishness comes from.\n\nAs others have pointed out you possibly should have been a bit nicer to your niece.", "NTA, but your niece’s dad sure is one", "NTA. My own son was hospitalized in December, though only for 3 days and my brain was so saturated with what was going on I couldn't even remember what day it was. It's understandable your niece might be disappointed you forgot, and it's okay for her to share that feeling with you, but it should have been explained to her, by her parents, just how serious and soul crushingly awful that situation is for your family. And it takes a good while to feel back to normal emotionally afterward, so maybe you came off a little harsher than necessary, but again, her parents need to really explain to her this situation. As for your BIL, he's a raging asshole and I hope to heaven his daughter doesn't follow those stinking footsteps.", "Nta I sincerely hope your son makes a full recovery.", "NTA, but your BIL is a major asshole. It’s just so sad. Without prying into the painful details, it’s clear your son was in very bad shape. I’m so sorry you had to endure a month of that. I can’t imagine what it must’ve been like for you. And yet your niece saw fit to center her displeasure at having a sparsely attended birthday party in that reality. It’s heartbreakingly, toxically naïve in a 15 year old to view other people’s tragedies in terms of personal cost, first and foremost. Given her father’s participation in the exchange, it’s no mystery whence that philosophy came. It’s perfectly acceptable for her to have been disappointed and even upset by your absence, but her demand (obviously emboldened by her father) that you apologize to her for it is an act of extreme entitlement, and it displays frightening lacks of awareness and empathy. She’s an asshole, but her dad’s assholery in fostering her singularly self-centered outlook on life far overshadows hers.", "NTA. A birthday is just a day, your son’s health crisis took priority on that day (and month). My own mother didn’t call or text me on my birthday one year due to a health issue in her family and called me in tears the next day to apologize. I told her it didn’t matter at all and it hadn’t bothered me. Instead of using this as a teachable moment on how to have empathy for other people, her dad taught your niece it’s ok to make it all about you. Which is funny, since he called you out for “taking over everyone’s attention for a month.” Whatever. You’re definitely NTA and your BIL is a huge AH. I feel sorry for your sister and your niece, who is going to go through life feeling very entitled.", "NTA\n\nWhen a family member is in hospital, especially a child, everything else just isn’t important.", "NTA your brother is a massive AH and your niece is old enough to know better.", "NTA but his whole \"you got attention for a month\" statement is fucked up. Imagine a familyember being hospitalized and a grown ass man being jealous that the family is worried about them and not paying attention to him. Tell him having a child not in the hospital was gift enough.", "NTA.", "NTA, it’s a truly special brand of sociopathic to whine about someone “taking over everyone’s attention” by having a child in the hospital for a month. Makes you wonder how he’d respond if the situation was reversed and someone dared to celebrate a birthday when his precious child was suuuufferiiiiing. \n\nIn fairness to your niece, given how quickly BIL jumped in to stir the pot and how immediately he went to “but you got all the attention,” I’d bet she’s just being used as a proxy for his tantrum. He’s probably been telling her the same “your uncle is so mean” things since the birthday.", "How are you technically the reason your dad missed it?  You weren't in the hospital.  Your son was.  And that's a no fault situation.", "NTA. Outside of her birthday, did your BIL or niece check up on your son or you?", "NTA", "NTA. Your niece’s dad is the jerk. The problem was blaming *you* for making your dad miss the birthday as though there was any choice involved or as though you were trying to steal focus. I won’t blame your niece for saying one thing especially as her dad has obviously been pumping her grievance instead of explaining, “I know your sad no one came from mom’s side but they’re going through something incredibly difficult and scary. They probably don’t even know what day of the week it it!”\n\nIf the BIL hadn’t come out swinging so hard, I could see you telling her, I’m sorry I missed it. This was a tough month for us so my full focus was on my son.”", "Everyone is kind of TA. \n\n>just so you know, it really hurt my feelings that you didn't wish me a happy birthday, not even a text.\" I\n\nShe's explaining her feelings very well here. You shouldn't be mad she's communicating with you, granted your reason for forgetting is valid. \n\n\n>He said \"I didn't forget, but you took over everyone's attention for a month. I don't think it's too much to ask that you apologize to my daughter for making her grandfather miss her birthday.\"\n\nYeah this is pure assholery. You clearly have stuff going on and this is him projecting. This is awful behavior from him and it's not your fault your dad didn't remember. \n\n\n>My niece said \"so you would rather us leave than acknowledge you hurt my feelings?\" I said yes.\n\nQuit taking out your anger on your niece. It's not her fault your son is sick, and it's not her fault you're fighting with her dad. Keep the kids out of your petty bs. \n\n>Now, could I have apologized for missing her birthday and technically being the reason my dad did? Sure. Should I have? She's fifteen. One would think she's old enough to understand extenuating circumstances. Is that an unrealistic expectation\n\nIt wouldn't have hurt you to say \"sorry I forgot your bday. I have a lot going on right now and it's not about you, I'm sorry.\" She's fifteen and you're an adult. Quit projecting your issues and deal with them like an adult. \nYou're not TA for having them leave because BIL was being a jerk. \nyou need to learn to keep your arguments with BIL between you and him and not drag a child into it. \nI'm sure you're hurting right now but that's nobody's fault and taking it out on everyone isn't going to encourage anyone to support you.", "Your BIL/niece are WAY out of line and very callous. I’m so sorry and I hope your child feels better soon. I feel like a child in hospital will always come before a birthday. Sorry not sorry!\nETA: NTA!", "ESH. Your BIL was trying to start a fight, but it would’ve cost you nothing to acknowledge her hurt feelings.", "NTA! I would expect that behavior from a 5 year old and not a 15 year old.", "Wow, YTA\n\nI get your son was in the hospital but did you need to make your niece feel like shit. You could have said sorry but you didn't.\n\nYou made the decision to not think about how your niece felt and then doubled down. Way to go. Its s good job you don't like her, you will never have to see or hear from her again.\n\nYou decided to tell her you would rather never speak to her again than to say sorry i fucked up, life is shit for me but you are right Im sorry.\n\nBut No and now your family dynamics have changed\n\nWell done you", "NTA....\n\nFifteen? yeah, she's old enough to realize that it's not all about her. and she'll probably have lots of birthdays to come.\n\nIt's also not your fault that her grandfather chose to be helping with a kid in a hospital, over something that he's already seen 14 others of. \n\n&#x200B;\n\nthe BiL is the real asshole, though.", "NTA: your BIL is a piece of work though, and honestly at 15 your nice should know better than to be upset about extenuating circumstances.", "YTA\n\nThere are several things going on here from both sides but to start off Good on ya, for asking them to leave rather than engage with them. And yes, a 15 yo can and do understand extenuating circumstances, but extenuating circumstances isn't a rug to sweep everything under either. Also all teenagers are rather psychopathic in nature, thinking only of their own survival.  \n\nNow your BIL does seem to have egged it on with his comment specifically \"taking everyone's attention for a month\" and \"making her grandfather miss her BDay\". Those are selfish and untrue statements and is very saddening that a full grown man of at least 30 years would make such comments especially with his teenage daughter present. Now we could say maybe he was just playing the over protective dad card and really wanted to show his daughter he was on her side but to say inherently untrue statements isn't an effective way to do that. Because no one can \"take\" our attention, we give it for the better or worse, also no one can make anyone do anything. Granddad missing the party was his choice and while it had to do with the circumstances you were in, it was his choice to make, and he made it on his own. \n\nNow on to why I think you're YTA here. Imaging being in her shoes. I don't need to image very hard as I've been in close proximity to it many times. And all anyone, especially teenagers, want is for people to admit when they're in the wrong, own up to their mistakes. Validating someone's feelings is important at every age, but especially to those who have not reached the age of majority. \n\nNot wishing her a happy birthday was a mistake, an unintentional mistake but a mistake none the less. And it hurts no one, by your own admittance you agree, to apologize to say \"I'm sorry\" and no \" I'm sorry, but...\" \"I'm sorry, but\"s are not apologizes they are excuses. No human is infallible, we all stumble and fall and error, and this error hurt her feelings. I thinks she says it the most eloquently;\n\n>so you would rather us leave than acknowledge you hurt my feelings?\n\nThink about that. Think about what she is really saying. She understands you didn't forget her birthday with malicious intent or with a depraved heart, your mind was simply preoccupied by a rather unfortunate situation. However, now that the situation has calmed down some, it isn't going to cost you anything to say, \"hey I errored, and I'm sorry my error resulted in your feelings being hurt.\" In fact, admitting you made a mistake might just give you something, a closer relationship with your niece, or merely the returning of a lost piece of humanity.", "NTA, what is she, like five? Cause she's acting like a baby. Oh wait, she's FIFTEEN?!", "NTA. Boy I bet she was shocked to find out the world does NOT in fact, revolve around her. I sure as hell would expect my family to give full attention to someone in the hospital over me. I would also be involved helping, especially being fortunate enough to likely see another birthday. She sounds pretty entitled. Hope she grows outta that behaviour or else she will be a lonely old cat lady.", "YTA- for when your niece said she was hurt you didn’t ever send a happy birthday text not just saying I’m sorry I didn’t. I can’t get how someone forgetting a birthday can be hurtful. I was so busy and worried about my son that I wasn’t thinking of anything else. I’m sorry I hurt you that wasn’t my intention. That’s all you had to say. Instead you got pissy that your niece said you hurt her and that she was upset and tried to have open and honest conversation with her uncle. YTA for that. Your BiL is an AH for inistigating it to go further but they are clearly hurt that her and her birthday were forgotten by everyone for you and your son and that in an entire month she couldn’t be remembered on one day, her birthday. Which honestly is fair he just went about it in an AH way but so did you with the conversation.", "NTA", "YTA it would have taken literally zero effort to apologize and offer to do something for her like get her a cupcake", "YTA for your poor attitude toward your niece. I get that you had a horrible month but since she brought it up it would have been a good time to tell her happy birthday and maybe plan a lunch or something at a different date?", "Nta but you should have shut it down quickly cause she’s not connecting the dots.", "NTA why in the world would you apologize for taking the grandfather away from her? You did no such thing. If your child is Ill enough to be in the hospital for a month, your family doesn’t have any concept of priority and reality.", "\"Birthdays are a big deal when you are fifteen\", being hospitalised is a big deal regardless of age. NTA.", "Going to go NTA here. I just had a son (1 YO) leave the hospital mid December due to a pulmonary infection. It was only 3 days but it was absolute hell, outside of doing food runs and coming home at night to take care of the dogs I was there. My wife didn’t leave his hospital room the entire time he was in patient. It was a miserable experience I wouldn’t wish on anyone. \n\nAs far as the niece is concerned, at 15 I wanted pretty much nothing to do with my extended family. There was no major drama, I would just rather have a party with my (few) friends. The fact that she is this bent out of shape about you missing a 15th birthday (unless it was a quincienera  (sp?)) leads me to believe there’s something more going on. \n\nMy guess is BIL either feels threatened by you, or is holding a grudge from something else. This animosity is probably being planted in your niece’s head through emotional manipulation. The fact he was trying to egg it on at YOUR house while your sister just wanted to make up further leads me to believe there is something going on.\n\nTalk to your sister privately and try and get the real scoop. Might be best to head this off before it gets too crazy.", "NTA\n\n&#x200B;\n\n\"My niece said \"so you would rather us leave than acknowledge you hurt my feelings?\" I said yes. \" .. YOu handled that VERY well.\n\n&#x200B;\n\nThe correct answer is: If your parents weren't AHs, they would have explained to you that my son being in the hospital trumps someone else's birthday any day.", "NTA. Your niece needs to learn empathy.", "My birthday is December 30. I am used to people blowing it off. I’ve managed to push through and live my life. NTA.", "NTA", "Okay I feel like there's a lot here. I was going to say N A H at first. It's okay that you forgot. It's okay for your niece to express her feelings. It's okay for her to have been hurt. An apology would have been nice, but you did wish her happy birthday.\n\nYour brother-in-law? Oh my gosh. Completely over the line. So that pulls it into NTA category for me. He of all people should have been able to help his daughter. Understand why you might have been a bit distracted. And for him to just dump that on you in your own home? Unacceptable.\n\nI would consider reaching out to your sister and making sure that she's okay in her relationship right now.", "NTA and holy cow the entitlement of niece and her dad.", "How selfish can your niece and BIL be? Seems pretty selfish. \n\nNTA \n\nYour child was in the hospital for a month, and I’m sure you were NOT after a month’s worth of attention. They lack empathy!", "Tricky one. I think your responses were in minor AH territory, albeit understandable to most parents who have ever been worried about a sick child. \n\nBIL was completely out of line and is the major AH. Sister should have stepped in sooner IMO. \n\nNiece though, is young and still learning. She sounds indulged and I don't think she's realised yet that she isn't automatically everyone's top priority on her birthday. Maybe because this was the first time something like this happened. \n\nUnfortunately, her main takeaway from the row is probably that her uncle was unsympathetic and dismissive when she voiced something that was important to her, rather than \"Oh, I understand now how seriously ill my cousin was, that hurting my feelings wasn't deliberate, and why my grandad needed to be at the hospital rather than my party on my birthday\". \n\nDon't beat yourself up for not responding in a saint-like fashion though. You've had a very stressful time lately. Maybe have a chat with your sister, who seems to have her head screwed on more than her husband and daughter, and get her to explain it to your niece.", "At any point you BIL, the adult, could have text something like the following:\n\nHey OP,\n\nHow's Jr.? Any progress? Is there anything I can do to help?\n\nAlso, just wanted to mention niece's birthday is today and she's a bit bummed that you and grandpa had to miss the party. If you have a chance can you call or text a quick happy birthday message. Also, when there's an appropriate moment could we get together to celebrate her birthday? If so, could I share that news with her? I know it would make her happy.\n\nFeel free to print this out for him.", "NTA, but I do think you should redirect your vision on this, and realize that your brother-in-law is the asshole who is raising your niece to become an asshole. He is the one starting this whole situation and putting the thought in your niece's head that she has any reason to be upset about you spending your time taking care of your son.\n\nI think you need to stop looking at the teenager and asking why isn't she being reasonable, because she's a fucking teenager with no life experience who's having her head filled up with garbage by her parent. You do need to be looking at your sister and asking her how she is okay with her husband treating you like this.", "ESH, I understand you were preoccupied but it costs you nothing to be empathetic now.", "YTA for digging in your heels. \n\nShe told you personally that she was upset by it. Yeah, you've been through a lot, but you could have dredged up the humanity in SOME PART of your soul to offer her a heartfelt apology. \n\n\"I'm so sorry, Niece, that I disappointed you. I was distracted by what was going on, but I promise I'll do better in the future.\" Something. It would have cost you nothing to acknowledge her feelings and validate them.\n\nI'm so sorry for your troubles. I wish your son a speedy and complete recovery.", "Ok — was going to say NTA, but after your last sentence, I’m gonna say light ESH. \n\nFirst…I’m so glad your child is ok! I can’t imagine how stressful the situation was, and how exhausted you must be. I’m sure that this confrontation didn’t help the matter either. \n\nYour BIL sucks. Unequivocal asshole. He should understand extenuating circumstances. You didn’t ask for your son to be in the hospital for a month. \n\nI think that 15 year olds are really just kids in older bodies. That’s not an insult to 15 year olds…it’s just the truth. They’re not as mature as you think they are. Your niece doesn’t have the capacity necessarily to be able to compartmentalize and doesn’t know how to address things appropriately. Her father probably should have talked to her about this before they arrived, but alas. \n\nIt wouldn’t have taken any energy from you to say, “I’m so sorry that I missed your birthday and forgot to text. It was a really stressful month, but I didn’t mean forget to hurt your feelings”. \n\nThat would have been enough. Your niece just wanted some recognition. Remember — she’s a kid in a more mature body. Kids are easy to please. \n\nI know I can’t understand how hard the last month was, but in my opinion, you escalated things with your response and with your tone. I’m not going to call you an asshole, but I think you didn’t handle this situation as well as you should’ve and you’re not 100% in the right here.", "NTA. She is understandably upset and she's allowed to tell you that but she should also understand why you missed and there is no reason to sit down and talk about it. Her dad is a major A H and your sister for allowing him to talk to your niece like that about you. What's sad is they're jealous over the attention a sick kid got. I hope your son is doing better.", "NTA.  Pity your niece is so much like her father.  I hope your son is doing well.", "NAH\n\nYou're having a shit time, and your niece is child. Children are inherently selfish, and thats something you grow out of.", "If I were the niece I'd have one less uncle to worry about so it's not a loss on her part.", "The only AH here is your brother in law. Niece isn't wrong to say she was hurt since this all happened around her birthday, especially if her mom has also been helping you out. The birthday was probably something she was looking forward to as a pick me up from an otherwise stressful situation and having people forget your birthday can hurt a little, especially when half the family forgets or doesn't show up.\n\nYou were dealing with a lot as well, so NTA for accidentally forgetting. I do think your response was a little callous. It could have been worded better but other then that the only person stirring up trouble is BIL.", "I'm gonna go with NTA. Could it have been handled a little better? Probably but from one parent to another who just had a child leave the hospital, I get it. I've been there. And my birthday is also mid Dec. So I get her side of it too especially with it being so close to Christmas, saying it slipped my mind may not have been the most comforting thing to her. And your father's absence isn't your fault you can't force him to do anything he did what he felt was right in the situation and that should be brought up to him since it was his choice. What happened is in the past now. If you feel inclined to I'd say send your niece an apology and let her know you didn't feel comfortable being away from the hospital that long. That it had nothing to do with you not wanting to be there. She's 15 her emotions might be all over the place even if to you it seems like something minor she's still learning how to deal with it.", "NTA\n\n“I’m sorry your father is an entitled jackass.” Is the only apology necessary should you choose to issue one.", "Let’s see… niece lets you know you hurt her feelings. She wasn’t demanding anything, just expressing herself and letting you know you hurt her. That’s a remarkably mature thing to do, especially at that age. She’s in the clear. \n\nBIL started okay, reinforcing his daughter’s statement and prompting you to make a simple apology, but he pressed it too far. \n\nYou got defensive before you were attacked. You made it about you. Then, by your own admission, you chose them leaving over admitting that you, though no malice, accidentally hurt someone’s feelings and should be a mature adult and apologize?!\n\nESH, except your niece. I hope she continues to learn emotional maturity from whomever taught her that saying her feelings were hurt, and takes exactly zero pages out of your book.\nAll you had to do was apologize, but instead, you expected someone half your age to have more maturity than you.", "YTA not because you forgot her birthday. YTA for not acknowledging hurting their feelings.  It was not intentional but that doesn’t change that she was hurt by your actions. If you step on someone’s toe accidentally you apologize. Not because it was on purpose. Because you hurt them. \n\nShe definitely should have been more tactful in how she said it and acknowledged the situation but that doesn’t mean your reaction was appropriate", "op=YTA\n\nI get your kid was sick and I get that it \"slipped your mind\" at the time, but clearly you were a beloved uncle and your not even acknowledging her birthday hurt her.\n\nYour response was a flippant, \"*It slipped my mind, happy birthday\"*?? and YOU don't think you are the A-H.  She has a right to her feelings and you dismiss them as unimportant.\n\nAnd her grandfather missed it too.  Per your words, no one from her mother's side acknowledged her existence.  \n\nShe can understand extenuating circumstances, what she doesn't understand is that people in her life said, we are not only too busy to acknowledge you on your birthday, but can't be bothered later to apologize or acknowledge it later.\n\nIn your post--no where do say you APOLOGIZED, in other words, no where do you acknowledge her HURT Feelings.  You told her clearly with your yes, that she means little to nothing to you.  \n\nI hope she chooses not to have you in her life, because she doesn't deserve to be treated like that.", "ESH\n\nYour BIL sucks the most. Your sister sucks because she should have checked her daughter and her husband.\n\nYour niece sucks for being rude and not letting the issue go after she spoke her mind.\n\nBut you also kinda suck because...\n\nIt would have cost you nothing to say: \"I'm sorry that it slipped my mind, but I want you to know that I love you even when things are hard.\"\n\nSo yeah, the whole thing is sucky. I hope your son is recovering well and that you have a chance to get some much-needed rest. I'm so sorry for the harrowing month you all endured. Best wishes.", "Most people, even at 15 can understand that some things will outweigh other things. And people who actually exhibit things like compassion and empathy (at any age) will recognize and accept when something tragic overshadows their “special” day. \n\nNow if this had been a year later, everyone is healthy now, and nieces birthday is coming up again.  At that point it would not be out of line for her to say something like “I know you weren’t able to come to my birthday last year because cousin was so sick, but I really missed having you there and hope you can all make it this year”. \n\nBringing up that you were hurt that OP cared more about his sons health than his nieces party is actually pretty appalling, and shows a striking lack of empathy on the part of the niece.", "The niece is definitely old enough to understand, and yes, she is an AH for bringing this up. Wow.", "But OP didn't say it to her.  He just posted it here. And she IS old enough to understand.", "I agree with that last sentence. My uncle completely missed my 30th birthday. I told myself he was just busy having a great time on holiday after spending the previous two years hiding away during the pandemic (he’s immunocompromised) and the following month he walked me down the aisle, gave a really touching speech and we had a beautiful day together. But it still really hurt that he didn’t even text me on that milestone birthday. I think because he’s always been such a big part of my life it felt really noticeable.", "N T A for forgetting, not at all.  The BIL is a massive AH. Like holy hell.\n\nBut this isn’t about the BIL, it’s about the niece and her uncle. This was a chance to tell her sorry and to tell her you love her, and to also tell her that sometimes life gets really intense and we might forget to check in because other things are taking over all our energy. But it doesn’t mean you don’t love her.\n\nThe question isn’t whether or not her parents should be teaching her this, the question is whether the OP is an AH for “not WANTING to” acknowledge the niece’s birthday, and for refusing to apologize to her.\n\nAnd yea YTA for that.\n\nThen after it all when she was trying to be honest with you because she must think you two are close enough for that, you just dismissed her and said “it slipped my mind” and expected her to fully understand that at 15. 15 is old enough to not throw hissy fits, to have empathy, to express (as she did) feelings. But she is still learning, she’s still growing up, she is still a kid and she is not going to understand how hard all of that was for you. She is not going to understand fully “extenuating circumstances.” She’s not a parent, she’s not an adult, she’s super young still, so having her uncle argue with her about her feelings is going to feel way worse for her than for you. She has never had to stay in the hospital at her child’s side, she IS a child.\n\nI have so much compassion for what OP went through, that must’ve been unbearably difficult and traumatic. How heartbreaking. And my guess is he’s still dealing with the aftershocks of all of that in January despite (thankfully) the son being out of the hospital.\n\nLike be a little honest with the niece, OP could tell her “I’m sorry I’m still getting my head on straight after that really hard month with your cousin being in the hospital. I love you and I hope this year is the best one you’ve ever had.” Then if she pushes it more could say “I think it’s a good idea if we revisit this later when I’m more able to focus on you, because you deserve that but right now I don’t have it in me. I still love you though!” Like literally any variation of this shit instead of arguing with a 15 year old.", "Yeah, I understand that's a really rough situation for a parent to be in so I get it slipping one's mind, but a quick apology for not taking time to wish her happy birthday was probably in line. Instead it sounds like OP just doubled down and figured a 15 year old should have been the adult and worked out the implications of OPs situation on her own. OPs not the biggest AH in this situation by any means, but they could have handled things better.", "Ummmm.... 15 is old enough!!!", "This.", "Agree the parents are very much A H they could have done so much more \n\nThey could have explained it to the niece at the time, having someone close very sick and in hospital is all consuming, there just isn’t time for anything else, OP you are NTA \n\nOr they could have covered for OP “your aunt says happy birthday and is so sorry she can’t be here today” \n\nOr maybe even asked OP that they “100% understood OP is super busy, stressed and has other priorities but if you get a minute could you please message your niece happy birthday”\n\nTo let it fester away at the niece is terrible parenting from them", "True. Birthdays as a teen girl are a big deal (I don’t know the reason but they were to me too) so I understand the initial hurt that you forgot as it takes 10 seconds to send someone a Happy Birthday text. Even within the next few days. But that’s all I understand. Plus you apologized which was the right thing to do. After that it’s just unreasonable. \n\nAnd no wonder she’s entitled. Look where she learned it from. Your BIL (who I assume is her father) was out of line. \n\nOP isn’t TA at all.", "Sounds like OP’s sister is okay, it’s really just BIL", "People are being seriously harsh to the kid, all she said was that it hurt her feelings her birthday got forgotten.", "Strange, \n\nA child ask a adult in her life to validate her sadness and the adult said,, No,,", "She didn't make that remark her father did, but also remember she just turned 15, and all teenagers are budding psychopaths, and it takes us, all of us in the age of majority, to prevent them from getting to full blown status by the time their brains fully develop.", "I read the whole incident thinking niece was maybe turning 6 to be so fixated on a birthday. But 15, 15ffs. This child has three years to become a functioning adult. Shit.", "I hadn't thought about it at all. All of the plans I've made recently are doctor's appointments, meetings with my son's school, things of that nature. It never once crossed my mind.", "I mean, the niece’s mom was in regular contact with OP and didn’t say, “hey don’t forget niece’s bday.” That tells me that this was dire and consuming enough, or that OP was strained enough, that even doing that would have been a bad idea. So the idea of needing to make up the things you missed during a terrible month…is not required to avoid AH territory", "no, he argued with his BIL who was...trying to make him feel guilty for his son being in the hospital and \"taking everyones attention\"\n\nhe said happy birthday to his niece when she told him her feelings were hurt. it could have been left at that, but BIL decided to have a go.", "He didn't argue with the teenager just her father when he pressed the issue.", "THANK YOU! like she's 15. Is this really the hill OP wants to die on?", "This is the dumbest shit take. You’ve invented both OP making some conscious scheme to hurt the niece, and a wildly dramatic “I’ll NEVER SPEAK TO YOU AGAIN” pronouncement, as opposed to asking the asshole harassing him to leave his house. \n\nAre you the BIL, or does this persecution complex just get aimed at everyone?", "how TF is it OPs fault that her grandpa missed her birthday? you really want him to apologize for his son being in the hospital? dear god.", "I think Op should just leave the poor girl alone. \n\nOp told the girl her truth Op is not sorry and Op would rather walk out than accept the child was upset that someone she loves does not love her back.", "When I was 16 my bf’s parents were hit by a drunk driver. His mom thankfully had relatively minor injuries (if you call broken and fractured ribs and a face full of cuts and bruises minor) but his dad almost died, and was in the hospital for a very long time fighting for his life. \n\nI can’t imagine myself, or *any* of his friends being upset if he had forgotten our birthday during that time. In fact I am sure that he likely *did* forget. I have no memory of that though, because I was more than capable of understanding that he had more important things to worry about, and when I thought about him my mind went to how sad I was for his circumstances and how much I hoped his dad would be OK.  I was not thinking about my own selfish interests while he was doing his best to hold it together.", "Yeah , this comment is a hard no. This man spent a month in hospital for his child, A MONTH. I’m assuming it wasn’t some simple illness. If a 15 yrs old and her boot head dad can’t understand that his child was fighting for his life and want to make a stink about a birthday then f them.  And apologize for what worrying about my kid and not celebrating your next healthy year of life f out of  here", "Lol well if she doesn't it won't be thanks to her parents!", "Hopefully she's one of those kids who when she moves out of the house will get the blinders taken off of her. She may not have empathy now, but once she gets away from her parents, hopefully she'll wake the fuck up", "What a strange way to frame a fifteen-year-old displaying zero empathy for her uncle and cousin.", "INFO: does this mean he was in a mental health ward? \n\nListen, he was in a hospital. If this is America, or just about every country, he’s being cared for by nurses in the hospital. And you didn’t “want” to acknowledge her birthday. Your fingers broken? You didn’t take 15 seconds to send a text to someone who (probably used to) care for you.  You’re posting here about your kid to garner sympathy… but you know YTA here. She didn’t ask for the moon, just a text, and no one could be at her party? Everyone needed to be at YOUR sons side 18 hours a day? This… doesn’t track and you know it. That’s why you’re posting here.", "So you are still very much in the weeds! Totally understandable. Unfortunately your niece does not understand your situation, and is sounds like she’s not getting the complete picture from her parents.\n\nWhen you are out of weeds, have a heart to heart with her if you want to continue a close relationship with that part of the family.\n\nAs others have pointed out, she not in the wrong for her feelings at just 15, but this conflict escalated quickly and cooler heads are needed if you wish a resolution. Best wishes for you and your family 💕", "Yeah but son is home now and everything is better. He could acknowledge her birthday and at least show he cares about her.", "Validating feelings does not require an apology", "Lot of people validating it though. Honestly if by 15 you don’t understand the world doesn’t revolve around you then people forgetting your birthday because the life of their child takes higher priority than some party or formal acknowledgment is a good wake up call to that fact.", "I also think about myself when I had just turned 15, and I have always been extremely empathetic and compassionate. What I was NOT was open with people about my feelings. And that is something I didn’t learn to do properly until well into adulthood. I think all of this is being overshadowed by the awful things the BIL said and we are forgetting that all the niece did was say she felt a little hurt that her uncle didn’t acknowledge her birthday, and then she asked if he could validate her feelings. And no way would I ever had have the guts to ask that from someone.\n\nSo while she may need to work on timing and understanding what others are going through, she is doing well in expressing feelings in a pretty mature and respectful way (according to the OP).\n\nWe all have different aspects to work on. And I just think this is an opportunity and doesn’t have to be some awful thing that causes pain for both the OP and his niece. He can express his feelings and experience a little too, in an age appropriate way. she doesn’t sound like some massive brat, the BIL does, but the niece not so much.", "This is the answer OP. It's not her fault that she doesn't understand what you've been going through. I would never wish that on anyone! And it's a sign of trust that she opened up to share her feelings. You dismissed them, though and I think it's worth having a heart to heart about it later. She needs to be empathetic to you and the whole situation, but let's face it. You do too, when you have the bandwidth. She likely also spent a month worrying about her cousin, without really knowing what to do with all those emotions, and her mom's attention was likely pretty split between trying to care for her family and help with yours. No one is at their best in that scenario and this sounds like a pretty sad birthday for her, and coming on the backs of multiple years of COVID birthdays? We need every celebration we can get. Life is precious. \n\nMy best friend lost his 5 year battle with leukemia the day before my mom's birthday. Safe to say that none of us were in a celebratory mood that year, or even the next few. While my mom would never complain about it, or center herself, I can still recognize that it must have been hard for her, and when I was able, I tried to spend intentional time with her to celebrate belatedly. Idk. I think there's room for you to do that too, when you can.", ">Again she's a teenager\n\nexactly. She should be old enough for the nostalgia of a birthday party to wear off. it's *normal* to not have everyone show up to a b-day party. growing up it, was always my parents, brother and a cake. maybe a card from the grandparents.", "so you want him to acknowledge that he hurt her feelings by making her grandpa miss her birthday? that isn't something that should be validated, because its bullshit. BIL was guilt tripping OP for his son being in the hospital. nobody in this scenario validated OPs feelings of....being upset because his kid was just in the hospital for a month. what world are you in that the person being piled onto in a situation like this is the AH?", "Amen! Validating others emotions is a habit of highly successful people, so obviously by doing so gives something back.", "You’re very welcome, of course! I wouldn’t insult someone like that who is a genuinely kind person. My apologies for the confusing wording and thanks for giving me a chance to correct how it sounded. I didn’t realize how it came across as if I was including everyone when that wasn’t how I intended it to be.\n\nI hope you have a great night, and know that you’re not in the wrong here either and have nothing to apologize for! \n\n💚", "It's not that they didn't show up. It's that no one from a full side of her family even texted her. That'll hurt most 15 year olds feelings, as someone who works with 15 year olds lol. That's why apologizing first and explaining simply what happened after helps. Her feelings are validated and she actually understands what happened. Here all she took away from this was that she is not important to that side of her family. That's it.", "Not that he hurt her feelings. That her feelings are hurt. It's not about blame", "No, they're not. But what does OP lose by validating her that 'yes, it sucks to feel ignored on your birthday \"", "what do you want the OP to say?\n\"I'm sorry that my son was in the hospital for a month and didn't have the time, the energy or the mental faculty to stroke your ego, and i still don't.\"\n\nif the teenager had the presence of mind to understand any reasonable apology... they'd ever have asked, and the OP can't be held responsible for how somebody *feels*.\n\n\nyeah, i can understand how it might hurt their feelings, doesn't mean the OP did anything wrong. reality being harsh, it's entirely possible op's son may not have lived much longer (i don't know what they were in for... but a month-long stay is rarely a pleasant matter, to say the least.)\n\nthe BiL is the full on asshole, here.\n\nthe niece isn't an asshole because her feelings were hurt.,, rather because she was pretty freaking clueless to say something when they were visiting a kid who just got out of the hospital. still not a large one, enough i'd just move on.", "I don’t think it shows she’s less important. There was extenuating circumstances, her father took it too far. He told her it slipped her mind, like I said. Obviously, he would only be thinking about his son", "Yes he should have only been thinking of his son. She's still only 15. I know that doesn't seem young but trust me we do a lot of growing up in those years. Her father clearly isn't helping by telling her no one cares either. This would've been a great time to clear the air between him and his niece and just explain what happened and why. Everyone said she's old enough to understand but she hasn't been taught to do that yet (assuming from her father's reaction at least)"]}