{"id": 6595, "submission_id": "104cxpb", "title": "AITA for not getting my girlfriend food and refusing to share?", "selftext": "It’s the first week back to work from the holidays and I work for a start up that deals with taxes. This is the most stressful time of year for us because W2s are about to arrive for people. This is only time of year that I voluntarily work extra hours so we don’t have to deal with it later, plus we get a bonus if we work harder. I was able to get ahead so we are ready. Already on 45 hours this week already plus tomorrow. \n\nI also started running since the gyms are packed. So, finished work then went for a 3 mile run. Got back and nothing filling in the fridge. I made the mistake of not preparing for this. So, I went to get food. Asked my gf if she wanted anything. She likes to play the game not asking for anything but wanting something or taking forever to pick a place. Normally I humor her but I didn’t want to this time since I was very hungry. She said she didn’t want anything. Went and got a combo meal from a place I barley eat since my gf doesn’t like it. \n\nGot home and went to town. Gf was confused becuase I didn’t get her anything. I reminded her she said she didn’t want anything. She said I could picked her up something and I said you don’t like this place and I’m not gonna make two stops. She got upset and tried to take my fries, I said no cause again, she said she doesn’t want anything and she doesn’t like their fries. I told her if she wanted something to go and get it. She walked away upset.", "created_utc": 1672959103, "permalink": "/r/AmItheAsshole/comments/104cxpb/aita_for_not_getting_my_girlfriend_food_and/", "score": 230, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > By always humoring her I set an expectation that I will always get her something but I took the chance to get something I want.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. As the saying goes, play stupid games win stupid prizes. I never understand how people can be like this. They say one thing then get all surprised pikachu face and you do as they ask.", "NTA. mind games need to be left to at the door.", "NTA. I honestly have never understood why other women think they’re cute by acting this way. It’s really irritating and immature behavior.", "NTA, but if you noticed the mind game already, you should have done that every single time it happened since now. Don’t let her think that acting that way is acceptable by always giving in, waiting for her taking forever to decide etc. You proposed, she said no, you proceeded. This should just be your normal routine. If sometimes you want to be nice and still bring her something, why not. It would be different if she just asked you to bring her anything, because anything is something, so she would have asked. But don’t let unhealthy habits install into your relationship, especially if you know she does it on purpose, expecting you to figure it out.", "NTA\n\nI hate this insipid game of ‘guess what I have want when I don’t even know what I want.’ As a society, we need to do better at communicating our wants and needs more directly, and also not negatively judging people when they are direct.", "Tell her you left her food at the corner of \"I don't want anything \" and \"Why didn't you get me something\" \n\nThose streets can be found on the roundabout in the town of \"Nobody is a mind reader\" \n\nSeriously,  what kind of nonsense is that? If you say I don't want anything,  that's what it means. \nWere you supposed to run down the list of every restaurant nearby asking if she wanted something from each one? \n\nI don't understand why people do this..\n\n\nNTA\n\nETA: NTA", "NTA. She literally said she didn't want anything, so the only person she has a reason to be upset with is herself. You're not responsible for feeding her and she didn't ask you to get her something. And it sounds like she's perfectly capable of going out and getting her own food.", "NTA\n\nIf she said she didn't want anything, she has to own that. It sounds more like an attempt to manufacture something to be mad about in place of something that would be unreasonable to be mad about that she did not want to articulate.", "NTA, she’s a child. It’s boring. Pandering to these games is not your responsibility and will get old, quickly.", "NTA", "NTA - you asked her and she said she didn’t want anything. Not your fault you took her at her word.", "NTA. Especially because you stated that she has played this \"game\" before. Not everyone has the patience to humor other people's indecisiveness when they're hungry and tired. Maybe she will be courteous and mature next time and give you an actual answer that she means. If not, that is no one's problem but hers.", "NTA but you could have made it clear you're not playing, since you know that she does this. saying something like \"if you don't ask for anything i will not get you anything, i'm tired and hungry and in no mood to be cutesy\" would have preemted this reaction and probably avoided the conflict.", "Totally NTA. FAFO man.", "NTA, you asked. She said no. You only would have been TA if you didn't ask.", "NTA this has always been one of the dumbest things I hear about people doing.\n\nIf you want food **fucking ask for it**. Don't be all \"no I'm fine\" and then try to eat the other person's food. Unacceptable behavior lol", "NTA \n\nBut you are asking for trouble. I am not saying condone the behavior. I am just warning you that unless this is actually discussed and resolved together she will hold it against you.", "NTA\n\nShe should grow up snd not steal your food. These women never learn to not touch a mans food", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIt’s the first week back to work from the holidays and I work for a start up that deals with taxes. This is the most stressful time of year for us because W2s are about to arrive for people. This is only time of year that I voluntarily work extra hours so we don’t have to deal with it later, plus we get a bonus if we work harder. I was able to get ahead so we are ready. Already on 45 hours this week already plus tomorrow. \n\nI also started running since the gyms are packed. So, finished work then went for a 3 mile run. Got back and nothing filling in the fridge. I made the mistake of not preparing for this. So, I went to get food. Asked my gf if she wanted anything. She likes to play the game not asking for anything but wanting something or taking forever to pick a place. Normally I humor her but I didn’t want to this time since I was very hungry. She said she didn’t want anything. Went and got a combo meal from a place I barley eat since my gf doesn’t like it. \n\nGot home and went to town. Gf was confused becuase I didn’t get her anything. I reminded her she said she didn’t want anything. She said I could picked her up something and I said you don’t like this place and I’m not gonna make two stops. She got upset and tried to take my fries, I said no cause again, she said she doesn’t want anything and she doesn’t like their fries. I told her if she wanted something to go and get it. She walked away upset.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. She very easily could have told you, “I want X.” And if she doesn’t like the place you chose, why would she want food from there anyway? Good grief.", "NTA. She should use her words and say what she wants.", "NTA, why say you don't want anything and then turn around and get mad at you for not getting her anything? Sounds like she is looking for a reason to get mad at you. You did the right thing though by putting your foot down and not letting her get away with that. If you didn't, she would push the envelope and do that every time.", "NTA but next time warn her that \"No\" means you're not getting any of mine. And stick to it. Lesson learned???", "NTA is not cute it is manipulative. If she wants something she needs to speak up otherwise take her at her word.", "NTA. And please keep buying food for you only when she plays this game. Maybe she will learn to decide or stop the games.", "NTA - and well played, sir.  Well played.", "NTA. People who pull shit like that should be completely shunned by society and made to stand in the corner when they do it. No one worth knowing would do something that obnoxious.", "NTA. Maybe she'll learn from tjis.", "NTA, don't play the mind game with her. Either she wants something and should say such, or doesn't. You're not a telepathist. She could've even texted you if her mind changed and/or asked if you could grab her a snack.", "NTA\n\nYou are not a mind reader.\nShe is a big girl and either needs to say what she wants or accept that you will take her at her word when she says nothing.", "Unless your gf is 14 you've got a long row to hoe, dear. NTA You need to decide if her games are worth it.", "That’s toxic behavior that wasn’t corrected when she was a child. Maybe she’ll figure that out in her next relationship.", "NTA Play stupid games, win stupid prizes.", "NTA My husband has literally told our server before when ordering that he doesn’t want anything, he’ll just eat some of mine……excuse me? I want mine, if you want some order your own, drives me nuts! If I say something he pouts and says I’m being ugly, jeez!", "Ughhhh NTA. I have always hated when people do that shit. If you want something, say so, if you don’t, don’t try to eat mine. You said you weren’t hungry, that’s a YOU problem.", "Mostly NTA, she should have expressed that she wanted something. Since she told you she didn't want anything, she didn't get anything. \n\nTelling her to go and get it was definitely rude, and you seem to know your partner well enough to know she would have liked something. Making a second stop isn't a huge deal. \n\nNTA, but not thoughtful. She should have used her words.", "NTA - but if there was no food and you know the game she plays, you should have gotten something for \"yourself\" then gave it to her - which would have made you 'thoughtful and sweet'.  Lesson learned?", "Just throwing this out there: For many women, sharing food is an indicator of intimacy. So, on one hand, a woman will decline food, then want to eat from her partner's plate in order to gauge the level of intimacy in the relationship. It's infuriating, but it may also be an explanation...?", "NTA but remember yall are in a relationship, and do you really want this to be the way your relationship goes? Is this the hill you wanna die on? Is it worth ending up single?", "Me either. Like they get to overrule their partners and take their food. It’s selfish and far from cute.", "I'm a woman and I also find this very irritating. But men in my family do this also.\n\nMe:  what do you all want to eat?\n\nDad/Bro: Anything.\n\nMe: Ok, we'll get food from XYZ place.\n\nDad/Bro:  They don't have good vegetarian options. Their food kinda sux. We just had that last week. etc etc etc.\n\nMe: Fine you pick.\n\nDad/Bro: Ok, we'll think about it and get back to you.  \n\nThey don't. And another version of the same conversation happens again. \n\nMe (internally):  AHHHHH!!!! MAKE UP YOUR MIND ALREADY!", "He made it clear when he came home without any food for her.", "We have but nothing. Still does it", "Wouldn’t you say he already stuck to it?", "If I keep doing it, she will continue to do it. We spoke about this but nothing. So action is the only thing I could do.", "She can ask for it or stop expecting him to read her mind. He isn't rude, he is fed up of her behavior. She CAN order food if she wants it.", "> Telling her to go and get it was definitely rude\n\nWhy? OP already offered and she said no. OP shouldn't have to go get food for her after.", "The lesson to me would be she is high maintenance and run.  The GF should learn", "So be manipulative and enable her existing bad behavior. Any more stellar advice for this guy?", "What? No, that's terrible advice.. \n\nOP has no lesson to learn here, because OP did nothing wrong. \n\nThey're both adults, he asked if she wanted something,  she said no. \n\nBuying something for \"himself\" just to give to her is just letting her think this behavior is fine. It's not fine,  OP has talked to her about it before and she still does it. She should not be encouraged.", "> you should have gotten something for \"yourself\" then gave it to her\n\nNo. She should be an adult and ask for food if she's hungry instead of saying she doesn't want anything.", "I said there was nothing filling. We had food but nothing to fill you up after a long cardio work out.", "That’s fine, but tell me you want food", "If she breaks up with him because he didn't get her the thing she said she didn't want,  then bullet dodged for OP. \n\nA discussion should be had for sure, but OP did absolutely nothing wrong here.", "You did the right thing. I used to pull the same crap when I was a kid and into my early 20s, not because I thought it was cute or because I enjoyed playing games but because of childhood damage. But after going hungry a few times I realized people were genuinely offering, it wasn't a bad thing to accept or to be hungry. \n\nNot saying that's what your girlfriends deal is, but hopefully after doing this a couple more times she'll just say what she wants.", "NTA\n\nI was ready yo call you an AH until I got to the part where she said she didn’t want anything.  That’s her problem at that point", "NTA, she was taken at her word, so she needs to grow up and deal with the choice she made!", "NTA, she's a grown individual who is able to communicate her wants and needs. At a certain point if someone is playing games and you no longer want to, you need to show them that they don't win prizes", "NTA, it’s not a difficult concept…no means no. You asked if she wanted anything, she said no, she didn’t get anything. Then she’s mad at you? That’s immature and unreasonable. You said you have spoken to her about this issue before and she’s still doing it, so you have no choice but to take action…in the form of listening to what she said a. If she wants something, she can tell you that when you ask. You are not a mind reader.", "Easy NTA.\n\nI don't know why people don't get this, it's such a simple concept:\n\nYou: Do you want anything to eat?\n\nOther person: No.\n\nThat's it. That's the end of the conversation and the end of the issue.", "ok as a woman i have done this. i only do it on my period (because i’m in pain and could care less) and i was about to go on a 5 hour road trip with my 2 younger cousins and an aunt and uncle so we stopped at the bakery. i said i didn’t want anything but my uncle, the wonderful guy he is, bought 2 things for “hinself” and when i asked for a bite he gave me the whole thing. should OP have bought something? probably. is he an asshole for not? nope. in summarisation NTA but if he knows his partner he should have gotten a little something extra", ">Is it worth ending up single?\n\nAbsolutely yes.", "Yup, husband says I can’t decide on food but this is usually our interaction:\n\nHim: I’m hungry, what would you like?\n\nMe: I am okay with anything, you choose \n\nHim: No, you choose\n\nMe: Okay, how about _____\n\nHim: are you sure? There are other places \n\nMe: yup, I’m sure.\n\nHim: are you sure sure\n\nMe: welp, not anymore. You choose\n\nHim: just choose anything.\n\nMe: nah I’m good\n\nHim: so indecisive", "NTA - It's so strange to me that people say they don't want food and then get mad when you don't get them any. I think it's time you break her of this bad habit.", "NTA,  is your girlfriend a child.  She did not want anything and doesn't get to eat off your plate (fries) I have been married for 38 years and I don't share off my plate.\n\nGF is on her own.", "Nta\n\nIf she had changed her mind then she could have texted you. Unfortunately your crystal ball is not currently working and you need her to properly communicate if she wants food.", "NTA and I can’t stand when people do this. Don’t touch Joey’s food! \n\nIn all seriousness, can you deal with this the rest of your life?", "NTA. It's so annoying when people do this. Like i really like food and I always know what I want and say it. Don't play games. Be clear.", "NTA. \n\nI, unfortunately can be like the gf. My husband doesn’t even entertain my antics anymore and I deserve it. 😂", "NTA. She specifically said she didn't want anything. She needs to learn not to play stupid mind games.", "NTA. If my husband asks me if I want food while he's getting food, and I say no, he calls me as he gets to the place to double check.  If I say I still don't want anything, He. Does. Not. Get. Me. Anything. If he gets home and I lament my decision that is on me. GF is using \"womanspeak\" instead of saying what she means and meaning what she says. OP doesn't want to spend his life guessing what she is *actually* saying versus what literally emerges from her mouth. I bet the gf says \"I am cold\" instead of \"will you hand me a blanket\".", "Hear hear, and an upvote", "Agreed. I don’t think there’s anything wrong with maybe wanting to pick off a couple of fries (we’ve all gone weak in the knees at the smell of good French fries when we thought we weren’t hungry), but to purposely say that you don’t want anything and then get mad when they don’t get anything for you is just fucking annoying", "Yep my boyfriend, who will devour practically anything, is the one that’s usually hungry.  But if he doesn’t make a decision, I either won’t make it or we won’t get it. Make a decision or you’re not eating.", "Or she should grow up and communicate like an adult? Encouraging this behavior is absolutely not what OP should do.", "I've implemented a rule in my group that if someone rejects a suggestion they need to make one otherwise their objection is ignored.", "Hmmm I wasn't aware that I had an alternate account... \n\n\nThis is almost the exact conversation I have with my husband regularly.", "she could talk like an adult. that’s very reasonable and no OP shouldnt be supporting third behaviour but it happens", "NTA. I hate people who act like that. So ridiculous.", "NTA. God I hate people like that. “I’m not hungry/I don’t want anything.” Then they either try to steal half your food or complain that you should have known they were in fact hungry or that the smell would make them hungry.", "NTA\n\nI haaaaaaaaaaaaaate when people (not just other women, anybody) do crap like this. I would be so annoyed if I told my husband I didn’t want any food and he got it anyway. He would be equally annoyed if I got him sone after being told he didn’t want anything. It’s literally so stupid. It’s not cute or endearing or manic pixie quirky, it’s just obnoxious.", "NTA, this!  I hate this!!  I never understood this game and have a tremendous dislike for it.   It's a waste of my energy.   Unfortunately, this probably will continue.   Next time,  eat somewhere else.  You might have to do this a few times before she learns that you aren't playing this game anymore.   Do this,  and she will have to learn.", "Nta. Play silly games, win stupid prizes. In this case, no food because she didn't ask for it.", "NTA.  You asked she declined,  done! She is not a toddler,  do not apologize for this crappy behavior.", "NTA\n\n>She said she didn’t want anything.\n\nThat's all I needed to see", " NTA-but having a hangry gf can be playing with your life. It can get ugly when you don’t feed them.", "I think this often goes far deeper than women trying to be \"cute\", and that that's just the excuse they tell themselves rather than addressing the deep underlying issues causing this behaviour. I used to do this, and it took a long time to realise it was a side effect of a deeply internalised and subconscious belief that women shouldn't eat, or be seen to eat, because they should be skinny to be attractive. It's a difficult and constant battle for your body to want to eat and your brain telling you you shouldn't (resulting in you rejecting the offer of food and then wanting it when it's in front of you). \n\nBut then again, that's just my experience and I'm highly likely projecting. When you're less busy, maybe have a gentle chat with lots of reassurance? Currently, NAH but if it turns out she is just trying to be cute, N T A", "I tell my partner to guess where we are going. \n\nThen take him there.\n\nDrives me up the wall.", "Yeah, this works really well. We call it Offer/Counteroffer.\n\nIf someone suggests something and you don't have a counter offer, you have to go where they suggest.", "Must be a great restaurant. Keep hearing about all these people driving up to it.", "NTA.", "This is the classic example of \"play stupid games, win stupid prizes\". \nNTA", "Honestly what’s the point of playing immature, stupid games like that? You want something then be a grown up and say it or shut your mouth when you get nothing after saying that’s exactly what you wanted. People who play this shit are just beyond ridiculous. \n\nNTA.", "NTA. You offered her the option. \n\nAlso I hate sharing when I'm hungry, even my husband knows that.", "NTA nobody touches my food and if they say they don't want anything I take them at their word. Life is too short to put up with all this nonsense.", "NTA she said she didn’t want anything, so it makes sense not to get her anything. Don’t let her childish behavior make you feel like an Ahole.", "NTA - this is my husband - he is the only person who has to ask the drive through person for more time to make a food decision, and it will always be two cheeseburgers and a large black coffee.  I will ask him what he wants as I go into the store and it’s always nothing.  But then, when I come back, it’s always how come you didn’t bring me anything…so, in order to have a successful relationship of 46 years, I just get him something.  You might try it.  She’ll just think that you care enough to get her something.", "NTA. Why do women do this?", "NTA\n\nShe shouldn't be playing stupid games. If she wanted you to get her something she should have said when you asked her, not expect you to read her mind.", "Besides the mind games, you can’t just decide what she likes. If she wanted fries, just give her some?\n\nOr be adamant and don’t. But I don’t like that you just didn’t give her some coz you were convinced she wouldn’t like them.\n\nNTA, coz her games aren’t fun.", "May I use the “all surprised pikachu face”?  It’s the best expression I have heard in a long time…", "She fvcked around and found out", "I (41,f) just hate this behaviour. Just say what you want. No games, just say what you want. It is for your own benefit. You get food and your partner isn't annoyed. Even this \"just get me something\" or \"you know what i want\" is annoying, why not make a choice? Why leave it to me and then be unhappy with what i bring back.\n\n(My partner never is unhappy with what i bring back but i hate making his choices. Especially since he never let me get away with \"Choose for me\" Hypocrite....)\n\nNTA", "^ while this game the gf plays is annoying, he apparently usually gets her something or splits his food so that's probably what she was expecting. \n\nChanging the pattern without any real warning is not necessarily asshole behavior, but you had to know what you were doing when you were driving home with that single order from the place she doesn't like...\n\nHonestly, you should've put an end to this behavior before now. It sounds like it's a routine you don't enjoy, but you normally have the patience to just bite your tongue at it. That's not always a great solution.", "So polite and Canadian for you to ask permission of a stranger on the internet to do something they will never know you are doing!", "For many years, my husband and I would have the same conversation on the way home from work (we commuted together) I would say “what do you want for dinner” his reply was always “I don’t know, what do you want to have?”,  my response was “ I want xxx” his response was “I don’t want that”.  My response “ okay, then what do you want?”  His response - “I don’t know”.  My response “ it’s not a menu, you need to come up with something”.  I feel your pain.", "So do you usually get her something or split your food? Why would she be surprised this time in particular?"]}