{"id": 6611, "submission_id": "104nj5u", "title": "AITA for making something difficult for my son about myself?", "selftext": "I had a son 18 years ago. My husband at the time pressured me into having a child despite knowing that I never wanted children. He then passed away in an accident and I was left alone with a child that I knew I could never care for like he deserved. I gave him up when he was a year old. \n\nI’ve tried my best to not think about him and have been... living. I remarried and am alright.\n\nWell he recently reached out and made it very clear he wasn’t interested in a relationship. We met at a restaurant and he seemed very defensive and there was quite a lot of tension. He asked me a couple questions about certain mental illnesses running in the family and I answered all of them. \n\nWhile I was getting ready to leave, I asked him if he goes to college/university. Just to get rid of some tension. He said he does and he even got a volleyball scholarship. I was a volleyball player too and got a scholarship for the same school. \n\nI told him what I mentioned, called it a cool coincidence. He rolled his eyes at me and said “it isn’t a coincidence if you’re my biological mother.” \n\nI didn’t know what to say to that. \n\nHe continued, “What? Is it too much for you to handle? I’m sorry for having something in common with you, my actual mother. My bad for being born.” \n\nI said I was sorry but he kept rolling his eyes. I began to feel overwhelmed and I know this isn’t fair for me to say, but he was beginning to remind me of his father and I ended up saying “look I’m sorry but I never wanted to be a mother, you’re allowed to be angry but please understand that I was forced into having a child I never wanted.” \n\nHe went “way to play the victim” before storming off. \n\nSafe to say, I feel terrible. The only people who know about this are my mother and sister and even they said that I was only thinking about myself in that moment and I shouldn’t have brought up anything and just answered his questions. They said that I made it about myself when it’s clear that the kid was having a hard time facing me already. My sister even implied that I was a little self centred. Maybe this isn’t the best place to ask but I’m too ashamed to talk about this to anyone else. My sister also said it wouldn’t hurt, AITA?", "created_utc": 1672988499, "permalink": "/r/AmItheAsshole/comments/104nj5u/aita_for_making_something_difficult_for_my_son/", "score": 53, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I’m the asshole because I did make it about myself. I know I haven’t raised him but I’m still the adult and technically a mother in this situation. I should’ve kept my mouth shut, I suppose.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH. You weren't trying to \"make it about you\", you were only trying to relate to him. Unfortunately, because you abandoned that child he is going to have bad feelings about you whether or not you like it. And that does not make him an AH, that is a normal reaction. These are the consequences of your actions whether or not you like it. Maybe just apologise and move on. It really seems like neither of you want a relationship.", "Whew, alot of adoption shit on AITA lately.\n\nAn adoptee here YNTA. I am also reunited w biomom.\n\nIt's hard to navigate adoption reunion, and neither of you are AH. He's valid in his confusion/rejection and you are valid in your autonomy. Could you have just been kinder, for sure. He's also 18, which is really still a kid. Sometimes adoptees just want to convey hurt, (understandable, but other people are not outlets for pain) show they are real people and impress upon biomoms that they are real actual people who were given away.\n\nThe problem with adoption reunion is expectation, unconscious or otherwise. Neither party actually being prepared to meet emotionally/psychologically. He was abandoned, that is real for him. You didnt want a kid, that is real for you. Neither doing the emotional work before meeting to have true empathy/healing/knowing how reunion can amplify feelings.\n\nIf you feel bad and feel up to it, maybe just reiterate that you don't want a relationship and share information about his father with him (what music he liked/etc) medical history. Even honestly some facts about yourself. When I met my bio mom I was prepared and ready to be kind, but even just knowing details about her really took some of the pain of not knowing away. If you need to talk DM me, I can recommend some books on how adopting out a kid brings shame/healing or put you in touch with my bio mom to help you realize you have nothing to be ashamed about, be kind to yourself. But also maybe try to understand where he was coming from as well. Not easy to not know where you came from or feel like you aren't good enough. Even if adopted family is a happy one it doesnt discount the trauma being adopted brings. Sending good vibes\n\n&#x200B;\n\nEditing to add: Most male adoptees dont seek out bioparents until middle age statistically. If he found you being that young, asking about mental health. He might really be struggling. Could be where some of the feelings come from. Hope he has a good support system.", "Nah. You are two humans navigating a difficult at best issue. It doesn't sound like either of you were malicious, just nervous and uncomfortable", "YTA. It probably would have been best to not meet up with him if you felt this way. My mom abandoned me when I was pretty young and it’s extremely difficult to deal with. You start to have feelings like you just aren’t good enough and you must be worthless if your own mother didn’t want you.\nAt the same time I support giving up children that you don’t want and/or can’t take care of. It usually gives them a better life. You should have not met up at all or at least given him comforting words. There is no reason to say what you said other than selfishness and bitterness.\n\nEdit: one last thing, you made the decision to have a baby. Whether you wanted one or not. Bringing him into the world was not his choice and you basically blamed his own birth on him.", "NAH.\n\nYou both were forced into awful situations neither wanted to be in and as a result any communication between both of you is plagued with tension and aggression on both ends. You were honest about your feelings towards your son from the jump and you did what you thought was best for him in the moment, but your son is also valid in his resentment towards you for that. The foster care / adoption system sucks. He sounds like he’s reeling from 18 years of pain, and I genuinely hope he gets support and help through it.\n\nHe said he didn’t want a relationship, but he is also the one that reached out to you. Hopefully, now that time has passed, your relationship between each other can eventually mend, if it will heal you both.\n\nThe only AH here is your late husband, for doing this to both of you.", "NTA \n\n&#x200B;\n\nBut he sounds like he's had a stressful time and assumes you've just abandoned him, actually meeting you overwhelmed him, he probably doesn't want to hear an explanation after 18 years of wondering why you decided to give him up", "NTA it sounds like he needs some help to get through whatever trauma he has from being adopted but that's not your responsibility. Imo you did the right thing. You didn't want a child and weren't prepared or mentally able to raise one. I hope you don't blame yourself too much for this interaction, as his view of you from the beginning makes me believe he wouldn't have liked anything you said regardless.", "This is a hard one. You gave him up for adoption. When he reached out to you, you agreed to see him. Not surprisingly,  he's very angry with you. Rather than deflect his anger, you told him the truth: that you were not prepared to have a child. \n\nI think that where things went astray was in your telling him that you wanted an abortion. That guarantees a negative response.  Who wants to be told that they should have been aborted? The kinder response would have been to skip over the decision to abort and, instead, to focus on your inability to raise him. That puts his existence in a more positive light and focuses on the fact that (whether or not you wanted to abort him) he's better off with his adopted family. \n\nI don't think that you were malicious.  But I can't blame him for being angry. NAH", "Gentle YTA for saying you never wanted to be a mother and did kinda make it about yourself. There’s nothing wrong with not wanting children and I am sorry you were coerced into having one. But, he already knows that and was already on the defensive and probably angry about the whole situation (which is also perfectly valid.) Being overwhelmed and reminded of his father isn’t a reason to just blurt stuff out. You should have just let him leave when the purpose of the meeting was over.", "NAH i think\nFor checking medical backgrounds you don't need to meet & i think it would went way smoother via email.\nBoth of you have valid emotions and I don't think it was wrong to tell him you never wanted to be a mother. Sometimes truth hurts but he chose to be verbally aggressive towards and you don't have to nod and say yes to this.", "YTA.\n\nWhile 18 is legally an adult, he's barely an adult, and 18 year olds are going to react like teenagers in stressful and difficult situations. \n\nI assume he reached out like so many adoptees do, because he wants answers and to learn more about himself. That was probably a scary thing to do and I imagine that he has a lot of mixed emotions about you giving him up for adoption, and while yes, he was giving you some attitude, you should have been the mature person in the situation, but instead you tossed a grenade at it.", "NTA. He came to this meeting already harboring a lot of resentment towards you. I have a feeling there is nothing you could have said that would have been the “right” thing to say.  What’s done is done. He made up his mind before he got there that you abandoned him. At this point it really doesn’t matter why. You told him the truth. Now it’s his to do what he wants with it.  I would consider in future, if he contacts you with family questions, to answer via email or text only. And limit the conversations to the matter at hand. Neither of you are interested in reuniting, and you know this, so give yourself a little bit of grace here. He will have to deal with his anger and resentment on his own, and you will have to do the same with your emotions. This is a difficult situation with no rule book to follow. You were both doing the best you could. Try to be at peace with it all and move forward.", "NTA \n\nIf you’re old enough and brave enough to reach out to a parent that put you up for adoption or abandoned you, you should be both of those things to get the answer that they give. \n\nYou were forced into a pregnancy and child that you didn’t want. You did the best thing by giving him to a family who wanted him and love him. He should be happy he was cared enough to receive that treatment. \n\nSome kids get left in foster homes or in some countries sold into servitude or worse. \n\nHe’s going to college. He has the opportunity of a scholarship. He may want a connection but if you don’t he has to respect it.", "I would say YTA and NTA at the same time from two perspectives: on one hand you're NTA because you were just trying to explain your situation rightfully so. Even if he didn't say it, I'm sure he wanted a reason as to why he was given up for adoption and you gave him that answer. On the other hand, I would say YTA because of your delivery. The wording \"having a child I never wanted\" probably cut deep as he's probably already struggled all his life not feeling adequate enough to be wanted. But don't beat yourself up too much. We're all human and you were young and did the best you thought you could have done for yourself AND him at the time. You could have said what you mentioned, \"I'm sorry, but at the time I wasn't ready for a child and knew I wouldn't be able to love you the way you deserved and that wasn't fair to you.\" At the end of the day, he also was being a little hostile (understandably so), and it wasn't helpful for a productive conversation.", "NTA, you went and answered his questions. You didn’t have to do that, but did it out of kindness, much like the adoption. He may not understand it now, but you made the right choice for you and him in the long run.", "NTA. \n\nI don’t understand why he’d reach out or take the effort to find you if he wasn’t interested in a relationship with you. What did he hope to gain? \n\nProud of you for responding to him and be willing to meet with him. Also for the record, you didn’t abandon him as other comments have mentioned. You gave him an opportunity to have a better life than you could have provided. There’s no shame in not wanting to be a mother. Don’t let him or others tear you down because you were manipulated into something you didn’t desire and did what you felt was best for yourself and him.", "YTA for agreeing to meet with him without having a considerate response ready to some inevitable questions. You should have tried harder to focus it on him and not give in to making it about yourself  You didn't have to say that you never wanted a child. You could have said, \"Your birth father, my husband, was very eager to have a child.  After he died in an accident, I felt like I couldn't do it without him.\"", "YTA\n\n> They said that I made it about myself when it’s clear that the kid was having a hard time facing me already. \n\nThey are right.\n\n> My sister even implied that I was a little self centred.\n\nI disagree with your sister's use of \"a little.\"\n\nYou absolutely could have pulled it together for this ONE conversation.\n\n>  I know this isn’t fair for me to say, but he was beginning to remind me of his father\n\nSo you knew it wasn't fair but chose to make it about you anyway.", "YTA. Sounds like your son is more mature at his age than you are at yours. You've had 18 years to deal with giving up a child. The statement of your 18-year-old son that it is not uncommon for children to inherit biological traits from his biological parents is in no means aggressive or unexpected. You could have reacted better to that. And you had 18!!! years to come up with a little more empathetic statement about the reason why you gave up your child. Such as: your father died while I was pregnant and I was unable to give you what you deserved in life at that point.\n\nYou did make it all about you and made yourself the victim, while YOU were the only person in the room who actually made the choices that affected both of you.", "NAH, could you have handled this better? Yes. But honestly, this doesn't make you an asshole. It was a difficult situation for both of you. \n\nBeing an asshole entails a certain amount of malice or obliviousness to other people's needs. I don't think either are true for you. You're a human who could have acted a little different in an emotionally stressful situation. \n\nYou mention that you have a therapist. Talk to them. If your son contacts you again have a plan ready.", "Poor kid. You might not have wanted a kid but he sure didn’t ask to be born to a self-centered (bio) mother. I have nothing else to say other than YES you are the AH. 100%.", "I would say NTA.\n\nI feel like you went in good faith and if you messed up in what you said, it was because you were nervous and unsure of what to say and he went in bad faith. \n\nHe has likely demonised you in his mind to protect himself or possibly been told by his adoptive family to think poorly of you. There is no right thing you can say to someone who will find fault with anything and everything you say. And because he doesn't want a relationship, he was likely always going to find reasons to reject you to maintain distance.\n\nHe was likely never going to be open to anything that might make him sympathetic to you because he wants his narrative that you abandoned him just to be cruel and evil, not that you gave him up because you felt unable to do right by him and had just lost your husband.\n\nHe wasn't open to listening or hearing your side.\n\nAnd I can understand that being overwhelming for you because when we feel unfairly judged, we want to protest and express our side and be heard. You felt like he was making you into a monster that you feel you are not and the way you said it wasn't necessarily what you meant and may have been hurtful, but you felt like you were just protecting yourself.\n\nI think MOSTLY this is just a tough situation all around but that over all, he was the AH here because you can't come in expressing that you hate someone and criticise everything they say and expect them to just sit and take it and not find it distressful or upsetting. He's not the only one with feelings here.", "Gentle YTA. I think this is an extremely difficult situation, and you are both completely valid in your feelings. He probably has his own trauma to deal with, and navigating his feelings around his adoption. It's clear that he only contacted you to get that mental health information, so trying to turn the conversation into his personal life, after he made it clear that he wanted no relationship, left him feeling quite defensive. Saying that you were forced to have him and never wanted him probably didn't land very well. No one wants to hear that. When the meeting was closing, it would have probably been best to just leave.", "NTA.\n\nSou ds like you both have trauma surrounding his birth. He was given up and hopefully has the chance to live a fulfilled life surrounded by love.\n\nYou've gave him the medical information he needed. Which I'm sure most adopted children don't get.\n\nSounds like time for healing, growing & accepting.", "YTA\n\nOf course you are!\n\nYour ex that “forced” you to have a child is also an asshole!\n\nBut this kid didn’t ask to be born! \n\nHe very obviously asked questions about mental illness and was super anxious and uncomfortable! \n\nYou are an adult and he is a kid!  \n\nThere was a never a need to say “I never wanted you, I was forced to have you”. In anger. \n\nI mean he obviously already knows these things as you gave him up for adoption!\n\nBut to say it on the first meeting is pretty cruel. \n\nIf it made you so uncomfortable then you could have simply requested that you answer anything by email and never meet. \n\nBut to articulate to a lost kid that he wasn’t wanted was super cruel and unnecessary! And as the adult, you should have known better!", "NAH and it sounds like you made the right decision to give him up.", "YTA\n\nYou had what, 18 years to get help for your trauma of being forced into getting pregnant? there was no need to dump that on the kid. Please go get help for yourself.\n\nIf he's asking about mental illnesses, I hope the kid is doing well too and has a good support system.", "YTA. You didn’t want a child - got one anyway. Then dumped him off, and couldn’t give him a single conversation without reminding him of how little he means to you.", "YTA for having a child you didn't want because \"pressure\" and then making the kid feel like crap when he finally gets the nerve to reach out to you.  I feel so bad for your son.  I'm sure he wishes he never gave you the chance.  Telling a child you never wanted them is the most mind-blowingly callous and cruel shit I can think of.  Seriously OP...get help.", ">I told him what I mentioned, called it a cool coincidence. He rolled his eyes at me and said “it isn’t a coincidence if you’re my biological mother.”\n\nThat's not genetic! Not at all! It's just a cool coincidence, really.\n\n&#x200B;\n\nI'll go with NTA. I think you did the best you could and just tried to be nice, tried to break the awkwardness, and he didn't react well to that.", "YTA. I have experience on several sides of this kind of situation (as a bio mom, sister to a brother who was adopted out and then reunited but not embraced by our mother, and daughter of a dad who didn’t want to be a dad and dipped). \n\nI have a firm belief from all these experiences that just because something is true (to you) doesn’t mean it needs to be shared (with the other person). I have a good relationship with my daughter (open adoption) but there are things that I would never ever share with her. They would only hurt her and not knowing won’t cause any damage. Sometimes I tell her a version that is best for her, the kindest version. \n\nSame with my brother. My mom did a lot of what you did when they reunited. It really hurt him to hear. I’ve built a separate relationship with him and it’s taken a lot of work to help him get over her “technically but emotionally harmful” statements. My mother is narcissistic and how she dealt with the reunification screamed that. \n\nA better phrasing might have been something like “I wasn’t capable of raising a child and made a decision that was best for you”. Not capable due to lack of wanting to - but much less cruel for the son to hear. \n\nThink before you talk. This is a human with feelings.", "You are the massive asshole.\n\nHoly crap, OP, are you sure you don't want to just tell him he should have died with his father, while you were at it? The fuck is wrong with you?", "I know it's 18 years later but... Birth control and a spine would have prevented all the drama. YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI had a son 18 years ago. My husband at the time pressured me into having a child despite knowing that I never wanted children. He then passed away in an accident and I was left alone with a child that I knew I could never care for like he deserved. I gave him up when he was a year old. \n\nI’ve tried my best to not think about him and have been... living. I remarried and am alright.\n\nWell he recently reached out and made it very clear he wasn’t interested in a relationship. We met at a restaurant and he seemed very defensive and there was quite a lot of tension. He asked me a couple questions about certain mental illnesses running in the family and I answered all of them. \n\nWhile I was getting ready to leave, I asked him if he goes to college/university. Just to get rid of some tension. He said he does and he even got a volleyball scholarship. I was a volleyball player too and got a scholarship for the same school. \n\nI told him what I mentioned, called it a cool coincidence. He rolled his eyes at me and said “it isn’t a coincidence if you’re my biological mother.” \n\nI didn’t know what to say to that. \n\nHe continued, “What? Is it too much for you to handle? I’m sorry for having something in common with you, my actual mother. My bad for being born.” \n\nI said I was sorry but he kept rolling his eyes. I began to feel overwhelmed and I know this isn’t fair for me to say, but he was beginning to remind me of his father and I ended up saying “look I’m sorry but I never wanted to be a mother, you’re allowed to be angry but please understand that I was forced into having a child I never wanted.” \n\nHe went “way to play the victim” before storming off. \n\nSafe to say, I feel terrible. The only people who know about this are my mother and sister and even they said that I was only thinking about myself in that moment and I shouldn’t have brought up anything and just answered his questions. They said that I made it about myself when it’s clear that the kid was having a hard time facing me already. My sister even implied that I was a little self centred. Maybe this isn’t the best place to ask but I’m too ashamed to talk about this to anyone else. My sister also said it wouldn’t hurt, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "This is a difficult situation, and I’m going to go with NAH. The kid says he isn’t interested in a relationship but he clearly has a ton of built up resentment against you, to the point he can’t really have a friendly conversation with you. It’s not his fault, he clearly needs help coping with it. I mean, you were trying to relate to him over his education and it instantly spiraled into „my bad for being born”. This conversation wasn’t going to end in any other way, he would’ve felt this way about you regardless of what you said.\n\nLet me be clear, your choice caused this. It was one choice, made years ago, but it was life-altering for him and there was nothing you could possibly do during this conversation to change it. The meeting was stressful for both of you, I don’t believe there was any malice involved, and I can’t really blame either of you for it going badly.", "ESH, him especially. When he reached out and asked to meet, saying he wasn't interested in a relationship, that is shorthand for ,\"I have huge resentment and I don't care if your reasons for giving me up had any validity, I just want to meet you to rub your face in what you did\". If he doesn't want a relationship, any questions regarding medical background can be covered by email. You shouldn't have agreed to the meeting knowing that it couldn't lead to anything positive.", "YTA", "\" I was forced into having a child I never wanted.\"\n\nINFO\n\nforced ! did your late husband rape you ?", ">  you were only trying to relate to him.\n\nNot sure how a bio mother telling her kid that she never wanted him and was forced into having him is relating to him.", "My sister actually told me to post on here because she’s seen quite a few.\n\nThank you so much for the long and thought out comment. Ive been reading it and truly taking it in. I don’t know how to explain but I appreciate it. I am planning on simply sending him an apology text and leaving it at that. Whatever he wishes to do following my message, I will respect. \n\nAnd he didn’t tell me anything about any family, the main focus was the topic of mental illness. He asked about two specific ones and I really truly hope my answers help him as they do in fact run in my family. \n\nAgain, thank you so much.", "I think a lot of people are missing that bringing him into this world was not her choice either. She didn’t blame his birth on him, she blamed it on her late husband.", "You’re right. I don’t think I should’ve met up so quickly and should’ve at least talked it through with my therapist. But I didn’t. It was in part due to my own selfishness. \n\nAnd again, you’re correct. I didn’t mean for my words to come across as “you shouldn’t have been born” and rather wanted to express that “I was in a hard spot” but I went about it in all the wrong ways. I knew this deep in my heart but I guess I just needed to hear it like this. My mother and sister were beating around the bush too much.", "That edit alone is perfect. YTA OP.", "Yeah the explanation of 'I didn't want you' is sure to go down well... /s", ">you were not prepared to have a child\n\nIt's not that she was not prepared, she actively did not want him. Nothing hurts more than knowing your actual parent(s) does NOT want you. The feeling of not being good enough for this world must be (or have been) awfull to experience, let alone having to \"overcome\" that. (The \"\" is because there is no way of actually 100% overcoming that, you just learn different ways of looking at your self worth, learn to cope and manage, and once in a while that feeling grows again but will fade quicker, but it will never truly go away and stay away.)\n\n&#x200B;\n\n>I think that where things went astray was in your telling him that you wanted an abortion. That guarantees a negative response. Who wants to be told that they should have been aborted?\n\nThis is not in the post, where did you get this ??\n\nEither way OP YTA.", "OP gave the child up for adoption because she did not want to be a mother and was forced into giving birth. Why are we judging her now for not behaving like a mother? OP went through a traumatic event and was left to deal with it alone Why are her feelings and mental health not as important as the now adult person she gave birth to?  This person is not her child. There is no existing relationship or obligations.", "> he recently reached out and made it very clear he wasn’t interested in a relationship\n\nHim asking about mental illnesses makes it seem like he wanted a medical history more than a connection/relationship.", "No need to shade the adoptee for having valid feelings", "The \"you should be happy because others' have it worse\" thing is extremely invalidating. Just because other people have worse outcomes, does not mean your situation is not bad! Yay he's going to college! That's so much better than having a mother that loves you and cares about you, instead of you know, hating you and giving you away.", "Idk, even from her perspective I'd still say YTA, because of her actions. She should not have caved in to having a child if she felt so strong about not wanting one, that she gave it away after a year just because her husband died. There are lots of single moms out there making it work, so this wasn't about not being able to, and 100% about not wanting to. \n\nThen giving a child away because of not wanting it, HURTS like HELL. Adoption is already traumatic for children in the best circumstances, but because your \"mother\" actually just doesn't love you? Jeez that's more than just harsh. \n\nThen this meeting, the way she went about it like it was just some random meeting to answer some questions casually in between, way to convey yet again how you don't feel much emotion towards your child, which he definitly picked up on. And actively telling him she didn't want him and was forced to have him, yes major AH moves.\n\nPeople are right to say it's better you give your child away when you don't want it, then try to raise it because you'll be doing so with spite and resentment, but it's still an AH move. Just because it's the lesser of 2 evils does not make it no longer evil.", "Her telling him I didn't want you, was forced into having you is a tactless and crude choice of words.  She could have handled that a lot more tactfully and appropriately, you know in a much kinder way.", ">You didn’t have to do that, but did it out of kindness, much like the adoption\n\n\"I don't want you so go be someone else's problem\" Yes oh so kind of OP to convey such a message to a child (/s). Imagine your parent saying \"I do not want you so here are some new parents, people I don't even know, while I make sure I never have to deal with you again\". Because that's basically what her actions boil down to.", "Thank you for the kind comment. \n\nAnd he truly did just want to know about mental illnesses and he mentioned two specific ones. His questions were very thought out and he seemed satisfied with the answers he received. He really did not want a relationship or “catch up” and while I didn’t mean to, I did cross that line.", ">There’s no shame in not wanting to be a mother\n\nThis! Right here! So important. We are not the sum of our reproductive parts. We are human beings with emotions and feelings. And we all have different wants, goals and lives. No woman should ever be forced to be a mother.", "Thank you!  This is exactly right.  She had 18 years to prepare a considerate response.", "Last I looked, Volleyball isn't a biological trait. Having an inclination towards sport *might* be, but a specific sport? No. That was unnecessarily mean when OP was trying hard.", "No you and other commenters are correct. I shouldn’t have said anything. I only did it because there was so much tension and I felt like asking him about school wouldn’t be too heavy of a question since he had briefly mentioned being busy due to school earlier. This was wrong on my part. Thank you for being understanding regardless.", "I go to therapy, have been going since I gave him up. My sister insisted. \n\nI haven’t been able to go recently and while it is no excuse, I think that’s why I haven’t been making the best decisions. Again, no excuse and I’ll definitely try and book one as soon as possible. Thank you.", "It truly was pressure though. My sister argues that it was force. I understand my faults for everything else but my late husband was not good to me.", "I'm not talking about that, that was extremely rude and uncalled for, especially as it was her who abandoned him. I meant when she said that she also played volleyball which she asked if she was TA for. She was asking if when she responded to him by relating it to herself if she was \"making it about herself\" which she wasn't. Again, I agree that her telling him that is a major AH move, but that is not what the question was asking for.", "No worries at all. I'm glad I could help. My bio mom dealt with a lot of embarrassment/shame about being ready/wanting to parent and I wish someone would have shown her kindness about it. Good luck! Its such a weird thing and not a lot of the population knows how it feels, sometimes just getting it out helps.", "It was her choice. Abortion was legal", "Which isn't taking any responsibility for her choices in life.  I have given birth to 3 children, and unless they are chained up  or being held hostage no one stays pregnant for 9 months and gives birth with zero choice.  Failure to assert her autonomy doesn't free her from responsibility.   In fact, quite the contrary.", "Yes and no. They didn't have to meet up to share medical information. The fact that he met OP in person makes me think that all of his talk about not wanting a relationship was perhaps partly true and partly a brave defensive front to protect from further disappointment.\n\nMeeting in person makes me suspect that he was hoping there would be some little spark of recognition or bond that would heal some small part of his deep wounds. He reacted harshly because there was not. He was hurt and heartbroken. Again.\n\nSeven of my siblings were adopted. Every single one carries some small hope that they were loved at least some tiny amount by their birth parents, even if they never want to see them again or have a relationship, even if they actively hate them. There's no deeper rejection than that of a parent, no matter the reason or how right or necessary the decision to give them up was. Meeting up always holds out the small sliver of hope that if the parent could only see them now, face to face, they would want to know them, would want to make it up somehow.\n\nOP should have passed the information from afar and never gone to meet the kid if she knew she couldn't offer him any closure or comfort. There are times when justifying your actions is appropriate, but it's not the first time your abandonned child looks into your eyes.\n\nOP did the right thing in giving him up, but not in agreeing to meet.", "Read what I said if you’re old enough and brave enough to reach out understand you have to be both of those things when you get your answer.", "He has  an adoptive family. This sub is so wishy washy on adoptive and step parents being someone’s family. \n\nIf OP would’ve kept him he would’ve grown up feeling his mothers resentment and lack of love\n\nLet’s not forget the trauma OP went through being forced to get pregnant, go through with an unwanted pregnancy, birth, losing her partner, and having to make the best decision for a kid she never wanted.", "Why should she have to lie? I understand his feelings may be hurt, but he has a loving family already and he didn't have to reach out to her. She owes him nothing. Her mental health is just as important as his.", "Don't be hard on yourself! This is incredibly stressful situation to be in, and I can't imagine how you are feeling as well. Especially with your own trauma surrounding his birth. Give yourself the space to process this and I wish you all the best!", "I'm sorry you were in a difficult relationship.  If you truly didn't  want a child you never should have consented to getting pregnant.  Like it or not, you consented to that child every day for 9 months.  You consented to carry it or you would have ended it.  He didn't ask to be born.  Maybe there were cultural/political/emotional reasons.  It doesn't matter.  You will never heal from this trauma as long as you continue to blame your husband.  All you are doing is perpetuating the same chronic disempowerment that enabled you to be bullied into motherhood.  I think you need to take responsibility and own that you weren't just a victim so that you can forgive yourself.", "I understood the question of \"making something difficult for my son about myself\" to be his reaching out to his bio mom to get some answers and her making it about herself by crudely telling him that she didn't want a child and was forced to have him.", "I work as a therapist at a crisis centre specialising in pregnancy. We help pregnant people and their families decide what they want to do, we do individual or family therapy and we do mentoring. \n\nThere are a _lot_ of different ways that pregnant people are coerced into either carrying pregnancies to term when they don't want to, or terminating pregnancies that they do want. \n\nCount your lucky stars my friend, that you live such a life where you cannot comprehend this reality that is lived by a lot of people in the world. Abuse does not require the individual to be locked in a literal chain. There are many metaphorical chains that are just as binding.", "You sweet summer child...there are a lot more ways to force someone than holding a gun to their head", "Read what I wrote. I'm not talking about him specifically. I'm saying you act like having a good adoptive home negates the trauma of being adopted. It doesnt. The OP isnt the AH. But shading adoptees having valid feelings of trauma isnt it. They both had reactions they probably weren't prepared for, and as someone in a bio parent reunion from adoption it does bring up a lot of stuff that you simply can't prepare for.\n\nEditing to add, I do agree with you on her trauma is valid and I don't believe she is TA. Neither are.", "Adopted family doesnt take away abandonment trauma. Shes NTA but to invalidate adoptee feelings that are valid is not it.\n\nEdit to add: He also said he didnt want a relationship, seems like he wanted medical info.", "Can't judge about adoptive family because we don't have any info on them, that's why I do not include them when commenting. \n\n>If OP would’ve kept him he would’ve grown up feeling his mothers resentment and lack of love\n\nHe felt that now too, because he was given away due to not being loved and wanted.", "I’m glad you are privileged enough to NOT understand that she did not have an option. She has stated multiple times she was forced to be pregnant. Saying she made the decision everyday to be pregnant is just stupid and it invalidates her trauma and feelings. Believe it or not, women are not totally free, not matter how much we want to believe it. There are still a lot of abusive and toxic relationships, women end up dead for way less. We don’t know what happened so that she felt she had no choice but to have a child she never wanted. We don’t know if her life was in danger, her economic autonomy or literary anything.", "I'm unsure how you could suggest she consented to birthing a child when her husband was telling her you cannot get an abortion. She did not consent, she was coerced. She definitely needs to heal from trauma and have made a better approach, but being forced to give birth is not her fault.", "Perhaps so. Maybe I interpreted it wrong, if so then she is TA. As it stands anyways, it's better if they both just don't talk to each other.", "This is very true.  I don’t believe in lucky stars, though.  I do worry that OP is enabling herself to blame her husband and be a victim instead of taking responsibility for her actions so she can forgive herself.", "Also, she didn't say she didn't have an option.  I think you might be jumping to conclusions here.", "No, she said he pressured her.  The sister used the word force.  We don't know the details.  Even if she was pressured or coerced, she made the poor kid feel like unwanted trash.  I have had 3 children.  I am well aware of where bodily autonomy begins and ends.  This is just a sad and tragic situation all around, but the one who is suffering the most is the child.  Not just for being born unwanted, but being TOLD that. 😪", "Can you link the comment where she states that everyone was telling her she couldn't get an abortion?", "I don’t know what country they lived in but in the West at least he would have had no legal right to prevent her.", "Coercion is not as black and white as \"she could have done something so therefore it's her fault\".", "I didn't say fault.  She felt pressured to get pregnant because her husband wanted her to.  Instead of saying no (for whatever reason), she did and then regretted it.  There has been tragic fallout since, and I think she might be better off to acknowledge her agency so that she can forgive herself (and maybe her husband as well).  So often, the anger and blame we hold against someone else is really anger at ourselves.  It's terrible and not rational, but very normal.", "I understand your point there, and that therapy would be great for this situation, I agree. However, was directing my reply towards your comment saying she consented to birthing the child, which I disagree with as coercion is not consent.", "We don't know that she was coerced.  She was \"pressured.\"  People here are acting like she was r*ped and assuming the absolute worst, which I think is reading a lot into her OP."]}