{"id": 6630, "submission_id": "104y8gk", "title": "AITA for not getting rid off my pets so my pregnant friend could stay with me?", "selftext": "I (f32) have 4 rescue pigeons that cannot be released because of health reasons (e.g. can’t fly). They’re happy birds and have a good life. I live alone in inherited house and half of the top floor is converted into a big pigeon room where they have all their stuff. They’re trained to potty in specific places but can roam around the house exception kitchen. They have their sleep places in the big room and are locked their at night for their safety.\n\nMy friend (we’re not really friends anymore, we were a long time ago, now we just kind of know each other, our lives move down in totally opposite directions) f32, Chantelle, has currently 2 kids and is 5 months pregnant with her third. Her partner was locked up a few months back and she’s about to be evicted because she hasn’t paid rent in 12 months.\n\nOne day, out of the blue, she knocked on my door and started chatting. She told me everything and asked if it would be possible for me to let her move in and she’d pay rent.\n\nI refused saying that I don’t have the room for her and the kids. She told me I could get rid off my birds and they could take the room upstairs.\n\nI said that absolutely not and unfortunately, I won’t be able to help her. She freaked out, told me I was a selfish asshole, that I cannot are doing more about animals than humans and a lot of other nasty things. I kicked her out.\n\nI rarely go on Facebook, I have my old one from uni but I rarely go. Not even 24 hours after I kicked Chantelle out, My other friend messaged me to log in to see what’s happenings and Chantelle was slagging me off everywhere. Postings nasty things And her friends joined her and it was just so very nasty.\n\nI do feel bad though and I wonder if they’re right, perhaps I am the asshole here. Should I have let her stay with me?", "created_utc": 1673021970, "permalink": "/r/AmItheAsshole/comments/104y8gk/aita_for_not_getting_rid_off_my_pets_so_my/", "score": 3891, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole because I refuse to get rid off my pets so my pregnant friend could stay with me. What may make me the asshole is that I won’t agree to any compromise because I kind of don’t want her to stay with me hence the possibility of me being the asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Please tell us which of her friends, after bitching, took her in?", "NTA. Imagine the nightmare if she had moved in!? You never would have gotten rid of her.", "I’m going to completely omit the birds from my judgment. \n\nAn acquaintance shows up on your doorstep. She asks you to move three, almost four, people (including kids and almost a newborn) into your home for nothing. She claims she’ll pay rent but hasn’t to her current landlord in a YEAR. You have absolutely no reason to believe she’s good for rent. (Does she work? Will she be able to work once the baby comes? Does she get/will she get child support?) \n\nYou do NOT want that drama in your home, birds or not!\n\nNTA", "NTA Let her friends harassing you take her in.  No way, 1 person maybe but an adult, two kids and another on the way hell no.  If she was evicted she wasn’t paying rent, you’ll end up with a squatter.", "NTA- you don't have to take her in. Even if the birds were not in the picture and you had lots of space available you would not have to do it for her.", "NTA. Chantelle cannot manage to take care of her responsibilities like an adult but somehow seems to feel entitled to your home. Maybe, one of her enablers should offer their home.", "NTA:  they cant be releaced so why should you,  besides its her fault for getting with a criminal and not yours", "NTA\n\nIf she hasn't paid rent in 12 months how in the heck is she going to pay you rent?  Then for her to come out the blue and ask to move in with two kids and one on the way is over the top.  You have no obligations to this woman.  Who cares what her or her friends are saying on FB.  If they are so concern she can move in with one of them.  She or her friends don't mean anything to you.", "NTA\n\nYou are under no obligation to give up your animals or part of your house for someone that you used to know.", "NTA\n\nShe is getting evicted due to not paying rent, yet expects you to believe she will pay you?? Hahahaha yeah.....\n\nYou did the right thing", "NTA 12 is greater than 5. She got pregnant 7 months behind in rent. Her choice, not your job to fix.\n\nDelete your FB and never look back.", "NTA.", "NTA. Your ‘friend’s’ proposal was not reasonable, and you had every right to say no.", "NTA at all. She's not you responsibility, your birds are though. She needs to take responsibility for her own kids.", "NTA\n\nYou can't just show up at someone's house and demand they throw out their pets.", "Come on. Obviously not, and you wouldn't be even if you didn't have the pets. It's your house. You get to decide who lives there. She hasn't paid rent in 12 months. Why would you believe she'd pay you? If anything, she'd likely become a squatter and end up kicking you out.\n\nVery obviously, NTA.", "NTA times a million. I wonder what the story is she's telling everyone. I mean if it's literally she walked up to your house out of the blue and screamed at you for not letting her move in with her kids, I can't imagine anybody feeling bad for her", "NTA.  Wonder why her friends that are helping her trash you online aren't letting her stay with them?\n\nYou don't owe anyone anything, and her behavior proved you especially don't owe here anything at all.", "Nope", "NTA\n\nPerhaps you might reply on the social media saying you are delighted that she has so many friends who support her point of view and would be willing to house her family rent free, and to rehome their own pets to do so, and that you wish her a happy time staying with them.", "Even if you didn't have birds, you have zero obligation to take on anyone, especially not a total dodge who has a history of not paying rent and showed up out of the blue. She would be even more difficult to evict with two and soon to be three children.\n\nNTA", "No she’s the AH, you keep your pigeons and let her figure her own sh*t out though I doubt she will cuz it sounds like she is an idiot and an AH. Absolutely NTA, cut her out of your life cuz she sucks … lol", "NTA.  In this case it doesn't matter whether it is your living animals or a stinky wheel of cheese you wouldn't get rid of to let her move in.   You simply are not running a shelter for pregnant acquaintances.    It's a little presumptuous, but she can ask--but she can't demand. \n\nAnd you can respond, as you did, that you cannot accommodate her, period.   Assuming you aren't father to one of the kids, you have no obligation to her.  \n\nNor should you be expected to believe her promise of rent if she hasn't paid for her current place in a year.", "NTA - appears out of the blue with kids and wants you to turn your house upside down for her>?!?!?", "I love how you're the selfish one as she shows up unannounced on your doorstep to demand that you get rid of your pets to accommodate her. \n\nNTA", "NTA. Pets = family. I don’t know why society values an animals life less than a humans life but i I really wish we made animal equality the new norm. Just because a dog (or pigeon in your case) doesn’t speak human languages and doesn’t have thumbs doesn’t mean they’re worth less.", "First of all, the only selfish person here is her. Who shows up at someone’s home, kids in tow demanding that they uproot their lives to house them? WOW She hasn’t paid rent in a year but can suddenly pay you rent? Yeah right. Those Facebook friends of hers should offer her and her kids a place to live since they know so damn much & are apparently saints. NTA", "NTA, she’s nuts! I’d be posting about how thankful I am that my pigeons aren’t entitled assholes like some humans. Maybe Chantelle should’ve made better choices. \n\nAlso, a pigeon is one of my dream pets!", "NTA. What an entitled idiot.", "NTA - why aren't her super supportive friends putting her up?  You're her cheapest, most convenient, and most easily abused option.  You made the right call.", "***NTA***, now pay the bird tax.  I wanna see the lil’ guys.", "NTA she can’t just show up on your literal door step after not being in communication with you for years now and demand you do anything for her at all. To expect someone to give away their pets for you is insane. And we all know she wasn’t going to pay OP rent if she couldn’t pay her rent for a year and was gonna be homeless with kids while the dad is locked up. Sounds like she needs to fix her life herself.", "Lmao 🤣 \n\n“Rescue pigeons”.  \n\nI can’t stop laughing at this. \n\nI can’t get through the rest of the post w/o laughing man. But if y’all aren’t together you don’t owe her anything and don’t need to change anything for your rescue pigeons lol.", "NTA. Don’t let her stay with you, especially after she went online to talk shit about you. If she truly has friends, they can take her in. Wipe your hands if her and move on.", "Who TF knocks on someone's door and asks them to get rid of their pets so they can move in?\n\nNTA", "Her friends that are talking bad about you can let her live with them.", "N T A Chantele created this situation so she should fix it herself ,you don't show up on someone's door out the blue and expect them to welcome you and your kids with open arms plus get rid of there pets ,it just beggers belief that some people act that entitled. Just block her and her friends on FB and remember you've done nothing wrong.", "NTA even if you were still close to her. Even if you had reason to believe she would actually pay rent to you when she hasn't for 12 months. Still not an AH for saying no. It's your house. \n\nIts *very* telling that no one closer to her was able/willing to accommodate her. You don't know her recent history, she probably thought that would work in her favour.", "Some random former friend from way back, someone who you \"just kinda know each other,\" is demanding that you get rid of your pets so she and her brood can move into YOUR house... because she hasn't paid rent in a YEAR?\n\nThat would be a very short conversation.\n\nIf she has all these friends that are joining in to blast you, then she obviously already has an extensive support network. They are welcome to take her in.", "NTA... You aren't that good of friends anymore but she expects you to rehome your feather-babies so she can move in, without any prompting on your part? It sounds like you were not the first person to turn her away, because I highly doubt some long-lost friend was her first option when begging for a place to stay.\n\nI hate the situation she is in, life sounds hard for her. But if you don't have the room for your already established (and well-trained and super cool sounding) household, I don't think turning her away to maintain your animals and routines make you an AH at all. I hope she is able to find some peace and shelter.", "NTA and WTF! It's your house. And even if it was a hostel where you take in waifs and strays, you've taken in the birds. There's no room at the inn!!", "NTA. You’re not even friends anymore and she showed up out of the blue. She needs to work on her problems, not deflect them onto someone else.", "She hasn’t paid rent In 12 mos, and do you really think she will magically be able to pay you rent. Do not let her move in and it’s not even about the pigeons . Let her other friends put the money where their mouth is. I love when people won’t help people than blast other people for also not wanting to help. Plus she seems like she is more of a distant friend, where are her close friends with all this.\n\nNta", "NTA even if you didn't have pigeons, you barely know each other and she wants to move in three kids.", "NTA. If her friends feel so strongly, they can take her in themselves.", "Unless it’s your baby NTA", "NTA.  You know she'd never pay you a dime, and try to make you the bad guy when you boot her out.", "NTA. Your place is not a charity house. You have all the right to be with people, pets  or whatever makes you happy.", "NTA. Chantelle's situation is sad for her and especially her kids, but it is not your responsibility. Why can't one of the friend who joined her in slagging you off take her in?", "NTA\n\n\nNot to mention.. she didn't pay rent for 12 months at her last place what makes you think she'll pay rent with you? Just refusing her for that would have been valid.", "NTA.  (1)  It's your house, it's your birds house.  You don't have the space.  (2) If Chantelle could pay you rent, then why couldn't she pay her own rent for the last 12 months?  Her partner was locked up a few months back - but she hasn't paid rent in a year.  Let her stay with her friends who are being assholes.", "NTA\n\nIt is not your responsibility to let anyone live with you.  Period.\n\nHer suggestion to get rid of your pets was entitled and unreasonable.\n\nIf your mutual \"friends\" choose to believe her side of the story unquestioned, it's time for some new friends.\n\nGood Luck", "There was an approximately 0% chance of you ever getting rent from her. You have your life with your birds and your home, and that's amazing. It might be a good idea to block her and her friends or even delete your Facebook if it's not super important to you? Regardless, NTA", "NTA\n\nShe got kicked out for not paying rent for over a YEAR, and then told you she'd definitely pay YOU rent. Does that seem likely to you? You'd end up being trapped in your own home by someone who'd then claim \"I have a newborn you can't kick me out!\" and constantly find another reason to force you to let her occupy your home with her family while contributing nothing.", "NTA...never, never apologize for doing exactly what you want in your own house. Her lack of responsibility is not your burden to bear.", "NTA by a long shot. She just shows up out of the blue and expects a room cleared out and animals given the boot so her and her kids and invade your space? She also hasn't paid rent in a year and all of a sudden she'll pay you? I'm willing to bet she would be the type to try to determine the rent amount and underpay and take advantage of the fact that you were once friends. This is insane behaviour on her part and totally not your problem.", "NTA, funny how her attitude changed when you said no! These are the kinds of people you have to be wary of. They don’t care how your life ends up, as long as they get what they want out of you.", "NTA She doesn't get to judge you on your way of living and demand you change it to accommodate her out of the blue. If her friends can crap on you why didn't they offer to help her then?", "NTA\nYou said you guys aren't even friends, even if you were you don't have to let her live with you even if you didn't have animals blocking the possibility.  She sounds selfish and entitled, drop her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f32) have 4 rescue pigeons that cannot be released because of health reasons (e.g. can’t fly). They’re happy birds and have a good life. I live alone in inherited house and half of the top floor is converted into a big pigeon room where they have all their stuff. They’re trained to potty in specific places but can roam around the house exception kitchen. They have their sleep places in the big room and are locked their at night for their safety.\n\nMy friend (we’re not really friends anymore, we were a long time ago, now we just kind of know each other, our lives move down in totally opposite directions) f32, Chantelle, has currently 2 kids and is 5 months pregnant with her third. Her partner was locked up a few months back and she’s about to be evicted because she hasn’t paid rent in 12 months.\n\nOne day, out of the blue, she knocked on my door and started chatting. She told me everything and asked if it would be possible for me to let her move in and she’d pay rent.\n\nI refused saying that I don’t have the room for her and the kids. She told me I could get rid off my birds and they could take the room upstairs.\n\nI said that absolutely not and unfortunately, I won’t be able to help her. She freaked out, told me I was a selfish asshole, that I cannot are doing more about animals than humans and a lot of other nasty things. I kicked her out.\n\nI rarely go on Facebook, I have my old one from uni but I rarely go. Not even 24 hours after I kicked Chantelle out, My other friend messaged me to log in to see what’s happenings and Chantelle was slagging me off everywhere. Postings nasty things And her friends joined her and it was just so very nasty.\n\nI do feel bad though and I wonder if they’re right, perhaps I am the asshole here. Should I have let her stay with me?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Anyone who expects you to get rid of your family for theirs can go beat dirt. Pets are family.", "Nta you guys have not been friends for years and then she just shows sup and expects a room she needs to learn some respect or else she should expect to not be treated nicely", "NTA Hell no if she is asking you to rid your pets nope sorry and she hasn't paid rent in how long she has serious issues and you don't need that following you.let alone 3 kids I feel sorry for her but she needs somewhere that's able to have her and the kids without stepping on peoples toes.", "NTA\n\nYou’re not even friends and she tried to bully and guilt trip you into letting her have a place to stay. She is being evicted for non payment—as if she was ever going to pay you a dime. Yeah right.\n\nYou dodged a bullet with this one.\n\nAnd even if you didn’t have pets, you would have been the AH to yourself letting her move in.", "NTA. - at all. Her situation is not your fault or your responsibility. Chances are she’s exhausted every other friend/family avenue and is now hitting up people she barely knows anymore. You dodged a bullet. You absolutely do not have to rehome your birds to accommodate someone you barely know.", "NTA. Learn the lesson that you will usually regret opening the door when the person is unsolicited.", "NTA. Do you really think she would have respected *your* home? She didn't even do that in the first 10 seconds of her showing up at your door.", "NTA - she wouldn't pay rent or only pay briefly and then when you would try to evict her, depending on where you live, she might try to invoke some law in regards to squatting.\n\nNow show us the birds.", "Don’t let this person move in, it will be impossible to get them out. They didn’t pay rent for a year and their partner is locked up, it sounds sketchy as hell.", "\"I haven't paid rent in a year, but I'll pay you rent.\"  Sure thing.  NTA", "NTA\n\nI don't think many people would just room a random acquaintance if they knock on their door out of the blue , stating they want one for themselves and their kids. Whether or not there are pets involved isn't even an issue for me, even if the rooms were empty you'd be within reason to refuse.\n\nI would also draw attention to the \"her friends joined her\" part in the OP. Apparently those friends find it acceptable to join the badmouthing, but apparently don't feel the need to step forward and provide a room themselves.", "She never would have paid a dime in rent and you’d be stuck with a squatter.\n\nNTA", "NTA\n\nThis person isn't your friend. They only want you in their life for the room and board. They didn't pay rent before, why would that change now? Between their rudeness about getting rid of your pets for them, the social media attacks, the paying rent history- this person has graced you with a plethora of reasons they are not the kind of person you want in your life, let alone house.", "NTA\nI was seeing a woman that has a few dogs, cats, and other animals. I'm allergic to cats and long haired doggos. When it started getting serious I knew the next step was to move in together and there was no way with all those animals. I never even thought to ask her to get rid of them. That's selfish and heartless as fuck. We went out separate ways and are still good friends.", "There's probably some unfortunate friend who isn't aware of the 12 months without rent.", "“Running a shelter for pregnant acquaintances” hahahaha", "NTA, I second the bird tax, please.", "Right?! I get tired of hearing people talk shit about others then not back it up by actually helping that person themselves. If they feel so strongly about it, let them help.", "YES! OP, you should definitely get on social media just to reply this to each and every person involved.", "\"I've not paid rent in 12 months but I'll definitely pay you! Just get rid of your pets and we'll all move in.\"", "Hell yes. That's exactly what I was thinking when I read this!!!\n\nLet one of those friends of hers take her and her brood in!!! My best guess is that they won't because they know they won't get rent money.", "That was what got me, too! Entitled lady won't pay a dime. NTA, OP", "Then try and get her and her family out…and what damage they may cause out of spite,", "Also your bird situation sounds adorable.", "Right. And her Facebook friends can let her and her kids move into their homes since they're so concerned.\n\n\nNTA", "NTA. You'll probably notice that none of the people joining her abuse on Facebook are offering her a place to stay. \n\nEven if you had no pets, taking in a pregnant mom with two kids with no ability to support herself who you aren't even friends with anymore is a HUGE ask and you have every right to say No.", "INFO: How many of her friends that were joining in with her offered her a place to stay? None? You know why.\n\nIf an acquaintance rolls up to your house telling you to get rid of your animals so her and her kids can stay cause her partner is locked up, I'd tell them no, too. If she hasn't paid rent in 12 months, then how is she going to pay you? Also, odds are her partner would show up when he gets out expecting a place to stay, too. \n\n**NTA. If she ever moved in, you would never get her out. Stick with no.**", "NTA\nAlso this person is CRAZY ENTITLED and you should stay away from her like fire. It's not your fault she chose to have 3 kids with a convict without being able to afford them. The world doesn't owe her shit and especially you! you're not her baby daddy!!! I just can't believe the audecity! 🤦🏼‍♀️", "NTA!  Never get rid of valued pets for people, not friends or relatives or inlaws.\n\nBack when I was married to the first wife, she was talking about how \"at a future time\" when her mom would no longer be able to live alone and would need to move in with us.  But her mom is allergic to cats and at the time we had 3.  Me and our daughters are definitely cat people.  \n\nI told her, \"this isn't going to work.\"  And my now exwife said, \"there are shelters.\"  I said back to her, \"I can't believe you would send your mom to a shelter, but gotta do what you gotta do.\"  \n\nFast forward 6 years and we have been divorced for a few years now (for that and a litany of other reasons).  Me and the girls still love the cats.  And the exwife lives with her mom and takes care of her 24x7.  See?  It all worked out and everyone wins.", "NTA, I can already see where letting her stay would've led.\n\n1. Her not paying for rent or utility bills\n2. Expecting you to babysit her 3 kids\n3. Giving her free food and other items\n4. You being her chauffeur/errand maid\n5. Dealing with her entitled brattiness\n\nSounds like she has a herd of other entitled brats on her side so she can just stay with them. You definitely aren't doing anything wrong by not letting her stay.", "NTA bird tax please", "Holy crap I want to see these birds so badly now!", "INFO where is your bird tax?", "Absolutely NTA.  Pets are not disposable and no one told this girl to have a litter of kids that she can't take care of.\n\nYou're not even friends with her, she's someone you knew years back and are no longer friends or in contact with.  And she shows up out of the blue and thinks she's entitled to your house?  tf?\n\nYou shouldn't even have used the birds as an excuse.  If you let her and her kids in, she would have NEVER left.  \"How can you kick someone with kids out!?!  Plus I'm pregnant!  I can't work and want someone else to house and foot the bill for me, so let me live here for free!\"\n\n>she hasn’t paid rent in 12 months.  \n>  \n>asked if it would be possible for me to let her move in and she’d pay rent.\n\nShe absolutely would not have paid rent.  If she had intentions on paying rent, she would have paid rent at her old place.  She might have given you a couple bucks in the first month, then would have cried that you're trying to take advantage of a single mother who's pregnant.  It would have been a nightmare had you let them stay.", "Why would you invite someone to live with you for free, after they insulted you to your friends for the \"crime\" of refusing to give up beloved pets? Let anyone offended by your actions prove their opinion and become her new landlord for free. Dodged a bullet here. NTA", "NTA, don't let her in, she'll never leave \n\ny t a for not paying the bird tax. where the pigeons", "She hasn't been paying rent in a year. I doubt she will pay you rent once she is there.", "NTA. Sounds like Chantelle doesn't have her shit together and thats not your problem. Time to stop having kids I reckon, breeders think everything is about them.", "NTA. You’re not close friends nor family; besides it’s *you* who would be doing *her* a favor, and such a decision should be left to your discretion, in no way ask you something like that!\n\nIt seems to me that you have been lucky after all... that entitlement in cohabitation would surely become unbearable.", "NTA! Even minus you having pigeons, having someone who is pregnant with two children move into your home is a HUGE thing to ask. \n\nEither way, no matter what your decision is, it doesn't matter as it's your house.\n\nThat aside, I love that you have rescue pigeons! They sound adorable!", "NTA - like everyone has said, you aren't friends, she isn't going to be able to pay rent...but the fact that  she blasted you on Facebook right away is proof that you made the right decision, because this is how she responds to people who decline her unreasonable demands, and that is not something you want to live with, especially for an indefinite period of time...because in 6 months, she will be on Facebook about how you are evicting a new mom, then in a 2 years, it will be how you aren't \"giving her a break\" by taking some responsibility for her kids once in a while, then it will be how you won't let he baby daddy live with you, even though he just got out of jail and has nowhere to go....", "NTA you didn’t dodge a bullet, you dodged a nuke!", "NTA. Her friends just didn't want her to stay with them.", "NTA obviously, she'd never pay rent if you'd have let her stay there. What an entitled person.", "NTA, even if you didn't have pigeons to consider, you would be totally justified in saying no. She's asking a ton of you to let her move in with multiple kids and probably a lot of other baggage with her getting evicted and her partner being in jail.", "NTA\n\nWhat did she think your answer would be LOL", "NTA even before the partner was locked up, they didn’t pay rent. Then they have 2 kids and one on the way. What a messy pair. Sometimes life deals an unfair hand, sometimes people just keep making bad choices. In any case, it’s not your problem. \n\nI’d be tempted to tell her, “It’s odd that you have such hostility toward birds all while your partner is a jailbird.”\n\nIt would surely just be drama, mooching, mess, noise, and stress for you. If she or any of her supporters contact you, just respond with a laughing emoji and the bird emoji.", "NTA. Even if you didn't have any pets and had an abundance of space, you are under no obligation to house a former acquaintance and her children.", "NTA.  Her friends can take her in.", "Clearly NTA and may I please see the birds", "You didn't kick her out! She was never in!\n\nNTA.", "NTA. That is some audacity. You owe her nothing and you did nothing wrong. Let her friends woofing on social media with her take her in.", "She essentially told you to get rid of family \n\nShe can fuck right off, NTA", "Note that Chantelle's friends, who have seen her in recent years, weren't queueing up with an open door. \n\nHere's a tip - block her. She has shown you exactly why it was not a good idea to become her landlord. And you would never have seen a penny of that rent she was promising. NTA.", "NTA why don’t all the people bad mouthing you let her live with them", "NTA.  You aren't obligated to take anyone into your home.  You chose to have pets and it wouldn't be safe to have small children around them.  In addition, this woman hasn't paid rent in 12 months, what makes anyone think she'll pay for you?\n\nI would tell the friends messaging that, since it doesn't work fo her to live with you, please send her their address to move in.", "NTA—you don’t owe Chantelle anything. Don’t sweat the “bad social media press” because she sounds unhinged and that will become a Ida fly clear with each post.", "NTA", "NTA\n\nYou’re not an asshole. This person, who you haven’t had an active friendship with in YEARS, showed up at your home and expected you to just…let her move in.\n\neven if you had the room, it would be okay to say no. Having the extra space doesn’t mean someone else can come along and try to claim it. And this isn’t just one person we’re talking about - it’s FOUR. Her, two kids, and another one on the way.\n\nWhen you refused, she insulted you both in person, and online; personally that’s not the kind of person I would want living in my home.\n\nThere’s also the reality that as she is being evicted for not paying rent for a year, it is unlikely she will be able to pay you rent.\n\n“Selfish” is a loaded accusation often aimed at women for not sacrificing for others. You are allowed to have your own home and your pets, and you are allowed to not want lodgers. Their situation doesn’t mean that has to change.\n\nIt’s sad, yes.\n\nBut not your responsibility. She is not entitled to live in your space.", "NTA \n\nIf she got kicked out for not paying rent for over a year, it’d likely be no better for you. Plus, those birds were with you first. You have a commitment to them. \n\nBird tax? :D", "NTA. Your House. your choice. People asking favors don't get to demand. Time to block anyone that thinks they should have a say so in a home they don't own. Besides if they're so worried they can take her in.", "Nta\n\nSo many reasons besides the birds to not let her move in. \n\nShe hasn't paid rent in over a year, so she was obviously lying when she said she'd pay you rent.\n\n2 kids with a 3rd on the way, no way in hell she's not expecting you to help with her kids. \n\nBaby daddy in jail. If/ when he gets out, you know that she'd be expecting you to let him stay too. Depending on what he's locked up for, trouble could come knocking on your door regardless of if he's there or not.", "NTA, You owe her NOTHING! And someone who immediately complains on Facebook because someone else doesn't want to solve her problems, is TA anyway.\n\nHow sweet that you have such a nice place for your pigeons.", "NTA. The nerve.", "NTA.  Imagine what would have possibly happened if you had let her move in??  I think you dodged a bullet...", "No. Your birds are making you happy. Quite likely her and her kids would make you miserable. This is your house, and your life, and you don't owe anything to some \"friend\" who just wants to use you. NTA.", "NTA - no one has the right to show up on your doorstep and demand you turn your life upside down for them. Why aren’t any of her Facebook friends taking her in? They just want to spread their vitriol and performative asshattery without actually doing anything to help her.", "NTA who is she to dictate to you how you run your home by getting rid of your birds with no notice no chance to even think about a solution but just get rid of them.  Block her on social media and keep her out of your life.  She only re connected hoping you'd be a lifeline and someone probably told her about your inherited house so she felt a right to it.", "NTA. Didn’t need to read past the title.", "She drops in out of nowhere and expects housing for free.  Just block her and all her friends, who are obviously mentally ill.  Why can't any of those friends take her in?", "NTA. You dodged a bullet.", "NTA. If you let her in, she will never leave. Tell the people badmouthing you that you're glad she has generous friends that will be able to help her out. Done.", "NTA. She is being evicted for not paying rent. What more needs to be said.", "NTA. You don't owe her a place to live. She wouldn't have paid you rent either.", "NTA\n\nAlso dodged a bullet having this psycho in your house", "NTA. Those pigeons have saved you a whole world of trouble, in that you now don't have a deranged mooch and her brats to deal with", "NTA. That's not a friend.", "NTA. Chantelle sounds like nothing but trouble, and you don't need that kind of trouble in your house. Once she moved in, you'd have a very difficult time getting her out. I doubt that she'd pay you a penny or clean up after herself, and you'd probably be expected to take care of her kids. Just block her and her friends and live your best life. Let the friends who made the nasty comments take her in.", "NTA and shes not your friend. You were a tool to her and now shes mad because you aren't serving her purpose.", "NTA 100%, but I might change my mind if you dont show us this pigeon setup you have going on. Seriously though thats super cool", "NTA... even if you didnt have the cool feathered friends, you were wise to say no. \n1. If she has a situation then it limits whatever emergency services are available to her. \n2. Do you really trust someone that is evicted after 12 months of no payments to pay rent?\n3. Do you want to live with people you dont know or have reason to trust?", "NTA, imagine having to live with her! You dodged a bullet and I imagine her friends are backing her because they'd rather you got rid of the birds so she could live with you because they don't want to live with her either.", "What you have to get rid off is Chantelle. If she has so many other friends having her side, she can stay with them.\n\nShe’d never pay any rent to anyone.", "Nta.  You dodged a bullet.  You did nothing wrong.", "Absolutely NTA.\n\nThe fact that HER baby daddy is getting locked up and causing her to be evicted is none of your business or responsibility to deal with.\n\nNot your flying monkeys or circus tent. And completely absurd she just showed up and demanded to move in.\n\nShe needs to handle her own consequences", "NTA she just wanted to mooch off you and you're not obligated to allow that", "NTA. Any of the friends criticizing her can put them up in their house. She has made her life and kids and that's fine. You have made your life and your pets and that's fine. There's no reason for your paths to cross again.", "If you let her stay she'll never leave. Your expenses will go way up because you'll be feeding her and her kids. She'll want you to babysit for free. Her problems are not yours. Definitely don't let her stay now. NTA", "NTA she hasn’t paid rent in a year, how will she magically be able to pay you? she’s the selfish one for imposing on you to demand you get rid of your birds so that she can move in. do not!!", "NTA\nWhere dies this entitlement come from after Iwona a year worth of rent?", "NTA. \n1- She hasn't paid rent for a all year, so she could have put things in place a longtime ago, contacted different government agencies for help.\n 2- She only came to you to use you, and I am pretty sure they would have taken over and you will never have been able to get rid of them.\n3- You would have lost of your privacy and if she hasn't pay rent for a year, chances are that she would not have paid you. Not counting the extra cost for food, electricity... I could see how she would have also expected free babysitting/cleaning.\n4- Your birds are your family, you could not just get rid of them.\n\nYou can set record straight on Facebook if you so wish but those friends of hers opinions don't matter. I am also pretty sure that none of them have offer to host her not have her family or his.", "What is it with pregnant people wanting to get rid of animals?", "NTA. Not your fault her and her partner are shitty parents who can’t take care of their kids. Good on you for doing so much to make the lives of those birds lovely, if they were in the wild they would’ve died. The birds are a responsibility you took on, it’s very cruel of someone to just ask you to discard them all of a sudden. I would just block that person on all socials and let them dig their own hole socially as they bed every person they know to live with them.", "Definitely NTA", "NTA.  No one has the right to just move into your house and take over.  And she was never going to pay you rent.  If she was the kind of person that paid rent, she would not be currently evicted.", "NTA.  She sounds like she has a hard life, but may need to accept responsibility for her part in creating that life. Her FB behavior indicates that is something she struggles with. It's not your responsibility to fix her life.  People who take character references off of someone's random social media posts aren't really people you care about anyhow.", "NTA.\n\nShe didn't pay rent for 12 months and her baby daddy is in prison so she will get no income from him, she is pregnant so is about to have more costs than what she already dose. There's not a chance she would pay you rent. If she could pay rent, she wouldn't be getting kicked out.\n\nNot only will she probably not pay rent, I wouldn't be surprised if she paid you nothing, so you'd have utilities shoot up from 4 extra people in the property (mum + 3 kids) and get nothing in return except uninvited guests taking over your house.\n\nAs others have said, if her friends who are slagging you off feel so strongly about it, let them house her, she can pay them rent.\n\nJust blocker her on social media and do the same for any of her 'friends' that try to contact you. Forget she even knocked and let her go back to being just a memory from the past.", "If all of her friends take such issue with you, her non-friend, not putting her up they can house her and her children. You are not required to upend your life for anyone, especially because of her poor life decisions.\n\nETA: NTA", "NTA. Her attitude towards the room is toxic. You did the right thing my man. Feed the birds, save the birds.", "NTA. And good for you for standing up to this selfish, nasty excuse for a human being.", "NTA- even if you didn't have the pigeons you shouldn't let her move in. She sounds like a nightmare.", "NTA. Her reaction proves that you were right not to let her move in (even not considering the pigeons). It would be a nightmare trying to ever get her to move out. You were going to become a villain eventually, might as well be one now while having your pigeons and your house intact.", "She's not your friend.  \n\n\nNTA.", "#NTA \n\nShe was the one begging for a favor and she has no right to demand anything from you. \n\nAnd her intentions were clear not good, she  was not planning  to pay you, she did not for 12 months how she was going to pay you?She was looking for a fool to pay her bills.\n\n If you had let her in you would end up having no peace in your own home. It was going to be fights all the time over the  home being messy and smelly, kids screaming around, baby crying, you will not be able to sleep right, food will be missing and you will end up paying alone higher  bills for food, gas, water, electricity and etc. And it would be almost impossible to kick her  once she was in.\n\n**You did right!** She is a person that  we call in my country _\"malandra\"_ a person that try to take advantage of everyone and everything, but when  does not get her way she shows her true colors  and intentions which  she did  soon after having her plans frustrated.  She is not a good person be far from her.\n\nYou got ride off a nightmare.", "NTA. She can go stay with the friends that are badmouthing you", "NTA, your 'acquaintance' is a major AH.\n\nWhat does she imagine would happen when she badmouthed you?  That you'd cave and take in someone who has clearly made a lifetime of bad decisions and trashes anyone who won't help her?  \n\nDon't let her into your house, even for coffee.\n\nReport her on Facebook, state the truth and tell all her 'friends' they are welcome to take her in and that you don't even know her anymore.", "You're definitely NTA \n\nI am curious though. If her partner has been locked up only a few months how is she already a year behind on rent? If she couldn't pay rent with two incomes she can't pay it with one and you would likely never see a penny out of her.", "NTA. You let her live with you and you never get rid of her. Her landlord is trying to get rid of her for 12 months. \n\nFeeling entitled much? The audacity to knock on someone's door and invite yourself to live with is outrageous. \n\nI would start telling everyone what really happened.", "NTA\n\nShe’s magically going to be able to pay you rent?", "Nta unless *you* got her pregnant you are absolutely not responsible for another grown ass adult.", "NTA. She wasn't gonna pay. Please post pidge.", "Lol NTA why don’t her many toxic friends take her in then", "NTA\nYou dodge a bullet", "NTA - lack of planning on her part does not constitute an emergency on yours.", "Not at all you did the right thing telling her NO when you haven't seen her in years.", "NTA.  She came to you because everyone else in her life will not let her move in.  Stay strong, you're right in your choice.  It sounds like you don't care about SM so let the trolls have it and don't worry about it.", "NTA her problems are just that, hers!", "NTA. She's a grossly entitled leech and your birds saved you from a living hell.", "NTA. Why tell her other friends to take her in, since they are so outraged.", "DO NOT LET THIS WOMAN MOVE IN WITH YOU! She hasn't paid ANY rent in 12 months? She isn't going to pay you either. Let everyone who is trashing you online help her. NTA", "NTA what absolute entitlement. And if she couldn't be bothered to pay rent for 12 months at her old place what makes anyone believe that she would pay rent at yours? You do not have to upend your life and get rid of your pets for someone who's an acquaintance. Full stop.", "NTA. Her problems are not your problems. She’s not a friend and was just trying to use and take advantage of you.", "Even if you had no birds, lived mortgage free, with no bills, had 5 spare bedrooms, and a fully independent self-contained flat with its own entrance, I still wouldn't be finding you the AH here.\n\nNTA.", "it’s bad from her to say that you should kick your birds out for her and she definitly has other options than your home. The birds would die outside. You did what’s best. Maybe try to find a solution so she and your birds can stay with you.", "Probably change her address asap and claim tenancy then it's be a long headache to get her removed.", "And those friends who slagging OP apparently won’t take them in for some reason.", "Lol, if she calls you an asshole on your first encounter after years of NC, you should really ask yourself if she's the one you wish to share a house with.\n\nI mean the pigeons are obviously not the problem in this story, the sea of read flags surrounding your \"friend\" are.. lol. She's a delusional clown.\n\nNTA, obviously", "This is the perfect response for OP to use on Facebook against Chantelle and her flying monkeys. NTA.", "Yep, friend or not, I wouldn't touch this one with a mile long pole. No way.", "Yes, this, please. Leaving a comment to check for birb updates.", "Especially when it's someone you haven't really been in contact with for some time!!\n\nSO NTA!!!", "And the calls OP an asshole is their outlandish demands are not met immediately?\n\nUnbelievable.\n\nNTA, obviously", "Amen - put up or shut up.", "Yeah but people who inherit massive houses while people are homeless is also gross. OP houses disabled pigeons fgs.", ">Pets are family\n\nAnd usually more loyal and much friendlier than a lot of the humans who we read about on this reddit", "Some people think other people’s extra money/space is extra (not necessity) so it’s ok to take advantage, even they are not close people (or it’s even easier to take advantage of people you actually know/care less). Op inherited a house and lives alone with pet birds, thus to Chantelle she is entitled to freeload.", "I’m hoping that the mutual who let him know about the post commented asking that very question. What’s to lose if you don’t really talk to that person anymore?", "Even without the birds involved he would still be NTA. You can't ask someone to upend their lives and get mad at them when they can't help you.", "Agree with this 100% - delete the useless Facebook account", "She did find a solution, the birds stay and the girl can ask one of the friends complaining about op for a place to stay. Everyone wins.", "If OP gets any mail for Chantelle then she needs to not accept it/return it to sender & specify the intended recipient does not reside at OPs residence.", "Should save the messages of her complaining. Proof she didn’t get offered tenancy", "Exactly this!", "Exactly why aren't they opening up their homes to her dead beat self and her two and a half kids?", "I bird this request for tax— and seeing myself out now. 🥁", "After learning how in some states there are squatter laws, this kind of stuff terrifies me. OP won't be able to get rid of this woman and her kids after she stays a certain period of time regardless whether she pays rent or not.", "The person becoming homeless is their own damn fault for not paying rent for a year. Landlord sounds like a saint not evicting them long ago.\n\nOP owes them nothing, and would likely end up in the same situation having to evict them.\n\nMaybe you should offer to house this family?", "Who says the house is massive..?", "That’s completely unfair.", "Publicly call out their BS. \n\nThey attacked OP in front of everyone, so they can deal with everyone else seeing them refusing to help and knowing how abusive they are as well.", "I'd definitely be taking screenshots in case she tries something desperate just in case.", "Bird tax! Bird tax!", "Probably what she was intending", "Nesting explicitly for Birb tax.", "Still waiting for the bird tax!", "NTA. It's your house. Chantelle was out of line to expect you to change anything about your life for her benefit, especially since she's established she can't be relied upon to pay rent.\n\nYou would have been taking a foolish chance to allow her to move into your home. Your life would have become a living hell at some point in the future, when you were forced to evict her for non-payment of rent and she fought eviction every step of the way, smearing your name all over social media.\n\nDon't waste a second of your life feeling bad about your decision. You did the smart thing and dodged a bullet. No matter how much she bad-mouths you on social media now, it's nothing compared to what you would have endured if you let her move in.", "NTA. Live your best life as crazy piegon lady. She only came to you, because she already exploited every other option.", "NTA! Where are your pets supposed to go if you moved her in???", "NTA. She's being evicted because she hasn't paid rent in a YEAR, so there's no way she'd contribute anything to the household if you had said yes. And if her Facebook pals are so eager to slag you off for not letting someone who you don't consider a friend live with you, then THEY can offer her a place to stay. Her entitled attitude of showing up and demanding you get rid of your pets is frankly astounding.", "NTA the space is taken, she’s had a year to figure it out, she will never leave, she won’t pay. Her fiends can take her in then!!", "Your title says “friend” you should edit to childhood friend or something. \n\nNTA.", "NTA - if your friend wants to stay with you, that would include any pets you have. If they don't like it, they need to stay somewhere else. Also, I think she burned the bridge to the possibility of staying you when she called you a selfish asshole. Don't even worry about it.", "NTA, her problems are not your problems. Especially seeing as you're not close friends.", "Ask your \"roommates\" if they want to move out.\n\n\"Yes\" is yes,\n\n\"Coo\" is no.", "NTA.  There is absolutely zero reason you need to feel pressured to let someone into your home.  Your home is your space; you worked for it, you pay for it.  The pets are a non-issue, whether you had the pets or not, you still have zero obligation to let her stay with you.  \n\nThat said, there are just WAY too many red flags coming from this woman.  I would never in a million years let someone like her stay with me.  It would be one thing if it were a close friend who you had regular contact with.  It would also be different if she weren't being EVICTED for not paying rent.  But she's also demanding you change your way of life to accommodate her for HER mistakes.  \n\nYeah, no... never in a million years.", "This is an easy one. You’re NTA. \nBird tax?", ">and she’d pay rent.\n\nNo she won't.  She wasn't paying her rent to the last place.", "NTA\n\nYour birds aside . SHE HASN'T PAID RENT IN 12 MONTHS!! \n\nHer other friends can take her in.", "NTA tell all her friends commenting to take her and her two kids in.", "NTA. Your “friend” was way out of line to ask you to get rid of your own pets. They’re living things, not objects that you can just dispose of. If you don’t have room in your house then you don’t have room in your house.", "NTA. Pets trump entitled AH's everyday.", "NTA, SO OBVIOUSLY for about a zillion reasons! Also, we’ll need you to pay a pigeon tax, reddit needs adorable bird pics!!", "NTA. You can't evict your birds. I'm well versed in bird law.", "Oh Girl, no way you are the AH. You are not supposed to be feel responsible for her and her childrens life at all. \nYou are/were only a distant friend to her for many years, I am wondering how the hell she found you with this offer (eg. She wants to live in YOUR house, knows your living conditions, house, at all). WTAF \n\nOn the other hand, of she is evicted on her own fault, why do you think you will be more lucky than her prev landlord? \n\nAbsolutely NTA", "It's probably her last chance before moving her kids to a shelter. Unfortunately, she's made some bad choices in her life and lead her down this path. It's weird that she would just randomly suggest you give up your pets for her to move in. The entitlement is just bold. I wouldn't think this living arrangement would work out very long. Even if you said yes, your only delaying the inevitable.  Let them have their say. It's her version, and most likely, everyone knows the truth even the ones saying mean things alongside her.", "If she can’t pay rent, she shouldn’t be having another kid. Nta.\n\nAlso, sounds like you need some new friends.", "Lol hell no. Post a picture of your birds and a smiley emoji on FB. I do think it's weird and kinda gross that pigeons have taken over your house. But it's not my house. it's YOURS.", "Those friends are free to take them in. Kudos to you saving the birdies. NTA", "NTA. She let a loser creampie her and is lazy besides that. Not your problem.", "NTA  the nice thing about FB is you can block people and not see the crap they post. And no, do not let that woman in your house, she chose to have kids with a criminal, not you so you have no obligation for her poor choices. Let her run her stupid mouth and if anyone says anything, just tell them you can't help preferring pigeons over an unemployed irresponsible idiot who has too many kids and not enough brains. And keep in mind you let someone like her in your house you'll need dynamite to get her out.", "Absolutely nta but u gotta pay the pet tax, I wanna see the pigeons! I absolutely love pigeons!", "NTA and if her friends are so upset why isn't she staying with them?", "NTA!!! That is so incredibly selfish and rude to show up and “suggest” you get rid of your animal companions just to caretake her (someone you have no obligation to). \n\nI feel bad for her kids but that is completely ridiculous and no you do NOT need to carry the weight of that on your shoulders. You hardly even know the person.", "NTA. shes calling you selfish because you aren't doing any favors for her. she is the selfish one.", "Nta. Go low and respond on her post that you dodged a huge bullet and post pictures of the pigeons.", "Of course you’re NTA!  You haven’t had a relationship in years, and out of the blue she just knocks on your door and expects you to take her and her children in?!  Unbelievable!  Even if that room were empty you should not take her in; she hasn’t paid rent at her old place in 12 months - she will not be paying you, I can near guarantee it.  Let all the friends who are piling on her entitled posts take her in.", "NTA: She does not sound like she will ever be satisfied. Let her be a tenant and down the line she is going to find some other negative thing to post about.", "NTA , Sounds like a SHE problem.", "\" and she’d pay rent.\" .. ou did not believe that risdiculous lie, did you? If she inteded to pay rent, she would not need YOU. She could have kept her last place if she had paid rent.\n\n&#x200B;\n\n&#x200B;\n\nNTA", "NTA.\n\nNot often people get to see the bullet they dodged. Nice to get confirmation you turned away the right person, but from the time she told you that you should get rid of the birds to support her family, you could tell she was an asshole.", "NTA. But go ahead and ask her friends who are attacking you why can’t they take her in? Y’all haven’t been friends for years and now she shows up when she wants something", "NTA\n\nThis right here is why I care more about animals that I do most people. \n\nShe didn't get her way so she badmouths you and blames it on your birds. Not the fact that you aren't really friends, not that fact that she wants to move 3.5  people into your home where you currently live alone, just the fact that you have birds.\n\nDelete, block and move on. If anyone contacts you with any negative comments ask them if they have offered to take her in", "Nta, and you are under no obligation to honor requests from long lost friends.  While I personally find that pigeons roaming about the house is peculiar at best and unsanitary at worst, it is in fact YOUR house and YOUR pets.  Getting rid of them was a totally unreasonable request.", "NTA: You don't owe her a thing. She went out of her way to make this an issue instead of dealing with her situation directly. Hurt people hurt people. Log on to your FB and set the record straight.", "NTA.\n\nIt's not your responsibility to get Chantelle's shit together.  It's Chantelle's job to get Chantelle's shit together.  And this stunt on facebook is showing you exactly who she is and why you were wise to refuse her.  Don't second guess yourself now.", "NTA and dodged a bullet.", "NTA, do you want Chantelle & her kids plus the baby daddy when he gets out of jail living with you & not paying rent?", "NTA. Let those opinionated friends give her a place to stay. Stick to the Pigeons. They're nicer than most people overall.", "NTA  Why in the world would you want to live with someone like that?  She would be in charge right away.  You would lose your life entirely.  Also, if she hasn't paid rent in a year then why do you believe she would pay rent to you.  Look how long it took her current landlord to get rid of her.  You think she wouldn't squat in your house in the same way?  Enjoy you lovely pigeons.", "NTA \nBut do you have pictures of the pigeons, please and thank you", "NTA    \nYou shouldn't let her even if you didn't have any pigeons, you would never get her to leave voluntarily.", "You can train birds where to crap?", "NTA at all.", "Nta. She got knocked up by a convict, but you’re the bad guy? 😏 lmao! Even if you didn’t have the birds, & had all the space in the world, I’d still say hell no! That baby daddy will be getting out someday (I’m guessing) & then she’ll want to move him in too. One of her Facebook friends can house her & her offspring. You’re better off with your birds! 😊", "NTA\n\nWhile it sounds like she's in a shit situation, it's not your responsibility to dig her out of it. You don't even really know her anymore, you only know what she's told you. Even that doesn't paint a very trustworthy picture. Her partner's been locked up a few months, she's 5 months pregnant and has not paid rent in a year. What is there to make anyone think she would actually pull her weight if someone took them in? \n\nSeems sketchy... I'm glad you decided against it. Don't feel bad for preserving your peace. Fuck what people say.", "NTA, her life choices are not your problem.", "NTA! Keep the pigeons they are better friends. It doesn’t matter what anyone else says your house your rules. Don’t let anyone sway your decision. You are in the right!", "NTA. Why don't those friends house her?", "NTA.   she hasn't paid rent in a year???\nHow does she plan to pay you rent?\nAnd 3 kids.   Nope", "NTA \nRandom you used to be friends with shows up out the blue and expects you to house her 2 kids & soon a baby. Talk about weird perhaps one of her friends who is bitching about you on Facebook can house her and her family", "NTA. Tell her friends to take her in", "NTA why on earth do you feel like you should have let her stay?  Stand up for yourself.  You said you aren't even really friends anymore, she'd demanding you get rid of your pets when you didn't even offer for her to live there, and she didn't pay rent to her last place for a YEAR.  \n\nAll those friends joining in bashing you can take her and her child in.  Not you.  I honestly can't believe you even considered if you should!", "NTA. Even if you DID have room, why would you rent to someone who just got evicted for not paying rent? For a YEAR?! Nah, you did the right thing.", "I would not trust someone who hasn't paid rent in 12 months to actually pay me rent.\nNTA\nResponse on facebook--those who think I should take Chantelle in, I presume you have already offered to take her in?", "Nobody just gets to show up at your doorstep and inform you that you're getting rid of your pets so they can move in. You barely even know her anymore. I'm sorry for her circumstances, but one of her other friends can take her in.", "Well if all of her friends are yelling about you, at least she has options for hosts, lol.\n\nNTA.", "NTA\n\nThe biggest red flag is that Chantelle is about to be evicted because she hasn't paid rent in a year. What makes her think you'd believe she'd pay you rent? And once she got in, you'd play hell getting her out. \n\nMy jaw always drops when I see posts here where someone wants someone else to get rid of their pets to accommodate them. Now THAT'S an AH. And so is everyone on FB that agrees with her.", "NTA\n\nShe won't be able to pay rent and is going to have a new baby soon with baby expenses. Your life, your home, and your bank account are going to take a hit if you let them live with you.", "Ok, so her friends that were joining in with her saying nasty things about you on social media,  why doesn't one of them let her move in? Hmmm", "i can’t believe no one has pointed out that you can’t “potty train” birds; they don’t have bladders or bowels and so literally have no control over when they defecate. this post is ridiculous!", "Nta. She literally only came there because she was going to use you for your home. When she couldn’t do that, she slandered you. She’s the biggest ass hole and I promise you, you did nothing but save yourself and your home a lot of headaches. She made choices, she’s gotta with em. Super curious about rescue pigeons now though", "NTA. As others have pointed out, she hasn’t paid rent in a year, so do you really think she’ll give you anything? Especially with a baby on the way? You’d be adding four people to your household - imagine how much your utilities will go up. My fiancé and I recently welcomed a baby and we usually do at least one load of laundry a day. You’d also want to kiss any peace and quiet you have goodbye with a newborn and two small kids around.", "NTA - not your circus, not your monkeys", "NTA.  \n\n>*She told me I could get rid off my birds and they could take the room upstairs.*\n\n... or she could \"*get rid of*\" her kids and put them up for adoption, seeing as she's completely incapable of living within her means, least cost avoider right there.", "NTA. Smart move. You're not even friends anymore. She just saw a free ride. Her SO is in jail. I wouldn't wsnt her anywhere near me. Who knows what unsavory ppl she's friends with and who'd show up at your house!", "Nta how did she know where you live and what your top floor is if y’all aren’t friends & just know each other", "Pets are a lifetime commitment. Pets come first before new commitments. You don’t just rehome pets when their presence becomes inconvenient to you or other people. Nta.", "That sound you hear is the massive bullet rushing past you, missing you by a millimeter.  NTA.", "NTA. You said it yourself, you're not really friends with Chantelle so why don't Chantelle's actual friends on Facebook help her out?", "NTA. You're not even friends, she just showed up out of the blue. Why can't she find an apartment through the normal methods? Kinda sus. Even without the birds, it would be completely reasonable to refuse her for any number of reasons: you're not looking for tenants, you don't want to live with kids, you don't know what type of roommate she'd be, you don't like her hair color. All perfectly valid. You don't owe her anything. Block those people on facebook, it's super easy to point fingers when it's not their houses, pets and lifestyles on the line.", "NTA.", "How is this even a question?  She’s a pathetic bum", "Count yourself lucky.   Think you dodged a bullet there.   She didn’t pay rent for 12 months causing her to be evicted but somehow she’ll pay you rent?", "NTA - you did the right thing and you owe her nothing.  Stop going on FB, it isn't worth it and doesn't change your life in anyway.", "NTA. You dodged a bullet.", "NTA where does she get off coming to your house asking for favors after all this time? Audacity is blowing like spores in the wind. Everybody is getting some. To show up after years and ask for something is crazy. Wow, that’s a bold lady.", "NTA you don’t just toss out pets like old junk. Plus you aren’t close, she just saw your home and tried to take advantage. She is not your responsibility and not your problem. Cut her off and ignore her friends taking her side when they know nothing about you.", "NTA.", "NTA, have her friends take her and her kids in if you're such a terrible person her friends would not want her and her kids to be living there right?", "Free advice: if someone goes out of their way to insult you online, don't let them stay in your house.  Even if there ever had been a case where she could have stayed with you (and there wasn't), that went away when she started slaggging on you.\n\nNTA.", "NTA - The moment I read the title I had already declared you NTA, but then reading the entirety of the post, my decision is cemented. \n\nThose are your pets, and that is their home; what right does she have to have you get rid of them so she can stay? Her bad decisions one way or another shouldn’t impact you in the first place, much less your pets who don’t get a say in the matter. \n\nIDGAF who you are, if you come to my house (out of the blue at that) and demand I remove my pets for you, you can kindly see yourself out of my life!", "Lol. NTA all the way.\n\nYou don't owe somebody who used to be a friend anything. Even if you were friends, asking you to get rid of your pets is out of line.", "NTA\n\n>Postings nasty things And her friends joined her\n\nWhy don’t these friends host her???", "NTA\n\nThe audacity of her to plan out what you can do with your house to suit her.  I don't get how people actually think it's okay to do that.", "NTA. Your ex-friend is acting like an entitled brat. Who says “get rid of your pets, so I can move in”? Ridiculous. And birds or no birds, she’s being evicted for non-payment of rent so it was probably best to steer clear of allowing her to move-in on the promise that she will pay rent. And the way she behaved after you declined really shows her true colors. And maybe you can propose to her friends who are talking trash, that they should let her move-in with them. I mean, there’s a reason she asked you(someone she hasn’t spoke to in forever) versus a close friend or family.", "NTA she’s in the wrong", "Absolutely NTA. Someone asking you to \"get rid of\" your pets is not someone you should live with, no matter their circumstances.", "NTA look at the drama she's creating online who wants that in their house", "Nta she needs to ask those people to let her live with her since there so quick to defend her", "NTA. Her (I’m assuming) baby daddy is in jail therefore we can assume he is a criminal. She didn’t pay rent for 12 months to her landlord so she is a deadbeat. She came to you, who she really wasn’t in contact with recently. Safe to assume that you weren’t her first choice (being not close friends anymore and all) so all her family and current friends are not letting her and the kids move in with them. \n\nThose people slamming you for not housing her are not worth worrying about. It is not your responsibility to rescue her and her children. I guarantee you she would not pay you rent, they would destroy your home, and probably bring criminals to your home. \n\nDO NOT FEEL BAD OR GIVE IN !", "A person in need begs, compromise and try to be the less inconvenience. She had no right to tell you to change your life for her (get rid of pigeons). If she was a good person she would beg you to stay with them, not demand and then blaming you online. You are lucky you refuse! You saved yourself from the worst. She is the AH.", "NTA. You dodged a bullet not letting trash move in.", "NTA   To show up at your door out of the blue and demand housing from you is ballsy.  Her life choices aren't your responsibility and of course you care more about birds than some random woman at your door step.   She's had a YEAR of not paying rent to figure something out, although I can't imagine what that would be when paying your RENT is the easier solution!", "Birb please\n\nNTA", "NTA. You don't have to take in a distant friend or even your dearest friend if you don't want to and you certainly don't have to reconfigure your entire house and get rid of pets just because they want you to let them move in.\n\nGo on being your weird bird person self and enjoy your top floor pigeon coop!!", "NTA - inventory time:\n\n* Not much of a friend anymore\n* Is being evicted for not paying rent\n* Wants you to lose your pets\n* Now is bad mouthing you\n\nThat is a very hard NTA!!!", "NTA this lady is crazy and selfish. It’s not your fault she made poor life choices. Also having 4 pigeons and them having their own room is something I would love to have!", "NTA mate, you dodged a bullet by not allowing her and the kids move into your place.  I doubt she would have paid rent and it would have been a mission trying to get her out.  \n\nAlso, love the fact you’re looking after the rescue pigeons who aren’t able to fly and converted half of the top floor into a pigeon room so they can live their best life❤️.", "NTA\n\nIf you let her stay, you'll be *her* pigeon. \n\nAnd, WTF is it about the world lately that people making *poor life choices* expect other people who are self-supporting to turn over their \"extra\" rooms?", "NTA, she hasn't paid rent in one year and is saying she will pay you. With what money. Plus 2 kids and one on the way. Soon, you will be the butt for not watching her kids. Your pigeons will show more gratitude than that old \"friend.\" You definitely made the right call.  👍", "NTA. Christ some people are so entitled and demanding. That is your house so your rules.", "Why doesn't one of those friends who are throwing shade go ahead and take in the dear lady and her three children and let them live rent-free, mess up her house, eat her food, etc.   \n\nOh, wait ...", "NTA. She's being incredibly selfish, it's almost like she doesn't quite comprehend the situation she's in...\n\nOn another note, your house sounds amazing, lovely birb frens!", "NTA. So she apparently does have friends who can join her in saying nasty things about you and yet she had to come to you, who she barely speaks to, to ask for accommodation? They clearly don’t want her in their houses either which is hardly surprising. You definitely did the right thing, no need to feel bad about it.", "**NTA**\n\n**NOOOOOOOOOOOO! NOPE & DON'T EVEN THINK ABOUT IT!!**\n\n***This is a beggar who will NEVER leave without forceful police intervention***\n\n***Too many rights given to tenants she'll use against you. It took an ENTIRE YEAR for her landlord to get rid of her for non-payment. She didn't pay rent nor did she prepare to leave before evicted. How on earth doesn't one look for apartments if knew ahead of time?*** **When can't get an apartment because it's not just this landlord, guessing other landlords she's done this with & got blacklisted!**\n\nShe looked you up out of the blue, that means she's burned her bridges. ***NO ONE ELSE (FAMILY, FRIENDS & INLAWS) WANTS TO HELP HER OUT AND/OR DID BEFORE & NOW NEVER WANTS TO AGAIN!*** *You were at the bottom of the totem pole!*\n\nWhen you don't comply with her request, she talks like a dog about you on Facebook. So? Didn't go on the site before, don't go on it now. What was it intended to do? I guess sort of make you feel guilty? Then what? Reach out to her of the goodness of your heart? NO! When one berates me behind my back, you ain't getting any goodwill, offerings or anything. Why?\n\n***BECAUSE I'M SEEING WHAT THE FUTURE WOULD BE LIKE IF & WHEN HAVE A DISPUTE AND/OR ARGUMENT! NAH OP YOU MISSED A NUCLEAR MISSILE! Pretend she never went to your house, wrote anything on FB. IGNORE HER!! Think her partner was involved in some shady business, doesn't guarantee she isn't!***\n\nDepending on the country, here in the US there are services for mothers & their children (emergency shelters, section 8 housing vouchers, food stamps & other services etc.). Maybe she went through them or wants to avoid using them.", "NTA don’t let her stay because once she in she won’t pay rent and she won’t ever leave YOUR home and when her loser partner is out of jail you will supporting their entire family upstairs. She never reached out to you until she wanted to demand your home from you. She is no friend, she is a stranger and a user. Let her friends that are supporting her actually support her ass.", "NTA.  She acted like a turd when she was asking a favor by requesting you get rid of your feathered family. Imagine the entitlement once she camped out at your house. I’m sure you would have to babysit her children or face more online bully Bs. Keep that toxicity out of your life. \n\nThe friends supporting her should get rid of their pets and house her if they thing you are such an a-hole.", "NTA what are the odds that she's burnt through all her contacts trying to get favours from them and you're just next on her list. Or maybe you're the first person she knows who actually has somewhere she could lay claim to?\nEither way don't let her in, she hasn't paid rent in a year and she won't pay you rent either. At least the pigeons are providing guano (prime fertiliser!)", "Oh, my god, no, you are NTA. In fact, you dodged a huge mess. She got evicted for not paying rent in 12 months & has 2 small children with a man who's in jail & is pregnant again - why would you want any part of this? \n\nBirds or no birds, it's best you did not let her stay & get involved in all that. \n\nAs for anyone talking trash about you on FB, maybe they should take her & her children in.\n\nYou did the right thing so breathe a sigh of relief (those birds are a godsend - you rescued them & they rescued you from this scenario.)", "Not your pigs, not your farm. NTA", "NTA! You were supposed to change your entire life & living situation and take in your pregnant friend along with her other children? You really think you'd get rent on time every month? When she goes into labor and is ready to give birth what happens with the other kids then? You'd be a hostage in your own home, a makeshift babysitter while footing the bill for 3 people and a newborn. NTA!", "NTA. If She Wasn’t Paying Rent Where She Had A Signed Agreement To Pay She Definitely Was Not Paying Rent To Live With You. Plus Whose To Say When Her SO Was Released From Jail/Prison Whatever She Wouldn’t Invite Him To Live There As Well. You Dodged A Bullet & Are Not Even Slightly Wrong 😑 Imagine Her Receiving Mail There & By Law You Not Being Able To Get Rid Of Her.", "NTA. The pigeons sound much better mannered", "NTA - the bigger issue is that she is being evicted for not paying rent. Do you really think that she will pay you rent after not paying for the last year. This is going to end in disaster for you. Keep the birds lose the \"friend\".", "NTA - People like OP's \"friend\" are the reason why the term \"no good deed goes unpunished\" has been coined.  Pigeon poop is way more preferable than the crap she would be leaving in her wake!", "NTA .  NOT a good idea!!", "NTA - all chantelle is doing is proving you right that you don't want her to move in.  No one needs that kind of drama in their life.  \n\nI honestly don't get people who freak out and go on facebook about something like this.  Do they think it will make someone change their mind?  It would just highlight for me why I don't want them around.", "On her third kid, getting kicked out because she could not pay rent, then tells you you can get rid of your birds so her kids could have the room? NTA. This goes much further then this, who do you think will be stuck living with those three kids? You will. And if you even think that you will be able to evict her after she moves in, you think you might be the asshole now? Wait until that happens. No judge is going to okay you kicking out a woman and three kids and even if you suceeded then how will you feel? Like shit for just trying to be nice. No you are NTA but don't let your friends pressure you into something you will definitely regret in the future. Tell you friends and anyone else who is badmouthing you they are welcome to take her in. When they give you the excuse, call them out on it, that's not an excuse, double your kids up, get rid of your home office, redo your basement. You'll see how fast the excuse pile up. Don't do it. NTA", "NTA, don't sweat some rando. The overwhelming majority of people who see her post are just thinking 'thank god she didn't knock on my door'.", "Nta\n\n\n>And her friends joined her and it was just so very nasty\n\n\nWhy didn't she stay with these friends then?", "OP, NTA. I love your pigeon care setup.\n\nAs to the woman in question ... well, yikes. Good thing you found out what she's REALLY like these days, courtesy of FB and your actual friend who gave you the heads up. You dodged at least one bullet.", "Definitely NTA. You are not responsible for this person, they aren't even a close friend. Why aren't all her friends, who are slagging you off, putting her and kids up?\n\nAlso, I really need you to expand on what 'stuff' your pigeons have? I'm imaging all sorts really cute pigeon furniture and games and things", "NTA - that's what family shelters are for. And they'll help her get back on her feet. She most definitely 'pigeon headed' 🤣🤣🤣 and self entitled to think otherwise.", "NTA, she showed her true colors. Good thing you didn't let her move in. Also, do you really think when her jailbird partner gets out he won't want to stay there too? NTA", "NTA. Good riddance. She's just a vile and entitled brat. Let those friends who are defending her nasty behaviour accommodate her.", "NTA. And especially after she slagged you off online after. Dodged a drama bullet.", "NTA at all you are in fact a very compassionate pigeon saviour. I envy and admire your choice", "Lol NTA. I wouldn't get rid of my dog for some person who was barely my friend.", "We all know she would not pay rent. She would demand help with a newborn and childcare for her other kids. It would be so hard to evict her. NTA", "NTA - none of this is your problem and you don’t even need to justify why you’re saying no. I’ve turned down multiple friends over the years who have wanted to rent a room in my house simply because my wife and I don’t want a roommate. It’s your house & you can do as you please and you have no obligation to her. Also if she is getting evicted for not paying rent in year why should you think she has any intention of paying you?", "NTA. You're not obliged to let anyone live with you, and  especially not if it means kicking your animals out. Especially not for someone who hasn't paid rent for 12 months, and likely would \"forget\" to pay you rent too.", "So this person you don’t know felt entitled to your home because they didn’t think not paying rent for 12 months wouldn’t result in eviction?  Oof.  NTA.", "NTA. It doesn't matter what you have in your house or even if you have nothing at all. It is none of her business. You owe her nothing. She'd pay rent, yeah right.", "NTA she hasn't paid rent in a year she's definitely not going to pay you rent. She needs to stop having babies and get her life together", "NTA. Come on. A girl you're not even friends with feels SO entitled to your house that she expects you to get rid of your pets?", "NTA\n\nChantelle is such a great tenant that NONE of her close friends or family will let her move in with them.", "You don't need to change how you live and move things around to accommodate her. You're not the only option in the world, she can find another place. She is not facing living on the streets.", "NTA. \"Can I stay with you for a while, please?\" is a reasonable request, but not one you have to accommodate if you don't want to. \"I demand that you reorganise your own home to accommodate me staying with you!\" is not.", "NTA. Imo, it might be different if you were still close friends, but I don’t think you owe an old acquaintance who you’re not that close with anymore housing, especially if it comes with a high ask like this.\n\nSomething being a kind action doesn’t mean you always owe it to whoever asks it of you. And I’d probably be quite offended if someone suggested I “just” get rid of my pets so that they can move in with me.", "Nta", "NTA- feel like it was silly to post this honestly. Shouldn’t be a debate. It’s your place, your pets.", "NTA - seems kind of odd that she shows up on your doorstep after not being close for years. I’m assuming she has either burned all her bridges and/or can’t find anywhere else to stay so she’s grasping at straws. How do you show up to someone’s house, demand they get rid of their animals so you and your children can move in? 😳 As many others have commented, these friends that are siding with her and running their mouths…why aren’t they rolling out the welcome wagon for her? You also don’t want to get into a situation where she A.) doesn’t pay you rent (she wasn’t paying her rent at her previous place so why would she actual pay rent to you?) or B.) she doesn’t ever leave and plays the system to remain in your home. This whole situation is a large, blinking CAUTION sign with neon red flags all around it. You’re definitely NTA", "NTA You have no obligation to rent out part of your home to a family. You were not looking to be a landlord when this woman asked you to become one.", "NTA - Chantelle is entitled.", "And don't forget this \"friend's\" partner is in jail.  Where do you think he'll want to go once he's released?\n\nDefinitely NTA", ">And her friends joined her and it was just so very nasty.\n\nSo wait, she actually has friends instead of just people she used to know that own houses that are too large for them and should obviously be filled with her children? NTA Time to ban and look up local harassment and cyberbullying laws.", "Yeah, I agree with what the pigeons are saying about her. She’s “coo coo” for expecting an old friend to indefinitely house her and her kids. Even if you had the room, you’re justified in saying no. She’d move in. Not contribute. Expect you to babysit. And never leave.", "Exactly! Dodged a nasty bullet due to those blessed birds.", "Why don't the supporting friend host her?\n\nRoom or not, I am not doing home sharing with 2 kids and a baby coming...", "Then claim tenant rights if you let her stay too long and you'd never be rid of her", "[removed]", "Yeah why does this person just think she gets to occupy other peoples homes lol NTA", "Then bring in the husband or baby daddy when he gets out of jail. You dodged a bullet right there. Get rid of Facebook then you won’t know what all those people think or care.", "Bird tax!!! NTA btw. Your home - even if you want to help birds more that ppl ( which I don't say ) but even than you aren't the ah.\nI'm happy you taking care of the birds :)", "I wanna see the birbssss", "where birbs 🦧", "This comment and the replies are the best on this post.", "Birbs?", "Bird tax and bird room tax!!", "We're all waiting OP, where's our birb tax", "The kind of person that doesn’t pay their rent for a year.", "This right here is the best analysis of the situation.\n\n OP is NTA", "THIS. It’s exhausting how many people think animals are disposable objects, instead of sentient, feeling, living beings.", "Especially pigeons! Pigeons make lifelong bonds and are amazingly affectionate and clever companions! Getting rid of them would be cruel.\n\nNTA op, and pleeease post pictures! (also thank you for rescuing them and giving them such a great life! Not enough people appreciate pigeons!)", "I’d never thought about things this way before subbing to AITA. It comes up as a piece of advice so often on here and for fantastic reason. Just waiting for a real life situation to use it!", "Yes! pigeon pix, please!!!", ">she talks like a dog\n\nno, no, dogs would never stoop. They might lift their legs on someone, but they would never trash talk like this. Source: myself 😁", "> Maybe try to find a solution so she and your birds can stay with you.\n\nAfter the stunt she pulled on social media you still think its reasonable to ask OP to help her?", "They won't release people on parole without evidence they have someplace to stay, and since his baby mama can't keep up with rent, of course they'll need some stooge too spineless to kick out a pregnant woman/infant (depending how long he's in jail). Stick to your guns OP, don't be the stooge.", "I'd be calling each and every one of them out for not taking her in either.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Definitely not doing the same thing 🙄", "If they'd not been in contact for a long time, how did she know about the pigeons??\n\nOP, the plot thickens... she's been stalking you.\n\nNTA but we are still waiting for the bird tax, please.", "Makes you wonder if OP was the first person Chantelle asked, but then again she would have complained about them on facebook too\n\nNTA", "And OP is still questioning themselves!  It could not be more clear that the answer is a resounding NTA", "I’m sorry, how is the ‘friend’ not an asshole for telling OP to get rid of pets so they can move in? It’s also an asshole move to not pay your rent for a year.", "And only slightly less likely to pay rent than this \"friend\".", "Thank you for saying this! I've said this before and have gotten downvoted or had rude comments posted because I don't see why so many humans think we are sooo much more important and special than those we share our planet with. \n\nFrom one birb mom to the other: I had two baby pigeons I rescued several years ago. I cared for them for as long as I could, but I lived in an apartment building so I couldn't keep them forever. Loved those beautiful babies. I found a pigeon rescue and tearfully gave them up. Now I own a house and would be taken aback if anyone suggested I remove my pets (2 birds and a dog) so that they could take advantage of me. \n\nOP is definitely NTA. This person has some audacity.", "good point!", "OP can take in the displaced pets, of course.", "I guess I'm the bird one here to leave a comment for this reason.", "They have each other on Facebook and op could've posted it on her Facebook when she got them", "The friend is a total asshole. OP is NTA. I guess I phrased it weird.\n\nI am changing NAH to NTA in above post", "I don't own a house because of no inherited family wealth. 🙄\n\nLandlords and property/cash heirs are parasites.", "[removed]", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yes I am also here for the birdies.", "Please! Bird Tax! \n\nand definitely NTA", "Following for bird tax", "Birbs please", "\"Get rid of your pets so I can come live off you!\"\n\nEntitled.\n\nNTA", "No you are not.", "NTA\n\nHell no!!!! Wrong on so many levels. Pets are family. For me, if you take on the responsibility it's for the pets lifetime.\n\nPlus if she is about to be evicted you know fine well you'll *maybe* see the first months rent to convince you it'll be fine for her to move in, her word is good etc, and then there will be nothing else forthcoming. Then try evicting a pregnant woman with 2 kids and another on the way - that would be a nightmare!!", "NTA.\n\nShe sounds obnoxious and an entitled freeloader, that is probably why she has been evicted by her landlord.    \n\nAn obvious problem tenant and nasty individual to share accomodation with, even if she was willing and able to pay rent on time.\n\nIf it was me I'd allow the pigeons to live in every single room of rather than consider allowing her to rent 1 room. I'm not even a fan of pigeons.", "This cannot be real. There is no way you are being serious in asking whether you are an asshole for not letting someone you once knew burst into your home one day and demand to move in and have you completely change your life around...", "NTA you dodge a huge bullet. Bet she would have not paid you rent and possibly done something to try and kick you out of your own home. Also why did they go to you and not to family members?", "NTA. You have no obligation to put her up and it was very entitled of her to expect that you would get rid of your animal companions for someone you haven't really kept in contact with for years. Besides, what about all of those friends who are saying nasty things about you? Why can't they take her in? (Obvious answer is because they don't want to.)", "NTA... you don't have to justify anything past you don't want her there... it's your house. Your pets mean more to you than her, and that is absolutely okay. She is 100% TA and needs to grow up for her poor kids' sakes.", "NTA. No is a complete sentence. You owe her nothing.", "NTA at all, and given her reaction you dodged a major bullet.", "NTA, you gotta go on there with some \"not a bum who hasn't paid rent in 12 months having something to say\" or \"imagine picking a criminal as a baby daddy\"", "Nta, you dodged a bullet.", "NO “hey remember me from like years ago? I’m knocked up (again) and getting evicted…plus my ex is in the slammer…can you dump your cherished pets so I can squat indefinitely?” “Um no.” “Monster!” The peanut gallery from Facebook can house this woman. Enjoy your birds", "You dodged a bullet OP. Not the ass.", "NTA. You would be if you got rid of disabled pets for that woman. She has abilities they do not. I would not sacrifice my pets. Nope. \n\nBtw- Chanetelle is the true Fair Weather Friend. You have every right to say no. She showed you who she is- and probably why she has nowhere to live. You would never get rid of her.", "NTA\n\nShe doesn’t get to dictate how you can live in your home. Those are your pets. In your home. \n\nHer friends can put her up in their home if they feel so strongly about it.\n\nAnd OP. I’m not on Facebook so IDK, but maybe just never go on it. Life gets real simple and calm.", "u sent her where she belongs. back to the streets.", "NTA - you dodged a bullet. The red flags here are waving all around you.\n\n1. Getting evicted for not paying rent for 12 months but sure she'll pay you.\n2. Boyfriend in jail... what is he in for and you'll most likely be the one putting him up when he gets out.\n3. Kids... she has 2 and you have none. That's a huge disruption on your life.\n4. She's pregnant... the excuses for her not paying rent, helping around the house, and asking you to be her personal chauffer are going to be huge.\n5. Once you turned her down she flipped out on you. That type of person would do that same stuff any time you asked about rent or anything.\n\nYou dodged a bullet. I would not stress about being the Asshole here. If her friends won't take her in, why should you?", "Red flags for dayssss NTA.\n\nNext thing you'd have all her kids moved in with you and no rent paid.", "NTA\n\nTell her she is merely an acquaintance at best now and you do not have to let anyone move in and your birds mean more to you than her and her kids and if she hasn’t paid rent in 12months then how the hell would she pay you anything. \n\nTell her and her friends to stop being so entitled, that you do not want anyone living with you and her bad situation isn’t your issue and if they are so outraged which one if them is letting her live with them instead! \n\nI would recommend blocking her then on fb and your phone and if she shows back up tell her to leave or she is trespassing, doesn’t leave then call the police and let them deal with her she is not your friend and is not a good person!", "NTA - just say we're not even friends? Why tf would u house someone ur not even friends with? If she has so many friends who can insult you, they should take her in", "NTA.\n\nIt's your house and they are your pets. She has no claim on any of it.\n\nIt sounds like her life is a mess and she's not doing anything to try to improve it.\n\nShe hasn't paid rent for 12 months? And she says she will pay you rent? Yeah, no.\n\nShe's a giant mooch by the sound of it. It's better not to let someone like that in in the first place as you would have a huge issue getting rid of her when she didn't deliver on her promise to pay rent, even if you were willing to get rid of your pets for her. Save yourself the headache and cut all contact with her and the \"friends\" she lied to about what happened.", "NTA. It's either a stranger who doesn't pay rent or your family. The choice is pretty obvious I think. The ones who flamed you on social media, maybe they should give her a place to stay.", "NTA- you’re not obligated to offer space just because you have it.", "NTA .. she wouldn't have paid you rent. She'd had used you. You're better off without a friend like that", "NTA. Someone you're not even friends with demands you house her and her kids? Good thing you kicked her out. Given her response on Facebook, you would have been miserable if you let her stay. If her 'friends' care so much for her and the kids, let them put her up. You dodged a bullet on this one.", "NTA.  The last thing you need is that disaster in your house with her kids.", "NTA - she’s not your friend and she was going to use you. What makes you think she’ll pay rent if she’s failed to do so for the last 12 months?", "If someone said get rid of your animals or you're an asshole, I'd shit on their shoes because I'm an asshole.", "NTA. You have dodged such a huge bullet. I say block this person, she is clearly no longer your friend at all.", "Her poor choices and bad luck are not your responsibility to fix. ESPECIALLY because you’re not even really friends anymore. You’ve been loose acquaintances for quite some time, which means she used up all other other resources (meaning closer friends and family) before making her way down the list to you. All those nasty people joining in with her can support her, ffs. \n\nNTA", "NTA. They’re your pets and it would be cruel of you to get rid of them. It’s cruel of her to ask you to. \nBut like. Can we see the birds now", "NTA weird that she felt entitled to your home", "NTA. She sounds like the worst version of a walking talking res flag. You dodged a bullet from a damn machine gun.", "NTA. Im sure her other FB friends will willingly give her and her children a place to stay. I'm surprised she didn't show up  with kids and suitcases.", "NTA.  You're not responsible for your friend's poor decisions.", "NTA, and I love that you have rescue pigeons. Adorable.", "NTA - if she's getting evicted for not paying rent for a year, how is she all of a sudden able to pay YOU rent.  You dodged a bullet.", "NTA", "NTA. I wouldn’t let that woman in my house 🙄 you ain’t obligated to help her and if she wanna keep having that attitude, no one’s gonna help and they gonna be in them streets 🤷🏾‍♀️…", "NTA. You mean your pregnant \"friend.\"", ">And her friends joined her and it was just so very nasty.\n\nSo they can help her. Problem solved\n\n\nNTA", "NTA.  Why would OP even consider it?  The former friend would have squatted and refused to move for certain.  She already has a case of unpaid rent for a freaking year.", "Well, first of all not you are NTA. They’re your pets, that’s there house, and she’s asking to evict them so someone you don’t really know can move in.\n\nBut also you clearly dodged a bullet if she would call you an AH for not succumbing to her unreasonable request and dragging you online", "NTA- she is entitled to nothing", "NTA. Her situation is sad but how entitled to someone else’s place do you have to be to turn up to their house uninvited and request that they get rid of their animals to house you and your children. She’s offering you rent but didn’t pay rent for 12 months, so it’s unlikely you’d get a dime. \n\nIf her friends feel so strongly then they can house her and her three children. It’s not your responsibility and you shouldn’t move your life around for her.", "NTA. I’m curious if you asked her “friends” why they can’t take her in. They are her friends, right?", "NTA and it was recently National Bird Day!\n\nAlso why are you friends with this hot mess of a person again?", "NTA. At this point she’s barely an acquaintance, let alone a friend. Her living situation is not your problem. Sucks for her kids, but it’s not your responsibility. I would ask why none of her friends on Facebook are willing to house her? Fucking hypocrites.", "NTA. You saved yourself from a squatter situation.", "NTA, this person you're not really friends with anymore showed up on your doorstep and declared that you could just get rid of your beloved, not exotic, but not exactly easy to rehome pets to make room for herself and her 2.5 children. \n\nShe's already being kicked out because of her inability to pay rent or some other issue, so there is basically zero chance she will pay you, and high chances that she and the kiddos help themselves to the contents of your refrigerator. It is a VERY good thing you didn't let them in cause it wouldn't have been long before you had to kick them out again.", "NTA  You just dodged a bullet.  A non rent paying, entitled deadbeat with small children in your home would not be fun.", "NTA, she needs to stop popping out babies and handle her shit. Enjoy your birds.", "NTA. If she would like to sleep on the cot or pull out couch in the living room that you offer to her, then great, but you shouldn't have to kick your birds out", "Ummmmm NTA... dodged a bullet here. How ENTITLED. She shows up to a distant friend's home and throws a fit when you won't let her and her children MOVE IN because she is being evicted for not paying her rent for 12 months?! Thats a long time!!!", "> she hasn’t paid rent in 12 months.  \n>  \n>..............................  \n>  \n> let her move in and she’d pay rent.\n\nI believe the quotation above give the clear answer to you question:\n\n>Should I have let her stay with me?\r  \n\r\n\nAnd this answer is \"NO!\"\n\nYou are NTA, and it's good that you did not allow her to live with you: you would have to fight to evict her after 12 months of not paying.", "NTA. ***Anyone*** who asks you to get rid of your pets for ***any*** reason, of ***any*** relation (even spouses) is ***not*** worth having around. Dispense of immediately.", "NTA but the petty side of me wants to comment on her Facebook post to say, “I prefer the company of my pigeons over a person who remembered me only when she needed help from me.” 🤣🤣🤣\n\n\nThough I think it would be best if OP just blocks her in FB and in real life.", "I also want to know the bird names", "#BIRBS???", "TAX THE BIRDS!!", "WHERE ARE THE BIRDS", "Also if the AH's friends are bad mouthing you, ask them why they did not take the AH in.", "NTA. Still waiting for the picture of the birds!", "Agreed, she's not intending to pay rent. She's trying to find somewhere else where she can float.\n\nAnd OP it's not like you have extra space (you have space *that you are using*) or that you're trying to become a landlord. Other people are not entitled to your stuff just because they're in a bind.", "She also wanted to stay with two toddlers and a soon newborn in one room. Haha, she planned to take over the whole house. Kids play in the living room the whole time (and never tidy up), she takes over the kitchen and bathroom... and OP feel like a stranger in their home. \n\nOP, i love that you care for those pigeons ❤️ Thank you!\n\nNTA", "and free childcare. \n\nIgnore the FB trolls or let them know you told Chantell that they offered to take her in and then block.", "Who care what people say on Facebook.", "Someone that can't pay rent and who keeps breeding with a criminal.", "Expect that she would not pay rent. And she will call you names and post about you when you try to set boundaries.... Then you will be on reddit again and we will all say KICK HER OUT or... you're fucked she has occupied your space and you're STUCK", "Also a very important detail.", "Incredible that people don’t realise this story is fake af. No chance you’re seeing a picture of these birds.", "Am I the only one who loves hearing friends/family are going extra hard at someone else in these situations because they are desperate to keep the asshole pointed in any direction other than theirs.", "     The pigeons are obviously not the problem in this story\n\n\nWe have a new AITA Phrase! 🔥🔥🔥", "Get her an application for the circus.", "Exactly, and if all her friends are so happy to jump on board the Trash OP Train, why don't they put her up. OP is definitely NTA and dodged a bullet.", "Best point I have read!", "Exactly, then you'd have a jailbird and some \"friend\" that you haven't heard from in years plus a screaming baby and two probably running wild kids.  Keep the birds, lose the freeloaders", "Also pigeons are SO SOFT!", "You mean because birds aren't real?", "I am currently doing that with mail for my daughter whose abusive ex boyfriend still lists her address as his. We figured he’s trying to get her to let him in to get his mail and then try not leaving like he used to do to her. So she gives it to me and I do the return to sender, doesn’t live here. We live in a small area so it wouldn’t be hard for me to find him, but we’re not going down that road ever.", "One of my favorite posts from this sub: [AITA for dropping my freeloading brother off at our aunt's house after she called and scolded me for evicting him?](https://reddit.com/r/AmItheAsshole/comments/sgpy7n/aita_for_dropping_my_freeloading_brother_off_at/)", "Do pigeons eat Iranian yogurt?", "Absolutely. Many humans literally pretend animals don’t even have sentience. \n\nThis way of thinking is exactly why factory farms, rodeos, zoos, dog racing, and all other forms of animal abuse exist. People just being completely self centered, ignoring all the obvious, and being dumb or willfully ignorant (or just evil.)", "I think for me one of the hardest things I ever saw was watching beagles being released from a medical testing facility and putting their paws on grass for the first time in their lives. I was a broken person for awhile after seeing it. The little guys and girls were afraid at first because all they knew was life in small cages in a lab and never once experienced being outside of their cages. Once they felt safer, they were frolicking and playing and happy. They were all adopted out to loving homes. \n\nI'm so glad I'm not the only one who feels that human arrogance is disgusting and that as a species we highly overrate ourselves. It will also be our demise I'm afraid.", "Absolutely. I appreciate your compassion. I do hope you extend that compassion to other deserving animals such as cows, pigs, chickens and the like. People often revere dogs but then ignore that all farm animals are also sentient and suffer horribly. \n\nAnyway, that’s not on topic with this discussion. But I’m right there with you - animals are not disposable. Expecting someone to dump their pets just because they’re not human is really sick and twisted. And humanity needs to get it together overall because we are destroying the planet and all life on it! 😅", "++++", "Brand new throwaway account no activity anywhere copied the latest fad of AITA posts but changed \"dogs\" to \"pigeon\"?\n\nI don't think you're getting a picture that isn't from stock photo or taken from the streets.\n\nLOL down voted. Guys, this is a copy of an earlier post I can't find with parrots who had their own floor in a very nice house. Edit with receipts: https://www.reddit.com/r/AmItheAsshole/comments/yn4lzc/aita_because_i_wont_childproof_my_new_house/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "Not to mention this delusional chic went nuclear on social media because she didn't get her way.  Sounds like a great friend and tenant to have under your roof.", "And depending on the state (if in the US) almost impossible to evict a pregnant woman with kids. I've seen cases where landlords not only can't evict, but can be on the hook for heat and electricity.", "Yeah. I wonder what that reason could be?", "Never invite vampires into your house.", "I wouldn’t let her in if I had 2 spare bedrooms and no pigeons.", "Trash talk is cheap.  Supporting several mouths is not.", "Or it’s just a gossip-y town", "You’re a good parent!", "I LOVE THIS POST.", "Me tooooo! This was perfect!", "Several mouths and soon a noisy newborn. And once she’s there it will be hard to force her to leave.", "I most certainly am trying to be!", "Me too. Perfect actions.", "Chiming in to agree and also so I don’t forget.", "This other post was the first thing I thought of too", "For sure. My cousin and his gf were living in a mobile home he owned and she basically used another boy toy to kick my cousin out of his own house and barred him from the property (I think it was at gun point too). Legally he can’t do anything about it even though his name is on the property because she lived there for a certain number of years and has “rights” as a tenant. So now he has to live with my aunt while his gf burned down his mobile home and now lives in a trailer on the property. Good ole Oregon…", "And we saw it here first, y’all!", "Not even if she pinky-swore to pay rent this time?", "This should be higher lol", "Probably", "Third!!", "Just going to comment here because OP still didnt show the birbs OPs definitely NTA but kind of YTA because no birb picture", "They’re not even really friends anymore, either. It’s not hard to guess why she had to ask op rather than any of her own family or friends.", "Best to write \" Decided \" on any letters addressed to the AH and put them back in then mailbox", "This needs more votes.\n\nAlso, OP NTA", "Please! I require bird tax", "NTA. Block her but first suggest all those great friends of hers support her.", "NTA \n\nIdc about the entire situation, what stands out to me most is that she isn’t even a close friend anymore and expects you to get rid of your pets to allow her and her soon to be 3 kids, one of which will be a NEWBORN to move into your house and then has the audacity to flame you online because you wouldn’t?? \n\nEven if this was your absolute best friend you’d still be NTA", "I love pigeons! Pigeon tax! Now!!!", "She got pregnant 7 months after she stopping paying rent! Priorities are such a mess. OP dodged a bullet. If all she is dealing with is trash talk, be grateful that's all and move on with life. Could be so much worse", "But the birds having their own room is really the only similarity here, and that’s not that weird a thing to do if you have multiple large birds.  May this is real, maybe it isn’t, but it’s not a copy of that post.", "The Iranian yogurt is not the issue!", "Especially with the baby daddy in jail, and throwing attitude left and right.\n\nWhew, OP dodged a bullet!", "Damn. Is anything real on this site? :(", "I held a rescue pigeon for a little while a couple years ago and have been obsessed ever since. This precious bird shows up in my dreams!", "NTA at all. So her bf got locked up a few months prior but hasn't paid in a year?!?!? 🚩🚩🚩🚩🚩🚩🚩\n\nThis is your space and she is not your responsibility! DO NOT LET HER IN! Do not let her move into the house. Imagine how bad it would be if this is how she treated a \"friend\". She got pregnant knowing she wasn't paying rent for the 7 months prior to getting pregnant. \n\nYou are not in the wrong. Sorry she did that to you. At least the person who contacted you had the decency to ask you what was up instead of taking sides. Ignore and move on. This person is extremely toxic.", "Her hubby is locked up and she’s about to pop out another kid. she Wouldn’t have paid you rent either, and then you would have struggled to get her out of the house, all the while her friends would then post about how cruel you are to kick out a mom and three kids. You dodged a bullet, and I wouldn’t let her stay if I did have room. NTA", "Why didn’t her friends let her stay there? You should ask that. I’d also say yes, I love my birds more than I love Chantelle….what’s your reasoning for not letting her stay?", "This needed to be said. This is the biggest problem I saw. They were NC to the point where she is referred to as a former friend, she strikes up a conversation, then says \"get rid of your pigeons and let me stay with you.\" That alone should feel uncomfortable to say to a friend, let alone a former friend or someone they don't really talk to.\n\nOP is NTA, the former friend is though.", "I have birds and they have their own room. I've never made a dedicated post here, though. I have a habit of kicking pushy, demanding people out of my life though, so fewer opportunities to make memories worthy of posting here.\n\nThere are literally dozens of us!", "GOVERNMENT DRONES."]}