{"id": 6884, "submission_id": "107b7ns", "title": "AITA for telling my brother words, like actions, have consequences and he should know that better than anyone?", "selftext": "My brother is a widower twice over, with kids from both marriages. His first wife died when their children were 8 and 7 and his second wife died over a year ago and those kids are now late teens to early 20s. My brother remarried within a year the first time. His kids had a hard time with that and he told them that remarrying was a sign that he loved their mom so much, that he wanted to have that again, and that she taught him how. This second time he has declared he will not date or remarry again because he found his soul mate and cannot imagine life with another woman... as you can imagine his older two kids were not happy to hear that. They called him out on what he was saying and he told them they needed to understand. They told him they knew he was a liar and that his whole thing about loving their mom so much was bullshit. His kids from the second marriage were mad that their siblings wanted him to remarry and weren't happy that their mom was the more important wife. Now his older kids aren't talking to him, the younger kids don't want to talk to the older ones and he's acting like he has no idea how his words could be causing this.\n\nHe confided in me, his younger sister, and I reminded him of a time years ago when our dad talked about our brother (the first born in our family) as the kid he enjoyed the most. My brother never got over it and said nothing dad could say or explain would change that. Dad died and the two had not reconciled. I told him he needed to understand that words have consequences like actions do and telling everyone that his second wife was so special to him that he does not want to find another because she was his soul mate, is going to hurt the kids from his first wife since he moved on into a second marriage so fast after her and even told his kids no slowing down and to see it as him loving their mom.\n\nHe told me it shouldn't bother them as adults. I told him they love their mom and want to believe she wasn't less important to his second wife. He told me I was making it seem like being honest about his marriage to his wife was the same as our dad choosing a favorite kid and how I'm an asshole for that.\n\nAITA?", "created_utc": 1673260469, "permalink": "/r/AmItheAsshole/comments/107b7ns/aita_for_telling_my_brother_words_like_actions/", "score": 399, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my brother words have consequences like actions do and compared what he said to what our dad said regarding those consequences. He didn't like that. Maybe I am an asshole for acting like both things are the same. I know that he genuinely does not understand how things have turned out the way they have and maybe I am being too judgmental.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. How hypocritical of him to say it \"shouldn't bother them as adults\" when the comment your father made still sticks with him to this day. Hope he comes around for the sake of his kids", "Wow. He really thinks he's the main character and the only one with problems. He seems to think he can do no wrong and if he does everyone else is just overreacting. What a tool. NTA obviously, it was high time someone took him off his high horse", "NTA, but brother is a big one. How is he not seeing that his words hurt his children? There is a difference about being honest with emotions and being inconsiderate. He easily could’ve avoid this situation by talking to their children that both moms were great, and he loved them - well, not equal, because that’s stupid - so much, but after the second loss, it was twice the pain, so he just want to be alone for now.", "NTA. \n\nI don’t understand how it isn’t obvious to your brother why these statements would hurt his kids.", "NTA.\n\nYou laid out the truth after he confided in you. He can't handle said truth. He seemingly can't handle being in the wrong, so he shifts the blame to you and his own kids. What a self-absorbed jerk.", "NTA And you are right.\n\nLook if he feels that way fine, nothing can change that, but why share that with the kids? He could just say he does not want to go through the pain of losing someone else and I don't think anyone would blame him.\n\nWhy did he need to say anything to the children? Why announce it? There was 0 need to make this a family discussion", "NTA. Maybe in a couple of years of the kids not talking to him will make him understand, sorry for the kids and you for having a AH brother.", "NTA \n\nHim choosing a favourite wife is *exactly* the same as your dad choosing a favourite son!", "NTA.  I can’t believe he was son insensitive!  His older children will never let that go.", "Nta.  You were trying to help him see after he brought you into it", "NTA Hel-lo, it WAS the same - your dad was \"just being honest,\" too!", "OP - stop being logical, rational, and intelligent, this is reddit ffs. NTA", "Why were the kids from the second marriage not happy that their mom was the more important wife?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy brother is a widower twice over, with kids from both marriages. His first wife died when their children were 8 and 7 and his second wife died over a year ago and those kids are now late teens to early 20s. My brother remarried within a year the first time. His kids had a hard time with that and he told them that remarrying was a sign that he loved their mom so much, that he wanted to have that again, and that she taught him how. This second time he has declared he will not date or remarry again because he found his soul mate and cannot imagine life with another woman... as you can imagine his older two kids were not happy to hear that. They called him out on what he was saying and he told them they needed to understand. They told him they knew he was a liar and that his whole thing about loving their mom so much was bullshit. His kids from the second marriage were mad that their siblings wanted him to remarry and weren't happy that their mom was the more important wife. Now his older kids aren't talking to him, the younger kids don't want to talk to the older ones and he's acting like he has no idea how his words could be causing this.\n\nHe confided in me, his younger sister, and I reminded him of a time years ago when our dad talked about our brother (the first born in our family) as the kid he enjoyed the most. My brother never got over it and said nothing dad could say or explain would change that. Dad died and the two had not reconciled. I told him he needed to understand that words have consequences like actions do and telling everyone that his second wife was so special to him that he does not want to find another because she was his soul mate, is going to hurt the kids from his first wife since he moved on into a second marriage so fast after her and even told his kids no slowing down and to see it as him loving their mom.\n\nHe told me it shouldn't bother them as adults. I told him they love their mom and want to believe she wasn't less important to his second wife. He told me I was making it seem like being honest about his marriage to his wife was the same as our dad choosing a favorite kid and how I'm an asshole for that.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Your brother is the ah", "I think everyone is way too invested in setting up a competition between 2 dead women about who the brother loved most. Who can win a fight like that? The adult kids should realize they have no say in their dad’s romantic life, and if he loved his second wife more than their mom, that’s no reflection on them. It doesn’t even mean he didn’t love their mom. If he doesn’t remarry, that’s none of their business, & given the nature of many relationships between adult kids & their parent’s spouses, they should probably be glad about that. \n\nIf the adult kids have a quarrel with their dad that involves the children’s mother, they should keep it away from the kids. They should try to remember what it was like to be a little kid whose mom died & not make things worse for the kids. If you think you need to be involved in this, then you should be on your brother’s side. There’s a big difference between a parent picking one living kid over another vs adult kids fighting about which dead wife their dad liked best. YTA", "EDIT: ESH. It was a terrible and hurtful comparison. Words have consequences, OP.", "After he confided in you, you presented the truth. He cannot handle this truth. He can't seem to handle what is wrong and blames you and his child. What a selfish idiot.", "That's exactly it. How we use words has an impact and this is one of those times where how you say things matter.", "That's my thing. He announced it to the whole family pretty much, including the children from his first wife, the one who he wanted to remarry fast after losing. It's going to hurt feelings.", "That is not comparable and I'm jealous you didn't have to grow up with parents who had a favourite child.", "They were mad at the first kids for being upset/mad at dad for saying the second wife (second set of kids' mom) was the important wife. So the older kids did not like that dad said that and confronted him. Then the younger kids were mad at the older siblings for being mad and not thinking it was great.", "This wasn't about making me happy, it was about his older kids.", "I think you’ve misunderstood the post.", "Did you read the same post as the rest of us? Brother is a hypocrite just like father was a hypocrite. That comparison is rather fair.", "Yes, exactly. He can have his emotions and thoughts, he’s not an AH for that, he’s an AH because he handled the situation very poor, and unnecessarily hurt others feelings.", "Ok thank you for clarifying. NTA", "You compared him to your father who had a favourite child. This is NOT comparable to your brother having a soulmate who died. Your story doesn't indicate whether the first set of kids liked their step mom or not.", "ESH means that both sides suck. Comparing a parent choosing a favourite child to a man choosing a favourite wife is not a fair comparison, especially with no information about the brother showing more love to the second set of children in their daily life.", "Not to mention then refusing to try and understand why feelings were hurt.", "They weren't as close to her as my brother wanted them to be. She was no second mom in their eyes. I compared how words are used. Talking about how the second wife was irreplaceable to the kids from the first wife is not going to be taken the best by said kids. At least it's 50-50 on how they'll feel and you have to understand that.", "Of course it's a bit hurtful to hear, but it's still nowhere close to your words comparing him to your father who showed clear favouritism. I guess ESH would be a better judgment here.", "I mean, clearly it was just as hurtful when the older kids have stopped talking to him. I do want to be clear. I was not hurt by what he said. Two of kids were. He then came to me venting about his confusion that the kids were so angry. He could not understand why they felt the way they did.", "I disagree, the point op is trying to make is that words can be hurtful and that he should be more careful when talking about it. She's not comparing favoritism amongst siblings to the death of a spouse, she's just pointing out that he was hurt once by his father's words and now his kids are being hurt by his.\n\nIf he liked wife 2 better fine, nothing will change that but he doesn't have to share that with the kids. Plus I would not be surprised if in the minds of the older ones they thought that meant he preferred their siblings as well since he loved their mom more.", "I think some of that could be there. He was frustrated with the older ones over the years for not loving his second wife and not embracing her as their second mom. He believed that would be the outcome. It was not. A few times he'd tell me and our brother about it and how he couldn't understand them.", "If he was pressuring them to a make wife 2 their mother figure I think that might play a part on the rift in the relationship, if he disregarded their feelings and mourning their mother and immediately expected this woman to be a \"replacement\" and play happy family the problem might be worse than poorly choose words. Does he resent them for not playing along in his fantasy? Because if so yeah those kids definitely feel unloved, and as consequence will cling on to the memories of their mother because in their eyes that was the only person who truly loved them", "I don't know if he resented them but was definitely frustrated that they didn't move along nice and easy like he did.", "Please talk to his older kids, you don't have to get involved in the mess and pick sides but maybe it'd be good for them to feel like someone cares about their feelings because their dad unfortunately doesn't or is unable to atm", "NTA.\n\nCan your brother second wife have meant more to him than the first? Yes, for many reasons we cannot know, because we're not him. Should he bring this up in front of first wife kids after the really bad \"I loved her so much that I'm gonna marry again\" argument? Absolutely no.\n\nYou did nice, OP.", "NTA.\n\nJust as a heads up for anyone who might not know -- the speech/action dichotomy is **fictional.** There aren't \"actions\" and \"speech\" and never the twain shall meet. Speech is **an action.** And so naturally there are consequences for speech. There is a *distinction* between saying something and doing the thing you're speaking about -- but both are actions.\n\nYour brother said what he said out loud to the world and the people there took it to heart and are reacting to it. What more is there to say? You reap what you sow. The only thing you did was explain using his own life story why his belief that people must take his words with the placid grace of a monk are bullshit and obviously wrong. All you did was hold a mirror up to his hypocrisy.", "NTA. He’s entitled to feel however he wants about his two wives.That to which he’s not entitled is to dictate the consequences of speaking his mind.", "Looks like your brother can't handle the truth. It's smacking him right there in the face. If he asks you about it next time just tell him he can't handle it and move on. NTA.", "NTA. You were trying to show him how words can be so hurtful. I have trouble understanding how he can so oblivious that he doesn't see how his proclamation could be so hurtful to his children from his first wife — but it sounds like he has to learn some things the hard way.", "NTA but your brother sure is.", "Nta, I love the whole “he told me I was making it seem like being honest about his marriage to his wife was the same as our dad choosing a favourite kid” umm yeah you are choosing a favourite wife which makes you an asshole to the old kids whose mum is “not the favourite/ lesser”", "NTA. Your brother is acting like a hypocrite saying his “adult” children shouldn’t be bothered by his words. Your dad died and brother still hadn’t reconciled with him. Ask him if he wants that to happen to him.", "NTA. something we should all remember is that speech is an action in itself. expression of a thought is not the same as thinking it. when you have a thought or idea, it lives inside your head. when you express that thought, whether through speech or writing or painting or whatever, you put it into the real world where it can affect other people. in short, think before you speak.", "NTA\n\n>He told me I was making it seem like being honest about his marriage to his wife was the same as our dad choosing a favorite kid \n\nIt is the same, though. His dad had picked a favourite kid and, in the eyes of his eldest children, he has picked a favourite wife. He didn't love their mum as much as he loved their step-mum. Of course that's going to hurt them, regardless of their age.", "NTA.  Your brother made his bed and needs to lay in it.", "Nta but your brother sure is.", "NTA just in the company of one. Is he always this self centered and unaware?", "NTA. I think you explained it very well.", "NTA you used this example to illustrate why his words hurt. But he seems to be very adept at twisting his words to suit.", "NTA, but your brother is. Obviously some r/maincharactersyndrome/ attitude there. His dad's words hurt him, as a much older adult, but his children shouldn't be hurt by his words? Hypocrite", "NTA\nYou’re right", "NTA, in the beginning while he knew he was causing pain , he was using love as an excuse to justify his actions in remarrying. \nMany people have/ will use Love as excuse to justify their actions. Doesn't mean that they are right.  mostly never are if you need to make excuses to justify your actions to others.\nHe may well be telling the truth now, but he dug a hole from which he cannot escape, now he needs to bridge that gap. \nPerhaps reminding his children that they were all conceived and raised in loving homes,  and that is the most beautiful thing of all.", "YTA\n\nI am amazed at the responses on here. Where is the empathy. \n\nThe man has lost two wives and is once again having to bring up preteen kids on his own.\n\nHow lucky the OP is to be in a position of offering advice and telling him off without have to experience what he is going through.\n\nInstead of kicking him whilst he is down, how about offering practical advice how to resolve the situation and maybe just maybe offering support to someone who must be emotional fragile needing of help.", "Right? After all, his dad was \"just being honest\" about having a favourite kid!", "Agreed. NTA", "I feel like he’s being deliberately obtuse \n\nNTA", "I would say that in his hypothetulical next marriage that he does not want, he is indeed the main character. Just like he was in his last two marriages (besides his wives).", "One could argue that his father was being honest about his feelings for their kids. Honesty isn't a shield for shitty behaviour", "My brother's younger children are not little kids. Technically all are adults now, though barely. But this wasn't an argument had in front of young children.", "No, but he is being that way with this.", "Doesn't sound like he seemed super supportive to his kids when they lost their mother.( Remarriage within a year) so when he said he clearly favored the second wife, he was called out by his first kids about his lie (loving her so much). Brother sounds selfish and needs everyone else to understand his feelings while shitting on everyone else. Sister gave him a fair example of words having consequences, yet he is clearly an adult who still hasn't gotten over it. NtA to OP.", "His younger kids are not preteens. They are 18, 19 and 21.\n\nThere really isn't practical advice to offer while he believes his kids are being unreasonable.", "It seems your brother can't handle the truth. It's right there smacking him in the face.", "NTA. \n\nI can’t believe he was son insensitive! His older children will never let that go.", "Plain and simple, I like it.", "For a few years I was the favorite child of one parent.  It made me the scapegoat for the other parent. Which led to many occasions with the parent with whom I was the favorite as a 5yo to be surprised at my kindness, goodness or just being fun as an adult.  The hating parent had so jaded them they no longer saw me as I am but through the hating parents eyes.  I ended up going very low contact with them both 20 yrs ago.  Now they just wonder why I’m “harsh, bitter, and distant”. I only respond, I don’t initiate.  So that’s the missing reason.  Besides the vitriol that’s lobbed my way from hating parent.", "I prefer this person to that one\n\nI prefer your brother to you.\n\nSame sentiment", "The younger kids, whose mom recently died, are mad that the adult kids are trying to make their mom seem less important. The adult kids should try to remember what it was like to be children whose mom died, & imagine what it would have been like if their family was mad at their dad for missing their mom. Dad should think before he speaks but the rest of their family, including his adult kids, should stay out of the question about whether or when he should remarry.", "Maybe it’s too painful to face. Grief is a heavy weight, he has to cope too. I can’t imagine losing two spouses. Maybe assure him he can have more than one soul mate in life, and it’s not a betrayal to the other.\n\nAlso more practically speaking, being aware he would’ve had to process and get past his first wife’s death for the sake of his second one. It’s ok to not want to erase another wife’s memory like that, I’m sure it not easy to move on, the guilt. I’d get not wanting to go through that again I guess. Especially for the speed he did it at before and flack that brought.\n\nHe may benefit from grief counseling, reduce his anxiety around the appropriate way to grieve and channel it somewhere before he says anymore things without thinking…\n\nIt’s just so sad overall, for all of them. His older kids are also grieving two mothers loss, and struggling with how to balance both memories.\n\n(Edited: added a lot)", "I am not saying what he said was considered or thoughtful, but what I am saying is that you and others dont seem to think he should be treated any differently.\n\nWhen my friend lost her husband we all treated her gently, except her outburst as part of her grieving process and continued to offer her support.  We did not start arguing with her or telling how she should feel and what she had done wrong. We certainly did not call her a AH.\n\nWhen women suffer during pregnancy, with hormonal changes should we have a go at them for any comments that are of order?\n\nYet in this case, this man has lost two women who he loved deeply and posters  seems to think that this pain is not even a consideration", "\" his first kids about his lie (loving her so much). \"\n\nBut i don't think it was a lie. Things can change feeling don't stay the same. You can love two people equally but a 10 year marriage is not the same as a 5 or 15/20 year marriage. A marriage/love in your 20/30/40s is different to a marriage/love in your 50/60/70s. \n\nCould dad have worded things better yes, but kids are being aholes by expecting just because the dad things one way the first time things are exactly the same the second time around and he has to do the same.", "I may have read this wrong but it says that ' **His first wife died when their children were 8 and 7 and his second wife died over a year ago and those kids are now late teens '**\n\nMy assumption is that the kids from his first marriage who were 8 and 7 when his wife dies were now preteens so 12 years having passed with the kids from his second marriage being around 10 or so.  \n\n\nReading back I could have got that completely wrong.", ">I prefer this person to that one\n\n\n>I prefer your brother **to you**.\n\n\nBeing neglected for 18+ years really fucks you up.", "The older kids want both wives to be viewed the same.  He could have worded it much better like “After having two loving wives who each gave me beautiful children I don’t see myself marrying ever again”.  That way the older children’s mother is not considered lesser of the two wives.  No one wants to hear that their parent that died when you were young wasn’t as loved as their other parent’s second spouse.", "Perhaps. But he is losing two of his five kids now and I don't know that he can repair this if he doesn't face stuff. Maybe that would be for the best. I don't know. It's just sad because it's destroyed the sibling relationships and a relationship between him and the older two.", "Personally I think it is highly overrated when women say horrible things and use pregnancy or hormones as an excuse. It isn't one.  \nHe thinks his kids, who were 7 and 8 at the time, should get over it when he made them feel like he easily replaced their mother. It isn't that it's not a consideration, it's that he made his children feel hurt and lied to.\n If were speculating, I'd guess he knew second wife before first died, but that is neither here nor there. Brother said hurtful things, now has to deal with his consequences. \nSister is clearly NTA since she explained in a way she thought he could understand. \nSucks that the brother lost 2 wives, but he is going to lose his first kids too if he doesn't mend this. Even if he was thinking it, he shouldn't have said it in front of them. Made his bed, now laying in it.", "You're totally missing that:\n\nA) With the loss of the first wife, he apparently wasn't all that distraught; and\n\nB) His hypocrisy at not recognising the exact same hurt of his own over his father's comment.\n\nSo, all in all: No, you're just wrong on this one.", "I mean, sure. But you can't expect it not to come up when you tell your young children that you remarrying is a good thing and shows love for their mom and doesn't give them time to accept things before taking that step. But then declares loudly that he loves the second wife too much to remarry. Even if they're adults they are still entitled to have complicated feelings and hard feelings about their dad's actions and words. Ultimately, the man wanted to vent to me, and I let him, but then was confused by the new no contact with him and the older kids, and he didn't like it, and was trying to figure out why, I told him, which he also didn't like how I said it. I can't make them feel differently just like I can't make him apologize. But I understand how this mess started.", "Kids from the first marriage are in their late 20s/early 30s. Kids from the second marriage are late teens to early 20s.", "Your approach would have been perfect, had your brother had the least bit of self awareness!\n\nYou are NTA.", "Yea, wishing y’all the best. I added a lot to my reply btw…", "Well as a man (and a coward) I am not going to comment about women pregnancy and hormones.\n\nWhilst I sort of agree what you are saying, I see no where in the Opening post the OP saying he should do this or that to resolve it, All she has done is told him off and call him a hypocrite. \n\nI am shocked that anyone who has suffered such a tragedy, would be told by those who are meant to love him, such advice.\n\nInfact I think I would be speaking to the kids saying that their father doesnt mean what he says but is going to a crises.", "&#x200B;\n\na) On what basis did you get that, because he remarried quickly?  Are you saying that a woman who has a baby soon after the death of a child, didnt really feel anything for the first child?\n\nb) So what you are saying is going through two deaths of a partner holds no merit and people should be held accountable what they say and how they act without any allowances?\n\nSorry I dont believe this would be true if circumstances were different.", "I saw! His older kids actually didn't care much for his second wife. So no grieving there. But both sets are now grieving moms and it has become such a mess, and really no easy way to reconcile any of this.", "Second wife died over a year ago, and while he has my sympathy from multiple losses, the brother asked for advice from OP. I think OP was just trying to explain it in an easy to understand way (comparing his feelings from their Dad to his first kids with him). Also it isn't sisters job, and it comes off as condescending when people says \"so and so didn't mean that\". If they didn't mean it, it should come from them.He is hurting, but so are all the kids. First wife and seconds. He is making a bad situation worse. He should apologize to first kids for making them feel that way and assuring seconds that they shouldn't be involved with his disagreement. They all should get love and support, but it seems he dropped the ball on handling it his kids with first wife's death."]}