{"id": 6885, "submission_id": "1076w7e", "title": "AITA for asking my friend that I didnt help in the past for help?", "selftext": "Well this ones weird.\n\nSo my friend is forced to live in a hotel for awhile because her house flooded, and she tried to get me to do the refer a friend program with a credit card so she could redeem points and save money with extra nights because her insurance is slow sending out money and she has bills I guess, but I said no because I wasn't comfortable and didnt want to mess up my credit(Im trying to buy a house for my baby moms, my child and I) She said it was fine but I sensed it wasn't. \n\nShes helped me a lot in the past when I needed her. I cant repay her for what shes done but I just can't help her in this situation. I invited her over for a meal-- thats all I really can do right now.\n\nUm, well, I purchased some cheap appliances on facebook marketplace today and I called her for help because she has a truck and all. She seemed a little annoyed and said \"No I dont want to risk messing up my truck. I have work tomorrow. Maybe some other time?\" and I just bid her a good night and got off the phone. Was I out of line for asking? I think I had a legitimate reason to not do the refer a friend link for a credit card.. AITA?", "created_utc": 1673245476, "permalink": "/r/AmItheAsshole/comments/1076w7e/aita_for_asking_my_friend_that_i_didnt_help_in/", "score": 346, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Okay again she HAS helped me through a lot of ruts. Situations where I needed some food and moving shit, but I really couldnt help her. Im doing the best I can right now\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I just can’t believe you had the gall to ask, esp after she’s gone out of her way to help you a number of times. For just that, YTA.", "INFO: Can someone confirm doing a refer a friend program will actually affect credit? I've never heard of this and can't find anything supporting google. Yet OP uses being justified as an excuse", "Yes, you were out of line for asking. She clearly has a lot going on at the moment. And just as you didn't have to help her, neither does she. You turned her down, as is your right to do. But don't be surprised when going forward, she stops the help train that you have become accustomed to. As is her right to do. \n\nN.T. A for saying no to her request. But Y. T. A for then asking for help. Your timing sucks. \n\nSeems like it's always about you asking for help. The one time she made it about herself, you shut that down. But then quickly made it about yourself again. Reading your post plus comments, I'm getting pretty big \"me, me, me, all-about-me\" vibes.\n\n1. Friend has a truck and uhauls are expensive so she should off course help. \n\n2. She was rude in her response\n\n3. She's not a true friend coz she asked for help. But you have admitted to her helping you countless times in the past. What kind of help did she give you? \n\n4. You moved on pretty quickly from her problem to looking into ways in which she can help you again. \n\n5. You couldn't help. That's fine. But just because the problem went away in your head, after you said no and offered a meal as recompense doesn't mean that the problem went away for her. She's still living in a hotel. Her house is still flooded. Insurance is still slow. And she is still struggling to pay bills. But in your self-absorbed self, now is a good time for you to ask for help? \n\n6. In the past she'd usually drop everything and help. The entitlement dripping from your comments. \n\n7. You're putting yourself and your family over her. She has a family too. And she has her own problems. But she is supposed to put those aside and help you? \n\n8. Why is it okay for you to say no? But not for her? Why is your no absolute? But not hers? \n\nQuick question: Was the plan for her to drop off the appliances, same time she came over for the meal? Or were those on different days?\n\n\nEdited.\n\nJudgement, mostly based off your comments (edit: though was still leaning that way as I read your post but your comments solidified it for me) YTA. Big one. I hope this teaches her what kind of person (wouldn't call you her friend at this point) you truly are.", "YTA.  Wow her house floods and you can't do anything for her but you think it's okay to ask for her to help with moving appliances?  By your own admissions she has done things for you that you \"can't repay\" and it seems like you are perennially a taker who's only concerned about YOUR needs with no regard for helping others if you have to make any sacrifice of your own.  How did you get so entitled exactly?", "YTA\nI had a good read through the comments and your answers .\nYou don’t want to help her that’s fine , I’m not going to really accept the credit score argument cause your mortgage plans are not immediate from what I see , so your credit score would recover or get it even better by the time you seriously look for a house/mortgage.that is not important though , you don’t want to help her that is fine .\n\nThe problem is while you’re not actually interested to help her you expect her to drop everything always to accommodate to your needs and problems , through your comments you made it abundantly clear that friendship is only one way with you always on the receiving end .you can’t seriously expect others to sacrifice time money attention love and kindness if you’re not willing to reciprocate. You get what you give pal that’s how it  is", "YTA for asking at an inappropriate time...Know when to read the room dude, she's clearly stressed and I'm sure you must have other people you could've asked", "yta\n\nyour friend helps you and when they come to you for help you say no\n\nthen you have the check to ask for help and moan when they say no\n\nyou sound like a horrible friend", "YTA, how does a Credit Card Referral effect your credit? Either you're just being an asshole, or you're too dumb to realize this isn't a thing. Either way you're still the asshole.", "YTA - like you said she already has helped you a lot in the past and you never repaid her, she ask for one favor and you couldn't help and then you think that she has to help you again??? She is better off without your selfish friendship", "YTA\n\nYour friend is clearly annoyed at you for asking their help. It sounds like this is a very one sided, with her helping you when you need help, and you not doing much in return. \nSo she's now matching your energy, not helping you when you need help, either.", "Get over it lmao just buy the uhaul or whatever", "YTA. Your friend is smart. Love it when people see through leeches and moochers and act accordingly.", "YTA\n\nWhat she was asking for was super simple; would’ve had a very short term effect on your credit; and unless you’re near there edge of what’s ok credit probably wouldn’t matter, loan officers look at way more then credit, and multiple cards can help your credit in the long run, but you didn’t bother to look into any of this because your family comes first and nothing comes second.\n\nShe sounds like someone who’s been very helpful to you in the past, but now you’re salty she’s pulling back because it’s clear you can’t take the simplest and most basic of risks. I’d say most credit card applications are less risky than driving across town.", "Yta due to poor taste", "OP can you clarify what you mean by the credit card referral? I’ve never heard of a referral program that effects your credit score before. You usually just get bonus points. People give out their referral codes to strangers even.", "INFO: if she dropped everything for you during your time of need, what have you done to repay her?", "YTA.\n\nShe gave you the same help you gave her.\n\nYou accept help but are unwilling to give it.", "YTA. You're wrong AND a bad friend", "YTA. You refused to do a favour for a friend and were then surprised they didn't want to do you a favour.", "YTA and you’re wrong in this situation. People are telling you why. You’re a horrible friend and should really reflect on WHY you are the AH. Just think about it because based on the comments you are taking ZERO responsibility and are not accepting the judgement. How can you think it’s appropriate to ask to use her own car and “even offer gas money” (newsflash: if someone is gracious enough to let you use their car you fucking pay for gas at LEAST) after you literally gave her scraps by offering to have her over for New Year’s dinner and thinking that’s such a sacrifice on your part. It’s not at all, that’s the bare minimum you can do for a friend who has helped you self-admittedly a lot in the past, and is going through an extremely rough patch right now.\n\nIf she’s smart, she’ll drop you as a friend tbh.", "YTA. Choo choo the gravy train has left the station.\nWhat goes around comes back around", "YTA, but honestly, you're worse than just that. You're a leech. \n\nYou use other people when you need something from them, and then give them the cold shoulder when they have a legitimate emergency. And then, in the midst of that emergency which you refused to help with, you have the audacity to ask for another favor? That's just poor character. I feel so sorry for your kid, being raised by a selfish narcissistic person like you.", " “ ShE’s ThE OnLy PeRsOn I kNow WiTh a TrUcK “ you’re annoying. And your TA", "YTA, especially from your comments. I hope your friend realizes what a horrible “friend” you are and drops you since clearly you’re only using them.", "YTA. Your credit wouldn’t have been affected, it’s not like she was asking you to be a guarantor. You know she’s stressed and dealing with all her own stuff but then go on to ask her for help", "YTA big time. She helped you before and apparently to such an extent that you « can’t repay her » and you don’t even try. I mean I don’t know if a refer the friend program would actually mess up your credit but there are other solutions or ways to show you try to help. And on top of that you ask for her truck (which would have saved you money and time but apparently when it’s about your finances it matters more) ? How can you not see what a bad friend you are ?", "YTA and a user", "Yta", "Why are you uncomfortable referring her? The bank won’t give her a CC if they decide she’s ineligible, that’s not going to affect your credit.", "Referring a card would not hurt your credit. Your thought process is senseless. Then asking to use her truck -something that requires her time/effort/money - you’ve got to be kidding yourself if you see yourself as a good friend. YTA all the way", "Info: what was your plan to get the things you bought home that didnt include her?", "YTA. She has helped you out numerous times and you've said you can't repay her. I get your reasoning for not wanting to risk your credit, but she has every right to refuse to continue to help you out when she gets nothing in return. Rent a truck and move the stuff on your own.", "YTA - did you even bother to find out if referring her would affect your credit score before turning her down? \n\nYou seem like a taker. Take, take, take but when the times comes to give - “you’re not comfortable”.", "YTA. I’m rarely impelled to comment on here, but you sir, truly and absolutely, suck.", "YTA\n\nWow, just wow…", "I'm not exactly sure, but it sounds like all you had to was to reffer to her? Which if I understand correctly, don't actually cost you money or affort? \nYou said you think there's a reason, but It dosn't sound you did any reaserch.\n\nYeah YTA. \nTo ask a favour so soon after refusing such a simple favour is being a dick.", "NTA for refusing the help. Insurance can take a long time to pay out and it isn't always what it should be. \n\nBut to then go and ask for her help? That's not cool, man. She's stressed as it is, and while I get why you didn't loan her money you don't have, she's hurting all the same. Manage the appliances yourself.", "You aren’t wrong for not getting a new CC if you’re close to applying for a mortgage. Anyone who’s saying otherwise doesn’t know how this works.\n\nGo on r/financialplanning and you’ll find a bunch of people who don’t know that and got screwed. \n\nBut sounds like you didn’t explain that well to her, failed to help in other ways, then asked a favor when she was already stressed. All to a person who helped you so much you can’t repay her. So yeah YTA", "NAH. you had a legitimate reason not to want to apply for a new credit card and she has a legitimate reason for not wanting to lend out her truck. this seems like a nonissue tbh.", "NTA. But you could've loaned her the same amount of money she would've gotten for referring you. \n\nSo when YOU need help she HAS to help? like only you can refuse? She has a legitimate reason too, that's her means of transport and moving appliances can mess up her truck.", "NTA, you certainly don't have to help her out, but she's totally entitled to respond in kind. Don't expect people to help you if you won't help them.", "NTA for not wanting to put your credit in jeopardy, but kind of TA for asking for help (when you haven’t helped her and she has repeatedly helped you.) Is there anything else you could have done to help her in her situation?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWell this ones weird.\n\nSo my friend is forced to live in a hotel for awhile because her house flooded, and she tried to get me to do the refer a friend program with a credit card so she could redeem points and save money with extra nights because her insurance is slow sending out money and she has bills I guess, but I said no because I wasn't comfortable and didnt want to mess up my credit(Im trying to buy a house for my baby moms, my child and I) She said it was fine but I sensed it wasn't. \n\nShes helped me a lot in the past when I needed her. I cant repay her for what shes done but I just can't help her in this situation. I invited her over for a meal-- thats all I really can do right now.\n\nUm, well, I purchased some cheap appliances on facebook marketplace today and I called her for help because she has a truck and all. She seemed a little annoyed and said \"No I dont want to risk messing up my truck. I have work tomorrow. Maybe some other time?\" and I just bid her a good night and got off the phone. Was I out of line for asking? I think I had a legitimate reason to not do the refer a friend link for a credit card.. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "People like you always need help and aren’t ever willing to give it. Irritating AFFFF", "YTA.  Anyone else confused about how referring a friend for a CC would wreck OP’s credit?  She wasn’t co-signing a loan, Jesus…", "YTA for asking. Get back in your lane.", "YTA on every single level.\nYou say “I can’t repay her” but you can and said no.  For a false reason as well as if that is going to ruin your credit then you won’t be getting credit anyway.\nI mean, if I had a friend in that situation they’d be sleeping on my sofa at worst and not staying in a hotel.  You are no friend.\nAnd then you have the nerve to ask for a favour?  I hope that they realise what an utter waste of space you are and get you out of their life.", "That's only when you are in the needs that you realise who are your true friends. You are not . YTA", "Of course YTA. She helped you in the past, she needed your help once and you decline, and you merrily ask for her help again. Have you no shame?\n\nAlso... baby mom? Is that all she is to you, your child's incubator? Talk about being a taker. Wow.", "YTA, big time.\n\nYou say she's always jumped to help you in the past. But now, when she is in a colossal bind and desperately needed help, you told her to kick rocks. \n\nDon't be surprised if she stops helping you or even talking to you. Good captains are not made by calm waters.", "It’s not weird - you are just an ungrateful asshole. YTA", "YTA and I honestly felt glad she denied your request.", "Jesus's Mary and Joseph you are the AH for not even understand how big of an AH you are.", "YTA I would expect her not to do you favors anymore. You sound entitled af.", "Good job! Through being selfish when asked to do a simple thing you've lost a lifetime of helpful friendship! \nYTA, Dont bite the hand that feeds you and then expect lunch.", "YTA. You can rent a truck from uhaul for 20 bucks", "YTA", "YTA how would you not be? She needed help during a legit crisis and you refused, now you’re asking for help because you didn’t get your ducks in a row and are upset she’s saying no?", "YTA. The rule is people do favors to people who do favors back. The fact you asked for a favor after declining to do a favor, means you think you're exempt from this rule. Like you're better than anyone else, like you're special in some way and people owe you things just because you exist. = AH\n\n'I think I had a legitimate reason to not do the refer a friend link for a credit card'. No you didn't. Referring or being referred doesn't mean s-t to credit to anything. It's the littlest amount of effort anybody could have possibly do. It means nothing. You get an ad or a sale call and you say no and that's it.\n\nShe basically asked you for nothing and you said no.", "Not a weird one at all. You're just selfish :) and don't value her at all. She is only useful to you for what SHE CAN GIVE YOU. Clearly she's not even a friend. She helped you out a lot before too huh? You're a pretty crappy person if you take, take, take and never try to show gratitude for it .", "NTA.  That was a pretty big favor that she was asking.  If she wants to punish you for that, she is not a friend.", "I think there’s a pretty big difference between “can I have your time and assistance,” and “can I ask you to change your credit report and materially risk your financial stability and future.” NTA. \n\nAlso: The insurance was going to pay. She needed a short-term solution. That’s pretty much exactly what credit cards are for. And it sounds like she has one.", "NAH You're not wrong for not being able to help her. You also cant blame her for not wanting to help you out after you just told her no and she has helped you many times.", "Whats the harm in asking? Im not forcing her, dude.", "Finally someone mentioning this! A lot of people are writing as if he is applying for a new credit card for her?. But AFAIK that is not how referral programs work. It’s literally just a link that lets someone sign up for the credit card like normal but is “proof” that you told them about the card so you can get extra points and the other person also gets bonus points. I’m confused on how this hurts the original persons credit score.", "Don't know if it would affect credit. But what I do know is that OP is a taker. Read their comments. They are used to just taking and taking. I suspect giving in any form would be an issue for them.", "AFAIK applying for any type of credit is noted on your financial record and has an effect on your credit score. Just the application can have a detrimental effect on your score (tbh I imagine this would need to be extreme i.e already poor credit but seeking more kinda scenario) refused credit has a substantial impact on your score and even successful credit app can effect it (this is potential future debt and must also be considered when applying for a mortgage)\n\nUK based just FYI not sure if it works the same elsewhere\n\nPersonally I wouldn't apply for a credit card just because a friend asked me to. (Having just bought my first house I am painfully aware of things that could affect my financial security)\n\n a friend of mine asked me to be a guarantor for their rent so they could move. This wasn't a short term guarantee for me to cover their rent (only if they fell behind) like for the first year but an agreement for however long they are in the house. If they stay there 20 years and get into financial trouble I would become responsible for the rent 20 years down the line. I can't guarantee I could cover the rent in the future. \n\nMy friend was not wrong for asking me and I was (imo) not wrong for saying no. Neither one of us held a grudge\n\nHaving said all that the OP is clearly YTA for the ridiculous level of entitlement! I fail to see how his friend was rude by simply saying no, maybe another time? Dude is delusional and selfish. \n\nI was just providing my understanding of the financial aspect from my experience", "Yes applying for credit will affect the credit score. But will do so minimally.", "This. Exactly all of this. I'm a bit older so I have more luxuries in terms of space but even when I was younger my only response would have been \"Hell no, check out of that hotel - you're coming to stay with me and I won't take no for an answer.\"  \n\n\nIn my younger years, the space I could offer my friend may not be best or anything - but it's better than paying for a hotel while struggling with money.  I don't need to say it but because it's customary, yeah - definitely YTA.", "Summed up beautifully", "Fair enough. And no I offered for her to come over for a new years meal because her house flooded during the holidays and I guess her home now needs extensive repair. I felt bad because she bought over stuff for the baby and like a week later she called asking me to do a refer a friend program for a credit card. I told her Id think about it. We met up at a dinner gathering at another friends the next day when I told her no. She said \"thats fair\" and my other friend glared at me and told her I'll apply. So I figured everything worked out in the end. Guess it didnt.\n\nEdit: I get she didnt want to use the credit card money but just applying for a credit card is huge especially since Im trying to buy a house..", "In response to the question you asked about what type of help did she give me, I don't want to answer that question honestly because you guys will antagonize me further. I simply came to this subreddit to find out if I was wrong in this situation.", "They got so entitled because she would “usually drop everything to help”. She’s the fixer, not an actual person 😂", "[removed]", "agree with you", "Im more concerned for my family. I get shes stressed but she's literally the only person I know that has a truck. I even offered gas money", "I agree with everything you said.  And I wonder if the OP even understands that he would likely stand to gain at least a few hundred dollars if not more through the credit card promotion.  I usually earn on average close to a $1,000 per each new credit card promotion, primarily with Chase Southwest.  I hope the Southwest part doesn't cause any of you good members to have a PTSD moment.", "Shes the only person I know with a truck", "How?", "He clarifies in a comment she didn't want to use the money but just wanted him to apply so she'd get a referral credit. She specified she wouldn't take his money and only he would have his card. It's like when you refer a friend to a cellphone company and get a referral credit on your bill.", "I see how it wasn't cool but I really just needed help because uhauls often have a lot of hidden fees and in the past she'd usually drop everything to help", "This is a fair response", "She doesnt have to help but she had no issues helping me out in the past. Now its an issue?? Im not messing up my credit for her", "Thats fair I guess. She didnt have to be rude about it.", "Honestly I could've offered to let her sleep there but I have a kid over her and she has a family so I cant help her.", "I'm not sure if you are clear on what her friend was asking.  Either way, I don't think it was a big deal.  In fact, this sort of thing goes on all the time with friends and family who do it as a favor just for people who want travel points, let alone someone trying to watch her money carefully after her house flooded.", "I'm sure she's a good friend to people who aren't constantly trying to use her, like OP.", "Yeah she really isnt. I honestly need help and getting a uhaul is expensive nowadays", "Thats the thing I kinda feel bad about. She wasnt asking to use the credit card but yeah Im not going to get one just so she can redeem reward points. Its really not my problem.", "It’s the shamelessness that gets me", "Cause if you’re not willing to help others you shouldn’t be asking for their help .\nYou’ve already stated she helped you many times in the past and dropped everything for you but the thing is this goes both ways or should be both ways at Least !\nShe sees she can’t rely on you and she won’t offer her help further it’s your loss not hers", "But you’re salty she refused.  YTA", "In which world are you not the asshole? You’re an entitled cow and frankly I feel sorry for your child. We will probably see him here in a few years talking about his ah father.", "there's no harm, we're all just impressed by the audacity", "Bc now you're here whining about it instead of just accepting her decision.", "Having been the same type as your friend your friend, by that I mean the one who always helps others because I felt it was the right thing to do. \n\nWhen you then don't receive any help back after all you've done, frankly, those people can go eff themselves. \n\nShe asked for help in dire situation, you said no. So why do you expect that she would help haul your crap around because you don't want to rent a truck when you clearly showed you won't repay the favour when she needs help?", "He clarified in a comment she wasn't asking for the credit or any money but just for him to apply so she'd get the referral credit. At max that is a 5 pt hit on his score temporarily. It also makes his available credit to loan value better so is a positive for that.", "exactly!  \ny didnt you just let her live w/ u n ur fam???", "And when her other friend did help her that's probably when she realized that she would drop everything for you, but you wouldn't do the same. Now she doesn't want to do you any more favors than she already did.\n\nReading your other comments you honestly sound entitled and not interested in her as a friend.", "Refer a friend in the US usually doesn’t impact the referers credit. Did you actually take some time to call your credit card company to see if it hits your credit? Like you know spending 15 minutes on hold? Because you seem to want to inconvenience her for hours for favors so you spending 15-30 minutes on hold with your credit card company feels like it’s a reasonable request from your friend.", "Translation : she did me even bigger favors than what she's asking.\n\n>I simply came to this subreddit to find out if I was wrong in this situation. \n\nWe can't give you an accurate judgment without all of the context. In a vacuum and no prior interactions it's not exactly an AH move to do what you did, at most it is very tone deaf. But with all of the context you're an AH...", "So she donated a kidney? Was a surrogate for you? Lol \"waahh! U-Haul is expensive\" because paying for a hotel room for months until her house is fixed is so much cheaper. Let it go\n\nAlso unless you are going to be applying for a mortgage in the next six months, opening a new card is a few points ding then you are back up. It might actually help your application (the part where they judge your available credit and how much of it you have tied up)", "You are.", "Even tho the help she's given you in the past is entirely relevant to whether you're TA in this situation?? Brilliant", "I think it was that he opens a credit card and she gets points for referring him. In the US if he is in the loan process but not yet closed any pulls on your credit can delay closing so its possible hes not wrong.", "Certain credit cards are always offering me money to refer friends. The way it work is I agree to refer friends and a link is generated, I send that link to friends and family, *they* use that link to apply for the credit card and if they get approved/accept the terms, I get rewarded with points or cash or whatever. So it would affect his credit. He's still TA though. He is sounds like he's looking to buy a house eventually not literally in the process so a credit card wouldn't hinder that; in fact, it might actually help him in the long run. YTA OP.", "Rent a truck. It's YOUR problem not hers.  You seem to care nothing about her situation so I'm once again utterly incredulous as to why you think she would (should in your mind apparently) do this for you.", "Bro you actually seem like a horrible and selfish person. All the worst", "The thing is, all those times she helped you. All the people who help others. They also have things they’d be doing for themselves and their families. They took time out of their lives for you - that’s why you feel gratitude for her.\n\nNow she knows you wouldn’t do the same for her, and acted accordingly. \n\nThat is life. YTA for being that blind to how you affect people, take time off Facebook to gain some self awareness here. \n\nYou feel grateful > you do them the favor.\n\nIf you truly can’t is one thing, in this case you knowing she has insurance money coming in, refused to trust the friend who always had your back.\n\nIt’s not about the gas money, it’s the loyalty and effort you can’t buy…", "Offering gas money ..is sort of the bare minimum and shouldn't even be counted. If you also want her to drive then it's even worse .\n\nYTA she has apparently helped you out repeatedly and now she asks for a favour in return ( do you have any indication she would mess up your credit score ? ) And you turn her down. You can now definitely expect she isn't gonna give you a single favour anymore.\n\nYou find out who your true friends are in your time of need and she found out your not one of them.", "Even from how you worded your own post, and honestly the replies, you're continually more concerned with whatever is going on with you. You bought items you'd need a bigger vehicle for, that's on you, maybe you should have planned better than trying to take more from someone else who has already done so much for you.", "I’m not sure where you’re located, but when I am in this situation in the US, I will rent a truck from Lowe’s or Home Depot, or post something on TaskRabbit to hire someone to deliver appliances. Plus, you were totally the asshole in this situation.\n\nYTA", "and she's more concerned with her family now too", "\"I even offered gas money\". Like, that's the minimum requirement. Do not expect help from this person again, you've made it clear that this relationship only works one way.", "Then grow a bone and pay to someone. No, the whole world should do you favors because you and your family comes first. Ugh", "What this had to do with it", "Because when you have people who you admit \"drop everything\" to help you as friends and see that they are in a horrible possible (house flooded which xan completely ruin a house and stuff inside)  and they ask you for one favor that you say no to then you realize that as a friend you've failed so you stay under the radar instead of asking for more help. It reads like this \"Hey I know you're in a horrible position (again her house FLOODED) and I've been no help (except inviting her to a meal ONCE) but can you take a second out of your hotel living and worrying about ruined house to help me with my appliance moving? Pretty please\" That's how your request reads to most people and that's why they are all so rightfully pissed.", "What aren't you getting?  You've proven yourself to not be a friend to her after all the things that she has done for you by your own admission and now you are expecting her to \"drop everything to help\".  Let me tell you something hon, that gravy train is over!", "You're really not making it any harder to say YTA here. I'm much older and likely in a different country but tell her you figured you'd help her find an actual friend and submit my name for consideration. She deserves better than you.", "Yeah and look how that turned out for her. She's got someone like you for a friend. Someone who cannot even try to help during her time in need.", "The U-Haul fees sound like a you problem, not your friends problem. Your friend isn't going to help you much after this incident with her house. Realize that and move on. A lack of planning on your end does not constitute an emergency on your friends end. You bought the appliances, you can figure out how to move then with out your friend. And I'm curious if she even still considers you a friend. Yta.", "„In the past she usually dropped everything“\nFck you. Hope your credit Tanks and you don‘t get that house", "And then you kept showing that you were not at all worth or deserving of that type of help. If they have any sense, they won’t be dropping anything for you in the future.", "So the one time she really needed your help... you denied it, when, after reading comments from others, it wouldn't really affect you or your credit. Okay, if you didn't wanna do that, that's fine.\n\nBut now it's hurting, cause she's not helping you anymore and it seems slightly entitled with the \"In the past she'd usually drop everything to help\".\n\nShe might have, but then realized when she needed her \"friend\" the most, the friend wasn't willing to help and yet expected her to still help. Whatever your reasons are, I suggest trying to see it from this POV - you even admit yourself you always asked her for help and you expect her essentially to always drop it.\n\nThere are terms for this actually; this would make you a taker. You take take take, but don't give back. Friendships and relationships in general are a give and take. It should never be one sided, never give give give or take take take. It needs to be balanced. The balance is not met and I honestly won't be surprised if she might now put a full stop helping you overall, which I'd understand if she did that.\n\nEspecially as she had a massive traumatic situation happen to her - her house flooded. This is traumatising, she might have lost a ton of shit and needed to build things back up.\n\nYTA so much.", "So to be clear, people who have helped you in the past are somehow obligated to some expectation of helping you whenever you need it even though you have no desire to help them.", "Now it is an issue, coz you didn't step up for her. Getting a credit card was not an option, but you could've looked into other variants, like loaning her money or smth. But you just brushed her off and then asked her for help right after. You are a hypocrite))))", "And she's not messing her truck up for you.", "> but she had no issues helping me out in the past\n\n&#x200B;\n\nyeah because she thought you were friends. Now she realizes that you're just someone who takes advantage of her kindness,", "How exactly are you messing up your credit by just getting a credit card? Not American, so I don't know how this works over there, but it seems rather implausible.", "Didn't she essentially use your same words back at you?", "Awww your poor lil feelings hurt? FU! You’re such a big asshole!!", "She wasn't. She just said 'no'.", "Applying for a credit card affects your credit score in the US.  If it isn't a big deal, it seems like the friend could ask somebody else to do it.  In the US, there are opportunities to open a new credit card nearly every day.  OP was smart to be disciplined about it to meet his financial goals.", ">I honestly need help and getting a uhaul is expensive nowadays\n\nBoohoo. That's life, you asshole. YTA", "Wait, in another comment you said she used to drop everything and come help you. So now that she said no, she’s a bad friend?", "YTA. You know what else is expensive, your whole house flooding. Way more expensive than a damn uhaul.", "Why did you buy all this stuff with no means of transporting it? You made this problem and now you’re expecting your friend to fix it because you don’t have other choices. This is an issue you created. Their home freaking flooded and you somehow think your kitchen appliances are more deserving of assistance. You’re self involved, lack any self awareness, hypocritical and a bad friend. Fine if you can’t get the credit card, absolutely batshit to ask for help right now. YTA. You somehow think she has an obligation to fix your problem as she has done in the past when it sounds like you feel no obligation and bring nothing to the table.", "Not that I think you deserve help but home depot and menards and many large hardware stores rent pickup trucks for like $40 plus tax. Check to see their rates although uhaul would be much easier to load. Also advertise on craigslist that you need a guy with a truck. Offer $50 or so plus a dollar a mile from your place to the places to get stuff and back to your place.", "she isn't a good friend because she didn't drop everything and come help you like she has before? Since she didn't help you in ways you refuse to comment on because we'll \"antagonize you more'? \n\nBro get over yourself. She's obviously gone above and beyond to help you out in big ways and you couldn't be arsed to help her at all. And now you're complaining because she won't continue to help you? You're incredibly tone deaf and self absorbed", "And moving your appliances isn't her problem, it's YOURS yet you seem to think that she should help even though it's not her problem.", "And moving your appliances or buying gifts for a baby you can’t afford is clearly not her problem", "So she asked for a favor that would cost you nothing except for a few minutes of time? And you refused? And are now uncertain whether you're the AH? \n\nWell, let me help you out: YTA. And also an idiot, it seems.", "Read his other posts, this dimwit is so self-absorbed he even starts talking about U-Haul prices as justification.", "This should be at the top. People don't cease to exist when you don't have use of them; they continue on with their lives and problems unfolding and changing. Everytime you asked for their help? Involved a sacrifice on their part. They now know that you don't regard them in a similar place of priority in their lives. As I often say to myself- don't cross oceans for someone who wouldn't jump over a puddle for you. Seems like this person got your message - good for her.\nOP, YTA", "Thank you for spelling it out... shows how out of touch OP seems to be", "Its not an obligation or anything but Im just saying its not normal....\n\nedit: Havent you had that where someone helped you but a shitty situation comes up where you really cant help them? I feel bad but this is the reality of the situation.", "I really dont have money to loan people.", "One asks a \"friend\" to do these things.  And I live in the U.S. and burn thru a few new cards every single year with a very high credit score.  It isn't that big of a deal in my opinion when a friend asks for that as a favor under these circumstances.  Obviously, the OP is no true friend.  It's not like she's asking for a 5 figure plus loan or a kidney.", "Well things have changed.  YOU changed them.  Learn to live with the consequences.", "Well, now you can just rent a truck or get someone from craigslist. deal with it.", "She really doesn‘t have to give you her truck. The entitlement is strong with this one", "And she doesn't have a truck to loan people. What if moving your stuff somehow messes her truck, or you're in an accident while moving the stuff.", "You admit she didn’t ask for money", "Nerdwallet says \"Don’t Get a New Credit Card When You’re Applying for a Mortgage - A new card can affect your credit score, which plays a big role in getting a loan and the interest rate you'll pay.\". OP may be getting financial advice from people who know what they are talking about.\n\nIf it did affect OPs credit score, he could end up paying thousands of dollars more for his mortgage.  It would be a big favor to give his friend some reward points.", "I'm a CPA and MBA, I think I'm pretty adept at financial matters.  And the OP is very vague about looking buy a home.  And with interest rates where they are compared to just last year, I'm guess it's just fantasy wanting on her part.", "Is Nerdwallet's advice wrong then?", "Im not a girl, dude..", "I couldn't care less, dude!", "Why are you being so rude? Ive done nothing to you.", "I'm utterly disgusted by your original post.  You seem like an awful person quite frankly.  NOTHING bothers me more than hypocrisy.  And for you to behave the way you did against someone who has done so much for you is repugnant as far as I'm concerned.  \n\nI would think it a little cold on your part, but understandable, if the scales of your pasts were more even.  But you just seem to want her to give and you to take and never have to give.  Selfish beyond all recognition.", "Lmaooo YTA. Her house FLOODED and you couldn’t lift a finger. Hope you carried all those appliances home", "YTA", "YTA. You’re a user, that shines through clear.", "YTA, thank god I don't have friends like this", "YTA.", "omg i just read your comments and the entitlement 💀💀💀💀 YTA", "YTA and you better make it up to her quickly before she realizes how uneven this relationship is and decides to leave you.\n\nAbsolutely fair to not want to mess up your credit, but there has to be more you could have done to help her. You're trying to buy a house, you don't have some hundreds to spare? A living room couch she could have crashed on?\n\nAlways taking and asking but never giving. Imma be honest with you she's probably already getting ready to cut ties", "YTA - No you weren’t out of line for asking, she also wasn’t out of line for saying no.  You are TA for admitting she helps you constantly and getting upset she said no to helping you this once.  But… Unless you are actively in the home buying process (like offer is accepted), you are still very much looking, you don’t have a closing date, and could have helped if you wanted to. \n\nYou are TA because your post drips with entitlement. Her house is flooded and unlivable, you offered her one single meal.  If I had a friend who bent over backwards to help me, you better bet - at the minimum - I’m going to offer them an entire day where they can come in every week to do the wash and provide dinner and whatever else I can think of to make up for saying no to the refer a friend link because that’s what real friends do.", "YTA, as someone that owns a truck people are always asking to use, I hate it. I have set the precedent that if I don't offer, don't ask because the answer is no. Rent a truck from Home Depot, its like $20 a day.", "You gave her the the kindness you thought you could afford, and then she did the same to you. If you can't deal with that, then that's your problem.", "Lol as someone who owns a bunch of trucks and vans if people ask me to use them I still refer them to u-haul. \n\nIt’s not worth the headache that can be caused because you want to be a cheap ass.", "Yta and I hope she finds better friends.", "YTA and a hypocrite \n\nYou are allowed to say no but she isn’t? If you’re not willing to help others, stop accepting their help to you!", "N ta for refusing to sign up for the credit card (most referrals I've been sent requires you to complete a purchase or be approved for the application) -- but yta for asking soon after while she's still in the throws of things to get help yourself and be surprised she refused.", "[removed]", "Info/clarification: she wanted you to open a new credit card account to get her some free nights on her own hotel chain credit card?", "nta.  If I am getting this correctly.  She wanted you to open a credit card so she could claim the refer points?", "TIL most Redditors have very limited knowledge on how credit works", "YTA \nYou could have helped her in this situation but chose not to.\nShe could have helped you but chose not to. \nYTA because you don't seem to understand why she refused to help you and is a bit salty.\nAs you said :she helped you a lot in the past for things you have no real intention of trying to repay her. Now she knows she can't ask you for help when she is in a bind.", "YTA. Not even going into details of what she asked for was not a big deal, but - not being able to ask for future favours is a package deal when saying no to someone. And when anyone asks me about something I dont really want to do, I always weigh that - am I willing to ruin or strain this relationship? Sometimes it’s yes, sometimes it’s no, but this is a decision.", "YTA for asking a friend to use their truck when their house just flooded. Even without her asking you for help.", "YTA literally take take take HER HOUSE FLOODED are you serious", "You sound like a mooch and a fair weather friend here. YTA and you have no right to feel righteously slighted here. Relationships are two sided, and you just take from her.", "YTA\n\nI do believe you had legitimate reasons not to open the credit card. However, I do think you could have done more for your friend than just invite her for a meal. You’ve said that she’s helped you a lot in the past. When she asked for help, you helped her in a very small way. For that, you are TA.", "YTA. It won’t mess up your credit. You couldn’t do this one little thing, but you expect her to drop everything multiple times to help you? Wow", "YTA man I can’t say what I want to but you really do have some balls of steel to ask her for help after pretty much telling her to fuck off. You’re a leech my darling. You take what you can take and you don’t give anything back. She is your friend but you are not hers.", "YTA, your friends house FLOODED and you couldn't help her out with that one little thing that I doubt would have effect your credit score, then had the brass balls to ask for her help? Get your head out your arse.", "YTA, mainly b/c you think both things are connected via her being angry at you. She's have a terrible time, so not being able or willing to drop everything to help a friend is to be expected. She's living in a hotel (which long term is rough) she's probably not sleeping well,  she probably currently has lost most of her stuff (water damage), and yeah she has bills. Probably a lot of bills on top of the usual ones. It would make anyone exhausted, stressed, and generally annoyed.", "YTA, and to be clear, it could have been a N A H because any credit changes when buying a house could tank the whole thing. But YTA because you said no with no other attempt to help out, even though you could have done something for sure and she helps you all the time, and for the entitlement in the comments.", "You can always ask and are not TA for asking nicely. But this other person ist not obligated to help you so also not TA. Especially if you refused to help them in time of emergency.\n\nYTA for expecting to be granted a favor when you do not grant any yourself. Doing favors simply goes both ways.\n\nInstead of the credit, which may bei understandable you might have helped otherwise.", "YTA\n\nYou could have found other ways to help, even if you declined to open a credit card.\n\nYou always lean on her, but you figure one dinner and you're square?", "Yta\n\nOf course you are. All you've done is take. And would it have been the big of a deal to recommend. Is she known to be bad with money, probably not if you think she's good enoufh to ask for help.", "YTA OP is clearly an ungrateful and bad friend.", "YTA at the very least you should have abstained from asking for favors after you couldn't even offer to pay for one night at the hotel, a short term loan or any other number of things more meaningful to help alleviate her situation.", "Do you really need to ask if YTA? This is your friend who has done a lot to help you in the past. I'm not sure how referring a friend puts your credit at any risk but honestly, she is in a tricky situation and you refused to help her. Then in almost the same breath you want her help and are audacious enough to ask and feel surprised by her response. You aren't much of a friend.", "YTA,  you're not a friend, you're a user. She has helped you out more than you can repay, yet the one time she really needs help you can't be bothered. Just leave her alone and stop using her.", "Wow...", "NTA for not wanting to mess up your credit.  But you shouldn't be surprised that she no longer considers you a close friend.\n\nYou basically told her that your credit rating is more important than she is.  That is an OK decision. But it means that she will look at your friendship very differently going forward.", "It will but in general not negatively.\n\nIt's a , if your friends use this link to open a credit card we will give you ,$100 ,5000 travel point , whatever.  Often there is a deal for the new person too, extra points/ cash back.  \n\nThe effect is having a credit pull , which lowers your score by 1 point for 1 year. Having a new credit card, having 1 more credit card. Unless you are buying a house within 90 days/in the process of buying a house. The effect is negligible for 99% of people ( and the people it would effect would have issues qualify for a home loan anyway).  Even if you are actively buying a house the effect for a qualified buyer would normally be \"write a letter that you don't have another purchase that you plan to use this card for\" .  I got the card for a friend to get a referral/this card has better cash back than the card I have now are perfectly acceptable reasons. \n\n Boat/car/RV/other properties applications can screw up a home loan in process.  Loan officers make a big deal about not applying for more credit because people are morons and  if we told them\"you can get a new card because there's 10,000 bonus miles\" they would apply for 20 cards.", "Right? Like, the refer a friend nonsense sounds... not super great, but it sounds like this whole thing just showed her how one sided their friendship really is. Like this was the last tally mark on \"yeah he's only in this for him\".", "It's not that OP didn't get the credit card it's that it sounds like he? Invited her for dinner and called that done for someone who has been doing favors for years and then had the balls to ask her to lend him her truck so he could get a cheap fridge/washer/dryer.", "THIS. + knowing she was struggling how could you you even burden her with helping you?", "Are you a homeowner? You can’t open a credit card when you’re in the closing process or you’ll lose the house. Op is NTA.", "I think the credit card referral required the OP to apply for a new credit card.  If it was approved, his friend would get points.  If he’s trying to buy a house, I can totally understand why he wouldn’t do that.", "It would, if she is asking him to open a credit card, so she could then claim the points.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Tough pill to swallow when you realise you yourself is the problem huh", "Wow what? That everyone is telling you the truth?", "The harm is the social harm it caused. It shows how thoughtless you are and kind of take her for granted. \n\nYou denied her a favour, then asked her for one - most people aren't going to be very amenable to help in that situation. If they were pissed before, they're gonna be even more pissed afterwards.", "You’ve exposed yourself as a leech and a useless friend with no shame. That’s the harm. I wouldn’t expect help ever again", "The entitlement and shamelessness is the harm. YTA", "Because you can even rent a truck from Home Depot for $19/hr. If you’re just picking up and dropping off appliances, then at most you’re out, what? $40 if you’re slow?", "The harm in asking is your audacity. You act like she would EVER help you again after what you did, which was jack shit. Don't expect her to answer your calls much anymore", "You can absolutely ask, but coming here to see if you were TA means you don’t see what’s wrong in your long history of actions and you are upset she said no and to see if their response was warranted.  Your friend has helped you repeatedly - so much so and to such a degree that you refuse to go into details so we know it’s A LOT - and she gets ‘one meal’ after her house flooded AND she’s living out of a hotel and will be for who knows how long.  A good friend and decent human would have offered them their home, use of their washer/dryer weekly, home cooked meals weekly, and a variety of other things that don’t involve credit cards. It’s not that you said no, it’s that you don’t see her as an actual friend just someone to bail you out whenever you need help:", "For the UK it wouldn't make much of a difference if she is applying for a card - when you're applying for a mortgage they're more interested in how much you earn, how much you have in the bank and what debt you're carrying. They will likely look at a credit report but unless there's something on there you didn't mention or your credit is shit, it's unlikely to change much. The change from a hard pull is minimal at best.\n\nUS is much more credit report focused, which is why they're extremely keen to do the credit report things. Which differ from ours, as there are things counted here that aren't over there.", "“I guess her home now needs extensive repair” ummm dude what do you think would happen when she had to move out due to flooding?  It means the home is uninhabitable in its current state!  Most home owners don’t choose to move out when that happens it’s because legally they can’t stay in the home - it’s NOT safe!  Electricity was likely turned off - water and electricity don’t mix. That’s also not just extensive repairs but basically gutting those rooms and maybe even the rooms next to it.  It means replacing all or the majority of the belongings in those rooms.  That’s not even going into the mold that might occur which is also another tough remediation that can have insane health consequences if not done right.  It’s not a grab a bunch of towels and soak up the water situation. \n\nSeriously if you couldn’t think through what it means to have your home flooded to the point you are forced into a hotel - you should rethink the decision to buy.", "Leeching gone wild", "Yeah, YTA. And a terrible friend. Entitled, narcissistic user. Hope she cuts you out of her life completely.", "And she's currently homeless and unable to pay her bills.\n\nGo rent a U-Haul like a goddamned adult and stop expecting your friend, who has helped you repeatedly and whom you could barely offer ONE meal to in response, to drop everything for you.", "And that means what?", "Home Depot rents them for like $20/hour.", "Uhauls are like $20-$40 for the day. I’ve had to strap on my big girl panties and do it myself before you can too", "the issue is that for a lot of these \"refer a friend \" programs, said friend had to go through and complete the process, not just click their link.\n\nSo likely OP would actually need to apply and get approved for it which would impact their credit", "Everytime you request a new card your credit gets pulled and the amount of times your credit is pulled by a lender is tracked by the agencies.  Frequent credit requests can indicate a high risk borrower and decrease their score.\nIf OP is being cautious about their score because they want to buy a home, saying no to the friend is not an AH move.  \nAsking to borrow the truck shows lack of awareness of the situation and gets YTA. \n\nThat said, i am first to say that the request the friend made is a bit out of the ordinary, i personally would not ask a friend or family a favor involving their credit... to me, that is more than a favor.  She gets a YTA as well for asking this.  There are many other ways to round up a couple bucks other than asking a friend to involve their credit score.\n\nEdit sp", "Opening a credit card when you’re trying to buy a house is a very bad idea.", "I'm not a 100% positive but I think when she refers him for this credit card he has to be approved in order for her to get points for it. So it would definitely impact his credit and it would be one more line of open credit when being looked at for a mortgage.\n\nETA NTA", "I came here to say the same thing. \n\nOP, YTA and also dumb. And a user too. Hopefully your friend is over your bs.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "And here, this comment is just more proof of you being a user when it comes to friend's at least. \n\n1. She's helped you before many times\n2. The help has been so great that you have no way of repaying it\n3. The one or one of few times she asked for help In a dire situation, you said no because of reasons involving your bm and child and trying to get a home \n4. You then proceed to ask her for help with something for your family\n5. You try almost making it seem like maybe she's the asshole for refusing to help you\n\nYou obviously care about your family, which is great and should be the priority. But in the same way that you can't repay her, help her or anything of the sort. You should be using those same reasons to get your own truck rental and doing things yourself. Friend's aren't there only when you need something. Then they aren't your friends, they're just someone to ask favors from to you.", "I had to get rid of a futon and frame for a new couch. Know what I did? Hired someone. It's not that expensive.", "\"I'm more concerned about my family, who has a roof over their head. This chick who is currently homeless is the only person I know with a truck. Why won't she stop everything she's got going on in her life to help me move my Facebook Marketplace find? She's being so selfish.\"\n\n- You, apparently.", "U-Haul has truck rentals", "She's \"stressed\" it's more than fucking stressed her home flooded and she lost a lot if not everything. Hurricane ida did more than stress me out it has still ruined me today for example. It destroyed almost everything I owned from my whole 32 years on earth. You are an ass. That truck she has may be her one last earthly possession she cares about. It's not for your convenience. Get a damn heart. You'll probably be losing what seems like a wonderful friend. Help her set up a go fund me. I bet strangers would help more than your one damn meal. The entitlement is unreal that after so many posts that was your response", "You such an unaware, selfish person. Its sad, really.", "This is not about the credit card program. \n\nThis is about you knowing that she’s already in a tough spot and still calling on her for help regardless.", "How tf are you this oblivious?", "You can't afford a uhaul, but you somehow think you can afford a house? And opening a credit card doesn't automatically ruin your credit if your a financially responsible person. Which is almost starting to seem like you're not. I assume you must have good credit and know how to handle finances if you're applying for a house? Because if you can't afford to lend money, surely you can't afford to buy a house right out. \n\nTop it off with the expectation that because she'd drop everything before to help you she should be doing so now as well? \n\nYou're not just an asshole, you're far more than that. Entitled, audacious, selfish etc. You clearly don't deserve a friend like her and honestly I hope she sees this thread some day so she gets confirmation about not having to feel bad for not helping you. You admit she has a family but refuse to help because you have your own. She should totally help you when it comes to it though right. \n\nThis is one of those posts that is so bad that it just triggers everyone with a good sense of morality.", "And she really just needed help because she's homeless and can't pay bills after a flood.\n\nI can't believe you're shocked that the HOMELESS WOMAN who is STRUGGLING TO SURVIVE AFTER A FLOOD won't \"drop everything to help\" someone who has given her exactly one meal during this difficult time in her life.", "INFO: You realize that in the past (when she was financially stable and a had a roof over her head) she would drop everything to help you because she thought you were an actual friend.\n\nYou’re clearly not, your family comes first but hey! Even though your friend is super struggling right now, what’s one more favor right? You come first right? \n\nYou don’t have a truck and despite her circumstances (imagine you and your family in her spot) she’s always been there right? \n\nSo omg, why did she stop? Why is she no longer helping the person who clearly makes no effort to support her? God, it’s a mystery.", ">Im not messing up my credit for her\n\nShe's not messing up her truck for you. What don't you understand?\n\nIt sounds like you don't care about her as a person.  You're just pissed of that you can't take advantage of her kindness anymore.  I suggest you get used to it.", "Well if you don’t want to “mess up your credit” then she doesn’t have to waste her time helping you. Its a problem now because she realized how one sided your friendship is. You’re not her friend at all, you’re just TA.", "You also didn’t have to whine about it on Reddit, but well 🤷🏽‍♂️", "She wasn’t, you dumb loser\n\nNow I’m being rude that’s what it looks like", "Explain how she was rude please?", "She wasn't rude about it she just said to you exactly what you said to her but about her car... if you're calling her rude then you were to begin with so stop winging", "She isn't your friend anymore cause she realized that you're a leech", "SHE honestly needed help! What the actual fuck is wrong with you that you think she's selfish for not offsetting your U-Haul fees by loaning you a truck, WHEN SHE'S HOMELESS AND WORRYING ABOUT SALVAGING HER ENTIRE FUCKING LIFE?", "Holy shit. That is how friendships work tho…it’s your friend’s problem so you try to help.", "And you “kinda” feel bad???", "And your Facebook Marketplace appliance is *really not her problem.*", "Except everything I'm seeing on google says that most people recommend not opening any new credit cards or applying for other loans when you're trying to buy a house. Which OP is trying to do. And if you opened one recently it's best to wait 3-6 months befire applying for a mortgage. And I'd imagine. So I don't actually fault him for not doing so. \n\nHowever dude bro could have gotten a uhaul. I imagine she's most likely still struggling after losing her home, now is really not the best time to be asking a friend for help when they've most likely already have so much shit on their plates.", "Oop comments clarify that his friend was asking him to apply for a credit card as one of her referred friends. Her other friend applied for the card instead so applying is what was happening here. \n\nAlso many money experts will tell you not to apply for credit shortly before applying for a mortgage, they also tell you not to change banks shortly before applying either. There are many things that are taken into consideration other than just whether you can afford the mortgage and what debt you have currently. Available credit is potential future debt and must also be considered when calculating whether a person(s) can afford the mortgage. Changes in your financial behaviour is an indicator of possible financial instability and banks particularly are more careful following the collapse of the bank's and the huge financial crisis a few years back. Banks are obligated to be particularly stringent nowadays. \n\nEven if the impact is minimal no one is obligated to get a credit card in their name to help someone else.", "So referral links are generated to give points to existing customers for referring new people who get approved. So for this scenario to make sense the friend is the current customer and OP isn’t - which means opening a line will impact their credit.  \n\nHard pulls while ACTIVELY (offer accepted) in the process does impact your credit score and usually changes your closing date.   Depending on what your score is and how much the line was for, your lender can back out on the deal since your approval was based on scores and numbers that no longer exist.  \n\nHard pulls before offer acceptance can impact the rate you get.  The higher the credit, the less risky you are to the lender. So any pulls or new lines need to be reported to your lender so they can re-run via a soft pull and adjust their position.  \n\nA new CC represents the potential for a higher debt to income ratio and decreases your average age of credit.  How much of an impact depends on a variety of factors - overall debt to income ratio, repayment history, current credit score, and even work history.  A hard pull can drop your score anywhere from 10-25 points.  If OPs credit was on the low end of good, a hard pull and a new line of credit could easily drop them down to the fair range.  Usually mortgage lenders will tell anyone in the home buying process to avoid any and all new lines unless their credit is well into the excellent range (meaning they can take the hit and still have an excellent score), a low debt to income ratio (demonstrating they don’t rack up debt), and have high enough income to demonstrate the ability to repay should it be maxed out at any point. \n\nDespite all that OP - YTA because they never actually viewed this person as a friend - just someone in their life to constantly help or fix their issues. Even without the card, there are lots of other ways OP could help.  Offering up a guest room, (if no room) come over weekly for laundry and dinner, offering to help them sort through the home to save stuff worth saving, etc.", "Happy cake day!", "Opening an arbitrary credit card without really examining the terms is unwise.\n\nHe's NTA for refusing to sign up for a credit card he doesn't want.\n\nBut he is TA for not helping his friend as much as possible in unrelated ways: sending whatever cash he could, for example, and asking how else he could help.", "This is what I can’t understand? I can’t see anyway how this would mess his credit up.", "For what it’s worth, credit is really paradoxical. A hard pull on your credit, like applying for a credit card, will take you down a few points for a few months. But also paying off your student loans will take you down more than a few points because you just lost a long term credit line with positive history. So if you are LITERALLY about to buy a house, don’t change ANYTHING. If you just have an idea for the not to distant future, it shouldn’t matter much AS LONG AS you either don’t use it or pay it off every month (and it has no annual fee, of course). \n\nThat being said, I’m not opening a CC for anyone. BUT if my friend who helped me numerous times was *that* hard up for $200, I’d  try to find SOME WAY to help her. Especially before I went asking for more free help.", "Thank you!", "Right? Sounds like OP's friend finally heard the saying \"don't set yourself on fire to keep someone else warm\".", "How is it not normal? She's in a bad place in her life and receiving zero help. She doesn't have the goddamned bandwidth to help you move an appliance when she's worried about her entire fucking living situation.\n\nBut because she \"always helps you\" it's not right that she isn't helping now?\n\nGet the fuck over yourself, dude. Yes. YTA.", "Listen to me very carefully. All the rest aside, if you do not have spare money for emergency purposes such as this one you cannot afford to buy a house. Your expenses will remain more or less the same as anything you save now will likely go to house maintenance and you also have a kid who is only going to get more expensive in the coming years.\n\nYou have not thought this through at all.", "You're just such an entitled asshole, I think it's triggering people."]}