{"id": 6899, "submission_id": "107gh9q", "title": "AITA Best of 2022 - Funniest comment", "selftext": "[Laughing my asshole off](https://media.giphy.com/media/PgDUlt3Qu8BwUQqsCz/giphy.gif)\n\nIn an average month, we get a couple million comments. It stands to reason that at least one or two should be worth a giggle.\n\nToday we want to know what stuck in your head the whole year through and kept you chuckling. What tickled your funny bone and sent you [rolling on the floor, wheezing with laughter?](https://media.giphy.com/media/9EwnzGNjvmIG4/giphy.gif) We like a good laugh as much as the next asshole, so submit your nominations below. \n\n___\n\nTo nominate a comment, make a top-level comment with the link to the comment you're nominating. To vote on your favorite, upvote the top-level comment that contains the link. Contest mode will stay on for the entire 2 weeks to keep things as fair as possible, so make sure that you pay attention and read through the threads so you’re not making a duplicate nomination.\n\nAt the end of 2 weeks the thread will be locked and contest mode will be turned off.\n\n___\n\n###Keep things civil. Rules still apply.", "created_utc": 1673276417, "permalink": "/r/AmItheAsshole/comments/107gh9q/aita_best_of_2022_funniest_comment/", "score": 65, "replies": ["[AITA best of 2022 mASSter post](https://www.reddit.com/r/AmItheAsshole/comments/1041a4g/aita_best_of_2022_masster_post)\n\n- [AITA Best of 2022 - Best Post Involving Food!](https://www.reddit.com/r/AmItheAsshole/comments/1041d6p/aita_best_of_2022_best_post_involving_food/)\n\n- [AITA Best of 2022 - Most Persuasive Comment](https://www.reddit.com/r/AmItheAsshole/comments/104umlm/aita_best_of_2022_most_persuasive_comment)\n\n- [AITA Best of 2022 - Most sympathetic asshole](https://www.reddit.com/r/AmItheAsshole/comments/105yaia/aita_best_of_2022_most_sympathetic_asshole/)\n\n- [AITA Best of 2022 - Most Empathetic YTA comment](https://www.reddit.com/r/AmItheAsshole/comments/106n7on/aita_best_of_2022_most_empathetic_yta_comment/)", "[Your father needs to stop setting up playdates for his girlfriend](https://www.reddit.com/r/AmItheAsshole/comments/scdi7k/comment/hu5f12h/?utm_source=share&utm_medium=web2x&context=3)", "“the grinch who stole boozmas” has to be my all time favorite", "I nominate the Beauty in the Beast themed comment from xxxdggxxx on “AITA for telling my husband he is expecting too much from our son over the amount of eggs he eats?”\n\nLink: https://www.reddit.com/r/AmItheAsshole/comments/sip5km/aita_for_telling_my_husband_he_is_expecting_too/\n\n*No one negs like Gaston*\n\n*Oh does reps like Gaston*\n\n*Forces his son to eat four dozen eggs like Gaston*", "OP doesn't want her ex to name his new baby daughter after one of the sisters in Frozen as it will match up to OP and her Ex's daughter's name. \n\n[Let it go](https://www.reddit.com/r/AmItheAsshole/comments/zlvbir/aita_for_not_wanting_my_ex_husbands_new_daughter/j07csid/)", "> To nominate a post, make a top-level comment with the link to the post.\n\nShouldn't that be \"comment\" instead of \"post\"?", "I think \"Laughing my asshole off\" is pretty funny.", "I died at this comment, I still think about it to this day.", "Yep, thanks I fixed it", "It’s so rare for something to actually make me laugh out loud enough to almost vomit but it gets a nod because of that [Bullshitiest bullshit](https://www.reddit.com/r/AmItheAsshole/comments/tuv8m8/comment/i35sipu/?utm_source=share&utm_medium=web2x&context=3)", "Help! Trying to see anyone remembers this one chain of comments that cracked me up. Someone said a word, let’s say sun. Then someone else wrote: “you must be thinking of son, sun is a planet”. and the next person went on and so on. I know i’m doing it wrong.", "The mythical [Penis of Persuasion](https://www.reddit.com/r/AmItheAsshole/comments/s2ddbx/aita_if_i_dont_want_to_pay_back_my_husband_for_a/hsevghe/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)", "[The three first comments are hilarious, building off of each other.](https://www.reddit.com/r/AmItheAsshole/comments/z77qxc/aita_for_using_flash_cards_to_explain_to_my/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nRainbow baby, Flash cards, this post and the replies are Hilaria Baldwin", "Marinara Flag always gets me!\n\nThe Post (as a comment, preserved by the bot):\nhttps://old.reddit.com/r/AmItheAsshole/comments/uyaxzs/aita_for_correcting_someone_at_dinner/ia2vyqo/\n\nThe Comment:\nhttps://old.reddit.com/r/AmItheAsshole/comments/uyaxzs/aita_for_correcting_someone_at_dinner/ia31g3q/", "I  still love all the Info: what the fuck comments", "I think you need to make separate comments. How will the mods know if someone upvotes this comment which link they're supporting?", "The dawning link goes to the wrong comment", "55M with a 25F girlfriend in the same school and year group as his daughter, Sickening makes me want to puke.", "I second this! Can't upvote one without upvoting any others u/PengwinCake", "OP doesn't want to name his daughter after a zodiac sign/his MIL.\n \n[This is the dawning of the age of...](https://old.reddit.com/r/AmItheAsshole/comments/ufjevs/aita_for_refusing_to_name_our_daughter_after_my/i6twfhw/)", "Can least funniest be marinara flags", "OP buys a 2 seater car cause they're cool. BF doesn't like this cause now he can't drive his kids about in OP's car.\n\n [Alexa, play no scrubs.](https://www.reddit.com/r/AmItheAsshole/comments/s8rvpj/aita_for_buying_two_of_the_same_small_car_instead/hti6sp9/)", "OP's stepsister goes on a rant after OP politely refuses chocolate cake as she has an allergy to it. \n\n[Well this just takes the cake](https://www.reddit.com/r/AmItheAsshole/comments/ufilu4/aita_for_not_accepting_cake/i6trg1c/)", "Another Frozen-based reply for OP not 'giving in' to a Disney adult.\n\n[Let it go, again](https://www.reddit.com/r/AmItheAsshole/comments/smyizw/aita_for_refusing_to_give_in_to_a_disney_adult/hvzg03p/)", "I nominate [this comment](https://www.reddit.com/r/AmItheAsshole/comments/s2zj3z/comment/hshi1nx/) (from a deleted user, unfortunately) from one of my favorite threads of the year: Nonsense baby talk (originally posted by u/AITAThrow_sisteract)!", "OP's brother compares his naturopathic medical school education to her other brother's medical school education.\n\n [What kind of oil treats feelings of inadequacy?](https://www.reddit.com/r/AmItheAsshole/comments/uleuhc/aita_for_saying_my_brothers_education_and_jobs/i7v3jkp/)", " I know i’m doing it wrong.", "[Comment link](https://www.reddit.com/r/AmItheAsshole/comments/zalhix/comment/iym81ca/)", "That's a common thread here and online in general:\n\nPerson 1: \"Oh I love baby Yoda\"\n\nPerson 2: \"Who's baby yoda?\"\n\nPerson 3: \"Baby Yoda is is a bear that likes picnics\"\n\n4: \"No, that's Yogi Bear. Baby Yoda is a form of exercise that takes place in a hot room\"\n\n5: \"No, you're thinking of Bikram Yoga. Baby Yoda is a toy on a string that goes up and down\"\n\nAnd so on. It's not exclusive to this sub. \n[here's an example on Tumblr](https://images.app.goo.gl/4kMK5h98YssirnMY9)", "I feel like it’s got tired but the original comment with 70k likes surely deserves to win. \n\nThe comment that launched a thousand marinara flags.", "Hahaha 🤣 this is gold", "Yes! That’s the thing I saw! But damn I can’t remember which thread. Oh well. Thank you anyway!!!", "Makes me envious (as a 60 year old man).", "Should be fixed!", "Ah right so!", "I mean, all the awards go to Jorts, right?", "Not intended to be funny, but this comment and the OP reaction was hilarious.\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/zuh0c0/comment/j1joyfd/\n\nYes, he made up a great aunt to call his children after batman's sidekick.", "I can't believe they buttered him.", "~~Unfortunately the Marinara Flag is not from 2022 and is therefore not eligible.~~\n\nWell that just plain wasn't true, my bad. Comment restored.", "🤣", "Eh, low hanging fruit comment there. It was the obvious joke", "[There once was a person named Xaiquiri\n](https://www.reddit.com/r/AmItheAsshole/comments/xnp28y/aita_for_essentially_telling_my_husband_that_the/ipujfi1/)", "[\"I pulled the pin on a live grenade and threw it into the middle of a family gathering. AITA?\"\n](https://www.reddit.com/r/AmItheAsshole/comments/vnn7si/aita_for_inviting_my_husbands_potential_daughter/ie7zsk5/)", "I can't remember what thread it was on but the phrase \"ouroboros of bullshit\" was particularly delightful.", "[INFO: what were the other 2 cheeses?](https://www.reddit.com/r/AmItheAsshole/comments/z2ep2g/comment/ixgh9qz/?utm_source=share&utm_medium=web2x&context=3)", "Yeah. That whole chain is a winner to me.", "That is amazing!", "LOL’d hard. Thanks for linking!", "We call lower digestive troubles “Night Fever” in our house. It’s my brother’s fault.", "Wow this is hilarious. I hadn’t seen that comment yet lol", "But it is from 2022.  I get the deleted post means the post itself is ineligible for things, but does that also disqualify comments on deleted posts?", "Still one of my favorites especially when I see someone say it in another sub.", "I think you need to link the specific comment, not the post", "Was it this?\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/sauo33/aita_for_banning_mils_husband_from_my_housefamily/htxt3l9/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3", "This has my vote! I was thoroughly amused by how much the commenters focused on the cheese 😂", "I had a quick search but couldn’t find it. The comment read simply:\n\n“INFO: what is wrong with you?”", "That comment had me rolling", "It's the first reply on the first reply", "It is,  after all,  how I actually returned to reddit", "Oh yesss! That was it. Thank you!  \n\nAfter I posted that I got to second guessing myself on the \"bullshit\" part. My memory is shot. 😂", "In fact, it's so common, [it has a TV Tropes page](https://tvtropes.org/pmwiki/pmwiki.php/Main/ChainOfCorrections).", "You're right, it is. I confused it with Iranian Yogurt and didn't check. Thanks for reminding me.", "That's...gross.", "Nothing gross about it.", "I know, I know- the post is deleted- but this is the original Marinara Flag comment and I think it deserves our recognition. \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/uyaxzs/aita\\_for\\_correcting\\_someone\\_at\\_dinner/ia31g3q/?context=3", "I'm glad someone else absolutely hates this phrase.", "That, followed by its downthread companion, the artful \"Gentle YTA because you honestly seem so clueless that I don't think you meant to offend anyone, but clueless people shouldn't plan weddings.\" The combo had me in tears laughing.", "That was probably it thanks to my memory. Still makes me laugh", "Not for me, [this](https://freeimage.host/i/H7W3fBn) is the first reply to the first comment when I look. The mods said the link the comment in a top level comment so they don't need to scroll thru posts to find the specific comment.\n\nHere's the link to the comment in question- https://www.reddit.com/r/AmItheAsshole/comments/sip5km/aita_for_telling_my_husband_he_is_expecting_too/hva4hci?context=3", "No, that's a Thread of Corrections. The poster is talking about being afraid of too many wires attached to one outlet."]}