{"id": 69, "submission_id": "yiye9e", "title": "AITA for considering ending immigration sponsorship for family?", "selftext": "Let's get straight to it. I was raised by my mother (U.S. citizen) who passed away in my early 20's from cancer. My father is an immigrant, who was deported from the United States after my parents divorced when I was about 7 yrs old.\n\nWhen I was about 25 yrs old after years of saving and sending money abroad, paying legal fees I finally got my father to the United States. I did this while being a single parent. I did feel a moral and somewhat cultural obligation to help my father, and most importantly prior to my mother's death she stressed that he is the only living parent I had and encouraged my emigrating him to the U.S. again to work on our relationship. \n\nMy father has limited education but does hold several trade certs including carpentry, trucking, & welding -he gained these certs in the U.S. He arrived in the U.S. when he was in his early 50's after being outside the U.S. for over 25 years, for context he has about an 85-90% grasp of English as opposed to a person born & raised stateside. Upon arrival to the U.S. we immediately agreed to start the process for my underage siblings & his spouse abroad. \n\nLet's get to the nitty gritty. It's been 7 years, & he can't hold a job longer than a yr but typically not averaging over 5 months. He goes through months of unemployment. When he does work he squanders his money, I can count less than 10 times he's paid towards rent, groceries or utilities while staying with me let alone contributed to the legal fees for HIS families immigration. He is a gross person in terms of his world views, insufferable. I won't pretend like there haven't been \"good\" times but the  bad greatly overshadows. To date I've spent well over 20k in this process, he's ungrateful and belligerent, selfish. I'm tired. \n\nI've depleted my 401k from over 40k down to about 15k since his living with me. Examples of his behavior include begging and coercing me into cosigning on a loan then refusing to pay, living in my house driving my car but calling me lazy or dramatic when I bring up the fact that I'm stressed. \n\nThough not necessarily my business, he doesn't hide the fact that he's cheating on his spouse who is abroad with their children (my siblings) either. \n\nI'm so frustrated w/ him, our communication is down to a trickle. I need to know AITA For considering withdrawing my immigration sponsorship for his spouse & my siblings abroad? At face value my siblings are children & have been nothing but kind. They can't be held responsible for what my father's done, nor could they TRULY understand at the ages they are. That said, I've made several complaints to his wife who almost always finds a way to defend his behavior which makes me wonder- are they in on this together? Also, as a man he cannot demonstrate or has not- that he's stable enough to support HIMSELF, AND his wife & kids when they arrive to the U.S. I have children of my own and DON'T want that responsibility.", "created_utc": 1667275886, "permalink": "/r/AmItheAsshole/comments/yiye9e/aita_for_considering_ending_immigration/", "score": 28, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole in this situation because I've almost ceased contact with my siblings over frustration with my father, due to my frustration and partial presumption that they are gullible and would take his side. \n\nI've explained this entire situation to my father's family who had basically told me to grin and bear it and has positioned me as vindictive or spiteful if I pull out of this financially. I also personally feel like I'd be an asshole because then all this time and money that I've spent would be completely wasted if I do this, and there isn't any realistic reversal of my decision if I move forward.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If he’s not able to work and provide for himself, he won’t be able to provide for the family and that burden as their sponsor would likely fall on you.\n\nId give him a timeline for saving up money+ changing the attitude or withdraw sponsorship.\n\nComing from someone who has withdrawn sponsorship.", "NTA. What is exactly your father entitled to? Just because your mom made you promise you would bring him to the US and work on your relationship, doesn't mean you have to solve his life. You did your part, however, he doesn't seem to be very willing to do nothing on his side. Let's face it: there is no relationship to work on there. Period. Your father isn't able to support himself, wll he be able to support his family, or will he happily dump that responsibility on you while he continues to live the life of the philandering husband and irresponsible father? I think you already know the answer.", "NTA. Withdraw and make sure you and your kids are financially protected.", "NTA.\n\nJesus. He sounds awful. I would withdraw as soon as possible to avoid getting sucked in further. He will continue to drain you financially.", "You kept your promise to your mother. You made the effort to help your father and get to know him. What you know is that he is a very dishonest, advantageous, untrustworthy individual. DNA just isn’t enough to overcome the harm he is causing in your life. It’s time to cut him loose. NTA", "NTA.  Like the flight attendants say, put on your oxygen mask before helping your neighbor.  It’s a sorry situation, but it sounds like your dad will pull you down financially and emotionally.  You have invested a lots of time, energy, and money in your dad.  Maybe in a few years you will be in a better position to help you siblings, but not at the expense of your immediate family.  But right now it seems like you need to regain your equilibrium.", "Stop enabling this !! This really burns me up !!! I went thru the same exact thing !!\nCost me a lot of money. They got deported, FINALLY , and for years begged me to lie and bring them back. HELL NO !!  Cut off all ties. I'm sooo happy I did.", "NTA\n\nPut the mask on yourself before helping other \n\nOr\n\nDo not kill yourself trying to save a drowned person \n\n\nYou need to take care of yourself first.", "NTA\n\nNot in the slightest. This seems like a very difficult and precarious situation to be forced into and im sorry its where u find yourself. My grandfather also left his home county ahead of the rest of the family to save money to bring them out too. EVERY SINGLE CENT he had, he saved for his family to be able to leave, because thats what he WANTED. He did anything and everything he could to take care of his family. All of that to say what your father wants is achievable, he just doesn't seem to want to actually do it. Honestly very much sounds like he's bleeding you dry.\n\nYour apprehension is understandable, but it seems like at this point your choices are either remove yourself from your father and his family or be dragged down with him. Think about your child and do whats best for them, he and his family will survive but how that happens isnt your responsibility. You deserve respect and security, and you get to decide how to get that regardless of what that means for your dad\n\nYou matter, dont let your father supercede that fact.", "NTA. This sounds like a really toxic environment, and I am going to guess you would up supporting the rest of the family if  they make it to the US.   Your first obligation is to your kids, and you might be an a h if you continue to support this toxic grown ass man at the expense of your own family’s stability.", "NTA. Contrary to popular belief, we actually don’t owe our patents anything at all.", "NTA\nYou tried. And now you have to take care of your own family. He does not really seem to be motivated, so it's his own fault not yours.", "NTA. You will be legally liable for repayment of any state or federal funds they receive. Perhaps put this on hold and sponsor each sibling as they become adults.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLet's get straight to it. I was raised by my mother (U.S. citizen) who passed away in my early 20's from cancer. My father is an immigrant, who was deported from the United States after my parents divorced when I was about 7 yrs old.\n\nWhen I was about 25 yrs old after years of saving and sending money abroad, paying legal fees I finally got my father to the United States. I did this while being a single parent. I did feel a moral and somewhat cultural obligation to help my father, and most importantly prior to my mother's death she stressed that he is the only living parent I had and encouraged my emigrating him to the U.S. again to work on our relationship. \n\nMy father has limited education but does hold several trade certs including carpentry, trucking, & welding -he gained these certs in the U.S. He arrived in the U.S. when he was in his early 50's after being outside the U.S. for over 25 years, for context he has about an 85-90% grasp of English as opposed to a person born & raised stateside. Upon arrival to the U.S. we immediately agreed to start the process for my underage siblings & his spouse abroad. \n\nLet's get to the nitty gritty. It's been 7 years, & he can't hold a job longer than a yr but typically not averaging over 5 months. He goes through months of unemployment. When he does work he squanders his money, I can count less than 10 times he's paid towards rent, groceries or utilities while staying with me let alone contributed to the legal fees for HIS families immigration. He is a gross person in terms of his world views, insufferable. I won't pretend like there haven't been \"good\" times but the  bad greatly overshadows. To date I've spent well over 20k in this process, he's ungrateful and belligerent, selfish. I'm tired. \n\nI've depleted my 401k from over 40k down to about 15k since his living with me. Examples of his behavior include begging and coercing me into cosigning on a loan then refusing to pay, living in my house driving my car but calling me lazy or dramatic when I bring up the fact that I'm stressed. \n\nThough not necessarily my business, he doesn't hide the fact that he's cheating on his spouse who is abroad with their children (my siblings) either. \n\nI'm so frustrated w/ him, our communication is down to a trickle. I need to know AITA For considering withdrawing my immigration sponsorship for his spouse & my siblings abroad? At face value my siblings are children & have been nothing but kind. They can't be held responsible for what my father's done, nor could they TRULY understand at the ages they are. That said, I've made several complaints to his wife who almost always finds a way to defend his behavior which makes me wonder- are they in on this together? Also, as a man he cannot demonstrate or has not- that he's stable enough to support HIMSELF, AND his wife & kids when they arrive to the U.S. I have children of my own and DON'T want that responsibility.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Does he have citizenship now?", "NTA", "He does not have citizenship now, has not studied for test, has not raised enough money for test (but IS working full time trucking and also not paying rent) also there were 2-3 miscellaneous things he was asked to do by immigration attorney that he hasn't done.", "On the upside, you won’t have to see him again if you choose to withdraw sponsorship.", "NTA. I think you have gone above and beyond any obligation already by spending all that money on him. He has been nothing but a drain on you, and he is using you. He is one proof that the old sayind \"blood is thicker than water\" is a load of codswallop.", "NTA And you need to cut this guy from your life, what good he has bring to to you?, you have no obligation towards him since he is an adult and needs to take care of his life.\n\nProbably he really doesn't want his family to emigrate and has use the immigration thing as a way to abandon them,  if he really wanted them in the US he would move heaven and earth to do it, instead he is living his single.men life with you as a sponsor.\n\nGet a backbone and cut him, begin to cutting the money flow and you will see how he will begin to be angry at first, then will beg and try to emotionally blackmailing you and rage again. Simply say I don't have more money, I have a lot of expenses and I already help you a lot.\n\nI know your mother words sounds in your head but this was not the man your mom knew, after 17 years he is a different person and not a very good one it seems. This is not your responsability, you have done more than enough.", "If you successfully bring his family here, and you are the only one working, you are the only one paying.\n\nIt’s time to ask your father to leave. NTA", "NTA dont spend another dime in any way shape or form on him again\n\nYour responsibility is to your child, not to an adult and his family"]}