{"id": 6903, "submission_id": "107hxfq", "title": "AITA For Putting My Dog to Sleep?", "selftext": "I (29F) was never allowed to have a pet as a child. My mom is not a huge animal person and my dad swore off getting close to any other animals after losing his beloved childhood dog.  I have always loved animals and would beg my parents for a pet for every birthday and holiday from the time i was 4 years old. The answer was always No, until I was 13, and the answer was finally yes. So long as I agreed to be the main caretaker. I obviously excitedly agreed and was then introduced to my new best friend, Theo. He was a schnauzer with the most beautiful little face you could ever imagine. I immediately loved him more than anything and we spent all of our time together. \n\nI walked him before and after school, fed him breakfast and dinner, gave him baths, and he slept in my bed with me every night. We’ve never been a part longer than a week. He’s been my best friend and honestly my baby. I love him so much it hurts. \n\nAbout a year ago I met my now bf at a bar and we hit it off immediately. He took to Theo instantly and loved him like his own. \n\nTheo got older and with that came new ailments and illnesses. Last week i noticed he was pooping blood so i rushed him to the emergency vet and they diagnosed him w/severe pancreatitis and he had to be admitted over night. When i picked him the vet said the next 24 hours would be critical. I stayed up all night making sure he was breathing. He was very lethargic all the next day. In the middle of the next night he woke up yelping. I rushed him back to the vet & he had a new infection & internal bleeding. They said they could do surgery but at his age the risk of him dying in the surgery was very high.\n\n I tried to call bf many times but he sleeps with his sound off so i got no answer. I called my dad and he picked up and i just burst into tears. My dad comforted me and told me to do what I thought was best but in his opinion Theo shouldn’t live in pain and it would be better to be with him when he passed then let him die alone in surgery. I made the decision it was best for Theo to put him to sleep peacefully. It was the hardest thing i’ve ever had to do. I held him the whole time. It was so fast. I immediately vomited when i got home. I laid on the floor with his toys and just sobbed until morning. \n\nMy bf rushed over when he woke up and saw my messages. He came in & said “Did you really do it?” i just nodded yes and he got angry. he started saying things like “how could you do that to him?” and “he trusted you”. He thinks i should’ve gotten a second opinion and tried the surgery. He says I abandoned him when he needed me most. I feel like I did too. I let my baby down and I took his life from him. He’s also mad i didn’t try harder to reach him.\n\nI don’t know maybe I should’ve waited but my baby was in pain and I just wasn’t thinking about anything else. I miss Theo so much it hurts to breathe sometimes and I don’t know if i did the wrong thing. AITA?", "created_utc": 1673279963, "permalink": "/r/AmItheAsshole/comments/107hxfq/aita_for_putting_my_dog_to_sleep/", "score": 68, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I decided to put my dog to sleep 2. I may be the asshole because I didn’t go to a second emergency vet or try the high risk surgery to give him another shot at life\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "People who jeep their animals alive for themselves when they are suffering are selfish pricks", "NTA - I am sorry for your loss.\n\nBut - this may be harsh - why are you with someone who would treat you like this in your moment of intense grief? At 29 years old you should be able to see this behavior for what it is.\n\nWhen people tell you who they are, listen.", "Honey, you'r dog was 17 and in à lot of pain. You made the right choice. Keeping him alive would have been selfish.\nNTA and dump your idiot boyfriend.", "NTA - You made the right call and ended his suffering. I'm sorry you lost your dog. That's hard.", "NTA. This is the hardest decision any pet owner has to make regarding their pet and there’s no “right” answer. Dogs are remarkable at hiding pain, so it’s likely that he was suffering more than he let on. If you went through with the surgery, it likely would have only bought him a few months and that time wouldn’t have necessarily been pleasant. He also might have died during surgery. \n\nIt sounds like you did the right thing by your long time best friend. He wouldn’t want you beating yourself up over it. While your BF’s response to you is not good at all, I can understand that he grieving. But he owes you an apology and he needs to trust you with making the best decision regarding your dog. If he can’t do that, there’s no way you can have a future together with kids.", "NTA You made a tough decision but it sounds like a necessary one. It seems as though it would have just been prolonging his suffering to try the surgery. I'm sorry for your loss and sorry your bf is being so awful to you about it.", "NTA As someone who has watched many people keep their sick pets alive for years even though they could barely move you did the right thing. I had to let go of my cancer ridden best fur friend a few years ago even though he probably could have lived longer I couldn't stand to see him suffer just so I could keep him around, seemed so cruel. Sorry for your loss!", "NTA. Your dog had 16 wonderful years with you. Either he lived and died in pain, or you try the surgery and he goes through all of it possibly for nothing. \n\nYou did the best you could do for Theo, and he knows it. \n\nThe BF on the other hand... wow. Insanely callous and cruel of him to be piling on the blame. Gross of him at a time when you need all the support you can get.", "NTA at all. You did everything you could for him, and he died in your arms after a long life well-lived. That's much better than him being put to sleep by strangers for an operation and just never waking up. No dog could ask for anything better. You did right by your buddy.", "NTA it’s such a hard decision to make but you did what was best. It sounds like you have him an amazing life. I’m so sorry for what you’re going through, losing a fur baby is so hard. Even more so when you are the one that has to make that decision.  I’m sure your bf is hurt but he’s wrong for making you feel bad.", "NTA. From one dog lover who's had to make that GUT-WRENCHING and SOUL-SHATTERING decision also, I can tell you it's SO HARD to think clearly when you're faced with making that impossible decision. The thoughts and guilt can be brutal. But, in the end, you did your best to try to figure out the best thing to do with the circumstances you had laid out before you. You did what you thought was right, best, and most humane for your sweet fur friend. And that cannot ever possibly make you an ahole. Just the fact  that you are worrying about whether you made the right decision shows that you're NTA. Because an hole wouldn't give a crap.", "NTA. I am sorry for your loss. Your bf is an AH.", "So sorry to hear about your loss... your NTA, if he had internal bleeding and all that, it's very unlikely he would have lived much longer, even with surgery. You did the right thing.\n\nNow for your boyfriend... he had to know that this day was eventually gonna come, and is/was in denial about that. Which is understandable in a way, but that gives him zero right to make you feel guilty like that. Seems like a really shitty thing to do.", "NTA.  You did the kind thing and made sure your dog didn't have to suffer anymore.  I'm so sorry for your loss.", "Oh no. It's one of the greatest kindnesses we afford to our pets, at the cost of our own happiness. What you did was selfless and out of love. You didn't put him down because his sickness was annoying you or because you had enough of taking care of him. You did it because keeping him alive would be very cruel. This wasn't ever your fault. It's just one of those crappy things in life that everyone with a pet has to deal with. It's a great unfairness in life that our pets don't live as long as we do, but it's an even greater unfairness to force life on someone or something who would genuinely be better off without it.\n\nYour boyfriend was way out of line, saying all this. Theo wasn't his dog and if keeping a suffering dog alive for his own gratification is the kind of man he is, I would recommend not getting a pet with him and rethinking this whole relationship, especially with how he's treating you while you're grieving.\n\nTheo had a very happy life with you. He knew you loved him and he loved you right back. It won't undo your hurt, but you will always be his extra favourite human. Dogs are very good at picking up on love and the love you have for him leapt off the screen. He also knew you wanted to help him and that you were on his side. What a lucky boy to have so much love.\n\nNTA.", "NTA\n\nWe have a saying in vet med: “better a week too soon than a moment too late.”\n\nDogs live in the now. If now sucks, life sucks. If there’s a good prognosis, we sometimes ask them to suffer through a bit. It makes no sense to prolong suffering with a poor prognosis. \n\nSadly, I’ve seen far too many people who hold onto a pet too long and let them suffer. I consider it selfish but I do understand that most of us want to keep our pets around as long as possible. The truth though is that few pets just “die peacefully”—they die in pain, confusion, and distress when we do not intervene. \n\nWhen I had to put my last dog down, my husband was out of the country working and needed a few days to get home to say goodbye. At the time, my dog was not acute and I could afford to wait a bit but he and I agreed that if my dog (I’d had him since long before meeting husband) became distressed or got worse, I’d be euthing before he made it home.\n\nIt seems to me that your partner doesn’t have a very realistic understanding of the situation. \n\nPancreatitis isn’t a challenging dIsease to diagnose. No second opinion was necessary and the dog was in acute distress. \n\nYou did the right thing. I’m sorry for your loss.\n\nNTA", "Of course you're NTA. Your dog was suffering. It's hard to say goodbye in those circumstances, and I get why you're feeling guilty now, but you did the right thing.\n\nYour bf however is a piece of work. What an insensitive prick to talk to you this way. Even if he disagreed it was a) not his decision to make and b) incredibly offensive to talk to someone you supposedly love this way. Awful behaviour on his part.", "NTA. You made a choice while thinking on your pets behalf, that’s all someone can ask for. If you had done the surgery and he had survived, there most likely would have been more problems down the road with more suffering involved.\n\nEdit: Typo", "NTA. Your BF is an AH and it's better to change him. The way he criticized you instead of helping you out while grieving is disgusting. That poor baby was already old and in severe pain. Your dog had to be put down. Im sure he's now in a pain free place thinking about his momma. What you did was right. Relieving him of pain was the best thing anyone would do. Please take time and take care of yourself.", "NTA \n\nPutting a beloved pet down is a very painful but very important decision. Ultimately, you did the right thing. It would have been unfair to Theo to let him continue to suffer. Do not let your boyfriend tell you otherwise.", "NTA. You saved him from suffering.", "NTA you did what's best for your dog. It sucks and is hard for everyone but his quality of life is important too. You shouldn't put him through more suffering just because it's hard to let him go.", "NTA ignore your bf you did what was best for theo, he would have likely died during surgery/at home shortly after anyway due to both age and internal bleeding. It sucks when you have to get rid of a pet, but you did what was best.", "NTA - but your boyfriend needs to calm the F down. It is so out of order of him to verbally attack you like that when you have just lost your best friend! Theo was your dog, and you did what was best for him. Your boyfriend sounds like a bit of an entitled dick to be honest.", "No. NTA.\n\nMy cat passed away a little over a week ago. She was 17. I've had her since before I was born. She had animal alzheimer's. She was in in lot of pain. She was dying and hurting. We made the decision to put her to sleep. She did pass away before my parents reached the vet. But no. Theo was hurting and as painful as it you did the right think. I'm not sure what you believe in but Theo is pain free over the rainbow bridge. You didn't do the wrong thing. Theo is no longer in pain. I'm so so sorry for your loss. My condolences and my best wishes for you ans for Theo in the afterlife.", "NTA.\n\nAnd your BF is being an incredibly cruel manipulative AH throwing that abuse back on you.\n\nHe was YOUR dog, and ultimately your decision for his best interest and quality of life. The vet literally advised the risk of his surgery due to his age and other conditions.\n\nVery sorry for your loss. You didn't arbitrarily put your dog to sleep, you followed the medical advise of his vet and not wanting to see your pupper in pain.\n\nAbsolutely pissed off on your behalf at your BF for making this harder on you than it already was. What an entitled selfish AH. It wasn't HIS decision.", "NTA.  You have to think of the quality of life for the animal. I am not sure of the breed of the dog you had, but 16ish years is up there regardless and if he was having multiple medical issues and was starting to be in pain you absolutely did the right thing.  It is always very hard to make that call but from the information here it sounds like you made the correct one.  Just remember that even with surgery you may have lost him and given that the animal was having added conditions there is no guarantee it would have been better even if he made it through that.  In the end surgery may have just prolonged his suffering behind a veil of hope by thinking it was just recovery from the surgery.  I feel like if the animal was 10 years younger and had a good chance at a long healthy life after recovering then the waters get much more murky on the decision, but all signs here say you did the right thing.", "100% NTA\n\nMy sister is a vet, and it kills her to see animals suffer because owners can’t do the humane thing and help ease their pain.\n\nYour bf on the other hand is def an AH. And if someone did abandoning when it was needed most, it was him. Dick.", "NTA\nIt's such a tough decision to make. But it sounds like you've made the right one. Theo is no longer is any pain, running over the Rainbow Bridge", "OMG Your best friend was suffering! NTA", "NTA\nMy cat passed away a year ago due to lung cancer.  I tried the surgery and everything I could but it didn't work. He died and I wasn't there.\nYou did what was best for you dog, not yourself. At least when he passed you were with him. You held him to the end. I'm sure he appreciated that. But I'm very sorry for your loss. It isn't easy.", "NTA.\n\nA typical schnauzer has a life expectancy of 12-15 years.  It seems like you've had him for 16 years, so that's a pretty good life\n\nIf the vet says there's not much you can do and he's in a lot of pain, then it is right to put the pet down. Surgery can be incredibly expensive, may not have worked, would have put Theo in more pain, and given him at best only another year?\n\n(Personally I had our cat put to sleep 3 years ago, who was 17yo and in renal failure. I question it still, but it was the right thing to do.)\n\nIt is too easy for others to come along later and say you should have done more; it wasn't their call.\n\nTheo DID trust you to take care of him, and you did.\n\nEDIT to Add:  And you DID get a second opinion--your Dad, who lived with Theo a lot longer than your BF.", "NTA. Euthanasia is humane and there's nothing wrong with it. It sounds like you made the right call here for sure. Some people have this idea that life is so precious that we should cling on to it even if it's just suffering. Euthanasia advocates don't think of life this way though. Everyone's got an expiration date. Sometimes we can help things along a bit quicker to minimize suffering.\n\nMaybe it could be helpful for your BF to have some resources explaining why euthanasia is humane and why blindly and desperately clinging to life is not necessarily the moral high ground.", "In the nicest way possible, you didn’t even need to make this post.\n\nYou’re NTA one little bit. Idgaf what your boyfriend says, you were in a terrible awful position and he wasn’t picking up and you had to make a really sad choice. \n\nAt the end of the day, you made the best choice. Ending your poor sweet dogs pain now rather than making him suffer through surgery after surgery just to extend his life a little longer. The hardest part is to know when to let go. My mum couldn’t with our dog who was blind, deaf, couldn’t walk, had arthritis and brain tumours. It wasn’t until she didn’t recognise my mum that she made the decision, and we all held her and loved her as she slipped away peacefully. You stayed with him so the last thing he saw was his best friend, full of love for him. Theo would thank you for not letting him be in pain, and he knows that you made the decision out of love for him. You didn’t abandon him, you did the best for him. And that makes you the best person, doing what’s best for him and not prolonging his life for your own selfish reasons. \n\nHopefully your bf will come around, and this was just a knee jerk reaction of upset of not being able to be there, but he needs to stop taking it out on you. You were told the surgery might not even save him, so he got to go peacefully, in a space filled with love for him and the person he’s known most of his life.", "NTA at all. Seems like he was well cared for in his life and you had to make a tough decision. You made it for the right reasons.\n\nYour boyfriend is being unreasonable blaming you. Not only is it not what you need right now, but because of this bit:\n\n>When i picked him the vet said the next 24 hours would be critical. I stayed up all night making sure he was breathing. He was very lethargic all the next day. In the middle of the next night he woke up yelping.\n\nYour BF knew this was a critical time and left it to you to stay up with your dog both nights, leaving his phone on quiet. If he wanted to be kept up to date he should have had his volume on. He may have done it without thinking, but he still did. Your dog deserved not to be in pain any longer.", "Your bf is an AH. Unless this is typical, chalk it up to grief and guilt. IMHO you did the most loving thing for your dog - I'm in total agreement with your father. I hope your bf comes around. You had to make a horrible decision and he was spared that, so he can zip it. NTA!!", "I am so sorry for your loss.\n\nAnd NTA at all. Being the partner of an aging pet is hard. This poor dog was suffering, and putting him through surgery would have been risky... AND his quality of life after would probably have been awful.\n\nYou took the right decision. Your dog needed you to let him go and stop the suffering. I am glad you are not one of those pet owners that makes their pet suffer needlessly just so they can keep them around. When their time has come, the best thing you can do is let them go, not force them to suffer for your own enjoyment. \n\nStop doubting. You did the right thing and I am sure your dog would agree.", "NTA!!!  And I’m so sorry for your loss.  \n\nYou cared for him and he had a long life!  As his Mom, you get to decide what’s best for him, and I agree with you that it was best to let him go when you did.", "NTA. You took great care of him from what it sounds and don't deserve to feel this way for helping end his pain. I'm so sorry you lost your buddy. It's horrible losing animals but time will help. \n\nRemember that you did you best and your best was actually great.", "NTA\n\nYou will always second guess yourself on the decision. That will always live with you but what you did was the right thing. Your pet had severe medical conditions that caused it pain. The baby was bleeding from the inside out and an operation might not have corrected it. All it would’ve done was cause more suffering for the pet had it gone through with that surgery. Losing a pet is one of the hardest things you will go through so all you can do is do your best & you did by making that painful decision.", "Well dear I'm so sorry for the loss of your beloved Theo. And I'm sorry you should properly be morning him and not dealing with an obnoxious boyfriend. You were strong and brave and held your best friend to the end so that he was comforted and secure and went out knowing he was loved. No pets could ask for more. Your boyfriend is wrong and I know you don't want to hear this right now but it's time to lose about 150-160 lb of dead weight find someone who is a decent human being. Again so sorry for your very profound loss.", "NTA. You always know when the time is right. Your boyfriend is a special kind of sick to harangue you for this", "Definitely NTA. It's better to put him to sleep rather than letting him die with pain. I'm really sorry for your loss. And if possible, you might need to reconsider your relationship with your BF. Instead of grieving and comforting you, who's like a parent to the lovely dog, he got mad without even properly asking what happened. 🚩🚩🚩", "NTA. You did the best you could for your furbaby. You showed him compassion by stopping the suffering. \n\nI think your bf is a huge AH. If my partner reacted the way he did knowing how difficult this decision must have been for me, it would be grounds for break up (personally).\n\nEdit: just to add this decision was not your boyfriend’s. Theo was not his pup or his best friend of 16 years. He doesn’t get a say outside of being a supportive person in your life why you go through a painful situation.", "I am so sorry for your loss.   But you are NTA.\n\nYou made the best and most loving decision you could make at the time.  You did the right thing for your baby.\n\nYour boyfriend wasn't there.  He didn't see your puppy in pain. He didn't listen to the doctor.  You did.  And then you made a decision.  A terrible, painful, loving, heartbreaking decision.  You did not let your baby down.\n\nHold onto that.  And tell that to your boyfriend too.", "NTA\n\nYour dogs health comes first.\n\nYour bf is feeling guilty he didn't answer the phone. And he is taking it out on you.", "Nta I've also had to make the hard choice of putting a pet down.  My cat was 23. I had her since hee was a kitten.   But you HAVE to think of quality of life.  It's honestly a shame that we allow animals fo die with dignity but not humans.", "NTA. You did what you thought was best. No one deserves to suffer. On top of that, you can’t explain to an animal that surgery might help, all they’ll know is they’re in an unfamiliar place and their people aren’t around to comfort them.\n\nEveryone grieves differently, but you’re not the AH here. Theo had a good life, and you let him get the rest he deserved.", "I’m sorry you had to make this decision and I’m sorry for your loss. Losing a pet is never easy. Imo you made the right decision though. Definitely NTA. Your bf should be ashamed of himself, putting you down rather than comforting you.", "NTA\n\nYou gave your best friend 16 years of love and care and affection. That's a lifetime in dog years. It's never an easy decision to make, but I think choosing his comfort and easing his pain over your own attachment and sadness was a very empathetic choice. He'll be waiting for you on the other side of the rainbow bridge with a wagging tail and lots of licks.", "A hundred percent NTA, you’re boyfriend this is an asshole for sure. Instead of supporting you through this difficult time, he thought it best to scold and yell at you. SMH", "NTA- I'm so sorry for your loss. I know the pain of losing a beloved pet. You did nothing wrong. I assure you, promise you, cross my heart, you did the very best for your Theo. Your boyfriend is right in saying that your dog trusted you but he's wrong in saying that you failed that trust. You did not fail that trust by letting him go, you honored that trust by letting him go peacefully and not suffering. The hardest thing we have to do is let those we love the most go for their own sake and not make them stay for ours. You did not let Theo down. Even if he had lived through surgery the quality of life after was very marginal and there was no reason to let your beloved pet suffer.  You did the very best that you could. You provided him a loving home, good food, tons of love, a warm bed, toys, treats, and happiness. You gave him everything you could and as all good dogs do they burrow into our hearts and then leave us way too soon.  I swear to you that you did not do the wrong thing. I know how you are feeling. I have been there. It's hell on earth and you feel like the hole they left in your heart is going to swallow you alive along with the guilt that you didn't do enough. But you did exactly the right thing and gave your dog the best gift, you took away his suffering and gave him peace and you stayed with him right to the end.  That meant more to him than anything. You were his loving person until the very end.  \n\nNow, go kick your boyfriend in the shins and tell him to shut up.", "NTA but reevaluate your relationship, when we lost our kitty in an accident and had to put him down my bf just held me. No blame.", "You are not TA, not even remotely close in any universe. Your bf though… how totally unsupportive and mean! I’ve been where you are, had to make the same decision more than once. Your heart is broken and a little piece of it always will be. You’ll move on from losing your pet… be able to talk about him or think about him and smile instead of cry but forgive your bf? Nope. At least I would never be able to. \nYou are NTA but your bf is… unforgivable", "NTA, You did what was best and you loved him as long as you could. It sucks and you bf does not sound very helpful. Theo was 16 that's a really good run for a pup.", "NTA at all. Sometimes the kindest thing we can do for our pets is to let them go. I so sorry because I know how difficult that decision is, even when you know it is the right one, and you should have had your bf's support. I don't think a lot of him for treating you like this.", "NTA\n\nAs a person that put quite a few pets to sleep. Would you feel better to watch Theo dying slowly? Being in pain and crying daily? Unable to eat, hold food or stay awake? Or not even having time to say goodbye and just losing him? \n\nI don't think so. You want to give them the best. And the best is a good healthy life and knowing when they can no longer be alive. Understanding that they can't be alive forever and that it's good to have respect for the end of circle of life. That it's better to hold him, cry, tell him you love him a lot and put him to sleep. Than spend agonizing months and day for you and him when he won't be able to eat and watch him die slowly. The dog trusted you to offer him the best you could. And that is what you did. You didn't let him down. You took care of him. You cared enough for him to understand that he was hurting and that this was the best thing you could do to take him out of pain. You didn't take his life out of him. He was sick and he would die sooner than you think. Instead you decided to not let him die in pain and agony. How is that a bad thing for your boyfriend?", "NTA.\n\nI've had dogs my whole life and I'm a dog groomer, they are literally my life. You did what was best for your dog. Prolonging a life with suffering isn't providing life and isn't in the best interest and comfort of the animal, it's done so the human doesn't have to deal with the loss. \n\nI've always considered it a duty to let your animal die with dignity and not make them suffer for my needs. Your boy was 16 (based on the ages you gave) and that's a long and wonderful life for a dog. You didn't abandon him and you didn't let him down, I can promise you that.\n\nI'm really sorry for your loss and what you're going through.", "NTA. Responsible pet ownership is so hard when end of life decisions need to be made. You made the compassionate choice to end suffering. Hugs and healing to you.", "NTA. \n\nMy parents rescued a greyhound (we already had another dog)when I was 13 and she and I immediately clicked. She slept in my bed every night until I went to college, but I went semi locally so I came home every few weekends and she’d sleep in my bed then too. Even when I was at school she refused to sleep anywhere besides my bed. She was at the point where she couldn’t stand, was taking enough painkillers to take down a rhino and would just cry while she was laying on the couch. Vet said they could do a few surgical things to alleviate the swelling in her joints and make her more comfortable but she was 16 so my family decided it would be easier for her to let her go. Hardest day of my life up to that point so I get exactly what you went through, and I think you did the right thing. She never licked faces, I was the only one she ever did it to and it probably happened 5 times total, but she sat in my lap the entire drive to the vet licking my face as if she knew and then put her paw in my lap and kept it there as she slipped away. I think your dog went more peacefully with you there. We don’t deserve dogs", "So sorry for your loss.  But, if your vet was willing to help Theo, then it was not a wrong decision.\n\nOn the passing of our beloved lab, we received a note from the vet telling us that we not only did the right thing, we did the \"kind\" thing to ease his suffering.  I will never regret our decision - we owed him too much for all the love and devotion he had given us.\n\nI am sure your boyfriend is mostly upset that he couldn't be there, too.  Give him time to grieve alongside you.\n\nNTA.", "NTA\n\nAnd honestly, this is something worth considering ending the  relationship over\n\nYou did right by that dog.  At some point, it's cruel to keep animals alive just so we don't have to face the pain of losing them for another day", "Absolutely NTA. It's the hardest thing we have to do as pet parents, making the decision when to put them to sleep. That's the cost for all the love and light they bring to our lives. You knew Theo better than anyone-he loved you and he trusted you, and he knew you would look after him. And you did-you allowed him to pass gently in the arms of his person, and he would have known and understood how much you loved him in that moment. You didn't abandon him, you didn't let him down, you did exactly what we all should do, what is best for our pets, not what is best for us. Your boyfriend is absolutely, completely and utterly wrong about this. I hope he wises up and apologises, because what he said was appalling and deliberately hurtful.", "NTA\n\nAnd I know how hard this is. A couple of years ago, we had to put our beautiful Lab, Onyx, to sleep. He was very sick with an aggressive cancer that was going through the roof of his mouth. It was either keep him on painkillers amd watch him starve to death or let him go. \n\nAnd it's heart breaking when your pet is so extremely sick and clearly suffering. It can be hard to know that you're doing the right thing. \n\nBut in the end, it's selfish to let them live in pain and suffering, especially when there's so little hope of the treatment working. \n\nYou did what was best for Theo. You let him go. He isn't suffering anymore. \n\nAnd the bf is a jerk for making you feel bad about it.", "To pets, we are their whole world, and you gave Theo a wonderful life. Unfortunately, those lives don't last as long as ours, and it's our curse & responsibility to send them off when the time comes. For Theo, it was time, and you showed him the last kindness by ending his suffering. **NTA**", "Nta\nIm crying rn too", "NTA - I’m so sorry your boyfriend reacted so unfairly (I’d even say abusively). You made an incredibly difficult decision in the best interest of Theo and his quality of life. More importantly, you stayed with him through the very end, which is incredibly difficult - a lot of pet owners aren’t able to step up like that. By sparing Theo from unnecessary surgery and bouncing around emergency vets you gave him the opportunity to die peacefully wrapped in your loved.", "NTA. You poor thing ❤️ you made the right decision and I’m so sorry. Losing a pet is so hard. Don’t let anyone make you feel bad about it.", "My gf was literally in this same position just last week. Her dog was getting up there in age and he couodnt control his blatter so hed pee and poop while walking without noticing. And her mom would yell at him for doing it. She knew he couldnt control it   and when he would fall down the stairs and you would try and help him up he would pee then too. She made the decision to put him down as he could hardly stand while eating, if he chose to eat that day. Her mom has been giving her the cold shoulder everyday since. And what hurt my gf the most was the second we got back from putting him down her sister was already asking when are we throwing out his things. They practically are trying to get rid of any memory of her dog without even letting her process that he is gone. Her sister wanted to take all his toys and drop it off at the dog park. Never thought id meet someone so cold towards their own family knowing how upset theyd be if it were to happen to their own dog", "NTA.\nI’m so sorry you’re going through this. \nPart of our responsibility as pet owners is being able to make this decision for them. \nTheo was 17. If he made it through surgery, recovery would have been difficult and painful for him, and he wouldn’t have understood why. \n\nInstead, all Theo knew in his last moments of life was what he had known all of his life, your love.\n\nYou did right by him.", "NTA. There's a point in a pet's prognosis where you'd just be prolonging misery for the pet, and it's your responsibility as owner to recognize when that is. It is very painful to make the decision for a beloved pet. \n\nYour boyfriend is being really awful. He's both wrong and mean, not a good combo.", "Nta, you made the right call. Your boyfriend just showed his maturity though, and it ain't good.", "Your BF is a garbage person for what he's said. NTA in any sense, I'm sorry he's being like that in your time of grief", "I have a Grandfather that grew up on a farm.  He had no illusions about the nature of animal's lives.  They had cattle, they ate meat, it's just life.  He loved animals still and as an adult he had a dog as a pet.  When the dog got old and sick he resisted putting it to sleep and wanted to dog to die at home naturally with family.  It was horrible.  The dog suffered, the people suffered.\n\nAfter that experience he said he would never do that again and later pets they had were put to sleep when the time came. He felt terrible about the experience and would tell you as much.\n\nThe fact that he went through that and made the wrong choice makes me feel better about having to make that choice myself when the time comes.  He already tried the \"Hold onto the dog as long as possible route,\" and it's horrible.\n\nDon't feel bad about putting him to sleep, the alternative is awful.", "My dog was put to sleep when there was nothing else to do, because we chose the surgery before. Yes, It's heartbreaking ; yes, at that moment you hate yourself for taking that decision.\n\nBut let me tell you this : I have had 6 years to think about it, and when I look back at how old, in pain and unresponsive he was, I know it was the right decision. And doing the surgery the first time was the wrong one : my dog wasn't a dog anymore. He wasn't eating or walking, he just layed from a place to another. He was blind and deaf at the end of his life.\n\nYour boyfriend needs to process this, but I hope he will finally understand that this wasn't only necessary, but there was no other way, surgery will have turned your dog into something, but it would not have save your pet. It would have given you a carpet that happened to be breathing. \n\nYou took the right choice.\n\nNTA", "NTA, you did the right thing.  I hope your bf was reacting that way out of grief, but even if so he’s still a massive AH.  If that’s a normal type of response from him, ditch him.", "NTA - Sorry for your loss. It is hard to know when the right time is, and honestly, we tend to wait too long, I personally regret waiting too long for one of our pets.\n\nSome reassurance, the veterinarian would intervene if you were making the wrong choice. If the dog has a reasonable chance for a quality of life, they would say something. \n\nWhen we had to help our cat transition I woke up with nightmares about it, heart rate spike and blood pressure through the roof. \n\n&#x200B;\n\nWe have to ask why we are keeping them around, for their benefit or ours?", "NTA. Your BF seems to have had unrealistic expectations for a “miracle” and pass his moral judgement on you for making the decisions that needed to be made. Even with humans the “my 94 year old grandma (who is in cardiac arrest and has cancer and multi organ failure) is a fighter! She’ll come out of it fine! Do full life saving measures!” is just leaving someone lingering in horrible pain for your own selfish reasons/desires. \n\nIf you truly cared, you don’t wanna watch someone (even your dog) linger on in pain that will only get worse. Your dog was 14? At least ? I had a similar situation where my dad wanted no animals let alone a dog but I got my mom in 2nd grade to agree to a GSD at the SPCA. My dad said only if I was the one to take care of it. And I did til we put her to rest at 14. She had been in kidney failure and we were giving her IVs and she wasn’t herself. \n\nThen all of a sudden… she miraculously got better… for like a week tops. Then was worse than before. I was distraught no one was doing anything, got her in my car, and took her to the vets who said it was over. Sure, they could try different things. But it was gonna cost a lot of money and be like a band aid on a gunshot. So finally, I broke down and did it. I was there while she was put down and it was better than watching her struggle with daily/simple things like up/down steps. \n\nI hope you realize he is TA and not you, you did what was right.", "NTA you did what was best for the pet you loved. I'm sorry for your loss.", "NTA - fuck your bf, I know he is also grieving but you had that dog for so long before you met him. I'm so sorry for your loss. My gf had to put both of her elderly dogs down last year and I will tell you what I told her, you did the right thing and please don't beat yourself up about it. You were able to say goodbye and get closure. If your dog had surgery and didn't survive, you would've beat yourself up about it. 14 is very old for any dog. That is a testament of how great you raised your dog. I'm sorry I can't give you any peace, but I hope that your sorrow lessens and I hope you get to meet your dog on the rainbow bridge  one day.", "NTA. I actually applaud you for being able to do the hard thing and doing what is best for the animal and not have the animal suffer for longer than needed. I recognize it is a hard thing and many people struggle with it. (I know a private detective who apparently gets chastised by the vet for not letting the pets go at the right time.)", "So he'd rather the dog live in constant pain than put it out of its suffering? Seriously take this as a sign and throw the BF away.\n\n\nNTA", "NTA and I’m sorry for your loss.", "NTA. The kindest, and the hardest, thing you can do for your pets is help them pass over when they are sick and in pain.  It hurts so much to do it, but it is the best and most living thing you can do. \n\nI’m so sorry for your loss. I hope your furbaby is frolicking over the rainbow bridge, free from pain and illness.", "NTA. Absolutely not. I’d have done the same.", "NTA but your bf sure is!! Your dad was exactly right and you did the right thing.", "Oh honey, no. You’re never the AH for taking the pain away from a beloved pet. It’s one of the hardest decisions we have to make as fur parents, but it’s for the best. There was nothing else to do except prolong the suffering. \n\nI really hope your bf is just bad at handling his guilt and grief, cuz he’s being the AH saying that shit to you. How dare he?! He needs to grow up. \n\n💜 It gets a little easier as time goes on.", "NTA This was your childhood dog, it was your decision, not your bf's. You couldn't get hold of him and even if you could, it was still not his decision. He should be supporting you, not guilting you. I'm not sure he is your one, he is completely undermining you. You did what was the best for your dog. Your bf is asserting himself into the situation with anger and guilt trips for a dog that isn't even his, nor was he ever responsible for. This is not the attitude you want in a life partner. He is 'twisting the knife in' not supporting you and that is very bad.", "NTA and I’m very sorry for your loss, Theo sounds like he was a very loving and sweet pup and he had a long happy life with you. I understand your boyfriend is upset about losing Theo too but honestly, he’s being cruel. Putting down a beloved pet is **always** an extremely painful and difficult thing to do, and it’s not done lightly. The medical professionals told you the risk of him dying during the surgery was very high, and he was in pain, you did all you could do. Hopefully your bf will calm down soon and apologize, I get he’s grieving too but how it’s acting is not acceptable.", "NTA. I'm sorry for your loss and I'm sorry your boyfriend is being so horrible. You did the right thing. Hopefully your boyfriend will be able to think a little more clearly and apologize when the shock has worn off.", "NTA and seriously look at if you can trust your bf to comfort you and help you during difficult times. This was not his decision to make and I wouldn't allow someone to guilt me like that during one of the worst moments of my life.", "NTA , so NTA , you gave mercy, I had to do the same thing , several times ( large breed dogs for decades) , except I didn’t have to deal with the AH BF. A pet Vet does not recommend euthanasia casually. If the regular Vet recommends it I’d do it. I hold them , pet them , sooth their fear, give them a bit of joy, and I cry like a baby .", "NTA, he did trust you and you did not let him down. You helped him pass in a far more peaceful way, with you, rather than in surgery. Don't let your boyfriend make you doubt that your decision was made with love for Theo. You did not abandon him. You made the most difficult decision you can for your pet and you were strong enough to stay with him until he was gone. That is the kindest thing you could have done. \n\nYour boyfriend might be feeling some guilt over sleeping through the emergency and projecting that onto you but that does not make your decision incorrect. Take as much time as you need to yourself and hopefully he will do the same to try and better understand the reality of the situation. Perhaps after that, he'll be able to have a more mature stance without attacking you.", "NTA, ur bf tho is def an ass clown, you did what was in the best interest of your fur baby, yes it sucks but putting him through a surgery that may or may not work is risky, I commend you for being able to make such a hard decision, I myself had to put my pitty down a few years ago due to a fall that bunched nerves in her neck and a 30k surgery had a 6% chance of helping, you made the right adult decision, but I am sorry for your loss", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (29F) was never allowed to have a pet as a child. My mom is not a huge animal person and my dad swore off getting close to any other animals after losing his beloved childhood dog.  I have always loved animals and would beg my parents for a pet for every birthday and holiday from the time i was 4 years old. The answer was always No, until I was 13, and the answer was finally yes. So long as I agreed to be the main caretaker. I obviously excitedly agreed and was then introduced to my new best friend, Theo. He was a schnauzer with the most beautiful little face you could ever imagine. I immediately loved him more than anything and we spent all of our time together. \n\nI walked him before and after school, fed him breakfast and dinner, gave him baths, and he slept in my bed with me every night. We’ve never been a part longer than a week. He’s been my best friend and honestly my baby. I love him so much it hurts. \n\nAbout a year ago I met my now bf at a bar and we hit it off immediately. He took to Theo instantly and loved him like his own. \n\nTheo got older and with that came new ailments and illnesses. Last week i noticed he was pooping blood so i rushed him to the emergency vet and they diagnosed him w/severe pancreatitis and he had to be admitted over night. When i picked him the vet said the next 24 hours would be critical. I stayed up all night making sure he was breathing. He was very lethargic all the next day. In the middle of the next night he woke up yelping. I rushed him back to the vet & he had a new infection & internal bleeding. They said they could do surgery but at his age the risk of him dying in the surgery was very high.\n\n I tried to call bf many times but he sleeps with his sound off so i got no answer. I called my dad and he picked up and i just burst into tears. My dad comforted me and told me to do what I thought was best but in his opinion Theo shouldn’t live in pain and it would be better to be with him when he passed then let him die alone in surgery. I made the decision it was best for Theo to put him to sleep peacefully. It was the hardest thing i’ve ever had to do. I held him the whole time. It was so fast. I immediately vomited when i got home. I laid on the floor with his toys and just sobbed until morning. \n\nMy bf rushed over when he woke up and saw my messages. He came in & said “Did you really do it?” i just nodded yes and he got angry. he started saying things like “how could you do that to him?” and “he trusted you”. He thinks i should’ve gotten a second opinion and tried the surgery. He says I abandoned him when he needed me most. I feel like I did too. I let my baby down and I took his life from him. He’s also mad i didn’t try harder to reach him.\n\nI don’t know maybe I should’ve waited but my baby was in pain and I just wasn’t thinking about anything else. I miss Theo so much it hurts to breathe sometimes and I don’t know if i did the wrong thing. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Absolutely NTA. OP did a very hard thing so a beloved pet wouldn’t suffer. BF doing performative righteousness needs to get in the fucking bin.", "NTA\n\nThe toughest decision a pet owner has to make is when is it time. Having just done that myself with my 18 year old cat, I know your pain.\n\nYou did the right thing by thinking of your best friend Theo and what was better for him than you. He crossed the rainbow bridge knowing he was loved and had a great life and would no longer be in pain or suffering.\n\nI'm sorry for your loss.", "NTA. You had a loved one who was suffering and you chose the most humane path. Being there with them at the end is the best thing you can do. He got to be with you to the end.", "Losing your furry loved ones is hard. You did the right thing, though. He was in pain and he might not have made it through surgery. Your bf is upset and blaming you because he has no one else to blame. This is a red flag. You did the right thing. Grieve as you must then consider your boyfriends reaction. NTA", "You are NTA. Your boyfriend should be supporting you, he knew your dog for 1 year and you knew him for 16. He should be concerned about how hard this must be for you, but he’s not, and he’s trying to make you feel guilty with the things he’s saying to you, which is a little bit disgusting honestly, even if he is grieving. Your dog was suffering and that is more important than your boyfriends feelings.", "NTA and having been in this situation, it’s not an easy decision.  The decision you made was to ease Theo’s suffering at the sake of your own.  During the time it would have taken to get a second opinion, surgery and recovery (if he came through) Theo would have been in pain.\n\nYou took on his suffering by easing his pain and inflicting your own.  Believe me when I say that this was incredibly brave and loving.  It’s a decision of “well what if he would have gotten better.”  But he wouldn’t have.  \n\nHowever, your bf needs to check himself.  He should have been supportive and caring rather than judgmental. \n\nI am so sorry for your loss.  You never get over the feeling of loss and missing your loved one.  But the pain will turn to fond memories with a hint of longing.", "I've been in your position, more than once.  The first two times, we opted for treatment, including once for an elderly dog like yours. Maybe it was the right decision for Cody, who was relatively young and otherwise healthy.  But I didn't get to say goodbye to her, and I will never stop second-guessing making her last moments ones surrounded by strangers.\n\nBut it was the wrong decision to make Sammy, my old lady dog, go through treatment -- it was a decision FOR OUR BENEFIT, not hers.  Ultimately, we did euthanize her, and got to be with her and hold her and tell her it was time for her to rest.  \n\nHaving gone through those situations with Cody and Sam, when we faced an emergency decision for Sarah, with an unknown mass bleeding, we decided to euthanize and my husband was with her so she had someone who loved her at the end.  THAT was the decision made for HER benefit.\n\nI am so sorry for the loss of your Best Dog Ever.  I am glad you were able to make a decision for HIS comfort.  The next while is going to be hard.  Even after a lot of time has passed, you are going to find yourself suddenly sobbing.  Grief means you loved, and were loved, so cherish that.\n\nNTA.", "NTA.  Your bf on the other hand should not take his grief out on you in this situation where you need confirmation you did the right thing (that is what this post is for).  He should learn from this that he should keep his phone on in case of emergencies so that he is available to help; not appear after the fact when the difficult part is over.  It is always easy to criticise someone else's decision.", "NTA. I just had to take my cat to the emergency vet on Friday. I suspected it was his kidneys because he has chronic kidney disease and the symptoms were consistent with that progressing. Now, he wasn’t in too bad of shape, so I expected they’d be able to treat him and he’d come home. But I knew there was a small chance he wouldn’t. I love him very much, and the thought of losing him is extremely upsetting. But if the vet had told me he would be in pain and treatment would only be prolonging the inevitable, I would have agreed to put him to sleep without hesitation, because while the thought of him being gone is heartbreaking, him suffering would be even worse. You absolutely made the right decision, and your boyfriend is being a selfish asshole for talking to you like that. I’d give him a little time to come around, perhaps he’ll see the light once the shock wears off. But if he continues to question you on this, I don’t see how this relationship is worth saving.", "NTA.  My family has a 16 year old cairn terrier that has been a part of my life for my entire adulthood, basically.  We are constantly monitoring her to make sure she's still happy and has a good quality of life.  We had to put her sister down in April, and it was very hard, even after her long, slow decline.  You do the best you can for them with the information you have.  You DID the best you could for your buddy with the information you had.  Your boyfriend is being a jerk.  It's ok for him to be upset he didn't get to say goodbye, but there is no excuse for him treating you like this.", "so NTA. it's been less than a week since I had to put my dog down. so i understand how you're feeling right now. you did what was best and most humane thing for Theo. and anyone who has never had to be in that situation doesn't get to voice their opinion.", "NTA. I'm so sorry, Theo was lucky to have you.\nAlso, your bf of 1 YEAR is an absolute excuse of a human being. Who says these things to a grieving partner?", "NTA whatsoever.  Your bf clearly doesn't know much about pets or caring for another living creature, thinking that a surgery would have been the miraculous cure-all and it was a simple decision.....  It's not that simple.  Surgery on a dog that age is hard on the dog, recovery is difficult and painful, and for what?  Another 6 months of a painful life?  Or skip surgery and let them keep suffering until they die naturally at home?  No.  The only thing your bf was right about was that Theo trusted you.  He did, and you took great care of him.  You did right by your baby, and I'm so terribly sorry for your loss.", "NTA and I'm really sorry for your loss. My pets are my life, and I'm dreading the day I have to do this. You did the right thing. The vet wouldn't have recommended putting him down if he didn't think it was time. Your pup would have unnecessarily suffered. Your boyfriend however is a total ass for making it seem like it's your fault he wouldn't answer his phone and making you feel guilty for everything.", "NTA you did the best thing for him", "NTA, your dad was right. It's a hard thing to make that choice, and you'll always wonder whether it was the right one. But Theo was in pain, and the surgery would have been added pain that, as the vet stated, likely wouldn't make a difference. Theo had a good life, and you took care of him until the end. I think it's good you let him go out peacefully, rather than risk the surgery.", "No. NTA. When we have pets, we have to give them the dignity and peace to pass as painlessly as possible.  You did him a kindness. I fully understand the feeling. I had to have my girl PTS last year. My heart still hurts.", "I am so sorry for your loss. You did the right thing to prioritize Theo and his comfort. He wouldn’t have understood that surgery was extending his life or that you were “fighting” for him- just that he was still in pain. \n\nI’m hoping your boyfriend was reacting out of sadness, but if he doesn’t shape up fast, that’s a concern. My wife and I very abruptly had to put down a cat because of a sudden, unpredictable medical issue; she had been my first cat. However, my wife brought her into the relationship and had her three years before we were together. I backed the hell up and gave my wife room to make the big choices (unless she asked for input) and to be the primary grief holder during the ordeal. \n\nHis lashing out isn’t okay. You did everything right. I’m sure my Fern, that cat I mentioned who taught me how to love a cat, will go check out Theo for us. And I’m giving my own dog a big hug, because their lives are too short. NTA", "NTA you did the right thing by not letting him continue to suffer", "NTA. \n\nHow could you be? Theo was unwell, and and pain. Now he's not.\n\nYour bf? He's the AH here. This was his reaction after you lost the family member you've known for over half of your life?! Fuck that guy.", "NTA that sweet dog of yours was old and the trauma of having surgery at the grand old age he was it wasn’t worth the risk and pain for the poor thing.\n\nI’ve had dogs all my life and the hardest decision you have to make is when it’s time. It’s not easy to make the choice but ultimately you make it and you take on the pain of losing them to give them the freedom of no more pain.\n\nYour bf was out of order I can only hope it was grief.", "NTA, is this your bfs first pet? It feels like a reaction that comes from someone who hasn't had pets before and has only experienced having a pet for a year.\n\nAs the person who's been with Theo his whole life you know him better. You know how much his health had declined and have a better perspective on it than someone who basically just met the dog. \n\nYou did the right thing, and you did the most that you could for a senior doggy. It's easy to second guess yourself, I do it occasionally after we had to put our 15 yo golden to sleep a couple months ago. It's just because you want him back, but behind that we know that even if we had poured money into him he'd still be in pain and still be a dog that gave us more years than we could have hoped for.\n\nTake it easy, your boyfriend likely just doesn't understand this and is upset at himself for not being there and upset over the loss as well.", "NTA. This is the most difficult decision someone that has a pet can take. When is the right time? It's difficult to say but, and I also apply it for humans, when the pain is beyond hope and the odds are against him, it's a good call.\n\nYou dogs trusted you, and you made the right call. And you were with him at the end. This is all. \n\nYou did good.", "NTA - I understand why your boyfriend is upset, because he also loved Theo and didn't get to say goodbye.  Grief makes us do and say irrational things.  He's being irrational and lashing out in pain.  \n\nWhat caused me to say NTA instead of N A H is that he lashed out *at you* while you were also in grief.   He took his grief out on you despite the fact that you're also suffering. Despite the fact that Theo was yours, not his.  Instead of being there for you and leaning on each other, he became a source of further torment.  \n\nI'm so sorry this happened to you.  I know how it feels.  I know how there are very few words that could possibly make it better.  I hope you can take comfort in the fact that you gave Theo as best of a life as you could.  He was loved and cared for.  You made the right decision.  Because of you, Theo left this world surrounded by love.  You have nothing to feel guilty for.", "NTA blood in the stool is extremely painful for anyone to experience & he was at the end of his life (15-16 years is good for a dog); yes, we'd love for them to live until we die but that's being selfish & can cause our pets to experience unnecessary pain. You did the right thing for your dog even though it hurts you; sorry for your loss. Surgeries for pets is not a guarantee; we had a dog die in recovery when I was younger & we spent close to $10k on tests & treatments but it still wasn't enough & he succumbed on his own & he was in agony the entire time.", "What was the age of your dog?", "And cowarts let's not forget that one those people are cowards too.", ">If you went through with the surgery, it likely would have only bought him a few months and that time wouldn’t have necessarily been pleasant.\n\nAgreed.\n\nI sometimes wonder if my parents made the right call with a pet we had when we were young kids. She was with us for a few more years but her life was very restricted as per vets instructions and it was like she had no energy.\n\nBut apparently my Dad looked at us (we were all at the vets) and couldn't do it. I can't blame him for that really.", "I had to take our 20 year old cat in to be put down last year because she started walking in shaky circles and couldn't settle down. The dr. said they could try various tests but they probably wouldn't tell them much and take some time and would stress her out more. But I was the one that had to make the decision. It was very hard to do but the vet was so gentle with her and took a minute afterwards to tell me that I did the right thing. That was the most helpful thing he could have said.", "Yep. 2 nights of critical watch and he has his phone on silent.\n\nAnd that's her fault, apparently.", "I'm sorry you had to go through all of that. Hope you're doing well.", "Going off the ages in the story looks like at least 16. He had a long and good life and I’m sure OP did the right thing but not putting him through additional risky suffering at that age.", "With my first dog, I spent thousands at the emergency vet getting him through what was essentially the beginning stages of heart failure. He never fully recovered and the next 5 months were a slow progression of issues until I had to put him down. Am I glad I had some more time with him? Yes and we had some good times in those months. But in hindsight I wouldn’t have put him through what he ultimately went through in the end."]}