{"id": 6905, "submission_id": "107i670", "title": "AITA for asking my brother if he could put a lock on my ensuite door as my husband keeps coming in while I’m showering?", "selftext": "I’m 15 weeks pregnant and before I found out I was getting lightheaded constantly, especially while I was showering. I still get lightheaded but it’s not as frequent or bad as before. \n\nAt one point it was really bad and I was scared to have a shower so I would ask my husband to either come in there with me or to work from our room so if I needed his help he would be able to hear me. Even though I’ve told him I’m fine now he still comes to check up on me multiple times and generally treats me like I’m made of glass.\n\nWe’ve argued over it multiple times already but he always finds an excuse for why he needs to be in our ensuite the second I decide to take a shower. There isn’t a lock on the ensuite so I can’t keep him out and I don’t want to move all of my stuff to use a different bathroom.\n\nI decided to ask my brother if he could help me install a lock on the ensuite door. I never asked him in front of my husband but my brother told him once he came back into the room because obviously his best friend is more important than his little sister. They laughed about it but after my brother left, we had a fight because my husband doesn’t think we need a lock and that I should’ve spoken to him if I wanted one instead of trying to get my brother to secretly install one behind his back.\n\nI also texted my brother that he’s a jerk and that I should've asked my dad which he sent a screenshot of to my husband to tell him he better give me a lock because I was pouting over it. \n\nAITA?", "created_utc": 1673280525, "permalink": "/r/AmItheAsshole/comments/107i670/aita_for_asking_my_brother_if_he_could_put_a_lock/", "score": 59, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked my brother to install a lock on our ensuite door so I could stop my husband from coming in while I’m showering. I intentionally asked while my husband was out of the room as I didn’t want him to know until the lock was installed.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "If I were your husband I would divorce you instantly the dude did not even do anything creepy you just want to lock him out. What are you gonna ask him next not to look at you during sex?", "YTA. He is concerned. Consider yourself lucky. Most men think pregnancy is a breeze and women who have problems are weak. I mean he is your husband not some stranger walking in", "NTA. Your brother definitely is. Your husband's behaviour was a little more understandable at the beginning as it came from a place of worry about your health. Once it became clear that the risk had passed, he should have backed off. You're entitled to your privacy and shouldn't have to ask more than once. The fact that you felt the need to approach a third party to have a lock installed rather than have him take you seriously is concerning. Is this the only time he has been high handed with you?", "NTA. If he would just give you some privacy, then you wouldn't have to put a lock on. He's not respecting your boundary. What did he expect to happen? If he's concerned about you showering safely, then he absolutely can just stand on the other side of the door and wait for you to call him if you need him.", "NTA. NTA. NTA. NTA.\n\nYour need for privacy just gets ignored.\n\nYou think you need a **PHYSICAL BARRIER** **to feel safe from your husband**?!?!  \n**This is not normal.**\n\nHave similar things happened before?  \nYou asked your husband to respect your boundaries and he just ignored it?  \nHow good are your connections to your friends? How many close friends do you have and how often do you see them? Are you isolated from your friends?\n\n**This seems like the beginning of an abusive situation or maybe you are already in an abusive situation!!!**\n\nPleas pleas pleas OP talk with your female friends about this situation. This is serious.\n\n\\> They laughed about it \n\nThey laugh about you asking for privacy? That's incredibly rude and a red flag for me.\n\nI truly wish you the best OP and I hope nothing similar has happened in your relationship with this man before.", "Why couldn’t you put a lock on your own door? Why involve someone else? That’s the AH part to me. \n\nYTA but he should be respecting your request to stay out unless invited in.", "YTA.  How horrible that your husband is concerned about your safety and that he might get a glimpse of your naked body in the shower! /s", "NTA. Privacy is a right  and your husband needs to learn to respect your boundaries.", "YTA getting dizzy while pregnant is no joke. I understand not wanting to be treated like glass but what if you did fall and he had to deal with a lock to get to you? Sit down like adults and forgive out a compromise and don’t go behind your husbands back to get the issue “resolved” cause it just creates more problems.", "NTA ~ clearly your not afraid to ask for help when you need it. You don’t feel you need it now and there’s exactly zero reasons for him to come in and out multiple times while your in the shower when a simple “you good” yell from the other side of the door would suffice and while I understand he has his own issues and fears that doesn’t mean you forfeit your rights to privacy just because your pregnant. Unless you can get a lock on the door or get him to take you seriously it might be time to start showering when he’s asleep or at work or at the store. Maybe send him on an errand for a pregnancy craving and jump in when he leaves.", "YTA. Your husband is right, you should have asked him to install a lock rather than attempt to go behind his back, if nothing else to emphasize how bothered you are by him checking in on you without being asked. \n\nI was at NTA had you not involved your brother. You’re correct that your husband should give you privacy in the shower if you ask but locking him out is probably not the answer. If your lightheaded episodes are still happening, it is dangerous to put yourself in a position where he can’t get to you to help.", "Mild ESH.  You’re pregnant and you’d had issues in your recent past that made showering solo potentially unsafe. Since you’re still pregnant it’s not surprising your husband may still be nervous that you’ll pass out in the shower.\n\nBuy a shower stool rather than a door lock.  That should give him peace of mind that you won’t fall in the shower and get you the independence of a solo shower.", "you’re asking for privacy in the shower and everyone is calling you an AH. am i taking crazy pills? NTA NTA NTA", "YTA- for several reasons.\n1.  You still get lightheaded but not as often\n2. You have a concerned husband which most people on this site don’t \n3. You involved your brother into your relationship \n4. You didn’t talk to your husband first about putting a lock on the door\n5. If the lock is on there and you need help then what?\nYou need to communicate with your husband", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m 15 weeks pregnant and before I found out I was getting lightheaded constantly, especially while I was showering. I still get lightheaded but it’s not as frequent or bad as before. \n\nAt one point it was really bad and I was scared to have a shower so I would ask my husband to either come in there with me or to work from our room so if I needed his help he would be able to hear me. Even though I’ve told him I’m fine now he still comes to check up on me multiple times and generally treats me like I’m made of glass.\n\nWe’ve argued over it multiple times already but he always finds an excuse for why he needs to be in our ensuite the second I decide to take a shower. There isn’t a lock on the ensuite so I can’t keep him out and I don’t want to move all of my stuff to use a different bathroom.\n\nI decided to ask my brother if he could help me install a lock on the ensuite door. I never asked him in front of my husband but my brother told him once he came back into the room because obviously his best friend is more important than his little sister. They laughed about it but after my brother left, we had a fight because my husband doesn’t think we need a lock and that I should’ve spoken to him if I wanted one instead of trying to get my brother to secretly install one behind his back.\n\nI also texted my brother that he’s a jerk and that I should've asked my dad which he sent a screenshot of to my husband to tell him he better give me a lock because I was pouting over it. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Do not do this. My brother died behind a locked bedroom door that had to be broken into by paramedics. He was intensely private and had put a lock on the door that was much more than was needed. By the time my mom realized that something was terribly wrong, he was long gone. He’d fallen and hit his head. You’ve been having light-headed episodes, what if you also fell? Getting into that room might waste precious minutes. Be glad your husband cares enough to look out for you. So many redditors have spouses who are all “eh, whatever”. YWBTAH (and possibly a danger to yourself) if you have the lock installed.", "ESH\n\nAs someone who just gave birth to our 1st born. I understand then husband's can be..... over attached. I think it's just anxiety. Trust me I had to have a few battles with my husband. \n\nThat being said, I think it's rude that you told your husband you want some privacy and he's going straight to the shower when you go to take one and then laugh about it..\n\nBut on the other hand you kind of suck for wanting to get locks. Also just because you don't feel \"as lightheaded\" anymore, you still do. And trust me, as someone whose fainted. It started out as feeling \"not as lightheaded\" it's wrong to put yourself in jeopardy like that and get mad at your husband for something that's genuinely concerning. \n\nLightheadness in pregnancy is no joke. I would say NTA if you weren't pregnant but he's very valid to be worried", "YTA. There is a very valid reason for him to need to be able to get in there — your health. Just because you feel better now doesn’t mean the issue won’t arise again suddenly. You’re pregnant and should *want* to take precautions", "ESH but mostly you. Not only are you completely ignoring the fact that you're still lightheaded, you're ignoring the fact that if you fall, you may be alright but the child may not. You seem to be centering this around yourself when your husbands main focus may be the baby...something that, for all intents and purposes, may be made of glass. This is a matter of safety and you did something that makes it harder to help in the instance where help is needed. You can't ask for help if you've already fainted. \n\nHe's kind of a dick for violating your comfort but in all honesty his concerns are valid. It's not about you, it's about the baby", ">They laughed about it but after my brother left, we had a fight because my husband doesn’t think we need a lock and that I should’ve spoken to him if I wanted one instead of trying to get my brother to secretly install one behind his back.\n\nThis is completely correct.  \n\nYou're going to have a child together.  Both of you need to be able to openly communicate with each other. \n\nYTA", "NTA. If you've told your husband to stop, he either won't because he's overwhelmed with fear, or he's just controlling. Only you know the answer to that, but hopefully he's just ignoring you because he THINKS he's protecting the baby. Even if that's the case, it's not sustainable. Neither is having your bro install a lock.\n\nI would continue to speak directly with your husband and shine light on the issue if it's that important to you.", "You said “stop doing this.” He didn’t stop. Even if his intentions are good, you’re an adult and he needs to respect you. NTA\n\nBut as a compromise, have him install a safety bar in the shower so you can hold on if feeling dizzy. And have your phone nearby and enable hands free calling commands. “Siri, call Husband.”", "NTA, you have a right to your privacy while bathing if you want it. \n\nBeing dizzy for a few weeks is fairly common first trimester, I got car sick with my second child.", "ESH. You’re pregnant. You don’t want to fall in a locked room. Make a compromise with your husband and set up a baby monitor that’s just a radio so he can hear if you need help. I get you want to be independent but this is also very dangerous. It’s not just you that’s at risk.", "NTA for wanting privacy. You said you've told him multiple times and he won't listen. Also, just curious why you needed to ask your brother or dad to do it? Why not just do it yourself? It's a door lock, it's pretty easy to do.", "ESA\n\nWhile I fully understand wanting privacy and feeling like he is treating you like you are fragile, in reality you are more fragile currently. You are still lightheaded and are growing another being at the moment. If you were to pass out, you are no longer the only one who could be harmed.\n\nI also want to bring up if you did get a lock, locked the door, and then passed out. If your husband doesn't hear you fall you could potentially be there for a while, many things could happen in the time it takes for him to get the door open, etc.\n\nMaybe talk and agree to have him only check a certain number of times, get a noise monitor of some kind, or try to find another way to ease both your minds. He is coming from a place of love clearly and is just anxious over all the things that could happen.\n\nA shower seat could also be another option that would be great!", "NTA\n\nJust because you're pregnant doesn't mean you are no longer a person deserving of privacy. If he would have listened to you when you asked him to stop then you wouldn't have felt the need to find a way to lock him out.", "Put a chair under the knob of the door to block it.  Or you could turn the shower spray on him.  (Make sure it's cold and yell \"No! Bad human!\" if you do. You could also start screaming bloody murder if he trys it again. Then follow up with a doctor's note saying the stress this situation causing you isn't safe for you and the baby.\n\nYou might look for a young children's book that explains that entering a room without knocking is rude and give it to him.  \n\nPetty, but it gets the point across.", "INFO What is your husband doing while you are in the shower? You are no longer getting lightheaded so you think there is no danger. What is the issue with him coming in? Is it that he doesn't listen to you in other ways as well?\n\nOn the one hand if he's not in your way it's not a big deal. On the other you've asked him to stop and he won't and that is a problem. What do you say when you ask him to stop and what is his response?", "Maybe tell him that you’ve asked him to stay out but it seems he won’t so you will just wait until he’s not home to take a shower.  It’s safer to do it when he’s there so you could call out for help if needed but since he refuses to give you your privacy you will shower when he’s not home. If he’s sensible he’ll take the “stay out unless I call” option?  NTA by the way. He can be worried about you but still respect your judgement when it comes to your own body and safety.", "NAH - but I really really hope you put some additional thought into “I’ve had issues with fainting, so I’m going to make it so no one can get to me in a slippery area with sharp edges while I may or may not be unconscious and bleeding”. Your frustration is also perfectly reasonable. A calm discussion about what your husband can do to alleviate his own anxiety about the situation without taking away your very needed private time seems like the best compromise to me.", "Com👏un👏ic👏a👏tion👏\nESH he should respect your privacy but he's trying to help, you should have spoken to him about the lock, your brother should have told you to talk about it rather than grassing you up", "I’m gonna go with NTA here.\n\nThe elephant in the room is that it doesn’t seem like your husband has any bad intentions by checking up on you. As an outsider, it seems like he’s getting anxious or otherwise being overly cautious.  So he isn’t an asshole for that.\n\nOn the other hand, boundaries are important.  You relaxed a reasonable boundary, privacy while showering, for a period of time when it was necessary.  If it’s no longer necessary, then reverting back to your previous, reasonable boundary should be respected.  Your husband not respecting that boundary, even with good intentions, makes him an “asshole” (in the context of this sub’s rating system, of course).\n\nWhile I don’t particularly agree with your decision, in that I don’t think I would’ve done the same, I can’t honestly think of a much better alternative. Here, what’s important to draw attention to is the fact that you’ve argued about this multiple times.  He has clear and express notice of this boundary and choosing to violate it regardless.  \n\nI don’t think I can call you the asshole when you’ve set a reasonable boundary and your husband has decided to violate it, regardless of whether your response wasn’t entirely ideal.", "NTA at all, but I still don't think that's a good idea. If something happens while the door is locked it's going to take longer to get to you. The problem isn't the door though! The problem is your husband does not respect your request! Locking the door is something you do to a young child that can't understand or has no impulse control yet. Your husband can understand and therefore is responsible for his behavior! He's just choosing that what he wants is more important than what you want, and that's what you need to deal with!", "Mmm. ESH I think. More you than them, though. Them laughing sucks. Your husband should bother you less. But you can't blame him for worrying about you. Installing a lock without talking to him about it sucks. He's scared for you. You two need to have a serious, long talk about this not go behind each other's backs or to other people.", "NTA \n\nYes your husband is concerned and wants to make sure you're safe but helicoptering over you at every hour of every day is not the right way to do it. If he wasn't going to listen to your request to leave you alone then this was an inevitable conclusion. I think you should've told him you wanted a lock or you should've specifically asked your brother to not mention it, but you're not an ah for wanting some semblance of privacy. Just because you're pregnant doesn't mean your husband gets to invade your space at every moment he feels like it.", "YTA — A lot of married couples outright have one person shower while the SO uses the toilet, and you're over here worried he'll merely be in the same vicinity to make sure you don't get hurt in the shower for very justified reasons. He's also not treating you like you're made of glass, he's showing he's willing to protect your shared baby. He's doing his part in making sure nothing bad happens to the baby that happens to currently be in your body. A body that is justifiably affected by carrying another human being, I might add.  \n\nGoing behind your husband's back to make house changes seems to be a pretty big AH move too, for not working through it with him. \n\nI'm wondering, because it hasn't seemed to be mentioned, why are you in such a state about the situation to where you feel the need for a lock? He's seen you naked, and nothing sexual is going on by his being there, and the shower curtain for privacy still exists... What exactly is wrong? Are you just offended he's treating you more fragile now? Because that sounds like more of a 'you' ego problem, for not admitting that yes, you are a bit more fragile right now, and it's totally okay and understandable that you are. It's also understandable that you would be frustrated by that, just not at your husband. He knows you're not the infant, if that's what you were worried about. Be thankful your husband is that invested in the health of you both. It'll be a huge help when the baby arrives!", "ESH.  Your husband is scared and wants your safety to be a priority.  Learn how to communicate and appreciate that he cares.", "ESH, your husband a little more.\n\nYour husband sucks because you've made it clear multiple times that you want privacy, and multiple times he's ignored you. That's not ok.\n\nYou suck, but less so, because installing a lock against your own husband is a bit drastic especially when done without warning, it escalates rather than de-escalates the situation, plus you force your brother to have to kind of pick sides in your argument by helping you. If you'd done that before asking your husband multiple times, then you'd suck more, but even after multiple occasions you kind of need to find a way to talk to a solution with a partner.\n\nYour brother sucks, for escalating your argument by going to your husband about it, and without telling you he would. That's kind of sucky but then (see above) that's partly your fault for involving him in the whole thing in the first place.", "ESH. You are well aware that you've had issues in your pregnancy, and showers/bathroom is the most dangerous place for accidents. You could easily pass out in the shower and then since the door will be locked, no one will be able to help you. You can't blame your husband for being concerned about your well-being, even if you think you are ok now. Pregnancy is full of risk and issues can arise at any time, any where. And honestly, he's your husband, one of the only people where it's acceptable for him to see you naked and in the shower. Not like someone else here barging in your bathroom and making the lock a necessity. Yes, you are allowed to have privacy concerns and the ability to shower alone, but going behind his back and requesting someone help you physically bar your husband from a room in his house is excessive, and could be stemming from some general paranoia and heightened emotional responses from your pregnancy. Take a step back, breathe, discuss your boundaries with your husband, and have a real, nonconfrontational conversation about how you are feeling, why you think you need to be alone, and what boundaries your husband is crossing that needs to be addressed.", "YTA, he is worried about not only you but his unborn child. You could get dizzy again, he shouldn't have to break down a door if something goes wrong. Grow up.", "ESH you’re still getting light headed and he shouldn’t barge in. Can’t you compromise and suggest he stays in the bedroom next door while you shower so he can be at hand but doesn’t need to come in?", "NTA, you want privacy and he isn’t listening to you in the slightest. And the fact that your brother chose your husband over his own sister is AH behaviour aswell", "NTA. If you aren't comfortable buying and installing a lock on your own then buy a doorstop. One of those little wedges you stick under the door to keep it open but stick it under the door once it is closed. This will stop him from coming in. \n\nThis is more dangerous but more secure than a lock. A bathroom lock only needs a paper clip to open it. There is a little hole in the \"outside\" handle that you insert the paper clip in that will release the lock. If you do faint he would have to break down the door to get to you. It would delay any aid you need. \n\nBut I firmly believe in autonomy. You are an adult. You set a boundary. It was not respected. The ball is in your court now how you want to respond. I'd probably go to a bathroom with a lock on it for safety but entirely your decision.", "So you asked him to be with you while you shower and now want your privacy?\n\nWhat changed? \n\nDid you always lock him out before inviting him in? \n\nINFO", "NTA, and if you feel you need privacy but can't get it, I'd recommend one of these for when you are showering. My fiancee got one for our door and it works great.\n\nhttps://www.walmart.com/ip/Brinks-Commercial-Adjustable-Heavy-Duty-Steel-Door-Security-Bar/37556074?athbdg=L1100", "NTA your husband doesn’t respect your boundaries, and your brother isn’t trustworthy when it comes to anything involving your husband. Get one of those little door jacks. That way you don’t need to install a lock and still have your privacy.", "INFO: why are you asking your brother?", "YTA", "Soft ESH. He's obviously concern and I'm assuming this is your first child? Good you're feeling somewhat better and I understand wanting some more privacy but despite talking about it, he keeps making excuses. My concern with the lock is if there was an emergency that happened you and you did pass out, he wouldn't be able to come in and help. But also he needs to respect the boundaries.   \n\n\nI'm wondering if there is some compromise you could do? Would buying a shower chair be something y'all would be up for so maybe he's feeling more comfortable that you're not standing up and could help you also? Along with the shower chair, is there maybe some pregnancy medical alert device you could have? Like a bluetooth that can alert his phone. So say you are in the shower and even with a chair but get sick and need help, you can access it and he knows to come help you.", "NTA.  You want privacy and I'm sure he can hear you from outside the bathroom.  Your brother is an AH, though. Time for an information diet for him.", "Your brother is TA. I’d stop sharing anything with him", "Info: does he actually coming into the bathroom, or just the bedroom? Are you ok with him being in the bedroom while you are in the shower? You mention you aren’t getting “as lightheaded”, but still lightheaded. That could change, and I think your husband is just worried about your and the baby.", "NTA.\nOP asked husband to stop coming in when she showers, and he didn't listen. \nWhen she asked someone to put a lock on the bathroom doors, he laughed and yelled at her about it.\nOP, make sure that your doctors know exactly who you want and when, when you're in labor", "NTA why can't your husband just knock on the bathroom door to ask if you're okay without coming in?", "If you were her husband divorcing her would be the best thing you could do for her, since it seems that you have no concept of respect for your partner.", "You are ridiculous. He is a first time dad worried about his pregnant wife who has had pretty glaring safety concerns and his unborn child. He never had this issue with boundaries before.", "Wtf where did this come from. I think you’ve - at best- misinterpreted or at worst youve just added in this whole ‘scared of your husband’ for drama. She specifically states she was scared to have a shower due to the lightheadedness and ASKED hubs to check in on her. Now the issue is he’s STILL checking on her, and by OP’s own admission the lightheadedness is still there. \n\nGet over yourself", "He can be worried outside the bathroom.", "Agreed.  She was getting lightheaded my wife when pregnant had similar issues that went away and then came back.   He's trying to be a supportive husband and also sneak a peak... as all husband do.", "She told him she's okay now, so it sounds like he's just perving on her now.", "He can’t just yell you good from the other side of the door?", "She’s asked him to stop coming in and he’s ignoring her. I guess since she had an issue in the past she now forfeits her right to privacy until he decides she can have it back?", "I totally agree with you. So weird to see the other comments calling OP AH when OP wants a physical barrier to her husband to feel safe in her own home.", "I don't know this is a weird one. I poop while my wife showers sometimes we got that special special bond. I don't think anyone's a true asshole. It's just weird.", "She’s been trying to communicate and tell her husband to stop. He wasn’t listening.", "He can wait outside. She has asked him to stop coming in, and he is ignoring her.", "I suffer from low blood pressure and have fainted in the past as well as seen other people fainting (because low blood pressure runs in the family, plus I have a brother with a phobia of needles). In my experience you can't call for help before fainting because you just kinda go limp and black out all of a sudden. At most, one time my brother went \"I don't feel well...\", and bam, passed out. But usually it just comes without warning.\n\nThis is why locking yourself in the bathroom while you take a shower has always been forbidden at our house growing up and I still don't do it now - it's dangerous, the shower/bathtub/bathroom is one of the worst places to have an accident in, and people need to be able to check on you and help you immediately if you're someone who's prone to fainting, slipping or having balance issues.", "She had told him many times not to enter the bathroom when she’s in there. He has ignored her request. He’s the asshole, and so is her brother.", "I tell u not to come into bathroom. \n\nU keep doing it?\n\nSounds like wife has been communicating and husband  not listening", "What do you not understand about OP ASKING for privacy? She did communicate, multiple times. Her husband isn’t getting the message so no, she is NTA.", "Inseminating someone does not allow you to supersede their privacy and bodily autonomy. Full stop.", ">Put a chair under the knob of the door to block it.\n\nBrilliant idea, so now if she does faint and becomes weak, he'd have to call the fire department to get her out and to the hospital. Possibly losing the child in the process.\n\nVery well thought out ideas you have here. Have you been responsible for anything beyond a goldfish?", "Yeah that’s a great idea. Then they’ll need the fire dept if she passes out, good call", "She has asked him to not come in. She has communicated. He ignored her. Why keep trying if he’s going to disrespect her anyway?", "This is the comment I was hoping for.", "She has told him to stop coming in. He hasn’t.", "Maybe she just wants some privacy? Maybe she went behind his back because telling him to his face wasn’t working.", "Guess she forfeits any privacy rights she had until he decides to abide by her wishes that he not come in.", "Basically\n\n1 - Hormones make brains work in mysterious ways.\n\n2 - They could just shower together, idk.", "Agree with all of this.\n\nOP say you get a lock and then something does happen, how would you feel.\n\nYou need to explain to your husband that you want some privacy, but a good compromise would be for him to stay in your room just in case.\n\nHe's probably just anxious, would you rather he didn't worry at all.", "Then he needs to stop coming in constantly when it isn’t required. Then a lock won’t be needed.", "Just because she is pregnant doesn’t mean she’s not entitled to privacy.  She is not an incubator. She has tried to set a boundary and he is repeatedly ignoring it.", "OP literally said she was getting lightheaded which is why she originally asked her husband to help. Now she’s better and wants privacy.\n\nWhy does it matter what changed? She stated why in the post. She is entitled to have her privacy when she asks for it.", "Yes. I don't get as lightheaded as I did when I asked him to be there now and when I do get lightheaded it's not nearly as bad so I don't need help anymore or him checking up on me constantly. \n\nThere's no lock so I've never locked him out but he also wouldn't constantly walk in for no reason in the past like he does now.", "I know my husband would've said no if I had asked him and I have no idea how to do it myself.", "I think that the shower chair is the best solution. In my experience I've never been able to call for help before fainting so I don't know if the medical alert device would be useful. But sitting down while showering is a great idea. \n\nAnd she needs to stop locking herself in the bathroom. It's very dangerous. She could faint and hit her head or other body parts and he wouldn't be able to get to her quickly. I get reinforcing boundaries but there are less stupid ways of doing that.", "He comes into the bathroom. I don't care if he's in the bedroom while I shower. It’s fine for him to be worried but I don’t think it’s fine for him to come in multiple times after I’ve asked him to stop.", "Best thing for me too I would go get somone who actually loves me and is not afraid to show their naked body", ">He never had this issue with boundaries before\n\nWe don't know this.  \nIt could be a bad situation or it could be just a good husband overreacting.\n\nI'm definitly more on the cautious side but it definitly is not nice, that they are laughing about her need for privacy", "If she locks herself inside the bathroom how is he gonna get to her even if she manages to call for help before fainting (which, and I speak from experience, is unlikely)?", "I love how all of your responses are fixated on \"stay out\" type mentality.\n\nOp literally displayed light-headedness and raised the concern with her husband. She may think it's all done with now but unless this is her 4th kid and every single one has been the same experience, she has no way of knowing if she's going to have issues again.\n\nNow should he be in there MULTIPLE times each shower? Not at all unless op is taking a extremely long shower. But checking up once or even just a simple head pop into the bathroom for a \"hey hun everything all good?\" Isn't something to be mad with. Hell some people wish someone else would give a fuck like that.\n\nYes op is entitled to privacy and if her husband is constantly stepping on that she has the right to ask for him to dial it back. But he also has every right to be worried or concerned about her AND THEIR UNBORN CHILD as many things can occur in a very short period of time.\n\nPersonally my wife got covid and mostly suffered from dizy spells and light-headedness. When she asked me to be aware of this and keep an eye out that's what I did. If she was alone somewhere for a long period I checked on her, before she got up to do things I got up to be close by in case something happened.\n\nWhen she felt better and no longer had those symptoms I trusted her to tell me if she was feeling it again, but I still looked out for her awhile after that. I wasn't always hovering or invading her space but I was there and she was aware I was ready if something happened.\n\nIt's just called caring for your partner, now if ops husband is just coming in everytime she's showering, ripping open the curtains to take a look then leaving, that's when I'd get where she's coming from on wanting a lock. \n\nBut I'll be honest op you sound like a fool to be getting a lock just so your partner can't come in, because heaven forbid you ever need them to come in and now you've stopped them from getting to you in a reasonable time.\n\n OP I have no judgment for you aside for this being silly, if he's just looking at you naked he can knock it off, and you can grow up considering YOU MADE A CHILD WITH HIM, getting a lock on the door is dramatic and will only further cause issues with you both primarily if the reasoning behind it is to stop him. Not only that if you should happen to fall or experience the spins or anything while locked in there he's gonna have to break the fucking door down to hope to help the woman and child he loves.\n\nTalk with your husband, figure out if this is him being worried or him being a perv, if he just wants to know you're okay then you guys need to find a compromise, if he just wants to see you naked tell him to knock it off and show him a tit once in awhile or something.\n\nY'all act like you're negotiating with a terrorist when talking to your own spouses wtf. Why did you make a life together if you can't handle a conversation.", "Are you saying that, as a husband, you get to invade her privacy to sneak a peek? Gross.\n\nYes, safety needs to be addressed. I recommend commenting on that.", "Seriously?  So she’s 100% sure it will never happen again?  Sorry, she’s an idiot who has no idea what might happen in the future and is endangering herself and her unborn child to keep her HUSBAND from popping in now and then showing love and care on his part.  Good grief, my husband and I are almost ALWAYS in the bathroom at the same time.  It is totally weird to think that husband coming in is “pervy”.", "That’s fair. But she’s still being an AH by going around him like this to make a change to their home. I could see ESH, but there’s no getting around her being an AH.", "Every single fucking time a woman posts on Reddit about how she tried repeatedly to communicate with a man and he just ignored her and kept doing it, all the comments are like \"you're not communicating! You need to communicate! You can't blame him because YOU didn't communicate!\"", "What kind of marriage is this where the wife needs utter privacy while showering?  Maybe after she has kids she’ll see that privacy in the bathroom is a thing of the past.  It’s just totally weird to me to even expect that your spouse will stay out of the bathroom while you’re showering.  Usually my husband is in the bathroom while I’m showering (and vice versa) because we BOTH have to get ready.  This is not some big “violation”.", "\"stop\" and an actual conversation are two different things.", "Sounds like he’s just worried about you.\n\nSince there’s no lock just tell him you’ll call if you need him, or leave the door slightly ajar as a compromise. \n\nI can see both sides. Communication is key, but how easily that key works is 99% the delivery.", "Consider if roles were reversed. Would he be uncomfortable enforcing his boundaries? Would you feel comfortable disrespecting his boundaries? \n\nOf all the people in this whole wide world, above everyone else, your SPOUSE should respect your boundaries. You are under no obligation to maintain a relationship with anyone who does not respect your boundaries.", "You have bigger problems than a lock on your door, but, uh, a six year old could figure out how to swap doorknobs.   Pro tip, you can find videos on youtube on pretty much ANY minor home fix it job.     But as far as a lock on the knob?   Unscrew.  Put new knob in hole.  rescrew.", "Ur husband is disrespectful of u", "If he stops barging in then she won’t need to lock the door!", "Did you just graduate junior high? A stable partnership usually entails seeing each other naked. That's how grown ups do it. \n\nSafety is more important than her slight discomfort. She'll live.", "Redditor thinks sneaking a peek at your wife is wrong wait until she find out I watch my gf naked anytime I want and even touch her whenever.", "She's uncomfortable with it. In fact, what if becomes a safety hazard? He comes in, startles her, and she slips? Just because it's normal for you doesn't mean it's normal for everyone else. You seriously think she's not worried about her baby? That's why she asked her husband in the first place. But she's feeling better now and seems to know her own body. A healthy  marriage has boundaries. She let him know hers and he crossed them.", "It's a new doorknob, not an addition on the house. There absolutely IS getting around her being an AH. She's a person who wants to be able to shower alone and communicated that desire very clearly, it's INSANE that you think that makes her an AH.", "She’s going around him because he isn’t listening!", "She can’t make changes to their home? She can’t shower unattended, is she his prisoner?", "Nice to know that you’ve decided you represent everyone.", "My mother always had privacy washing when I was a child growing up. Bathroom doors had locks, and we all used them and respected one anothers privacy. Not everyone is free and easy when it comes to using the loo or washing. I would have been given shirt shrift if I had expected to join her as a child.", "You're right. If you're a wife or a mother, your body belongs to your husband/children and you no longer deserve the basic right of privacy. Even asking for it makes you an AH", "So, she’s married and has given up any right to privacy she’s ever had?", "Telling him to stop at is all she needs to say.", "Since when do you need a dissertation to get basic privacy? Do you think stop is enough to stop sex, or do you need a conversation for that as well and if you don't get one you can do what you want? It's her body. She doesn't consent to being seen naked. That's it.", "He's barging in because he's worried. And I agree. The shower is one of the most dangerous places in the house for someone with low blood pressure or other issues that cause fainting/balance problems/slipping etc, and it's even more dangerous for a pregnant person. And it seems to me that she's downplaying the risks and not taking his fears seriously.", "Sorry, still think it’s weird, and weirder still to ask brother to install a lock.  Pretty sure she could google a video.  I’d laugh at her just for that alone.", "Doesn’t matter. She’s putting herself and their baby in danger.", "You’re welcome.", "If I was downplaying the risk I wouldn't have asked him to come in the shower with me in the first place.", "If he stops barging in then she wouldn’t need a lock!", "So ESH, cool. Glad we can agree."]}