{"id": 6993, "submission_id": "108ap2v", "title": "AITA for what I wrote to my friends wedding?", "selftext": "Alright so I, F25, have been friends with the bride that we'll call Claire, F25, since we were in high school. We weren't best friends but we were pretty decent friends and enough so that we stayed in touch afterwards and I got invited to her wedding. Now I only got invited, I wasn't in the bridal party at all or anything and all I had to go off of was that I couldn't have a white or cream colored dress, which is fair and understandable, I'd never think of wearing anything close and have seen enough stories of how that can go completely wrong. \nI chose to wear a black dress that was strapless and showed off the shoulders but was still tasteful and what I felt was appropriate and I didn't think there would be any problems with it, I even sent a pic of it to her but never got a response so IDK if she even received the message. Come the day of the wedding everything is fine up until the reception when the bride comes up and tells me that my dress is inappropriate and that I shouldn't have worn it. She said it was untasteful and I honestly should have known better. I told her that I sent her a picture and she said that she hadn't seen it. She says that I'm just looking for attention and that I'm an asshole for it. We went back and forth for a bit before I just decided to leave as I didn't want it to go farther but I'm curious AITA?\n\nEdit: I will say I was the only one in strapless and in black, other than guys in tuxes of course, and my dress was shorter than everyone's only going to my knees and not to the floor. As well looking back on the invite it did say keep dresses traditional and floor length", "created_utc": 1673359685, "permalink": "/r/AmItheAsshole/comments/108ap2v/aita_for_what_i_wrote_to_my_friends_wedding/", "score": 181, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because I wore a black dress to my friends wedding and even though I sent a picture she never responded so I never got confirmation it was good.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. The invitation specified the attire, which was a long, traditional dress for women. You completely ignored that.", "YTA - the edit says that the invite said floor length dresses which you chose to ignore", " YTA\n\nYour dress\n***\"my dress was shorter than everyone's only going to my knees and not to the floor.\"***\n\nWhat the invite told guests to wear.\n***\"As well looking back on the invite it did say keep dresses traditional and floor length\"***", "YTA because of the edit, you didn't follow the dress code!!", "YTA. The edit is super important and it looks like most of your NTAs came before you added it. You didn’t follow the requested dress code and you expect that everyone will turn the other cheek because it’s “cute and wedding appropriate”.  No. You messed up and you upset your friend, yet want people to agree with you here. I’m pretty sure that isn’t going to happen though. Apologize to your friend & make sure to actually look at the invitation before you attend your next wedding.", "YTA.  You read the invite.", "YTA for two reasons:\n\n1. Lying in your post. You went from \"I didn't know about the dress code (except no white)\" to \"I knew about the dress code but wanted to wear my dress anyway.\"\n\n2. Deliberately disregarding the dress code.\n\nWere it not for the dress code, I would have said that that dress was fine for a wedding (I don't agree with the comments about not wearing black to a wedding, as long as the style is appropriate).", "YTA if the invitation said floor length, that means floor length.", "INFO, we gotta see the dress.", "> I will say I was the only one in strapless and in black, other than guys in tuxes of course\n\nI am laughing at the idea of men in strapless tuxedos.\n\nThat said, the invite specified a dress code, and you didn't follow it.  YTA", "YTA just for not double checking the invitation to make sure what you were wearing was appropriate.\n\nBut you probably didn’t have bad intentions. I always thought you couldn’t wear black because it’s not a funeral but then men are allowed to wear black suits and google says you can, so who knows!", "YTA  \n\n\nyou ignored the dress code", "YTA. Edit: Originally I had read this as the OP being part of the wedding party, and that makes it even worse that she wasn't. Guests have three expectations: bring gift, be on time, follow dress code.\n***\n Like it or not, being part of the wedding party requires following a dress code unless the bride specifies - I asked my bridesmaids to wear whatever they liked as long as it was black, for instance.\n\nShould the bride have paid more attention? Sure, but she's also paying attention to five dozen other dumb things. You should have paid more attention, and to be honest, your list was way shorter.", "YTA. There was a dress code that you failed to comply to. It doesn’t matter whether you thought the dress was ‘cute’ or you’ve worn the dress to other weddings with ‘stricter’ dress codes. You were the only one dressed inappropriately, you probably stood out like a sore thumb.", "Depends on how people normally dress for weddings in your group.  Were you the only strapless dress, the only black dress, the only person not wearing a fursuit?  Can't really make a call without knowing the local customs.", "INFO: a black dress to a wedding?", "Well looking at all the facts supplied is say YTA. you didn't notice where it said traditional dresses, where that isn't over and you wore it to a church wedding during the day time with an evening dress", "WRT your edit: YTA.", "Yta you literally didn't follow the given dress code.", "YTA at your age, you should know how to read and write", "You're the asshole.  Your edit shows you knew better and you have comments in here where you said you thought the dress code was a \"suggestion\"...WTF??\n\nYTA and you should be fully aware of that at this point.", "YTA.  Your dress is cute.  I don't think it's an inappropriate dress to wear for a wedding - but the invitation specified the dress code and you ignored it.", "YTA. \n\nThe invite says floor length, so wearing a dress to the knees was not appropriate, the end. \n\nIt doesn't matter if you wore that dress before or have seen similar dresses at OTHER weddings. The dress code was very clear, and you purposefully broke it, and seem shocked that your deliberate actions have consequences. \n\nWedding attire can be confusing- what is appropriate for day, for night, for the venue, is black okay (sometimes it isn't), etc, etc. BUT, in this case, it was so clearly spelled out- FLOOR LENGTH- that I'm not sure how you are the least bit confused that a short dress didn't fit the code.", "YTA - Originally you were NTA but since you did not follow the dress code YTA for it.", "> the invite it did say keep dresses traditional and floor length\n\nYTA\n\nI was always taught that you don't wear white, black or red to a wedding, and that you shouldn't wear a strapless dress unless you are a bridal party member and the bride has asked you to.", "In my country you would be YTA - you never wear black to a wedding! (its' for funerals)", "Very soft YTA only because you said the invite did specify traditional full-length dresses and you wore a very cute dress that unfortunately didn't meet either requirement.", "YTA Because you either can’t read or felt that making it about you was more important than being respectful and following the dress code. You’re simply another pickme girl. Grow up", "You are an adult. You are well in to your adulthood - you can take some responsibility for yourself. It is not the bride's job to vet your clothing - it is your responsibility to wear something appropriate to whatever event you are invited to.\n\nINFO - Tell us about the wedding. What time of day was it, and where was it?\n\nIn general, black isn't an appropriate choice for a daytime wedding, where brighter colors and prints would be appropriate. If it was an evening wedding, and the men were wearing black tie, then a black dress could be appropriate.\n\nIt sounds like you're suggesting that the bride thought your dress showed too much skin, so I suppose we're talking about how much cleavage this dress shows, and perhaps how tight it was. That's going to depend on the norms and customs of the wider community from which the bride and groom come. If it was a church wedding, some churches expect women to cover their shoulders in church.", "What did the dress code say?\n\nETA: it's sad I'm being downvoted because I asked a question BEFORE the OP edited the post.", "Black is traditionally a colour to wear at weddings if you disapprove of the wedding. Though it's not really as practiced as much anymore or at that's how it is here where I live. if they cared, I'm sure they should have told you. \n\nI've worn black to weddings, my bridesmaids wore black. Nta", "NTA\n\nI saw the photo of your dress and could not name anything about it that seems inappropriate? You also messaged her which was courteous but not necessary. Your friend seems the type to seek drama if she's that worried about what you're wearing on her wedding day. I had a beach wedding and a friend showed up in a bright blue short suit with flamingos on it and I encouraged it. Weddings are supposed to be fun eesh.\n\nETA: everyone down voting me- my comment was before OPs edit. I went on the info I had. But I still don't think it's a huge deal.", "N t a  - you followed the instructions on the invite to a T (per one of OPs comments), and if she wasn't going to bother to look out for questions on attire then she should have been more specific. \n\nUnless by \"strapless and tasteful\" you mean it was a fishnet bodystocking. Then you crossed a line.\n\nEdit: Never mind all that.", "Your friend sounds high maintenance and insecure. She should have been more specific. Perhaps you were there to “make up the numbers” and she felt upstaged because you looked gorgeous. NTA. You did right to nope out of there.", "NTA - your dress is wedding appropriate", "NTA   Clearly Bridezilla needs her spotlight. I'm sorry to went to all that trouble for this headache.", "I think you're N TA, as what you wore is perfectly normal nowadays, but there are people who object to bare shoulders in church, and traditionally black would be a no no for a wedding, as it's meant to be a colour of mourning.  That rule isn't really followed anymore though, so I think you're fine.\n\nEdit: changing to YTA for not following the dress code, and not including the dress code in your original post!", "Obviously the rule about not wearing white to a wedding is well known.  I’ve heard the thing about black being an indication of disapproval, but it is not common knowledge.  Black is so versatile and flattering.  I’ve seen countless black dresses at weddings.  I’ve also heard that wearing red can be considered rude because it’s too loud and/or indicates that the person wearing red has had a romantic history with the groom.  It’s all pretty antiquated.  Showing your shoulders…idk…I guess that could be a cultural concern, but I think if you’re going to nit pick, then you should specify “modest” or include more specific instructions.\n\nYou went to the wedding and I assume you gave a gift.  That, to me, is a show of support for the union.  It seems like the bride is splitting hairs here, as I would argue that the good manners of being a gracious host should supersede her need to call out a perceived slight.  If she is so offended, then she should return your gift.\n\nEdit to change verdict to ESH", "NTA - would help to see a picture of the dress, but I can't imagine it was THAT bad.  Plus, what type of person would confront A GUEST at her wedding about something like this?  Isn't she supposed to be on 'cloud nine', not criticizing the guests?", "After seeing tbe dress, absolutely NTA. I cannot even imagine what the bride is on about. Perfectly appropriate.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAlright so I, F25, have been friends with the bride that we'll call Claire, F25, since we were in high school. We weren't best friends but we were pretty decent friends and enough so that we stayed in touch afterwards and I got invited to her wedding. Now I only got invited, I wasn't in the bridal party at all or anything and all I had to go off of was that I couldn't have a white or cream colored dress, which is fair and understandable, I'd never think of wearing anything close and have seen enough stories of how that can go completely wrong. \nI chose to wear a black dress that was strapless and showed off the shoulders but was still tasteful and what I felt was appropriate and I didn't think there would be any problems with it, I even sent a pic of it to her but never got a response so IDK if she even received the message. Come the day of the wedding everything is fine up until the reception when the bride comes up and tells me that my dress is inappropriate and that I shouldn't have worn it. She said it was untasteful and I honestly should have known better. I told her that I sent her a picture and she said that she hadn't seen it. She says that I'm just looking for attention and that I'm an asshole for it. We went back and forth for a bit before I just decided to leave as I didn't want it to go farther but I'm curious AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Invite had a dress code. You either follow dress code or don’t go.", "YTA that dress is completely inappropriate yet you wore it anyway. The only thing you did right was leave", "YTA for not following the dress code that was made known to everyone. That said, I find it goofy to put those sort of restrictions on what guests wear. No cream/white or anything that can be mistaken as a bridal gown or mistake one as part of the bridal party if they aren't I get, but the requirement that dresses *must* be floor length and \"traditional\" seems a tad over the top to demand of guests.", "YTA because you knew the dress code. That said it is a nice dress", "Lmao YTA. You disregarded the dress code because you felt the dress was cute enough to disregard it. She’s right, you are an attention seeker. You don’t just get to ignore the stated dress code because you feel like it. It’s a basic black dress, nothing special. If you wanted black so bad, get a floor length one that isn’t off the shoulder.", "YTA there was a dress code you broke it.", "YTA, there was a dress code and you ignored it.", "YTA. Black Tie is very strict and it seems like they spelled it out for you.\n\nAs someone who actually went through protocol school, take this as a learning lesson. The hosts of black tie events typically DGAF how \"cute\" you think you look, they will ask you to leave if you're not appropriately dressed.", "YTA", "Your outfit matched what high end call girls in Vegas wear.  Your remind me of a lady on Tiktok that wears fully covered but skin tight and complains why HR yells at her.", "NTA…certainly if it wasn’t floor length, then it didn’t comply with the dress code—but I can’t imagine as a bride on her wedding day confronting someone about their attire unless their pink parts were showing and making a spectacle.  The bride could have waited and made a snarky comment about it after the fact, maybe over a glass of wine, but it’s not like it ruined the wedding.", "I'm curious, i don't own a floor length dress and i'm not going to buy one for one wedding. Am i supposed to not attend?", "YTA\n\nDress code was on the invite. Your fault for not reading thoroughly.", "YTA you didn't follow the dress code. Doesn't matter if your dress is cute or that you didn't read the dress code. And you are definitely an AH for arguing with the bride about it", "NTA, you tried to clear the dress before-hand. Technically you could have done a more thorough job of getting a signoff, but you made the attempt. Honestly I think your friend wouldn't have been ok with any dress you wore...", "NTA. Nothing wrong with classic black dress. You just ran into a bridezilla .", "NTA when you said strapless I was expecting a much more revealing bride/bridesmaid style dress, yours is more ‘off the shoulder‘ and is both gorgeous and perfectly appropriate for any wedding I’ve attended.", "NTA. I’m really curious what this dress looks like that would warrant her response. Was it short? My bridesmaids dress for my sister’s wedding was strapless. Really the only thing you could have done was maybe follow up when you didn’t get a response.", "First instinct: NAH. You tried to reach out and got no response back. Maybe life, or wedding planning, got in the way. \n\nHowever, some details about the wedding are lacking. Maybe the OP didn't know or the bride didn't communicate her wishes effectively. Besides \"no white or cream\", what time of year was it? What was the dress length? Was the wedding religious or conservative? Was it daytime/afternoon/evening? Indoors or outdoors? Was there a theme? How where other guests dressed in comparison? OP doesn't need to give all these details, but thinking back on them might answer some questions about why the bride reacted the way she did. Weddings seem to have all of these  \"rules\" (I don't really get them) and people tend to get very sensitive and freak out when they think the \"rules\" aren't followed. OP seems to have made the most with the information they had: NTA. The bride seems to have reacted out of wedding-related stress, NTA... but not justified to call OP one. \n\nOpinion: I think a true \"bridezilla\" would have specified exactly what kind of dress code was allowed, down to color, dress length, cut, style, shoes, etc...", "You looked lovely and understated to me. She ruined her own day. NTA", "NTA. The invite told you to try to clear it with the bride. She shouldn't have put that on the invite if she wasn't prepared to watch for inquiries and respond in a timely manner. Even when she objected, far too late, she didn't provide enough information about what you \"should have\" known to avoid upsetting her. \"Untasteful\"? What does that even mean? It could mean too formal, not formal enough, wrong color, too flashy, too revealing, not her personal favorite style of cut, not from this year's runway shows, who knows. If she had one of these as a criterion, it was her responsibility to say so before a guest shells out hundreds for their dress and innocently shows up attired in what is otherwise perfectly respectable cocktail attire. Getting mad at a guest for not reading her mind is a her problem. I hope you had a nice time despite that encounter. You did nothing (knowingly) wrong.\n\nCaveat: by any chance did you supplement this dress with flashy accessories? Diamond encrusted tiara? Fascinator made of 4-foot peacock feathers? Pretty Woman thigh high stilletos? Etc?", "[deleted]", "wtf after seeing the dress absolutely NTA it is absolutely appropriate and not revealing in any way", "NTA. People think because it’s their wedding day they don’t have to follow everyday common courtesy and respect. She was way out of line with her confronting you like that. Unless you wore a clown suit to her wedding she had no right to talk to you like that. Especially when there’s nothing wrong with the dress you wore. With that being said I hope you two can get over this silliness and maintain your friendship. The older we get the harder it is to make friends so value the ones you have and be patient with them and their lunacy unless they are abusive a-holes, of course, aint nobody got time for dat!", "NTA. I would at that “the Little Black Dress” has been a traditional thing in culture long enough to have it named as a thing makes it acceptable for “traditional” dress code.\n\nBut I am a guy, so what do I know?", "NTA. you even made the effort to make sure it was okay. however, we need to see the dress. i’ve seen other AITA wedding dress stories and an actual photo/link of the dress adds a lot of context.", "NTA - ok so there was a dress code and you made a mistake. Not the end of the world. I will never understand people who get so bent out of shape over guest attire at a one day event like this. You weren’t wearing a wedding dress yourself and you weren’t dressed in a way that would be a jail able offense.", "NTA. Dress code? Jeez, are yall in high school?", "NTA because the invitation said to ask the bride if you have questions and she didn't respond. But I would have brought a sweater or wrap to wear over it. Being in a dress more revealing than or as revealing as the bride's is probably a bad idea. I would avoid strapless and/or backless.", "NTA, probably should have stuck with the dress code but dress codes are petty and who would care enough to call out a guest like that after the wedding.", "I believe her profile has the poc of the dress. She posted in r/Amicute about an hour ago", "But the dress is cute and wedding appropriate", "Well I thought this dress was cute enough to disregard that part.", "Yeah my original judgement was on the basis she'd followed the dress code . It's hard for her not to be given a YTA judgement now .", "Based on another comment from her, she did see the dress code before the wedding but decided that her dress was \"cute enough\" that she could ignore it.", "Yeah OP. It’s hard to judge without a photo", "https://www.reddit.com/user/sydneytheslothette/comments/108aqrd/dress_in_question_for_aita_post/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "Lmao I definitely didn't mean to word it like that but that does seem like a hilarious idea.", "I suspect if she had worn a more formal black gown she would not have gotten called out.", "She said it was cute so thought it would be ok", "> being part of the wedding party\n\nShe was a guest, not a member of the bridal party.", "I was the only one in strapless and in black, other than guys in tuxes of course, and my dress was shorter than everyone's only going to my knees.", "Yes a black dress to a wedding", "She has commented since then and said she read the invite and just decided to ignore it because she thought the dress was \"cute enough\"", "In the US it's totally normal now.  I wore black 20 years ago, and it was even fine back then especially for night weddings.  I never understood how black tuxes are okay for the wedding party, but black for women is a sign of unacceptance of the wedding. \n\nMy niece just got married and she included suggestions like Little Black dress, so she didn't get young people in jeans.  Every one of the  20's girls wore black dresses because every has one.", "Why the \"very soft\"? OP said that she knew the invitation said floor length, yet she thought her dress was cute enough to ignore that part.  She's a full fledged AH, not at all very soft, imo.", "What the heck is a \"traditional\" dress unless it's some kind of national costume?", "> It sounds like you're suggesting that the bride thought your dress showed too much skin\n\nEverything below the hem, according to this, was too much skin...\n\n> the invite it did say keep dresses traditional and floor length", "It was a church wedding and it was around 1:00 pm", "No white or cream colored dresses and I should check with the bride if I had any questions", "OP left out that the dress code was traditional floor length dresses, and in another comment she said she disregarded the dress code because she thought the dress was cute. YTA.", "This is one where I feel like information provided on the wedding invitation is essential. If it spelled out the dress code and she tried to get around it by texting, then she is. If no dress code was set out then nah. But I have a feeling it was", "Is it? In my fifty plus years, I’ve never heard this.", "Oh interesting! I've never heard of that.\n\nI've read that you shouldn't wear it because it's usually a colour for mounting - but I've never met anyone who disapproved of it irl. But I think it might be depending a lot of the community and area.\n\nI agree though, Op: you even sent her a picture to ask beforehand. If they had an issue with bare shoulders or black dresses, they should have put that in the dress code. \n\nFor what it's worth: I've worn black dresses to all weddings I've been invited to, and nobody ever had an issue with that.\n\n\nEdit: yeah, after your edit, OP, I have to say. If the Dresscode asks for floorlength... This is inappropriate. YTA.", "I've never heard that in my life. If that was ever true, I don't think that's a widely held belief at all these days", "The edit says that the invite specified a dress code of traditional and full length. Otherwise I'd say N T A too.", "OP has shared a photo. If that is the photo she sent to the bride, you can not see the hemline. It could stop at the bottom of the photo or be floor length. The bride may have assumed it was floor length, as she had specified \"keep dresses traditional and floor length\" in the invitations.", "OP did not follow the instructions. OP edited the post and said the dress code was traditional and floor length dresses.", "I was thinking the same. Def NTA.", "Not when the dress code says \"traditional floor length dresses\".", "You may have posted before OP added that she knew the dress code was \"floor length, traditional dresses\" but thought her LBD was \"cute enough\" to wear anyway.", "Here's the dress https://www.reddit.com/user/sydneytheslothette/comments/108aqrd/dress_in_question_for_aita_post/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "The wedding invite said floor length traditional dress for women. OP said: \"Well I thought this dress was cute enough to disregard that part.\" in one of their comments. That's why the bride was upset.", "It was a 1pm wedding in a church. I’m guessing it was a religious wedding which makes the traditional floor length make sense and it makes OP and even bigger AH.", "The photo she is sharing doesn't show that the dress ISN'T floor length. It seems as if she was trying to deceive the bride into \"approving\" it.", "Even if the invitation said \"traditional floor length dresses\"? This dress is neither.", "The dress https://www.reddit.com/user/sydneytheslothette/comments/108aqrd/dress_in_question_for_aita_post/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "She has edited the post to say that the invitation said dresses should be traditional and floor length. The picture she has linked in comments shows a very flirty, short, casual dress. To me she is the ah here.", "The *problem* was that the dress code was floor-length dresses and OP's is knee length.", "The dress code was floor-length dresses. This photo doesn't show that it stops at the knee.", "So if someone says you must wear green to the party, you can come wearing purple because the STYLE is \"appropriate for a party\"... (but not *this* party)?", "The bride is upset that the dress isn’t floor length. OP edited their post.", "https://www.reddit.com/user/sydneytheslothette/comments/108aqrd/dress_in_question_for_aita_post/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "Op literally said though she thought it would be okay even though it didn't follow the dress code because it's a cute dress.", "But it isn't floor length, and the photo she is sharing doesn't make that clear, because it is cut off above the hemline. Even if she SAW the dress, the bride may have assumed it was longer.\n\nThe invitation said \"ask the bride\" but also said \"floor length\".", "[deleted]", "I think she deleted it.", "Dress code indicates a level of formality of a wedding. Not following the dress code is considered disrespectful and a social faux pas.", "If the wedding didn't have a dress code, sure. But this one did. So that's why YTA. It's not that it's an inappropriate dress for weddings in general, but it's inappropriate for weddings that have a formal floor length dress code", "It's not wedding appropriate if the invite specifically says something else. \n\nThey could throw a clown wedding, and if you showed up in *any* dress it would be considered inappropriate.\n\nYTA. You figured you could slither around what their invitation said and you got called out. The least you could do is take responsibility and apologize.", "That confirms it, your sister was right. You just like attention", "Not for a wedding that *specifically stated* long traditional dresses for women - it was highly inappropriate for that.", "the invite TOLD you what is \"appropriate\"... it did say keep dresses traditional and floor length", "That makes you T A and the bride rightfully called you out on it, too.", "Hang on, were you aware of the dress code? Your edit implies that you had another look at the invite after the event and saw the comment about floor length and traditional. Are you now saying that you had seen those comments but decided that you liked your dress enough not to care?", "hahaha yeah... and THAT'S why YTA \n\nYou give off strong r/notlikeothergirls vibes here\n\nRules and respect don't apply to me because I'm \"cute enough\" \n\nHoney... you ain't *that* cute.", "Cute enough?  Are you that immature, that cute enough trumps the rules?  YTA", "AKA “I look good in this dress so fuck your dress code, I’m special and it doesn’t apply to me.”", "It’s not your wedding to choose what you should or shouldn’t ignore. You come across with your responses as self centered.", "You don't disregard dress codes lmao", "You thought YOU were \"cute enough\" in that dress to disregard that part.", "Pull your head out of your ass and stop making it about you", "Wow. The arrogance.", "are you aware that the dress code isn't based on ensuring people wear cute clothing?", "Are you used to getting away with behaving outside the rules because \"you're cute\"?", "That makes you even more of an AH. Disregarding the dress code because “the dress was cute” is giving pick me vibes.", "I agree with you. It's a great dress and you looked lovely.", "Ugh, even worse!", "https://www.reddit.com/user/sydneytheslothette/comments/108aqrd/dress_in_question_for_aita_post/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button", "[deleted]", "That honestly looks fine. It's a cute cocktail dress. Sometimes brides feel they're being upstaged if anyone looks else looks too good at their wedding. I would just let it go for a bit, maybe she'll realize she took it a bit too far after the wedding and things have settled down.", "That is actually an off the shoulder dress. Unless the dress is extremely short, it’s fine & looks nice.", "I misread. Still, guests have an even shorter list of expectations, no?", "Are you not like other girls?", "Ok, that would be a very definite faux pas for formal weddings where I am, as that would be for funerals or if you want to send the clear message that you disapprove of the wedding.\n\nMaybe that's playing in the back of her head?", "Traditional dress for a wedding is a gown or floor length . Not a cocktail or shorter dress.", "OK - well, an off-the-shoulder dress would be inappropriate in many churches, and it sounds like you wore an evening dress to a daytime event.", "You added in your edit, that dress code was traditional, floor length dresses fir women.", "It didn't list any level of formality? Maybe the color isn't the issue.", "Neither have I. A hundred+ years ago, black was the wedding dress of choice.", "My great grandmother on my grandfather's side wore black because she wanted to show she didn't approve of the wedding.  My husband only had a black suit for his niece's wedding and literally couldn't wear it because he felt like black was for funerals or showing disapproval.  This was last year.  Almost every friend of the bride in their 20's wore black.  I've worn black for decades, especially to more formal night weddings.", "OP has shared a photo. If that is the photo she sent to the bride, you can not *see* the hemline. It could stop at the bottom of the photo *or* be floor length. The bride may have assumed it was floor length, as she had specified \"keep dresses traditional and floor length\" in the invitations.", "I don't get weddings these days. I'm 65 and never received an invitation specifying what I had to wear. Neither did any of my family or friends. We all knew we couldn't wear white and that our clothing couldn't be casual, but no one ever dictated length, etc. My daughter just got married and the guests wore a wide range of styles, including pant suits for women. Nothing detracted from the bride and groom. Why do people fret over these things?", "My comment was prior to OP edit.", "Well that changes things, doesn’t it", "Oh…I guess I missed that last line.  So, it’s the length that was the issue.  Idk.  I guess that makes her an ah but I still maintain that the bride kind of sucks too.  \n\nIt’s her wedding and her party and her aesthetic or whatever, and I suppose that is fair.  It just seems like a lot of brides get a little overzealous with the “my big day” demands.  I have always loved weddings.  I just can’t help but notice the hypocrisy of starting your marriage, and in theory, a lifetime of compromise and choosing your battles, by forcing everyone to bend to your will for your oh so special day.", "What does \"traditional\" mean? I think that's meaningless. I missed the floor length instruction, so yes that was a faux pas. It's still over the top for the bride to confront OP over that dress though. Why just look for trouble on your wedding day? It's not like OP pranced in doing a fan dance.", "After seeing your edited post, I still wouldn’t go as far to say that you’re an asshole for a mistake that could have been remedied or politely addressed.", "Except this wasn’t the case. The bride should have been more specific, She never specified what colors were acceptable. She only said don’t wear white or crème. So she has zero justification in being an asshole to her guest who also happens to be an old friend. You don’t treat friends like that.", "Cheesus crust! Put some clothes on will you?! Way too mu.... totally appropriate, and NTA for wearing it.", "She was jealous because you are looking beautiful in this dress", "I honestly think dress codes are more of suggestions. I've worn this to other weddings without a problem with stricter dress codes", "The edit flips the entire judgement basically. She knew the dress code and ignored it so she could stand out . Total arsehole move .", ">r/notlikeothergirls\n\nSelf: Don't click on the link, it's just going to annoy you...Don't click on the link, it's just going to annoy you...\n\n<clicks link>\n\nSelf: Am annoyed.\n\n(Note: I gave the above comment the \"facepalm award.\" It is directed at the link, not the poster.)", "Well my physical appearance is subjective but I respect your opinion", "So... the fact that \n\n> the invite it did say keep dresses traditional and floor length\n\nmeans nothing? If she thought she looked cute in her bikini, would that be ok, as long as she looks \"lovely\" in it?\n\nIt's a DRESS CODE. If the school dress code said my kid had to wear a skirt that reached her knees, I don't think \"It covers my bum and I have great legs\" will excuse her wearing a mini skirt.", "YTA That dress would be fine for a more casual wedding and maybe with some jewelry it could pass for cocktail attire, but that is not formal dress and the dress code was clearly formal. If I was the bride I wouldn't have said anything because what can you do? But she wasn't wrong.", "No, that dress is not \"cute enough\" to ignore the dress code at a formal wedding.", "[deleted]", "That's a lovely and very appropriate dress.  NTA, sorry you were accosted!", "NTA .... If it was super traditional I could see it being a possible problem but you kept within the rules on the invite , you messaged the bride and asked her you can't really do much more . You're fucking stunning by the way and it wouldn't surprise me if the bride was just getting jealous.", "Beautiful! NTA.", "There was a clearly communicated \"floor length\" dress requirement on the invitation.", "How is that dress even *CLOSE* to \"traditional and floor length\"???", "The invite said to keep dresses traditional and floor length... Extremely short, in this case would include tea-length!", "The invitation said floor length and OP said this is cut above her knee. It was not fine.", "> I was the only one in strapless and in black, other than guys in tuxes of course, and my dress was shorter than everyone's only going to my knees and not to the floor. As well looking back on the invite it did say keep dresses **traditional and floor length**.", "That was my first thought as well… Then I read the edit… “traditional, floor length dress” for women. So not only the funeral black, also a cocktail dress for a black tie event…\n\nOP YTA", "And not leather or denim or gold lame!", "Yes! Because people would wear their best dress to their wedding, and that tended to be the same clothes they wore for church and funerals", "I don't think that's true. White has been dominant for almost 200 years. Before that, it was really just your best dress.", "You can see the hem. Look at the bottom left of her picture - you see a small amount of hem. It's an above-the-knee dress with a lot of flare. I quite like the dress, and I think OP looks good in it, but it's completely inappropriate for the \"traditional floor-length\" guideline.\n\nIf I asked someone to wear a \"traditional floor-length\" dress, and they sent me a photo of that, I'd think they were taking the piss.", "Yeppers", "It was a day time church wedding and OP wore an evening dress. Maybe this wasn't the first time OP had pulled this kind of stuff and the bride was done with her.", "It’s not a mistake tho. OP said in another comment that they disregarded the dress code because they thought the dress was cute.", "> The bride should have been more specific\n\nHow is \"traditional and floor length\" unclear?\n\nOP said:\n\n> I was the only one in strapless and in black, other than guys in tuxes of course, and my dress was shorter than everyone's only going to my knees and not to the floor", "It's NOT FLOOR LENGTH which was SPECIFIED by the bride on the invitations. OP KNEW this, as she sent the bride a photo that doesn't show that the dress is knee-length. She has already said she intentionally disregarded the dress code because she \"looks cute\".", "The bride was upset that OP didn’t follow the dress code. OP edited her post and said in another comment that she disregarded the floor length dress requirement because she thought the dress was cute.", "They are absolutely NOT suggestions. I don’t get why you’re acting so clueless when virtually everyone is telling you that you were wrong for ignoring the dress code. \n\nWhen/if you have a wedding you don’t have to provide guidance and you can get anything ranging from jeans to gowns. I had a fairly expensive wedding at nearly 100K and my dress code was absolutely formal. It wasn’t a suggestion.", "Clearly your friend disagreed.", "Dress codes are not suggestions unless stated that way.  Like my niece said feel free to be xx, and feel free to wear your best xx, xx or xx, or whatever you feel comfortable.\n\nIf it says dress code is x, that's not a suggestion.    Either follow the dress code or don't attend.", "So you generally disregard others rules because you feel like it? Thats super immature.", "Dress codes are dress codes. They aren’t suggestions. YTA", "Then here's a suggestion you should take to heart: YTA.", "You are honestly wrong.\n\nAlso, \"I wore my dress to someone else's wedding and it was OK\" tells you nothing.\n\nAccording to your edit, the invitation specifically asked for \"traditional floor-length dresses\".\n\nThat's a slightly odd combination, because the wedding was at 1pm, which means we're being asked to look for a time period in which it was traditional to wear a floor-length day dress.\n\n\"Traditionally\", one would wear a dress somewhere between below-the-knee and mid-calf to a daytime wedding, which makes \"traditional floor-length\" an interesting combination.\n\nBut presumably given that the invitation also called for the anachronistic wearing of eveningwear in the daytime by the men, the intent is for the women to wear an evening dress, and specifically one that is traditionally-styled and floor-length. You could probably get away with ankle-length.\n\nThe dress you show is a cute black cocktail dress. You look good in it, but it doesn't even pretend to get anywhere close to what the invitation asked for.", "YTA. A dress code isn't a suggestion LMAO. Grow up.", "Hard YTA\n\nso you wore the dress to other weddings with “stricter (not a word) dress codes” and it wasn’t a problem?? \n\nNo honey… it was a problem, you just didn’t get called out on it.", "YTA, and the edit plus your responses only compound it. The invite was clear, you ignored it and dressed inappropriately.", "I’m sure you treat the dress code at your workplace as “just a suggestion” as well, right? YTA. Dress codes are a rule, not a guideline.", "Why are you acting like you're dumb and don't understand? Is this part of the \"I'm so cute\" act?", "Exactly. But she seemed to be trying to imply that she had missed that part of the invitation (which would be forgivable if somewhat stupid), but in the above comment is saying that she knew it and decided to ignore it. Definitely YTA", "You don't seem to think your appearance ought to be subjective to the rules though...", "It wasn't floor length.  OP said she thought it was cute so it would be okay.  That's an immature response. I ignored you because i think it's cute.", "They do?", "Dress code was floor length, this dress goes to her knees so she would definitely stand out by not following dress code. An oversight on OP's part", "Rules of the invite requested floor length dresses, so OP broke dress code according to her edit. If it wasn't malicious then all she can do is apologize for the oversight and then the ball is in her friend's court", "I posted before the edit", "Yes, I'm not sure what point you're trying to make with your reply. There was a dress code for guests, and outside of being on time and bringing a gift, isn't that the only other usual expectation?", "I did a deeper dive and yes, wedding dresses starting changing after 1840 when Queen Victoria was married in a white dress. It took scores of years for it to filter down to the commoner level but eventually white did become the dress of choice. \n\nA lot of Americans up to the 1880s still wore black dresses, only because that was usually their best dress.\n\nI had assumed it was up until the 1920s but it was much earlier. \n\nHere's a quick read: https://kentuckykindredgenealogy.com/2014/12/13/history-of-the-black-wedding-dress/", "> If I asked someone to wear a \"traditional floor-length\" dress, and they sent me a photo of that, I'd think they were taking the piss.\n\nGood point. I just would have looked at the *upper* part of the dress, having *assumed* the dress was floor length since that was clearly spelled out on the invitation. If you only glance at the photo, you can't see any skin below the hem.", "There’s lots of comments on this post most of which were made after my initial comment so I didn’t see anything saying she blatantly ignored the dress code. If that’s the case though, then yes, she would be the AH.", "I didn’t know it had to be floor length. This is brand new info for me. OP is TA for not following the rules.", "Yeah I’ve met a few people who do.  But it doesn’t seem like that’s the case for OP now that I’m aware it was supposed to be floor length.", "I have just read that and it wasn't in the previous post that I originally replied to. Posters should put all relative context in from the start this happens all the time and changes the judgement . Soft YTA .", "That's why I didn't downvote you :)", "I figured that you didn’t see it so I wanted to let you know.", "> the invite did say keep dresses traditional and floor length", "Haha appreciated!", "Yeah I know that now. OP left it out when the post was first created.", "Well, it kind of sounds like YTA since the invitation outlined the dress code.  OTOH, it's hard to know for sure without seeing a picture.  Also I keep hearing how some brides these days are trying to micromanage everything the guests wear, which is, in and of itself, ridiculous.  So I'm not really sure on this one. <shrug>", "YTA you know what you did. You could have googled proper wedding attire.", "YTA\n\nIt was right there in the invite. You either didn't fully read it or you did and just chose to ignore it.  Either way this is on you not the bride.", "You ignored the dress code, YTA.", "YTA\n\nThey specified floor-length. That means formal attire, and no, a \"cute\" dress doesn't make up for that. At 25, you should be old enough to either know that or know how to search online about what it means when floor-length dresses are specified.", "YTA there was a dress code and you ignored it because you thought you knew better", "YTA but I bet you don’t mind the attention", "YTA because based on your edit it didn't meet the dress code of floor length. If it was a floor length black strapless dress then you would have been in the clear.", "yta you don t read the invitation", "YTA \n\nWhy not follow the dress code. Even on a budget you can find affordable tasteful dresses for someone’s special day.", "YTA. You read the dress code. You willfully ignored it. You're lucky they didn't just boot you out of the reception.", "YTA because you didn't follow the dress code.\n\nThat dress is absolute fire though - you look amazing in it. Maybe go back to your friend and apologise for not following the dress code - it would be such a shame for you to lose a friendship of so many years just because you took a risk on a fashion choice.", "I think black at a wedding is almost as bad as white. Who does that? And cocktail dresses that are black. Someone did this at mine and I’ve never forgotten how trashy that was. I just rolled my eyes. Those people aren’t worth it. YTA", "YTA. I'm sorry, but it's clear in the edit that you were provided with the dress code ahead of time.", "YTA. \n\nThe dress code was mentioned in the invite and you either didn't notice or chose to ignore it which, either way, is your error.", "YTA  \n\n\nPeople like you fascinate me, OP. How you can so confidently walk into a wedding knowing that you've determined the rules don't apply to you and that you are JuSt SO SPecIaL that despite knowing the dress code and the expectations of behavior, is just beyond me. No, your dress wasn't \"cute enough\" to justify that level of narcissism. The bride was right, and you should be mortified for acting so disrespectfully to someone you claim is a \"friend\". Fair warning to not be shocked when she reasonably cuts you off.", "Maybe a soft YTA for not reading the invite properly but seriously these bridezillas are something else. Needless to say I wouldn't continue the friendship with her.", "YTA. Follow the dress code when in doubt. As a regular guest the bride has to much to do, to check everyone’s dress is up to code", "YTA and you should see that.\n\nThe invite stipulated the dress code. You either didn't read the invite or you chose to ignore it. Your dress also sounds a bit more night out than a wedding reception.", "Saw the dress- it's inappropriate. YTA.", "YTA For ignoring the dress code.", "YTA.\n Never been to a wedding but even I know that if there is a dress code you respect it. While you did look cute, it wasn't what the dress code requested which was formal wear. If you did not want to buy a formal dress, you just had to decline the invite.", "YTA", "I guess technically you were TA, but aside from not following the rules, the dress doesn't sound inappropriate. I actually think the bride sounds ridiculous in caring so much. I know this may be unpopular, but she sounds more like TA than you. \n\nI don't know about you guys but at my wedding, I wasn't worried about what anyone else was wearing. I was the bride, no one was upstaging me.", "YTA. Accident or not you went against the dress code.", "I have never gotten an invitation to a “formal”wedding, as that is well above the pay range for anyone in my circle of friends. If you have gone to multiple weddings with strict formal attire as the dress code, I’m guessing you come from a bit of money and should be well aware of what is and what is not appropriate.  YTA", "I am going to go toward an ESH.  you unintentionally missed the dress code, that sucks.  But the bride taking time out of her wedding to make an issue, also sucks", "NTA\nIt's just a wedding. She wore a dress looked fancy enough for the occasion too. I'm sure there are a lot of women that don't wear dresses at all, don't have floor length ones, don't feel uncomfortable in them etc\nAre we to force them all to still wear a traditional dress? You came to support a friends love union with someone. You dresses fine. Some brides. \n\nI get it, there was a dress code, okey. \nBut after the guests have arrived already, why stop your wedding to harass a guest that didn't follow the rules 100%? The bride that can't just let go a bit but instead chooses to police and control everyone is the real ah", "ESH - dress code is ridiculous", "Honestly bride is an asshole for that. Seriously dress requirement for bridal party is one thing but having one for all your guests is ridiculous.", "I wouldn't attend a wedding with a dress code like that. I can be respectful and formal without having to cover my legs below my knees and I already loathe the entitlement of so many brides these days. I'll get down-voted for sure, but really, is it the right of the bride or couple to dictate dress to that extent? Sure they can and do, but I find it annoying.", "Thanks I messaged her like 30 minutes ago and apologized for my assholey behavior.  She said it'll be a rocky road but she accepted the apology. And honestly I need to work on bettering myself.", "You can always borrow one, or trade in a community with someone. Ultimately, dress codes are considered for a number of reasons; some are cultural, contextual, religious or simply the vision of the couple.\n\nAny which way, guests have few expectations. I went to a Halloween wedding where the brides requested no costumes, but encouraged people to have fun and be expressive with 'creative black tie'.\n\nAm I supposed to then show up as a raccoon or something because I like Halloween and I already spent money on the costume? No. If wearing a costume means that much to me, then clearly I should decline and find an appropriate venue to do what I want.", "I would at least discuss it with the bride. And it’s not just the length. The dress is cute but it’s VERY informal. Dressing it up with a shawl or jacket might have helped a bit.", "Yea, I tried to go to a friend's wedding the other day in a bathing suit, and they got mad at me. What's wrong with them! It was a very tasteful speedo, so why the need for a dress code!", "You ignored the dress code.", "Having a dress code is not an asshole move.", "Damn how entitled, you ignored the brides wishes because of your own ego. Also why are you even here if you’re just gonna ignore everyone’s judgements\n\nAlso looking at your profile, you’re extremely vain and honestly your appearance is nothing special. You’re very average and hiding behind excessive filters and the entitled attitude just drags you way down.", "Wtf does the dress's cuteness have to do with whether it follows the code or not? YTA.", "That makes you even more of an AH. Disregarding the dress code because “the dress was cute” is giving pick me vibes. You’re not special and the bride was absolutely in her right to turn you away.", "So rules dont apply to you. Got it.", "That's absolute nonsense, you don't get to ignore a dress code because you like your dress. A completely black dress is weird for weddings anyway but a fully black dress that doesn't even meet the dress code is absolutely taking the piss.", "Ah, YTA then really I'm afraid -- you don't dress to stand out at a wedding unless you're the bride.", "Honestly you fucked up there. I would have told that bridezilla off. Burn those bridges", "I think it depends on where. I’ve been to weddings in Germany, the UK and Ireland and a black dress is sort of a nono there (Germany is a bit softer on that). From what I know it’s totally fine in the US, though?", "[here it is.](https://www.reddit.com/user/sydneytheslothette/comments/108aqrd/dress_in_question_for_aita_post/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "I haven't denied anyone's judgements, never once did I say I wasn't the asshole to someone who said I was the asshole.", "I don't want to burn bridges when it's obvious I've been the asshole in the scenario.", "Yeah it’s a cute enough dress but for a church I would 100% have worn a shawl or bolero, regardless of already screwing up with not sticking to the dress code.", "> I honestly think dress codes are more of suggestions\n\nThat's why you're an asshole.", "‘I’ve worn it to other weddings’ And? Tf has that got anything to do with *this* wedding. Every wedding is different, other weddings have nothing to do with this. YTA", "You are extremely annoying as a person Lol. Having the audacity to boo hoo on here like you didn’t do anything wrong when you purposefully went against dress code because you didn’t agree with it. \n\nThat’s okay. I’m sure you aren’t too good of a friend to lose anyways. I hope your old friend had a fantastic wedding!", "Did those weddings also specify a dress length? YTA", "They are not. Some events won’t let you in if you aren’t wearing the correct attire", "Lol thank you for that clarification", "Well shit I didn’t see the edited part. The original post only mentioned dress color. However it doesn’t change my opinion regarding the bride confronting her during the reception. She should be focusing on celebrating her union not obsessing what her guest wore to her wedding and it’s not like she wore a see through dress without any underwear. It’s a freaking regular black dress showing her calfs and shoulders.", "My \"point\" is that the OP received an invitation to a wedding that specified that women were to wear floor length dresses. So I am suggesting that the \"expectation\" was to wear a floor length dress, *which OP did not*. If she did not have, could not buy, or did not want to wear a floor length dress, she had the option of not attending. Not just wearing what she wants because she looks \"cute\" in it.", "She's the *ONLY PERSON* in *ANY PHOTO* from the day wearing a shorter dress. I assume the bride was more concerned about *the photos* than the day when she set the expectation.", "So we agree? Wedding guest or wedding party, all I'm saying is that she had one job.", "She’s NOT part of the wedding she’s just a guest. Which they are rarely ever the focus of attention to the hired photographers. But even If the photographer happened to take pictures of the guest the bride will have the option to select which pictures are going on the album. Same for any pictures the family members end up taking.", "Which she failed to do.\n\nI assumed you were saying that \"dress codes are for the bridal party\". \n\nWhen I said she was not in the bridal party, I *thought* you said that this meant \"all she had to do was bring a gift and be on time\" as though she was *exempt* from the dress code.", "When my sister got married, they had little disposable cameras on the tables and guests were encouraged to take candid shots. The cameras were collected at the end and the photos were processed. That's the kind of thing I was thinking of, though cell phones have made those cardboard cameras obsolete. Candid shots of people dancing, chatting, etc. would include everyone and you don't want one person in the background \"messing up\" the last photo ever to be taken of great aunt Lina.", "Nope. Not even sure where I said only bridal party has to follow a dress code.\n\nI was and still am saying there are few expectations of wedding guests. Have not changed my vote; bring a gift, show up on time and adhere to dress code. If you can't tick three boxes, YTA.", "> Like it or not, being part of the wedding party requires following a dress code\n\n(where I assumed you meant *only* the BRIDAL PARTY must follow dress code, and pointed out she is not in the bridal party)\n\n> guests have an even shorter list of expectations\n\n(in response to my saying the OP was not in the bridal party)\n\n> outside of being on time and bringing a gift, isn't that the only other usual expectation?\n\n(so I thought you meant that \"being on time and bringing a gift\" is \"the only other usual expectation\" if one is NOT in the bridal party)\n\nI did not realize there was another item on the \"list\" in the last quote... I misread it and thought you were listing only TWO expectations for guests... being on time, and bringing a gift. Part of the problem is that there was a string of comments between us and I misread what you said."]}