{"id": 7029, "submission_id": "108tp6y", "title": "AITA for returning the Xbox I bought for my boyfriend after he yelled at me before I could even show it to him?", "selftext": "My [23f] BF [23m] came over to my place today and decided to take a nap. He takes long naps so I decided to take advantage and do something I had been planning for a while: buy the new Xbox he’s wanted. I went to 2 different stores until I found the bundle he wanted and finally I got it. \n\nThis is the part where I might be TA. I decided to stop by his place and get his current Xbox and accessories to bring it over to my place. For context, I’m moving in with him next month so I already have a key. My logic was that he was spending the night at my place and I knew he’d wanna set up the new one and play on it. This bundle didn’t come with a headset, he already has a great controller, and he has an external hard drive with games loaded. So I figured he’d want this stuff. I was trying to be thoughtful but I didn’t ask for permission first, so maybe I crossed a line. \n\nHe was awake when I got there and I told him to close his eyes, then I brought in his bag of Xbox stuff along with the new box. When he opened, I said “so I went to your place and got your Xbox because…”. I started reaching for the new one with a big dumb smile on my face, but didn’t even get there before he started yelling at me. \n\nHe yelled for me to take it back right now. He said he didn’t want to play on it and asked “why the f*ck” I would go get it. I told him to calm down and that I wasn’t done yet, and he kept saying he didn’t care. He just kept going on and on until I picked up the new one, and then he stopped. He said “wait what” and then muttered out a half hearted “oh I’m sorry”, but I was already tearing up.\n\nI started crying from disappointment but also shock that he yelled at me so harshly. I expected him to maybe apologize again or show any appreciation, but he said nothing. Just sat silently, then got on TikTok. Finally he asked me if I was “just going to sit there and pout”. So I got up, grabbed the new Xbox, and left. \n\nHe’s calling me TA because he thinks I blew this situation out of proportion. I don’t think I did since he doubled down after I revealed the gift. If he was (genuinely) apologetic I would’ve just let it go. Because yeah, maybe I shouldn’t have gotten his old one. But it wasn’t even about entering his place (which he even calls *our* home), it was just about getting the console. So once he saw the new one… I thought he would’ve been like “oops”. \n\nMaybe there’s something I’m not seeing here. If so, please tell me. Should I have let him keep it? AITA here?", "created_utc": 1673406257, "permalink": "/r/AmItheAsshole/comments/108tp6y/aita_for_returning_the_xbox_i_bought_for_my/", "score": 186, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I returned the Xbox I bought for my boyfriend \n2) maybe his yelling was justified since I didn’t ask for permission before getting his old one\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Wow…well. Congratulations on your wake up call, OP. Time to ditch that AH like yesterday. Enjoy the new Xbox for yourself or return it and splurge on your own thing. NTA at all for wanting to plan a loving surprise in principle — but you will be TA to yourself if you stay a minute longer in this relationship with an abusive ingrate.", "NTA So after a misunderstanding and a disproportionate response by your boyfriend that results in you crying, he maturely decides to handle that by getting on TikTok and pretending nothing happened. There's definitely something that you're not seeing here - you're not seeing that your boyfriend is an asshole.", "NTA. If my boyfriend disregarded my feelings and asked if I was just going to sit there and pout, I would have returned it too. You have no obligation to give someone a gift, especially after they've treated you poorly.", "He's showing you who he really is if he can't wait long enough for you to explain a situation before he blows up completely out of proportion to the issue. \n\nReturn the key and his things in a box while you're at it\n\nNTA", "Nah f this guy. Don’t move in with him. Luckily he showed you himself before you’re stuck with him \nNTA", "NTA, but do NOT move in with this guy unless you want to be berated on a regular basis. He is not mature enough to be in a relationship if he can’t control his emotions. It also doesn’t sound like he trusts or respects you since he immediately assumed the worst when you did something so kind for him", "absolutely NTA. you literally gathered all the energy and love you have for this man, and he shit on you due to his own confusion. i’m so sorry this happened, but to me, it sounds like the one blowing things out of proportion is him. I woulda straight up started crying if my lady surprised me with a brand new console.\n\nsuper glad you returned it and hope you got your money back. he can show a little bit of gratitude for you. you should def considering moving on bc if he’ll scream at you for this, he’ll scream at you for something else. don’t move in with someone that doesn’t appreciate you. keep your head up friend!!", "he showed you who he really is, please believe him.\n\nNTA", "Do yourself a favor and reconsider moving in with him. You’ve seen who he is, and if you stay with him I doubt this will be the only time he screams at you and not let you finish. NTA, and I’m so sorry that happened.", "Why are you moving in with an asshole?", "NTA. Just be happy you got to see who he is before you get financially locked into something more long-term.", "NTA.\n\nYour boyfriend doesn't know how to be apologetic either. You might want to observe hia behaviour a bit more before moving along with your relationship. If he acts like this now and you're crying, the future will only get worse unless his attitude improves.", "NTA.  I wonder why he freaked out over you being at his place without him.  Sounds like he might have something he’s trying to hide.\n\nPlease rethink moving in with this guy.  You deserve better.", "NTA- don’t move in, he showed himself…..", "NTA\nHe's shown you that he's quick to anger, capable of making you cry, and also calls your crying pouting. He doesn't seem to understand emotions enough to control his own, or to care about your feelings. IMO a boyfriend like that isn't worth the heartache", "NTA\n\nYou were doing something nice for him and he didn't even give you the chance to finish what you were saying before he blew up at you.", "NTA. He completely overreacted to you grabbing his old XBox. He *gave* you a key. If you overstepped by bringing his old system to your place, he could have let you know in a hundred different ways that don't involve berating or belittling you. His reaction to the gift and comment about pouting are just the icing on the cake. That's *not* how a man treats a woman he loves and respects.", "NTA DTMFA", "NTA. Please really think about if this is behavior you are wanting to live with", "Nta, what you are not seeing is abuse. I don't know all your dating history but for him to go from 1 to 100 in an instance not apologist after he majorly screw up is suspicious.", "YNTA\n\nMan he wasn’t even mad about you going in the place so if that’s not what he’s mad about idk what he’s mad about. He definitely could have apologized, I don’t blame you for returning the gift.", "NTA. He just couldn't *wait* to have his first freak out that he prematurely ejaculated all over his new console.\n\nThis is what you have to look forward to after you move in together. Good luck.", "OP.  Info: Does your boyfriend normally blow up at you if you touch his things?", "Oooh red flags everywhere. Run, OP.", "A little yes but I’m going with nta bc his reaction was way out of place. I said a little bc you shouldn’t have taken his system out of his place without his permission. With that said I want you to stop and think about this. He made a rash decision before knowing the facts and blew up. Really blew up. This, to me, is a red flag. Your relationship is him blowing up then getting mad at you when you aren’t ok with his reaction.", "NTA and consider yourself lucky; you got a very clear preview of your future. Please don’t let him convince you that his behavior was an isolated incident. Continue the relationship if you want, but press pause on moving in – even if you’ve already ended your lease.", "NTA \n\nhis response was way out of line. He has shown you exactly who he is, do you really want to walk on eggshells for the rest of your life? If the answer is no: do NOT move in with him!", "NTA. \n\nDon't move in with him. And seriously rethink dating him.", "Wow he behaved so poorly then tried to blame you for your reaction. Y T A if you move in after that display\n\nNTA", "NTA.\nBut you spelled EX-boyfriend wrong.", "Hm. Just a friendly caution to think about why you have the need to rush and move in together? Maybe give it some more time. Gentle ESH because I’m a stranger on the internet and I don’t think you should move in with your boyfriend.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy [23f] BF [23m] came over to my place today and decided to take a nap. He takes long naps so I decided to take advantage and do something I had been planning for a while: buy the new Xbox he’s wanted. I went to 2 different stores until I found the bundle he wanted and finally I got it. \n\nThis is the part where I might be TA. I decided to stop by his place and get his current Xbox and accessories to bring it over to my place. For context, I’m moving in with him next month so I already have a key. My logic was that he was spending the night at my place and I knew he’d wanna set up the new one and play on it. This bundle didn’t come with a headset, he already has a great controller, and he has an external hard drive with games loaded. So I figured he’d want this stuff. I was trying to be thoughtful but I didn’t ask for permission first, so maybe I crossed a line. \n\nHe was awake when I got there and I told him to close his eyes, then I brought in his bag of Xbox stuff along with the new box. When he opened, I said “so I went to your place and got your Xbox because…”. I started reaching for the new one with a big dumb smile on my face, but didn’t even get there before he started yelling at me. \n\nHe yelled for me to take it back right now. He said he didn’t want to play on it and asked “why the f*ck” I would go get it. I told him to calm down and that I wasn’t done yet, and he kept saying he didn’t care. He just kept going on and on until I picked up the new one, and then he stopped. He said “wait what” and then muttered out a half hearted “oh I’m sorry”, but I was already tearing up.\n\nI started crying from disappointment but also shock that he yelled at me so harshly. I expected him to maybe apologize again or show any appreciation, but he said nothing. Just sat silently, then got on TikTok. Finally he asked me if I was “just going to sit there and pout”. So I got up, grabbed the new Xbox, and left. \n\nHe’s calling me TA because he thinks I blew this situation out of proportion. I don’t think I did since he doubled down after I revealed the gift. If he was (genuinely) apologetic I would’ve just let it go. Because yeah, maybe I shouldn’t have gotten his old one. But it wasn’t even about entering his place (which he even calls *our* home), it was just about getting the console. So once he saw the new one… I thought he would’ve been like “oops”. \n\nMaybe there’s something I’m not seeing here. If so, please tell me. Should I have let him keep it? AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta, I find it weird that he blew up like that. I understand that he might have wanted you to ask first but to get that angry that fast is weird. Then he had no regard for your feelings which is a red flag too. I would get out of that relationship. Healthy communication is key", "NTA, he made you cry and then dismissed it. Good you brought back the console. \n\nI would mot move it with him, because it will be his house, his stuff and you may experience the same thing. \n\nI'd wait for another year.", "NTA ... time for a new relationship", "NTA if he is going to be the ungrateful and treat you like that f him.  Now if you did something to the old Xbox okay I get it.  But all you did was go into a place he calls both of yours and tried to surprise him.  And I know transpoting that from one house to another doesn't hurt the console I use to bring mine to my friends house all the time so he over reacted to start with and then when he saw what you did he pokes fun at your mood.  Find you a man that appreciates your efforts!   You deserve better and he deserves to be alone with his old console.", "NTA\n\nWhen people show you who they really are believe it.", "NTA yea don’t move in with him. You don’t necessarily have to break it off or anything but I would hit the brakes here. You just saw a side of him that may very well never go away. Do you want that in your life forever. \n\nYou did not cross lines. He way over-reacted.  Don’t let him make you feel bad because HE blew the situation out of proportion and then tried to manipulate you into thinking you did. You read the situation for what it was, him being a dick.", "NTA\n\nHear that sound? That's your wake up call. No well-adjusted person would immediately start yelling like he did. This man is immature, abusive, and is now gaslighting you. Please leave this clown, I promise there are men who would appreciate such a kind gesture.", "NTA What you’re not seeing is a forest full of red flags. You need to dump his sorry a** and DO NOT MOVE IN WITH HIM!!!!!!!!! He just very loudly verbally abused you. Don’t take it. Give him his old Xbox and his key. You deserve so much better than this!", "i'd just leave him, he's terrible", "A soft ESH.  \n  \nHe absolutely over reacted.  But you did violate holy ground.  It'd be like if he said hey, I emptied your purse into this ziploc bag (because I bought you this new designer bag).", "Agree and I would reconsider moving in with him. NTA", "Typical reddit, totally misrepresenting what happened to fit your narrative.\n\nHe got on TikTok *and then asked her if she was just going to sit there and pout.* \n\nReal charmer this one.", "Yep. She won't be able to be herself. He likely just wants her to move in to help pay for rent and cook and clean. Anytime she wants to do something she is going to have to ask his permission. She will have to tip toe around him in HiS place that she is paying rent on and be careful about touching HIS stuff. Classic loves her for her money and generosity, but doesn't really care about knowing her. If he knew her he would trust her and know something good was coming.", "That or he is super triggered about her touching HIS stuff. Sounds like she will be walking on eggshells and be the object of his anger quite a bit. Even if my boyfriend did something like touched my things that I didn't want him to I would ask politely. The yelling and not letting her talk in her own home is so manipulative. Most people can tell when someone is doing something nice or trying to do something sweet and romantic. He isn't even interested in what sweet thing his girlfriend is doing. He is only interested once she says she bought him something. I wonder why she felt she needed to buy him that. Maybe to get his attention? Afterall, he comes over to sleep at hers and probably even eat. Thanks gf... you may as well move in so you can do my cleaning and pay my bills too.", "This. Listen to this. Red flag. Run. Please.", "But... I'd be ok with someone doing that. Especially if that was all one sentence like it was here. Like she didn't say it and then wait all day to show the reveal, it would've been like 2 seconds longer.", "Yea I’m assuming this isn’t her first gift to him and he definitely takes advantage of this. He’s definitely a gaslighter. Tried to convince her she blew this out of proportion when he over-reacted like a maniac and didn’t even really apologize or be excited for the gift. I hope she can get OP before the gas gets too thick and she can’t figure out right from wrong anymore. Been there.", "He was totally comfortable demanding and manipulating her to get that gift back. I bet he won't be nice again until she buys him it or something else. He is just training her to actively be doing what he wants or she is in trouble.", "NTA.  And DON'T MOVE IN WITH HIM!!! Do you want him yelling like that over little things?", "NTA\n\nKeep the Xbox, ditch the bf.\n\nBut don’t give him that x box.", "NTA.  But please, please ditch your boyfriend.  He's impulsive, immature, and mean.", "Hey OP, I’d rethink moving in with this bozo. You’re NTA. He doesn’t get to scream at you and then also expect the new XBox. Use the money you got in return to buy something nice for yourself.", "NTA\n\nFor your own sake, I hope you turn this guy into an ex bf. Big red flag walking.", "NTA Get a new boyfriend.", "NTA. 1. You have every right to return something you hadn’t gifted yet.  Her doesn’t deserve your hard earned money, you don’t reward verbal abuse. \n2. His yelling was not justified, this could have been a conversation. He could have said that going to his place without his knowledge can’t happen again, he could have yelled out of initial shock but then hear you out. He didn’t even give you a chance before he started berating you.  \n\nYou’re not missing anything but if you need it spelled out: \n\nCapable of Some version of emotional/verbal abuse (enough to bring you to tears) ✅ \n\nLack of remorse when in the wrong (he’s\nNot even going the “we both did/said things..” nope he is saying YOURE the AH )✅ \n\nDismissive of your feelings (“you just gonna stand there and pout” after I yelled at you and made you cry?) ✅ \n\nLack of empathy (tiktok was literally more interesting and worth his time and energy than comforting you, from his actions) ✅ \n\nManipulating and gaslighting you into thinking that his over reacting and harsh words were “blown out of proportion” ✅ \n\n\nMaybe I’m just a stranger on the internet shitting out my pie hole but those are the red flags I see.  I’m a cry baby I can’t be with someone who can berate me like that, especially for a mistake like that.", "Hmm.  I am more sympathetic than others on here to his response b/c I wouldn't like it if you did that (brought the old one over) but, rereading your post, it Was an overreaction on his part.  Tbh, this rings fake to me but if it's real you are not the AH.", "NTA you shouldnt move in with him. or continue to date him for that matter", "Even if he didn’t want to play it, why would he tell you to take it back to his place?? Makes no sense \n\nNTA", "NTA, not only should you not move in with him, but you should dump him.", "NTA but return his key back and strongly reconsider moving in with him because if you continue letting him abuse you, then you are the TA.", "NTA. Your boyfriend was acting like a child so he gets treated like one.", "NTA. Please hold off on moving in.", "I’m so sorry that he did this to you. He may try and spin it and say if only you showed him the gift first and then you brought his stuff out, he would have been so very appreciative. He sucks a lot. I can see him being confused about you having his stuff, but straight up angry without letting you talk? No. He showed you his ass and it was covered in … I’m sorry. Nta. Please don’t move in with him. I’d say have a talk with him, but maybe just send him a bunch of TikTok’s of women that left their gamer partners for being ahs. I don’t know tiktok but assume there are quite a few.", "NTA, and I’m predicting you’ll be single by weeks end once you dwell on this some.", "NTA\nI would’ve freaked out about someone touching and moving my gaming stuff. But I also would’ve listened to their reason and been really happy with the gesture and effort put into the surprise. \n\nYelling at people isn’t okay, yelling at people you care about is extra bad.", "NTA.\n\nOP... I realllllly fuckin hope you dont move in with this AH...", "NTA. and I love you.", "NTA He does not deserve a gift from you and he sounds like a total a.h.  Good for you!!", "ESH, so you set it up basically as a privacy violation before telling him you bought a new one and you're still that upset? Yeah it was a good thought, but bad execution.", "Please don’t move in with this person. NTA", "NTA, and please do not move in with him. I'd give him his key back yesterday and make sure he doesn't have a copy of yours. You're too good for him and I'd hate to see how he reacts to a surprise from a kid or if an animal has an accident on the floor. So many red flags. You literally did SUCH A KIND THING, you're a gem 💎 ✨️\n\nETA no you should not have let him keep it. Reread what you posted and ask yourself if he deserves a new system.", "NTA unless you're still planning on moving in with him.", "NTA\n\nDid you return it or do you need game recommendations?", "NTA but don’t move in with this guy. It is not going to get better and it’s probably gonna get a lot worse.", "NTA. You are completely on point with his followup reaction. He should have apologized. He did not.\n\nThe question here is not if you should let him keep the xbox. It is whether or not he gets to keep you. \n\nLet him decide. Wait for an apology. None incoming? Then tell him that you are seriously considering what his reaction means for your relationship. See how he reacts. If he doubles down that you are overreacting (you are NOT) then you know you deserve better. Then you know what that right choice is. And if you ignore it you will look back at this point where you knew what you should have done.", "NTA don't move in with him", "Please rethink moving in with him until and unless he grows up. A lot. \n\nNTA", "🚩🚩🚩🚩🚩NTA 🚩🚩🚩🚩🚩", "Girl do not move in with this idiot - he's acting like this because he's comfortable that you're not going anywhere now, you've decided to move in with him, so he feels like he doesn't have to put on the facade of being nice to you anymore and can test out being a aggro asshole. This is who he is and it only escalates from here. Get out while you can!", "Wait, I'm confused. Why did she grab his old Xbox console from his place? Did I read something wrong? I know that if the external hard drive was plugged in that could have been an issue. Not excusing BF's blow up or anything. I've unplugged my boyfriend's external once by mistake and he didn't get that unhinged about it.", "YTA, going against the grains here. I don’t think id be happy if anyone just took something out of my place without permission. It would just bother me.Invasion of my private space & things. \n\nYou took an expensive piece of electronics from his place without his permission with the good intentions of gifting him a better one but that doesn’t neglect the initial act or his feelings of probably violation. \n\nOf course he didn’t know your intentions with the gift but you said it yourself that it wasn’t about entering his home (I don’t completely agree with that, even if it would be both of your homes soon it doesn’t stop it from being his home now, key or not) it was about taking his console. \n\nBoyfriend is wrong for yelling at you but I don’t fault him too much for   Doing it in the moment given the circumstances. I think returning it is going to cause a bigger problem & that the relationship has a faster expiration date now due to both of your actions but I’d personally lean towards you being more in the wrong now.", "NTA - Outright too sweet and thoughtful for that grump. His reaction is very disproportionate to what you did, and then acted like you were the one who overreacted for crying because of it. It was so disproportionate that it almost sounds like he had something to hide, which doesn't make sense to me either, considering you said you were moving in soon, and he called it your house too already. Honestly, though, I wouldn't move in together, I think he just did you a favor in revealing exactly the type of treatment you'd be getting daily if you lived together. He should work on his anger and be way more caring of you and your feelings. What you did was very thoughtful, and he doesn't even seem to have acknowledged that. Poor OP!", "NTA, you did a very sweet and thought out thing I and many other young men would be very happy for. Your BF is giantic asshole and I suggest you not wasting any second longer with this jerk.", "Life would be a lot easier if you young women stopped gifting Xboxs and PS5s to your boyfriends and gifted them vacuum cleaners and dishwashers instead. Stop enabling the AHs.\n\nNTA", "Mic - drop 🎤", "Pack it in folks this right here's the answer.", "I'd return the boyfriend.", "Yes, I could see having a momentary freak out because an Xbox can be a precious thing and it could feel intrusive to see it all unplugged and out of place. However, what a fu$king dick he sounds like. Should have apologized 1000 times and comforted you once he realized what was going on. \nTake the Xbox back, give him back his key and move along (dump him). \nNTA.", "HEY BOYFRIEND STORE, TAKE YOUR BOYFRIEND BACK lol", "I know that Reddit tends to over exaggerate, but this would straight up be breakup territory for me. We don’t even have to talk about his response after the fact, but the level of toxicity and anger that he showed before OP could even get her words out is not okay in any way.", "You know when the one kid touches the other kid's arm in the car and the second kid punches the first kid?  It's like 85% on second kid and 15% on the first kid.  \n  \nHe blew it way out of proportion, but you also shouldn't have gone into his apartment and messed with his Xbox.", "Sorry this model is non returnable, you can either throw it in the trash or try to give it away, too defective", "I think she accidentally got the boyfriend at the jerk store. Common mistake.", "I mean even if you are firm on the opinion that she shouldn’t have entered the place they are about to live together in, he could have easily said \n“Hey I’m sorry but I don’t appreciate you going into the apartment and grabbing my things. Why would you do that?” And she would have explained and from there he could have told her whether or not he’s setting the boundary of her not touching his things in their shared space.\n\n\nBut cursing and screaming at your partner for that really tips the scale to them being the bigger ah. Since he hadn’t set that boundary I don’t think she’s an ah unless she knew he didn’t want her to touch his stuff and did it anyway.", "I disagree that it's 15% the kids fault. We could also make the false comparison that the girl in a bathing suit is 15% responsible for being raped because she knew men would want to look at her the same way the kid knew it would stir something up. That's not how the world works. HE calls it \"OUR\" home, she has a key, they agreed to live together. Even in the case of yea it's his space and his stuff, he had no right to belittle her. Ask her not to do it in the future, yes. Ask her why she did it, yes. Be upset, yes. But scream and not let her explain and continue to belittle and cuss her out and then not apologizing when the reason was in your favor and then making it so she's still the bad guy is bullshit and I think you know that, you either know that and are the victim, or you know that and you're the one that's done it. Or you wouldn't be defending blatant abuse over a slight misunderstanding."]}