{"id": 7076, "submission_id": "109bwhf", "title": "AITA for threatening to sue my sister.", "selftext": "I 24 f am a bit of a bug enthusiast. I love the creepy crawlies. I bought my home myself, live by myself, so it’s never really been an issue. I currently have 2 tarantulas, a mantis and some Madagascar hissing cockroaches.\n\nMy sister and her 2 kids recently had to move in with me due to flooding in their apartment. All my pets are in my bedroom which isn’t easily accessible so I thought it wouldn’t be an issue. \n\nMy 8 year old nephew snuck into my room while I was working and I guess my roaches freaked him out. \n\nMy sister came into my office and told me he was uncomfortable and asked that I get rid of “the bugs” while they’re here at my house. \n\n\nI told her no, and he knew not to go into my room. They’re my pets and I love them. \n\n\nLater I heard a kind of loud crash from my room and I went to look and my enclosures had been smashed and my pets with them. \n\nThis is where I may be the asshole. I told my sister to get the fuck out of my house and I was going to sue her for property damage, which would be pretty easy in my state. \n\nShe begged me to let her stay and she was just trying to keep her kids comfortable. \n\nShe got our elderly parents involved and they called me heartless for choosing “pests” over my family. \n\n\nNow I’m second guessing my choice to kick her out with her kids. \n\n\nAm I the asshole?\n\n\nEdited to fix a typo\n\n\n\nAddition: she for a fact smashed my enclosures, she admitted to me when she said she was just trying to keep her kids comfortable. It wasn’t an accident.", "created_utc": 1673461625, "permalink": "/r/AmItheAsshole/comments/109bwhf/aita_for_threatening_to_sue_my_sister/", "score": 81, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I kicked out my sister and her small children where they didn’t have anywhere to immediately go.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  I find bugs gross also but I would never expect someone to get rid of their animals when that person is doing me a favour by letting me stay with them.  You could have reacted differently but you don't walk into someone else's house and make demands about what they should do.", "NTA, sounds like the only pests in your life is your family. If your sister can’t respect your boundaries then she absolutely should not stay in your home.", "I loathe spiders to an extent that I'd rather be homeless than live with one, but I wouldn't do what your sister did.\n\nNTA. \n\nMom and Dad can house her.", "My cousin has a house full of crawlers that freak me the fuck out. So you know what I do? I don’t go to her house! It’s not that difficult. Your sister knew about the crawlies beforehand. She could have found somewhere else to stay. \n\nIf your parents are than concerned, they should have taken them in. \n\nNTA", "It's not even close to being debatable...you are NTA. Your sister and family are however.", "Excuse me? Now you’re second guessing yourself??? YTA for second guessing yourself. Wtf\n\nHelp Reddit, my sister and nephew killed my pets and destroyed my things so I kicked them out but now I think I’m in the wrong", "Please..I don’t really care if the bugs were in your living room as it’s YOUR house and you’re doing them a favor! So the fact that they were in your room and someone chose to violate this arrangement by breaking and then proceeded to victimize themselves is really sending me. Kick her ass out at the very least, Sue her at the most. Now I’m not pushing you to sue your sister but not bc I have sympathy for her-but bc I have sympathy for you. The emotional drain and familial ramifications of suing your sister  may not be worth the couple hundred bucks and that’s totally ok.", "Nta. And I would definitely sue. Also if you have pictures of your pets, you might plaster them all over the house to help you in mourning and getting them to move", "NTA I would absolutely sue, that is so messed up. How entitled, jeez. Also, I am so. sorry for your loss, I'm sure you took amazing care of your little guys", "If this was a cat or dog no one would be questioning if they were a monster for killing them. This is the same as her smashing and killing a pet bunny in its enclosure, just cuz the animals are quite and cuddly doesn’t mean they aren’t pets", "NTA kick them out. They don’t respect you or your belongings. They bit the hand that was feeding them. You can try to sue them, but I doubt you’d get anything out if it other than legal fees.", "Your sister murdered your pets and destroyed your property...intentionally. Why would she doubt that she would be kicked to the curb? NTA. You have no choice to kick her out. And the legal path is a criminal investigation. She is obviously unwell and needs help.", "Nta. She killed your pets!", "NTA\n\nINFO - who smashed the cases, the sister or the kids?", "NTA she can live at the parents house. Fuck her, they killed your pets, disrespected your home, disrespected you, and took advantage of your kindness.", "NTA. They were in your room and could not escape their cage (or whatever). They could not escape your room. Regardless of what they were, all that matters was they could not contact your house guests unless the guests intentionally tresspassed into your room. Kid should have stayed out of your room. Sister should not have acted entitled. She can lay in the bed she just made.", "NTA. \n\nLet me propose a scenario for you. Replace those bugs with any other kind of pet — a cat, a dog, a rabbit, a hamster. Would you still be asking if you were in the wrong for taking legal action against someone who **literally killed those pets, especially after you welcomed them into your HOME?** \n\nDon't listen to your parents. They are trying to gaslight you. You are in the right, and she is in the wrong — your sister needs to learn that actions have consequences.", "NTA She killed your pets just to make her children comfortable?!", "NTA. Your sister wouldn't respect your boundaries. She wasn't protecting her kids, if she was doing that your nephew wouldn't have gotten into your room in the first place. She didn't like being talked back to and told no.\n\nShe wants to throw a tantrum then she can face the consequences. Tell your parents they can pay up and take her in or she'll be served post haste.", "NTA kick out she can go stay with parents and either get her or parents to reimburse you or sue.", "NTA Seems like they killed your pets which is just plain evil, to say nothing of a complete disregard for your boundaries.", "NTA!!! It’s horrible that that she killed your pets. I’m so sorry. Then smashing the enclosures too? Those aren’t cheap! it’s like she killed your pets and tried to ensure you couldn’t get more.. So mean.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 24 f am a bit of a bug enthusiast. I love the creepy crawlies. I bought my home myself, live by myself, so it’s never really been an issue. I currently have 2 tarantulas, a mantis and some Madagascar hissing cockroaches.\n\nMy sister and her 2 kids recently had to move in with me due to flooding in their apartment. All my pets are in my bedroom which isn’t easily accessible so I thought it wouldn’t be an issue. \n\nMy 8 year old nephew snuck into my room while I was working and I guess my roaches freaked him out. \n\nMy sister came into my office and told me he was uncomfortable and asked that I get rid of “the bugs” while they’re here at my house. \n\n\nI told her no, and he knew not to go into my room. They’re my pets and I love them. \n\n\nLater I heard a kind of loud crash from my room and I went to look and my enclosures had been smashed and my pets with them. \n\nThis is where I may be the asshole. I told my sister to get the fuck out of my house and I was going to sue her for property damage, which would be pretty easy in my state. \n\nShe begged me to let her stay and she was just trying to keep her kids comfortable. \n\nShe got our elderly parents involved and they called me heartless for choosing “pests” over my family. \n\n\nNow I’m second guessing my choice to keep her out with her kids. \n\n\nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nWho the hell thinks it is acceptable behaviour - entering someone's private space (again), destroying their property and murdering their pets? Especially when that someone has opened their home to them...\n\nAbout the only thing you would be the AH for would be jumping straight to a threat of litigation when it comes to redress. But given the circumstances - that's just a pile of whatever.", "NTA. Your nephew was wrong to sneak into your room. Your sister was wrong to destroy your property and murder your pets. This is absolutely a case of no good deed going unpunished. You invited your sister and her children into your home only to have them totally and utterly betray your trust. I would kick them out so darn fast if I were you.", "NTA. Your sister or her children killed your beloved pets because you wouldn't get rid of them. Let them go live with your parents and yes, collect damages or sue. Your sister is heartless because those bugs were precious to you and she just showed you that she doesn't consider you to be precious because she or her kids destroyed your pets.", "INFO: Do you know who smashed your enclosures?  You're not an asshole either way and you would be well within your rights to sue your sister for damages if her kids broke them by accident, but if she purposely smashed them, this could be a relationship-extinction-level event.  Also potentially criminal on her part.  In either case, though, you should probably just ask her to reimburse you before you sue, simply because lawsuits are a pain in the butt for everyone involved and it would be way easier if she just cut you a check.", "NTA, she literally *killed* your pets. After being told not to go in your room. Your pets were kept in YOUR room, away from their prying eyes. It was their own fault they saw your pets in a room they had no business in. She killed your pets and destroyed their enclosures, after being graciously allowed to stay with you. That is such a gross violation of hospitality.", "NTA \n\nYou were kind enough to let them live with you. And she smashed your pets homes and it sounds like your pets were smashed as well (I’m so sorry for you loss if so!) \n\nNah I’ve kicked someone out of my house for calling my dog a bitch if he had killed her I probably would have killed him. Pets are family no matter their species.", "NTA\n\nYou generously let your sister and her kids into your home. They mocked that generosity by doing 3 things: entering your bedroom without permission, demanding that you remove your pets for their own comfort, and intentionally destroying your property. Don't let them come back. Sue your sister. She needs to understand just what her actions cost get family.", "Not the arsehole. Criminal damage is criminal damage. Also taking the piss a bit moving into your house and trying to tell you what can and cannot be in there.", "NTA. They disrespected you, your home, your pets, and your property. Kicking them out is the least you should do. Out of curiosity, who destroyed all of your enclosures and killed your pets?", "Nta. She destroyed your property and your pets. Get her the hell out", "I don't think you had any choice over getting her to leave. Instead of simply teaching her child not to go into your room, she destroyed your property. If that's how she resolves disputes, you really can't have her around. NTA", "NTA.\n\nWhen someone let's you into their home to help you out, you don't get to demand that they rearrange their private spaces, and you don't get to kill their pets.  I think a lawsuit here is petty and will only make things more miserable for everyone, but it is time for her to GTFO.", "NTA.\n\n\"She got our elderly parents involved and they called me heartless for choosing “pests” over my family.\"\n\nNo. You're choosing YOU over your family. Most normal people have a spot of heartlessness that guides them to place their own needs above those of others.\n\nYou have a zone of privacy, your own personal habits and property. That it's a bug collection is immaterial. It's yours.\n\nNothing wrong with second-guessing what precisely you should do in this situation, but NTA.", "NTA. They broke the rule and were violent to your pets, that’s animal abuse. Of course you need to get animal abusers out of your home when you have animals. I don’t care what sort of animals, but the fact that they were in enclosures and your own bedroom and they still went seeking them out and harmed them and it is insane to me that they are trying to not take responsibility", "There’s a really neat concept called an eye for an eye. /s\n\nI’m surprised your sister was able to survive long enough to reproduce. Who thinks the solution to making her kids comfortable is to smash and kill the bugs?\n\nThere are toddlers with better problem solving skills than her. NTA", "Ok, personally I would feel uncomfortable in your home. I get where your nephew and your sister are coming from. I’m admittedly more of a dog/cat person. But if I were in this situation, I would grow the fuck up and be grateful I had a place to live. I can’t imagine killing your pets ON PURPOSE. You did her and her family a favor (as a good sister probably should). She was disrespectful and I’d move ahead and sue her. If your elderly parents want to stick their noses in this mess then tell them they can take in your sister if they feel so strongly. Don’t second guess yourself at all. NTA and your sister needs to learn some respect. She fucked around and found out and is all shocked by the consequences? Ridiculous", "Definitely NTA! It is your house, your pets and your rules. Did your pets get hurt because of all that smashed glass as you said “my enclosures had been smashed and my pets with them”? I would be livid at the disrespect and carelessness as they are living creatures that you said you loved. Geez they purposely destroyed your property. Yes you can sue for property damage and vet bills if you had to take any of your pets to the vet to get them checked for injuries.\n\nEdit: I read other comments. Did she kill your pets?", "NTA.\n\nShe fucked around and found out.\n\nShe should have been respectful of your choice to keep your pets, and simply told the kids to stay TF out of your room.  \n\nWhat's that old saying?  Don't bite the hand that feeds you?  Well it's the same for the person who houses you when they have no obligation to.  Don't bite that hand either.  And don't purposely destroy their stuff when the easier option is to teach your kids that there are rooms they aren't allowed to enter.\n\nAnd tell your parents that you aren't \"choosing your pets\" over your family.  Your sister chose to disrespect you over respecting you, point blank period which means she can no longer live with you.  It was a choice she made as an adult, so she can suffer the consequences like an adult.\n\nEnclosures cost money.  The pets cost money.  The food and accessories cost money. And she destroyed it without a care in the world for respect for you.  She seems to have forgotten who the homeowner was and whose room it was. And it's not your problem that she's no longer welcome, only hers.\n\nAnd maybe ask your parents why YOU know that kind of behavior is inappropriate in someone else's home but she doesn't.  Her entitled attitude landed her in the situation she's in, and you no longer want someone who disrespects you to that level to be in your home.  PERIOD.\n\nOh and I say this as a person who got the creepy crawlies when you were describing your pets.  I wouldn't go anywhere near that room if I were your sister staying with you, and I'd teach the kiddo(s) the same darn thing.", "NTA \n\nThe have no right to enter your room and/or destroy your property. \n\nI would not kick them out but I would expect that she pays for what they broke.", "Please update us!!!!", "NTA, I'd sue and go no contact.\n\nShe was a guest and went into your room and killed your pets, destroyed your property, and likely damaged your carpet/floors.\n\nShe does not respect your property, your boundaries, or you.\n\nIf she did, she wouldn't have done that. Going forward you can expect that she will do whatever she wants to try and get her way, regardless of you. Not only did she do that, but she's unapologetic about it.\n\nShe can simmer in the stew of her own making.", "NTA\nWhy is it always \"don't sue your sibling because family\", but never \"don't destroy your sibling's home and kill their pets because family\"?\nShe broke the bond first.", "So, after letting her and her family stay with you, your sister KILLED YOUR PETS because your nephew snuck into the room he wasn't allowed in, and you're asking if YOU'RE the asshole?! \n\nYeah, NTA, obviously.", "NTA. \n\nYou let them into your house. You gave them clear instructions to stay out of your room. They chose to ignore you and destroy your property, killing your pet. \n\nChange \"bugs\" to \"dogs\" and you'd have no problem pursuing animal cruelty charges and having her arrested, would you?", "> This is where I may be the asshole. I told my sister to get the fuck out of my house and I was going to sue her for property damage, which would be pretty easy in my state.\n\nYTA for losing your temper, but this is recoverable. You can apologize for losing your temper.\n\nLet the fam live there. Put a lock on the bug room door.\n\nEdit - position reversed. I thought it was the kids.", "I genuinely do not like many bugs. Basically all the pets you have would give me the creeps. But when I read what happened to your pets, I wanted to burst into tears. I feel for you, OP. Sue the hell out of her and cut contact", "NTA you told them not to go in ur room if they don’t like creepy crawlies, they did it anyways despite the warning. Then she internationally broke lord of ur property and killed (at least that’s what I interpreted) ur pets. That could cause emotional damage. Not to mention the cost of replacing all that stuff. AND they felt entitled to do so after you offered for them to stay with you while they went thru a crisis.", "They are yours and not your sisters or her kids. If you were able to get them back and they didn’t run away then get a lock on your door and keep it locked at all times. Tell your sister that you were nice enough to let her stay at your house that you can take that away. And even tho they might not be the same as a dog or a cat you love them just the same and this is like letting them out of the house on purpose.\n\nNTA", "NTA.", "NTA.  While your pets are unusual, it is your house, you had them in a separate room, and it was clear no one was to go into your room.    Someone (sister? child?) did go in your room and purposely destroy your enclosures and your \"pets\".    Throwing them out for vandalizing your stuff is reasonable IMO.", "NTA. You took her in, she destroyed your property and endangerd your pets.", "NTA\n\nSue her destructive butt!", "Lets just take a moment to think about the message OP's sister is sending her kids by doing that.... Your comfort matters over all else. You don't need to respect anyone else or their things even when they go out of their way to be kind to you.  Its okay to kill anything you don't like, actually mom will do it for you. \n\nNot only are you NTA, you should most definitely sue her because obviously she is unaware of consequences for her actions.  Perhaps being sued will at least show her children that its not okay to act that way.  \n\nIf they are in your house, then they are already imposing, for anyone to be so entitled as to think you should get rid of your pets that are IN  YOUR ROOM is incredible.  They shouldn't be in your room in the first place (the sister and her kids).  \n\nI think bugs are cool, I don't really want a pet tarantula but I have a mealworm colony on my kitchen counter (the mice and fish think they are the most delicious things ever to have existed). I get that it could make someone uncomfortable but there are all sorts of things in life that can make someone uncomfortable and with bugs I've found the more you learn about them the less creepy they are.  \n\nThose poor kids are being taught that ignorance is a badge of honor and that their comfort is of the utmost importance and they are entitled to the rest of the world conforming to their whims.  \n\nSue her. And consider going NC with anyone who thinks its acceptable for her to have destroyed your property and killed your pets.", "NTA. Pets are family too to many, many people. They crossed your clear boundaries by entering your personal space in YOUR house. You have every right to kick them out and sue her for damages/personal injury maybe get some free consults if you want to go that route especially if they killed any of your pets…", "NTA follow through on your threat.", "Let's put this into perspective.\n\nIts your house, your rules, your pets.\n\nYour sister and ANYONE else are guests. They play by your rules.\n\nNTA and honestly I'd kick them out and not look back.", "Did she break the cages intentionally? If so, then NTA and kick her out. If it was an accident where one of the kids was trying to look at them and accidentally broke it, then maybe don't kick them out. I would choose not to sue either way, unless it was thousands of dollars of damage (my personal opinion). Suing someone is a serious thing and taking it to that level with your sister will probably ruin your relationship forever.", "Sister is batshit crazy- normal adults don’t just damage property of others- especially when they are being housed by them. She needs to look for another place to stay- really unfortunate but she brought this in herself. I don’t think her kid has a problem- I think it’s her. That is just not a normal reaction.", "NTA Just cause they are bugs doesn't mean they are less loved. Like if she had killed your dog because her son didn't like it she would be arrested!", "NTA. Kick her out. Imagine her doing something to a puppy or kitten….everyone, including your parents, would tell her to leave.", "INFO: How big were these enclosures? I'm just trying to understand what kind of psycho would think smashing them was the best way to kill the bugs.", "NTA\n\nSo they murdered your pets by destroying your property, and now their asking you to accommodate them? Absolutely not acceptable.", "Sue the shit out of her", "Your sister killed your pets on purpose.  No, you are NTA, and I think you absolutely should sue for damages.", "NTA - she can live with your parents because they of course would not be so heartless as to chose their own space or comfort over hers.  Oh and of course should anything in their place get damaged they would never blame the lack of respect from her or the children.", "Nta. Your house your pets your rules. I hate bugs. I get it but they were enclosed in your room which no one had a right to trespass in and certainly not to sneak in and cause damage. Your sister is out of line. She needs to reimburse you. Since your folks seem to think it's fine the  she can move in with them! Or they can pay her rent elsewhere. Or since she moved due to flood damage she can put in an insurance claim for housing elsewhere. If u do let her stay...get a signed agreement that she will pay all damages (set out a payment plan if necessary) and of course get a lock on your room since she had no boundaries and isn't teaching your nephew any either.", "NTA and I would sue her. She did it intentionally and that’s sick. \n\nAlso I’m sorry about your pets.", "NTA. Her kids actively chose to go into the bug room. If anything she could've use it as a learning experience where you show how cool they are. And the fact she destroyed your property after allowing her into YOUR home is messed up! No one should go that far for their kids' \"comfort\". Sounds more like she did it for herself. It was a purposeful act of malice. And she killed your pets? Pets are family! No matter what type of animal! Like if someone did that to my dog you bet I'd sue! You do what you gotta do. She chose to act out like a child and so she needs consequences. Either way she needs to pay you back. Sister or not that is your property and you're both adults. Actions have consequences.", "I don't like your stuff! It makes me or mine uncomfy! smash! is probably not what she should be teaching her kids. Enjoy the real life demonstration of consequences. NTA\n\nPersonally I hate bugs and think you are a weirdo but, you do you and your sister is still in the wrong.", "NTA - she needs to learn to parent her children.  Wait, I just saw the addition - your sister is the one who smashed things?   Definitely not the asshole.   You did a nice thing and she repayed you by ruining something you care about.", "NTA\n\nBeggers cant be chosers.", "NTA, holy shit your sister is horrible, I would never do her any kind of favor again, don't listen to your parents, if you were heartless you wouldn't care about the bugs, your sister was the only pest in the house.", "NTA. OMG, what was she thinking?! What if one of your pets had escaped? Now you have a tarantula on the loose! How is that better than an enclosed tarantula?", "NTA! From what you have said, she did this on purpose and owes you complete replacement cost. You are not in the wrong it was your private area and no one has any business in there, but you.", "NTA  Sue and call the police and kick her out.", "Did she killed your pets? NTA. ditch and sue her.", "Oh, NTA. Her kids went into your private space and potentially hurt your pets. While your pets would freak me out too, I would know better than to go into a room with spiders and roaches. I would just avoid it knowing that is YOUR private space.", "Kick her out. NTA", "NTA\n\nYour sister was completely wrong for what she did and if your parents want to take sides, tell them she's coming to live with them.", "NTA\n\nFuck her and her kids.", "What on EARTH was she thinking?! One: depending on the enclosure that stuff is expensive! Also the pets themselves can be expensive depending on the species! Who walks into someone else’s house, goes into their private bedroom, and kills their pets and destroys property? Idgaf if the sister and her kids don’t like bugs. It’s not her house, not her room, not her pets. NTA. Sue her.", "Nta let them go to elder house", "NTA, take her to court. I do not like bugs, but hurting someone’s pets is just unacceptable", "NTA through her away and don’t have any mercy knowing she did intentionally! And about your parents if they can’t see their poor selfish,manipulative daughter in the streets with her kids they can open their doors!! \nShe and her kids intentionally make that all situation now what they are facing is called consequences,that’s what happens in the real world! She killed your pets so for them at least sue her for animal cruelty", "NTA at all.  She killed your pets on purpose.", "NTA and I would sue her", "Absolutely NTA and she should get some mental help if she thinks it’s okay to not only destroy someone else’s property, but also kill their pets?? \nAfter you so graciously gave her a place to stay?! Just so her kids could be “comfortable”\nIt could have been a great opportunity to teach them about bugs and their impact on the ecosystem. This whole situation could have gone so differently.", "NTA, at all in any way you set boundaries that were crossed by your nephew out of curiosity and then maliciously by your sister. Your sister forced you to make the choice due to her actions, and unfortunately she is now having to deal with the consequences of those actions.", "Also, while I'm not the biggest insect fan myself, I am very suspicious of people who kill helpless animals without any need.", "Yea. No. I’d say maybe don’t if it was an accident but she maliciously went and smashed them like a lunatic. Small claims depending where you are may cover the damage and requires very little effort.", "Exactly my thoughts.  I don’t like spiders either but I would never destroy someone’s pets.", "[removed]", "My sister. She smashed my enclosures and my pets.", "The parents can take them in if they have an opinion.", "She for a fact smashed them. She admitted she did and wanted to make her kids more comfortable.", "This. You’re NTA no matter what you decide to do, but if you take it to court, you’re likely to lose more money than you win.\n\nEdit: my understanding is that for criminal charges to be fully pursued, a district attorney has to press charges, and they may or may not want to. Some of them are fickle. So your only recourse in that case would be civil court which would come 100% out of your pocket and that’s where my comment comes in.", "[removed]", "That would require a mindfulness that is clearly lacking. At least we can see where the sister gets it. Guess you don't have to treat people like family if they don't do what you want.", "Her pets are recoverable? Really? Losing one's temper when their pets have been MURDERED isn't ok? When is it ok to lose one's temper?\n\nNTA, OP. You're justified in kicking her out.", "Reanimation isn't do-able. So there is no recovery here.", "They killed all her bugs, nothing is recoverable. I hope you’re joking with this vote.", "Even if they had nowhere to go, they could’ve left that door closed and not have to worry about the animals.", "I Forgot to say but NTA at all", "She smashed them on purpose. My enclosures and my pets. It was very obvious it was on purpose and she admitted it to me", "What about the level the sister took it to by killing OP's pets **on purpose**?", "This is correct, those setups are pricey and she killed your pets. Never allow her in your home again after getting the money she owes you.\n\nNTA", "My enclosures alone were well over a grand for the set up and husbandry, not to mention the costs of my pets themselves", "Ditto. Not a fan of insects like op has. But they're in tanks they cannot escape from otherwise they would have by now.", "Killed with malicious intent? That better? \n\nhttps://www.merriam-webster.com/dictionary/murder\n\nInform yourself?", "Wow, that's awful.  Definitely NTA.  Your sister committed an egregious act of disrespect against someone who was hosting her family in their time of need.  She violated ancient laws of hospitality in a truly brazen manner; basically every culture we know of would have condemned destroying your host's property like this.  I'm angry on your behalf, and so are all your ancestors.\n\nSo yeah, ask her for a check to replace everything, to the extent that living beings can be replaced, and then take her to court if she refuses if your lawyer thinks it's worth it.  In either case, never let her into your house again, and I would understand if you wanted to cut her entirely out of your life.  The only way this could have been worse would have been if she'd assaulted you directly.", "I am very much not a fan of any of these pets but they were OP’s pets. If someone hurt my cat on purpose I’d probably beat them to a pulp, relative or not. Getting evicted and sued is nothing. I would definitely also see if you can press charges for destruction of property. This is not an innocent mistake. It’s sick and shows absolutely no regard for OP.", "Pets were killed. She said they were smashed.", "\"I went to look and my enclosures had been smashed and my pets with them.\"\n\nThe pets in question, being insects, were also smashed", "It says the pets where smashed along with the container....so yes she killed them.", "All of my pets were smashed and killed in their enclosures.", "Single digit age children are going to break things. Suing for property damage when you failed to secure fragile property in the presence of children is unreasonable.", "There were so many other non violent options for her and instead she chose to destroy expensive habitats and the lives of your pets inside of them. Not to mention making a huge mess in your bedroom. It could have been a learning opportunity for her kids, but she started smashing things instead. NTA and keep them out of your house, don't doubt yourself. This kind of behavior isn't sane or healthy. Ask for monetary compensation, and if she refuses then go with the courts or police. Make sure everything is documented.", "I would absolutely sue. You can’t just destroy property and kill pets. There are consequences. Stick with your guns, kick ‘em out, and get back the money she owes for her actions.", "This is so horrifying she could do this. Honestly I’d have trouble speaking to her ever again. Definitely ick her out and sue", "The sister killed her pets, not the children", "My 36 year old sister killed them. Not her children.", "If that's the case, then sure - sister is psycho.", "NTA then. Sister be crazy."]}