{"id": 7118, "submission_id": "109qmli", "title": "AITA for giving one daughter more inheritance?", "selftext": "My husband and I have 2 daughters, let’s call them Emma(32F) and Sam(29F). My husband died of a stroke 2 years ago and he left everything to me. I’m rewriting my will as well in case something happens to me. Originally everything was split 50/50 between the girls but now I’m splitting about 80/20 in favor of Emma. \n\nEmma has ADHD and isn’t doing great in life. In those days everyone just assumed she was lazy and she didn’t get the help children today get until she was in her teens. She just managed to finished high school and is working at a retail store as a stocker. It’s backbreaking and she doesn’t have much in the way of savings or anything. Her car was her father’s when he passed.\n\nSam is works in tech as a project manager and her husband is a doctor. They live in a million dollar house and has 2 kids. I’m not worried about Sam she’s always been very capable and excelled at everything. She was always the overachiever and I don’t think she needs help financially. Her and her husband probably take home $500k after taxes a year.\n\nI want Emma to inherit the house and car when I pass. I think it will be good for her because she can live in it or sell it and buy another one. Sam will be fine and her and her husband have several houses and a summer home. But Sam is angry with me because I’ve made it clear that Emma gets most of our belongings. The bank savings and stocks will go to Sam but if I live to 80s she won’t have too much probably 20-30% of what the house is worth. But I think it’s fair because she is doing much better.\n\nSam called me to yell at me saying I’m favoring Emma. I reminded her of how much worse off Emma is than her but she said since they were both my daughters she should get things 50/50 or it’s favouritism. She reminded me that growing up we always spent more on Emma than her. But that’s because she was at the top of her class while Emma was failing. I put Emma in extra tutoring and the like because she needed it more. She said I should will half of the inheritance to her children for college funds but I reminded her she makes more and can save for them. I told her it’s not about me favoring Emma over her but Emma is worse off and she will be fine which resulted in her hanging up and refusing to come over for Christmas.", "created_utc": 1673498924, "permalink": "/r/AmItheAsshole/comments/109qmli/aita_for_giving_one_daughter_more_inheritance/", "score": 383, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for willing one daughter to have more than the other because she is worse off\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Might be better to put Emma's in a trust than give it to her outright", "It's your estate to do with what you want, but don't assume that just because two adult daughters are at one place in life now, they won't be in a different position later. Also, will one daughter be an executor? Have power of attorney? Be involved in future elder care? If so, does your split of assets align with which daughter you'd want in those roles?", "YTA. You need to meet with an elder law attorney in your state who does special needs planning. Leaving almost everything to your ADHD daughter who may not be able to do backbreaking work until she retires could disqualify her from government benefits like Medicaid if she might ever need them. There may be a way to leave them both equal shares but in a way that keeps your daughter with ADHD eligible for benefits.\n\nAlso, your successful daughter may fall on hard times. Her husband could leave her, she could have an accident that disables her. Does she not deserve the same financial cushion that your other daughter does? Know that if you leave her anything but 50% of your estate it will complicate her grief when you die and lead to unresolvable trauma. I know, I’m living it now and it’s very painful. Do you want to knowingly inflict that pain on her?", "Yta \nSam just wants for once to be equal\nYeah it’s your money but this is going to fail miserably in all relationships", "YTA. There's a story similar to this one that's about a year old, in which the mother willed everything to the son with ADHD and left her daughter with nothing, but also wanted the daughter to be the executor of the will. She was flabbergasted when her daughter got upset. \n\nThis isn't about the money or assets. It's about the rampant favoritism on your part. The fact that you rewrote the will after their father could no longer have a say is a clear indicator that you've been playing favorites with Emma her whole life, and you want it to continue even after you're gone. I hope you don't get too attached to Sam's kids, because I have a strong feeling you won't be seeing them very much after this.", "YTA not for the inheritance but clearly you have always put the other sister on the back burner.  Your other daughter doesn't need money what she probably wants is equal love and attention.\n\nEdit to add in seeing responses from OP\nNope you're straight up the AH.  You paid to give her the best tutors.  You're paying half her rent currently and her therapist You absolutely do favor her and she got the dad's car currently.  Name five things you've done for the other one.\n\nThink possibly you've enabled her to live off of you?", "Info: What if anything would your husband have had to say about this situation?", "Info: is favoring Emma in the will worth losing your relationship with Sam?  That is where you’re headed. It seems like Emma has been favored their entire lives and this is the straw that broke the camels back.", "You know this likely isn't about the money, right?\n\nSam understandably feels like you care more about Emma than her. For whatever reasons, good or bad, Emma has received more help, more attention, and more consideration from you and your husband for their whole lives. Many will extrapolate that to amount of love/care. Sam likely feels that you love Emma more and that no matter what she does, you're always going to favor her sister. Maybe it's irrational, maybe it's not. But those are normal human feelings, and they're valid.\n\nYour intentions are well-meaning, and a rational, unbiased person would understand why you're wanting to provide more financially for Emma, but you do need to recognize what message you're actually sending to Sam if you go this route. You can explain your reasons to Sam all you want, but it's irrelevant to someone who already feels like they're second. Sam is going to feel hurt and resentful because yet again, it's a sign that Mom loves and favors Emma more. You should also be aware that once you're gone, Sam won't want much to do with Emma. This is the kind of thing that drives wedges through families for decades. \n\nNo judgement", "YTA. So you mean to tell me Emma has *always* gotten more by your own admission, your husband caused Sam to have an eating disorder, and despite (or in spite) being pushed aside for your favorite Emma, Sam has come out financially and emotionally stable while the child you favored is still failing? \n\nAlso someone else pointed out, I certainly hope you’re making Emma the one to be power of attorney. She gets everything so she should be in charge of your care. Don’t take away from Sam and then expect her to do anything for you when it sounds like you haven’t done anything for her. \n\nMoney changes. Sam could lose everything, Emma could get her shit together. Who knows. What Sam currently knows is that she will never be treated as well as her sister, not even in your death.", "I really want to know what happens", "It’s your choice but it’s not fair and will create animosity. Different life choices created different circumstances. So Sam is supposed to be punished because of her life choices? Does Emma have a learning disability too because I know plenty of highly successful people with ADHD. I think you need to split 50/50.", "YTA - it is favouritism whether you think it is or not. Based on Sam’s reaction, this is something that has been a pattern for her entire life, and it’s clear that she holds some resentment that you favoured her sister so much in childhood. Yes Emma needed extra help, but did that extra help result in you neglecting Sam?", "Slight YTA.  I'm on the side that it should be fair regardless their personal achievements.\n\nBoth can inherit the house with the stipulation that Emma be allowed to continue to live there but if the house is sold it is split between the two.  In our situation, the attorney drew up a cotenancy agreement.  You should check into it.", "NAH\n\nI don't think you're an asshole for choosing equity here, one child clearly needs more help. That said, I don't think your daughter is an asshole either. There is clearly a lot of built up resentment and I can see why. You did your best, the same way my parents did, but when you spend your whole life watching your sibling get more attention, time, and care than you, because they need more help, resentment builds. My brother was the problem child who needed extra care and I was the child who could be independent. Partially because my parents spent so much time on my brother that I had to be. That doesn't mean I didn't want help from them or just their time. To your daughter, this is just another moment of you choosing her sister. She can't see past the pain to realize that this is actually fair.", "Why not help Emma now? Why wait until you die?\n\nShe's only 32, her quality of life can atoll be improved  with the right professional assistants, help, ...\n\n\nAfter that you can just split 50/50. So Sam still wants to help Emma after you are gone.\n\nIt's  not nice of Sam either, she shouldn't yell at you.\n\nESH except Emma.", "YTA\n\n>Emma has ADHD and isn’t doing great in life. In those days everyone just assumed she was lazy and she didn’t get the help children today get **until she was in her teens.** \n\nEmma got \"extra help and the like\" growing up and Emma got \"the help children get today\" starting in her teens. Sam did not get either of those things, because she did was doing well in school. And it sounds like Emma probably got more of your attention and emotional resources too, because Sam was \"easy.\"\n\n Emma is now 32. Not 18. Not 25. 32. \n\n>is working at a retail store as a stocker. It’s backbreaking and **she doesn’t have much in the way of savings or anything.** **Her car was her father’s** when he passed.\n\nEmma already received your husband's car. What did Sam get when he died? Do you have full access to and knowledge of Emma's finances? Maybe she spends carelessly or chooses not to work hard. Perhaps because she knows that you will always bail her out.\n\nMeanwhile\n\n>She was always the overachiever and **I don’t think** she needs help financially. Her and her husband **probably** take home $500k after taxes a year.\n\nSo you generally have no clue about Sam? Sam has two kids and is 29 years old. Maybe Sam's kids will need help paying for college. \n\nAny way you slice it, you are absolutely favoring Emma. It's delusional to suggest otherwise.  If your true goal is to \"help\" Emma out, because you think she might be destitute once you're gone, and if Emma is as terrible with money (and adulting) as your post suggests, put everything into a trust with Sam and Emma as equal beneficiaries and let both daughters receive passive income and Sam have control over distributing the principal, since you have no way of knowing that Emma won't spend everything at once. Or acknowledge that you favor Emma.", "YWBTA\nI’d advise you to figure out a way to help Emma financially now, and split the inheritance 50/50. She has a neurocognitive learning disorder that will never go away, but hospitals and courtrooms and businesses everywhere are literally filled with successful professionals with ADHD. Give me a break- I’m 54 with ADHD that was diagnosed a year ago and everyone told me I was lazy, too. I have an advanced degree and a great career and my valedictorian sibling was, and remains, the favorite. I’m much better off financially than my sibling. \nCircumstances can and do change- Sam could get divorced or her husband could be an alcoholic gambler in 15 years, someone could get sick or in a terrible accident or sued- who knows. They are both your children, and I’d bet Sam is having a gut reaction not because of entitlement but because it’s reinforcing the painful message she got growing up - loud and clear- that she was on her own. That sucks. That would be the legacy you’d leave more than any money.", "Side note - how capable is Emma of using the money responsibly if she has a lot of difficulty in everyday life? Just giving her everything may not be the favor you think it is. Maybe a trust or something with more oversight would be a better fit for her?", "YTA. There are no guarantees in life. Something could happen and both daughters could end up needing help. Sounds like Emma always got more. ADHD is not an excuse to be less. My son is the same age as Emma and was diagnosed with ADHD at age 6. He’s bought a house, married with 2 children and thriving. Maybe you should concentrate on working with Emma to help her get the tools she needs to thrive - additional schooling, etc. Sam should not be made to feel less than because she doesn’t have ADHD.", "YTA. It’s not *actually* about money. It’s that the division of assets is a stark reminder that Sam was treated differently and she feels that you have never treated HER fairly. My sibling has extreme dyslexia and also Asperger’s. They cannot hold a job and are legally disabled. They get the house when my parents pass.\n\nIn exchange, my other sibling and I are getting a third of the value of the home in cash. I am arguably more well-off than either of my siblings (and, by the way, I was just diagnosed with ADHD later than Emma). \n\nHoweverrrr.. I could care less if they willed everything to my quote unquote worse off sibling. Because I know and feel that my parents have always loved us equally. Since Sam is so angry, you need to do some introspection to figure out why if you stand a chance of repairing your relationship. If at all possible.", "This isn't about finances. It's about a sibling being favoured over the other her W H O L E L I F E. The penalty of being better in life is an excuse for the mother to use.", "YTA. You are already guaranteeing that as soon as your die your family will break up and girls will be er talk again.", "I don't know, I flip between YTA and NTA. On one hand it's your choice, on the other, your husband's will had other directions. \n\nI'm going to share a few comments also... \n1) You're setting them up for hurt and fighting when you die (if not sooner). Although apparently family fighting around wills is common, so maybe there is nothing to be done. \n2) Why not focus in equity, what does Emma need for future security and stability. Example, maybe Emma gets the physical house, but some of the items are split. \n3) Sam mentions belongings, maybe there are some items you own that are important to her. Why not find out what those are?", "ESH: The intent isn't wrong, but your plan of action is. You could place most of this in a trust for Emma since she's so behind, but you shouldn't show such obvious favoritism. I get leaving her the house and the car, that makes sense... but other finances should be more evenly split.", "I always think these are the kind of decisions that tear families apart. It often translates as favouritism, no matter your rationale or intentions. Also, no-one can predict the future. Emma could win Lotto tomorrow, and equally Sam could have a life mishap that results in financial distress. So don't base it on current situations, base it on they are both your daughters, loved equally, and should share the inheritence.  Split it 50/50 otherwise YTA", "YTA. \n\nNot necessarily about the split itself, but everything about how you talked to Sam. Clearly there is some long standing feelings of being overlooked, and the way you shut her down was incredibly insensitive.", "YTA, only because going from 50/50 to 80/20 is a drastic change in the inheritance.  Especially, if the 80/20 is basically money and then she gets the house and car on top of that.  That would ruffle a lot of feathers.  You can't fault Sam and punish her because she has a great life.  Anymore than you can award Emma because of the guilt you feel about her health.\n\nI think your guilt is the culprit here.  You should look inside yourself.  Maybe discuss it with a therapist.  When you do a will, you shouldn't tell anyone what's in it.  There will be a day they find out.  Hopefully, if you decide to change things, you will know enough to keep things to yourself.", "Ooooft this is a tough one. My sibling is the same - my parents have always worried about him but in turn he hasn’t learned to cope on his own. I’d be livid if my parents left him the same split as you’re intending to do.\n\nWhat’s wrong with 50/50? Surely there will still be enough for Emma to buy a home with 50% of your estate. Even 60/40 in Emma’s favour would be more decent. 80/20 is a jump.\n\nYTA", "I’m actually in this situation with my mum. My sister is struggling and a single parent. My mum asked me how I felt if she gave more to my sister on the will by revising the original will which was 50/50. I actually supported her decision and suggested that it could be split between the nieces and nephews or do a trust. My sister has ADHD, PTSD and chronic depression. I know my parents love me and I love my sister and her kids. My husband and I do not need it. That’s the thing I think your daughter who is well off is missing the point that you’re making. You want to give to your daughter who is struggling the house and car because she would need it, meanwhile the one really could sell one of her other homes and put that as a college fund for her kids. It’s not about favoritism. NTA", "I think there is another issue here. What did the father want?\n\nWas this discussed with him before he died? Because if his will said, 'everything to my wife unless she predeceases me and in that case 50/50 to my children'...then surely his wishes should be taken into account too?", "NTA but I’m against 80/20 split. I highly suggest putting anything for Emma in a trust. My experience working with ADHD individuals is that they can be incredibly impulsive and don’t think things through. I fear Emma may blow through any inheritance or sell the house and squander that cash. I would NOT make Sam the executor of your estate or have her manage the trust. Furthermore, I would completely bypass Sam and bequeath directly to your grandchildren.", "I understand and empathize with both sides but I gotta ask; why did you feel the need to put this information out now? \n\nWhy take the chance of ruining your relationship with Sam and by extension your grand children? It’s almost as if you wanted to fight about money. Timing and consideration are important. \n\nSam’s pissed because you favored Emma her whole life and you intend to continue this trend even after you cross the rainbow bridge. \n\nEmma doesn’t have the same opportunities as Sam and will need help after you’re gone. I get that but that’s not what Sam is hearing. Sam’s resentment is rooted in childhood disappointments. \n\nShe does sound greedy but I think she’s reacting more from a lifetime of being overlooked, pushed aside, or sacrificed. That I get. \n\nYou made a mess and complicated that mess by broadcasting your intention to continue the unequal treatment. \n\nYou may want to structure Emma’s inheritance so that she doesn’t get everything at once. Sounds like she could burn through it if there’s no limits. Sam would have been the person to help out here but you’ve fucked that up. \n\nParents who favor one child over another suck. You are an asshole for treating your children differently and continuing to disappoint the one you ignored.", "YTA for now, sam is living comfortably. But a lot can change before you die. You're assuming that Emma will never get her life together and will never marry or have kids or be financially stable. You have no way to know that when you die she will need these things more than Sam does. \nYour best bet is to do 50/50. Because they are equals. Neither more deserving or less deserving because they're both your children.", "YTA for how it sounds like you went about it. Favoritism hurts. Unless your kid has a debilitating disability or chronic illness, which ADHD is often not, it's best not to leave one kid more than another. Setting up a trust fund with specific conditions could be a lot better.  People are also often over extended when they buy homes because they aren't smart with money.  Idk sounds like this is a lifelong problem where you've always been kind of harder on Sam.", "YTA. I feel as though your punishing Sam for being successful and you should split it 50/50.", "I'm going with YTA but I might be biased. My mum is leaving everything to my brother because he makes terrible decisions and she thinks he needs extra help.\n\n He bought a house he can't afford, traded his brand new car in for a hunk of junk because he wanted to go off roading and his fiance doesn't want to work and prefers to watch TV all day while they struggle financially. He's always been bailed out of trouble and babied. Does he deserve an inheritance more than me? \n\nI actually told my mum I'm fine with her leaving everything to him but don't ask me for help so she had no one to look after her when she had surgery cos he didn't want to.", "Just going to add that my parents willed more to my brother because he was struggling with grades, keeping a job and had ADHD and behavioral issues and I was an overachiever with a good job a stable relationship. Now, a couple of years after my parents died, I'm the one with serious medical conditions (Narcolepsy AND Epilepsy), an ex-husband who took most of our money, a son with special needs, and I'm struggling to stay employed. I understand giving one kid more money than the other but it's how you went about it. Plus, you can't see the future. Setting up a trust to provide for both daughters in the case of unemployment, medical issues, or other foreseeable problems is super doable.", "I'm leaning NAH. I'll explain:\n\nYou sound like you have valid, well-thought-out reasons for the split you've decided on, but I can honestly see why Sam might be upset.\n\nI really think it sounds like there are deeper and more longstanding issues that need to be addressed here. It sounds like Sam may have some deeper unresolved issues due to a difference in attention and resources (real or perceived) growing up or from feeling like her reward for digging a better ditch is being given a better shovel while watching her (from her perspective) ne'er do well sister be handed everything on a plate. That may or may not reflect the objective reality of the situation but feelings are feelings. \n\nIt's your money and you can do what you want, but you should probably consider that there may be emotional dynamics at play that go well beyond the money, or maybe even have nothing to do with it. Sam may just want to feel like she's equal in your eyes and may have some unresolved issues as to the treatment of her vs. her sister. Being at the top of her class may well have not been as easy for her as you thought.\n\nI really think it sounds like there are deeper and more longstanding issues that need to be addressed here. Then, you might be able to approach the subject of the inheritance without unrelated and unresolved hurt feelings getting in the way.", "YTA. The truth is, you don’t know what the future holds. Sam could get in an accident and become disabled, get divorced, have a stroke, any number of scenarios…you have *no idea* what her future needs are. And yet, you just expect her life to always be good because *you* have decided she has it easy. Do you know how hard that girl worked to get where she is? And it sounds like she got precious little help from you to do it, by your own admission. \n\nThis is what your girl hears from you: no matter how perfect you are, you’re never good enough; sister will always get more from me because reasons. You will lose Sam if you don’t stop this nonsense. \n\n*Parents should never play favorites, no matter the circumstances.*\n\nP.S. A will is your final comment to your children from the grave. Is this really the last word you want Sam to hear from you?", "I was going to say YNTA for doing what you think is equitable but then I was like what went on when you were raising your daughters that Sam got an eating disorder from her father and resents her sister enough that she wouldn’t share an inheritance when she is clearly not in dire straits and then I was like yeah, maybe we’re not getting all the info here. \n\nLike… I would be so disappointed in myself if I raised my daughter to be as selfish as Sam that I would never blame her alone for being upset. I would be like, where did I fail as a parent. \n\nOn the other hand, if Sam was under the impression she would be getting a specific inheritance from her father her and her husband may not have been saving for specific items under the impression they would be filled by that inheritance— ie college funds and the like. \n\nYour intent is fine but because there’s obviously missing backstory and I don’t like the response about your husband and Sam, I’m going to say YTA unless you want to clarify other aspects of this.", "I have had severe ADHD my whole life, only recently medicated. Got all A’s whilst being raised part-time in a cult beforehand. YTA. Also, all the comments saying otherwise are valid, but Emma is 32. Common guys.", "Anytime inheritance is split any way other than equally between children it’s a dick move. It sets siblings up to resent each other and no matter the intent shows favoritism. If you really want to help the one help her while you are alive and not once you are dead.\n\nSomething else to think about, giving someone who may be bad with money more money doesn’t always go the way intended and may actually cause more issues for that person.", "YTA\n\nIf the house is sold and split, surely ADHD daughter can buy something suitable with that money. She doesn’t need “80%”, she just needs enough to be comfortable.\n\nYes, I agree daughter making a killing should be more flexible on who gets what. But that doesn’t mean taking away such a significant portion of the inheritance.\n\nIf my parents pulled this BS I’d be pissed.", "YTA- you mentioned in a comment that your husband split if 50/50 because he gave Sam an earring disorder. It seems like Sam has never really gotten support from either of her parent’s so don’t be surprised when she cuts all contact with you.", "As someone who is a scapegoat child, ESH.\n\nThe child not used to having money also won't have a clue how to manage a windfall, so all that cash, assets and the house will soon be reduced to nothing when you're gone anyway, unless the other, more capable child has an incentive not to let everything you ever had completely crash and burn.\n\nYou're punishing one daughter for her achievements.\n\nA compromise would be to split everything but the house equally, write it in the will so the underachieving golden child still has somewhere to live, but also give the capable daughter a small stake in the property so if anything happens, she can ensure the house is kept in a liveable state.", "YTA 100% I will never understand why parents think because one kid is doing well they should be punished for it. What if your other daughter has some life altering situation happen where she ends up worse off? Writing a will off the current situation is incredibly short-sighted. Do you want your daughters to have a relationship when you pass? Because the way your will is set up-they will definitely not.", "YTA- Emma is irresponsible and has no ambition. Ask yourself honestly what she would do with those assets? You have no idea what Sam’s actual situation is and that money might help and it might just be a bonus. You have always favored Emma and it shows", "im gonna say from experience it should be split 50-50.. if not it will be problematic, problem for you now bc sam now wont come over for holidays or maybe she will decide you cant see your grandkids… later when you are gone she will probably have no contact with emma…\n\nIts best just to do 50-50.. as someone else said , you dont know what may happen years down the road…", "YTA. It feels like you’re punishing Sam for doing well in life. \n\nThere’s not reason it shouldn’t be 50/50. What if Sam falls into some hardship after you pass? \n\nI think not having it even could break up family members and make everyone resent eachother. \n\nYou should be able to trust Sam to help Emma if she needs it.", "YTA. It’s not about the money. OP is showing favouritism to the same child she’s always shown favouritism to. She describes Sam as an “overachiever.” Kids often go that route to please parents who don’t show them enough affection. \n\nEven if that’s not the case here, why would OP tell Sam about the arrangement? What did she expect would happen? Even if Sam loves her sister, can’t OP understand how hurtful that is? OP could’ve handled this much more delicately but clearly she had some sort of bizarre point to make to her younger daughter. Why?", "YTA. So you admit you raised your daughters unfairly, coddling one over the other and giving her more. Now you want to continue that pattern when you die and expect your unflavored daughter to just be fine with it. The reason your one daughter is struggling is because you never expected anything of her and raised her accordingly. Now you’re just going to reward her for being mediocre and lazy. And, also, ADHD doesn’t keep people from succeeding in life. Sounds like you’re just going to continue making excuses for your favored daughter.", "Gently YTA although I don’t envy you the position you are in. \n\nWills are basically the last piece of communication you’ll ever have with your kids and you are effectively making Emma a priority over Sam. That is what your will is telling Sam. \n\nI have ADHD and also go zero support- it is very very hard at times (I work and am ok financially but it’s been a long road).  My brother doesn’t have it and life has been easier for him but I definitely don’t think it’s up to him to sacrifice to make my life easier, and would be pretty hurt on his behalf if our parents did this. \n\nWhy don’t you focus on the minimum Emma needs, rather than just giving her all the money.  So rather than the whole house, leave her enough to get a small condo etc.  Talk to Sam about what she would feel ok with and try take it on board", "YTA. Isn't about the value of the heritage, you are clearly expressing that you are more concerned with Emma... thats favoring by definition.", "YTA - I just... Has giving Emma more the Sam helped Emma in the long run?", "YTA \n\nInheritances really should be split 50/50 unless the kids agree. \n\nIf Sam feels you have shown Emma favourtism forever then is it worth it to destroy your relationship with Sam and the sibling’s relationship with each other. \n\nIt’s your money to do with as you want. But remember everything has consequences! \n\nIf currently the house versus stocks is similar then talk to Sam! And say let’s revise this in a few years as you have spent money! \n\nOr blow up your relationship for something that may never come to fruition! You could outlive a kid and this argument meant nothing.", "YTA. It's your legal right to do that, but if does make you an AH", "INFO: out of curiosity, is Emma aware or this and if so, what are her thoughts?\n\nNAH. I originally thought N T A but I see Sam’s side too. I get what you’re going for: equity vs. equality… and it’s your choice! You can do what you want. But 80/20 is… a HUGE difference. I would be crestfallen if I was Sam. It’s not about the money- it’s about the statement / principle. Even if Emma needed more help as a necessity, it may be the case that it came at the cost of the attention meant for Sam. \n\nYou and Sam need a heart to heart and unpack any resentment she might have and go from there.  Best of luck to you!", "NTA.\n\nNormally equal split is appropriate, unless a child is estranged or NC. However, I am worried about the lack of empathy from Sam. She obviously does not need the money. Why is she reacting like this? What was their relationship growing up??", "YTA 100%. Coming from personal experience it makes the siblings fight & shows absolute favoritism, even if you don’t see it.", "NTA - Your two kids are in very different financial situations. However, I would try and accommodate Sam’s wants as far as things like family heirlooms go. Is there a way that you can try and show Sam how much she means to you apart from the inheritance?\n\nEdit - names", "Maybe a slightly closer split, like 60/40? Or could you separate it, like money/investments/stuff? Practical stuff like a car might be more beneficial to Emma but sentimental stuff like jewelry to Sam might make it feel more equitable.", "Could you leave the house to Emma but have both girls name on it. Then Emma would be responsible for the upkeep and taxes etc. That gives her a safety net and drive to work because sometimes with ADHD they become disinterested in doing anything if they can get away with it. \nThen split any cash 50/50. Have money in a trust for Emma to make sure it lasts.\n\nIt’s important that your Sam has a safety net too In having half a stake in the house that hypothetically Emma is living in in case her marriage goes pear shaped. \n\nThat’s how I would do it. Still 50/50 but Emma has a house to live in. If anything happens to either girl… that share goes to the other one.", "It depends on whom will have custody over your healthcare, once you are too old to take care of yourself. Your ADHD daughter that ain't doing well, but got 80% of your inheritance, or the daughter that made something of her life, and can take care of herself, but got only 20% from you?\n\nI know just that: if I would be the 20% daughter, I'd just drop you in the cheapest retirement home,  I could find in the whole country, once you can't take care of yourself anymore, and visit you maybe once a year, to make sure you remember why you are where you are. Favoritism - no matter what words you use as  an excuse - always comes with a price. I hope you'll be ready to pay for it, when the time comes, if you play favorites.", "YTA and a massive one. Sam will go no contact with you and rightly so. Your approach is essentially punishing Sam for being successful and financially responsible. I suspect Emma is your favorite and you are just making excuses.", "YTA.\n\nAnd I have ADHD \n\n>She was always the overachiever and I don’t think she needs help financially. \n\nSounds like Sam was an overachiever because she knew she wouldn't get any help from her parents. It honestly sounds like you have always treated Emma like a fragile egg that would get all the care and Sam like a stone you can kick around that won't get hurt anyway.", "YTA.\n\n Sounds like Sam has been NEGLECTED her whole life.\n\nYou could argue it was necessary due to Emma's needing more attention but at the end of the day:\n\nIT IS NEGLECT.\n\nIt is punishing someone for doing well.\n\nOP is proving that till the end of her days,  she cares less for Sam.\n\nThis is especially true after one of the OP's comments that Sam had stomach issues due to the way her parents treated her.\n\nI get the feeling the OP should have given Sam to some other couple to care for because she was not exactly getting parental affection or care.", "If Emma is working as a stocker and barely making it, she is not going to be able to manage the care and maintenance of a house. Better off to buy a condo or someplace that offers maintenance to remove that burden off of Emma. \n\nI can see Sam's point of view. If she inherits 20%, don't expect her to do anything for Emma. Al finances should be handled by a third party.", "Stop talking to your children about the inheritance. Not their business while it's still your money. Talk instead to estate planners. In the case of a child with needs, inheritance is often unequal. Estate planners will help. NTA", "NTA.\n\nFair is different than equal.", "NTA. its your money. 500k a year and still want to fight over her moms inheritance when the sister is a minimum wage worker with no savings?", "NTA Your daughter may feel like she is being punished for being successful, though. It's your money and you are entitled to do what you want with it but that's probably her thinking. She may also see the 80/20 split as a statement of how much you value Emma over her. Not saying the choice is right or wrong either way but something to consider.", "YTA", "YTA it seems like your punishing your other child for their success.", "ESH. For Sam, it isn't about the money. It is how she is measuring your love for her. \n\nI asked my mom to leave more to my sister and her family because they need it more. But I did the asking. Mom was resistant to unbalancing things because she worried it would hurt our relationship, but I explained why it was important to me that they got more. So she agreed.", "NTA\nEquality is giving everyone the same pair of shoes.Equity is giving everyone a pair of shoes that fits.", "NTA. It’s your decision on how to split the will. It may seem unfair, but if Emma requires additional support when obviously she would need that money (or at least the house and car specifically).", "I lean towards NTA. Maybe 70/30 might be a little more palatable? Personally, I would rather more money go towards my sister if I was in a financial situation like Sam’s.", "Just tell her you love Emma more like it's obvious to everyone and move on. You have a favorite daughter. If that makes you an asshole than you are an asshole. Nothing wrong with picking favorites among your children though right?", "YTA you’re showing clear favouritism. Sarah worked so hard only to have her mother use that against her where inheritance is concerned. Sarah clearly feels like you and your late husband have shown favouritism towards Emma all their life and you doing this is just pushing her away even more. Don’t play the victim card later on if Sarah cuts contact with you. With the way she is being treated by you and was treated by her father, she has every right to", " NTA. I think it's a good decision to split 80/20 especially as Sam has shown that she's still carrying negative feelings from how you treated her and maybe will not be willing to help her sister out.", "NTA. It’s part of a parents job to look out for their kids. Ensuring your child has a place to live in your absence is peace of mind. The fact your daughter Sam wants you to give it to her kids over her sister speaks volumes. She already has financial success and is upset over the idea of missing out on money that won’t change her financial situation. For Emma, it means financial security. \n\nSam sounds really selfish, and it’s a little sad she’s unwilling to concede to improve her sister’s situation. It sounds like Emma might have been behind in school, but Sam still needs to grow up.", "YTA.  I can understand your reasoning. Why did you tell your daughters about your inheritance plan?", "NTA. At the end of the day it’s your money to do as you please, but as a sibling that was told “I help sibling 1 more bc you’re fine. I don’t have to worry about you”. OK but damn it’d be nice to have help too every once in a while.  Your successful kid shouldn’t be punished for doing well. NM. YTA.", "NTA. Sam doesn’t need the help monetarily, if she was interested in safe keeps and memorabilia she should have first choice but she does not need the the same support that Emma needs. Anyone who is wealthier than half the country should not be complaining about someone who is low income and struggling getting some more support. Your not punishing your daughter by not helping her because a large majority of people do not get inheritances in general and someone who has multiple properties worth millions should not be greedy and feel entitled to money quite literally going to help their sibling.", "NTA. This is equality vs. equity. In my family, I am Sam (except there are two Emmas). I expect my parents to leave any inheritance primarily to my other two siblings, although I believe they intend to split their funds between sibling 1, sibling 2's child (my nephew), and my own two kids.\n\nhttps://interactioninstitute.org/illustrating-equality-vs-equity/\n\nIf I were you, I would probably do something like 60-70 to Emma, 15-20 each to the two grandchildren.", "NTA. Your biggest mistake was telling them about your will. But the small silver lining is that now you realize how Sam views you: $$$.", "Oof I am leaning toward ESH\n\nYour husband wanted an equal split. You are punishing one daughter for doing well in life. You are unnecessarily causing resentment. It would have been one thing if you had spoken to Sam first and done this with her blessing.\n\nOn the other hand, nobody is entitled to an inheritance you should have just kept your mouth shut and done what you wanted. Is it favoritism? Yes. But is it equity over equality? Also yes. Sam is an AH for fighting over a gift.", "NTA You are allocating your inheritence in a way that you feel is equitable, ensuring the needs of both daughters are met.", "NTA. I applaud you for using equity instead of equality to calculate the inheritance. Good for you! I wish more people did this.\n\nMaybe see if there are some sentimental heirlooms that can be split, though. Both daughters deserve some of those.", "NTA. It's a shame Sam can't see her life compared to her less fortunate sister and have any empathy here? What money will do to peoples perspective is wild.", "NTA - I have ADHD. I am 35 and have had a very good career (an ivy league education, etc) BUT I deal with ADHD and don’t have the type of support system in my life to help me get back on track when I need it. It’s wrecked my life in more ways than I can imagine. Despite my intelligence and no matter how “up” I get in life I always worry about my future. When will I derail? Will everyone notice when I am losing my mind again? It’s happened to me over the course of my adulthood twice, there’s so little stability of life when you deal with ADHD. I think it’s kind of you to help her. Life will never be easy for her, no matter what kind of access to help she gets. To anyone with ADHD kids, take notes. We do need lifelong support and encouragement, and having a guarantee that you can keep a roof over your head goes a long way. It is often a very invisible disability. Your kids don’t have equal needs and one is very financially stable. You’re doing the right thing. Your other daughter will learn to deal with that, her reaction is purely selfish. I trust that if she had to support her sister in your absence she would not. Do what your heart is guiding you to do.", "YTA. This favoritism will only split up the girls in the future..", "NTA. The whole point of inheritance is to aid those left behind.  If one child needs it more than another then that's your call to make.   Equality and fairness aren't the same thing", "I’m sorry but Sam seems really a bit greedy to me. She is married to a doctor and makes her own money as well. I can see how she would feel like Emma is being rewarded for underachieving, but she is so much better off that Emma in every single way.  Let Emma has one win. \n\nMaybe is Sam will have a reasonable conversation you can try to explain that the division of assets is not a reflection of how much you love them. It is practical. \n\nI do get how people are saying it should be split 50/50. But it sounds like Sam doesn’t care much about Emma anyway so you aren’t destroying that relationship. Ultimately it is your will and you can do what you think is right.", "NTA as a parent you worry about your children and their futures. Sam is well off and the money can really help Emma.", "NTA. Emma needs the money way more than Sam.", "INFO: have you asked Emma whether she would want to live in the house? It's possible she wants to live elsewhere in the future and therefore would be okay with the house being sold so it could be slightly more even. You can give Emma the car since it's basically hers already based on how you described it, and then split the rest of it more evenly between the kids, so you've still given a bit more to Emma but it's closer to being fair so you don't make Sam feel like you don't love her as much, because that seems to be part of the issue here. If Emma does want the house, then I guess just try and figure out ways to make sure Sam knows you love her too. Good luck.", "Talk to Sam about the difference between equality and equity.", "NTA the right thing to do is to help your children to both have as high a quality of life as you can. Youre right, your other daughter doesnt need the money the same way. Why does she feel slighted? Its just money, make sure that keepsakes and things are split fairly but the cash and assets of value shouldnt be a big deal to her. One of your children earns near minimum wage and the other has mutiple homes, and the one with mutiples homes is upset she might get slightly less money? \n\n\nAlso, holding needing tutoring against her as an adult is low, you made an effort to help your struggling child and its being held agaisnt your struggling child.", "NTA you’ve made a reasonable decision and sam sounds selfish", "NTA but you shouldn’t have told them anything. Leave a letter explaining your decisions that is to be read once you die.", "I have severe ADHD and Autism and I have managed to function and make a life for myself. I don't see why you would seperate your stuff like this because you have no idea what their lives will be like when you are deceased. They could completely swap and Emma be more financially stable than your other daughter, then you basically screwed the other daughter. I guess if you are ok with that fine but I still think YTA.", "That's a tough one", "NTA it’s the money you earned and you can choose to spend it how you want.", "NTA, because Emma is going to struggle harder without the resources and Sam is already well off.", "NTA.  She already has a house and money, and your other daughter needs more support.  Nobody owes their children an inheritance.  She should be happy for whatever she gets.", "put it in a trust so sam cant get to it or sue the estate.  i work in finance so i have seen cases like this unfortunately.  i totally get why u want to give emma more in your will.", "NTA but you shouldn’t have said anything to either of them.", "NTA it is your money you can do whatever you want with it.  However, don't be surprised when Sam cuts off all contact with you as soon as she is able and Emma has a new Jetski in the driveway.  The money isn't the problem, you are.\n\nSource: I was Sam", "NTA. It’s your business to decide how to divvy up, no one else’s.  It’s easy for a child to look at a situation like this in black and white. Except it isn’t black and white. You’re taking all of the information you have and doing the best you can with it. Maybe see if there are items of sentimental value that Sam would want to make sure she gets. But as far as the monetary portion of the will, it’s no one’s decision but yours. I would caution that you make sure your will, living trust, or whatever you go with is iron clad. You may also want to help Emma figure out exactly what to do with the inheritance she will receive. It sounds like she has needed extra guidance throughout life and this will be no different. And with Sam already being so aggressive about what she deserves, I would be fairly certain she will try to contest it or come at Emma. Make sure Emma is prepared ahead of time and has a plan in place.", "YTA", "NTA. I have two siblings. We all have understood our whole teenage and adult lives that our mom will sometimes need to give more of whatever to one of us over the others. We understood this before we ever had kids of our own. Mom doesn’t love us in different amounts. She loves us equally and differently. And just like that, she gives attention where it’s needed. If there’s anything that my mom did right, it was teaching us this fact. It taught us to be more of a team. We support one another the same way. If my brother gets some help or is he got more attention as a kid at a certain time from our mom, that’s cool. He needs it. And because I love him, I’m glad for it. \n\nYour daughter needs to learn this. She has enough. She clearly doesn’t understand financial struggle. If she’s going to be mad at or resent her own mother over something as petty as money, that’s a bed she’s making. Not you. She’ll live to regret it.", "NTA. It's your money to do with as you please. As a parent, it's totally understandable that you would allocate your assets in a way that would best position your daughters for their future. Clearly one daughter needs more help. \n\nI also firmly believe that it's awfully entitled for kids to expect an inheritance. Sam needs to learn that the value of her inheritance does not equal howuch you live her.", "My parents if they were to pass, their property and business will all fall to my partner and I, and my sisters will get things like jewelry and personal items. They are fine with this arrangement, all of my sisters.\n\nWhy? Because I am bipolar and have been unable to support myself which has put a huge burden on my partner. My partner is also the only one working in the business in the whole family. He is my Dad's right hand man, and is already mostly running the business while my Dad is stepping back in his older age. My sisters all agree my partner is my dad's best friend. \n\nEveryone knows it's not favoritism, in fact I was always the black sheep. I was the easy child growing up so was mostly ignored until my bipolar developed during uni. \n\nSo NTA, you are just trying to look out for your kids, sounds like one is being greedy, imo.", "I would personally say NTA. One child has more/special needs at the moment than the other. It is rather sad that Sam feels the way she does, but, from what you tell us, she may not have the full picture, or does not want to see it. A will is not forever, you can change it as soon as something happens that changes your mind. Think of this will what will happen if something happened in the next 5 years. Then savings vs house are more or less equal so it works out. Then revise in 5 years when you know the situation then. Things might change in either girls' lives.", "It's your money, you can do whatever you want with it. If you wanted to donate to the ASPCA, that would be perfectly fine. The entitlement of your daughter is something special to behold.\n\nNTA.", "NTA Emma definitly seems to need more help than Sam. However, it might be better if you helped Emma out some now instead of just leaving it all to her at once. And as someone with ADHD I would suggest you stipulate that the money is to be used for a downpayment, emergence, or even a monthly allowance etc, instead of just giving it all to her at once. People with ADHD often have difficulty limiting their spending and getting a large sum of money could mean it just gets spent quickly and she'll be right back to where she is now.", "NTA, but Sam is. And selfish to boot. Will she take Emma into her million dollar home if she ends up on the street?", "Sam's got hurt feelings, but you're NTA, I think you're making the right call", "NTA, it’s hard for the children because they will feel unloved.  Me and my wife doing well and my elderly parents wants to split the inheritance all equal among the kids.  One of my brother is not doing well, partially because of his own fault but nothing malicious.  I told my parents that my share should go to him as I don’t need any inheritance.  Or if they’re afraid of what the other kids will think, they can spend it on themselves and have fun. In the end it is your money and you’re free to do whatever with it. Don’t feel pressured and do what you think it’s right. Nothing is fair and equal in this world. In fact if she loves her sister she should do more to help her.", "Have you ever let Emma stand on her own feet and try to live independently without your financial assistance? Without you hovering ‘just in case’ she needs me? Not saying Emma has no issues but you have never helped her be independant . How do you think she will cope when you not around? First teach her independance. \nGiving her most of the inheritance to make her life easier may seem like the right thing to do, however , does she know how to handle it? Taxes? Bills? Savings? Teach her that now whilst you slive and see how she copes..\nYour other daughter seems to have brought herself up and made something of her life yet you don’t acknowledge you are a contributor to making her feel not worth your time or money.. \nin the end Sam can lose everything tomorrow but she will bounce back because she has had to do it since a young age. YTA", "NTA, though it's a pity there's conflict. My parents are doing something similar. One of my sisters married a wealthy man whose parents gave them a house as a wedding present (in both their names). She won't be left as much as she's completely financially stable. She will almost certainly end up with more objects - antiques, furniture, silver, china etc, as she has the space for them. Unlike Sam, she's fine with that. I don't think this is an unreasonable approach in determining Inheritance, though I can see how it might feel unfair.", "I would reduce it a % whenever she brings it up.\n\nThey both should be happy you even leave them something.\nIt would be totally your right to use everything up yourself while you are still alive.\n\nAn inheritance is more a privilege than a right imo.\nAnd ultimately it is your money. So you can decide what to do with it.", "NTA.\n\nThey are in very different financial situations. Emma does deserve more, due to her lower financial status. Emma can use the money for bills, food, and hopefully better living arrangements. \n\nWhile Sam will only use it for her kids useless degrees, that she is fully capable of paying herself.", "NTA, assuming that if your assets besides the house and car were the same value that you would be splitting them 50/50.", "NTA Your argument is completely valid one and i would do as you do. While it is easy to play favoritism card in this case it's purely cuz one person needs it nore then the other. \n\nEven if Sam gets a divorce she has a good career and will get half of things in divorce (without prenup). Emma cannot succeed on her own and will probably have to work all her life if she wants to get by in her old age. So money will definitely come good to her but make sure to talk with her also so she can make some good plans so the make lasts for her.", "This is difficult. But ultimately I think it comes down to helping your daughters and that doesn’t mean equally. Emma is clearly struggling and needs help, you’re in a position to help her so you should. Your will changes her life. Sam doesn’t need the help, anything you give her is like a nice little bonus.l to her luxury lifestyle. \n\nPeople get so twisted when it comes to money and they have a sense of entitlement. You shouldn’t feed into that. \nMy sister literally stole $30k from my mother, and her identity, and my mother still continues to give her thousands of dollars for school or literally anything. My brother makes over $30 an hour and works overtime but claims he doesn’t have money even though he bought a house and a $60k car. The entire family gives him thousands of dollars because he can’t manage shit. Guess what I do, I’ve been on disability since I graduated college (10 years ago). I just recently got a part time job. I also decided to go to school. I’ve never received thousands of dollars from anyone. Even though my mother says she’d always be willing to pay for school she gave my sister 6k and I got like $500. So I’m not saying I don’t get help but the favoritism is so disgusting. Also, I never ask for the money. I realize it’s not my money and my family isn’t my personal bank. Whatever I get I’m grateful for because I struggle so much. It sounds like Sam is a better person than either of my siblings so she’s got that going for her, but if I was Emma I’d be hurt and disgusted that two people who are clearly not the same are being treated the same. I saw that you do help Emma out now in the present and that’s wonderful, Sam probably feels like because you give Sam so much now that she’s entitled to get something from you too at the very least when your will is enacted. As someone who is similar to Emma I feel like you should help her out, and you’ll make Sam upset but if she’s only interested in your money (when she has plenty of it!) then you know where you stand with her. She isn’t promised your money just because she’s your daughter. Your money and possessions aren’t automatically anyone’s. You could easily sell and donate everything to strangers. Which honestly you might want to tell Sam that you’re giving it away to other people if she won’t talk to you or be grateful for what you’re offering. If she’s going to be ungrateful for your gift then she doesn’t deserve it.", "NTA, it’s your money and you can do whatever you want with it. 80/20 seems very uneven and maybe 70/30 might make it more acceptable to Sam… I’m wondering why you had to tell your daughters about this split, might have saved you some of the drama.\n\nYour reasons for the uneven split are enough for any reasonable person to understand and accept the situation. Sam seems very entitled. I’d consider a trust for Emma to make sure the inheritance has longevity.", "NTA  This is your money to leave to whom ever you like. I would ensure your Will is iron clad so it can't be contested.\n\nMake sure that Emma understands your reasoning & wishes. You don't want her to be pressured into giving up anything.\n\nYour daughter Sam is being selfish. She sounds jealous. I don't think she is very empathetic towards her sister. Such a shame. \n\nYou are generous.  After that discussion I would change it to nothing for Sam.", "NTA. It's your money and property. Make sure your will is written so that it can not be contested.", "Nta - but honestly as others are stating you shouldn’t have told either daughter. You never know how life will treat either daughter so Emma could end up worse. I honestly don’t get why our culture places such an emphasis on inheritance other than greed. Its your money that your husband and yourself worked hard to acquire you get to decide what happens to it after your gone.", "NTA. Sam it's way more than okay financially speaking. If it was about sentimental value of the house she could have ask u to buy it from you many years ago and help you maintain it. Why wait till your death to care for it? Feeling entitled way too much.", "NTA you are doing the right thing imo. Maybe explain equality vs equity to Sam and tell her to reflect on her life with gratitude for what she has. Yeesh.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I have 2 daughters, let’s call them Emma(32F) and Sam(29F). My husband died of a stroke 2 years ago and he left everything to me. I’m rewriting my will as well in case something happens to me. Originally everything was split 50/50 between the girls but now I’m splitting about 70/20 in favor of Emma. \n\nEmma has ADHD and isn’t doing great in life. In those days everyone just assumed she was lazy and she didn’t get the help children today get until she was in her teens. She just finished high school and is working at a retail store as a stocker. It’s backbreaking and she doesn’t have much in the way of savings or anything. Her car was her father’s when he passed.\n\nSam is works in tech as a project manager and her husband is a doctor. They live in a million dollar house and has 2 kids. I’m not worried about Sam she’s always been very capable and excelled at everything. She was always the overachiever and I don’t think she needs help financially. Her and her husband probably take home $500k after taxes a year.\n\nI want Emma to inherit the house and car when I pass. I think it will be good for her because she can live in it or sell it and buy another one. Sam will be find and her and her husband have several houses and a summer home. But Sam is angry with me because I’ve made it clear that Emma gets most of our belongings. The bank savings and stocks will go to Sam but if I live to 80s she won’t have too much probably 20-30% of what the house is worth. But I think it’s fair because she is doing much better.\n\nSam called me to yell at me saying I’m favoring Emma. I reminded her of how much worse off Emma is than her but she said since they were both her daughter’s she should get things 50/50 or it’s favouritism. She said I should will half of the inheritance to her children for college funds but I reminded her she makes more and can save for them. I told her it’s not about me favoring Emma over her but Emma is worse off and she will be fine which resulted in her hanging up and refusing to come over for Christmas.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA . As the least favorite child who is likely not inheriting as much as my sibling, I understand why. Maybe it is partially favoritism maybe it isn't, that doesn't matter. It's your money your house you're dying wish.\n\nI know this is unpopular, but I could literally inherit $0 from my family and I know for a fact they still love me.", "NTA, but tread wisely. This isnt about right or wrong, it is about maling sure your other daughter doesnt feel slighted, and how to make sure the relationships are still in tact. This wont hust affect you and your daughters relationship, but also the dynamic between your daughters as well.", "I initially thought one way, but continued to read, NTA, ultimately it's your money to give as you see fit. It's also not up to grandparents to give inheritances to fund college, what happens if you live to 100, parents need to plan that without relying on their parents", "NTA.  OP, have you considered establishinf a special needs trust for Emma?  I am the Sam of me and my sibling.  Similar ages too. My sibling lives with our folks and works a retail job.  They have disabilities that mean they can’t work full time, and it’s unlikely they will ever be able to independently support themselves.  Our folks set up a trust to ensure my sibling will be financially taken care of when they pass.  A family friend is the trustee. Technically my sibling is receiving “more” of the inheritance.   It isn’t equal, but it’s equitable.  Of course I would take care of them regardless, but my parents said “we don’t think you would, but you could easily take advantage of sibling if you wanted to.”  A trust and someone else managing it allows us to just be siblings, and that’s a relief.  Also a relief knowing in the future I won’t have the financial responsibility of caring for them.  It is hard with “invisible” disabilities where people can pass… people think they’re lazy which isn’t true.  I don’t know Emma’s limitations and capabilities,  but a trust with a trustee to help with financial management would also ensure Emma’s future is secure long term.  I am no expert, but I believe money management is a challenge for many with ADHD.  Sam needs to learn that fair doesn’t always mean equal.", "NTA, the money you leave Emma has the potential to change her life while ensuring that she doesn't slip into poverty once you pass. Giving an equal amount to Sam, while technically the \"right\" thing to do, isn't likely to impact her financial future by the sounds of it. I know that some will say that you're punishing Sam for being more successful, but these aren't children anymore. Sam is a grown adult and should be able to move past the sibling mentality that everything should be split equally, that everything involving sisters needs to be \"fair.\"  Emma never asked to have bi-polar disease and has known that life isn't fair since day one. If anything, Sam should be comforted by the notion that her sister will be taken care of instead of treating you like Santa Clause on Christmas day. She already has more wealth than most people will see if a lifetime, that should be enough.", "NTA. Make your will reflect your wishes. No one is entitled to a inheritance.", "Nta it just falls under a gray area", "NTA, what is with rich people needing to hoard more resources than they need?", "YTA. But it *is* your money to do with as you want, so there's that. \n\nFor some context on my feelings here - there was a ~2 year period where my parents changed their will so that I would inherit 100% of everything if they passed. They told me this and they told me why. They did this because they didn't like my sister's long-term boyfriend/maybe fiance. My mom told me that she didn't want a penny going to my sister's long term partner (he was, objectively speaking, pure scum). I still thought it was an AH thing to do and said as much. My mom also said that \"it's our money and our will, so we'll write what we want, and when we're dead and gone and the estate is settled you can give your sister money if you want, we won't be around for it.\" Well, OK then, whatevers I guess. She never told my sister about the change in the will or used it as a way to manipulate things. Anyway, my sis and the scumbag broke up on their own for their own reasons and some time later my parents amended their will. FWIW, it's not an even split for us because my parents spent way more on my sister's education than mine, so there's a chunk of money in reserve for me to \"even things out\" eventually.", "Nta", "Sounds like you more or less ignored your younger child in favour of the older one. That was your choice but nke thst you're doing it again I wouldn't expect the younger one to lift a finger or give you a single penny when it comes to elder care, medical bills, etc etc.", "Maybe talk to Sam and give her something of sentimental value. For example your wedding rings or something that's her favorite. Let her get to choose her heirloom pieces. Sit her down and have a heart to heart. Tell her your worries about Emma and tell her that you love her etc. NTA.", "If one kid has ADHD, there is a chance the other one has it too, and you might have it too, its inheritable...Sam just may have it in combination with major anxiety which made her an over achiever and could have masked her symptoms. Everything seems to go smoothly for her, but did they really? Because maybe it seems everything went fine but she could have had Internal panic attacks. This doesnt give her any rights over your money, but it seems like she busted her as off to is where she is today. Not saying Emma didnt work as hard, but i feel like its a choice to do a job, Emma could do anything else if she wants too (its believed Einstein had ADHD too), and ADHD shouldnt be used as a scapegoat of why things in her life are terrible. \n\nYou dont know what the roles are when you pass... Sam could get a divorce and be fired and have meedical debt by then... to split it uneavenly now would be to apply equity to the current situation rather than to the situation when you pass, this makes it difficult to split it fairly. The only way around it is to regularly change it which i think is impossible to stand by. Equality and equity both can be unfair.\n\nIts all your money and you should make your own decision your NTA no matter what you choose because it is your money and assets. However, you never know what happens and i feel like you give Emma a lot of slack whereas Sam might feel overlooked. Best thing would be to talk it out with Sam and try to understand her. Then make your decision and review and adjust if needed", "NTA- this is your stuff to gift (or not) to whomever you wish, however you wish. \n\nI would urge you to speak with a probate attorney or someone with legal expertise in planning wills and/ or trusts for clarity and maybe not talk further with your kids on the matter if it's causing duress.  It will also make things easier should your will get challenged by your beneficiaries.\n\nThat said, it sounds like Sam is being a child. For her to refuse to come for Christmas over this indicates that she may feel some animosity toward her sister which will definitely come up again when they are both mourning your loss.  A sad thought, but you sound pragmatic.", "NTA. As a “golden child” myself, I would totally understand if 80% of my parent’s stuff went to my sibling who is struggling. I would be the one taking care of them anyway in the end. You should definitely put the money in a trust though.", "INFO: Would the house value be enough that if it was sold, Emma could still afford a nice home with half of the proceeds from the sale?", "NTA, \n\nYour logic is valid and while it does suck for Sam I think youre doing the right thing. I dont know what my parents did to raise me or maybe its just my personality but luckily my brother and I dont seem to care about those sort of things and if I was in Sams position I would agree with you. \n\nI think Sam might just be feeling some sort of resentment for feeling always got the short straw. I think her response should tell you everything. While the split would help one of your daughters succeed and most likely towards the end of her life when she might not have been able to buy a house and retire soundly,  Sam is thinking about sending her kids to college. She doesnt need the money and is already putting it off for future use. Theres nothing wrong with that but it cements the idea that she will be fine without it. \n\nHonestly its a sucky situation to be as a parent and these decision are hard but the best you can do is know that your kids are safe when youre gone.", "NTA\n\nIt's reasonable to help the child who needs more help. Perhaps there are other ways you can demonstrate how much you care about your other daughter. As the one who 'didn't need as much' in my home, I can attest to two things.\n\n1) I get understand that my brother needed more help than I did. And I'm glad he had it.\n\n2) Because of the time and attention he received, my parents sometimes made me feel invisible and taken for granted.\n\nLove Sam up, make sure you tell her how amazing she is. How proud you are of her. Do it often.", "I’ve got one sibling who’s had health struggles that have majorly impacted their life opportunities whereas I’ve been reallly fortunate in my career. I told my parents years ago that they ought to leave the vast majority of their funds to my sibling- I think it’s way more important that she have a baseline guarantee of financial stability than that the funds be split 50-50 in the name of fairness. I’d hope most kids in a similar situation would have the grace to recognize that there are different kinds of fairness in the world. So NTA for the will decision. \n\nWith that said, part of the reason that I feel this way is that my parents were always kind, fair and loving to us growing up. I never felt like they favored one child over another. It sure sounds like your other daughter is reacting to a broader sense of perceived favoritism from her childhood. Are you sure you’ve heard her out on this? It really may not be about the money here.", "NTA\n\nI think you need to have a talk with Sam about love and favouritism. It's a bit ridiculous she's still going on about \"favouritism\" at her age.. which maybe is understandable given she clearly has hangups... \n\nI'm assuming your daughters also don't have the greatest relationship with each other huh?\n\nMy parents have planned to split assets/properties etc in a way where it ensures my brother has to look out for my best interest and vice versa, and how neither of us could unilaterally make decisions on them. I dunno if there's a way you can do that (though I'm not sure their relationship is good enough for that tbh).", "NTA…first off, you don’t have to give them anything and the younger daughter needs to realize that with her greedy self. \n\nSecond, the younger daughter who is better off should be happy that you’re leaving things for the older daughter who is struggling so the burden doesn’t fall on her when you’re gone. My only suggestion is that you look into whatever needs to be done so that Emma will be financial secure whether that means a trust or a financial advisor in case she still having problems when you pass. \n\nI don’t think it’s favoritism for you to want to make sure one daughter will be taken care of and who needs more help when you’re gone. Hopefully things will improve for her and you’ll feel more secure. Sam already has support via a husband, children and in-laws. If anything she’s the one who seems selfish and entitled.", "Although I can understand you wanting to help out your daughter, but by doing this you are punishing your other daughter. You also can't see into the future, the financial roles may be reversed. Soft YTA.", "NTA. There is a significant differences in their income and it would make a much bigger difference to Emma. Does Sam spend the exact same amount of money on each of her kids to the penny? Same amount for clothes, sports, hobbies, camps, lessons, activities? As a parent, she should already know how this works.", "Maybe you can ensure that Sam’s 20% of inheritance is the stuff that holds the most sentimental value to her.", "I think you were too drastic going 80/20, also while mental health problems suck, I don't think you should favor one daughter over the other in this sense, focus on helping Emma but don't neglect Sam just because she managed to overcome her problems, that's like literally punishing someone for being successful.\n\nShe clearly doesn't need the money, so this isn't abut the money, it's about Sam having lived seeing you put more attention to her sister she sucked it up previously, but this was just too much.\n\nCan't say YTA nor NTA, cause you didn't do it with bad intentions, unfortunately there are bad things that seem to be good, and so there are good things that seem to be bad.", "NTA. Do whatever you would like with your estate when you pass. Though I completely fail to understand the purpose of telling the kids what is in your will before you die. Why deal with the drama? Let them fight after you’re dead.", "NTA but I would make it more 70/30 considering the circumstances between the two siblings and put contingency agreement on the house that if Emma decided she wanted to sell the house, it would be split 70/30.\nI definitely would put money in a trust and give her money periodically instead of one large sum.", "ESH in terms of:\n\n1. No conversation before hand with the daughters. \n\n2. It’s your money so Sam doesn’t “deserve” any of it however, see point 1. It is equity over equality which can make sense but from Sam’s perspective she’s being punished for doing well. At the same time, Emma was punished essentially for having different brain chemistry that was undiagnosed. (Also, how did you not get her diagnosed if you knew she was struggling? There has been help for kids with ADHD for far longer than 15-20 years when Emma would have been early to mid teens).\n\n3. You haven’t considered how this could affect the daughters’ relationship with each other. Fighting over money is a huge reason why siblings / relatives fight and end up not talking to each other. All that because you DID favour one child over the other for, from Sam’s perspective, Sam making good choices and succeeding in life. \n\nThe only person who doesn’t suck is Emma. I feel for this poor woman as she’s stuck in the middle, struggled because of late diagnosed ADHD, and is now probably getting hounded to not accept the extra money, possible getting into bitter feuds over it and a mother who pities her existence. Yeesh.", "YTA. You really seem to resent Sam for some reason. Based on your comments and the way you’ve described Sam’s life/glossed over her eating disorder yet put Emma’s ADHD on a pedestal, YTA and need to recognize that Sam is ultimately upset that Emma, yet again, is being favored. It’s not about the money, it’s about the blatant favoritism.", "This is why people create marital trusts. When one spouse dies, the other cannot cut inheritance to some of the heirs. The husband should have done this. Now his daughter is getting the short end of the stick as punishment for working hard.\n\nYTA.", "NTA\n\nI am in a similar position as Sam’s.\n\nI have two siblings who are doing “ok” and I am extremely wealthy. Recently I talked to my mother about inheritance and I told her she should give everything to my siblings. I don’t need anything and it could mean so much more for them. To me this is common sense.\n\nThe fact that Sam doesn’t see this like that, makes me think there are some unresolved issues between her and you and/or Emma. Maybe focus on resolving that before talking about money?", "Just going to put this out there. While ADHD is on a spectrum (some cases more severe than others) and, yes, early childhood intervention does make a huge difference- executive functioning skills can develop for people with ADHD but it is usually on a later schedule than other people. In other words, with help, Emma can still make a lot of life improvements. \n\nHave you ever talked with her about what she'd like to be doing with her life if it isn't stocking? There are more support systems in school for her to return to. If anything, at least plan for some financial education. \n\nIf you make a trust or will do not leave her sibling with the task of managing it. \n\nI think you are NTA. If one child has multiple homes and is taken care of, it makes sense to leave the house to the other. I believe it is your money to decide how you want to be divided. But, you had to know it would hurt Sam. I would try to figure out some way to make it up to her- even if it isn't with money- so that the sting of what feels like favoritism is lessened. It still may never be ok with her.", "Yta. Not in a mean way, but you’re literally ignoring her feelings, future financial changes, and your late husband’s desires. It really doesn’t sound like it’s a money thing if she’s offering to put it for her kids instead of her own pocket. You acknowledge that you’ve, as a result of circumstance, put more effort, time, and love (whether intentional or not) into your other daughter. You’re probably not a bad person or anything, but you’re once again proving to your kid that your other kid is the primary focus while they’re just an afterthought. And the evidence? You literally explain how you’ll only be leaving her what’s left moneywise after you spend it, aka the change left in the couch cushions, while the other child gets a guaranteed amount of “love.”", "NTA Your money, your decision without question.", "YTA. When you have kids, it has to be as equal as it can be.", "NTA, it’s your money, and like you said Sam is going to be fine, there is no reason for her to have that money other than the idea behind it..Emma will actually benefit from the house and such, these things she may never be able to get otherwise, it sounds like Sam is an entitled brat.", "YTA\n\nMostly for how you’re handling this! \n\nI understand that as Emma is the child visibly in trouble you’re really set on helping her but it seems like you’ve always made Sam feel like she’s on her own to sort her own stuff out and that she can’t rely on her parent to help her.\n\nHave you considered that you don’t know all of Sam’s circumstances and perhaps she could have used the money? \n\nOr have you considered that this is the last straw for Sam in a whole series of events where she just always had to settle for less time and attention and money from her parents?\n\nDo this for her. Be her parent equally as well. She may have needed one more than you think.", "Technically you can do whatever you want with your money but you can’t pikachu face when your daughter calls you out for favoritism… additionally seems like you’re punishing her for being capable.", "INFO\n\n1)  Your money; your decision.  \n2)  Sam and her hubs pull in $500K / yr *and* have several houses?  And Sam wants more...?  \n3)  Sam doesn't need the boost; Emma does.\n\n*Prima facie* it looks like you're making the right decision.\n\nHowever...\n\nIf Sam, who appears to have so much, is complaining.....then this might not be about the money.   Sam already noted that *growing up we always spent more on Emma than her*.  \n\nIs there more to this story...?", "YTA, team Sam checking in.", "Just do 60•40", "Soft YTA. As someone with ADHD I understand where you're coming from but you're not seeing how you sidelined Sam in order to handle Emma with kid gloves. To Sam this is just yet another example of you punishing the high achieving kid and focusing so much on the neurodivergent child that it probably effected her life path.    \n\n\nEmma probably does indeed need the help but for once, please, dont insult your other daughter one more horrible time even once you've passed on.", "This is going to backfire so badly 😂 you're driving an even bigger wedge between your daughters (you started when they were children). When you die and leave this 80/20 split, I guarantee Emma will spend all the money and be homeless anyways and then she'll try going to Sam for help because you are no longer there and guess what, Sam won't be there either so that will leave your daughter where exactly? Jesus you should have really helped Emma stand on her feet a long time ago. I have ADHD and was pushed to stand on my own 2 feet and guess what, I did just fine. You are enabling her. I'm so hopeful that Sam sees you for the person you truly are and cuts contact with you and Emma. Her life with be better off without you. YTA in case that wasn't already clear 😂", "NTA", "YTA... this absolutely reads as favoritism. You're basically punishing your one daughter for having her life together and being successful, and rewarding and making excuses for your other daughter who has not achieved as much. From what it reads, your other daughter already has felt some of this favoritism, and I'm sure you paid extra attention to her sister because you \"felt she needed it.\" Maybe she was never able to find her footing, not because of her mental illness which plenty of people have, but because you have enabled her your entire life.", "YTA - you obviously favor Emma and it shows. I feel sorry for the 29yo daughter. She's had to take crumbs practically her entire life.", "YTA", "NTA. But mostly bc it’s weird as fuck to be mad about money you *COULD* be inheriting anywhere from 1-30 years. You should be spending your money and enjoying life with your family. \n\nI hear where Sam is coming from, when my grandparents passed I had a small inheritance that I put towards my kids savings and college because I want to give them a leg up. I know my cousin was given a larger share because our situations were different at that given time. except I’m not mad about it because I wasn’t expecting any money. Death really does bring out the worst in people. \n\nYou can continue to update your will regularly, my grandma did it at the drop of the hat and informed us every time she kicked someone out. You should really look into setting up a trust though.", "Info: Did Sam have to go without a lot (social outings, hobbies etc…) because Emma needed attention or money?", "YTA & I think Sam's resentment probably stems back further than you think\n\n>I'm not worried about Sam she's always been very capable and excelled at everything. She was always the overachiever\n\nWhat this often translates into is: this child figured out pretty early on that they couldn't rely on their parents to be there for them emotionally or practically (in this case because they focused all their attention on the 'problem' kid) so they became self sufficient at an early age out of necessity. Then they were praised for being so \"good\", \"responsible\", \"mature for your age\" - and they were so desperate to get this praise and love from their parents that they continued striving for more of the same. The parents may have even compared the two with comments like \"I'm glad we don't have to worry about you like your sister\". \n\nIs this ringing any bells? Painful as it might be for you to admit it, I'd wager that is pretty close to how Sam feels. Then you add insult to injury by giving her so much less just because she coped the way she did. \n\nI assume you're hoping you've still got at least another 30-40 years on this earth, so if you think Emma isn't doing well in life, explore what you can do to help her now, then give your kids a fairer split of the inheritance.", "NTA", "Hmmm I’m seeing a few issues here. You’ve implied that Emma has struggled and isn’t doing great at life. I would think very hard about whether or not Emma would be able to deal with everything that comes along with home ownership taxes, upkeep etc. as it seems as though currently you are doing all that for her. It’s all good and well to leave her the house, but ensure she is able to handle it.\n\n\nAs far as Sam is concerned, this isn’t about the money for her, it seems that she has been neglected by you for her entire life and Emma getting more inheritance is just the latest in a long line of grievances. You mention that Sam is an overachiever. When one sibling is getting more attention, the other will look for ways to get an equal amount. I’m guessing Sam thought you would notice her and be proud of her and acknowledge her if she got good grades and achieved great things. It seems not to have worked, and you left her to do her own thing. Her feelings are hurt. She is hurting.\n\nI get that Emma needs your help, no doubt about it, but I think you need to acknowledge the pain you have caused, and are still causing Sam to this day. Even if it was favouritism for a reason, it is still favouritism.\n\nI would softly say YTA, but more for past actions.\n\nEdit: I just saw that you said Sam had an eating disorder due to you and your husband. Hard YTA, Sam should have been cared for as well.", "YTA. \n\nPUNISHING is the word I would use. Punishing one daughter for their success.", "NAH Your logic is sound in trying to make certain both of your daughters cope in the world. Unfortunately many people end up looking at the inheritance as a measure of how much they were loved by the departured and this is a significant facture in many bitter squabbles over the wills and estates.\n\nYou will have hard time explaining this to your well off kid, but think of what other ways you have of making your love felt.", "NTA. I completely agree with your plan. It makes perfect sense and there’s no reason for you to feel guilty. It’s a little disheartening to hear Sam’s response. She has so so much more than the majority of people in this country let alone her own sister. Emma needs more help. That’s just the way it is and Sam should understand. She should be grateful for what she already has in life at such a young age. You might consider a trust for Emma. You would need to find  a trustee (there are people who do this professionally - try your bank) to help Emma manage the funds so they last her or at least to make sound investments. Stick to what makes sense. You already know what that is. Good luck.", "I'm going with NAH, because I can see both sides.\n\nYou are trying to look out for your daughter & I can understand that. I have ADHD, and I know that my mum is worried about my financial security more so than my two younger siblings, for a variety of reasons, which all come down to my ADHD & how it effects me.\n\nBut I can also see Sam's side of things here, to go from a 50/50 to 80/20 is a pretty significant change.\n\nI think you should definitely have a chat to her about your reasoning, mother-to-mother. Explain your concerns, and without breaching Emma's privacy, maybe see if you can explain how her ADHD hinders her.\n\nI am not sure how severely Emma's ADHD impacts her, but is there anything that she enjoys that you could use to help her find some more stable income? I know a few people who have ADHD who have managed to make careers out of things that were their hyper-focus, so maybe that is something to look at? And definitely, no matter what, anything that you do leave to Emma should be left in Trust so she doesn't impulsively spend it all on something insane.", "YTA, obviously it is but to you as it is your money and estate but favouritism sucks, especially if you’ve done this their whole life. I don’t think it matters wether Sam is well of anyway, I think it’d be different if she wasn’t talking to you. Emma had the same opportunities to go to uni etc, and should not be excluded because of her job. \n\nIf you were elderly and Emma was the only pne caring for you it is more than understandable that you want to adjust your will but at the moment it just seems as you are trying to justify that Sam doesn’t deserve it because you feel guilty that Emma didn’t turn out the same", "i’m sorry but one daughter has MULTIPLE HOUSES and the other does not even have ONE. no way any of you guys in the comments are stupid enough to think she’s TA…. as a child of three where we are all relatively successful… i would absolutely hate myself for fighting for 50% if my siblings had NO HOUSE and i had MULTIPLE and was a MILLIONARE?!?! nobody in these comments have any grip on money", "NTA\n\nThis is not an equal division, but an equitable one. You mention that Sam and her husband already own multiple properties. They very clearly will be fine with a smaller portion of the inheritance. What is the relationship like between the two sisters? It would probably have been better if you'd had a conversation with Sam sharing your decision and thinking process before presenting it to herr as a fait accompli. But what's done is done.", "Oh YTA. Sure, it’s your money, but you are favoring Emma over Sam. Sam doesn’t deserve to be punished for their success. Emma doesn’t deserve to be favored for failing. Your kids will resent each other forever and it’s just not fair. Yes yes, life isn’t fair, but if you can make one portion more fair, why not??", "YTA\n\nafter reading all your comments, etc - yep, you're the asshole.  You absolutely favour Emma, and how is giving her non-liquid assets going to help her at all?  How will she pay the taxes, upkeep, etc?\n\nHonestly, sell the house and car, split it 60/40, and have it in trust for Emma if you absolutely must do something like that.   Don't be surprised when Sam stops talking to you, either.", "I think everyone needs to look at OP’a comments. Sam had an eating disorder as a teen apparently, her father didn’t like her (which OP frames as not getting along and contributing to the ED), and from the way she talks about Sam as a person makes it clear OP doesn’t like Sam either. My guess is Sam was an oopsie and they made sure she knew it without them ever saying the words out loud to her. \n\nThis isn’t about the money to Sam. It’s about Sam still trying to convince herself that her parents did love her even though their actions have made it extremely questionable. It’s about how she excelled and overcame an ED (probably on her own from the way OP avoids answering the question of if she paid for Sam’s treatment or not) all on her own while her parents enabled and doted on Emma. This reeks of clear favoritism. \n\nNow! Before people come for me, Emma is honestly just as much a victim of her parents “parenting”. They didn’t prepare her for adulthood and instead of getting her ACTUAL help like inpatient care, OP just enables the bad parts of Emma’s mental health. No, I’m not saying OP needs to leave Emma to be homeless. But if she’s barely functioning, that’s a serious issue. OP seems to think giving her a house she owns outright will help. But homes fully paid off can still be taken if taxes go unpaid for years. I bet my bottom dollar that OP reminds Emma to pay her half of the rent otherwise Emma would forget (ADHD brain fog affects memory significantly). \n\nOP, YTA. Not just for the obvious favoritism but also for the huge disservice you’ve done to Emma in getting her fully prepared for adulthood. Get Emma enrolled in some inpatient or intensive outpatient care programs, call a family estate lawyer and set up a dispenser trust for both, and split it between them based on the lawyers recommendation. The anger from Sam isn’t about the finances.", "This is a tough one. I understand both the mother's perspective and the daughter's. Personally if it was me and I was doing well, I'd let my other sibling get the majority of the inheritance, but I can see why the younger daughter is upset. If OP did anything wrong, it's that she didn't discuss it with the more successful sibling first.", "Yes yta and you are definitely showing her you favour Emma!", "YTA. You’re punishing Sam for being successful. What happens if her life takes a drastic turn? Universe forbid, but severe illness, disability, divorce, being widowed would drastically alter her life and ability to support herself and her children. I was in my mid thirties and a health care professional when I was injured at work and became disabled. \n\nYou are favouring one child, and from your comments, it’s a lifetime commitment.", "NTA. Mom can do with HER estate as she pleases.", "NAH.\n\nDo whatever you want.  However, unless you're planning to die in the next 25 years, neither of them will benefit from it in any meaningful way.  Emma, whatever issues she might have, is still going to have to figure out how to live her life without the extra money.", "I would have said YTA until I witnessed a situation where a smallish inheritance was split between siblings, one a millionaire and the other in a moderate amount of debt. The millionaire got the other sibling to sign over a1/5th of their inheritance to cover the costs of running the property richer sibling had bought for their parent, so rich sibling wouldn't be out of pocket while they tried to sell it. The inheritance is basically fun money for the rich sibling, although some being put in trust for kids. The poor sibling won't have much after clearing debts (including 10k owed to rich sibling) and settling divorce. \nSo I get that it's sometimes not as simple as splitting things down the middle, but how you handle it makes the difference between yta/nta.\nYou need to discuss it with them, and make sure that they are treated equally when it comes to sentimental items.\nIt's a minefield! But think you need to consider the impact on their relationship when you are gone.", "NTA But why not help emma now instead of making her dependent on your largesse? Have her move in, give her a stipend, and pay for school. 32 isn't too old and ADHD isn't an excuse today nor was it when she was a kid, I'm 10yrs older and there were plenty of resources/meds/therapy when I was in middle school for me and other classmates that were diagnosed with ADD.", "I'm leaning towards YTA\n\nRegardless of your reasoning, you think one of your children deserves more than the other. That is favoritism and will nurture resent between your daughters.\n\n>She reminded me that growing up we always spent more on Emma than her. But that’s because she was at the top of her class while Emma was failing.\n\nI've seen enough of the AITA threads to know when one child falls behind/has medical problems, their siblings become invisible to their parents. Something to consider.\n\nIf I were you I would try to help Emma help herself long term, ie, higher education so she can support herself. What medications is she on for her ADHD? Has she tried seeing a psychiatrist? Why not attend some community college classes? Maybe loan her some money so she can transfer to a university?\n\nFor the record, I also have ADHD and struggled at lot in school. It took a lot of effort to find a study method that worked for me. I'm not saying \"well *I* can do it, so what's *your* excuse!?\", I want to convey it's possible to succeed in academics with ADHD.\n\nIf all of that seems like too much work you can go with your strategy.", "If I were you I'd sit down with both kids and explain your reasonings. I'd also make sure Emma not get a lump sum, but set money up so that it pays the bills and house (if the house has payments due for ex). Sorry, my sibs have adhd and last time they came into money they blew it in six months.\n\nAlso NAH. I doubt Sam's actually angry about the money...", "Yta.\nMake the will as you want, but if in future you will be needing financial or other type of help, don't ask rich one.", "Dude you don't even understand mentally ill people. F*** you.", ">Emma gets most of our belongings\n\nHave you considered it's less about the money and more about the sentimentality of the items?\n\nI work in a jewellers that buys gold for scrap. You have no idea how often one sibling is willed the jewellery box and just straight out sells it despite the sibling desperately wanting to buy a particular item from them. These people come in heartbroken and sometimes they come in too late and their mother's wedding ring is gone forever.\n\nMight not even be jewellery. could be a piece of furniture, crockery ect.", "Soft YTA... if Emma hasn't figured finances out by now she most definitely wont figure it out when handed a sizable inheritance. \n\nThe YTA is slight because no one should feel obligated to receive anything upon your death. But I can see where the other daughter is coming from. It's more attention and assets being dumped on Emma even in your death.", "Pauh... thats a tough one. I think I go with NAH. I totally get were you are comming from. Emma has not chosen to have ADHD and to struggle. But I absolutely understand Sams feelings as I am in a similar position as her. I am financially way better of then my sister. It feels like favouritism sometimes even as an adult when my parents spend more money on her to help her out.  I get why they doing it and I am okay with it. But it sometimes stings regardless.", "NTA. Your money and everything you own is **yours** to do whatever you want with, including giving a larger amount to one kid and a smaller amount to the other. Emma should be ashamed of herself, knowing she is trying to take from her own sister who is struggling to get by while she herself has *multiple* homes.", "NTA \n\nIf Emma is struggling that much you’d be an asshole for not helping her more. By Sam objecting so vehemently and bringing up their childhood it almost comes off as though she enjoys seeing Emma struggle as an adult. There’s clearly some sort of vendetta she’s holding onto and to not want to help your obviously struggling sibling is straight garbage. \n\nAs someone with severe ADHD the struggle is so real and it’s a lonely existence because as much as people might understand they never really “get it”. \n\nSam needs to get over herself.", "YTA.\n\nMy parents each have their own favoured child and not-favoured child and it has damaged our entire family. You cannot control things like Emma having needed extra help, but this is something where you *do* get to choose. You are deliberately choosing one child over the other.\n\nNot only that, but you don’t know that Sam (or Emma!) will always be in these circumstances. Plus, have you considered the additional costs that go into home and car ownership? Will Emma be able to afford all of that on her own?", "Yta it's not Sam's fault that Emma isn't doing as well not splitting 50/50 is showing complete favouritism and of you carry this out you are setting the groundwork for a nuclear fall out between sisters when your gone", "This is a hard one. I can see your logic, but I can also see why Sam would legitimately be upset by this (which I do not think is her being greedy). \n\nNAH, but I think you need to accept that you will likely irrevocably damage your relationship with Sam if you go down this pathway. If I were in your shoes, I would try to give Emma as much help and support now, while you are alive, and so you can in good conscience leave everything 50-50 when it comes to that.", "I 100% agree with you. I also agree with what others have said about putting it in a trust. Unfortunately, us with adhd are sometimes not great with money and it would be awesome if she had a little help with managing it. Definitely do not let the other sister be in charge of the trust though, sounds like she could possibly be petty about it.", "NTA theres a cartoon that shows the difference between equality and equity. Equality is giving everyone the same without considering whos more provileged. Equity is splitting up in a way that everyone ends up with equal opportunity.   \nSam doesn't understand the pain of having a mental disability that was not treated property. She needs to start to understand how to empathize with her older sister before her kids become entitled brats as well.  \n\n\nhttps://interactioninstitute.org/wp-content/uploads/2016/01/IISC\\_EqualityEquity.png", "I don't have a particular judgment, but I'm curious how this discussion and \"reveal\" went. You say that Sam called you to yell -- did she get this news from someone else? Was it presented as a done deal?\n\nI think this should have been a family discussion before the decision was made. I've recently been in a sort of similar situation. My father recently made an inheritance decision that writes me and my brother out of a lot of money. There's a reason for it -- the money will go to someone who has done a lot more to \"earn\" it, and eventually to people who need it more. He talked to me about it first and explained the situation, and I totally get it and support it. It is hard, though -- it's a substantial amount of money that would have been mine eventually and now never will be. If he'd done this without talking to me, I probably would have reacted pretty strongly! I would have been angry, and it would have been harder for me to understand where he was coming from. \n\nThese are major decisions, and while you may think your logic is sound, it's worth getting more information and perspective about it. It's worth hearing everyone out and listening to concerns. I can see why Sam's upset if she felt blindsided or set aside. But I do understand where you're coming from on behalf of Emma -- I feel it could have been presented better.", "These kind of scenarios is why you shouldn't discuss your will with others in detail. \n\nTell Sam you will consider what she is saying and make sure it is fair, and then try not to discuss this. \n\nPut money in a trust to support Emma. \n\nAlso Emma is fairly young still, could you not support her in getting some more education and switching careers?", "YTA. My grandfather did something like this and it destroyed the family.", "It's your money, you get to decide how it is split when you die. NTA", "Fair doesn’t always mean equal. Some of our children need different things.", "NTA. You can do whatever you want with your assets, you don’t owe anybody anything. I wouldn’t tell them about it though. It does nobody any good for them to have that information.", "I think I would go with ESH. Truly, y'all need to do family therapy to figure it out. You need your kids to be in agreement, because they need to look out for one another once you're gone. If you let this situation divide them, they're both going to be worse off. Y'all need to figure it out as a family. Sam seems like she has resentment over Emma, and she needs help working that out. Emma probably has her own resentments about how Sam was treated. It is hard for everyone, and Emma is dealing with constant discrimination in her day-to-day life. Start the family therapy as soon as you can.", "NTA\n\nIf my mother died and left her house to my youngest brother (who also almost definitely has undiagnosed ADHD) I'd understand because I have a home, and my other siblings own places too. Not worth as much as the house but I know my mother would divide things fairly.\n\nBut also my mother would be dead and I wouldn't give a fuck what I got out of it *because my mother would be dead and I would be grieving*. Like fuck, come on, your daughter needs to check herself.", "YTA. \n\nYour intentions are not bad, but your implementation is.\n\nAs others have said, you are punishing Sam for doing better for herself, but needs could change. \n\nWhat about setting up a trust with say 70%  going to Emma, but paid in monthly installments being enough to live off of, but then with any money left when Emma dies, to be split between any grandchildren for example. \n\nOr set it up 50/50 but Emma can live in the house until she moves out or dies, then the proceeds distributed. \n\nI feel like then you may be ok asking Sam to be attorney and the end result is fairer while still helping both daughters.", "Emma not doing great in life could mean many things.\n\nCould be she is just single in her own place & working full time but not earning much.\n\nOR  could mean she's sitting on her ass on your sofa not working at all  or posably  she's is a SAHM with a deadbeat partner.\n\nNo idea if Emma is the spoiled baby who you enabled at the expense of Sam but its possible Sam believes this.  Did the extra help only consist of just a tutor or was there a lot more?\n\nAsk yourself why Sam said you ALWAYS spent more?  Is there any truth in this ?  Is Emma your favorite child?\n\nLeave your money how you like but expect the girls to go NC with each other if they haven't already.  I'd put Emma in charge of who gets to put  you in a care home tho because Sam will have no incentive financially or emotionally to preserve your wealth or independance.  Whilst emma will have every reason to keep you in your own home.", "Sam is greedy and resentful and she needs to get over herself. What you're doing makes perfect sense. You're helping the daughter who needs help rather than the one who doesn't need help at all. I wish Sam could think about her sister's needs rather than just resenting her for getting more attention\n\nNTA", "My parents (who don't have much to begin with) told both my sister and I that they will be leaving more to me than her. My sister is a literal millionaire and they spent more money on her studies and wedding than they did for me. Also, this decision was made when I was single and in my 20s and hustling as a copywriter. Even then, I had told my parents that I didn't need anything at all but they said they felt better about it. My sister in fact wanted them to leave everything to me. Now, we have urged our parents to leave what little they have to charity as both of us are going loads better. We are just asking them to will us (and my sister's kids) sentimental items. My point is, I don't get your daughter who seems to be far more financially stable and with means and access isn't more understanding. This is your money. You can leave it to whoever you want. Equal means you leave the same amount to both of them. Fair is different.", "YTA!!! I just can’t figure out you would leave mostly everything to someone who’s not the most responsible and perhaps isn’t a great decision maker. Emma will more than likely loose whatever you give her and she will be screwed because she won’t have anyone to help her. Rethink your plan. Your hurting Emma more than helping.", "YTA, I see favorism. Sam is in better place in life because she worked more. Also by the time you are dead (or maybe few years after) she could be divorced/widowed single mom who lost her job, you never know.", "My mother's family did exactly the opposite --- if you were dong well you \"deserved more\" and \"could handle it\" So now I support my mentally ill mother while my Aunt spends Christmas skiing in Switzerland. \n\nYou are doing the right thing.", "It's your money so you can do what you want, but I feel like the discrepancies are too different. What happens if Sam and her husband divorce in the future or if they suffer financial setbacks in the future? Then she's worse off. Probably would have been better to mark it as equal first then have a discussion with Sam if she would be willing to give up more of the money to Emma. Honestly, if I were Sam I would also go LC or NC because it does show some blatant favouritism especially since it seems that there has always been less attention devoted to her.", "YTA", "NAH:\n\nI am not dismissive of the fact of Sam being upset because it is not split, but personally I get it: Sam and husband make a half a million a year with several homes while Emma who has the disability and the rougher part of life, Sam will be okay if Emma gets more of the inheritance.", "YTA\n\nInheritance should not reward one child over the other - for doing better and having their life together or doing worse and not having their life together; for having money or for not having money. Inheritance is usually taken as the children as a real measure of how their parents view them and you are definitely showing your favoritism.\n\nYou said that Emma gets most everything (but then say bank savings and stocks go to Sam... is that correct?)\n\nAnyway, split the will 50/50. If you feel that Emma needs assistance, why are you waiting? Why are you making her want your death? You can give her monetary gifts or pay her rent for a month or six (if she doesn't live with you). Talk with your lawyer and see what they suggest, because I'm sure they've seen all this before. But they usually won't give your their opinion on your options unless you ask.", "NTA based on the fact that it's your money and you can split it however TF you want and don't owe anyone an explanation of why. You however, were gracious enough to give Sam a very reasonable and sound explanation of what you're doing with YOUR money. \n\n Emma is not some lazy spoiled entitled person laying on a couch waiting for you to die so she can live the high life. It sounds like she truly doing the best she can with her ability. I know if I had a sibling in Emma's position I would unequivocally want them to get more so they had more long term security. Now Sam can still choose to distance her family if she wants be petty and sadly, you can't do much about it. I do hope it turns out well for you all.", "Nta….I understand where you are coming from. I mean 500k is a lot. Why fight for more? I guess everyone is different", "NAH. You have sound reasons for making the decision that you did. Sam interpreted that decision in a way that made sense to her, which is a fair consequence of the decision that you made. You can’t tell your daughter how to feel about this or force her to see things from your perspective.\n\nThe best thing you can do is have a calm, in-person conversation with Sam to try to share your perspective. She might come to see things your way, or she might not. You can decide from there if you want to keep this plan of action or make changes.", "NTA aslong as you would do the opposite were their rules reverse. Although i see how it can come across from the well off one", "NTA, don't listen to anyone saying otherwise.\n\nAll the stuff in the past doesn't matter. Your will is intended to take care of your kids, and unless you have millions to split up to the point where it doesn't matter all that much you should try and do the most good with it, which correctly means helping the one who needs it most.\n\nIt's not a sandwich you should just split, the money could make a large difference in one kid's life and just be 2nd vacation money for the other.", "Justice is not the same as equality, and I think one of your kids maybe mistaken there. \n\nNta", "As a neurodivergent person, I wish more parents were aware of genuine issues like you are. I do think you should have a honest conversation with Sam and get her to understand why her sister needs the support. Nevertheless, as long as you aren't abandoning her, your decision to give the House and the Car to Sam are perfectly fine. I also see Sam's side in that she feels it's unfair, but she should try to at the very least understand yours. Do make sure to have a clear conversation with both of them however. \n\n\nNTA, soft NAH", "NTA I’m one of 5 kids and I wouldn’t mind if I got nothing because I’m already doing well and need it the least out of the 5 of us. Sam is just being greedy.", "NTA. I can’t imagine making 500k a year, owning multiple houses, and throwing a fit over inheritance when my sister works as a stocker at a minimum wage job. I would be telling you to leave her everything because she likely won’t be able to save for retirement and property taxes, water, utilities are all still a thing. But obviously Sam thinks you should pay for college funds for her children even though she can afford it, and let her sister live in a cardboard box. I’m generally not a fan of favoritism but this just sounds like common sense. Make sure to put a no contest clause in your will. For some people nothing is ever enough.", "NTA on the question you asked. I’m tired of people believing they’re entitled to any inheritance whatsoever. We’re not. I hope my relatives live their lives to their fullest, go on trips, donate to charity and leave nothing. That said, while I understand why you spent more time on Emma, you need to acknowledge what that did to Sam as a child. I hope her reaction is not really about the money.", "NTA. Sam is trying to make the situation equal, but you’re making it more equitable. Emma needs that little extra help and I think you it’s a sign of a good parent who can meet their child where there at instead of treating them equally for the sake of fairness. Tell Sam that life isn’t fair and she can go sob at her beach house.", "NTA. I have ADHD myself and understand how impossible it feels to be financially successful. Sam doesn’t recognize how good she has it, being able to do well at college and work, make money etc. and not be burdened by ADHD symptoms all the time. ADHD usually results in very low confidence and self esteem and requires a lot of extra help to not be miserable in life.", "Unpopular opinion, but I think EHS. \n\nOP, you think you’re taking care of Emma but you’re driving a wedge between her and her sister. Sam is going to hate her, through no fault of her own. \n\nSam shouldn’t be all up in your business about the inheritance as she’s owed nothing - you could give it to cats if you want. However, I think she’s hurt by the obvious difference you make between Emma and her. I get that you’re giving based on need, but you’re ignoring that the ‘non-needy’ child always gets fucked  in these cases. Lack of attention from your parents sucks and you’re solidifying her hurt. \n\nEmma doesn’t suck, but you’re setting her up for a lonely life without her family when you pass.", "This isn't that easy... I understand that Sam doesn't need the money. But she obviously very much needs to know that she is loved, and it seems at this point that she sees money as a love language. Having a sibling with problems and always been on the backseat no matter what you do is hard.\n\nSo, for the time being, invest time a d energy in her to explain it, to make her feel how much you care. She will get less money , so maybe it is time to show more care. I have the feeling that this is a 'she can care for herself' case, where she feels that she basically doesn't have a mother.", "NTA. You have the right to choose how the money will get split. Your kids should not count your money nor have some entitled measurement of how you favor them. Money can really corrupt people into thinking they have certain rights.", "Who said anything about kicking who to the curb? She'd still get a fifty fifty split. That's not nothing", "This is tough but probably unpopular opinion that I choose NTA. You want to make sure your daughters are both secure. However, you should think about the fact that what if your daughter divorces your husband? I know you can change it as things go along but giving all the money outright is also bad. Maybe she won’t be that responsible with it. There is a lot more but NTA cause it is your money and you are just doing what you think is best.", "NTA,  no one is owed an inheritance,  and I find people who expect an inheritance to be a--holes. I always told my parents that I don't care who you leave your assets to, just put it in writing what you want done with your assets when you are gone. 98% is going to charity, the only thing I will receive is sentimental things. I am perfectly fine with this.", "YTA/ oddly enough, one girl is doing better because you forced her; you gave her little to no support back then.", "**NTA**\n\nYou have laid out perfectly good reasons for they what everything is spit up. This is hopefully a long ways away and who knows what will happen between now and then. \n\nMe personally I would have kept this will information to myself until later on in life.", "NTA.  Your assets belong to YOU, and you can do whatever you'd like with them.  It sounds like Sam is jealous of the extra help or attention her sister needed, and she is behaving like a toddler throwing a tantrum.  Most unbecoming to the wealthy and educated wife of a doctor and the mother of two children!\n\nArrange your will with your attorney and make it ironclad so that Sam can't contest it.  If things change, you can't always adjust it accordingly and update in the future, but I doubt that you'll have the need.  Leave things so that your daughter who needs the home and certain assets the most will receive them.  Sam needs to understand that fair is how YOU decide it needs to be, not what she believes should happen.  And tell her that if she doesn't stop harassing you and pressuring you are her \"fair share\", her determine percent of inheritance will go to supporting the local animal shelter or some other charity in need.  She is mighty ungrateful and greedy!\n\nMy brother had mental health issues, and when they passed, it was arranged that the home and it's furnishings would pass to him because he was the one who needed it.  The 3 sisters had our own homes, and none of us cared about money......we missed our parents and wanted to look out for each other after they passed.  \n\nYou have a good heart and a lot of wisdom, my friend.", "I'm not a professional, but that sounds like a good idea. \n\nAlso, maybe it would have helped if OP had first invited the ~~older~~ younger daughter over for coffee and explained her predicament to her. Her daughter, also a mother, might be able to relate to the issue more if she thought of how *she'd* feel if she and her own children were in a similar situation.\n\nMaybe the daughter would do something completely different, more along the lines of what she says should happen now, but it would open the discussion from a mothering view not a daughtering one.\n \nOP could at least have her over to chat in person now and talk to the mother-side of her daughter, not the daughter-side of her daughter. Not to persuade or change her mind but to show it from a mother's perspective, whatever it is that OP ends up doing.\n\nEdit: younger", "Yes definitely. As an adult woman with adhd, we are known for impulsive spending. I can walk down the cleaning aisle and come home with $100 worth of products because today my hobby is deep cleaning.", "Yea because some people with ADHD can have issues with executive functions or may be easily manipulated if they are developmentally behind, which it sounds like Emma might be due to not getting the kind of support in school that she needed. A trust would help protect her and would help make it harder for her sister to try to weasel it away from her.\n\nHeck I am in a similar boat where I am doing really well. I'm not doing as well as Emma's sister, but I don't have to be super afraid of whether I'll have food or a roof over my head. My lil sister and her twin brother both struggled in school due to ADHD, autism, bullying, and limited support. I've straight up told my parents, during times when they were already discussing the topic of inheritance, that I'm not overly worried about getting anything and would prefer my younger siblings get preference because they need it more than me.", "THIS.  Find someone else to be the trustee.  That way Sam and Emma can just be sisters.", "BTW, NTA...  It's YOUR possessions to do whatever you want with; you dont HAVE to give them anything.  I don't know why people think they are entitled to half of their parents assets.", "Who would contrôle this trust ,her sister?So her sister can have contrôle over her?bad idea.", "I have adhd and I agree. Money is hard to manage. Sigh.", "I am the Sam of my sibling and I.  Our folks established  a special needs trust for sibling.  A family friend is the trustee.  Sibling will always be taken care of and I don’t have to manage it.  Win win.", "Ohhh yeah. Forgot about Power of Attorney. \n\nBet she wants Sam to look after her medical and financial future because Sam is better with money! But she has shown favoritism to Emma. \n\nThat might bite OP literally in the butt when Sam pops her in the cheapest carehome in Alaska to keep her 20% bigger!", "Couldn't have said it better!", "That tends to be pretty normal. Its the same for autistic kids or down syndrome kids. They just require more attention and focus. Its clear the younger daughter is salty but they didnt put her on the back burner. Its not like shes struggling just as hard, it seems like they were still able to raise her right and with the appropriate resources.", "He wanted to split it 50/50 because Sam and him didn’t get along. He was partly the cause of her having an eating disorder and he didn’t want her to have more reason to hate him. But I don’t think it’s reason enough to keep it at 50/50", "I wonder if she could counter balance this by offering Sam the more sentimental items as the inheritance too - her wedding ring, dress, all the jewellery. Hard to feel like you’re forgotten if you get 100% of the sentimental items? Just a thought", "This needs to be higher up.", "Yup yup yup yup. Really hope op sees this.", "Yup, this is my favorite response so far, and I really hope OP sees it. Sam has been neglected in favor of her sister her whole life (while OP is literally paying half of Emma's rent + other financial and emotional support even now) and has come to realize that will literally never change. Her reaction isn't entitlement, it's pain, and it makes me really sad for her.", "Ehhh, it sounds like Sam is talking about Emma getting TUTORS because they thought she was just \"lazy\" and failing at school because of not working hard enough... it might be more money up front, but it's not exactly a positive for Emma, either.", "I also know plenty of successful people with ADHD, but I know plenty of unsuccessful with ADHD because it can be (but isn’t always) seriously debilitating. Really it’s not fair to brush off disability as a non-factor just because some people can make it work.", "This is what my sister and I did (after inheriting 50/50). My only concern in this situation is how strongly Sam responded, which whilst understandable may also be a signal she’d be less likely to help out her less fortunate sibling. The disparity is already huge, and there’s no indication as yet that Sam is helping out her sister.", "That’s not fair though, it’s better to be equitable than equal, and to divide based on need.", "This leaves room for Sam to pressure Emma to sell or buy her out. Which will create resentment and a rift. Why would Sam want to hold onto something and potentially have it rot away and lose all value. I’m assuming Emma won’t be able to care for a home.", "This sounds like a good idea, I hope OP sees this one.", "Except it cannot be fair - one of the two girls was medically neglected - accidentally, but still in life-harming ways - by the parent, who did not get them (clearly needed) treatment that hindered their achievement potential.", "Fair treatment is not equal treatment. Never has been. By the time you reach high school most children can grasp this concept. \nPeople have different needs. Some need to do more homework, other can take harder classes....\n\nMy younger brother will need his inheritance in a trust. My two older brothers will receive a nice dollar amount and I and my husband have already have 3/4 of the house as we have been caregiving mom (and dad who lives down the road)\nThings are not going to be equal but it will be fair. \nLikely the 3/4 house will be worth $the most but as I've always looked after my younger brother, so it comes with a dependent.", "I already pay half for Emma’s rent and she goes to a therapist that I pay for. But she’s got some other emotional issues I won’t get into that makes it hard for her to break out of her current circumstances. Very low self esteem and a fatalist attitude for one", "OP mentioned in another comment that Sam had an eating disorder when she was younger and that the father and Sam weren’t on the best terms because he partially caused it. OP reminds me a lot of my own mom and dad, who heavily favoured my abusive older brother growing up but knew literally nothing about me or my problems.", "If Sam and her husband are pulling 500k after taxes and own multiple homes there’s no reason they couldn’t cover their kids college lmao. If they set aside 20k annually for the first 10 years of the kids life, put it in a 529 and make semi-competent investments those kids could easily have 400k to get through college and grad school. I think OP has made it clear Sam doesn’t have financial issues.", "Youre pulling alot of assumptions to fit the narrative.\n\nHelp for managing ADHD needs to start at a young age when the foundations of personality and character are setting it. Treating it as a teenager is just minimizing the negative affects have already set in. \n\nFinances are another assumption, idk what you think a stocker is but they definitely dont make enough to cover rent and a car. Its also very hard and menial work. Considering she has serious enough ADHD to still be seeing a therapist she probably cant do any job that requires serious focus.\n\nIf her younger daughter needs money to cover her children's college then maybe she shouldnt be buying 3+ houses and then expecting her mom to cover her ass with her kids.", "It’s OP’s money and she can do what she wants with it.", "> Or acknowledge that you favor Emma.\n\nI think you hit the nail on the head here. In the end OP it's your money and your will, you can do whatever you want with it. But don't be surprised with the consequences of your actions.", "This is an excellent comment with sound advice.", "The house and car is where most of the value is. Sam is getting everything else which is less than that value", "She can change the will, it’s like ya’ll don’t know that.  This will is for if the mom dies tomorrow. Currently the 80/20 is way more fair.", "Not for nothing, people who win the lottery historically go on to file bankruptcy, commit suicide, develop and/or exacerbate substance issues, a host of other terrible things (just going on this hypothetical, pointing out that it wouldn’t be the magical turnaround many assume it would be). I do think that a person that already has a hard time managing their life, regardless of circumstances ie mental health, will not be magically fixed by an influx of money. The only reason I disagree about an even split is the fact that “Sam” is already in a well-off position compared to “Emma”.", "Nah you definitely tell people especially in a position like this. Not saying anything is just running away for the problem and will only cause fights between the two sisters when they find out. \n\nI think shes justified in feeling guilty because she wasnt able to help her daughter at her most fundamental stage and its okay to make up for that later in life.", "I am the ADHD problem child of my family and I agree that OP is the AH. My sister’s shouldn’t be stiffed because I struggle.", "in this housing market i doubt it. one sister has MULTIPLE HOUSES while the other has none…", "TBH I dont think Sam cares about the money. I think she's felt less loved than Emma growing up and OP wanting to change the will to 80/20 is validating these feelings. OP even stated in replies that Sam had a bad relationship with her late husband", "Read my reply above. Think it covers both parties and help the needy sibling but has it shared in the event the other needs it. Also protect the asset.", "As someone with ADHD I definitely agree that OP should not just give it all to Emma at once. A lot of people with ADHD have difficulties saving money, budgeting, and not spending everything you get as soon as you get it.", "I agree with the trust idea.", "Not everyone with ADHD can barrell through the difficulties it causes with intellect. I have only just been diagnosed in my 40s and managed 'just fine' all the way to the start of my final year of univeristy when it was like I hit a brick wall and literally could not get myself to understand my classes anymore. The diagnosis explained all the times I was struggling but couldn't express why, and because of my late diagnoses I am also having to deal with a wonderful host of comorbid mental health issues. \n\nIs my experience more valid than yours? Or less? Do I deserve no help because you don't need it? Or shall we allow that not all people with a diagnosis have the same experience and some need more help than others?", "Exactly this!", "What you sound like: people with ADHD always have no ambition and are irresponsible. \n\nHope other folks with ADHD see this", "Yea Emma can go to a shelter if needed. The richer sister needs more money. She", "If Sam was going to help she would be encouraging of this decision. The decision is up to the mom it is her money. Frankly sam is a jerk my wife and I do very well like Sam. We have told my parents they can exclude us from the will if they want because we don't need it. Sam isn't being punished for doing well, doing well is its own reward.", "This isn’t giving a child a toy and not giving one to the other. These are adults. One who is struggling. As families you help each other out. It doesn’t always have to be tit for tat. My brother gets more help than I do, because I need it less. I don’t need to pull up my mothers bank statements and make sure we get the exact same. Because we’re adults… not children.", "Helping the one most in need of help is favoritism? I think not, it’s common sense", "We found the entitled child.", "Because she is worse off. If the situation was reversed and it was Sam I’d be willing more to her. It’s not fair that one is doing much better than the other", "I'm guessing not considering Emma apparently still needs the help. OP YTA. Your one child who has done well for herself is penalised for being better in life. Wow, way to play favourites and hope that keeps you happy to your grave when the one good daughter boots you from her life.", "Yes she has improved greatly. When she was a teenage her needed more one on one tutoring. She use to not be able to hold down jobs and would get fired all the time. I had to pay for her medication and psychologists to get her working. It’s not her fault it’s taken a lot more work for her to become independent", "\nI disagree. Different kids have different needs from the day they are born. You do your best to address them equitably, but from the beginning, some kids “get more” than others. Just because my oldest’s traumatic birth and NICU stay cost $200,000 doesn’t mean I’m giving the other two $200,000. That was the money to get her to the place my others reached at birth: clean lungs, appropriate blood pressure, contusion-free brain, no edema, healthy bowels. \n\nAnd it never stops. Let me tell you how much equal attention that oldest kid got when her twin siblings were babies. My aunt spent a small fortune on reading tutoring for one child, a large fortune on mental health support for another child, and the others got nothing of the sort. Because while you make things equal whenever possible, equity is more important. \n\nOP has one child who is in the top 5% of wealthiest earners in the US and another with mental health issues who can’t afford her rent. I’m sure the poor daughter was lazy to some degree, but this is also a matter of human decency. OP is ensuring that her child won’t be homeless. The rich sister will ALWAYS have a much, much nicer life than her sister, and she should leave her mom alone.\n\nAnd I say this from the position more of the rich sister. My dad has a sister who never really got her footing in life. My parents are solid middle class: nothing special, but they’re stable. When my dad’s parents threw their life’s money away on stupid things, the part my dad was angry about was his sister. He was far less concerned with the fate of his inheritance than that his sister would have a secure future.", "Yea worst case the one girl just goes to an homless shelter if she can't survive.", "She said that the parents always favored the sister. Sounds like she is right.\n\nIt also sounds like Sam is successful in spite of her parents rather than because of them.", "I think you meant Sam there, Emma was the one getting the house/car/belongings due to financial struggles, and Sam was getting an uncertain amount of cash since she has more stability in terms of finances.", "Man, this. I need that reminder in my own life, that fair is different than equal. So good. \n\nAlso, OP is NTA. Sam is selfish", "This.", "Well OP also mentions that her husband (the daughters father) was (partly) the cause of Sam’s [eating disorder](https://www.reddit.com/r/AmItheAsshole/comments/109qmli/aita_for_giving_one_daughter_more_inheritance/j3zwejy/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3). Of course OP glosses over this to paint a picture of Sam as just a naturally successful overachiever. This seems to be about more than just money.\n\nAlso, others have pointed out - what happens when OP gets sick and needs care? Is she gonna expect her downtrodden daughter to handle POA and medical stuff, or her daughter whose married to a doctor?\n\nI agree with you - it does logically make sense to give the house to the daughter whose struggling and doesn’t have financial security. But this seems to be about much deeper issues that are just presenting here. Sam struggled too, but those struggles are ignored. She will likely have to take on a bigger share of the labor caring for her elderly mom, but again is going to be put aside in favor of her struggling sister. At some point it sure does feel like you did everything right so you get ignored because of it, and that fucking sucks. This is just another glaring example of it in Sam’s eyes.", "Exactly. You shouldn’t say anything at all", "So, you want Emma and Sam to find out after she passed, and for Sam to hate Emma and ghost her. \n\nLet me ask you a question. If you worked hard your whole life, and during your childhood a sibling was given more attention and resources, but fine that fine because she's behind, but it didn't solve the issues and she still needs help. Wouldn't you resent her too?", "Sounds like the favoritism started in childhood.", "Emma will few better about the 50/50 split when she is homeless.", "She *is* rewarding one daughter for underachieving after raising that same daughter to be an underachiever. Go back and read the part where she essentially admits she’s always favored the one daughter over the other, giving her more and expecting less. Now she wants to punish the unfavored daughter for being successful. People can do what they want with their money, but they’re still assholes when they’ve spent their whole life favoring one kid and continue the pattern with estate planning.", "Oh my goodness no. That's kicking the can of responsibility to the siblings. It would absolutely destroy their relationship to be alerted to that favoritism right after the funeral. \n\nMy grandma didn't want to be \"the bad guy\" and did something like this. My mom, the executor, was blamed. Haven't seen or spoken to aunts and uncles since grandma died 20 years ago. Please never do this shit to your family. Be upfront.", "I agree..this is all so important!", "This & i would put the house un Emma's name now.", "Genuine question. If, over their entire lives, mom has always given more to one kid than the other, at what point can the non-receiving party feel bad, according to you? In your example, the degree of the “attention” of love flows between the children. Based on this post however, it appears that for op and her kids, that attention always pivoted to only one of the children. This very well might be just the straw that broke the camels back and has nothing to do with the monetary amount. Plus, on a different not, like it or not, inheritances can be perceived and often are representative of how someone felt about someone in life. It’s not unheard of for people to leave more to their favorite grandkids, etc.", "NEI (not enough info) it seems you favor your struggling daughter yes she has ADHD but that doesn’t mean a damn thing yes she’s struggling, help her now not later you’re gonna have a daughter who comes into a lot of financials at once and has no idea how to handle it and over spends  and isn’t good with it. Meanwhile your other daughter will grow to resent her for you seeming to be favoring your other daughter just because one’s better off, help gouge daughter now and split inheritance’s if you want them to have any relationship or want your daughters to be able to go to one another after your death not everyone is forgiving", "Any possibility that she would have is being destroyed by OP.", "“Useless degrees”?", "Useless degrees?!?! Possessive is kids’.", "I was on board with what you were saying until you got to \"useless degrees\".", "Its not about the money. Sam is an over achiever as a direct result of realizing when she was young that her sister would get more attention than her. Sam has felt like second place all her life and THEN her mother changes the will to accommodate her sister more than her, again.", "Here’s the thing though. Based on ops own words, has she shown that she loves the other child AT ALL? Giving one everything in life and death, doesn’t seem to support it much.", "I get the sense it may not be about the money, but about a much more longstanding sense she's gotten the short stick in terms of attention and resources.", "This is the one !!!!!!!! My aunt had 2 daughters and 1 son. They split the inheritance 3 ways but the younger sister (49 acts 16) signed it over to sister and sister pays her bills. They hated each other as teens and most of their adult life but my aunt passed 2 years ago and she has really stepped up since seeing how much sister really needed her. My aunt ofc told her in person years before but she thought it was just favoritism. But she now knows why .", ">OP had first invited the older daughter over for coffee\n\nEmma is the older daughter (32), and does not appear to have children. Did you mean Sam? Sounds like you meant Sam but she’s younger (29).", "OP let her husband give the younger daughter an eating disorder and still thinks they shouldn't make it upto her. OP sucks.", "Because inheritance isn't just money, it ends up standing for a lot of things- love, acceptance, respect, support, etc etc\n\nIf OP does this without a lot of explanation and warning she setting her kids up for resentment of each other and bitterness towards OP, ruining even the good memories they have.", "They appoint a trustee, usually through the court at the time of probate. Someone who is totally neutral and does this for a living.", "I was going to ask if there was such a thing whereby it could be put in a trust with explicit rules of what or how an inheritance can be handled. \n\nIn the UK we can put specifics in a will as to how an inheritance should be used. I'm not familiar with US laws. What your folks have done is a good way to handle things. \n\nI'm sure you might have seen ppl on reddit who have parents who expect them to basically drop living thier own lives to care for a sibling with health problems which I think is terribly unfair.\n\nKudos to your parents 👏", "This hits so close to home.  I was told the plan is to give my brother most of the money for the same reasons and then I was asked to have control of the trust fund for him. \n\nSo I get no money and more work.  Thanks mom !", "I'm the sick kid and my parents absolutely did neglect my brother growing up.  I got older and resented the cottling and had to fight for my freedom from from my parents.", "Just be ready for emma to have to survive on her own when your gone is all I'm going to say cause you've driven a hugh barrier between them and by this comment and a few others I understand Sam's side more. It sounds like you and your husband favoured Emma and spent every minute with her and while Sam was doing great at school she got nothing from both of you other than being berated. I honestly don't think it's about the money it's about how you have treated your child so differently so maybe its time for you to start putting in some time and effort with sam and letting Emma sit back for a while 🤷‍♀️", "Oh great, so one parent has already traumatised her and caused her to have medical issues, and now the other one is abandoning her for, **checks**, her sisters medical issues being important where hers were not. \n\nYTA. And without a caretaker, the daughter you think you are looking after who probably can’t pay bills on time without assistance is going to run out of money and run the house into the ground and be homeless. You would  be better off selling the house and splitting the proceeds equally and putting Emma’s in a trust that only pays out a fixed amount every month or quarter,s o her ADHD can’t fritter it away.   \n\nCurrently your are using your will as one last slap in the face to Sam. What rewards did Sam get for doing so well in her studies? Or would that jot have been fair to poor struggling Emma? If all the extra spending only went in one direction, and in the meantime *missing missing reasons* were causing an eating disorder in your other child, she has every reason to resent you.", "Wait… so Sam DID struggle too. She just overcame in spite of it. \n\nWhile it does make sense to give the house to the daughter who is struggling, it sounds like Sam has some very valid complaints about favoritism and feeling neglected. This is about more than just money. As someone who has experienced a similar dynamic with my sister, it sure sucks to be ignored because you were the “good kid,” and to have your problems ignored because you were better at dealing with them.\n\nHonestly, I understood where you were coming from initially, but this comment really makes me think YTA. Maybe not for the way you’re splitting assets, but for a longer term habit of ignoring one child in favor of the other. I mean you write all this out about how Emma has struggled and Sam just blossomed, and then offhandedly make a comment about how Sam had an eating disorder??! So yes, Sam struggled too!", "So what happens if Sam gets a divorce and has a major health issue and suddenly has nothing? Will you change your will? Or is it just about giving Emma more no matter what?", "Did you pay for therapy and treatment for Sam’s eating disorder?", "My soft yta is no longer soft. So Sam didnt get you two laser focused on her like you did with Emma even though she was also living with mental illness/neurodivergence?  \n\n\nJFC. Do you two even love Sam?", "Omg, OP, massive YTA. \n\nDO NOT bury the part about Sam having been abused by your husband in a comment (he gave her an eating disorder!?). \n\nBesides, assholery aside, your plans set Emma up for failure. You’re driving a wedge between the siblings, and Emma will need Sam’s help. The way you’re going about it, Sam will wash her hands off Emma.", "Yeah you both suck. YTA 100%", "it sounds like you both dislike your daughter(!) for some reason...wow. Sam is better off without y'all. YTA", "Maybe, who knows. I guess it would depend on how sentimental Sam is, how meaningful the items are to her (not to OP), and how many of those items there are. \n\nA necklace or two vs the house and most of the money... I don't know many who wouldn't feel hurt by that kind of differential, even if it rationally makes sense.", "And since you've raised Emma to believe she's a victim of everything, don't count on her taking care of you later either.  You've given her few life skills for herself; what makes you think she can spare any for you?  YTA.", "The sister isn’t responsible for the other sister - parents are responsible. Yes in this case the greater part of the financial assets are going to the daughter in need, however that should also be acknowledged that the parent can’t then expect the “good” daughter to spend her life supporting the her sister.", "exactky my thought… the fact the sister was greedy enough to take her sister ONE chance at a house after she has multiple and is very well off is super concerning. honestly that alone would make me give the one daughter 100% and the other NONE", "So you think it’s absolutely guaranteed that both their life situations will be the same when OP passes? No chance that the great situation goes away or the other improves?", "Why though? Emma has done nothing to deserve this, and now has no incentive to do better. She was diagnosed as a teen - she’s had plenty of time since then to get an additional degree or further her education to get more money but she hasn’t. Why would the kid who slouches off deserve more than the hardworking one?", "In this case, equal is equitable. \n\nAn estate is, quite literally, a gift you give to someone because of your relationship with them. Here, the mother is saying that one daughter deserves more of the estate than the other. It can be no surprise that the daughter receiving less of the estate feels jilted. \n\nThe mother has an absolute right to do this, but I expect that the jilted daughter will feel as if any bridge to her favored sister has been burned. \n\nIf, in the future, the favored sister needs help, the jilted sister is unlikely to offer.\n\nAlso, I’m quite sure the jilted sister is thinking it’s unfair that the mother decided to give her less because she’s managed to be successful with the resources she had. It’s supposed to pay to be a winner.", "It sounds like a good way for Emma to slowly wreck the house and lead to a bunch of stress and resentment between the two of them, to me at least. Why would Emma  ever move out? It's still totally lopsided.", "Yeah it amazes me how many people have issues grasping this. I'm physically crippled because of medical neglect by my doctors (it's easier to believe a kid is trying to get out of school than to actually look for an illness) untreated ADHD has a similar impact on a lot of people. Of your can't focus enough to study, you can't get a degree. Or if you have brain fog which often comes with it. Plus she's probably depressed because she has such a hard time and grew up being called \"lazy\" for having a disability.", "I think this is probably part of Sam’s issue of favoritism is coming from. You already pay half emma’s rent and she also gets almost everything when you die. As someone who has a highly favored sibling that is struggling and will most likely struggle for the rest of his life, I can say from experience seeing your sibling get things you never got does hurt. Sam knows she doesn’t need your money, it’s not even really about money, she just wants it to be equal. I will also ask if you feel like you enable Emma? My parents enabled by brother (still do) they always give him money and never hold him accountable. He is an adult with kids that still acts like a teen and mom comes running every time he needs something. It’s great if parents can help out their children in times of need, but bank rolling their entire adult life is a bit much. If Sam feels like you’ve enabled Emma this is just another way she feels that you favor her. Maybe leave Sam sentimental things? However you definitely need to talk to her because she currently feels unequally loved not just slighted about money.", "So you are giving Emma mo ey now for rent and help, payed more when. She was a kid, and even in death screw Sam? No wonder Sam is mad. You have literally favored Emma and her lack of doing life herself, over a daughter who has been working hard.\n\nHope you also chose Emma to find your nursing home, or medical help. Because Sam sure won't care about what happens to you now.", "Oh this is a tricky situation. When someone gets habituated to someone paying for half their rent, they'll rely on it. And what will happen when you die, so I see why the will is so significant.\n\nYour money, your say, but not only are you going to be potentially giving 80% of your estate to your daughter with ADHD but you're already doing it. \n\nAre you afraid that Emma can't and won't be able to provide for herself? Is there a long term plan for how your daughter will be increasing her financial security, and independence? If there isn't, are you not making her rely on you and rely on your will? How can you prevent too much reliance on your will?", "At some point you will also have to stop enabling her in a way. She’s in her 30’s. And she knows that if she says ‘I have issues’ she won’t have to lift fingers. NOW you’re giving her a car and a house for… having emotional issues? You can’t baby her forever, whatever the issue, she will have to eventually grow up.  \n\nNo wonder Sam is mad. She has probably worked hard, with no support from you because she sucks it up. But her sister whines and moans and gets given everything. I’d be pissed too", "That's good, and you should keep helping!\n\nBut as soon as it lowersyour saving it's also transferring \"Sam's share\" to Emma before the inheritance.\n\nWhy not use another way of splitting it? Instead of house to A and money to B you can just go 40% to A and 60% to B. It seems safer too for when the house or car break down towards the end of your life...", "Sounds like that sucked for you but thats not even remotely the same thing here. The older sister had ADHD, she wasnt beating her sister. OP clear was more involved with her children being that she actually knew about the eating disorder and the partial cause of it.", "It’s not about the money. It’s about the long-term favoritism toward one sibling.", "How is Emma going to pay for the property taxes, insurance, and the upkeep of the house? You are trying to do a well intentioned thing here but I don’t think you’ve thought it all through logistically.", "How is it “helping” to leave non-cash assets to a person who is barely able to function as an adult? All you are doing is setting up your daughter to be preyed upon by an unscrupulous buyer or caretaker to provide the help that you are now providing.\n\nAnd what happens if the “more responsible” daughter gets cancer? Has a life threatening situation that needs cash to survive?\n\nWhat if the troubled daughter get hooked up with someone who only wants her assets?\n\nIt’s WAY better to create a family trust, with an administrator who has a set of rules to make decisions based on the needs of BOTH of the children, verses what you are planning. That way the family trust money/assets aren’t split 80/20, but instead are able to pivot in all future situations that need help.", "Are you expecting Sam to pick up Emma’s bills the same way you do?", "INFO: if you did split 50/50, would it even come close to the funds Sam already has for herself? Would the money from you make nearly the difference in her quality of life as it would for Emma? Or would Sam just add it to her already overflowing bucket while Emma continues to struggle at the poverty line? \n\nIf I had any extra funds, I'd want them to go where they could do the most good. If you are leaving your daughters millions of dollars, that would be useful to either of them. But if the amount that Sam is quibbling over is less than she makes in a year, I fail to see why she is so upset. She makes so incredibly much money, and has so much in assets already, she may just not be able to see her privilege. She has alllllll that and still demands more? \n\nIf my sibling struggled that much and I knew my part of the inheritance would make a huge difference in their life, while it wouldn't really be life changing for me, I couldn't imagine being this selfish about it.", "How do you think this helps your argument? YTA!!", "Most of the value now- but unless you plan on going soonish, the car and house could very well be worth a lot less by the time this is an actual issue. The house could be worth more but you can’t predict the market twenty years from now. The value that she will place on having a roof over her head though, will be much higher than the paper value of it.", "See, I believe no one is being stiffed because it's OPs money. Op could leave everything to charity if they want. If OP doesnt die, like ever, they'd probably still be spending that money trying to help their struggling daughter which OP would be free to do because it's their money.", "I disagree as the sister of a brother who struggles. My brother’s quality of life will improve way more than mine if he gets more inheritance than I do. Right now I’m doing well; if I get half I can get a bigger house and a better car but my life mostly remains the same. If my brother gets 80% he can finally stop renting with roommates and won’t have to move every few years as well as get a car of his own. He won’t have to live paycheck to paycheck either. Dividing an inheritance according to situation isn’t equal, but it is equitable. OP isn’t giving Emma more because he loves her more, she’s giving her more before she needs it more.", "I mean…having ADHD isn’t the end of the world. I was diagnosed with it as a teen and I own a home, have several degrees and a good job. I’m the first generation in my family to do a degree. My mum didn’t finish high school. Sam has an honest job. Why doesn’t OP try to help her out more while she’s alive? Seems like a bit of Molly coddling here.", "Exactly. It’s the principle. She’s probably felt like she wasn’t as loved or didn’t get as much attention as Emma. This is quite literally quantifying how she favors Emma vs Sam", "Sounds like Sam needs to grow the fuck up. People with severe ADHD can struggle with even the most basic of functions which is clear from what OP says. Sam seems to think “favoritism” is helping someone when they’re struggling with something that came naturally for them. TBH it seems like Sam has a pretty shitty internal attitude towards Emma and probably enjoys seeing her struggle as an adult.", "From the OP:\n\n> She reminded me that growing up we always spent more on Emma than her. But that’s because she was at the top of her class while Emma was failing. I put Emma in extra tutoring and the like because she needed it more. \n\nFrom the comments:\n\n>I already pay half for Emma’s rent and she goes to a therapist that I pay for.\n\nhttps://old.reddit.com/r/AmItheAsshole/comments/109qmli/aita_for_giving_one_daughter_more_inheritance/j3zwu6k/?context=3\n\nSeems like her parents always had Sam take the back seat, because Emma is the needy one. I'm surprised that Sam isn't NC.", "Just to confirm, Sam was [abused by the parents](https://www.reddit.com/r/AmItheAsshole/comments/109qmli/comment/j3zwejy/?utm_source=share&utm_medium=web2x&context=3) and has been relegated to a secondary thought by her Mother her whole life ... but her Mother continuing to pour more resources in to Emma is while alive and also after her passing is \"common sense\"?  \n\nI find your support of Sam's past abuse and continued targeting pretty disgusting.  Her mother doesn't even try to take any responsibility for her past and ongoing actions.", "Yeah, cause make your own living is your parents job right?", "Presumably when you need help in your old age, it will be Emma you lean in and ask for help, she will be the one who looks after you, right? I mean you wouldn’t expect to tell one daughter she was barely  worth a mention in your Will, and then expect them to take on your care would you?", "Thats up to them for what they do with their lives. You are basically saying that all the effort Sam put to get a good life makes you less obligated to care for her", ">\"It’s not fair that one is doing much better than the other\"\n\nIt's not fair? That sounds like something a child says of their sibling.\"It's not *fair* that my sister got a better [blank] than me!\"\n\nLife is what it is and you help no one by looking at fairness through a specific lens. What is fair? Maybe it's not fair that you have spent much more of your time, efforts, money, and now your estate on one daughter over the other. You speak fondly of Emma but not the other, who you talk about more like a niece than a daughter. \n\nYes we know ADHD is a hardship but so is an eating disorder and being the one who has to overachieve to try to win your attention. When I hear more details in your comments, you're sounding much less NTA and more just YTA.", "I don’t think their current situations should be used as a factor in your decision making. Like others have said, either of their lives could change in an instant and the roles could be reversed. It also seems that you’re essentially punishing Sam for succeeding. You love them both equally, but it’s definitely understandable why Sam is upset. Not because of the money, but for the long-term favoritism. She just wants to be loved equally as much as her sister. This circumstance is tricky because “love” is being communicated through finances and assets. 50/50 or donate everything to charity.", "So it’s not about fair. They were both given opportunities to grow and find stability. It sounds like Emma was given more structured support and has continued to struggle. That is not Sam’s fault and if you’re searching for “fair” then it should be split equally. Equitable means you’re taking factors into consideration and splitting accordingly. \n\nI am the Sam in my family. Know why? My parents always focused so much on our Emma that I was often an afterthought. I had to learn to be resourceful and figure things out on my own because our Emma needed them more and I just needed to understand. I told both my parents that it’s their money and stuff and they get to do whatever they want with it and I’ll respect their wishes. I also said it felt like I continue to get punished or get less than (mainly time, attention, and effort cuz I have my own money) because I had to be mature and take care of myself and Emma gets catered too because life has always been “harder” for her. \n\nWhen one of our parents died, the money dried up significantly. It wasn’t an issue for me because as Sam, I was thoughtful and intentional in my choices and had made good decisions for myself and family. I warned everyone that Emma was gonna struggle and I wasn’t going to help her. There we were not 18 months later and she’s crying about how unfair it is that she isn’t taken care of, blew through all the money and most significantly, had been coddled so bad by our parents that she couldn’t effectively function the way she should. I get the blame and comments from family that I should something to help because as you say “I’m doing so much better than her.”  Guess what? I earned that shit all by my damn self and it’s not my job you take care of another adult in this scenario. \n\nAs I said, your money to do what you want. I think you’re angry that your favoritism is on display and deep down, you know Sam is right for calling it out. It’s not even about the money. It’s about being recognized as someone who matters to your parent and worthy of their time and consideration. You sent a direct message with this approach; you just didn’t want the message you received back. \n\nYTA.", "You sounds just awful, are you act as iff the appropriate choice for emma is to kick her to the curb for being a failure of a child. Some people stuggle and face challenges others dont, parents with the means to help should do so. \n\nAlso, how exactly is sam being punished here? Its just money, which she has plenty of.", "Penalized how exactly. What does OP’s inheritance \ndo for an individual who owns several homes plus a vacation property and nets around 500K annually with their partner..??? Absolutely nothing. Sam is acting out of emotion, which I’m not invalidating but as a mother I’m not giving a dime to the child who owns multiple homes vs the child who would be homeless. Parents don’t parent equally because children/siblings don’t require the same needs. It’s common sense.", "OP, what resources did you dedicate to Sam to help her get over your and your husbands abuse when she was growing up?  What continuing assets (time or money) do you continue to expend to rectify what you did to Sam?  We know you have financially and emotionally supported Emma her whole life ... who what has been your equal support for Sam?", "But is she independent or are you enabling?", "I absolutely agree with you! Many people don't understand how untreated ADHD can affect a person's life. When treated & given the extra help, they can be very successful.  You did right OP!", "You’re penalizing your younger daughter for her relative life success in a way that is clearly hard for her to accept and presses directly on a childhood nerve.  Is giving Emma that extra 30% really worth leaving your younger daughter with a permanent feeling of being the other kid when you’re gone?\n\nPerhaps something more along the lines of, ‘Sam you were right, I shouldn’t have considered divvying it up that way - but if you could check in your sister from time to time when I’m gone that would give me such peace’.", "I say just give Emma the house and car and everything \n else go 50/50. Simple", "Which is why I said the kids should agree! \n\nThere are ways OP can make that happen and it involves communicating and talking", "Agree. OP offhandedly mentions her husband was (partially) the cause of Sam’s [eating disorder](https://www.reddit.com/r/AmItheAsshole/comments/109qmli/aita_for_giving_one_daughter_more_inheritance/j3zwejy/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3). She sure does a good job as painting Sam as someone whose just naturally brilliant and achieved everything she ever wanted, and completely glossing over the struggles she faced.", ">She said that the parents always favored the sister\n\nAs a child it's easy to think a sibling is being \"favoured\" especially when you don't really understand like the example used in the OP - the mother spent more money on Emma for tutoring whereas Sam didn't need that.", "Yessss thank you! I edited it", "It does beg the question of why tell the girls about the inheritance at all? I get the house and car for the daughter that doesn’t have a stable place to live, but why discuss the money side? Good points on the underlying issues - I hadn’t seen the eating disorder part yet.", "To your first statement, yes I do want that. Sam already resents Emma and OP for her childhood, but lining out very clearly what's in the will gives Emma more ammo for her grievances, whether justified or not. \n\nAs to your hypothetical, I can only answer to how I \\*think\\* I would react. And that is to accept that you can't change others, but you can change yourself. I'd hope that if I were making 500k a year that I'd stop resenting others and be happy with all that money. Again, this is a hypothetical but I'm sure willing for someone to give me 500k and let me find out.", "I am sure all three of them have a very different perception of what happened when the daughters were growing up.  Objectively, Emma does have several mental health diagnoses and it sounds like Sam was always healthy and functional. It’s so much easier to point and someone with cancer or some other physical diagnosis and see how the person needed more medical care and accommodations, than it is with mental health. Ultimately though, OP is the one making the will and her understanding of the situation is that Emma’s progress in life has been hindered by mental health challenges. \n\nI do kind of wonder about the sister’s relationship with each other, and whether Sam has always resented Emma and perceived her as getting more attention. That would explain her feelings a bit more. And it may be a NAH situation as many kids with disabled siblings feel resentful and neglected. \n\nI have some chronic health problems due to cancer. I used to work 70-80 hours a week and now I can only work about 20-30. I have a friend who still works that busy of a schedule and every once in a while she will make a comment about how nice it would be to have more time off. (Not totally pointed but kind of just a little resentful)\n\nI always come back with, “wanna switch?”\n\nHer answer is always no. \n\nI kind of see Sam a bit like my friend. I seriously doubt she would want to be Emma, if she ever takes the time to stop and think about it, even with the extra inheritance.", "Spoken like someone who doesn't understand ADHD at all, because you sound like it was Emma's choice. \n\n&#x200B;\n\nThis isn't about choice. Emma has ADHD. She is Neurodivergent. She has a medical condition that makes it hard for her to maintain focus. To remain motivated. If she is able to find something that she is passionate about, then she may be able to find success in her chosen field. But for a lot of people (not sure of exact figures, but I have heard anything from 20 - 40% quoted) who have ADHD, it is severe enough that they are unable to maintain a steady job.   \n\n\nOP has a very real concern about her daughter's long-term financial security, and she wants to do what she can to make it easier. Cut her some slack.", "My thoughts exactly.", "That is possible too. I hadn’t considered feeling like second place. I also feel like that’s hard to know for sure. Sam is so successful in everything she does I feel like she’d have to have some sense of accomplishment. She’s thriving but feels second place because her sister gets help that she herself doesn’t require? And help in this sense is a monetary thing so part of its at least about money. It could happen, seems weird to me, but not impossible. OP should try asking what her daughter is feeling, if she’ll speak to her.\n\nEdit: if we’re talking about feeling like second place then Emma most certainly feels like she’s second place too. She’ll never be the successful person that her sister. Truly they might resent each other and/or OP when they’re all feeling this notion of second place. Sounds like a proper family discussion with honest and open feeling should be had. If it’s really not about the money they should be able to reach a consensus and OP could even do better by Sam now in the present without compromising monetary help for Emma in her will.", "Gotcha", "Was just editing as you were writing. Lol. Always glad for confusion look-outs in the comments, thanks. 👍😊", "Yeah. Guess Mum doesn’t think through the bit when she lives for 20 years and the person she treats like crap is the one making all her medical decisions.", "I get you and Im sure thats tough but thats not the case here. Giving extra tutoring and support is not the same as coddling. \n\nOf course she supported the older sister more, she needed the support. Why would the younger daughter who has a husband, 2 children and 3 houses need any money for rent or the dads used car? \n\nIts nonsense to think that the sister who doesnt need any help should get help so her feelings arent hurt while the other ones breaking her back to barely survive.", "This. I said this in my original comment, but it sounds like it may not even be about the money and more that Sam feels her prize for digging the better ditch has always been a bigger shovel. \n\nI'd be pissed off too in that case.", "She says that Sam struggled but was able to overcome her difficulties and succeed in life. Owning multiple properties and making 500K annually. She definitely needs therapy with the family and one on one because she’s clearly resentful. Success doesn’t mean that you’re not hurting or need closure but it’s not a valid reason to be greedy when you need for nothing and you’re only sibling is potentially homeless if not fit your mom. And I have 6 sisters so trust me y’all, I get how traumatizing childhood and in general is, but Sam is wrong. OP is NTA", "It seems that’s already the currently agreed situation. To be clear, I wasn’t saying Sam is or should be obligated to look after her sister. Just that *if she was* then the inheritance should go 50/50.  This is simply a different method to achieve the same ends", "Well , while no one can be 100 % certain , chances are that the woman with ADHD and a high school diploma will be in a worse financial position than the woman that works in tech ( i'd assume she has a degree related to the field) , makes good money on her own and is married to someone that also makes very good money . Sam and her husband probably make in a year what Emma makes in a decade . IF their circumstances change that much in the future , OP can just rewrite her will .", "Woooow. You believe ADHD is simply being lazy. Guaranteed the one with adhd is more exhausted than you’ll ever understand.", "You don’t have a good grip on how learning disabilities work. They’re disabilities, they’re permanent, early educational intervention makes a massive difference in outcome, and some people are more impaired than others. Emma did not get early intervention, and may not be able to pursue further education or career development at a pace that justifies the expense. There’s no evidence that she’s slouching, and some to suggest she does her best within her capacity. So she should be left to struggle more than necessary, because her sister is greedy?", "She did nothing to deserve having ADHD. Emma only just passed high school, what makes you think she's able to \"get an additional degree\". Not that a degree is any sort of guarantee of a good job or income and is likely to land her in a significant amount of debt.  \n\n\n>Why would the kid who slouches off deserve more than the hardworking one?\n\nNo one has suggested she \"slouches off\". In fact it's stated that she has a job which is \"back breaking\" work. For all you know she worked twice as hard just to get where she is but wasn't more successful because she was born with one hand tied behind her back.", "Having ADHD isn't \"slouching\" . She has a job and seems to be doing the best she can.You don't seem to understand how ADHD works. It is not all in our heads, and can be extremely debilitating and tough to get ahead. She isn't less than her sister. She tries. Better to keep  them both fed and housed than a total inequity of assets. She isn't a bum playing video games, and not everyone can successfully get a degree.", "Since you brought \"deserving\" into the conversation , NO ONE \"deserves\" an inheritance . The property and money belong to OP , and it's up to her to choose what she does with them .", "Emma would have to pay utilities and any other form of upkeep for the house that she wanted done. And there would probably be rules set that Emma can't have anyone else live with her in the house unless Sam approved them. Therefore if Emma ever wanted to get into a relationship and live with her partner, she would probably have to move out. There are ways to work out the details with good contracts.", "Emma is stuggling so she should struggle more and sam is doing well so she should be rewarded? \n\n\nHow is sam getting screwed by the way? Its just money, she has plenty of that, its not like mom is giving emma every single scarpbook too.", "I don’t want Sam to be able to sell it", "That is a separate issue.", "yes i also have ADHD. congratulations on us for being successful and being able to find high paying jobs and bathe in our wealth. just bc we can do it and manage our symptoms doesn’t mean someone else can’t. there are literally people with ADHD who cannot talk, cannot focus for more than 15 seconds, have regular breakdowns. just bc YOURE fine doesn’t mean SHE IS. and based off what OP says…. it doesn’t sound like much will change. one sister is rich married rich has kids and has multiple houses. the other is older and does not have any of those things…. giving her a house and car is nothing…. especially for someone who has a debilitating mental illness.", "i agree OP needs to help her now. i suggest she moved her daughter in with her. puts the house in her name so it’s ALREADY hers as of now. and teaches her how to manage money, pay the mortgage, keep a house clean, etc….", "That.... what she needed. If Sam didn't need them then why would she pay for that?", "Paying for tutoring for a kid who has difficulty learning in school or therapy doesn't mean you are making the other take the back seat? Its literally just decent parenting.", "You're aware that not everyone reads every single one of OP's comments before posting right? Maybe think about this before calling random people disgusting...", "geez I didn't see that comment from OP wtf she just brushed off Sams mental health struggles. she sounds like my mother who always favors my younger sister (who makes bad decisions) and dismisses my mental health struggles from abuse from my father (wait did my mom write this post??)", "Where anywhere in this fucking post does it refer to abuse?", "I never said that did I, one person is clearly struggling and the other person is very well off. If I want everyone to be successful but one is struggling I’m going to put more effort into the person that is struggling.", "... that's the whole point of being a parent... making it so your children aren't reliant on you.  Emma unfortunately has a hindrance in that regard due to no fault of her own.", "With time and affection I will get them both but Sam doesn’t need help financially.", "So, the stocks are only worth 20% of the estate, and you want Emma to get half of that as well as the 80% that is comprised of the house and car, leaving Sam with 10%? Wow.", "That would give Emma 80% (the value of the house and car), plus the 50/50 split of the 20% that was going to be slated for Sam.", "Ideally, yes. But if the rich sister doesn’t agree, I would do it anyway.", "OP said a lot more than that. She thinks it isn’t fair that Sam is so much more successful than Emma. It is absolutely fair because Sam worked her ass off for her accomplishments. Sam also had an eating disorder and those don’t happen in a vacuum.", "Perhaps, but if that perceived \"lack of need\" is because one daughter was better at handling her own issues (which from OP's comments it sounds like Sam did have), it can easily become a sore spot that festers over time.", "Okay. Yes, it's great that you are a bigger person. Sam isn't, and she her feelings are valid.\n\nThanks for your reply.", "But Sam wasn’t always healthy. Read OP’s comments - her husband partially at fault for causing Sam to have an eating disorder. So hot only they gave her less attention and love, they gave her an eating disorder and now still will give her less.", "Consider that OP, changed the will, after the Dad died. Consider that childhood trauma and events do contribute to adults behaviour and patterns (Sigmund Frued I think) \n\nAlso, her daughter did tell her how she feels and OP glossed over that with 'You make more money', I'm pretty sure when they were younger Sam was constantly told, 'You don't have ADHD' when she pointed out favoritism.", "Okay yeah not trying to be an ass just was clarifying!", "Yikes. I've seen this in action and would recommend you try to avoid this!", "“Treats like crap”?! Wow. That’s a leap. OP has said nothing to even hint that she has treated her youngest like crap. \n\nOP focused on equity, not equality. If you don’t know it, look it up. \n\nThe younger daughter needs to look at the situation objectively and stop being greedy.\n\nAnd yes. I am my parents’ caregiver, I will be their executor, and I am getting less than my siblings. But I’m not a selfish asshole and understand that I’m in a better position than them. And I’d rather my siblings get what they need than us all be given to equally.", "That’s a great expression about the ditch and shovel.", ">She says that Sam struggled but was able to overcome her difficulties and succeed in life\n\nWell, no, she doesn’t. Obviously we can infer that, but in the post she simply talks about how Sam has always been capable, excelled, and an overachiever. And in the comment above she only mentions the eating disorder because of her husband, and still doesn’t acknowledge Sam’s difficulty in overcoming it.\n\nBut yes, overall I agree with you that Sam needs therapy, and this is not a healthy way of dealing with her feelings.", "I think it’s a tough one, Emma shouldn’t be enabled. If she can’t fulfil basic needs in her 30’s… there’s a bigger issue than just ‘emotional’ stuff. Emma probably knows she’ll be financially sorted if she whinges. Sam probably knows the game and hates it.\n\nMy partner and I both have adhd. At times it can be a struggle, but we manage, because we *have* to. If I were given rent for having adhd, I’d ride that baby home.", "There are other options such as a life estate. I think you can accomplish what your looking to without alienating one child. Consult with an estate attorney.", "You really don’t like Sam and it shows.", "I assume they're referring to the comment about Sam's father being the cause of her eating disorder.", "Yeah, but if your effort is your final wishes, isn't really an effort... is just delegating the support to when she won't be around.", "I see that, I'm just saying that Sam's feelings are been disregarded just because he is fine. YTA for making a decision like that without consider Sam's feelings.", "But there is the hole point. Why are you finding justifications to do anything different from 50/50? \n\nWhy did you even mentioned to them? If was only about the values, they could find out on the reading. From what you said, the value don't even make a dent on Sam's life. Is about the gesture itself.\n\nLove and time is what is precious... memories, knowing that you think in their family too, wills bring a lot of clouds on that subject, is not about the value, is about that you care, and if is anything different of 50/50 it is favoring.", "Weird. Punish your child who put a lot of effort into her education and future, while rewarding the one who didn't. It's cool though, Sam will be rewarded with your affection... Whatever that means.", "perhaps you can add some sort of a statement in the will like \"Emma will inherit my home unless making X amount of money by the time of my death in which the estate will be split 50/50\" but I think it could be best to talk to some sort of lawyer to figure out how to make it more fair and also make the executor not one of your daughters. Also it's good to remember that while Sam does make a decent amount of money your inheritance will go towards your grandchildren as well.", "Except she will probably want the rich sister to be the power of attorney and make all the medical and care decisions. \n\nSometimes you’re creating drama where it all could be avoided by having some decent conversations", ">She thinks it isn’t fair that Sam is so much more successful than Emma.\n\nI don't see that anywhere in the post. Possibly we have an entirely different perspective on that. \n\nWhat I get from it is, Sam is in a great position financially, Emma is not. Emma was undiagnosed ADHD and considered  \"lazy\" and that she \"didn't apply herself\" - not until her teens did she recieve any kind of support for that. The mother wants to use the will as an opportunity to ensure that the daughter that needs it most gets the financial leg up. \n\n>Sam also had an eating disorder and those don’t happen in a vacuum.\n\nOnly a mention of the father being a contributing factor to that. Clearly though she recieved enough support to get through that and recover.", "And I completely get that. Of course it does. And it certainly sounds like Sam needed more attention too. \n\nBeing a parent is hard and sometimes you have to make the crappy choices - I just had to miss one of my older sons big moments as my baby had a cardiology appointment that I couldn't reschedule - it doesn't mean I'm favoring the baby. And I'd really hope he doesn't resent me or her for the fact that her medical appointments have to come first sometimes (when they can be rescheduled they are but when they can't be... sometimes dad just has to be enough)", "Sam’s feelings are hurt but Emma’s reality is hell. It sounds like she’s homeless without mom while Sam owns multiple properties(good on her). She can and should go to therapy, instead of harboring resentment towards her family.", "That is a fair point. I did miss the comment about the eating disorder but I went back and found it.  It doesn’t sound like OP thought that to be very serious, although she is insightful enough to recognize that her late husband would have wanted the inheritance split 50/50. I wonder if some therapy session with OP and Sam would help the daughter feel less resentful and the mother rethink things a little bit.", "Well for all the reasons Sam’s adult behavior is affected by childhood trauma and such so was was Emma. Maybe Sam watching Emma get all the help did push and encourage her to be super successful. Which good for her. At the same time Emma struggling her whole life and watching Sam be everything she couldn’t be also sucked too. We all are affected by our childhood. And we all obviously are treated differently for the adults we become. Just because Sam watched Emma get tutoring lessons and she didn’t doesn’t mean that Sam’s behavior for wanting 50/50 is right, it just explains why she feels it should be that way. If this is about money. If it’s not about money, if Sam realized she doesn’t need it, then Sam shouldn’t care what happens to the money if OP can change her behavior to reflect of being more supportive of Sam.\n\nI don’t think one line saying Sam feels OP is playing favorites is detailing how Sam really feels. I have no idea what Sam actually said, only what’s posted. If Sam didn’t tell her mom she didn’t care about the money and just wanted a mom that helped and supported her in other ways then that’s completely different. That’s just why I suggested an open and honest discussion. We only know so much on this post. If Sam made it sound like it was just about spending more money on Emma their entire lives then naturally that’s all OP has to reply to as well. Or OP is omitting things. Who knows. If OP knows this is more than just about money for Sam then that needs to be addressed at a deeper level than just doing 50/50 on the will. A lifetime of childhood trauma as you put it won’t be fixed by just an equal will.", "Oh for sure. As a reader I've been happy to have points clarified by an observant commenter! 😊 Edited for clarity lol", "I understand equity!\n\nBut Sam is voicing that she feels like Emma has had all the favourtism forever! \n\nIt’s up to OP, as the parent, to fix that!", "Thanks, but I didn't invent it.", "Why do you assume emma is being enabled and not faving legitimate struggles that not everyone might face? Why are people treating her as if shes a failure that needs to be given up on and thats the best way to \"help\" somehow? That seems insane. \n\n\nAlso, its still not explained how how sam is suffering here?", "I just saw that comment, but still, what the fuck does that have to do with op.", "Exactly which is exactly what life insurance and inheritances are typically used for, to support the people you can when you’re no longer there. Support which sam does not need but Emma does. If someone is living In a million dollar home and has other property’s they are no where near struggling and do not need the help the sister does when taking home probably more than 10x the sister does on a yearly basis. It’s greedy and entitled to be well off and doing better than most of the country and be upset your low income struggling sibling is getting more help than you.", "Equality isn’t the same as equity. \n\nSam is just greedy. She’s in the top percentage of owners, has wealth and shelter. \n\nSociety is designed to look after the vulnerable which\nEmma is.", "Right. Classic. You work hard and make something of yourself and somehow you’re punished for that. I’m successful like Sam but I’m an only child so I will never be in this situation, but I can imagine that I would be pissed if I had a sibling and this was my mom. I kind of understand 60/40, maybe even 70/30 max. But 80/20 is insulting on principle, if I were Sam I would think it was a pity inheritance so it doesn’t look like it’s completely favoring Emma", "To be clear, I'm not saying that's not often the case. (I'm disabled myself, so I know how that stuff goes)\n\nThat said, it sounds like you're conscious of the imbalance and would venture to guess you're going to make sure your older son knows he is cared for as well. It sounds to me like that may not have happened here.\n\nIf I'm being brutally honest, it also seems like OP may be allowing her daughter to lean on her ADHD a bit too much. It's a real thing, but one that many of us (including myself) have had to learn to deal with. I'm not sure I would go with it as a blanket excuse for a lifetime of underachieving (and before anyone says it, I know that sounds harsh).", "She’s been given financial help. And therapy. But it’s been how many years? How else is she getting help? Because the rent is a Band-Aid. Not actual help. Yes she needs REAL help. Stand on her own feet. Not an allowance.", "I have a feelings it’s more than that. It seems like she heard, “Sorry, you can’t do that/I don’t have time for that, Emma needs this” for most of her life.", "Did you see the part where OP admits her [husband gave Sam an eating disorder](https://www.reddit.com/r/AmItheAsshole/comments/109qmli/aita_for_giving_one_daughter_more_inheritance/j3zwejy/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)?\n\nThere’s more to this family dynamic than OP is being upfront about. BOTH daughters have had troubles. One managed to thrive but the other didn’t. \n\nOP is punishing Sam for her success, and Sam has plenty, PLENTY to be angry about.", "What is REAL help? \n\nIt sounds like she has some pretty serious issues, maybee the type of person who, without external support of some kind, would end up homeless or in prison because they cant handle thier issues on thier own.\n\n\nIf you had a child with treatment resistant pressure headaches, you might need to support them in part thier whole life.\n\nYou act as if emma is simply lazy rather than suffering from real issues that impact her quality of life and ability to navigate the world.", "It is stated that she simply has ADHD. I’m stating that it would have to be something more than that for it to debilitate her to this extent. REAL help would be figuring out what that may be, or figuring out the foundation blocks to a life where she can find her own independence. I’m not assuming she’s lazy. But I do think it’s important that OP doesn’t enable Emma or that Emma relies on her financially too much. Because at some point, Emma won’t have that. This isn’t a headache or a broken bone, this is something that can be managed over time. It may not look like 9-5. But there’s something out there that can suit her. She’s working at a stale job that would be so mentally draining, especially someone with adhd. Thats 1 thing right there that can be improved.", "OP actually says she has some other serious issues and is in therapy for them including it sounds like esteem problems (probably caused by her parents assuming she was lazy when she needed medical intervention). So, not just ADHD.", ">It is stated that she simply has ADHD\n\nThats not what OP said actually, please re read it and maybe consider your bias?"]}