{"id": 7125, "submission_id": "109tbzs", "title": "AITA for being brutally honest with my friend before her wedding?", "selftext": "My best friend for the last 10 years is getting married in a few weeks.\n\nThis past weekend was her bachelorette party. She got quite wasted but I don’t drink a lot so I played it safer and stayed pretty coherent.\n\nAt one point she was in the bathroom vomiting and crying and looking though pictures of her ex on Instagram. All the other girls were comforting her and talking about what a piece of shit he is etc., the next maybe hour turned into fixation on her ex, how they should have been the ones married etc.,\n\nHer ex recently had a baby with his new wife so I understand it may have opened old wounds, but they split up 5 years ago.\n\nI am also one of the few people who actually know why they split up and all I can say is it was definitely her fault. \n\nAfter the hour I tried to get us all out of the bathroom and continue the night. The next morning things seemed fine but then my friend was going through her phone and saw she had called her ex 10+ times. She freaked out but the calls were all so short we assume he didn’t pick up.\n\nI told her she needed to delete his number from her phone and move on because it wasn’t fair to the guy she is marrying if she continues to be hung up on her ex.\n\nEveryone got really upset with me for being insensitive and I was made to feel like it was my fault for letting her call him. Eventually my friend asked me to go home early. I learned from one of the other bridesmaids that they spent the rest of the morning bashing me in addition to ex. I was told part of a bachelorette party is getting closure with old relationships and my judgmental attitude ruined it for the bride to be.\n\nI talked to my sister about it and she said while my friend was being ridiculous that it’s my job to put aside my feelings for the bride as MOH. We are all in our 30’s though and this seems very odd to me.\nAITA?\n\nUpdate: Wow! So many comments! I’m at work right now but trying to read as many as possible. I didn’t expect to get as many responses. Thank you for all the judgement.\n\nI just want to put this here as a lot of people keep saying I should tell her fiancé. In any normal situation I would agree but in this case she has been asked in the past to choose between him and her ex. She chose her ex, she made it clear to her now fiancé she would rather be with her ex. But her ex said he didn’t want her and left, so she stayed with her now fiancé. He knows on some level. Telling him wouldn’t be a big revelation and likely wouldn’t make him end the wedding. It would just make him sad and “rub his nose” in something that he is aware of.\n\nSecond Update: I’m so sorry these are so scattered I spent most of my break catching up on comments and a few more main points to address-\n\nThe other bridesmaids are not my friends, I’m only friends with the bride. \n\nAlso people keep asking why I am her friend. One main reason, as sad as it is I didn’t have a real friend until university. The town I grew up in was very small and conservative and I’m a gay woman. When I came out in Highschool I became a pariah. \n\nShe was the first person who was ever kind to me, ever stood up for me and was my first friend so I think maybe I have been more willing to turn a blind eye to her poor choices than I should be. But I am reconsidering that now. I do have a much better and broader support circle now but I do think I see see her as that kind freshman and sort of my savior which clouded my judgement in not being more upset with her toxic choices over the years.", "created_utc": 1673507733, "permalink": "/r/AmItheAsshole/comments/109tbzs/aita_for_being_brutally_honest_with_my_friend/", "score": 3651, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I was brutally honest with my friend about her feelings and behavior toward her ex before her wedding. I might be the asshole because I wasn’t being sensitive to her feelings and letting her get closure in a safe space.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">I was told part of a bachelorette party is getting closure with old relationships….\n\nUm, no. Closure with old relationships should have happened way before accepting a marriage proposal.\n\nNTA. At all. Your friend seems to still be carrying a torch for her ex while planning to marry someone else. Poor groom.", "NTA. I'll never understand these friend groups that never tell each other the real truth. She doesn't sound like much of a friend tbh. Plus, I thought the point of a bachelorette party was one last night out as an unmarried woman not spending the night wishing I was marrying my ex? The fact is I feel bad for the groom because he's obviously second choice and he'll probably get treated like crap.", "NTA. Its not common, or healthy for a large part of the party to be spent pining over an ex and the BTB wailing that she should be marrying the ex not her HTB. To be honest, she probably shouldn't be marrying anyone until she gets over her ex. I feel sorry for her fiance.\n\nE: spelling.", "Clearly NTA here. You did nothing wrong in telling your friend to respect their partner and delete their ex’s number. The groups sounds problematic and I hope you don’t hold yourself in bad esteem because of their behavior.", "NTA \n\nWhat? It’s your fault that she is hung up on her ex, that I’m assuming she cheated on, and drunkenly dialed him 10 times after crying on the floor for hours!\n\nYou’re right she should delete his number and be fair to the guy she is marrying. \n\nAnd how in the world is it your fault? Could you have taken her phone? Hahaha imagine that scene! Did you dial him? No!\n\nShe’s a victim! She will always be a victim. Nothing will ever be her fault", "I’m sorry but why is she getting married", "NTA\n\nYour \"friend\" is delusional if she thinks that part of a bachelorette party is about getting closure from old relationships. That is something that happens when you get serious about a relationship, not wait until a party before taking vows. Are you sure that you don't want to use this party as your way of getting closure on this \"friendship\"? After all the bashing she and her friends did towards you, you should just cut your losses and make this \"friendship\" a thing of your past.", "NTA she's about to get married and she's still drunk calling her ex. She should not be getting married. You were mild, her behaviour sucks.", "Yeah, it is odd. And immature. And not fair to her ex nor her fiancé. She was doing something stupid and you decided to be the only adult in the room. NTA.", "NTA. Real friends tell you the truth even if it isn’t what you want to hear. You did just that. I wouldn’t want friends that just comfort me and hype up all the time. That isn’t honest.", "NTA, but the bride's friends are. You can't blame alcohol-induced disaster decisions on \"bride-to-be\". They're just bad decisions. The expectation that everyone would coddle the bride (to this messy extent) is unhealthy. \n\nYou're privy to the bride's damaging past. From experience, I can tell you that your status (as the knower of things that shouldn't be discussed) won't be rewarded. You'll catch fangs any time you step out of line, and your name will go through the mud before bride admits to what you know.\n\nBite your tongue, let everyone do exactly what they want to do for the wedding, and find a new crew.", "NTA. They can’t blame you for the bride calling him T the same time they’re reprimanding you for telling the bride to get over him! If I were you, I might start beginning to look for some new (+ more mature) friends.", "NTA. \n\nDefinitely don’t take the role of maid of honor though, that seems like a bad call.", "NTA You are MOH and her best friend, you are the person who should get her straight. Also you can't be blamed for her calling her ex. She's acting ridiculous and unfair to her SO and her ex.", "NTA. As a best friend, I would expect nothing but the truth.", ">I was told part of a bachelorette party is getting closure with old relationships\n\nThat's not a thing. If you still need closure you shouldn't be getting married. NTA", "NTA because everything you said was fair and you were giving practical advice about how to continue the night without any more drama. I think the only reason things have escalated is a mixture of drink, heightened emotions and other people on the hen do sucking up to the bride.", "NTA. I don’t think you were brutal in the least, just honest and the others are just feeding the crazy. \n\nThis isn’t what someone should be thinking and doing right before their wedding, no matter how drunk they are. She may not be able to be with the ex, but it also doesn’t sound like she’s ready to be with someone else for the rest of her life.", "NTA. You were trying to help her. Sounds like marrying this guy is a really bad idea. Don’t understand why people were upset at you.", "NTA you were just being a friend to her. Friends tell each other what they think. Honestly she was probably out of line and didn’t like you calling her out on it. But it doesn’t seem like you actually did anything wrong here. Hopefully she realizes that and apologizes or at least talks to you about it so it doesn’t affect your friendship moving forward. Good luck with that.", "NTA, telling the truth usually isn't fun, but necessary and the fact that she didn't know that it is an issue is a red flag to her husband, if he finds out about it", "NTA and what a group you were with! Yikes.", "NTA I feel bad for her husband, she is straight up trash and he should find better. You’re a good friend for being real with her.", "NTA and she should not be getting married since she's clearly not over her ex. The bachelorette/bachelor party is so NOT about getting closure on past relationships", "Bachelorette party is last  celebration before you get your life connected to another. Or as it is said last night as \"single\". You should have all your eggs in the basket and skeletons cleaned out of the closet before you consider saying I do. What you said is a no brainier, however it's not usually well received.  Sounds like someone's still hung up, but deciding to settle.over moving on. NTA Edit: you're a better person then me, after that reaction I would have ratted to the groom.", "NTA your friend has a lot of emotional growth to go through before even dating someone yet alone marrying them! I can resonate with your role as the rational friend, it will always upset those who aren't ready to hear it. I'm sorry all of this transpired, but your friend seems greatly immature and though she's soon to be wed, maybe try keep some distance from her.", "NTA. You weren't even brutally honest tbh you were just trying to talk some sense into her. I'd tell her fiance about what happened too before they get married.", "NTA I’d be telling her future husband about it just as a final fuck you then cut them out completely.", "NTA", "NTA and what you said was more than fair.  It seems though same age you are at a very different stage in life.  I think you should step down and probably look at separating ties for a bit.  She's cheating on fiance in an emotional affair.", "ESH you should have told her fiancé about it he deserves to know that she doesn't love him\nEdit: YTA -> ESH", "NTA, tell her fiance and save 2 people from a shit situation or keep mum.\n\n\"All it takes for evil to prevail, is for good people to do nothing\"", "Tell her fiance all the shit she was doing at her bachelorette party. He deserves to know.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy best friend for the last 10 years is getting married in a few weeks.\n\nThis past weekend was her bachelorette party. She got quite wasted but I don’t drink a lot so I played it safer and stayed pretty coherent.\n\nAt one point she was in the bathroom vomiting and crying and looking though pictures of her ex on Instagram. All the other girls were comforting her and talking about what a piece of shit he is etc., the next maybe hour turned into fixation on her ex, how they should have been the ones married etc.,\n\nHer ex recently had a baby with his new wife so I understand it may have opened old wounds, but they split up 5 years ago.\n\nI am also one of the few people who actually know why they split up and all I can say is it was definitely her fault. \n\nAfter the hour I tried to get us all out of the bathroom and continue the night. The next morning things seemed fine but then my friend was going through her phone and saw she had called her ex 10+ times. She freaked out but the calls were all so short we assume he didn’t pick up.\n\nI told her she needed to delete his number from her phone and move on because it wasn’t fair to the guy she is marrying if she continues to be hung up on her ex.\n\nEveryone got really upset with me for being insensitive and I was made to feel like it was my fault for letting her call him. Eventually my friend asked me to go home early. I learned from one of the other bridesmaids that they spent the rest of the morning bashing me in addition to ex. I was told part of a bachelorette party is getting closure with old relationships and my judgmental attitude ruined it for the bride to be.\n\nI talked to my sister about it and she said while my friend was being ridiculous that it’s my job to put aside my feelings for the bride as MOH. We are all in our 30’s though and this seems very odd to me.\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta.\n\nIs She a damn teenager? Wtf?!?!\nShe Is going to Marry someone after years of relationship and NOW She find a good idea think about her ex and call him? Call him for WHAT?\nit's a Red flag for the husband!\nWhat if the ex Pick up the call? Did She want meet him?\n\nOmg this bride Is an Epic AH", "NTA. She needed that reality slap. If they're going to cut you off, it's not your loss.", "How was the bride's drunken behaviour and the other bridemaids' enabling actions normal in any sense of the night's proceedings? At a hen's party????!!! \n\nThis marriage is not going to end well, judging from the bride's trashy behaviour. Honestly sounds like a really really stupid episode of Bridezillas!", "NTA\n\nIf part of the night was about getting closure, I don't see what the problem is with putting things in perspective. Friends tell each other the truth and help each other to grow. You offered that to your friend, which was a loving act. \n\nThe other people around her, the ones judging you for telling her a very simple truth, don't care enough about her to do the same. It's super easy to be a 'yes person'. You don't have to care about the person at all. You tell them what they want to hear, and go on with your life uncaring of the consequences to that person. \n\n*You* are a good friend.", "NTA. The bride is definitely not ready for marriage, still longing after her ex, even when knowing he is already married.\r  \n\r  \nAt least some of the other bridesmaids appear to be TAs.", "NTA\n\nYour friend isn't over her ex after 5 years AND an engagement? Her poor future husband.....", "NTA. You were right she shouldn't just be talking about her ex and calling her ex just before the wedding. It is not a good sign", "NTA. But if you care about your “friend’s” fiancé at all, you would tell him. Sure some people may say it is not your business, but if you are just a bystander while the partner gets married to a woman who does not love him nearly as much as her ex, I think that says something about you.", "NTA. A bachelorette party is usually to celebrate that you are getting married NOT spent crying over an EX...she clearly isn't over him or their relationship and probably shouldn't have said yes to someone else...it's been five years she needs to get help if she is doing this...what happens when she is drunk with her husband and pulls this crap. It's not cute. She needs to delete his shit and move on. She is acting like a teenager. Your the only one to tell her the truth.", "NTA. You were right to say she should delete his number since he has moved on with his life and she is supposed to be in the process of the next chapter of hers. It is unhealthy. Was this the first time it has happened while in this new relationship?\n\nIf this isn't the first time then someone needs to be honest with the fiancé because I doubt anyone in that room is going to be. If she is still hung on on her ex after all those years then it is just going to get expensive for them later. It feels like you were the only person in that room that had the fiancé in mind while the others were more focused on making sure the bride to be was okay. Which is fair in the moment but isn't going to be helpful if a band-aid is placed on it. Especially if she knows she caused the separation.", "NTA\n\n&#x200B;\n\nBut you don't want to be involved, because she is an AH ... pining for someone else than her husband. Marrying someone who is her second choice.", "NTA. Your friend sounds like she’s obsessing over her ex, to the point of drunkenly crying about him and blowing up his phone with calls. You are not responsible for her behavior when she drinks irresponsibly. It was right of you to tell her to her face that this is a problem, and it will most likely be a problem in the long run with her current relationship because thoughts about her ex will always lie dormant in her mind. I wonder if the other bridesmaids who support her are the type to also cry about and drunkenly call their exes because her behavior is inappropriate for a woman who’s about to get married.", "ESH so whilst I fully agree that she should delete that guy’s number and it’s not your fault that she chose to drunk dial him, maybe calling her out in front of everyone wasn’t the best move. If you had just left it at you need to delete that guys number, which again I agree with, then you probably wouldn’t have been kicked. Alternatively if you had spoken with her in private after the panic it would have been a lot more sensitive. She’s being unfair to the man she’s marrying and should seriously think about whether she’s over the ex before getting married to someone else.", "The worst part is she usually does say things like how important honesty is and that friends are supposed to look out for each other so I’m just very confused.", "Thank you. My only worry is a lot of people do tend to say the bride is always right so I worried I messed up but I’m glad some people see it the way I did.", "Quite honestly they were making such a big deal out of her calling him too but I’m actually quite sure that wasn’t his number anymore. Her IG deep dive showed he lives in a different country now and my brother lives there too and I remember he almost immediately needed a new number so I feel they were being really over dramatic about that.", "Yes, the poor guy. I'm sure OP is expected to be a good friend and not tell her fiancé about this. And the women won't tell her fiancé herself, probably.", "It is not good for anyone to live in an eco chamber.", "I fortunately have found a different circle the last few years so after the wedding i will lean into them. It’s hard because I thought after a decade we would always be friends on some level but perhaps not.", "She usually is very big on the truth too!", "I would agree but they didn’t get mad at me until the morning after so my bet is on hangover remorse emotions!", "I don’t know if it’s really fair to blow up her whole life over a drunken night of bad judgement though is it?", "Wouldn’t that at least be ESH?", "Yeah, the fiance deserves to know the truth.  I feel really sorry for him, she shouldn't be marrying him.", "This is a good point. Made me change my mind. OP YTA", "That’s fair, it would have probably been better to do in private, that didn’t even occur to me at the time. It all felt so frenzied.", "With people like that they are until the truth is told to them.  She probably felt threatened by you that hold knowledge others don't.  She's probably scarred you'll blow up her wedding.  Don't worry she will blow up her own marriage", "I'd say it was maybe just the drinks but the fact she made a point to trash you AND her ex the next day makes me think she's a hypocrite and uses that \"be honest\" excuse so she can call her friends out on their behavior while expecting hers to be accepted.", "\"The bride is always right\" is just as nonsensical a saying as \"the customer is always right\". Both brides and customers are perfectly capable of being blatantly wrong. NTA", "When wrong no one is always right. Your friend is manipulating a lot of people to include her fiance.", "Nah you’re solid. People love to power trip at anything having to do with a marriage. It really gives people a chance to show their real colors.", "Ohhhhhhh. If he is in another country then he definitely has a different number. \n\nBut she definitely isn’t over him. \n\nI don’t know any happy bride who is stalking her ex on her bachelorette and crying over her ex and saying “they should be married” \n\nShe’s a hot mess", "5 years later? That wasn't just one night that has almost definetly happened before", "This wasn't just a drunken night of bad judgment. She has carried his number around for 5 years after they broke up. She was mad that the life he is living without her, should have been with her instead. She carried things into the next day and her and her friends were more than happy to bash on you and the ex. The fact that all it took was alcohol for her to act like a total disrespectful ass, shows that she isn't a good fiancé to her current man. The fact that her ex is happily married and just had a kid should have been enough for her not to repeatedly call him. Being drunk is no excuse and not a cop out. The amount of disrespect on her part all the way around is appalling.", "Yes you are right", "You may be right… this was the only time I’d seen though, also the details make it a bit sticky because her fiancé kind of knows he was a second choice, I can’t say much but I can say I don’t think he would end the wedding if I told him i think it would just cause a temporary blow up and bad feelings for a bit.", "This is very true.", "Sounds like a soap opera trainwreck.  Good luck developing new friends who have their shit together more.", "Honestly, I really don’t think you should blow up her life. No one knows what it’s like to be in another person’s relationship, and it’s wildly unfair for you to make a huge decision like that on her behalf even if it’s supposedly for the greater good. \n\nThe friends you want to have your back are the ones with enough integrity to disagree with you. I think you did the right thing but delivered it in a package she didn’t want. Maybe sometime before the wedding, taking some time with her alone to apologize, then really ask her if she wants to marry her fiancé. Coming with curiosity and love tends to work much better than straight talk for people in some sort of denial.", "NTA.\n\nIt’s good to hear that he likely has a new number because Id feel terrible for his wife and new baby being disturbed by this drunken mess.", "NTA. If I was the groom I would want to know about this and would postpone the wedding, if not outright canceling it. She is still emotionally attached to her ex and the groom will be the third wheel in his own marriage. The bride needs therapy to sort her head out. And her friends are just toxic enablers.", "Wait a minute, what? Your friend is still hung up on her ex but yet she’s in the mist of getting married?  If anything, she’s TA.  Her fiancé and her will not last very long if she doesn’t move on from her past.\n\nYou are NTA. Not even close. You spoke the truth which is what a friend should do.  It’s not like you went out of your way to tell her fiancé. \n\nYour friend needs a reality check.", "NTA but I've got to be honest with you, her soon to be husband should have this information too. If my partner was acting like that before I was meant to marry her I... Wouldn't want to marry her. Save him some serious grief.", "NTA. Her new husband might want to run away fast while he still has time. Alcohol to some people is like a truth serum. The more they drink the true nature of what they really want comes out. If you are that good of friends for that long making sure she didn’t do something stupid before getting married is everyone responsibility (minus the drunken fun). The fact that they are having a little bitch session tells you where your friendship lies and her morals are.", "NTA, I'll give her new marriage 12 months", "NTA You were trying to be a good, reasonable friend.", "NTA OP.  True friends should be able to tell each other the honest, even if it hurts, truth.  \n\nShort history.  My very best friend, Pam, who is like a sister to me was dating this guy who cared very much for her and she really liked him but she wasn't ready for a serious relationship at the time.  She would tell me constantly about their \"friendship\" and I must say he treated her like a queen.  After 3 months, and she had no developing feelings for him, I told her that she need to stop stringing him along and let him find someone who will give him the love that he deserve.  That I know that she loved the attention he gave her but she wasn't being fair to him.  I had to remind her that we've both been in his place and it didn't feel good and how we wasted time (a year or two) with people who didn't want to be in a committed relationship.  She told me that I'd slammed her with a bucket of ice cold water with the facts and she ended their \"friendship\" that week and was honest to him about her not feeling what he felt for her.  It's been 15 years since that happened and we are still sister friends and every now and again, she will bring this story up and tell me that while what I said stung, I was the only one of her friends to be completely honest with what she was doing was wrong.\n\nHopefully, your friend will have a chance to sit back and think on what you said and realize  you said what you said not out of maliciousness but because you cared for her and her soon to be husband.  And also, that you were the only friend to be honest with her and not a sycophant as her other friends were.", "NTA can you call any of these people “friends” when they quickly turn to talk shit about you?", "Your friend isn't ready for marriage tbh", "NTA. She’s in her 30s but has the maturity of a 19 year old. If she isn’t over her ex, she shouldn’t be getting married. And she should delete his number like you said, and delete his social media too.", "NTA.\n\nAnd I wish to point out something that you mentioned in the comments: the bride is NOT always right! Just like a customer isn't always right. If someone is being an idiot about something or they made a bad decision, they should be held accountable. Calling your ex multiple times on your bachelorette party is one of those times you should speak up and get her to pull her feet back on the ground.\nAlso, bachelorette parties are NOT to get closure with past relationships. It's to celebrate the one she is in and what it's about to become! This is among the dumbest things I have heard, sheesh.\n\nIf she was the one who was the reason her ex and her are no longer together, she might be regretting her past decisions or feel bad it happened the way it did. But they broke up 5 years ago, holding on like this isn't healthy. Is she seeing a therapist? If not, she should.\n\nHer ex has moved on, it's time she did the same. (And sorry to anyone reading this if I seem very blunt and insensitive in my wording, but this type of behavior infuriates me.)", "Is this for real? OP is 100% NTA.\nIf the Bride wants to remain your friend, she will contact you, but maybe you don’t need that kind of drama in your life. \nShe obviously has issues in her life and she will blame everyone, but herself or take any accountability for them. No one needs that kind of negativity.\nFor all you know, there’ll be a divorce in the near future and then you’ll be blamed for letting her marry this poor guy instead of stopping her from going ahead with it. That she didn’t know what she was feeling. \nNope - no one needs this. Cut your losses.", "NTA wow your best friend is a ahole she's ruining so many lives with her indecisiveness. I really bad for the groom and her ex and his new wife . You are the only sane one in that group .", "NTA. Your friend needs to grow up, and move on.", "NTA. To my knowledge that’s not exactly what a bachelorette party is for.  \n\n You did the right thing. She needed to hear the truth from someone. She should have been over her ex before saying yes to her fiancés proposal. This isn’t fair to him. And her behavior of calling her ex isn’t fair to the ex or his new family. It’s disrespectful to everyone involved. \n\nAll the other women involved are enabling her destructive behavior.  And you getting bashed for it shows their immature behavior.  You seem like the only one with any sense out of the group.", "NTA, she's about to get married and spent any time at all at her bachelorette sobbing about an ex and calling him? That's not right and it's not fair to her fiancé at all.", "Damn.. I feel sad for the groom.. He's gonna married someone who wants someone els, soo badly they are willing to throw it all out..\ni would talk with the groom and warm him.. it's not fair towards him.. and he's gonna end op spending years married to someone who's prob gonna divoice him and take his things and money when her ex say.\nNTA", "Nta", "NTA But PLEASE tell the groom. He deserves to know.", "Right? I didn't think of my ex once during my hens, or like... ever because I don't care. What a weird outlook to have.", "This husband is gonna bolt 9/10.\n\nNTA", "I’ve only been part of one bachelorette party, and part of that was smack talking her bad ex’s but that was maybe 5 minutes at most and for her, it was kind of important for her in terms of healing/realising how far she’s come (abusive relationships).", "ESH, because let’s be honest, a decent person tells the groom what’s going on.", "This!", "Is there a big difference between bachelor and bachelorette parties? Never been to either and never understood the concept. But sitcoms usually told me it was to hire strippers. And if you want more drama, you're supposed to consider the party as your last night as a single person sleep with one of strippers when you get drunk enough.\n\nAnyway I was never into the idea as it seemed like cheating on your partner or potentially preventing your wedding from happening. But I hadn't heard the version of it being to get closure with exes.", "I think of exes randomly in passing. Something will come up and spark a memory. But I don't have any of their phone numbers,  don't check out any of their social media,  and am certainly not dwelling on any of them. \n\nIt sounds like OP's friend screwed up with this ex and can't let it go. Friend probably isn't ready to marry someone else.", "Yeah, talking smack about a few ex’s because you’re looking forward to the marrying the partner you feel is right for you is a bit different than cyberstalking an ex and crying about him being the one you should be marrying.", "I mean, I probably would tell the groom, but I don’t know how well OP knows him or what their dynamic is, and I can understand why someone might choose not to get involved, so that’s why I didn’t go with E S H.", "This isn't your fault. They are acting this way because you're right and that is a very, very scary thing to confront at this stage in the proceedings. If she spent her bachelorette party crying over another man and wishing she could marry him instead then she absolutely should not be marrying her fiancé. If she admits that what happened is anything other than normal then she has to call off the wedding, and a lot of people are simply not brave enough to do that. It's even easier for the bridesmaids to sweep under the rug, as they would be caught up in the fallout of a cancelled wedding but they are not the ones who would be marrying the wrong person.\n\nBeing honest was the right thing to do, it's a shame she isn't ready to hear it. Some day she will wish she had listened to you.", "I would tell the groom if I were you.", "Haha… that’s total BS…So would you say the bride is right if she cheated on her fiancée on bachelorette party with some random one???\nPeople need to be more moral and truthful.", "You need better friends. Tough to hear this but truth hurts.", "well, now you know.. and again, I can’t stress it enough… tell the fiancée… I am sure if you were in his place you would want to know what happened.", "these are all excuses and stupid one at that.", "If you were the groom you would want to know. Do the right thing. If you don’t that what will be the difference between you and her other friends.?", "But the bridesmaids are meant to be her closest friends so should know most of this already.  It's not necessary to be a private conversation.  I would hope that there were others that felt the same as you because you are absolutely right. \n\nShe should not be getting married if she isn't over her ex.  She won't have her ex again as he's moved on with another woman and has a child.  But the guy she's marrying is second best at this point because she's still holding a candle for her ex.\n\nYou need to give serious consideration to telling him what is going on.  At the least an anonymous letter to tell him what's up.  Others heard what you said, but may have gone with the flow so you can deny it was you that sent it if you need to.", "My gf moved abroad. She still has her old number, but uses a prepaid plan so it only costs her a little bit each year.\n\nI moved to live with her at some point and also kept my old number in addition to getting a new one for the country I was living in.\n\nTo be fair, we both plan on moving back to our home country permanently at some point. If the ex has a family in his new country, chances might be smaller that he'd keep his old number.", "NAH (maybe E S H) - Sheesh. I’m glad I wasn’t in your shoes. I would have wanted to say the same thing. The only advice I can give (as a fellow truth teller) is that I find that it’s critical to pay attention to time, place, and delivery when telling someone the truth. You may not have gotten all of the backlash if you had chosen a different time and place as it wasn’t imperative that you said what you said right then and there. You definitely wouldn’t have been ganged up on if the other women weren’t around (so different place). Additionally, your friend was already upset and likely embarrassed upon finding out what she did when she was drunk. It may not have been the best time to say something right then. It could have been perceived as kicking her when she’s down. If you had said the same thing a few days later when you both were alone (and she wasn’t in a heightened emotional state) and explained that you are concerned that she hasn’t moved on (so delivery) she probably would have taken your words as you intended…to help.", "Nta.  Real friends speak the truth.", "NTA i can't be doing with all this immature shit. She should be totally over him before starting a new relationship, never mind getting married. It sounds like you grew up and they didn't.", "NTA. And how out of the wedding as it’s doomed to fail anyway.", "NTA. You gave her solid advice. She clearly doesn't like being told that she's being unfair. People like that are manipulative", "NTA\n\nI have to wonder if the reason that your \"friend\" is getting married, is so her ex will see that she's supposedly moved on and is happy with someone else. She's not getting closure anytime soon, if ever.\n\nThis whole situation is a disaster in progress. The question isn't if, it's when this woman is going to get divorced. \n\nDoesn't anyone care enough about the groom to give him a heads up? The poor guy is a just a patsy.", "NTA. At my ...gathering....we went to my MOHs apartment and had cake and juice and stuff. I've never thought getting completely drunk on purpose is fun.\n\nBuzzy, yes. Puking? Heck no. \n\nSorry you've got back-stabbin' friends.", ">I learned from one of the other bridesmaids that they spent the rest of the morning bashing me in addition to ex\n\n\nSnitch on her, cancel the wedding 🤸🏾🤸🏾🤸🏾🤸🏾🤸🏾\n\nNTA", "Man that's fucked up, I would definitely be the ah bc I would have told the groom and he can do what he wants with that info. Poor guy\nNta", "NTA:  Op, you’ve supplied about the only example I can think of where‘brutally honest” wasn’t used as a synonym for ‘an absolute jerk’.\n\nAs you’re in your 30s, this behaviour is rather odd; one should not be entering into marriage whilst clearly hankering after the one that got away.\n\nI’d be keeping this friend group at arm’s length for a while to avoid stirring, but equally I’d be tempted to ask the groom-to-be about his prenuptial arrangements, as the bride isn’t sending out the most reassuring of messages to say the least.", "NTA.  If your friend goes through with the wedding, do not expect it to last. I feel badly for the groom. Who wants to be 2nd choice?", "NTA please tell the groom if I were in his shoes I would wish for a kind soup to inform me you literally could prevent a life ruining mistake here", "NTA. Closure for old relationships is when you accept a marriage proposal. I see a divorce in your “friend’s” future.", "Info: what did she do to make her ex break up with her? \n\n(Not relevant for my judgment. You are NTA. I just want to know…)", "NTA, but you are saying in your comments your friend is all for the truth usually. But is she? Does her future husband know she is still in love with her ex and he is only second choice?", "NTA Weddings always have a friendship casualty. It brings out the worst in people. Your friendship with the bride may be this ones casualty unfortunately.", "NTA I’m sick of people who play the political cart when as a friend your job is to speak up when they act like she did! She thinks about her ex when she is supposed to married another man so yes you did right to tell her what you said!", "NTA. I would ask the fiance if he knows about the ex. This poor schmuck deserves to know.", "NTA.\n\nThat wasn't 'brutal honesty,' that was just the plain truth.\n\nI'd suggest that you extricate yourself from this friend group, personally.", "NTA You can’t argue with drunk’s.", "NTA. I’m pretty sure if the genders were swapped and it was the groom online stalking his ex and calling 10 plus times at the bachelor party that everyone would be telling you to tell the bride about it and how messed up it was", "INFO how did you say it?\n\n“Honey you need to delete his number because this is not good for you. You deserve happiness and this old relationship is bringing you down.”\n\nOr\n\n“It’s so ridiculous that you keep calling him. He is in a new relationship and you are coming off as a stalker. You broke up with him remember? Have some respect for your fiancé too.”", "NTA\n\nIn all the Bachelorette parties I've been to, ex's were not even topics of discussion, let alone insta-stalked or called. She's mad because you are right.", "She totally should have been over her ex before she said yes to another man. Thos is not acceptable behavior by a grown ass woman.\n\nI do understand, however, that her joy of getting married, along with a mix of copius amounts of alcohol, can bring out feelings of guilt in past relationships since they didnt end the same. This could have been one of those moments and she did not know how to express the differenceof feeling guilty with actual regret.\n\nWith that said, whatever it is that she did to end her former relationship, there was a reason it happened. She was not happy with something and sabotaged her own relationship on some level. This, my friends, is why we do not recycle men. That is like recycling a water bottle into a plant pot. Yeah, it still has a purpose, it can even be dressed up to look pretty sitting in your kitchen, but would you still drink water out of it? Ick. \n\nNAH.", "NTA. I would tell her fiancé. I would want to know if my husband was pining for his ex before I I was legally bound to them.", "NTA", "NTA. You’re supposed to get closure before even starting another relationship. Sorry to say but I guarantee your friend’s marriage won’t last.", "NTA but YWBTA if you don’t inform the fiancé before the wedding. This isn’t fair to him at all.", "NTA. I feel sorry for the fiancé.", "NTA, you told her how it is and to get that shit put in the past", "NTA and you should drop out of the wedding. Your friends don’t respect you or care about you if they spend their free time bashing you. You were trying to help and give her a reality check. Your friends future husband also doesn’t deserve this, Your friend doesn’t sound like she is ready to get married.", "NTA your friend is though...", "NTA. I’m tired of assuming that because someone is The Bride ™ she must be catered to and treated as if she’s on a pedestal made of eggshells. The hard truth is that she’s not over her ex and did not appreciate being called out so they ganged up on you.  The bride and bridesmaids are huge AH, specially for going along with “calling your ex TEN TIMES” a few weeks before getting married, are huge assholes to the groom to be. Poor guy honestly.\nEdit: a word", "NTA\n\n>I was told part of a bachelorette party is getting closure with old relationships and my judgmental attitude ruined it for the bride to be.\n\nThat's rubbish, they can be whatever but the purpose of a Bachelorette is not to go over Ex's, get drunk, call them and then blame friends for their own actions.\n\n>I told her she needed to delete his number from her phone and move on because it wasn’t fair to the guy she is marrying if she continues to be hung up on her ex.\n\nThis is true - why does she even keep his number if there's no intention to be in touch with him again? Her only reason for presumably having his number was when they were together - are they still? No. Do they work together or anything? Presumably not. She just doesn't want to cut off an option she imagines she has.\n\n>I talked to my sister about it and she said while my friend was being ridiculous that it’s my job to put aside my feelings for the bride as MOH\n\nGarbage - if you really are a friend, friends listen to friends and look out for each other, which is what you did. She just didn't like to hear the truth.\n\n>We are all in our 30’s though and this seems very odd to me.\n\nIt is, she's immature.", "YTA. People who call themselves \"brutally honest\" generally are more interested in being brutal than being honest.\n\nYou're not wrong in that she should delete his number and stop following him on social media. But you made it about him, how it's not \"fair\" to him. When this should have been about her, how it's not healthy for her.", "She spent all night calling someone with a new baby. \n\nI mean… that’s basically so far into AH territory as to be a capital crime in my book.  \n\nThe fact that she’s engaged and he’s married is just icing on the asshole cake.", "Gets my upvote, and I was under the same impression you were. You get closure before walking into a commitment lik an engagement...\n\nThe bride hss some crazy ass JOKE book. OP NTA", "Agreed…Also to add to the top comment I would drop out the wedding if they are bashing me behind my back over this.", "I only thought of mine because two of them happened to be in the same place. I just rubbed my bride to be t shirt in their faces, not literally that would be too much", "$$$$ maybe", "Isn't it weird how mean girls say that crap,, put it on their Facebook profiles, then call *you* names for daring to tell her to get with reality? 😭", "Snitch on her, get the wedding cancelled 🤸🏾🤸🏾", "Right?  The only time I have thought of my ex is when I hear about them from others. That’s usually followed by being glad that our breakup lead to us both funding great partners and having the best lives we could have.", "The good news is that that’s probably not his number anymore since OP said in the replies that he’s moved countries and most likely got a local number 😂", "Hopefully after OP tells him about what happened.", "I’ve attended both bachelor and bachelorette parties. They vary widely depending on the bride and groom, and while the stereotypical strippers party does happen, I’m not sure they’re as common as tv makes them out to be, or maybe the people I know just aren’t into that style of bachelor parties.", "If the “bride is always right,” then how did we end up with the term, “Bridezilla”?!", "It's ok to step away from toxic friendships. \n\nDon't make the mistake of thinking that just because you've known someone for a very long time, that it makes them a true friend.", "Definitely an option, but a move like that would fully wreck the friendship. Not that this friend seems like such a prize, and if they trash-talked me for mild honesty (I don’t really think it was all that brutal?) then I’d probably be ready to burn it to the ground anyway.", "Of course, they are people you once were very close with. You have all this information about them and their little quirks in your brain and they aren't deleted when you break up.\n\nI have an ex who liked to smell the paper packet his teabag came in before actually drinking his tea. Cute little thing he did. Now every time I come across some fragrant tea I am reminded of that person I knew who did this thing.", "Having an Ex's phone number isn't necessarily weird if they are otherwise still in your life, but yeah, if you aren't friends, coparenting, etc. why are you calling your ex?", "Yeah. The poor groom deserves to know but inserting yourself into another couple's relationship is often a majorly unwise thing to do. Even if they're screaming at each other, there's every chance they will momentarily unite to turn on the person trying to help. \n\nThe groom may already know how obsessed his bride is - some people are prepared to marry such people despite this because they too are obsessed with their future wife/husband. Love can make you do stupid things......\n\nI saw an incredibly sad programme many years ago. They had an interview with an obsessive Jim Reeves fan who was married. Her husband was sitting in on the interview. As far as I remember she said (in front of him) that she would never have married him if Jim Reeves were still alive, her only son was named 'Jim' and she had dedicated an entire room in their small terraced house to her Jim Reeves collection and it was covered in pictures of the singer. I remember feeling horribly embarrassed on behalf of her husband but he obviously knew all about it but ***still*** wanted to remain married to her.", "If they preserved the original meaning of \"the customer is always right in matters of taste\" (i.e. sell them the shirt even if you think it looks bad on them), then sure.  I'm not going to criticize a bride for picking a color I don't like for her flowers or an unflattering cut of her dress.  But the idea that everything the bride says goes, no matter how much it costs, how much time it requires or how much it hurts other people is toxic.  Luckily, OP is unlikely to be part of the wedding party for the friend's second marriage.  NTA", "And even this, correct meaning of this saying has limits in the real world. It’s more what you’d call a guideline than an actual rule…", "Yeah. My friend did that when he planned on moving home too!", "NTA.\n\nThough, you would be the asshole if you don't now go tell the groom. He doesn't deserve this.", "NTA and I would be backing out as MOH after the bride was bashing you she isn’t your friend.", "NTA. If she is hung up on a ex who has moved on and started a family, she should not be getting married yet. It’s not fair to her fiancé.", "I N F O:\n\nWhat drugs was she smoking to think that a Bachelorette **party** I'd a freaking wake for the old relationship?\n\n/s\n\nNTA\nGood gods and goddesses or whatever you believe in.. she needs a wedding gift to a chiropractor to solve her cranial-rectal insertion problem.\n\nDon't even take that OP. They want to bash you? They're not friends.", "NTA - I would hope most people getting married find closure LONG before they get engaged to someone else.", "NTA \n\n*is* that what bachelorette parties are for? Idk. \n\nBut if it was, then bride should be telling everyone the whole story and figuring out “closure” from there. (Though how could she get closure if it’s her fault they broke up, it’s been 5 years, and he’s moved on). \n\nThe bridal party shouldn’t have bashed you for telling the truth. It wasn’t harsh at all - i mean think about the poor guy she’s marrying.\n\nAnd why was it up to YOU to stop her from calling ex, when all of them were in the bathroom with her???", "NTA, I find some people don't like hearing hard truths. Sounds like your friend wants to be coddled and enabled to behave this way. You're right, it's not fair to her soon to be husband. I wouldn't want to marry someone who is calling their ex the first chance they get. You're a good friend. They won't see it that way, but love is sharing those difficult truths with support. Enablement is allowing those truths to go without whisper allowing harmful behaviour to continue.", "Nta. That closure should've happened 5 years ago. Her ex and his wife don't deserve her drunk drama and her fiance sure AF does not deserve a woman who is still getting drunk and calling her ex. Whatever regrets she has, she needs therapy at this point.", "NTA i’d be PISSED if i found out my husband was calling his ex with a brand new baby and life on the night of his bachelor party. i’d probably call off the whole relationship tbh\n\nedit: typo", "NTA. You shouldn’t be in a relationship if you’re still hung up on the ex. This marriage that hasn’t even happened is already over. Shits hard enough when you have two people in love and committed. \n\nI do wonder which friend was jealous you were the MOH and got into the brides head to get you removed.", "Wow. This is the first time I've ever seen an \"AITA for being brutally honest\" where the answer was NTA. Well done for keeping it interesting!\n\n(And you were right -- she should not be marrying if she hasn't achieved closure with her ex.)", "NTA--I would be devastated if my partner drunk dialed their ex 10 times right before our wedding. How would the bride or any of the other bridesmaids feel if their fiance did that? Geez...", "Girl get new friends!! She did that all on her own but need someone to blame.. the other friends don’t want to call her out and instead are throwing you under the bus. I would just let her know you won’t be her MOH anymore and leave it at that. If she gives you grief let her know you’ll let the people know what she did and block her.", "NTA - They sound like a terrible friend group that encourage bad, destructive behaviour.\n\nThe least your friend could do is not get into a relationship if she is going to be like this.", "Nta, and you are completely right. They're wrong lmao. Also this can come across as harassment in her end. And I'm sure she wouldn't want that.", "NTA - a bachelorette party should be a celebration of a new stage in someone’s life. I’ve not been to many, but I’ve never heard talk about ex’s at them (excepting if they’re still a significant figure in the bride to be’s life, co-parent etc). \n\nEverything here screams that she’s not ready to be getting married, and her other friends are horrendous enablers for making you the villain when someone really needs to sit this woman down and make her work out what she really wants. Cancelling a wedding might cost her money, but going ahead with a marriage she isn’t really happy with will cost money and waste years of life that could be spent somewhere, or with someone, else. \n\nYou sound like the only genuine friend she has for trying to make her see it, but she seems like someone who has to learn everything the hard way. I’d ditch this friend group and their cattiness.", "NTA but probably should have chosen a different time to approach it with grace. It needed to be said but maybe in a more productive way. Asking her if she’s certain that she’s making the right decision by marrying this many when she is clearly not over the ex is perfectly legitimate. She needs some therapy. Drunk calling at her age is immature and could have created a mess for the ex. \n\nRight call / poor timing.", "Definitely NTA, it's not a good sign if someone keeps thinking about his exes that way while he's in a new relationsheep, especially if he's going to get married.", "NTA\n\nYou must tell the groom.\n\n When this marriage explodes he will be the one who loses half his stuff and a woman he thought loved him.", "NTA. You didn’t do anything wrong OP. I feel bad for the groom. I can’t imagine. She’s getting married, she should be hopelessly and madly in love with him and looking forward to marrying the man she loves. Instead she’s still all hung up on her ex. \n\nI almost want to tell you that you should tell the groom about this, I think he deserves to know who he is marrying. If it were me my conscience would bug me about it and I don’t know if I would be able to not tell him. \n\nBut I know the hornets nest that would be kicking...", "She has baggage and your friends are enabling her shitty behaviour. You’re not an asshole", "NTA I don't even think your honesty was that brutal. It's been 5 years, she's engaged, and she's still hung up on her ex. I feel bad for her fiance.", "NTA. OP, I really want you to reevaluate your friendship with the bride and this group of friends. You may have matured out that circle and that's okay. Everyone else's reaction (including your sisters to an extent) is ludicrous. If MOH duties include going against logical reason, again, you have some reevaluation to do.", "NTA. I think you were being a friend who was doling out sober, adult insight. Hopefully it’s different, but your friend sounds like she is going to have some issues in her new marriage.  And no, bachelorette parties aren’t for closures on past relationships. It’s where you have a fun night and celebrate.", "NTA. Your friend shouldn't be getting married.", "Idk n a h or e s h\n\nI’ve heard it’s normal to have our mind go through old traumas/things when a major milestone/anniversary etc. happen.\n\nEven if she had closure years ago, the ‘cold feet’ theory (see above logic) would imply she would rehash these things from her past. And allowing her to do so without judgement would mean this process passes.\n\nWhereas if you judge her, you’re effectively planting a seed that she’s not over her ex - this is beyond a normal level of reflection (powered by booze). You saying that, makes it feel and become a bigger thing than she and the bridal party intended.\n\nThat’s my take here. I get you meant well, hence my judgment - but imho you were wrong to presume your take on things was the bride’s true feelings (who are you to say what she feels?) and impose it on her in a way…", "NTA. She needs to move on at five years. If she cannot. Then she shouldn't be getting Married. What happens when the new guy finds her drunk. Crying about the EX. Getting drunk at the party is not getting over the Ex.", "Nta. This marriage isn't going to last long. Two years before she cheats because she's still obsessed with her ex who seems to have moved on, and who seems quite happy from your description.", "NTA. It is insane and a bit disheartening to hear that women are expected to lie to each other and those around them just for the sake of an unhinged mess that I’m assuming cheated to ruin the relationship with her ex. Instead of all you rallying around your “friend”, you should be informing the poor guy she is marrying that he should be running 🤦‍♂️ At least that would be the decent thing to do 🤷‍♂️", "NTA your friend needs to make up her mind. Sounds like her ex has moved on. She’s trying to get married while still daydreaming about her ex.", "NTA if I was the fiance I would feel betrayed and I would postpone the wedding. I hope you drop out of the wedding and I hope you tell him why. She needs to move TF on", "You're NTA, you just wanted her to move on and be happy with the guy she's with now. It's unfair marrying her fiance while she's still in love with the man she broke up 5 years ago. She may not love her future husband that much...\n\nYou weren't harsh at all so don't worry. You were honest and was trying to help.\n\nTake care of yourself and have a nice day, Anon!", "NTA and your friend needs to GET A GRIP. To be honest, I would step down as MoH if I knew the bride talked major shit about me like that. Her behavior is trashy and immature", ">they split up 5 years ago.\n\n>I was told part of a bachelorette party is getting closure with old relationships\n\nNo it's not. Not even a little bit. A bachelorette party is all about celebrating this new chapter with your soulmate, and partying like a single lady one last time. If you're spending it crying over and drunk dialing an ex of five years ago, you probably shouldn't be getting married since you're still in love with your ex.\n\nNTA. I feel so sorry for the groom. He deserves someone that spends the bachelorette party swooning over being his wife, not someone obsessing over an ex of 5 years.", "NTA\n\nYou sound like a good friend. You did nothing wrong.\n\nThe fact this chick still had her ex's number 5 years later is absurd to me. I delete my ex's number the day we break up or block (unless I have some of his things, then we exchange belongings THEN I DELETE/ BLOCK!)", "As her friend, I would coach her to get some help to talk through those feelings so that she can go into her new marriage feeling great (if that's a move that makes sense)", "Nta at all", "NTA and advise the Groom to not join their finances and not enter into any huge debt together. This is gonna end in divorce soon", "NTA and if that’s really how they wanna act I’d tell the husband to be because she’s was 100% willing to drop him to get back with her EX even if he disagreed to it.", "Your drunk-azzed friend asked you to leave her party.  Your drunk-azzed friend was the reason her ex-bf is an ex... I wouldn't want this person (or these other people from the party)  in my life and I wouldn't go to her wedding.  You can text her later when you hear of the inevitible divorce.", "Has anyone ever heard of a psychotherapist? Getting closure through drunk stalking what can go wrong? NTA", "Friends these days only can say, yes you're right , otherwise you're not supportive ..oh ppl", "NTA. Your friend is getting married. The ex is already married with a kid. There is absolutely no reason on this earth that she still needs his number. The truth hurts. But blowing smoke up her ass is not the right thing to do. You were right OP.", "NTA the bride is either immature or lying to herself about her feelings for her fiancé. She needs a therapist, not bridesmaids blowing smoke up her ass. Her problems are above your pay grade. I’d probably bow out of this wedding to be honest", "NTA if you're crying over your ex at your bachelorette party then you shouldn't be marrying the guy you said yes to.", "NTA and that was not even “brutal” honesty it was just honesty. I’m no expert but I’ve been in a few weddings and never once have I seen the bride do this. \nRegardless of any scenario, 5 years + a wife + a kid = she needs to give it up. You were right what you said, she needed to hear it, and if she blames YOU for *her* not getting closure after being stuck for 5 years, she has a lot of growing up to do.", "NTA. Someone pls send the link to the groom 🤦🏻‍♀️", "NTA. Sounds like your down one dramatic, emotionally immature, semi-alcoholic friend. Enjoy the newfound space in your life to oursue healthier relationships.", "NTA\n\nGroom: my bride spent her bachelorette party drunk and sobbing over missing her ex from 5 years ago. I know she called him repeatedly and none of the calls were long but nobody will tell me anything.\n\nHow would people react to that?", "To be brutally honest. Your friend shouldn’t be getting married at all, if she still has feelings for her ex after 5 years.\n\nNTA", "It might be my 'touch of the tism' but I would've done the same thing and told fiance what she was doing. It's not fair to him that she's so hung up on her ex. Everyone deserves to marry a person that loves them and not to be treated like a second choice. NTA", "NTA. I definitely wasn’t thinking about any ex bfs I had in the past at my bachelorette party. It was all about the upcoming wedding and celebrating how happy we all were for me. Nothing sad or negative was talked about at the party. If she feels this way about her ex, she clearly isn’t over him and should consider not getting married. When she meets the right person one day, she won’t think about being with an ex at all or crazily calling them when drunk.", "NTA. You need better friends.", "Now you know how seriously you need better friends.\n\nEnabling and supporting teen behavior is the opposite of what adult friends should do. If the bride wants to be surrounded by validating suck ups, especially after she was the one at fault, good riddance.\n\nNTA. You did the right thing.", "NTA your friend is weirdly obsessed with her ex and if everyone wants to act like that’s normal, then cool I guess? But you’re not an AH for not wanting to take part in it, or for saying something. And frankly I’m tired of this narrative that everyone has to tiptoe around the bride to be for ANY reason. If you’re adult enough to get married then act like it ffs.", "Nobody completely ready to get married calls their ex 10+ times and cries over them at a bachelorette. NTA.", "This is not about what you did but how the truth made her feel. \n\nShe needs therapy. She never properly processed her feelings about losing her ex. Since you said it was her fault for the break up, there is regret involved. \n\nNTA\n\nYour friends need to grow up. You were supporting the bride, so she wouldn’t embarrass herself any further.", "NTA. You're the only good friend she has, poor thing. She shouldn't be getting married, and I really doubt she'll stay married.", "This might be the clearest NTA I've ever seen.", "NTA", "You need new friends. Really. They are all toxic and problematic. Poor guy that is going to marry that.. Poor guy. NTA.", "I feel sorry for the guy she’s marrying.  He obviously cares for her. And it seems like he’s not in a relationship where she cares back.  I am very glad I’m not invited to this wedding.  It would be hard to sit through.", "NTA, and i have one more thing to tell.\n\nTell the guy about this, don't let he waste his time with this woman.", "NTA. If I found out my fiancé did that we would not be getting married a week later. You’re the only one being an adult. They’re just enabling her and I find it concerning that a whole group of people think that clearly being in love with an ex is okay before you get married", "NTA - But you need to tell the groom ASAP. He doesn't deserve to enter a marriage under false pretences.", "NTA. Drunk dialling your ex all night is not part of preparing to marry lol.  She should have achieved closure of the last relationship before getting serious with the next one.  You gave her great advice - everything you said was in her best interest.", "NTA. And for everyone's sake, I would actually write to her and tell her that you are worried about her. Her behavior, as a 30-something, was NOT healthy and indicates she should not be marrying. But she probably will and you may need to quietly leave that circle of friends.", "Nope, she’s ridiculous! You did the right thing telling her to delete his number. She’s in a relationship and so is her ex. It’s very inappropriate. She may not have liked hearing it, but it needed to be said. You did her a favor.", "I applaud you for doing the right thing and trying to provide a dose of reality to your friend. The reality of the situation is simple, if her soon to be husband found out that she was calling her ex and having emotional reactions while reminiscing about him, he would probably want to hold off on marry her. Her cantankerous behavior is unacceptable and should be called out every time, saying that she wished she would have married some else the night before her wedding is incredibly toxic.", "I really hate friend groups like that, who would rather lie to each other and stay in denial than just grow and move forward. I don’t understand why people do that crap. NTA", "NTA. \nYou gave honest advice she needed to hear.", "NTA and your \"friend\" will be looking for a divorce attorney before too long. Or her future husband.", "INFO\n\nWhy are you friends with such a toxic person?", "NTA...you gave the advice she needed...end of story", "Closure with old relationships isn't what its for. They full of shit..nta", "Can you anonymously let the groom know? \n\nNTA", "NTA.\n\nSooo, bride still pining for her ex- on the eve of her wedding to another?  You did the right thing.  MOH is charged with protecting the bride, but part of that may be helping bride get her head outta her arse to see reality - and logic.", "NTA - that poor groom is about to make the biggest mistake of his life.", "NTA, but you need to have a heart-to-heart talk with your friend.  You need to listen to what she has to say about you and your relationship.  Then you need to explain how you know why her ex is the ex, why you told her she needs to move on and ask her why she felt it was important for her and her bridesmaids to bash you.  Listen very carefully to what she says and make your choice.  If she has decided you aren't a good friend, time to say goodbye and let someone else take the MOH and friendship duty.  This sounds like a possible friendship-ending issue to me.", "Women ☕", "NTA", "NTA. You spoke the truth. She shouldn't get married if she is still hung up on her ex. The least she could do is erase his number", "How is your friend in her 30s and this immature. You're chillin fam NTA", "NTA. Definitely NTA. She shouldn’t be marrying her fiancé  if she’s not over her ex, and no,  bachelorette parties are not for closure.  Why would her fixation disappear after one night of getting drunk and obsessing over him? Did she get up the next morning and forget him? I bet she didn’t.  You’re right, this situation is weird. Your suggestion wasn’t insensitive, it was sensible.", "NTA. If my wife had done this we wouldn't have gotten married. Full stop.", "YTA. Your best friend is having a crisis and the way you frame the problem is accusatory and judgemental. You focused on the impact to someone else - \"you are being unfair to your fiance.\" \n\nI don't think the feelings you feel when you are very drunk and reflecting on your life are especially meaningful, but if she DOES have an unhealthy obsession with her ex, that's a problem for her and her future happiness. You should have focused on that.", "Also, what the bride got there was the opposite of closure.", "Ideally closure from old relationships should happen before getting into a serious relationship. I’m getting married in 2 months, I can’t even imagine crying over an ex while drunk. And I’m quite an emotional drunk. \n\nNTA OP, also you seem like a mature well rounded person unlike your friend group, which is pretty surprising as you’ll are all over 30", "Right? My bachelorette party was about drinking wine and painting with my soon-to-be family. It was way more fun than whatever this girl's party was. NTA", "I wish I could upvote this a hundred times! What a stupid thing to say!", "lol right????  That’s the most ridiculous thing I’ve ever heard - BP is for closure with exes???  \n\nNTA - women do each other a disservice by worrying about each other’s feelings about the truth instead of helping each other face the truth.", "Came only to say this, but you’d already done it.\n\nOP is NTA", "Tbh, that seems like an excuse and the other friends are enablers. If bride is going into marriage still hung up on her ex, how long will her marriage last before the groom feels like \"second best\" he kinda is now and leaves?", "Not to mention she was blowing up the phone of someone with a new baby in the middle of the night.", "Either money or to make her feel better about her ex being remarried with a child/make him jealous? I knew a girl from my high school who did this.. she wasn’t over her ex who had recently gotten married so she started dating one of the ex’s basketball friends and nearly immediately got engaged.. and then the night before the wedding she drunkenly admitted to her entire bridal party (including the groomsmen) that it was all to make her ex jealous and to hopefully get him back. Needless to say her ex was super weirded out when word got back to him that that was the reason for getting engaged so quickly to his friend.\n\nI always thought it was a bizarre thing to do.. like are you going to divorce the new guy if your plan works? Super expensive and stressful way to get your guy back..\n\nAlso.. NTA", "You misread it. OP said it wasn't fair to \"him\", as in her future husband him, not her ex him. And I'm sorry, but she was right. The bride acting like \"I should have married my ex\" on her *bachelorette* is so extremely unfair to the groom that she indeed needs to stop moping about herself and think about him.", "I mean, no matter if OP referred to \"him\" as being the fiancé or the ex, OP is objectively right. It's not fair to either of them for the bride to be hung up; one is married and the other is on his way to being married. Neither of them deserve the bride's emotional instability.\n\nBride needed to be confronted with how she's acting. Bride kicking OP out early is indicative of her not wanting to accept responsibility for her own actions.\n\nOP is NTA, this wasn't \"brutal\" honestly in a dickish way, this was just honesty.", "People who say how important honesty is mean...I am going to say whatever I want and you have to deal with it. \n\nPeople who truly value honesty don't need to tell you. They are just honest.", "You should read the story about the bride that made a talent show in her wedding ..", "Your friend clearly want to have her cake and eat it too.  Your not the asshole here.  That relationship was five years ago!  Why is she even marrying someone else? I feel so bad for you, and that guy.  Does not sound like a good friend or a good person.", "If honesty is important you should be honest with the groom and tell her she tried to call her ex 10 times on her hen night.", "Exactly. I tried to remember what we spoke about during my hen do and I think we mostly caught up? Like, it was my closest friends since childhood, my sisters and me. We certainly spoke about the groom and they had made some trivia game about him with help from his sister  (like \"what was his hamster's name\" to which I said \"no idea, I'm not sure he remembers, but I know what his dog's name was?\" and yes, SIL was invited but not able to attend.)\nBut mostly, I've not seen all these people in the same room for years at this point, we're all just talking about the upcoming wedding, their news, looking at pics of the babies that had been born (two babies even joined us parts of the day as their mum's were still nursing). \n\nEx who? The only one I wished was there who wasn't, and remembered, was a dear friend who died a few months before my wedding.", "At my bachelorette we talked about all the \"toads\" we kissed before we met our \"princes\" because I'm the last one to get married lol. But I certainly wasn't pining for any of them!", "Despite the film industry’s attempts to say otherwise, bachelor/bachelorette parties are mainly just friends getting drunk/having fun together before the wedding. \n\nStrippers/wild shit is not the norm. \n\nI’ve been to several bachelor parties, and even a few bachelorette parties, and they’ve all literally just been parties.", "My bachelorette was going to a local wing night with some girlfriends and then playing cards against humanity.\n\nThey did give me a bag of adult gifts and a gift certificate to an adult store though lol\n\nMy husband went wakeboarding and paintballing then to a bar with his friends.", "Depends on the person. One we had a party bus and we had dinner and bar hopped. \n\nAnother it was an entire weekend, we rented a house at a beach town, day drank, played video games, went to a vineyard, walked to the beach, bonfire, went to the local dive. It was a nice time.", "They aren’t that deep. I’ve gone to bachelorettes that were at spas, bachelorettes in wine country, bachelorettes in a cabin in the woods. My friend is currently planning a whale watching trip for her bachelorette. I’ve also been to bachelorettes where we get white girl wasted and dance until closing. It just depends what you consider fun. \n\nZero parties have involved calling an ex, talking about the one that got away, or banging strangers for one last romp. No doubt it happens, but it’s not the norm in my world.", "[removed]", "_\"I told her she needed to delete his number from her phone and move on because it wasn’t fair to the guy she is marrying if she continues to be hung up on her ex.\"_\n\nYou were also far from **brutally** honest. You were honest, but constructive and also still polite/kind. Being brutally honest would have been telling her she was acting like a sloppy embarrasing mess, she needs to stop harassing her ex, and she needs to stop pining after a happily married man who doesn't want her while she herself is getting ready to get married. \n\nThis woman is also no friend if the instant you left she started shit talking you to her social circle.... These woman all sound like immature mean girls and will probably also gossip about the bride the minute they leave this trip.", "INFO: What is their logic that says you personally should have stopped her from making those 10 calls?  How is that your fault, and only your fault?\n\nYou're NTA, but I'm really confused on what could be their logic.", "Please tell me the groom broke it off? Also I think OPs friend is mainly getting married because she’s over 30 and most of her group must be engaged/married. I’ve seen it happen a lot", "If you don’t plan to be friend with this gaggle of assholes anymore, tell her fiancé.", "Honestly, if the bride was already gossiping about you after you left this trip and the friendship is all but ended, I'd save myself the headache and back out of being in the wedding.", "So you are going to blow up the fiancé’s life down the road? Being obsessed with an ex from 5 years ago is not just a drunken night of bad judgment, it’s something she’s been holding onto for 5 YEARS but let slip out 🤦‍♂️", "NTA. But don’t get involved further. It’s not your job to go to the groom. Who knows maybe she just needed the final straw to realize she was being crazy but now is embarrassed.", "This. \n\nThe only thing I think OP did wrong was not telling the future husband that the woman he is about to marry was crying over an ex and spam calling him all night during her bachelorette party.", "Yeah makes more sense to treat it as your last big night free (night to yourself) rather than the whole \"last night still SINGLE.\" I never got when people talked about it that way.", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You can keep your cell number if you move to another country. I looked it up and found one link after the next that said you can do so. \n\nSo, this bride's ex, who apparently has moved on with his life, received those drunk-dial calls if he kept his number. \n\nPoor groom, if he only knew.", "Could it be they've confused the maid of honor with a fairy godmother?", "I'd definitely say \"f*ck it, you know what, your \"future husband\" deserves to know too. I'm done with this friendship too, Sayonara.\" Not interested in having a friendship where they backbite. I've had a bit of issue with a close friend due to a previous relationship (they played a part in setting us up, and was upset with me breaking up due to whatever occurred...) But they told me their issue and I replied back with my own opinion. There was a bit of argument but that was it. Nothing more than a few jabs and it died down without any backbiting, and I knew there wouldn't be considering their personality.", "[removed]", "Sure I still have the number of the plumber who installed a radiator in our back bedroom seven years ago in my phone. Apparently I'm bad at deleting numbers. (though I have never drunk dialled the plumber!)", "Not even close. That’s not OPs responsibility whatsoever. \n\n1. She was wasted. People do weird shit while wasted, and it doesn’t always mean it’s something they think about normally. “In vino veritas” is a fun saying but it’s not based on any kind of reality. Sometimes wasted people have lowered inhibitions and say some truth that they normally wouldn’t, sometimes wasted people are just wasted and fixated on something and it doesn’t help when you are being validated and egged on by a group of people. \n\n2. Never insert yourself in a friends relationship unless it is something so serious you are willing to lose that friendship and others over it, because that’s likely what will happen. Sure, if the bride hooked up with some random tell the future husband. But this? Doesn’t pass the bar imo.", "Absolutely agree. Many moons ago I worked as a hairdresser. I considered it part of my job to advise clients on what suits them and what doesn't and why etc etc. The final decision is theirs though, no matter how hideous or gorgeous I think it is, and in that sense they *are* always right.", "I only ever went to one bachelorette party. 4 people, bride included, we did a High Tea and a silly romcom movie. And one of the girls couldn't make it to the movie so that was just me, the bride and the bride's sister.\n\nI think a good bachelor(ette) party is that what the bride/groom like to do. If they want a party with loud music and alcohol flowing, do that. If they like a more intimate day with their friends doing some fun activity like an High Tea or laser tag or whatever, than make that the plan. I highly doubt that even in the US strippers are a staple.\n\nWait, I lied, I did go to one more bachelorette. That was lunch and a leather bracelet making workshop. Whoo, pardy hardy stuff yo.", "Bad Bot! comment stolen from VersionNo3770.", "For my brother's. I got all his pals together. Bought an unholy amount of alcohol, set up a BBQ and went to a paintball arena. \n\nHe told me after it was the best party he ever had. \n\nDepends on the guy.", "I wouldnt use sitcoms to judge reality...ive been to plenty and only 2 involved strippers....not private but at a club...and it was a single stop out of many. The best ones was a guys weekend charter fishing and staying in a cabin...and another at a paintball field where we got permission to bbq some burgers and bring a cooler of beer", "So you wouldn’t wanna know if your fiancé was obsessed and harassing her ex of FIVE YEARS?? On a night that is supposed to be about your wedding", "Fyi \"high tea\" is not the fancy kind of tea. It's the family sitting around the table having a pretty substantial meal with tea. The term you're going for is Afternoon Tea. That's the ones with tiny sandwiches and fancy hats.", "we went whitewater rafting for my bachelorette, it was awesome, great planning by my sister/MOH!", "[removed]", "This isn't even \"brutal honesty.\" Usually people who say they are \"brutally honest\" are really just assholes. You're just being a good friend. If I was about to get married and behaving like your friend I would hope my friends would care about me enough to tell me to get my shit together.", "NTA.  In vino veritas.  This woman is not ready to be married.", "NTA maybe do the groom a favour and give him a heads up that his bride to be wants her ex back", "NTA.  Perhaps the bride should have gotten over the ex before you accepted a marriage proposal from another guy.", "You're NTA.  I'm kinda hearing that you blurted out a truth that she knows, probably not even too deep down.  Was anyone else even partially coherent?  Talk to them one-on-one.... if you even want to keep being friends with this girl (who seems super great, btw. /s)  Because, unless you want to take this further and talk to her fiancée, you said your piece and she may even demand an apology from you, directly or through social pressure to get back into the group.", "NTA\n\nHonestly, I'd tell the groom that his soon-to-be-wife spent her bachelorette party crying over her ex, calling him repeatedly and combing over his photos while telling everyone she wanted to marry him instead.\n\nThis would, of course, burn down the friendship. But man, poor groom.", "Tbh, I dont think deleting his number is going to fix anything. I mean.. shes still hung up on him after five years of presumably not seeing him. She needs to not get married bc that's not something that just goes away because you deleted a number. \n\nGetting married to someone you dont love is unfair, no matter the consessions (is that the right word?) You take to avoid the person you acctually love.", "NTA\nIf you are using your bachelorette party to get over your ex you are doing relationships wrong. Sounds like this is going to be an interesting wedding and an even more interesting \"marriage\".", "NTA - Your \"friends\" are monumentally shitty people.  You need to tell the groom before he gets trapped in this fucked up situation.", "NTA- I’d back out as MOH and drop that ‘friend’", "NTA. \n\nBachelorette parties are about celebrating someone getting married and not being single any more. It has nothing to do with closure and those who think so aren't understanding what closure is, or why you need to do it BEFORE you get into a committed exclusive relationship.\n\nThese are your feelings, but you were being an actual friend to share them with her. True friendship is being there for someone and being honest about situations. She does need to remove his contact info from his phone and she also needs to have a hard convo with her soon to be husband about this and discuss whether or not she's actually ready for marriage. \n\nSometimes it sucks to be a true friend, and that's why they are so rare that people can't recognize them when they see them.", "I'm on Team Tell the Groom. Also NTA.", "If I was the spouse-to-be, I'd want to know if the person I'm about to marry had been so hung up on an ex that they were drunk dialing like that. I'd want to know before I get married. I feel bad for the groom. He deserves to have all the information before he marries her.\n\nNTA", "NTA tell that man to leave", "NTA. If she's still hung up on someone else she shouldn't be getting married. That's beyond unfair to her groom.", "NTA.  If she still that hung up on an ex, especially since she getting married and he already has and has a baby, she is not ready to get married.  I can see future arguments between her and husband, with her saying things like I wish I had married so and so…, if I’d married so and so, things wouldn’t be different, he would do this or that different, always throwing him into it.  Maybe she shouldn’t have done whatever caused them to split up, you know hindsight.  He has moved on, she needs to, BEFORE she marries this poor guy.", "Agsin, I was ready to tell you how wrong you were, but you are NOT the AH\n You were the adult and please don't stop", "You should tell that fiance", "NTA - their behavior was toxic and childish. If you were kicked out, I would question the friendship and any continuing part of the wedding.", "NTA, there should be no closure needed by the time you're having a bachelorette party, she shouldn't be getting married.", "nta. i came in here with the assumption that \"being brutally honest\" was code for \"being an asshole,\" but you didn't really say anything out of pocket. you probably could have phrased it better, but what you said was ultimately pretty reasonable.", "NTA, tell the groom before it's too late!", "NTA.", "NTA. She clearly isn't ready to marry and her behavior is a bit immature for someone in her 30s. You weren't even brutally honest if what you described is what you said. Also a MOH's role is to look out for the bride and guide her in married life where I come from and this is what you did.", "NTA what I think you should do next might make you one but I feel someone should tell her fiance about it I know I would want to know if my future wife did this", "NTA this has big Gilmore Girl Rory and Dean vibes. I'm guessing it will end about as well as that did.", "NTA. A Bachelorette party isn't for getting closure on relationships from FIVE YEARS AGO. Or any for that matter. \n\nHonestly, if this was me and she was acting like this, I would tell the groom. That may seem harsh or AH like, but I would want to save him from any heartbreak when he has not fault in this. Idk. Maybe that's just my opinion.", "NTA!!! Bride is delusional. She is clearly still in love with her ex. Respectfully it’s not your issue and since it’s not your problem don’t be the shoulder for her to cry on when her marriage goes south.", "NTA. You're in your 30s. Your best friend and her groupies are stuck in their 20s. If you can't tell your best friend she's doing herself harm, who can you tell? And swallowing down your feelings to serve the bride IS NOT a MOH duty, that's toxic of your sister to think that way. Back to your \"best friend\" - she and her groupies bashed you for the rest of her pity party - that's not even frenemie behaviour.", ">I was told part of a bachelorette party is getting closure with old relationships and my judgmental attitude ruined it for the bride to be.\n\nExcuse me what? \n\nI've been to a couple. Do you know how many times did the bride bring up an ex? Zero. If you're ex bashing on your bachelorette and drunk calling them, you're not emotionally ready to marry anyone. Poor groom. \n\nNTA", "You weren't \"brutal.\" You have good advice. This marriage is not going to work out if your friend is still pining over her ex. Yikes.", "NTA I thought this was going to end with brutal honesty. This is literally the bare minimum of being a decent friend and being a decent partner. Who keeps their ex’s # in their phone and has the potential to break down and call them while drunk? I feel like something else has to be said for the rest of the friend group to be against such a simple concept", "“The bachelorette is about closure on old relationships”? What nonsense is THAT? If you’re not over your old relationships, you shouldn’t be having a bachelorette - you owe your new partner more than that. \n\nNTA", "NTA... you dont get engaged to someone while you are still hung up on your x... let alone get married.", "Sounds like you should call her soon to be husband and let him know what’s up.  He’s a second choice, I wouldn’t wanna be anyones second choice", "NTA if my best friend bashed me with her other friends I wouldn’t take it. It sounds like your years of friendship matter more then how she treats you. Don’t be chained to a bad friend just because of the length of time you’ve known them. What you said might be harsh but it’s true. Is she would rather have yes men and not real friends then maybe you should think if you want to be one of those people", "NTA, that poor groom. Please tell her fiance to reconsider the marriage what kind of bride-to-be is still hung up on wanting to get back with her ex even after said ex moved on and had a baby with his new wife?", "NTA\n\nYou seem to be the only person thinking about how fucked up her fixation is.", "Ew. NTA- unfortunately you've become the scapegoat because these people do not want to be embarrassed by this weird toxic behavior. Hopefully this will blow over, but your relationships with this group may not be the same. \n\nI feel really bad for her future husband though- he is clearly a consolation prize. Honestly if I was ready to scrap these relationships I might tell him.", "NTA, I feel bad for the groom.", "NTA. You were the voice of reason. It is disrespectful to her future partner. If she doesn’t have closure or hasn’t moved on she’s sure as hell not ready for marriage. Someone needs to tell her the truth.", "NTA", "NTA   Seems like your friend is marrying into a divorce. Your advice was sound and she needed a kick in the ass.", "NTA. It should be clear to you now that this \"friend\" of yours has a proclivity for betraying people she is close to and then creating a false narrative in which those people were the ones at fault... Why are you friends with this person still, exactly?", "NTA. Please tell the Groom, I would want to know. I would much rather find out now than find her calling him drunk at our kids first birthday party", "She is not your friend to blame you for her ridiculous selfish behavior", "NTA they all know you were right and feel bad about their behavior so they're doubling down", "NTA.  Her poor husband to be.  Your advice was good advice.  It was advice she needed to hear and advice expected of a best friend.  That she told you to leave then presided over a bashing session would be the impetus for me (if i were you) to drop out of the wedding.", "Omg I thought everyone was like 21, you're in your 30's! NTA, hardcore.", "I am way too old to pretend to be friends with people who are actually waiting for an opportunity to talk about me behind my back. I would probably drop a quick text to the bride and let her know I will not be in the wedding, attending the wedding, and I wish her, her fiance, and her catty little friends good luck.", "NTA. You were giving sound advice. If she’s still so held up on her ex, I would be worried about her getting married. That just sounds like a buttload of problems waiting to happen", "NTA. The only way you could be at this point is if you informed the groom-to-be about these events as a means of holding her accountable and giving him the chance to confront her about deep-seated emotional attachments that she should not be holding on to. Even though he deserves the truth, it isn't yours to deliver to him, so don't be TA and tell him.", "NTA,\n\nI suppose when people come to crossroads in their lives they can think of the road not traveled, but I am pains to see what you did wrong.  You dont seem to be aware when she called and were trying to move the evening on.\n\nThere is nothing wrong with knowing ex's many people still do and are friendly with them, but it is obvious that these woman's feelings are much stronger and you are totally correct it is not fair to the man she is going to marry and will cause all sorts of problems in the long run.\n\nI must say I don't really agree with your sister, its one thing to put your feelings aside, but its totally something else to be blamed for something you never did.", "NTA believe it or not I did the same thing to someone close to me. I said “if you aren’t sure about marrying him, and you are talking to other people then cancel the wedding.” It was 2 weeks before her wedding. I had so much guilt for a couple years because when I said that she really did decide to call it off. However, she is happier now than she was before and she now has a beautiful daughter and three step children.", "Wow, what a toxic bunch of ladies! Good for you for being the only adult in the group! Honestly, this seems like it’ll all sort itself out in an entertaining way. Update us when all their relationships crash and burn! NTA.", "NTA\n\nTell the groom.", "NTA. Why is she getting married if she’s not over this guy? That seems weird as hell to me", ">I learned from one of the other bridesmaids that they spent the rest of the morning bashing me in addition to ex.   \n>  \n>I told her she needed to delete his number from her phone and move on because it wasn’t fair to the guy she is marrying if she continues to be hung up on her ex.\n\nIt might be time to recognize you've outgrown this friend group and step out of the wedding party. She was dumped five years ago for whatever reason, and not only was she foaming at the mouth over an ex on social media, but she called him ten times. That is way more than needing closure, that is something else entirely. \n\nNTA.", "NTA and i would have been much meaner.", "NTA at all. Sounds like you were the only rational person at the party.  I feel very bad for the groom.", "NTA. You seem to be the only clear headed person in this friend group.", "NTA Tell the groom and dont go to the wedding.", "NTA. She does seem to be hung up on her ex, and it's not fair to her fiance that she still thinks about him as the one that got away.", "NTA\n\nNow I have never been to a bachelorette party myself but I have never, in all my years, heard that it is for \"getting closure with old relationships\". I thought it was to celebrate the bride's \"last night as a single woman\" and debauchery. Your friend (and her future husband) deserved to hear the truth from someone. And yes she needs to get over the ex.", "WHAT????\n\nTHEY BROKE UP 5 YRS AGO. SHE'S AT HER BACHELORETTE. CALLED HIM 10+ TIMES AND ITS YOUR FAULT?!\n\n😂😂😂😂😂😂😂😂😂😂😂😂😂\n\nHe should cuss her ass out. Worse, it was her fault they broke up. Nope!\n\nNta. You were right. It isnt fair to her new guy she's about to marry. Wonder what he'd do if he found out that she cried for an hour or more over an ex of 5 years ago. Naw!", "NTA. This 'friend' of yours should have been over her ex before she even jumped into a new relationship. Now she's engaged and still hung up on this other dude who has clearly moved on with his life. I do feel bad for the groom as he's probably not hung up on any previous relationship. I don't think he would have proposed if he were and she shouldn't have accepted the proposal until she was forsure over her ex. This is ridiculous. You're right OP. A bachelorette party is not about hangup's on an ex or ex's. I thought those parties were for celebrating a new beginning before it actually starts and getting a bit more wasted than normal. If they're going to ask you to leave early and than bash you for not thinking it's appropriate (it's not) than I would straight up give up my position in the wedding party. If the groom somehow asks you what happened, I'd be honest. Good luck but it seems like the engaged couple needs it more!", "NTA - that marriage is doomed", "Also, even if that WAS the point (which, as you say- should've happened already)- isn't \"delete their number\" PART of getting closure? It seems like OP's advice to the bride actually falls in line with that \"getting closure with old relationships\" thing.", "This. NTA. I had a friend who almost ran before her wedding. People said it was normal to have second thoughts. I never did leading up to my wedding. And when my friend divorced, she said she wished she'd just backed out before the wedding because she knew it wasn't right.", "I fully agree.  These ideas of \"The bachelor/bachelorette party is the last time to do...\" is solipsistic nonsense.  You're not going off to war, you're going through a ceremony to formalize a commitment you've already made.  In theory, one you are happy about.", "And whatever the bride was doing, drunkenly bemoaning and regretting her split from her ex — that wasn’t closure.\n\nBesides, which is it: should her “search for closure” be enabled, or should OP have stopped her from repeatedly calling her ex?", "> I told her she needed to delete his number from her phone and move on because it wasn’t fair to the guy she is marrying if she continues to be hung up on her ex.\n\nIf this is all OP said, and there weren’t any harsh remarks layered into it, then this isn’t ‘brutal honesty’ at all, nor was it insensitive. It’s just laying down a very simple truth, and this is exactly the kind of thing you’d want to hear from your *best* friend, who presumably you are close with because of how much you trust them. Like, that’s where you go, “fuck… you’re right, thanks pulling my head out of my ass.”\n\nNTA to OP for trying to do her friend a solid.", "Yeah.  Silly me, I thought the point of a bachelorette is hanging with your best girls one more time before your life is largely consumed by marriage and maybe starting a family.  There might be more occasional girl's nights, at least until kids start coming, but it probably won't be exactly the same anymore.\n\nNTA.  Wambling is right - I pity the guy.  He doesn't know what he's getting into.", "She should tell the groom what her best friend has been up to, the poor guy should know", "You heard op, it’s to get over her ex.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Step back from the friend  ,she  is not a real one if she insults you when you try to help her. Nta", "I’ve known people like that. Damned if you do, damned if you don’t. Can never please them.", "When people say things like that a lot I find they never actually live that way. You wouldn’t have to say it if you just lived it. It’s the “I hate drama” but they actually love it.", "That's because she believes that honesty is whatever she wants to hear.", "I think we spoke about my sister’s ex briefly at her bachelorette but in a “god, remember when you thought you were going to marry him??? That would have been awful” kind of way. And we also shared stories about her college days where she had a lot of casual sex. Like we looked back on her dating life that lead her to her husband but not in “still hanging on” kind of way.", "Hens, that's a simpler name for a bachelorette party I am guessing.  Lol.", "And in the clarity the next day OP is asked to leave for suggesting that this was not advisable? If it were me I would be sure to grab all of my stuff on the way out, because once I left there would be no coming back ever.", "Just did my sister's bach, and we did a spontaneous light hearted \"roast\" of her and her exes at one point.  Her picker had a serious malfunction for a few years, and she dated some real jerks.  \n\nShe laughed and filled in details and blushed.  She did not cry over them or call them.  The fact that OP was kicked out for saying calling an ex 10 times is a bad thing ... Yikes.  Feel bad for the groom.", "They're whatever you want them to be. It's just a party. My spouse and I had a combined bachelor/bachelorette  party where we played boardgames with our friends all night.", "Lmaooo how old are you?? No one actually believes that shit 😭", "Please tell the fiancé. He deserves to know the person he's supposed to marry isn't fully over her ex.", "I couldn't cope for about a year for a friend of mine who we parted with (I fell for her multiple times, she only wanted friendship). Recently i deleted my insta profile and blocked Instagram in my home wifi (using NextDNS, very cool thing), now feel better in that aspect that a) i don't have an account to surf insta normally and b) i physically cannot access insta in first place", ">but I’m actually quite sure that wasn’t his number anymore.\n\nThis makes me kind of curious what the actual numbers of random guys having sex with a bride to be that were drunk dialing an ex's old number... Considering humanity I bet the number's not zero.", "She's not the one he should hear it from, only the fiancee herself", "Maybe step into your new friends sooner and cut her off and let her fiancé know what she was saying.  If he still decides to marry her, then its on him, but its not fair to him if she's still pining over her ex and he's just Mr. Right-Now.  And if you've already accepted that the bridge between you and her is burnt, then no reason to drag it out.", "I know I'll get downvoted for this but I'll say it: if the only problem you've had with your supposedly best friend in the 10 years that you've known her is that she gossiped about you being a downer in that situation, then I don't think you should just break off the friendship. \n\nObviously what she did was bad and you say yourself that she felt guilty and embarassed. It was a tough moment for her. You were absolutely right with what you said (NTA) but you could've waited for the next time you see her to say it in private and when the emotions aren't so heightened. Her reaction wasn't ideal but it's not surprising she felt attacked in that moment. It has nothing to do with her not wanting you to be honest. \n\nAlso, you said that her fiancé knows he wasn't her first choice and is fine with it. Probably she wasn't his either but you're in your thirties and maybe they decided having a family is a priority for them and they'd settle. You shouldn't tell him anything.", "Am I weird for still being friends with about half my exes? Lol I'm going to my ex's wedding in a few weeks and I'm so excited to see him and meet his new wife. (He moved overseas years ago and we haven't seen each other in a long time) Even my husband is friends with him and knows we dated a long time ago in our early 20s and is coming with me to the wedding.", "I'm glad you're in such a good place where your ex is concerned.\n\nMine made my son's life and mine a living hell, to the point that although he died a very bad death, I am still having a hard time forgiving him.\n\nBTW: NTA.", "I guess they wrote that instead of typing out 'hen party' as it's called in the UK.", "I would drop out the wedding if they are bashing me behind my back over this.", "I'd go for something like that. Probably not boardgames for me, maybe video games. But idk if I'm having a big party I would still rather do it with the person I'm marrying.", ">Both brides and customers are perfectly capable of being blatantly wrong.\n\n\"and deserving of being quietly shoved in the bin out back\". Don't forget that part.", "If OP was the most sober of the group, I could see the others blaming her for not stopping them because she was more sober and thinking straighter than everyone else. \n\nOf course this is an incredibly immature take, but not significant more immature than the bride had already been acting.", "I had one that would say \"Hey!\" and try and trick me every time he'd see hay bales along the side of the road while we were driving. It was so silly and random. I still hear it whenever I see them. (But doesn't mean I necessarily miss the guy.)", "Yes but are you remembering them so much that at a bachelorette party for an upcoming marriage you would sit and cry that it should have been him your marrying? That was OP’s point is that the friend wasn’t over him yet. I am reminded of many things from exes. Some good, but mostly bad or at least not pleasant. But I don’t cry over them anymore and I certainly don’t call 10+ times when drunk.", "Yep and absolutely nothing wrong with that, drunk dialing them multiple times on your hens night though? Not a healthy look.", "The groom deserves to know.", "Oh my gosh, a real life Mel from Flight of the Conchords!", "Omg yes. So so much.", "I currently have numbers from three different countries and rotate the second sim card in my dual-sim phone according to my needs.", "No drunk call and a rant about how life has gone down the drain?", "lol.\n\nWell, of course you keep the plumber's number if he did a good job. What if you need one again? Saves you the research.", "Nice restraint.", "Doesn't matter if she was wasted. She is responsible for her actions drunk or not. If she slept with someone while drunk, does that make it ok? If she fought somebody drunk does that make it ok? If she can't control herself while drinking, then she needs to not drink so much. \n\nI agree with not inserting yourself, however, the groom is innocent in all this and has no idea. Better to save more heartbreak, money, and time for someone who did nothing wrong.", "Yeah agree with this,\n\nNot my monkeys, not my circus. It never ends well, and further involvement is only going to make things worse. At this point OP should just go NC with friend until the marriage is inevitably over and she comes crawling back. And even then I personally would ignore her.", "Ba-dum *splash*", "I literally said “if she hooked up with some random then tell the future husband.” And no, it’s not okay to fight people when  you’re wasted. Nowhere did I say that being wasted absolves you from responsibility from your actions. \n\nYour analogies are terrible because they are way more severe than what actually happened. Life isn’t black and white, there are a lot of shades of grey in between. If I were in this situation I would wait until my friend sobered up, have a heart to heart with them in how they really felt about the relationship, encourage them to talk with their future spouse if need be. It’s okay to have a little understanding. And it’s okay to not want to cause drama for yourself if you don’t want to. It’s not OPs responsibility to tell the fiancé, it’s the bride’s responsibility.", "Hahahaha I laughed way to hard at this!", "We have fancy tea here called high tea. It has cupcakes on tiers and fancy hats and all that included. Usually something we do as a mother's day outing or similar. It might be a regional thing to call it different things?", "You don't know the kind of meal/tea we had. So how do you know wether or not the restaurant did it right? I can tell you for a fact there were no fancy hats involved if you must know.", "It's an American hotel/restaurant thing to label it high tea because that sounds fancier. But it's the other way around.", "By definition, tea in a restaurant isn't high tea. Sorry you missed the opportunity to sport a jaunty hat.", "NTA, you were not in the wrong to say that, because it's absolutely emotional cheating that she is saying she wishes she was marrying her ex, and trying to make contact with him.\n\nThere's a difference between being supportive of someone who's in pain, and someone actively wronging someone else and helping them do it. The rest of your friends are telling her it's fine to marry someone while actively trying to get in a relationship with her ex", "NTA. personally, if I were a MOH, and the bride had a breakdown of this capacity at her Bachelorette party, I'd tell her to call off the wedding. I don't think you were brutally honest either. it seems to me you were quite reasonable. there should be no reason to have any feelings for an ex when you're planning on starting your life with someone else. sorry, OP.", "Nta. Am I the only one who's thinking about the groom? I feel he should know the situation he's getting into. I don't think I'd want to marry a guy who was crying over his ex and calling her the night of his Batchelor party. Save him the trouble of going through a divorce. It's easier now before the wedding rather than after.", "If I learnt my spouse-to-be was calling their ex during their bachelorette party... Nope. NTA", "NTA. Let me guess, the friend banged some other dudes, got dumped, and now 5 years later this guy has the life she wants. All her friends are acting like she’s a queen and blaming you and the guy. Your friend sucks and her friends suck extra.", "I dislike people who have the mindset of \"always back up your partner/friend\". No, if partner/friend is doing stupid things you need to call them out on it and tell them. If they have a plan/idea that's stupid, make it so it doesn't happen. \n\nIf you can't be arsed to protect the people you love from themselves, I don't think you're a good partner/friend.\n\nIf the partner/friend refuses to listen, that's on them. Not you. But you should at least try.\n\nOP, you did the right thing. NTA.", "NTA - if she still has his number after 5 years! She’s hasn’t moved on.\n\nI think the kindest thing you can do, is send a message (anonymously) to the groom and let him know, because she’s just getting married for the thrills, not the love.", "NTA- if she is still this hung up on her ex she has no business getting married. Even keeping his number in her phone is ridiculous.", "NTA. I’d step down as MOH after finding out they where bashing me. You did the right thing. That poor groom.", "Don't think I'd be going to that wedding.", "NTA\n\ntell her husband-to-be.  he deserves to not get fucked over by this train wreck", "NTA - that had to be the weirdest bachelorette party I've ever heard of.  You're supposed to celebrate the bride, not mourn past relationships.", "Sounds like she just want a scapegoat for her bad life choices\n\nNta, find new friends", "NTA and that bride to be cheated on the ex, didn't she?\n\nYour advice was sound and not at all harsh. The thing your sister is implying doesn't sound right to me at all.", "NTW this totally sucks because this is your friend of 10+ years :,( I think you have outgrown her.", "NTA. You should be over your ex before you say yes to marrying someone else. You are right. It’s not fair to her fiancé. And those women sound toxic as hell.", "NTA. You said something mature and adult-like, but you're the AH? I don't think so. The bride ringing up the married, new father ex is horrible on multiple fonts. \n\nShe didn't want to hear it because you're not a \"yes-man\". You told her a truth she didn't want to hear. That makes you the only real friend she has.", "NTA. That was such a mild suggestion. The fact they thought it was out of line shows how mental they are.", "Please. As someone who was in the situation and found out before, PLEASE tell the fiancé. Save him the future divorce. It’s the right thing to do, I’m begging you.", "NTA. It’s incredibly fucked up to willingly marry someone while having obvious feelings for someone else and your friend needs to hear that", "NTA\n\nYou were right about everything.\n\nIf it's no big deal, ask her if she told her soon to be husband that she drunk dialed her ex 10 times the night of the bachelorette party. I guarantee she didn't. Ask her if she will tell him that she did this to \"get closure\" on the previous relationship. I guarantee that she won't.\n\nShe won't because she knows it's inappropriate.", "NTA \n\nHer poor husband.", "Nta and it’s weird that they blame you for “letting” her call him but also they say her behavior was normal?", "Fully prepared for y t a after the title, but seriously she needed to hear that. NTA.", "NTA. Tell her fiance. He deserves better than that.", "Y T A if you don't tell the guy. Poor bastard marrying this thing...", "NTA\n\nHold your head up high. You did the right thing. What she was doing was wrong", "NTA I generally dislike brutal honesty because usually it's just an excuse to be rude. I don't really find what you said to be brutally honest though. Sometimes people get cold feet close to their wedding due to the stress of it all. It's not their real feelings though. \n\nI feel like when someone gets cold feet like that you should encourage them to be excited for their new life or check in with them to see if the feelings are more than cold feet. Saying things like you should have married to your ex and encouraging drunk calls is not a good way to deal with this emotions.  I don't even think it is a good way to deal with a break up. Your friends sound very immature.", "NTA.  You are right and she isn't your friend.", "NTA\n\nGoodluck to her soon to be husband, i either see cheating and/or divorce, I wonder which will come first.", "NTA", "Id save your money and back out of the wedding lol", "They're not your friends.  Cut them loose now.", "Everyone wants you to co-sign her bullshit just because it's her bachelorette party? Hell no. NTA. I would want a friend calling me out on my bs if I start acting out or making not-so-great decisions. I think you did the right thing, everyone else is just concerned with pretending she's perfect until after the wedding.", "WTF is this idea that getting married is some kind of freebie to be an idiot, rude, demanding, cruel, and essentially get a free ride to participate in any acceptable social norm? It was a bachelor party not a damn existential retreat. \n\nNTA a real friend should be willing to tell you when you are being an idiot, and she is being an idiot. Feel for her fiancé", "NTA! You really care about her!", "NTA And you’re the only one who spoke sense. I’d wash my hands of that nonsense", "She's an alpha widow.  She'll leave her current man in a few years.", "Omg what a bunch of kids. They are right, find yourself better friends that aren't drama queen", "NTA. I've never heard of the closure aspect of bachelorette parties.", "NTA your friend is a hot mess.  What you said is true, and not that brutal.   Good luck to her groom, if she goes through with the wedding.", "Sounds like you should feel grateful you got to do something else that night", "Nta…", "It seems like you were the only one not being an asshole. That poor groom. Sorry you gotta deal with that, NTA", "NTA yiiiiiiiikes these girls are not classy. Poor groom.", "NTA you’re absolutely right", "I would have to go with NTA. Unless you were really mean about it. It depends on what the wording was or how you said it. Maybe you could have said it more gently? \n\nI had an ex text me a few months before my wedding. We talked a little bit but I quickly came to the realization that it wasn't healthy or good for us to be talking and all the reminders as to why he was an ex. He kept trying to bring up \"our great love\" and i was like wtf are you talking about. Definitely not how i would described that relationship and it was 10 years ago. I told him to never contact me again. Then I blocked and deleted his number. I am and always have been committed to my now husband.", "NTA", "While on my Bachelorette party I was quite flirty with different men we met out and was not acting like someone about to be married.. no one said anything.. fast forward and I filed for a divorce a year later with everyone making comments like “I had a feelings things weren’t right based on that weekend” and other moments that people decided to stay quiet about.  It’s no one’s responsibility to tell me I’m making a mistake, I should have known on my own- but man do I sometimes wish this was brought to my attention at the time.  You’re NTA- however there was probably a more constructive and delicate way to have that conversation and probably after the party was over and it was just the two of you.", "NTA. So they want to bash the ex… but apparently she should keep his number? Seems like if he’s bash worthy, he’s not “keep his number” worthy. \n\nI feel bad for her fiance. Like I know some people say every couple has someone who “settled”, but in this case, it truly sounds like the fiance is someone your friend has settled for since she still sounds very hung up on ex.", "NTA. What happens if she gets drunk again and is married. Nowadays it is almost impossible to point out the truth and have it twisted around to 'you are shaming/victim shaming' when the truth, no matter how much it hurt, would ultimately do good in the end.", "Nope, NTA. You did the right thing, and GF needed to hear it from someone.", "NTA. The bachelorette is about saying goodbye to being single nothing to do with an ex. I’d be clear she’s the loser still hung up on her ex stringing some other guy along and that’s on her your not her babysitter. I’d also reconsider attending that wedding or even being friends with her.  A true friend doesn’t throw you out for telling the truth or talk shit about you when your backs turned", "NTA. \n\nA bachelorette party is supposed to be about you celebrating one last time as an unmarried person before you get married. At mine, we drank, skinny dipped in a lake and played some risqué ring toss and pin the junk on the hunk. \n\nAt no point did I obsess over an ex and stalk them let alone call them.  It’s really unhealthy, and I think you did what was right. You told her what she needed to hear. It’s unfair to herself and her fiancé if she’s still hung up on her ex. It’s not the time to live in the past.", "NTA, What you said was valid and direct. In my friend group we can have conversations with eachother like this. Its a sign of a healthy friendship if they can call you out (direct and compassionate, just the way you did) when you do something out of character or just messed up. And these people seem like the kind that would let you crash and burn and then just talk about you behind your back. Not the friends I would want in my life. It sucks to experience this but sometimes we outgrow people and you will have this discernment with the next friends.", "NTA. What you said was completely right, and it was not rude or cruel. She is punishing you for saying what needed to be said, because it’s not what she wanted to hear. \n\nI feel bad for her fiancé.", "why was it your fault that she called him 10+ times? she sounds messy and you were right that it wasn’t fair to her fiancé. most people like to blame the messenger for stating the truth like this. i’ve never heard of this (getting closure on an ex) to be part of bachelorette parties but i’ve never been part of one so i guess i wouldn’t know…\n\nthese people all sound like enablers and shitty friends. might be best for you to pull out of the wedding at this point. maybe even tell the groom how hung up she is depending on how good of friends you are with him. NTA", "NTA lol what a loser", "NTA.   From what I can tell you were only trying to help your friend and telling her what she needed to hear.   I realize she was intoxicated at the time of trying to contact her ex, but intoxication is no excuse for poor choices.   And if they did spend the rest of that morning bashing on you and the ex, that makes everyone except you an asshole in this situation.", "NTA", "You were gentle with what you said imo I don't think she should be getting married at all if she's still THAT emotionally charged over a past relationship, and I think her fiancé deserves to know about what happened that night. NTA", "NTA. You were being a good friend. She should delete his number. I doubt she would want her husband engaging in this behavior. Good lord.", "Um... No. That's not how bachelorette parties work. Her calling her ex is way out of line. Especially now that he has a family of his own.\n\nI think we all have that \"what if\" ex. The one that if stars were a bit more aligned things would have worked out differently. Mine was at my wedding and I was at his (he's told me in the past I was his one who got away). We love each other as friends but there's a reason we didn't end up together. \n\nYou still don't pine over them before your wedding. You damn sure don't call them... Why is his number still in her phone? \n\nWhile you could have been more diplomatic, you're not wrong. I feel bad for her groom. NTA", "Nta", "NTA.   Sounds like you are being used to as a scape goat to cover her poor choices.", "Your friend and hers sound out of touch with reality. NTA.", "Tbh. I still would’ve said n t a, even if OP just told the groom about what happened", "I always assume the person calling an ex 10 times in a row years after a breakup doesn’t HAVE friends. Because I’d take my friends phone and hide it until she sobers up and can call her therapist. Really weird friend dynamic to sit back and watch while your friend blows up her life or makes a fool of herself.", "Closure of old relationships should have happened waaaay before starting a new relationship. \n\nI would not want to be the one marrying someone who rather be with their ex.", "The groom sounds like a rebound. Poor guy.", "Putting my petty little self into OP's shoes...  if the bride and other bridesmaids are talking shit about me, then I would be temped to put a little bug in the groom's ear about what happened.  If she is this hung up on her ex, then this marriage is not going to end well.  Better to postpone it so the bride can deal with her past and move on, or cancel it entirely.  Not fair to the groom.", "i'm so sad for the groom, he should know these things happened. absolute disrespect.", "so something i’ve learned in the last year while realizing i am autistic — since i’ve always been the friend who “spoke the truth” and was scapegoated like you here — neurotypical people don’t actually like the truth or people who tell the truth and are direct. they perceive it as rudeness. it’s weird.", "I'd remind her of her supposed appreciation for honesty.  And let her know that if she is going to trash you for telling the truth, in future you will keep your own counsel.", ">\tshe usually does say things like how important honesty is and that friends are supposed to look out for each other so I’m just very confused.\n\nMaybe that’s because she’s trying to convince herself more than anyone.", "LMAO I mean the bride is right for logistics choices on the wedding day, but planning a wedding doesn’t mean you have license to be correct for months.", "I think they mean in regards to lettibg the choose an over the top dress they love, or an unusual/niche cake desgin, not deciding to marry a man they don't love & still love their ex!", "I think I reflected on some of exes in the lead up to my wedding-- but I was engaged to two of them, so I think it's normal to think about how details and decor and plans would have been different, marrying Joe at 22 instead of Frank at 30. But it NEVER occurred to me to contact any of them. \n\nIt's a good idea before you get married to do an internal check in, make sure you're not hung up on anybody and you're definitely 100% in on this relationship, but that's wildly and entirely different from crying over someone's insta and then trying to drunk dial them. \n\nNTA, OP. You were the lone voice of sanity.", "Yep, this! Find another MOH because I will walk away from this fuck fest. AMF! Hahaha!", "We both have mixed-gender friend groups with a lot of overlap, so we each went for dinner and a few drinks with our core friend groups and then met up in the pub to finish off the night in one big bunch. It was fun.\n\nEdit: For us, and for most of our friends, the purpose was basically a fun night out with close friends, before the serious wedding day with all the ceremony and family. Nothing deeper or more dramatic than that.", "I think it depends way more on the age. At 25 yep all my friends had strippers and clubbing and way too much booze. At 35 half of them had been married 10 years, had kids and were allowed to be out until 10 or 11 if they promised their spouse they wouldn't be hungover.", "I was to blame because I was the most sober. The problem was I wasn’t with them 100% of the night. I had to go and help one of the bridesmaids because she left her phone at the bar and I had to go pick up food because the place the bride wanted didn’t deliver late night and she didn’t like any of the places on ubereats. So it was impossible.", "Lmafo, I think the best plan at this point would be for her to actually talk to her ex and get the “closure” she is after. That being “I am married, please stop calling me”", "I *wish* I could live in an eco chamber. Lots of plants, plenty of sunlight...", "I like having very casual social media relationships with my serious exes so I can check to see if they're dead, oh maybe once every couple years. Usually it occurs to me to wonder, I tab over to their Facebook, note that it is not a memorial page, and tab back out.", "According to the comments he already knows she isn’t fully over the ex and knows he was her back-up plan, which to me says he’s either desperate to get married or the reason why she isn’t with the ex is because of him (cough cough affair partner cough cough)\n\nOP, you are NTA", "Yeah a friendship like this is worth burning down. Otherwise you'll probably carry the guilt of letting him go through with this and not doing anything to stop it when you knew", "the friendship is already ruined IMO, and ruined by the bride and the rest of the bridal party", "I still have the phone number of everyone I've ever saved in my phone in my entire life. I'm not figuring out how to delete stuff!", "Only weird if you still want him back… but since you did not drunken call him at your bachelorette I think you are fine. Unless he is doing that on his bachelor party.. then you might have a problem :p", "It's very normal if you're in a close knit friend group or live in a small town. I certainly stayed friends with my exes in college when we saw each other all the time. After a little awkwardness, it sort of evened out as a casual friendship with someone you happen to know very well.\n\nThat being said, it's a little weird when your ex-fiance is your best friend. Seen that a couple times and it makes you wonder what emotional bandwidth is left for a romantic partner.", "Exactly! It was so fun, and I highly recommend it!", "And he should, he just needs someone to tell him that he very much is the second choice so he can determine if he truly is willing to accept that", "Yep and that the extent of it, I work alone at a 24/7 store and it’s absolutely me who has the ultimate say. They being said if you want to buy smokes or withdraw cash to give to a homeless person that’s your choice and I’m not stopping you.", "I had a lot of amicable breakups when I was young. I never really knew if that's weird because media/movies like to portray dramatic explosive breakups. Other girls I was friends with in college had dramatic breakup sagas that I didn't usually relate with.\n\nThere was one night I was at a house party at my ex's place (the same one getting married in a few weeks) and it was getting late. There were just a few people left, and in usual fashion we were all standing around the kitchen chatting. I looked around and had the strange and slightly awkward realization that I was standing in the kitchen chatting with 3 exes and my spouse.", "I feel like it was all just a pipe dream.", "How do we know the groom was innocent?  Maybe he was crying over his ex at his bachelor party.  And nowhere did it say the bride makes a habit of getting wasted and calling her ex.  She was at her bachelorette party, drank too much, said and did some stupid things. That probably happens at most bachelor/bachelorette parties. It's not a reason to tattle to the fiance.  It didn't even sound like she remembered doing it the next day.  \nESH, there was nothing wrong with telling the bride that what she did was not appropriate but because of how OP stated SHE doesn't really drink and stayed fairly sober, she sounds like someone who would have been snotty while rehashing the brides behavior the next day.  The bride and other bridesmaids who decided to shit talk behind OPs back are also jerks.  tbh, it doesn't sound like anyone in this group is very mature or likeable.", "Well you do you I guess. But if it was me I'd want to know what I'm getting into and wouldn't rely on the bride saying something to the husband because why would she?", "This is in no way an E S H the bridesmaid did nothing wrong and if I was the groom,  I'd want to know what I'm getting myself into.\n\nEta: getting drunk at a Bachelorette party (or at any time) is no excuse for poor behavior", "I understand this sentiment but the thing is I’m pretty sure he knows. It came down to a choice between him and ex once and she was fully willing to throw him to the side and she made him fully aware of it. It wouldn’t make him end the wedding it would just open old wounds and make him sad.", "I agree you were right to tell her, but I think you probably would have had more success if you'd spoken to her in private afterwards - she was probably already incredibly embarrassed by her behaviour and it can be really hard to have open and honest conversations like that in a group.\n\nTelling someone the truth is often necessary, but the way you tell them the truth can have a huge impact on their receptiveness to it.", "The only thing I thought about during mine was \"I should have worn a looser dress, because I can't stop eating this Colombian food.\" No regrets, though. Mmm, arepas.", "Seriously! As soon as I read \"part of a bachelorette party is getting closure with old relationships\" I was like... when/how was the bride-to-be planning to do that, exactly? By getting drunk, scrolling through his Instagram, and calling him 10+ times???\n\nLike, Bachelorette parties are definitely \\*not\\* for getting closure but even if they are, that's absolutely not what she was doing", "Yeah, short term this sucks but long term, this is likely going to be a win for OP in having had a whole load of multiple people purge their drama llama selves out of her life for her. Like, oh no, not that being the last worst bachelorette party I ever end up stuck in the middle of and then *get blamed for*, whatever will I do! Who will I go to when I most need someone to treat me like garbage in return for my friendship, care and concern!", "You are not her mommy, she is not a toddler, and you cannot control a grown (?) woman's phone usage. Expecting one person, without even asking, to act as the designated non-fuckwit for a gaggle of drunks for the entire night is beyond the pale.  You also cannot be expected to be in more than one place at a time.  They just want to blame someone and you are it.", "I get what you mean, but he should hear it from someone. And we all know it won't be the fiancee.", "I wouldn’t say her problem was “remembering” her ex. It was more like her “wishing” for her ex to be with her.", "And you never have to forgive them.  Your feelings toward your ex are yours and valid.  I am so sorry that is something you had to go through.", "Same group of people who buy those tacky ball and chain wedding cake toppers. Some people genuinely act like getting married is a burden, no idea why you would do it if that's how you feel.", ">I told her she needed to delete his number from her phone and move on because it wasn’t fair to the guy she is marrying if she continues to be hung up on her ex.\n\n>Everyone got really upset with me for being insensitive and I was made to feel like it was my fault for letting her call him. Eventually my friend asked me to go home early. I learned from one of the other bridesmaids that they spent the rest of the morning bashing me in addition to ex. I was told part of a bachelorette party is getting closure with old relationships and my judgmental attitude ruined it for the bride to be.\n\nthis is a really weird overreaction to a rather innocuous comment. what exactly is it you said to her? could the tone have been interpreted as super judgmental or offensive? I don't understand why \"everyone\" at the party would get upset with you for saying this", "I would skip the rest of the dreary festivities if I were you and leave these friendships like the ex boyfriend did. This ladies (using this word loosely) seems to be the toxic sort you don’t want that bad juju rubbing off on you.", "NTA. Ok your drunk friend called her ex 10 times and shouldn’t have. This is your fault?? I don’t get how everyone turned on you so fast. I wouldn’t tell her fiancé anything about ex. It isn’t your info to tell. I disagree about your duties as MOH/ bridesmaid. WHO said you were responsible for closure?? WTF. Where are these made up rules coming from. Wow. Sorry they screwed you. I don’t see much wrong you did and now they’re throwing you under the bus along with her ex. I would seriously reconsider this friendship with the bride. She sounds like a monster.", "NTA.\n\nYour sister is dead wrong. If your simple honesty caused the bride-to-be to ask you to leave the festivities, and for all of them to trash you as soon as you leave the room, I'd question whether any of these people are truly your friends, let alone close ones.\n\nThere's no need to be MOH to someone who holds you in such low regard. I'm sure one of the \"yes-maids\" would be happy to fill that role. Just tell her you'd feel like a hypocrite standing up for someone and being part of a party that treats you like used toilet paper.", "Wow, didn't realize high schoolers were allowed to drink and get married! /s But for real, your friends sound catty, and that's not because they're girls.  IMO you gave some good advice for her to follow before getting married.  NTA", "You're NTA but what is up with the groom here? Why is he putting up with this???\n\"she has been asked in the past to choose between him and her ex. She chose her ex, she made it clear to her now fiancé she would rather be with her ex\"\nThat should have been the end of it. She made her choice and too bad if he didn't want her back. It's over.", "I dn't understand people like the bride. As soon as my relationship ends, I forget their name, their number, their face- ALL OF IT! They no longet get any space in my life in any way. They are exes for a reason and stay that way!", "I think my tone was maybe a bit exasperated. When she revealed she had called him everything got really loud and frenzied. She started screaming and yelling like “what do I do! What do so do!!!” Some of the girls who were still hung over were like falling to the ground yelling at her to stop yelling and it was just really stressful. So I kind of maybe shouted (because everyone else was shouting) YOU NEED TO DELETE HIS NUMBER! But I don’t think I was even heard. Once things calmed down I repeated “You need to delete his number it’s not fair to “fiancé”. And then they pointed out that I should have made sure she didn’t call him and it was my fault and that I was ruining the night by trying to make them leave the bathroom when they were having a cathartic moment etc., and then I apologized and went back to my room for a bit and then she came in awhile later and said it would be best if I left if I was going to keep judging her and micromanaging her party weekend.", "I am considering it. I’m having a hard time because where I’m from people are very conservative and when I came out in high school everyone treated me like I had the plague. She was literally my first not online friend and she never cared I was a lesbian and even stuck up for me. I guess I still see her as that kind person who saved me from being lonely and not the person she is now.", "Poor guy… hopefully it ends ok.", "Just read your updates..Don’t feel obligated to the bride…sweetheart no matter what suggestions are given here on Reddit you get the last decision… you have to do what’s best for your mental health.. if this relationship with her isn’t healthy move around but if you feel it’s worth saving talk to the bride and let her know ,when your not around the drama lamas bridesmaids ( I thought you were friends with all of them) how you are feeling about what happened and you didn’t appreciate how they treated and talked to you.", "How funny would it be to get those voice mails the next morning  as the random person with the number. 10 voice mails from some drunk girl saying how much she loves and misses you....I bet some texts as well.", "NTA, but what do you get out of these friendships. They don’t sound like good people, and they resent common sense. You don’t have to settle for this and neither does the groom, although he sounds beaten down.", "That's what I was thinking. Honestly I would have noped out of the whole shit show after the bachelorette party. I hate being pulled into the middle of other people's drama and I would run away from this dumpster fire. The bride and groom need to figure out this shit for themselves. NTA OP but I would be keeping my mouth shut from here on out and staying as far away as possible. I wouldn't want to be anywhere near this fuckery when the relationship implodes.", "I think it depends entirely on the ex. Half my exes are still my friends. Another half are people I never want to see or hear from again.\n\nThough, sometimes when people say you cannot be friends with any exes, I consider that a red flag. It leaves no room for nuance and makes me uncomfortable including those people on my (very real, genuine) friendships with exes.", "I think that’s why I found this so funny. It’s happened to me before. A few years back when I changed my number, I started getting voicemails from a drunk guy basically crying tears in his beer about how he fucked up and stuff.\n\nAfter a couple of weeks (I reckon a drinking problem was part of the way he fucked up), I got tired of it and sent him a text to tell him it was a wrong number situation.", "Well to be clear her other bridesmaids aren’t my friends, she has been my friend for 10 years and was one of my only friends for a long time so it’s hard to think of ending that friendship but reflecting on the comments is making me realize I need to.", "Did I date you?", "I’ve never drunk dialed an ex but once I drunk dialed a car salesman that I was preparing to buy a car from at 3 am", "So funny 😁 at first I can totally see how annoying that would get .", "If you did, thanks for ghosting me lol", "Drama that’s not my drama? Sign me up! 😂\n\nBut then after a couple of weeks, the drama just got kinda boring.", "There's only one thing I miss from one ex.\n\nI taught my husband how to do it. (Without ever explaining why I taught him other than \"I like when this happens\")", ">Feel bad for the groom.\n\nIdk, going by OPs edit her friend must have had an affair or something with her fiancé while she was with her ex because OP said at one point her friend had to choose between her now fiancé and her ex, she picked her ex, telling her now fiancé that she'd rather be with her ex but her ex left her so she went back to her now fiancé.\n\nMy guess is that her fiancé probably knows that she's hung up on her ex but is still sticking around anyway, God knows why."]}