{"id": 7161, "submission_id": "10a6k13", "title": "AITA for kicking one of my wife's friends out of my birthday party?", "selftext": "Last Saturday was my 40th birthday party. My 40th birthday is today, actually, but we celebrated it last Saturday for somewhat obvious reasons, and this Saturday isn't good for us all.\n\nMy wife and I invited several of our and her friends. It was a strictly no kids 18+ party, so we sent our kids to spend the day with their friends. While most of the guest got the message, one didn't.\n\nEnter one of my wife's friends: Jane Doe (not her actual name). She brought her eight year old child, despite the invitation saying \"NO KIDS ALLOWED\" in big, red letters. We didn't have a place to put the kids, so we reminded her of the disclaimer and said she had to either hire a babysitter, or watch her child herself (by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion). She said that she couldn't afford a babysitter and really wanted to go to my party, and that I was being \"inconsiderate\". Without thinking, I blurted out \"Inconsiderate of what? That you are a selfish bitch who is willing to take an eight-year-old to an adult-oriented party, simply because you can't afford a babysitter?\" Keep in mind, this party is an adults-only party for a reason. There's swearing, alcohol, sex themes, basically anything you can think of that kids shouldn't be exposed to.\n\nJane told me I was the one who was selfish and slammed the door. My wife was infuriated. She scolded me for kicking out Jane, telling me that I should have just let her bring her child in. I told her no because it's my party, and if I don't want to invite kids, I shouldn't have to.\n\nSo guys, AITA?\n\nEDIT: Since so, so many people clearly can't read, let me get something straight: No, I was not shaming her for refusing to get an abortion. I was trying to explain that the child didn't have a father because the father left Jane BECAUSE she refused to get an abortion. How do people make this mistake? Good lord. I hope this clears things up, because this is absolutely ridiculous how so many people read this wrong. The younger generation really is dumber. Sorry I had to insult your intelligence, but this is very infuriating.\n\nEDIT 2: The reason why I called her selfish was because she chose a party over her kid. Sometimes you have to make sacrifices. I did that with my kids.", "created_utc": 1673547631, "permalink": "/r/AmItheAsshole/comments/10a6k13/aita_for_kicking_one_of_my_wifes_friends_out_of/", "score": 2085, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I mean, I guess I was a little harsh on Jane, but still, taking a child to an adult party is not a good idea.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH. She brought her kids to an adults only party, which IS breaking the rules, but you called her a selfish bitch.", "ESH.\n\nHer for coming to the party with the kid.\n\nYou because, let's be honest, you sound like a huge asshole Who is judging this woman for choosing not to abort just because she was single.", "ESH she shouldn't have come and was rude to you by calling you inconsiderate, and you were rude in your choice of words by calling her a bitch, plus the way you seem to judge and disdain her for being a single mom and 'refusing' to get an abortion. I do hope her child wasn't with her when you decided to call her a selfish bitch.", "She planned this from the start, thinking she could manipulate your wife into changing the whole party -last minute- to be kid-friendly.\n\nNTA", "YTA for \"refused to get an abortion\" and calling her a \"selfish bitch\". Sure it's your party and asking her to leave isn't AH behavior, but your comments are.", "ESH.\n\nYes, you were absolutely in the right to deny her entry. She shouldn't have come with an right year old. And she's TA for expecting you to cater to her when you explicitly stated 18+, and she really shouldn't be bringing the child to the party.\n\nY.T.A. for your reactions. You could have been more understanding, and empathetic, while sticking to your boundaries.", "Did you really call her a “selfish bitch”? If you did then you’re a huge AH.\n\nNo she shouldn’t have brought her kid but if you actually spoke to her like that you are a real piece of work. YTA.", "NTA\n\nThe rules were stated in advance.  She chose to ignore them and was not admitted.\n\nGood for you.\n\nHappy Birthday!", "NTA. \n\nJust don’t call her a bitch (even if you feel she is one for ignoring your rules and not forewarning you that she would bring a child) That would have probably taken the heat off you considering your wife. \n\nJane sucks. Her “I really wanted to come but I can’t afford a babysitter so I just make myself an inconvenience to everyone else” attitude is infuriating.", "NTA she shouldn't have brought her child but there was no reason for you to be nasty to her", "Esh. She absolutely should have declined the party but holy crap. This is how you speak to people in your life? 😳 \n\nAre you okay? Have you considered therapy? Anger issues.", "ESH. yes, she was inconsiderate to bring her child to a child-free party but calling her a “selfish bitch” is way worse. what the fuck is wrong with you", "NTA for saying no for her coming with the kid, but YTA for the wording you used. \n\nYou're allowed to say no since it's your party, and she should've gone back home if she couldn't afford a babysitter once she realized it was an adult party. \n\nHOWEVER, you called her a \"selfish btch\" (red flag), because she can't afford it? You shouldn't have sworn at her/called her that name, and also, you seem to be a bit judgmental even in the way you describe her. Maybe that's why you blew up so easily? Or maybe there's more history between you two? Not sure, but either way, NONE of my S.Os have ever had a right to call my friends a \"btch\" - and I would be pissed at them for doing so because that's very disrespectful. Same with my other married friends - they'd be livid if their husbands called me a btch. \n\nIn the future, walk away if you're really that upset at the moment, take a moment, then come back without the name calling.", "A bit over-dramatic tbh. You managed to be right and an AH at the same time. Bravo.", "ESH You could’ve handled it a little more calmly rather than yelling at her. But she also should’ve just stayed home with her kid. I’m sure she’s exhausted being a single mother, but that’s nobody’s problem but her own. And I’m sure she knows how to read.", "YTA. Your party was the perfect place for Jane to see if any men there were cool dating a single mom.", "ESH\n\nWhy did you call her a bitch?\n\n“Selfish” and sending her home was to the point", "ESH. You shouldn’t have called her a b*tch and called her out in the fact that she couldn’t afford a babysitter. You could have easily said the party wasn’t appropriate for an 8-year old because of the adult themes and you felt uncomfortable.\n\nShe’s TA because she disregarded your no kids allowed rule and called you inconsiderate when she herself is being inconsiderate of your birthday party.", "ESH. She should have listened to the rules, but you were WAY out of line with your wording.", "YTA. You sound like an exhausting piece of work, tbh. You gave us a lot of unnecessary information about her previous relationship, which - even anonymously - is too much to divulge about another person. It doesn't matter how she came to have a child.\n\nAnd yeah, why did you call her a selfish bitch? Like, what the fuck, dude? If she can't afford childcare because she spends all her money on goodies for herself, yeah, I get it, but it still makes you look bad. And if she can't afford childcare for the regular reasons of *childcare is fucking expensive and being a single parent is HARD*, then that makes you look *even worse.*\n\nSo yeah. You're the asshole.", "ESH. Yes, she is an idiot, but she had her kid with her, and you called her a bitch. Thats an asshole thing to do to the poor kid.", "ESH. \n\nJane sucks, she knew ahead of time that you'd set a boundary of no kids, and she crossed that. On your birthday. Not cool. \n\nYou suck also, because if you did indeed verbatim call her a \"selfish bitch\" in front of everyone, that's not cool either. At that point, she was there, and inconsiderate as that was of her, I'm sure your comments made the kid feel like shit (he doesn't deserve that) and made everyone else feel awkward. If I were in your shoes, I would have felt pissed off, but tried to make the best of a bad situation (e.g. put the kid in a room with a game of some kind), and/or tried to meet Jane halfway, like asking her to leave at X time.", "Esh technically but wow are you a piece of work “she refused to get an abortion” sounds like youre quite the elitist when it comes to family structures . Of course you can have your adults only party; and she suck’s for bringing her kid but just wow.", "[removed]", "You didn’t kick her out.  She left when u told her she had to watch her own child.   NTA", "NTA. \n\nshe was informed on the invite that it was a child free event. it is not your fault that she couldnt get a sitter. she should have done the more responsible thing and just said \"sorry can't make it.\" and stayed home.", "ESH. She shouldn't have come and you should have called her a bitch presumably in front of her 8 year old. Please clarify if this didn't happen at your front door in front of a fatherless kid. If it's the scenario I'm imagining you'd be more than an asshole.", "Soft YTA because you didn't need to call her a selfish bitch. I'd at least apologize for that.", "The exact wording of your response is pretty uncalled for, but NTA. From what you say it seemed more than obvious that it was an 18+ party from the get go and she should’ve either had the foresight to plan a way so that she can go with her kid still cared for, or the maturity to just decline because of circumstances\n\nEdit: Granted, YOU should’ve have the maturity to not call her a selfish bitch in front of her 8 year, but I digress", "NTA.  No kids means no kids, period.  Was everyone else supposed to just PG it up because she can't read & brought her kid regardless?  I would have been pissed too.", "ESH. \n\nYou, not for kicking her out, but for yelling at her and calling her names. That was unnecessary. I understand how annoying it is to see a grown adult whine about a dumb situation they put themselves in, but yelling at her and calling her names was not an appropriate reaction in this specific situation.\n\nShe’s obviously an AH for just thinking it was okay to bring her kid despite clear communications not to. If there was a babysitting problem and she really wanted to be here, she could have at least tried to reach out ahead of time and tried to work something out with y’all.", "ESH.\n\nYou're a grown man.  Don't call anyone a B.", "ESH.\n\nYou were well within your rights to ask her to leave but \"selfish bitch\" was overkill.", "YTA - what did you think was going to be the outcome of calling one of your wife's friends a \"selfish bitch\"?  Did you think that your wife or others in the party were going to jump on that trainwreck?  Now you have to deal with the fall out from your own bomb.  You made this bed, now you get to sleep in it.", "NTA. Jane was for bringing her child.\n\nHappy Birthday!", "It was nta for me up until you insulted her for being poor, YTA", "ESH. Not for asking someone to leave if they can't find a babysitter but because of how you handled it. I can see why your wife would be pissed. Sounds like it was more of a joint party than just your birthday party and instead of handling the situation like an adult you cussed out a grown woman pretty much immediately. \n\nShe shouldn't have come if she couldn't get someone to watch the kid, but wow. What an escalation.", "Happy Birthday, yea you are the A-hole!   I get it.  Adult party ect but what’s with the added details about her personal life?  Like. The wtf? How does that and what you yelled at her make you justified?  News flash.  It doesn’t.  Yta.", "This is so painfully fake. There’s no way this is real. Or it’s written by a young teenager.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLast Saturday was my 40th birthday party. My 40th birthday is today, actually, but we celebrated it last Saturday for somewhat obvious reasons, and this Saturday isn't good for us all.\n\nMy wife and I invited several of our and her friends. It was a strictly no kids 18+ party, so we sent our kids to spend the day with their friends. While most of the guest got the message, one didn't.\n\nEnter one of my wife's friends: Jane Doe (not her actual name). She brought her eight year old child, despite the invitation saying \"NO KIDS ALLOWED\" in big, red letters. We didn't have a place to put the kids, so we reminded her of the disclaimer and said she had to either hire a babysitter, or watch her child herself (by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion). She said that she couldn't afford a babysitter and really wanted to go to my party, and that I was being \"inconsiderate\". Without thinking, I blurted out \"Inconsiderate of what? That you are a selfish bitch who is willing to take an eight-year-old to an adult-oriented party, simply because you can't afford a babysitter?\" Keep in mind, this party is an adults-only party for a reason. There's swearing, alcohol, sex themes, basically anything you can think of that kids shouldn't be exposed to.\n\nJane told me I was the one who was selfish and slammed the door. My wife was infuriated. She scolded me for kicking out Jane, telling me that I should have just let her bring her child in. I told her no because it's my party, and if I don't want to invite kids, I shouldn't have to.\n\nSo guys, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA because you called her a bitch.", "YTA. \n\nSo there's swearing, alcohol, sex themes, basically anything you can think of that kids shouldn't be exposed to. Ok, good thinking that children shouldn't be attending.\n\nThe fact you decided it was ok to not only lash out at this woman calling her a selfish bitch and you did it in front of her kid shows just how much of TA you really are.", "ESH - I agree with you that it sucks when you are very detailed in your instructions and people ignore them. However it sounds like it could have been a genuine error and it could have been handled with more grace, particularly if this person really wanted to go and couldn’t afford someone to watch their child.", "ESH.  She knew it was a no kids party and brought a kid anyway instead of asking around to see if she could share a babysitter with others.\n\nBut you're also an asshole for acting like someone having their sweet 16 and calling a guest and friend a \"selfish bitch\".", "ESH, Everybody Sucks Here. \n\nShe was aware that it was an adult gathering and should have made arrangements or stayed home. No question.\n\nBut were you already drunk when you called her a \"selfish bitch\"? It wouldn't excuse your asshole behaviour but might explain it. You're nearly 40, you should have developed some better skills on handling minor conflict like this.", "YTA\n\nYou called her a selfish bitch. YTA.", "Were you in the right? Yes. Did you handle it poorly by calling an 8 year old mothers kid a selfish bitch in front of the kid? Yes. So are you the asshole? \nFor the way you handled it, yes, YTA. Jane should not have been in attendance however and should not have brought her kid to an adult themed party.", "ESH. You were very specific about NO KIDS, and she brings her 8 year old. She didn't check with you, & since she can't afford a babysitter\\~brought her kid.\n\n You have the right to say \"No kids,\" especially in your own home. But the way you handled her showing up w/kid in tow was terrible. You're a blurter who says things in anger, and then tries to rationalize it, bro. \n\nMost people on here would say NTA to you**\\~if** you'd said \"Sorry, J. We said this was adults only and we're sticking to that.\"", "\" I told her no because it's my party, and if I don't want to invite kids, I shouldn't have to.\"\n\nNTA\n\nShe knew the rules and felt she was too special for them to apply to her.  Wife is also TAH for scolding you.", "Where drugs involved?", "Only just a NTA. Your attitude towards Jane is rather harsh. Granted, she's highly irresponsible wanting to bring a child to a party with no kids allowed for levels of debauchery that would make Nero or Caligula proud, and the child needing therapy for a decade.\nInfo do you hate Jane or is it just pissed off with the situation or both?", "NTA, but you could have been more polite.\n\nThat said, sometimes you just need to shut things down hard.", "ESH. Of course she shouldn’t have brought her kid, but jeez dude - you called her a selfish bitch and insulted her ability to pay for childcare. She knows she can’t afford it, she literally said that. You could’ve just asked her to leave. \n\nAlso your comment that she ‘refused to get an abortion’ was out of line. That’s completely none of your business and not your place to judge her decision.", "ESH. I agree with your reasoning...it's your party you can invite who you like. But you crossed the line by calling her a bitch.", ">she refused to get an abortion\n\nYTA - She chose not to have an abortion.  \n\n>Inconsiderate of what? That you are a selfish bitch who is willing to take an eight-year-old to an adult-oriented party, simply because you can't afford a babysitter?\n\nYTA - Stop judging her for being a single parent.  The situation didn't remotely call for name calling.\n\nThe tone of that makes me doubt all other aspects of your narrative.\n\nIt wasn't unreasonable to say the party was an adult-oriented one, but you could have said it politely and without the judgement.", "YTA. Not for the no child rule, not for asking Jane to leave, but for the way you spoke to her. And what's this \"refused to get an abortion\" bullshit? Everything would've been fine of she'd just done the sensible thing and not had a kid? You are a giant raging asshole. Do you have any friends who aren't men? Asking because you sound insanely misogynistic.\n\nEdited to say that OP seemed to put a lot of emphasis on Jane being a single mom and explaining why. It just came off as very unnecessary to me. Just say she's a single mom you don't have to add all the extra info that makes you seem a little unhinged.\n\nEdit 2: I forgot to add...about the OP's younger generation comment. I'm older than he is.", "NTA very inappropriate for a child to be at a party like that.", "Nope.", "YTA and a little bit of ESH.  Initially reading, I was leaning towards NTA, but\n\n>she refused to get an abortion\n\nwas really telling of your ugly thoughts and then you brought it on full force:\n\n>That you are a selfish bitch who is willing to take an eight-year-old to an adult-oriented party, simply because you can't afford a babysitter?\"\n\nI'm struggling not to say what I *really* think of such behaviors and obvious thought patterns.\n\nIf I had been the single mom, I would have called ahead to see if I could bring my child and set him up in a room with TV and books. But, in the end, yes, I would have respected the party guidelines.  But, then again, if I already knew what kind of AH you are, I probably would have just come, as Jane Doe did, just to annoy you, even knowing I might not be able to stay.", "ESH. You might have been totally in the clear except for your attitude here. She \"refused to get an abortion\"?! really, like that's any of your business! And you didn't need to tear into her with your comments. \n\nOf course she shouldn't have brought the child, but you didn't have to get nasty.", "ESH. She was wrong to just assume she can show up with her kid and it'll all be fine. But you blew up at her and that was completely unnecessary. You could have handled that way better. And your wife should probably have stepped in to handle it, being her friend and all.", ">That you are a selfish bitch \n\nESH. Yeah she shouldn't have brought the kid and no you wouldn't be TA for asking them to leave but your overall attitude towards this woman is super judgemental with the \"refused to get an abortion\" I'm pro choice but ug key word is choice. You should have handled your emotions better and kept it civil but persistent.", "YTA. You almost were in the clear, but what kind of anger issues do you have to respond like that?", "YTA, yes it was your party and someone didn't follow your rules. AH, for how you handled it.", "Man you got your head up your ass dude. To talk about a single mother as if shes less than because she had a child after the father stepped out? Its sad that you had offspring to be honest. Gonna be some wacked out people with your leadership", "YTA. It’s one thing to have a child free party, another to attack Jane like this.", "[removed]", "INFO - where was the child when you were having this discussion? Please don’t tell me that you said all of these things in front of an eight year old?", ">you are a selfish bitch\n\nPro tip: If you don't want to be an AH, don't resort to calling people names. Was she in the wrong? Yeah, but that doesn't matter if you go around calling people selfish bitches. You're an asshole just for that. \n\n>if I don't want to invite kids, I shouldn't have to\n\nThat's fine, but you're still an AH for calling her a bitch. Jesus christ man.\n\nYTA", "ESH- Yes she should not have brought the kid. She was given notice on the invitation. \n\nHowever, the way you kicked her out was an extreme over-reaction. also YTA for your comments on her \"Refusing to get an abortion.\" What happened to \"Her body her choice?\"", "ESH\n\nJane sucks for bringing her child. Having children unfortunately means sometimes missing out on fun. We are not entitled to fun. \n\nYou suck for how you acted towards her. You could have been polite and just say what you tell us: this is with swearing and sex themes and alcohol, not suitable for kids. And stood your ground, while being polite and empathetic about it. \n\nYour wife sucks for telling you you should have let the kid stay.", "The friend is 50% TA for showing up with her kid,\n\nYTA 40% since you could have handled it with a little more finesse,\n\nThe wife is 10% TA for not stepping in to diffuse the situation and send her friend home.", "ESH.\n\nYou are 40?! You definitely are acting way to jmmature for that age. Your comment calling her a \"selfish b-\" was totally uncalled for you didnt have to insult her. Yea she was wrong to bring her kiddo but cmon. \n\nAlso its not cool that you are judging her for not having an abortion and being a single mom", "Nta", "NTA\n\nThis is called having a healthy boundary and enforcing consequences when someone doesn't want to respect them.", "ESH - She should not have just ignored your very clear rule of no kids (which would have avoided this entire situation), but you did not have to escalate the way you did and call her a bitch.\n\nYou could have calmly and quietly taken her aside and let her know she needs to leave as this is not an appropriate event for a child.", "YTA \n\nNot for having an adult only party, but for calling her a selfish bitch and insinuating that she should have had an abortion. Wtf is wrong with you?", "NTA. No kids means no kids.\n\n>My 40th birthday is today\n\nHappy Birthday!\n\n>She brought her eight year old child, despite the invitation saying \"NO KIDS ALLOWED\" in big, red letters.\n\nPerhaps she's illiterate?\n\n>We didn't have a place to put the kids, so we reminded her of the disclaimer and said she had to either hire a babysitter, or watch her child herself\n\nVery thoughtful of you to convey that information to her verbally in order to work around her apparent illiteracy.\n\n>by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion\n\nYou have such a refreshingly straightforward way of putting it. I like it!\n\n>She said that she couldn't afford a babysitter and really wanted to go to my party\n\nIf she couldn't afford a babysitter then she couldn't afford to go to your party.\n\n>Keep in mind, this party is an adults-only party for a reason. There's swearing, alcohol, sex themes, basically anything you can think of that kids shouldn't be exposed to.\n\nAnd she would have been fine with her kid being exposed to all that. That doesn't reflect well on her as a parent.\n\n>Jane told me I was the one who was selfish and slammed the door.\n\nShe shouldn't have done that. If she couldn't afford a babysitter for one night then she probably couldn't afford to replace your door if she damaged it either.\n\n>My wife was infuriated. She scolded me\n\nAt your birthday party! She couldn't even wait until the party was over? What a dreadful way for her to treat you, her husband!\n\n>telling me that I should have just let her bring her child in\n\nNo, for the reasons you gave earlier.\n\n>I told her no because it's my party, and if I don't want to invite kids, I shouldn't have to.\n\nExactly. Your party, your rules, those who try to bring kids are fools.", "NTA", "NTA.", "YTA. She shouldn't have brought the child- I dont blame her for wanting a bit of time to have fun with friends. Sometimes, when you're struggling, having one or two good things you can look forward to or enjoy can help immensely, even if they're small. She still 100% should have communicated with you ahead of time about this.\n\nHowever. You clearly have some issues with this girl. There was no reason to bring up the previous relationship, you sound extremely judgy over her choice to have the child as a single mother - which, by the way, no matter which choice she made, it was her choice, and you have no right to judge her - and yes, calling her a selfish bitch, in front of your friends, your wife, and her CHILD, makes you an asshole here. \n\nThe right move here is to apologize for acting out like that. The boundary of no kids was fine to enforce, but you then decided to throw salt in the wound after, and that makes you TA.", "ESH. Jane shouldn’t have brought her child, true. But you really ramped it up to 11 by calling her a selfish bitch in front of her child. I’d even go so far as to say that in this story, you’re the bigger AH. If this happened the way you wrote it, you have anger issues my dude.", "Sex theme? Lol\n\nAnd yes YTA cause you’re clearly judgemental of her choices and spoke to her horribly! Yes, she shouldn’t have brought her child but there was no need to insult her like that.", "ESH. I can’t imagine what the purpose of insulting her was. \n\n“I’m sorry, we just don’t have a place for little Megan, and I know you wouldn’t want her to be around this adult environment. We will let you know when we do have a child-friendly event.”", "Apparently your definition of being an adult is acting like a selfish AH. Normally I'd vote ESH but YTA for having zero empathy. As someone with kids, you'd think you'd be more understanding.", "YTA. “Refused to get an abortion”? Who the fuck says that? You sound terrible for many reasons. Happy birthday.", "NTA- for wanting a a Kid-Free Party but YTA- for calling her derogatory names.", "NTA. Maybe you could have been kinder, BUT it was an adult party and exposing children to alcohol, sex themes, swearing and such is just terrible parenting. She should have left her kid somewhere else or just not go. Once you have children, you have to choose your battles and priorities. That was on her.", "ES She for bringing the 8 yo, you for acting like one.  I hope you did not swear in front of her child.  You should of just said, sorry no children allowed, its my party, my rules.", "ESH. You were winning…winning…winni—-nope, ya blew it the second you called her a bitch. So she’s wrong for not abiding by the party rules, you’re wrong for your temper and language, and your wife is wrong by not having your back when you both agreed on the party parameters (but she’s not wrong about being mad that you resorted to shitty name calling). \n\nAn adult themed party where no one acts like adults. Sounds like a must-miss!", "ESH\n\nIs it norm for you to talk to people like that? I don’t understand why I need to ask this, but here we are.", "(This is me joking) Imagine if that boyfriend that mysteriously disappeared when the child was conceived was actually OP and that's why he's so hateful towards her with \"refused to get an abortion\" and all his other harsh words.\n\nETA: I was gonna say “half joking” but changed it last second because I was scared I’d get obliterated for this 💀 glad y’all agree that OP is acting weird about this.", ">You sound like an exhausting piece of work\n\nVery much so", "\"sex themes\" 🤣", "That is, likely, the very reason she brought the kid with her instead of calling ahead and making arrangements with OP.  Using the kid already being there to manipulate things into going her way.\n\n&#x200B;\n\nTHAT is an asshole thing to do to the poor kid.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "It's been neat seeing how many people in this comment section think it's just fine to publicly demean and berate someone over something so minor.", "You're right - OP cannot take credit for that. *She* chose to leave.", "How is it a “genuine error” when Jane admits that she knows it was a no-kids-allowed party, but she brought her child anyway? Maybe OP was harsh with their words, but OP is N T A in not wanting a kid at the party", "How does that not make it ESH?", "Do bears shit in the woods?", "> what's this \"refused to get an abortion\" bullshit?\n\nI thought that too! What do you mean \"refused\" OP??? As if someone was demanding she get an abortion, wtf is that?!?", "That stuck out to me too. Who brings this up? When the child is EIGHT?\n\nI mean even to internet strangers it was irrelevant. Jane is a single mom at the moment, that was really all we needed to know.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I don't know why, but I get the feeling that he called her selfish not just because she came with her kid, but also because she chose to be a single mother.", "So calling someone a selfish bitch for not being able to afford a babysitter is enforcing a healthy boundary?", "> healthy\n\nis it healthy?", "Seriously. There is so much unnecessary info in this post, it's clear that HE feels that it's important. What the Holy-f**k does it matter that her ex abandoned her while pregnant or that she refused to get an abortion? I mean, the kid's there, so it's kinda obvious she didn't get an abortion. Also, he could've easily left it \"she's a single mother.\" I get that she was wrong for bringing her child when the party was explicitly \"no kids,\" but there were so many non-AH ways to deal with it. He went from 0-100 immediately. At the very least, he should've gotten his wife involved since it was her friend.", "This hits all the main points. When she showed up with her child, she put you in charge of telling her no even though she was already told no. She could have called and asked, or texted. Not just shown up. She WANTED you to be put in a tough place so you would feel bad (at your own party) and say yes. That makes her a b. Definitely not nice to call someone that, but wtf, she was one for showing up with her kid and putting you in that position. NTA.", "Yeah I would respect my friends wishes about their party even if I wanted to go.NO KIDS MEANS NO KIDS. That’s s rude to just show up with your kid because of course everyone wouldn’t be able to really let loose and not have to worry about an 8 year old kid overhear things. Like why would you bring you kid to an ADULT PARTY anyway. The grown up thing to do is wish your friends husband a HAPPY BIRTHDAY and say maybe next time you will try to attend.NTA", "Yeah i was with op until he mentioned the friend's decision not to get an abortion. WTF dude. YTA", "The NTAs seem like joke responses lol", "he definitely feels some kind of way about her being a single mother, for sure.", "I got those vibes too. Considering his knee jerk reaction was to call her a selfish bitch...I feel like he didn't like her before this happened. And the only reason he gives is she's a single mom.", "A respectful friend goes, “Hey, I know your invitation to the party this week says no kids, but I haven’t been able to find childcare I can afford and I’d still like to come.  Would that be a huge problem?  I’ll keep an eye on the kiddo of course, and we’ll probably duck out pretty early.  Bedtime you know!”\n\nA shitty, selfish asshole goes - welp, better to ask forgiveness than permission.  “Hey, I’m here.  Yeah, I saw the invite but I cant afford a babysitter, but I came anyway cuz I really need this adult time.  Come on, it’s not that big a deal and I already came all the way here!”\n\nThe misogynistic elements to the post are assholey, but I wouldn’t call the hostility unwarranted.  People who live by the forgiveness, not permission, philosophy will push every boundary when it suits them and rely on social pressure to be polite and not make a scene if you don’t get firm in some way.  Some people answer quiet disrespect with overt disrespect and I won’t fault that.", "Or judging her for NOT getting an abortion & using that to justify his reaction?", "No, calling someone a selfish bitch for bring a specifically   non-invited person along to am event is enforcing a healthy boundary.", "Yes completely. She’s not a bitch for not being able to afford a sitter, she’s a bitch for just showing up and demanding her kid be allowed in. He set that boundary.", "Well no but she shouldn’t have cane", ">Definitely not nice to call someone that\n\nIndeed, it's insulting to dogs to compare them to humans like Jane.", "Yeh, that comment was unnecessary. I was thinking why he had the need to point it out that not only was she abandoned buuuuut she also decided not to get an abortion…", "A respectful friend goes, \"Hey, I'm sorry you can't afford a babysitter, but it's no kids for obvious reasons.\" \\*waves around at sweary alcohol sex themes\\*\n\nESH", "\"*by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion*\"\n\nI'm racking my brains to figure out what this had to do with the rest of it...", "Both are the AH. She shouldn't have brought her kid, you shouldn't have spoken to her like that.", "I’m curious why Jane was invited in the first place, you don’t seem to enjoy her company or think very highly of her.", "It seems like you have something against this woman just because she chose not to abort her child (which is HER decision btw) and couldn’t afford to not bring him with her.\n\nYou’re not TA for now allowing children to your party, it was the responsible thing to do. But the way you spoke to her was totally unnecessary. She shouldn’t have brought the child when she knew that they weren’t allowed, but it seems like you’re judging her really harshly just because she’s a single parent. \n\nSo… YTA. If you had a bit of empathy and the ability to speak to someone calmly things might be a bit different. But the totally irrelevant information that you said about her, trying to make us agree with you, says a lot about you as a person.", "ESH\n\nShe shouldn’t have brought her child to the party.\n\nYou shouldn’t have spoken to her in the vile way you did.", "Truthfully, I think this is an E S H, but I’ve gotta give you a YTA, because even though you were in the right, you somehow managed to come across as the much bigger AH in your own telling of this story.\nI’m genuinely baffled as to why this person wanted to go to your party so badly. You sound miserable.", "YTA not for wanting a child only party but for the way you blurted out an opinion that wasn’t necessary. You didn’t need to resort to name calling, judging her choices, or calling out her financial status. All you had to say was “sorry the theme and intentions of the party aren’t conducive for a kid. We’ll plan a dinner or something next week where everyone can be included”.", "I’m just laughing because I’m 40, and he’s going on about “this younger generation” bullshit 😂😂😂😂", "Lmao dude. That edit was the nail in the coffin. This has gotta be fake. Insulting “the younger generation” on a site where you can’t remotely tell people’s ages is peak 3-kids-in-a-trench coat behavior. Not to mention “sex themes” is the weirdest phrasing I’ve ever heard. Nice try, kid.", "ESH. Kids do not belong everywhere. This was an adult only party. \n\nBut you sound like an judgemental prat.", "It’s pretty clear you are an asshole, just not *the* asshole in this scenario. If you’re wondering how we can tell, it was the unnecessary comments about this woman’s reproductive choices that gave you away. She’s wrong here, regardless of how else she manages her life. \n\nNTA", "ESH. I get that you were clear that no kids were allowed but it’s really hard for me to think that was a reasonable reaction. You could’ve just asked her to leave and told her if she couldn’t pay for a sitter, she needs to at least ask ahead of time if she can bring her kid bc of financial difficulties. Calling her a bitch was just uncalled for. \nShe for obvious reasons. She should’ve asked ahead of time for an exception and explained or just not come.", "Merry birthday!\n\nESH, but I think you suck less.  You could've handled that better, maybe not go directly to calling her a bitch, but as far as kicking her out, you're fine there.  Next time, instead of resorting to name-calling, explain *why* her behavior is unacceptable, formally.  If you do it right, they get just as embarrassed, and either are unequivocally the AH and your wife isn't mad at you on your birthday when they start swearing you out, or actually learn.\n\nAlso, who invites their wife's friend to their own party?  Like, why was she invited in the first place if she's not *your* friend?", "YTA is for the delivery of the message, not for the enforcement of the rules.\n\nThis was exceptionally shitty - \"by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion\" - Some people don't want abortions. You're not raising her kid, you're not responsible for her kid, why do you seem so bitter about her refusing to abort?\n\nYou could have simply said \"I'm sorry, we were very specific and you had plenty of time to ask us about a compromise, but showing up with your child without warning and without giving us a chance to work something out was not acceptable.\" At that point, a firm \"No, I am not willing to compromise at this point, our plans are set in stone\" would have sufficed.\n\nInstead, you lost your temper, made an ass of yourself, and made it obvious how you really feel.", "YTA for how you wrote about and spoke about her and her kid.", "You cope with conflict like an angsty teenager. You could've handle this so much nicer. But calling her a selfish bitch? Cue the sexist undertones there.\n\nSure, wife's friend fucked up. But you, you were malicious and cruel. If I had said something like this to one of my girlfriends friends for the same reason I wouldn't expect to see in her bed that night.\n\nYTA.", "YTA... not for \"no kids,\" but for going nuclear and cursing out this woman.\n\nJust curious, do you have anger management problems? I'm not saying that to be glib, that is a sincere and honest question.  Your reaction/response was so so so SOOOO over the top that I have to ask.", "YTA here. And your edit just makes you seem like MORE of an AH.", "YTA - You're gonna lose friends over this and rightly so.  The edit only makes you seem like a bigger asshole.", "For yelling and calling her a b****, you're an AH. That could have been done calmer, especially in front of a kid (who I guess was with the mom at the time). Your not an ah for enforcing your rule in general though. She should have accepted it, organized a sleepover for her child or something else instead of assuming once there you wouldn't do anything about it. That was an AH move from her as well. So ESH.", "I bet you're a real blast to have at a party. Sure, she was wrong we all agree, but you should have acted like an adult", "Sex themes and “other things children shouldn’t be exposed to” lol, he wanted a swingers party with cocaine and this kid foiled his plans. Ha.", "You sound like you have a shitty personality and voted for mango. YTA", "I mean, I have to day ESH because Jane is in the wrong, but I really really want to say YTA just because of how much worse you've made yourself sound.", "I'll go with soft YTA for you, the way you reacted wasn't the best, like telling her she can't stay and sending her home good, insulting her no good, though if she insulted you first then F her.\n\nAs for Jane she is a hard AH, there was a big red indicator telling her the rules and she decided to ignore it and come with the hopes that your wife would force you let her stay, willingly causing troubles in someone else birthday party is a pretty dick move, she could have called before to discuss this at least, also she is a single parent why the hell is she attending parties instead of looking for her kid.", "ESH you were right to ask her to leave, your party isn’t a place for a child and she shouldn’t have brought a kid. She should have just not come. It’s the anger from the post and the edit that make you a AH. You sound like a child yourself. The party is inappropriate for the kid but calling someone a bitch is a lot and you can get the same result with just saying no", "ESH.  She shouldn’t have brought the kid, but you didn’t have to call her a selfish bitch.  You could’ve held your ground in a way that wasn’t so rude.  Read what you wrote and look inward, you really sound like an asshole.", "YTA — Calling BS on the edit. There’s a difference between saying\n\n“The boyfriend left when the child was received BECAUSE she refused to get an abortion.” \n\nAnd\n\n“The boyfriend left when the child was conceived AND she refused to get an abortion.”\n\nOP said the latter. That does not communicate that the boyfriend left for that reason which shows his general attitude on children and women with children.\n\nDisgusting.\n\nThere are plenty of things that could have kept an 8-year-old occupied during the party and from the sounds of OP’s wife, others were willing to help with this. Why does OP hate children so much?", "ESH\n\nYou acted like an AH and your comment about not having an abortion is completely irrelevant to the story.\n\nShe acted like an AH by bringing a kid to an adult party when it was very clear the child was not invited.", "ESH. Her definitely for bringing her kid to a clearly adults only party. The excuse of I couldn't afford a babysitter is bullshit cause that just comes with part of having a kid. The world doesn't start and stop at your convenience because you're a parent. \n\nAnd you for over reacting to the situation. I don't think you needed to be so harsh on her and call her a selfish bitch, while I do agree that it's your party and you made it clear no kids and you should stand your ground on that. On the other hand, if you just let them in and said enjoy the party and had your sex, booze, etc themed shenanigans continue, she would be the AH for bringing her kid into that and making everyone there feel uncomfortable with them being there.", "YTA. Even if she was inconsiderate for bringing her child, you took it to another level. By just reading your post alone, and how you word it, you are clearly an asshole.", "men really need to stop calling women bitches", "Esh .  She should have called beforehand and pleaded her case and maybe ask for an exception politely rather than just showing up. \n\nBut dude, the way you worded your story is extremely problematic. You don't see it and that's a problem. \nI'm a guy and just from what you wrote I would not want to be friends with you.", "YTA. You could have had her leave without berating her", "YTA for calling her a bitch, that was incredibly uncalled for. Yes, she was wrong to bring her kid and yes, she was wrong to call you inconsiderate but all you needed to say was be that as it may, we still cannot allow an 8 year old inside during this very adult party, we'll miss you and close the door. You're response was so uncalled for im not even giving you the e s h this warrants bc i agree, no kids means no kids. You're edit drives home the YTA.", "NTA. She f'ed around and found out.", "YTA and the edit makes it even worse. Poor handling of the situation all around", "Nta, I stg parents are one of the most entitled groups of people on earth", "To be fair, Jane did start the argument by telling OP that he and his wife were “inconsiderate” for having a child free birthday party because she really wanted to go but couldn’t find a babysitter. Instead of making the adult choice not to attend, she decided to roll up with her kid and try to bulldoze her way over their boundary and into their party. So she WAS the one being selfish and inconsiderate. IMO, Jane was the one who set the tone for that conversation. It’s not fair to judge OP poorly for engaging with Jane in the same manner in which she engaged him. So, as far as I’m concerned, he’s NTA for that.\n\nBut, OP, the way that you spoke about Jane’s background was wrong and judgey. She made the choice that was right for herself in deciding to carry her pregnancy to term and keep her child. There’s nothing shameful about that. And to phrase it like “she’s the dummy who chose to have a child with the consequence that she couldn’t attend your birthday party”, was thoughtless and weird. I understand your frustration with the woman; it’s not your job to accommodate her choices. But you went too far in arguing your point.", "I can’t imagine being 40 and caring this much about a birthday party. I’m not one for telling people to act their age, but maybe try acting older than 14", "[removed]", "After reading the edit and rereading the post about the abortion in going NTA.  It is selfish to bring a kid to an adult only party.  Part of choosing to have a child is giving up a lot of your social life. Sorry i know that's not what people want to hear but it's the truth. If you can't get a baby sitter you don't get to go. Sorry that's just the way it is", "Wow,  people seem to be reading between the lines a lot here because OP said Jane didn't get an abortion and then he called her a selfish bitch which they take to mean he is disrespecting her because she is a poor single mother who can't afford a baby sitter.  Let's recap shall we.\n\nOP called her a selfish bitch for:  \n1. Not following instructions.  \n2. Calling him inconsiderate for insisting she had to follow the same rules as everyone else.  \n3. Thinking that as a single parent, she and her child deserve special treatment at someone   \nelse's event.\n\n  \nI'd say the description fit.  I also figure by then he had imbibed some adult beverages and his tongue ran away from him.  Disrespectful?  Yes.  Also regrettable and he should probably apologize to her for calling her that.  But that does not make him TA, when she's calling him inconsiderate after coming to HIS HOUSE.  She could have left quietly and not made a scene.  After spouting off the inconsiderate line, she gets what she gets. \n\n  \nEveryone seems to be ignoring her actions that precipitated this exchange.  She could have called ahead, explained her situation, and gotten an answer then and there.  No, she thought if she brought the kid, they'd have to make accommodations for her because she's already there.  Actions of the typical entitled person where rules don't apply to them.  Then she starts the name calling.  Yes she didn't call him an inconsiderate bastard, I'll grant that point.   In my eyes, if the shoe fits, wear it.  NTA", "Excuse me? F*ck right off with the attitude sir. Yeah, Jane shouldn’t have brought her kid, but you swearing at her in front of the kid is horrifying. Also your wording was ambiguous on a frankly unnecessary detail you threw in about Jane’s personal life. Insulting people younger than you because you cannot clearly write what you mean sends you straight into the YTA category.", "I’m not sure because I’m between YTA and EHS.. But I will lean more towards YTA.\n\nIs she wrong for bringing her kid, yes.\n\nHowever, the way you talked to her when she explained why she had her kid with her was really inappropriate and AH behavior, yes it’s you’re bday but you can’t be rude towards people.\n\n“How do people make this mistake? Good lord. I hope this clears things up, because this is absolutely ridiculous how so many people read this wrong.”\n\n—> It was a miss understanding because YOU typed it in a way that made us believed that way. \n\n“The younger generation really is dumber.“\n\n—> So you’re saying the younger generation (even tho a lot of people from Reddit are older and in their teens) is dumber because YOU typed that statement “wrong” or something? \n\n“Sorry I had to insult your intelligence, but this is very infuriating.”\n\n—> You didn’t HAD to insult people intelligence, you WANTED to. It’s very infuriating that you can’t accept that it’s you’re fault that you typed that statement in a condescending way. Also it’s YOUR generation that is teaching us.. you only have yourself to blame for our “stupidity” (no offense to people that actually know how to teach well and know what they are teaching).", "This post feels like a kid trying to sound like an adult. ... And now that I've checked their post history it seems I wasn't far off. OP, you claim to be 26 in a couple of your other posts. \n\nHere's a tip, offer fewer details when you lie. The more you offer, the more clear it is you're making it up!\n\nEdit: typo", "ESH: \n\nUmmm according to your post history your 13 y.o. daughter commits hate crimes and is of the goose-stepping predilection... Which is dealt with via tiktok uninstall and a lack of pizza.... So talk about parenting choices.... \n\n\nAnd you're losing your your mind and verbally berating some random lady over bringing her kid to your alcohol and sexy party... Which was obviously a bad call on her part.\n\nPeople in glass houses... Stones... Yada yada. ... also way to rage... She's wrong for bringing kiddo to an 18+ event but you have super big problems with your own parenting.", "I hate going to adult parties and there happen to be kids there ruining the vibe, especially because we love to pass the bong around. So I get it.\n\nBut YTA for name calling and not just telling her you can't let her child stay because it would be 1) inappropriate for the child and 2) it would be unfair to the other guests expecting a good adult time without having to censor themselves, etc.\n\nOP could've even let her stay a la malicious compliance and let her deal with all the questions her kid has for her the next morning. Maybe she would have realized that this party is not a good environment for her kid and left early. Then just don't invite her to adult parties anymore.\n\nThere was no need to call her a selfish bitch since she really isn't. She's just dumb and inconsiderate.", "Was that your friend, or even you, who left the woman high and dry with a kid to raise? Why the burning resentment and contempt? Seems totally misplaced and an overreaction, unless you have some stake in the child's existence, who was born 8 years ago by the way. Looooong time for you to hold a grudge. Why DO you hold a grudge against her, anyway? Struck a nerve i guess. Oh well. 🤔🤨\n\nYTA for your over-the-top reaction to a lady whose situation should be nothing to you. (I guess it does have something to do with you, though. Somehow, anyway. You made that clear.)\n\nJust tell her politely to leave and get over it.", "Wow. YTA, for so many reasons. Not for not allowing kids at your party, that’s no big deal. But screaming at someone like that and calling her a bitch when she came to celebrate your party? There was evidently a child at the party - a 40-year-old one who threw a tantrum because he didn’t get what he wanted.\n\nAlso, regarding your edit on her refusing an abortion. Yeah, dude, that was super unclear. Maybe before insulting everyone get a better grip on English grammar. Although you seem to make it a habit of insulting people who don’t agree with you or do what you want.\n\nHonestly, man, you sound straight up like an arrogant bully. Maybe some introspection is in order here.", "YTA for this comment: “…because this is absolutely ridiculous how so many people read this wrong.  The younger generation really is dumber…[blah blah]”\n\nIf so many people read it “wrong”, perhaps the issue is with the writing, not the comprehension…particularly when you ACTUALLY wrote “…left her when the baby was concieved (sic) AND she refused to get an abortion”.  I’m afraid to say it, but this reads as if it’s a judgment.  \n\nAlso, you wouldn’t have been an AH had you not been so horribly rude to Jane (as well as your fellow redditors)\n\nSincerely, \nNot the younger generation", "hey dick, i’m 73 and read your nasty commendation just fine.  i am surprised you have enough friends to bother with your 40th. while i agree she shouldn’t have brought her child, i think you are awful.  yta.", "YTA. You’re a 40YO man throwing a fit like a petulant child about his birthday party. Not cool to bring a kid on the mom’s part but you could’ve handled it like an adult instead of the aforementioned 8YO. Also men who call women “bitches” willy nilly nearly always have anger issues. Seek therapy.", "NTA! NO KIDS! That was clear. Why does ANYONE beside the host get to change the guest list? Yes..you were a bit rude, but the friend was rude first showing up with the kid. If she was there with no kid--- no problem--- no rudeness. You responded to rudeness with rudeness. OK in my book.", "You’re a massive A H. YTA. Not for telling Jane that she couldn’t stay, but for the WAY you told her, which was unnecessarily rude. Even your post here is incredibly rude. \n\n**Btw, there isn’t an issue with the readers, but with your writing. Here is the sentence you needed: “Her boyfriend left her when the baby was conceived *because* she refused to get an abortion.”** You’re welcome.", "And you shouldn’t insult people because you think only the younger generation took what you wrote wrong about the abortion I’m in my 50s and I didn’t get clearly what you were trying to say. So maybe next time work on your sentence structure to make it more clear.", "I mean, you sound like an asshole in general", "NTA, you're right, some folks on here have difficulty with reading & comprehension.  Jane Doe chose a party over staying at home with the kid, she showed her priorities. I totally got why you stated her history, I know you're not slut shaming, but you know there are some folks who are single parents & take offense at what you said. Yikes", "Apparently unpopular but NTA. No kid party means NO KIDS. You could have approached it better to get her to abide by your rules, but NTA for having a no kid party and NTA for enforcing it. Kids should not be around all those adult themes and the mother would not have a good time watching her 8 year old and keeping them away from the alcohol, weed, and anything else y'all were doing that evening.\n\nYou could have been kinder. I don't know how she was acting leading up to you feeling the need to call your friend a bitch, but in my experience it's always better to take the high road, stay calm, and stay firm. That way no flack can back into you and make you the asshole. Because you also got heated, slight YTA. \n\nAlso it was for you 40TH BIRTHDAY. A HUGE DAY! very rude of the mother to bring the kid along when you were explicit from the beginning was 18+ only", "NTA. Your party, your guests, and your rules", "NTA.\n\nyou're at your house, which is flagged as an adults only party.  If she wants in, she follows the rules.\n\nWho cares about how you said it - that wasn't the question asked.", "ESH. She shouldn't have brought the kid and you shouldn't have gone straight for the jugular by calling her a selfish bitch.\n\nHowever, judging by your edit it's fairly obvious you're just TA in general. The way you worded your story made it seems judgy of her decision to not have an abortion. You didn't write 'because' initially. Instead of 'oops, my bad' and clarifying, you go off about the younger generation being dumb??? We are the same generation. You wrote that poorly honey. Are you always that condescending when you're the one who has made the mistake?", "NTA. She is being inconsiderate of everyone else by bringing a child to an adult party. You even sent your kids away", "NTA. She clearly made the choice to IGNORE the fact that the party was adult only. She made the choice to ignore that, anything after that is her fault. Do not know why your wife would have scolded you for the act of kicking the friend out if she was aware of the adult themed nature of the party. Did she want a child to be exposed to things it shouldnt as well?? Seems odd", ">Keep in mind, this party is an adults-only party for a reason.\n\nLove how you're justifying your actions.\nYTA. \n\n>The reason why I called her selfish was because she chose a party over her kid. Sometimes you have to make sacrifices. I did that with my kids.\n\nYeah you have the means to pay for a babysitter and you're also not a single parent. You wouldn't understand. She's human and wants to enjoy too. What's to say she wouldn't have looked after her own child?", "INFO: do you have an \"abrasive\" history with Jane Doe?", "I'm a few years older than you. Your use of the conjunction \"and\" rather than the use of a cause and effect structure is why people are confused by your statement about abortion.\n\nBut your tone and disgusting reaction to everything makes YTA. You sound exhausting, and it's no wonder there needs to be alcohol at your gatherings.", "NTA for kicking her out.  It’s your party you can cry if you want to. As someone who goes to the no children party the last thing I want is some asshole with a kid showing up while I’m stoned or drunk. \n\nYou promised the adults a safe place to be adults and let loose.  \n\nThe rest of your actions and statements range from ESH to YTA.", "ESH. She knew better and you should have known better than to say those unnecessary insults.", "NTA for enforcing your no child boundary, but the way you spoke to her is absurdly assholish. Additionally, your wording on the abortion is ambiguous at best and does not in any way lead to the conclusion that the refusal to get an abortion was the reason the father left. It quite clearly conveys that you believe she made a terrible decision and that you do in fact judge her for her for it, as it is otherwise irrelevant information. \n\nMaybe these youngins really are just dumb, but it sure seems that there is at least some truth to it and you just don't like the way that conclusion makes you look.", "YTA. Wow. \n\nA) you’re not the AH for not letting children into the party (and consequently their parents) but YTA big time for how you did so. Insults were absolutely not necessary. Especially considering there was zero attempt at calm communication before this. I know you said you “blurted it out without thinking” but if that’s how this easily solvable situation caused you to react you have some other issues going on. \n\nB) I can see that you’re just an all around asshole from your edit. You worded that sentence VERY poorly in your original post. “And” implies a related but different thought. You pointed out your own mistake in your edit by writing the correct word in all caps. People weren’t reading it wrong. You wrote it wrong.\n\nC) you did not HAVE to insult anyones intelligence. It says a lot about your own intelligence that the only thing you have shown this whole post is that you immediately go to insults when you’re inconvenienced. Sorry you’re mad that this sub called you out but that’s literally what it’s for.", "Yta", "I'm older than you and think YTA. Does that help?", "YTA\n\nIt was inconsiderate of her to bring her child to a no-children party, and not kind to call you inconsiderate for enforcing your stated boundaries.  These are social faux pas of a thoughtless person but if this meets your bar for asshole you must have a hard time interacting with people in the world.\n\nYou, on the other hand, chose not to say \"I'm sorry that you were unable to get someone to watch your child, but this party is not child-friendly. Thank you for wanting to celebrate with us but you need to take your child home\" and instead called her a selfish bitch.\n\nShe could have chosen better, but you were an asshole.\n\nAlso, how she became a single mom is super irrelevant, and abortion is an obviously heated topic. I don't think it's reasonable of you to expect us to assume you are so oblivious as to not know that.", "YTA\n\nNot for refusing entry for swearing at her, infront of her child... You could calmly say oh so grown ups only and close the door.\n\nCalling her a selfish B was way over the line", "YTA not because of saying no kids or asking a person to leave when they didn't respect your rules but every word you typed screamed \"I'm a giant asshole\" and your edits only make you sound worse", "YTA. Actually, not only are you \"the\" asshole, you are \"an\" asshole. It's frankly surprising that you've made it to 40 thinking it's ok to talk to/about people like this. Fuck is wrong with you?", "Wouldn't leaving her kid at home be choosing the party over her kid? Don't really get your point there. ESH, her for not following a basic rule and you for calling her a selfish bitch to her face. Also the abortion comment was completely unnecessary. You could've just said she's a single mom who can't afford a babysitter and leave it at that.", "ESH. Jane sucks for bringing her eight-year old child without prior notice to a party she knew would be adult themed. You, OP, suck most of all for the pretentious way you talk down about others, belittle them, and insult their intelligence. It's not the fault of your readers you did a poor job explaining the circumstances behind Jane's story.\n\nFurthermore, why does it matter about how the father of Jane's child isn't involved in their lives? You could have said that the father wasn't involved in their lives and omit the personal details. What you did was a final blow to Jane in an attempt to justify your terrible behavior. You're not adding that information since it's relevant, you added it for an additional way to hold something against Jane.", "I can tell your an asshole just from your post", "Yta not only for how you talked to her and treated her. But for how you are talking down to us making it sound like we are all idiots and way beneath you.", "NTA. It's his party an he can cry if he wants to.", "I think the way you handled it makes you the AH. You could have handled it with more tact and decency.", "YTA. Justifiable in being annoyed with her bringing her kid and telling her that he wasn’t allowed, but you handled it like an ass.", "NTA for kicking her out, but YTA for how you kicked her out. You don’t have to call someone a selfish bitch, seriously. Could’ve easily just reiterated, “I appreciate your eagerness to come and celebrate, but unfortunately, the invitation still stands. There will be no children allowed tonight due to the adult nature of this party. I would love to have us and our kids get together some other night for something more family-oriented.”", "The crack about not getting an abortion was really low. You could have let her know that there are no exceptions, and she needs to find a babysitter without the shitty cut downs. That being said, both you and her are AH. You, for talking to someone like that, and her for assuming that the no kids clause was meant for everyone but her.", "Hey dickwad in ur edit u come at people for failure to read when u write “…when the baby was conceived and she refused to get an abortion”, but this is awful phrasing and it’s ur own pathetic writing that causes the disconnect between what people think and ur initial thoughts.", "YTA like just in general you seem to be an A", "YTA for rudeness, you could have handled that much better.  Also, a writer saying \"so many people clearly can't read\" is a writer who can't write.", "Contragulations. Nobody will EVER remember she brouth her kid, which was a rude move; everybody will remember the tantrum you threw at a woman IN FRONT OF HER 8yo CHILD.\n\nYou humiliated a woman, called her selfish bit\\*h, in front of her daughter.\n\nThere were A LOT of ways to handle it better, but you chose to yell at a single woman who wasn't able to defend herself while you screamed like an [AH.](https://AH.You) You wanted to be a macho man, ended beign this tiny little human who can't talk like an adult (maybe that's why you were so obssesed with an \"adult\" party?).\n\nAre you the father?, because you seem obssesed with her sex life and what she chooses to do with her body.\n\nYTA. You are violent, a jerk and mysoginistyc creep.\n\nETA: Went through your post history, you are the dude that wasn't angry when your daughter vandalized her school with ANTISEMITIC insults and was just worried for a meeting and whose wife was mad the kid got punished. Disgusting.", "Dude, I’m older generation and I don’t get why the abortion thing was brought up. No need to scold the younger generation when the words “single mother, father not in the picture” would have sufficed. You obviously have an issue with a procedure that would have been preformed 9 years ago, or you would not have brought it up.  I didn’t think you were the A H for stressing your party was adults only, but the way you handled the situation and the way you are “explaining yourself in the edits” is definitely A H territory.", "NTA. You come off as kind of dickish, but in this instance, Jane Doe was the asshole. She absolutely would have lawned her kid off on someone else claiming she needed a break too", "YTA. You could have just said “hey the invitation said no kids because this is an inappropriate place for kids. I’m glad I got to see you but I will have to ask you to leave”. Not this wild tangent that you went on with her. Plus you’re arguing with everyone who says YTA and insulting people in your edits. What did you even want out of this?", "You’re calling the younger generation dumber but you need to rephrase that shit right because it literally says “boyfriend left her when the baby was conceived and refused to get an abortion” like that’s going to make sense 🤣 should have said “because she refused to get an abortion” you dummy. Also I really hope you didn’t blew up in front of that innocent child", "YTA and your edits do not make it any better.  Sperm donor is an asshole too. Gross.", "Lol, your first edit. I didn’t read it as you shaming her but I did re read the part after reading your edit and it goes as followed, “by the way she’s a single mother, her boyfriend left her when the baby was conceived and she refused to get an abortion”. Let’s focus on that one word there AND. Not ‘because’ but AND. My impression of this was that he had already left AND she then refused to abort it. Not that he left BECAUSE she refused to abort it. I’m 37, so it’s not the younger generation here misinterpreting you, it’s you not making your story clear enough. I agree, I saw nothing in there suggesting you were shaming her. Though maybe they came to that conclusion because it was a random unnecessary detail in your story from their perspective.", ">Jane Doe (not her actual name). \n\nThanks, Captain Obvious.", "People from your generation might remember this clip…\n\nhttps://youtu.be/kGWuOAgU7jI\n\nI think it sums up the situation nicely.", "I’m gonna say OP is the AH based off of how he speaks to/insults people, and that alone.", "YTA. Was she wrong to show up with her son? Absolutely. Were you within your rights to refuse admittance to her and her child? For sure! But here’s what made you TA—\n\nYou called Jane “a selfish bitch” in front of her child! All you had to say when she tried to get in was that you were holding firm to your decision, but you went so low. It’s clear from your word choice that you do not like Jane because I can’t imagine devolving into misogynistic name calling and swearing at someone I considered a friend over a party. Your wife is correct in being angry with you.", "NTA. The notifications were clear.  She didn’t have to come.  Maybe leave out her life story, it just confuses people and is unnecessary.  She took her child to place that was inappropriate.  It was your party, not hers.  Adulthood means sacrifices sometimes, if you can’t get a sitter you can’t go.  If you have to work in the morning you can’t get hammered tonight.  It is rude as hell to show up with your kid at a place where kids shouldn’t be.  Looking at you lady with crying baby in the r rated movie.", "YTA and I am a lot older than you so I understand what you were saying before the edit and you came off sounding like an ah. After the edit you came off sounding like a huge AH.", "I think your wife probably told Jane she could bring her child. NTA", "NTA\n\nIdk wtf this sub is on but it’s an adult only party. Jane can kick rocks since she didn’t want to hire a babysitter. It’s an adult party, for an adult. Y’all don’t want to have to be kid friendly so you shouldn’t have to be. Your wife can kick rocks too", "Your initial abortion sentence was repeatedly misinterpreted because it was poorly written. I think the aggression in your edit speaks volumes about your character. \nYTA. You were rude to her and you're rude in your edits.", "NTA \n\nShe shouldn't get special treatment have your birthday the way you want.  You are not responsible for her social life & managing how to include a child.  Your wife knew she should help get a babysitter if she wants her to come.  \n\nHappy birthday your wife needs to let you be centre of attention for your day & her friend should never have been your problem at all.", "NTA", "> she refused to get an abortion\n\nNTA in terms of being allowed to decide who can go to your party and you had said no kids. Massive AH for how you spoke to her and your language here is a massive 🚩", "As the saying goes “You can right at the top of your lungs, but your still wrong.” YTA for calling her names and that unnecessary comment about abortion.", "NTA - you stated it was a child free party. Not your fault she can’t respect your boundaries.", "**YTA**\n\nFirst off the abortion comment is completely an asshole thought to even have. That's completely irrelevant 8 years later, move on, mind your own business.\n\nSecond cussing at her and just being rude to a \"friend\" is being an asshole. \n\nKicking her out is completely acceptable, however your approach is assholeish. You need to apologize to this woman for being so rude to her.", "YTA for a couple reasons. \n\n1) not for kicking her out but for the hateful words you used when doing so\n2) and for calling people dumb who didn’t understand your badly worded sentence regarding the abortion.", "YTA.  Not because you were wrong that she shouldn't have come with a kid,  but for what you said to her, and what you posted here about her son (\"she refused to get an abortion\")\n\nThat's some really petty, nasty stuff to say about someone who didn't follow party invitation etiquette.", "YTA. Yes, she shouldn't have brought the child there, and yes, you were right to deny them entry, but surely there was a better way of handling this without insulting her. You could have asked your wife to speak with her. \n\nThis \"*it's my party, I can do what I want to*\" vibe coming from a 40 year old is a bit over the top.", "YTA for your reaction to Jane.  Why do you have to escalate immediately to calling her a dumb bitch?  \"Sorry, you are going to have to leave.  The invite clearly stated no kids allowed and this will not be an approprite envrionment for kids.\"  It's not that hard to put a thought like that together.  Trying a little critical thinking next time before you immediately escalate to calling someone names and getting aggressive.", "YTA for the way you spoke to her and for your edit.  \nWas Jane in the wrong? Yes. Were you more wrong for calling her a \"selfish bitch\"? Absolutely.  \n\n\nBut based on your edit, I can tell that you are rude and condescending in the way you talk to and treat most people in your life. I am part of your generation, sir, and even I understood your initial explanation to mean that on top of being left by her boyfriend after conception, she refused an abortion, and for that, you were judging her choices. Commas can be crucial and it appeared that you were listing off her flaws, rather than explaining to us that the reason he left was her refusal for an abortion.\n\nYour post/comment history highlights past issues with communicating what you mean on reddit. Take a breath, re-read what you wrote, and take time for self-reflection.", "YTA.\n\nI was about to say n/t/a, but you were abusive to her. You could have just said, \"Sorry, but I meant it when I said no kids.\"", "YTA just for how you handled it. Jane should have spoken to you or your wife before arriving to explain the situation so that you could have said “hey, would love to have you here BUT this party is not safe or appropriate for kids.”", "“The younger generation really is dumber” \n\nNo you.\n\nI’m in my mid-30s, we are of the same generation and it absolutely can read that he left  when she conceived - new topic - she refused to get an abortion. It easily could be read both ways and it’s on you, the author, to write it in a way with only one meaning.\n\nHonestly your attitude here would be enough to make YTA, but you already were TA from your post.\n\nThe issue isn’t having a child free party or asking her to leave. It’s they you asked her to leave. It’s the way you so easily called her a “selfish bitch”. Honestly wtf.\n\nEdit: Jane sucks for not following the rules but your assholery is so large that it eclipses hers so I stand by my YTA judgement", "NTA - No kids means no kids. If you can't afford to go somewhere then you don't f#\\* go", "YTA\n\n>her boyfriend left her when the baby was concieved and she refused to get an abortion\n\nThat's none of your business. She's not required to get an abortion.\n\nIf you had handled it like an adult and politely asked her to leave and left out your judgy views then I would have a different verdict.", "YTA for swearing at her in front of her kid. Real mature there.", "YTA\n\nyou should learn to think before you speak", "YTA. You sound like you wouldn't be much fun at parties. Jane was probably better off.", "WTF does Jane being a single parent who “refused to get an abortion” have to do with any of this? Sounds to me like this was an excuse to punish her for what you perceive as her bad life choices, which are in fact none of your business. \n\nAre you really asking if you’re the asshole for calling your wife’s friend a selfish bitch? Because yeah. YTA.", "Jane sucks for not respecting the clear rule. But YTA big time in your reaction. Asking her to leave would have been fine. But that’s not what you did. Sounds like you made a bit of a scene and maybe ruined a relationship. \n\nI don’t enjoy children’s company most of the time either. But what was that actually about? Was it just that one thing Jane did at your party? Or is there more to this story? Because the reaction does not match the crime here.", "YTA for the way you speak about other peoples lives. I hate to insult your intelligence, but your edit made it worse, not better.", "Must be fake, or you really are a right prick. YTA, obviously.", "YTA - you ok dude?", "NTA and not even close. \n\nPeople think that having a kid entitles them to be where they want, even though it was made abundantly clear that no kids were allowed. I think OPs anger was justified; Jane has no reason to say he’s being inconsiderate.", "NTA. It’s bold of her to call you inconsiderate when she INCONSIDERATELY brought her child to a party that children were specifically not allowed at.", "YTA not for kicking her out of the party, but just in general you sound like a huge AH", "Clearly YTA ….twice over.  He makes an edit, blaming and insulting people saying “they can’t read”.  He totally has missed that people clearly read his wording.  “ she refused” he wrote and does not understand what’s wrong with that.  I wonder if he understands the word misogynistic\n[ mi-soj-uh-nis-tik, mahy‐ ]\nadjective\nreflecting or exhibiting hatred, dislike, or mistrust of women.", "YTA and it seems like you have a history of being an asshole according to past posts. You may be 40 but you have the emotional control of a toddler.", "NTA", "Your parents didn't get an abortion and look how you turned out, I believe it's called transference.  Her bringing her kid to the party because she couldn't afford a sitter isn't the worst thing, the way you handled it is. YTA", "NTA- and your wife should have asked HER friend to leave, you never should have had to even address it.", "ESH", "YTA. You wouldn't have been the asshole if you had kindly asked her to take her child home, but the way you spoke to her is entirely disproportionate to the situation, and frankly really mean. She was the asshole until you opened your mouth, but you should be embarrassed to be a 40-year old who would call a woman a bitch and shame her for her finances.", "NTA on a technicality. You have every right to have a no kids party. But your reaction.... Yea not cool man. If you had asked aita about the way I kicked my friends wife out i'd have a very different answer.", "Your language wasn't great, but overall, NTA. \n\nI'm not making judgments about her as a single mom, but as a single parent, sometimes you have to miss things.  Hell, you sent your own kids away, but she thought her kid was an exception.  She was being ridiculous.", "YTA based strictly on how you represented the situation. You have every right to not allow kids at your party however, calling her a selfish bitch and commenting on how she didn't want an abortion makes you an AH imo.", "NTA for \"kicking her out\", who the hell knowing brings a child to an adult party without at the very least asking permission of the host, but Y T A for how you told her to leave. Even if you were already drunk, that was still harsh.", "NTA\n\nNot at all. You turned 40! Congratulations and Happy Birthday! \n\nYa see, this is how an invitation works. \n\nPerson extends an invitation. Invitation sometimes stipulates criteria, ie; black tie, masquerade, BYOB, child free.\n\nInvitee receives invitation, and if they decide to attend, they comply with the criteria stated in the invitation. It is that simple.", "ESH She’s the bigger ah of course for ignoring the invite and thinking she gets special rules. You’re an ah for the way you spoke. There was 0 reason for calling her a bitch and it was disgusting of you to do so.", "No...you shouldn't have had to remind Jane but neither did you have to make such a big deal of it.  You turned 40...NOT 4.", "ESH\n\nYTA for saying “she refused to get an abortion” like you’re offended that she decided to have her child. \n\nIf someone decides abortion is right for them, that’s their decision, but it’s also her right to have her baby. It sounds like you personally resent her child or her decision to be a parent for some reason. Maybe you were buddies with her ex or something, and he’s cheesed off that he has to pay child support now? I don’t know, and it’s none of our business, but just know that came across poorly, and gives the impression you resent her priorities. \n\nShe IS rude for bringing her kid - she does need to understand that she can’t just ignore the host’s decision and that if she legitimately can’t afford a babysitter, then she will unfortunately miss out on some stuff. She especially shouldn’t just show up with the kid and hope no one says anything - and then be offended when told no. But regardless , you should have been kinder about HOW you went about addressing the situation.", "NTA", "NTA - you sent your own kids away.  Why would your wife and her friend think it was okay to bring her 8 year old.\n\nYour party, your rules.  Which were made very clear on the invitation.", "NTA", "NTA. She was wrong and you were at the end of your rope.", "Your definitely an asshole, but NTA for this specific situation.", "NTA. These people are pulling words out of context.\n\nHe didn't say she should have gotten an abortion. He said she chose not to abort.\n\nHe didn't call her selfish bitch for having a kid. He called her selfish for choosing to come to the party when she knew she couldn't bring her kid and did so anyway.\n\nHe is right, if she couldn't afford a sitter or find someone to sit, she should've accepted it and stayed home.", "NTA\n\nIf you let her in she would have complained about what she exposed her kid to by forcing it.\n\nHappy Birthday.  I hope your party was a blast", "As a single mother myself I understand her need for adult companionship but when an invitation clearly say no children, I either don’t attend or find a sitter. And if I can’t afford a sitter? Then I don’t attend. Case closed. My only issue with this is your choice of words being used in front of the child. Your wife shouldn’t be upset with you. The friend is the one she should be upset with. Knowingly bringing a child to an adult only party, that includes drinking and sex games, makes her a poor parent. And what would have happened to the vibe of the party if you had let the child in? Everyone one else would have become instantly uncomfortable, upset because they had made arrangements for their own children and most if not all of the activities would have changed or not happened at all. For the record NTA", "NTA at all, it's your party and it's not your fault your wife's friend can't read, simple as that 🤷", "NTA. Rule clearly laid out. Her thinking she deserves an exception is a joke.", "ESH", "ESH: You are not obligated to accept the kids but also have to understand it's hard for single moms who dont have a net of family and friends to help her. That being said; she didn't deserve harshness, and she wasn't rude. She brought her kid in the hopes you would accept. You could just have said no. Instead you judge her on not getting an abortion (which is 100% HER CHOICE) on being a single parent when it's not her fault a man jumped out after discovering the pregnancy and judging her on not having a good income.\n\nShe also shouldn't have brought the kid at all. Her idea was 100% on pressuring you on letting her in. If you don't have money for a babysitter and no one can watch your kid, you should stay home. One thing that, while not the exact same but close enough, when I was a kid I was way poorer than I was. The first thing my dad did when things got hard was cut unnecessary stuff. No buying toys, not going out, no restaurants. Unfortunately, when you need it, you cut stuff to have a minimum dignity. She should have done that, should have not gone to the party, but she chose to pressure you with her kid.\n\nThat's why ESH, you are rude without necessity. She is inconvenient and manipulative.", "ESH. She never should have showed up with a kid or insisted on staying. She is TA. You had about 20 acceptable ways to let her know she couldn’t stay with a kid. Instead, you were an absolute jackass. You’re TA. \n\nAnd dude…you’re 40. Hearing a grown man get picky about ‘it’s my party and I’ll cry if I want to’ is just pathetic.", "Esh but honestly you the most, you sound like such an ah it’s not even funny.", ">Without thinking, I blurted out \"Inconsiderate of what? That you are a selfish bitch who is willing to take an eight-year-old to an adult-oriented party, simply because you can't afford a babysitter?\"\n\nYTA for the way you said it, and based on the way you phrased it, I think you already know that.\n\nIt's not that you weren't within your rights to insist she either find a babysitter or not attend... but you were way more of an AH about how you approached the problem than you needed to be.\n\nExtra AH points because the way you phrased the question is misleading.\n\nETA: And any man who calls a woman that is automatically an AH, barring extremely extenuating circumstances, and buddy, these weren't that.", "I am someone who’s pro choice and completely for abortions and still think you’re a huge AH. Pro-choice means just that, it’s a *choice*. Ya she shouldn’t have come with a child to your party but where do you get off talking to her the way you did? Hard YTA", "ESH. You’re a jerk for talking to her in such a rude way and potentially in front of her child. And also very immature. She’s an idiot for bringing her kid to an adult only party And thinking that you would automatically accommodate her when you didn’t even accommodate your own children!\n\nYour wife is the only one who is not an AH because you did cross the line the way you spoke to her friend. You sound insufferable. I", "ESH.", ">by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion\n\nwtf?", "ESH.  It’s totally reasonable to have a no-kids party, and she should have respected that.  But you went 0-asshole in .5 seconds, man.  Your reaction was over the top and uncalled for.", "ESH, but mostly YTA. Yep, Jane definitely shouldn’t have come and brought her child. It’s unfortunate, but given the circumstances, she should have recognized that she’d have to miss out.\n\nBut you surrendered the NTA as soon as you chose to handle this situation by publicly calling her names, taking a cheap shot at her financial status and yelling. You surrendered the higher ground when you could have politely and discreetly reinforced your boundaries without humiliating her and, in doing so, your wife.", "ESH\n\nYou explicitly said 'No Kids' on the invitation, and Jane ignored that. She is TA for that.\n\nYou are TA for the way you spoke to her.", "Wow, a 40 year old princess\nYTA, get over yourself.  You had the opportunity to really help someone, single mom who desperately needs some adult socialization but you could not see that through your ME ME ME goggles.\n\nGrow up dude, you acted like a child on this particular day.  And your reference that its her fault for having a baby shows this is probably systemic behavior.", "ESH.\n\n Jane, obviously, for disrespecting your party rules, and you for the way you talked to (and about) her.\n\nHad you said \"no, this event is exclusively for adults, please leave\", you'd be in the right, but you handled this the wrong way too.", "No children at a party, no problems with that....but you're definitely an asshole. Just how you speak, calling her a selfish bitch. She refused to have an abortion? Also Jane Doe (not her real name) no shit dummy. YTA", ">Without thinking, I blurted out \"Inconsiderate of what? That you are a selfish bitch who is willing to take an eight-year-old to an adult-oriented party, simply because you can't afford a babysitter?\"\n\nYou did this while there was an 8 year old??\n\nYTA!", "For the sole issue of kicking her out when she very clearly and very knowingly tried to circumvent the rule NTA.\n\nBut dude… yeah you an asshole.", "YTA - not for wanting a adults only party but the way you talked about to her\n\nShe can’t afford a babysitter, she just can’t, simple as \n\nAlso the “ refuse to get an abortion” thing\n\nI’m as pro-choice as they come and yet that just…doesn’t sit right, it’s almost like you don’t approve of single mothers or something", "YTA - what’s selfish about being poor? Why does it make her a bitch that she hoped she’d be allowed to join her adult friends despite being poor and a single mother. You could have nicely and politely explained that the party really wasn’t suitable, said you’d love to catch up with her when she had some free time etc But no. You had to throw it in her face that she’s single with clearly no support. 40 going on 14, learn some empathy ffs. You absolutely don’t have to have a kid at your party but her actions in no way warranted how you spoke to her.", "ESH. How could you think someone who said exactly what you said wasn’t TA?", "ESH. \n\nShe sucks for bringing her kid to an adults only party. That was an obvious faux pas. \n\nYou are an ass for even bothering to bring up the facts that she is a single mother, why she is a single mother, the fact that she didn't want an abortion, or *any* of that.  None of it is remotely relevant **EIGHT YEARS AFTER SHE HAS ALREADY HAD THE KID**. You bringing it up definitely looks like an agenda thing here. All that mattered was that she wasn't supposed to bring him to your party, and should have sat it out or talked to you and your wife ahead of time.", "ESH \n\nThe no child rule is fine. The way you spoke to her? Not fine. In fact, the way you framed this is really weird (\"refused to have an abortion\" ????).", "YTA for your edit", "YTA x a million. Sure, she shouldn't have brought the kid but what on Earth made you swear at her and be so rude? And now you are defending yourself in the edit by insulting us too. Great look.", "Was the child there when you were so insulting and vicious to the mother?  I totally get that she’s disrespectful for bringing her kid, but don’t talk to people that way. It automatically makes you an AH", "Definitely could have worded what you said to her better, but she also should have not brought the kid. NTA for kicking her out but YTA for calling her a selfish bitch.", "YTA. You just proved why too about how she’s a single mother and she said she either had to get a sitter or watch the kid herself. Instead of berating her you should’ve said “oh well so-and-so is watching our kids. Why don’t I see if they can watch your child too?” Or how about “okay we’ll let him play in the kids room and check on him now and then if you really couldn’t find a sitter”. You didn’t have to call her a selfish bitch for not being able to AFFORD a sitter. If you really wanted no kids allowed you should’ve understood not everyone is as fortunate to be able to find or afford a sitter and made accommodations. \n\nAlso 1) how old are you now? Cause it seems like you’re trying real hard to relive your 20s and 2) dude re-read what you typed. It was real easy to mistake what you said about her bf and the whole abortion thing. The “and” in that sentence can easily imply that you judge her for not getting one after her bf left her when you could’ve said instead “the bf left because she wouldn’t get an abortion”. Learn some grammar and actually you’re just an a-hole in general with some serious anger issues.", "This dude was asking if he was an AH for not taking his daughter to get pizza about a month ago. I sense a theme.", "Info\n\nDid you call her a selfish b in front of her child?", "ESH\n\n\nYou didn't have to call her a bitch though", "You could’ve pulled her aside and asked her to leave. Didn’t have to say what you said.", "NTA for uninviting her but YTA for the words you used. Unnecessarily rude.", "ESH", "YTA for the way you spoke to Jane. Is the name-calling really necessary? Because you certainly aren't acting like an adult. I think you have some sort of superiority complex, (1) from the way you spoke to Jane, but (2) the way your edit is worded. If you think so poorly of the younger generation, why are you posting on a website with so many people in the younger generation? Yea, Jane sucks for bringing her kid. I was with you on that, until I read how you spoke to her.", "YTA. You’re a 40YO man throwing a fit like a petulant child about his birthday party. Not cool to bring a kid on the mom’s part but you could’ve handled it like an adult instead of the aforementioned 8YO. Also men who call women “bitches” willy nilly nearly always have anger issues. Seek therapy.", "YTA. just because it's your birthday doesn't mean you get a pass for being an asshole.\n\nyou could have asked her to leave, told her that there'll be alcohol and adult-centered themes everywhere, but calling her a selfish bitch crossed the line", "YTA. Jane sucks for bringing a child to an adults only event, but YTA for how you spoke to her, YTA for the weird needless blather about why she's a single mom, and YTA for your ridiculously boomer-ish edit. \"AITA for coming across judgmental and misogynistic? No, it's the children who are wrong.\" LOL You're a hoot.", "Would have been an ESH if not for your edit, now it's YTA. You sound like a person that can't admit faults. You can't even admit you wrote a confusing sentence and are blaming it on the \"younger generation\" when you don't know any of our ages?\n\n\"by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion\". And does not mean the same thing as because.  Sounds like you're the one that needs to grow up my man.", "YTA for the way you handled it. It would have been as simple as enforcing the boundary of ‘no kids allowed because it’s not going to be age appropriate’. There wasn’t any need to go for name calling.\n\nWhich you’re also apt to do in your self important edit, you sound like a chore to be around.", "ETA, could have handled it better.", "YTA for how you spoke to one of your wife's friends, and you're also YTA for bringing up the abortion thing as if it was relevant, then saying all the younger generation is stupid when it's just you being a major asshole lol", "YTA, but for so many reasons and I can't pick just one.", "Ah so the way the abortion bit was initially phrased did make it sound like you were shaming her for not getting one. If you’d put that the father wanted her to get an abortion and she refused, that would’ve prevented that :) I think that’s why people got confused. \n\nESH, I think. Sorry. She’s an AH for bringing her kid despite the NO KIDS note and also not asking you beforehand. And you’re an AH for the way you spoke to her. I know that it was the heat of the moment but you shouldn’t have spoken to her like that 🫣", "Yta\n\nDamn you sound like a proper catch.\n/s", "Who cares this much about a birthday party after the age of 16?", "NTA for not allowing her to stay. The way you spoke to her was a bit harsh - especially in front of her kid - but I don’t blame you for being annoyed.", "INFO: You updated the post to explain why you called her selfish. Do you realize most people here are calling you outl, not for that, but for calling her a bitch? Was her child with her when you called her that?\n\nYou're not the AH for kicking her out but you're the AH for just about everything else about this story.", "ESH\n\nShe shouldn’t have brought the kid. And you would be completely right to refuse the kids presence. BUT\n\nYou used the first excuse you had to call her a bitch in front of her 8yo kid. WTF man? You couldn’t at least try to be civil first?", "To me it seems like an explanation of the friend’s financial situation and answers the anticipated questions of “well, why couldn’t the kid’s dad watch them”", "I agree with ESH. He definitely was extremely rude in the way he handled the situation, but if she couldn't get anyone to watch her child she shouldn't have come to the adult-themed party.", "Thank you! I definitely got the sense that OP always had a problem with Jane and was judgemental towards her. His reaction was definitely brewing towards her and definitely would have come out another time if not at the party.\n\nOP is also the AH!", "Honestly, I'm struggling with ESH because Jane's asshole level is so much lower than OPs. Calling her a bitch for what she did is totally unacceptable, and his whole attitude towards her is terrible.", "Which is actually the harder choice", "Feel like a comment I’ve already made applies to this so will paste here:\n\nIt seems to me like OP mentioned that to explain why she’s a single mother. Just to give the background of her life situation. Where do you get the rest of that maliciousness from?", "Yes, he's not the ah for asking her to leave but he is for the way he did it. A simple \"sorry I don't feel comfortable having a child here with the drinking and whatnot going on\" would have been fine.", "Nah. It was accurate.", ">Pro tip: If you don't want to be an AH, don't resort to calling people names.\n\nSeems ironic in a sub about \"assholes.\"", "Honestly, I side eye anyone who just calls women “bitches” for displeasing them. I’m guessing wife has heard that a time or two as well, with how easily it rolled of his tongue.", "he said she was his wife's friend.", ">(by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion)\n\nOP is blaming this sub for his own shitty writing.  \"She's a single mother, her boyfriend left her when the baby was concieved \\[sic\\] and she refused to get an abortion\" is an ambiguous sentence that can easily mean \"she's a single mother because her boyfriend left and she then didn't get an abortion.\" Indeed, OP's use of the conjunction *and* instead of *because* (as in, \"her boyfriend left her *because* she didn't get an abortion\") strongly implies otherwise. \n\nIt sounds like OP is walking back his own meaning after the backlash he got here. For that alone, OP YTA.", "Got to say it - Jane was in the wrong for bringing  a kid to a party where kid was expressly not invited. But going with YTA on this one because he responded like an asshole and called a friend a selfish bitch! \n\nAnd the the abortion comment was completely irrelevant and badly worded- the edit made it clear what op was trying to say, but worded badly and rather than accept it, comes back with another insulting comment.\n\nAnd ‘adult themes’? Was there an orgy room!", "I love his edit yelling about everyone else being stupid because he can't convey his meaning in writing. \n\n\"Am I wrong? No everyone else is stupid! I should express myself through anger, swearing and insults instead of considering I might be mistaken!\" - OP", "I'm also older than OP and read the abotion line the same way. I agree it was completely unnecessary to even provide an explanation. \n\nOP seems like a dick.", "Exactly. Jane is TA for not respecting the no kids rule but the way the OP spoke to her - he’s the biggest AH ever.", "Yeah I don’t think YTA for the situation but you sure sound like an asshole anyway. How hard would it have been to ask her to leave without calling her a bitch and looking down your nose at a single parent?", "Gotta give OP a tiny bit of credit though for being honest about their reaction to the situation. Most of the time with these I assume OP is leaving a train full of information out of the story lol.", "It's like he thought he could use her lack of an abortion as proof of her selfishness, when all it did was show him to be an asshole of the highest order.", "Yeah, this has got to be fake. I refuse to believe that people like this exist on earth. \n\nAs to OP, if this in some galaxy is actually real,  YTA.", "It seems to me like OP mentioned that to explain why she’s a single mother. Just to give the background of her life situation. Where do you get the rest of that maliciousness from?", "This guy is reading real John Paul / Bad Sisters vibes.", "I took that comment as the boyfriend wanted her to get an abortion and she refused to he left her 🤷🏻‍♀️. Unless the wording has been changed/edited…", "I don't see where OP said \"refused to get\" to the parent. To me, it reads like that statement was an internal thought, and not a spoken statement. It is even typed within parenthesis. People can't be judged by their thoughts (or I'd be a murder many times over) but by their actions. This post requires clarification as to exactly how OP told the parent to leave.\n\nHaving said that, I'd agree with OP. Of course, the OP did type it, so it is now in text and no longer an internal thought. So I am not sure.\n\nThe parent is selfish for thinking that the rules do not apply to her. The entire conversation could have been avoided had she obeyed the rules.", "He's an asshole the way he speaks to and about everybody, just in this one short story. It does explain why he said \"our and her friends\". Gonna bet they all got together to enjoy free food and drinks, and the charming company of OP's wife.", "Sums it all up nicely.", "Exactly…that response was horrible", "Seeing this a lot, thought I’d give my response to the abortion thing from other comment:\n\nIt seems to me like OP mentioned that to explain why she’s a single mother. Just to give the background of her life situation. Where do you get the rest of that maliciousness from?", "<sarcasm>“Her body her choice” only applies if she wants an abortion, duh <\\sarcasm>", "It seems to me like OP mentioned that to explain why she’s a single mother. He wasn’t making a catty comment.", "Yes! Agreed. She shouldn’t bring her kid but calling the mom a selfish bitch and kicking them out in front of the kid is horrible. Kids take their parents being rejected pretty hard….sometimes even harder than the adult.", "Yeah I raised an eyebrow at \"sex themes\" at this 40-year-old dad's birthday party. Sounds like a kid's idea of what it's like to be an adult.", "I was all set to say N T A until that statement. It’s just gross", "You are a bit touchy, aren't you? He stated a fact. He didn't express what he thinks of it. We could argue whether it is really relevant to his story but I guess we both agree it is not.", "Came here to say this. Overall the tone of the writing was rubbing me the wrong way, but then when I got to that part it’s just YTA done and done.", "Especially if they said that in front of the kid, I'm wondering... Also, I don't see the relevance of the 'she refused to get an abortion' comment. As if that's supposed to convince us she's the AH or something.", "So you defend him immediately calling her a \"selfish bitch\"?", "Jane Doe absolutely was rude. She said it was inconsiderate to not let her come then he blurted out the insult.", "a simple “she’s a single mom, dad is not in the picture” would’ve easily sufficed", "Jane showed up to an adult party with an 8-year-old in tow. The only kid who was there then when asked to leave didn't just go but whined about not having a babysitter and called him inconsiderate. What was the 8-year-old supposed to do the whole time? At what point are you allowed to be rude to someone who isn't leaving your house when asked to go?", "well she is an asshole mother to the kid for dragging it to a party where there are only adults getting drunk, I consider that worse", "Because tbh, why she's a single mother isn't relevant to the story. The fact that she is provides context but his choice of words in saying she \"refused\" to have an abortion shows how he feels about that decision. \n\nIf he REALLY just wanted to provide context, her choice of abortion or not wouldn't even be brought into question and it ain't his life to question in the first place. AND he called her out her name. He's straight trash.", "I agree with you, but OP also sounds like an ass as well imo for calling her a bitch and yelling at her. Could've just kicked her out without the name calling. Tho the wife would've been mad still probably, at least he wouldn't be rude about it. Imo this is ESH on everyone mentioned except the kid.", "A \"she's à single mother\" would have been enough. There was no need to add that she was dumped while pregnant and then refused to abort like she made the decision to spite people or because she actes like z child.", "I agree with you, but OP also sounds like an ass as well imo for calling her a bitch and yelling at her. Could've just kicked her out without the name calling. Tho the wife would've been mad still probably, at least he wouldn't be rude about it. Imo this is ESH on everyone mentioned except the kid.", "I understand that, but that doesn’t explain her being invited for his birthday. I have a couple friends that aren’t my husband’s favorite as does he; we would not invite them to the other’s birthday.", ">And ‘adult themes’? Was there an orgy room!\n\nThis is my thought. I assume all kids might hear adults swearing on occasion or see their parents have a drink. But... Sex themes? Is this a key party? Are people getting TOO drunk to handle themselves? The hell kind of party is this?\n\nOr... Is the real issue here that OP thinks poor single moms who refused to get an abortion don't get to have fun anymore? I don't know, this is the internet, I don't even care lol", "Yeah her history and how she ended up with this child is completely irrelevant to the situation. I guess I can see why he explained that she is a single mother... To point out that it was a barrier to figuring out childcare? OP sounds like an AH with anger issues\n\nHOWEVER, the big bold letters? and you still bring the kid? Thats ridiculous. If I were the host I wouldn't call her a bitch or judge her life but I would def be annoyed and honestly I would ask her to leave too", "Same here. He's in the right for saying no kids, your kid can't be here. But OP YTA for how you spoke to her, wrote about her and for your additional comments. You honestly come off as a truly self centered AH. Yes she shouldn't have brought her kid if you said no kids, that was tone deaf on her part, but man, you went 0-100 real quick on her.", "Almost sounds like he wishes the child dead as well", "The edit he added doesn’t make it any better", "I agree his a raging AH but by the refused to get an abortion comment I think he meant the child’s father wanted her to get one that’s why he left her.", "Because while there are single moms that kill it on their own (like my mom), there are also single moms who struggle on their own. \n\nI’m assuming the people around her believed she would struggle as a single mom and suggested an abortion. \n\nBut to say “she refused” is very strong language.\n\nEDIT: I realize now that I shouldn’t have used the saying “killing it” while discussing abortion. I apologize for overlooking it.", "I think, based on the edit, OP was trying to say that the biodonor left because Jane didn’t abort.  So donor was demanding the abortion.\n\nETA: I thought the same thing based on his original writing.  And like others, I, too, an older than they are.  I remember the late 70s.", "Most women are pressured by bf/husbands", "He didn’t tell her that she should have had an abortion even if it is his private thoughts.\n\n\nShe did tell him that it was inconsiderate that he wasn’t accommodating her 8 year old at his party of drinking, swearing, and sex themes. \n\n\nHonestly, she was being inconsiderate expecting them to accommodate her when she showed up with the kid. Then to imply that they were being inconsiderate to her?", "If you can’t take care of the kid don’t bring it into the world, abortions are a thing for a reason", "But why does how she became a single mother matter here? Would OP have been nicer if she was married but widowed, because that's socially acceptable? Why do we need to know her boyfriend left her and she \"refused\" to have an abortion *8* years ago?\n\nAlso her called her selfish bitch, which is a nasty overreaction. He could have just said, \"I'm sorry if you think I'm inconsiderate but I'm not allowing kids.\" The name calling combined with giving us the history on how she became a single mother -- the kind of history that's often stigmatized by society -- gives off the distinct flavor of someone who included it to make us judge and dislike the friend.", "Most people understand what a single mother is. \n\nThere was no need for OP to go that deep and mention it. It definitely was to be malicious and misogynistic.\n\nSometimes, it's not what you say, but how you say it. \nJane Doe was wrong for not respecting the party rules, but OP is still the AH for what he said and the way he did it.", "Why do you think any of the information about why she's a single parent is relevant to this story?", "Ikr? Smdh", "Probably from his decision to call her a selfish bitch. The post drips with malice.", "The reason for her being a single mother is completely irrelevant to this situation. He's kind of the AH for putting the effort into typing this sentence \" (by the way she's a single mother, her boyfriend left her when the baby was \\[conceived\\] and she refused to get an abortion)\" and it makes him seem like it is an issue for him personally.", "The maliciousness is that it wasn't needed for the story, but he felt he needed to point it out anyway. He only included it because he thought it would help his case.\n\n \"She's a single mom who couldn't afford a sitter\" tells us enough about her and why she brought her kid along.\n\n\"Her boyfriend left and she refused to get an abortion\" tells us what he thinks of her. \"It's her own fault she's in this position\", \"she wouldn't have this problem if she had had an abortion\". There is plenty of people who think you don't deserve any compassion at all if you made \"the wrong choice\", and you have no right to complain. This is the maliciousness.", "It was a piece of information no more relevant to the story than what he had for breakfast the day he, as a grown ass man, sent out invitations to his own birthday party.", "This is exactly what I was thinking.😂😂 It would also explain why he was so mad about her taking the kid to the party.", "Bruh 😂😂😂 I'd want that update ASAP", "I was getting those vibes too.", "You may be onto something here…", "Was thinking the exact same thing", "I just read that as a swingers party tbh. I’ve been to a few and there’s definitely a lot of 40yo empty nesters.", "\"They're sex people, Lynn!\"", "We can’t argue OPs intention with that comment specifically but when you read it within the context of the post as a whole it certainly sounds judge mental.", "Both are true", "Playing devil’s advocate a bit, I’m almost wondering if her showing up unexpectedly with her kid is a habit she makes. The reaction feels way too over the top for this to be just a one-off occurrence.", "Absolutely fair point, but I still don't think calling her a bitch in front of her child is the move either. It all sucks.", "I would agree but he isn’t just asking about the rules but whether he was an asshole for hocking his wife’s friend out.\n\nI only pointed out that being kicked out of anywhere sucks - especially if was a genuine mistake and it sounds like she wanted to be involved.\n\nNot saying they had to bend over backwards to facilitate them, but kicking out your wife’s friend of a party is kind of an asshole move. Probably would have been another way to handle it before it got to that point.\n\nHad OP and OP Wife tried to help and Wife’s friend still been a royal pain in the neck and expect other people to fix her mess then I would say NTA but that hasn’t been shared, or wasn’t at the time I posted I don’t think.", "Enforcing a healthy boundary in an unhealthy way.", "OP is an asshole in the general sense for that sentiment (and the judgemental sentence about how she ought to have had an abortion), but not for the general underlying principle. \n\nHe's right that she was selfish. Not because she couldn't afford a babysitter, but because she *knew* she couldn't and still planned to come to the party and dump her kid on people who didn't want her there, changing the entire vibe of the party. \n\nShe could have RSVPed \"No\" and explained why - maybe OP and his wife could have offered to let her kid stay with their kids and helped her pay for it. Or maybe they could have arranged a childcare share with another guest. But no-one will ever know what they might have worked out, because she decided to just boldly ignore the adult setting and waltz her uninvited kid into the middle of it all.", "I mean, she was. Everybody wants a special exception. Pumping a kid out doesn't mean you can do whatever TF you want.", "I mean, she called him inconsiderate first.  I'd argue ignoring specific instructions because you feel entitled to go have fun isnt really minor.\n\nI'm not saying I agree with his language, but I agree with his sentiment", "That depends. I assume Winnie the Pooh's home has a bathroom. \n\nAlso ESH.", "fine maybe you consider her rude. I don't think it was well deserved the rest especially knowing how he actually thinks", "Yeah I feel for Jane not having the money to get a babysitter or whatever but just because you have a kid doesn't mean people need to accommodate you. Theres a lot of parents out there who would do the same thing as her, but most would either stay home with their kid, or find someone who can help you out in a pinch. \n\nDid Jane not have a single friend or family member who would be willing to help her out so she could go to her friends party? Even if OP allowed her to stay, I would love to know what Janes reaction would have been when one of the sex games started and her kid was there....", "Right? None of why she has a child matters. There was no need for that. She should not have brought a child, and not only is he not an asshole for wanting her to leave, even if there wasn't anything particularly adult oriented going on, the invitation said no kids. What he said to her, and what he says about her here are out if line.", "His SO invited her to his birthday party... why did he not ask her to handle it?  I find that curious...", "Oh yes I do class OP as an AH. My judgement would be ESH", "well, you are a good spouse.", "he was probably zooted on cocaine and hammered thats my only logical explanation for how he spoke to her", "What really makes him TA is her called her a selfish bitch in front of her 8 year old son. Who does that?", "Indeed/ so he should have written ‘because’ not  ‘and’.  Instead he got all pissy and wrote an insulting edit to all the people who read it exactly as he wrote it. Because- check notes- he is an asshole.", "Nah, it's even worse. The father apparently left during the conception.\n\n>her boyfriend left her when the baby was concieved", "It's what he meant, but it's weird to even mention. She's a single mom because she wouldn't get an abortion? But if she got an abortion, she wouldn't have been a mom anyway. Like duh, it just adds nothing for context. Instead it comes off like, \"she wouldn't listen to the man in the relationship, so she deserves this.\"", "I read the first sentence and thought “it” meant the kid. I read that as “there are single moms that kill the kid on their own (like my mom)” and I was genuinely so confused for a moment", "Why would you use the term “killing” YAH.", "English is not my first language.... Can you explain me the difference between what he wrote about the abortion and what he meant? To me it sounds the same ... Like an AH", "Can't pay for a babysitter one time that we know of ≠ can't take care of her kid. There's a mile of nuance to jump over to reach the conclusion that the kid should have been aborted.", "Abortions exist so people can do to adult only parties?", "It “rationalises”  (I don’t think it does but that’s why it’s there) why she went against the rules. Because she’s got specifically those circumstances she really wants a party and can’t afford childcare.", "Agreed. I would have asked her to leave if it were my party honestly and I would have been mad to even be put in the situation where I need to ask someone to leave my house..\n\nbut OP exposed himself as an asshole simply by telling a story and speaking lol", "No but the fact that it was under THOSE circumstances is the reason why she can’t afford sitter and is desperate for a party and some time for herself.", "Because it is the reason why she can’t afford sitter and is desperate for a party and some time for herself.", "That last paragraph of yours is really perceptive. I’ve understood a lot from that and it really does make sense that that’s what people would think.", "I don't see anywhere in the posts that indicate this was done in front of the child.\n\nIf it did... I still don't have a problem with it. If his only fault in this is his choice of descriptors then she still shoulders the vast majority of the blame if only for being willing to use her child to get what she wants.  It isn't OP's job to shield that entitled person's child from the reality that she is a bitch.\n\nDo bitch things... get called a bitch.", "Calling someone a selfish bitch (in front of their kid no less) is not a normal reaction to this situation.", "Her *choice.*", "it's absolutely outrageous to bring an 8 year to a 40-year-old's birthday party and have the 8-year-old be the only kid there but whine about being asked to leave. What the hell is the kid going to do the whole time there?", "I think the wife is angry because she its her friend and I bet the wife told Jane it would be okay to bring the kid and they both tried to ambush him.", "I was on his side but he lost me the second he started to talk about her like that. I don't even know why we're responding to this post because he does not sound like a man who'll admit his wrongs in this situation.", "To me it read more as an explanation of her current financial state and served as an explanation as to why she felt entitled to bring her 8 year old kid to an adults-only party", "Yeah the edit made him look like an even bigger AH.", "Even with the edit you’re still the AH", "English is not my first language.... Can you explain me the difference between what he wrote about the abortion and what he meant? To me it sounds the same ... Like an A...", "That is some split-second timing!", "I can definitely see how it’s taken that way. \n\nI use the phrase so often that I didn’t even realize how it would come across given the topic.", "Because it's an idiom... If I'm \"killing it\" with cooking I'm doing really well at cooking. The person before you was just saying their mom is good at being a single parent.", "Because when you abort a baby you kill a life. Using different language to justify your stance on abortion is a cowardly thing to do. I'm pro-choice, but I acknowledge that it ends a life.", "The way he wrote it sounds like the boyfriend bailed and she refused advice from multiple people to have an abortion. \n\nWhat he meant was the boyfriend left her _because_ she refused his pressure to have an abortion. \n\nHe’s just mad because people are calling him out on his ambiguous wording.", "According to this AH.", "Nah mate, if you can’t get a babysitter or know not to bring a baby to an ADULT party, maybe an abortion is for you", "Pretty sure \"she's a single parent\" covers it", "And??? Boy, women really can't win with you folks. Insulted and harassed for getting an abortion, insulted and harassed for not getting one.", "not questioning thay. Just saying that he shouldn't have treat her that way. And this is coming from someone who has being know as rude her whole life. And I try to change everyday. She was wrong, but so was he. That's why I say ESH", "Well in all fairness I would be furious if my bf spoke to one of my friends like that or even the other way tbh, but everyone's definitely the asshole here in one way or another. I also have been in these situations myself and based on those experiences, I agree with your suspicion that the wife approved it....", "\"She's a single mom\" is an explanation of her financial situation. \"She refused to get an abortion\" when the child is 8? That's not an explanation of her financial situation, it's an explanation of why he's an AH to her.", "Absolutely. I'm the same age as OP so decidedly not \"the younger generation\" and I misunderstood what he meant when I first read it cause his wording is really vague. It for sure should have been phrased as because or when. \n\nHe left her and she refused reads as two different unrelated events. \n\nHe left her because she refused / he left her when she refused reads as cause and effect. \n\nCalling us all stupid for his inability to write clearly is both Asshole-ish and childish.", "The edits just helped verify that any and all AH judgements are spot-on.", "So he wrote\n\nSingle mum because dad left when baby conceived ‘and’ she refuse to get an abortion-  \n\nso quick read makes it sound like two different things-  ie. She got pregnant, boyf left so now she is pregnant and single  and then refused to get an abortion = single mum. It is probably grammatically correct but the causality isn’t as clear. \n\nWhereas: \n\nSingle mum as boyfriend left when she got pregnant ‘because’ she refused to get an abortion.  Just really clear boyfriend didn’t just leave or leave because she was pregnant, it was the refusal to get an abortion. \n\nStill pretty callous to bring up eight years later, the fact of why she is a single mum is not relevant at all and the ex-boyfriend still a deadbeat if can’t parent whilst she goes to a party but hey!", "Because indicates a linkage between the two things. Like because I don’t like fish I don’t like sushi. And just indicates a list of things while keeping those thing separate like I don’t like fish and I don’t like chicken.", "I should have realized that it’s tone deaf given the topic at hand. I apologize for the mistake.", "idk if you read the comment theyre replying to but the first commentor was talking about abortions, “killing it” was in reference to aborting a fetus", "But what's the difference. Why is he saying that at all... Does it matter why he left her... To me it sounds always like he is judging her for not having the abortion... But maybe that's the language barrier...", "He said he asked her to leave and instead of going she said she couldn't afford a babysitter and he was being inconsiderate. At what point can he just go get the hell out of my house never?", "Fair enough, that’s just not how I perceived it.", "No, you are correct. He is judging her for not having an abortion, despite what he claims in the edit. All of the information about why she is a single mother is irrelevant and he’s using it as a way to try and justify his behavior towards her.", "All of the Y T A is because of the insults that were unnecessary to Jane. Standing firm about no kids is an absolutely ok thing. It was the right thing and I even get being frustrated considering the lengths you went to make it completely clear no kids allowed and Jane clearly disrespected that. And pushed even when you stood firm. Jane was wrong all the way here. And frankly, without the insults I would render you completely N T A. \n\nSo here’s where it stands, ESH. You for the insults, they weren’t necessary, Jane, for expecting to be coddled and manipulative; and your wife for letting her friend play that crap.  \n\nIt’s also unnecessary to make some of the comments you’ve made about the younger generation. If you’d have used the words “because she refused to get an abortion” it would’ve been clear; because you said “and she refused to get an abortion” at the end of the statement , it’s ambiguous. But if you’re familiar with Reddit, you should know the way you wrote this comes off quite volatile. You gotta take the judgments you asked for and roll with it. In any case, Happy Birthday, grumpy 😂", "YTA - it’s my party - you sound like you’re 8. No one needed to know she “refused to get an abortion”.", "YTA. Just because you sound like one.", "YTA.  I’m 51 and misunderstood your abortion comment so age and younger generation has Jack shit to do with it.", "YTA for how you spoke to her. Also, people are not reading incorrectly, you did not write that her boyfriend left her due to not getting an abortion.  You wrote he left her and she refused to get an abortion,  as if she should have gotten one due to the fact he left. Big difference in wording. Before you insult people for not comprehending, make sure you actually wrote out your thought correctly.", "NTA for refusing to let her in, but people are reading the abortion comment wrong because you wrote, '... *her boyfriend left her when the baby was conceived and she refused to get an abortion).* Instead of , '*because she refused to get an abortion.*' Therefore, your supposed younger generation readers are not so dumb. Maybe proof read you work before casting aspersions on the intelligence of reddit? YTA for horrible attitude.", "NTA for kicking her out. You are correct it is your party, your 40th and your house. And you stated it was 18+ ONLY. But YTA for how you talked to her", "I wanna say NTA,but tbh ESH. It's your party, her kid. The abortion comment in your post wasn't great, but you didn't say that to her face and I think people need to learn to read.\n\nAs someone who was brought to an adult party as a child, I was absolutely terrified and confused and it caused me so much anxiety at the time. My mum could have left me with my grandparents but insisted on bringing me. I wish she hadn't, I was exposed to a lot of things that I shouldn't have been at 7yo. She is absolutely selfish for bringing a child into an environment they shouldn't be in.\n\nWhile you didn't handle it the best in phrasing, the boundaries were set on the invitation. You told her she'd have to watch her kid, and that he would be exposed to adult themes; it was her responsibility to deal with the fallout since she ignored the rule.\n\nShe chose to leave in a huff afterwards, not your problem. She should have found an alternative or spoken to you guys beforehand to ask what you were comfortable with if she really had no other choice. You are not responsible for catering for a child that wasn't meant to be at your party.\n\nEdit: added ESH because I found out what it meant", "NTA. It’s your party. She knew it was kid free and brought one anyway. Next time just leave off the part about abortions since it really took away from your narrative.", "Seems unpopular but I'm going with NTA here. It's your party, your rules. If it said \"no hats\" and someone would come with a big, colorful hat, it wouldn't even be a question who is in the wrong. But as soon as children are involved, it's apparently not ok to say they aren't allowed. Also, the kid wouldn't have any fun at the party, would be exposed to inapproriate language ect. and everyone would immediatly feel uncomfortable and like they need to censor. Why would you want that? It's never up to anyone to question what the rules or guidelines are for an invitation. IF you do not agree or feel personally attacked or cannot comply, then simply don't come.", "NTA, you were clear on the invite, and she was not YOUR friend.   What's up with these people thinking that instructions don't apply to them?", "NTA - when it’s your birthday, your house and your party yes you can be ‘selfish’ by inviting who YOU want. If she can’t respect that then she can’t attend, makes perfect sense.", "Nta\n\nInvitation clearly said no kids, could you have been more polite in telling her to leave, maybe, but she was rude first. \n\nNo reason to bring up that she chose not to get an abortion, that has nothing to do with the story, just leave it at \"she's a single mother.\" Bringing it up lacks class on your part.", "I was going to say you weren't the AH here, even though I thought what you said was harsh (but that's not what you were asking if what you said makes you the AH). But after your edits, forget it. YTA. You do have a right to want a party without kids and ask that of your guests. You don't have the right to insult them. You could have asked her to leave instead since this party wasn't suitable for a kid. But you're already combative on here then I imagine you were just a huge AH in person.\n\nAlso, the way you wrote about Jane made it seem like she refused to get an abortion, not that her birthday left because she refused to get an abortion. I'm not the best writer, but damn.", "Do not blame people for your poor phrasing. Why do you think it's ok to an insult an entire generation of people? You were not an ah in this situation, but it seems as though you are an ah just in day to day life. I'm the same age as you and I thought it was unnecessary and judgemental thing to say until you clarified it. You've got loads of people confused by your words, so you blame the loads of people instead of taking a look at yourself. Sounds like you've got a lot of growing up to do.", "ESH. she shouldn't have brought her kid, and you're a huge asshole for jumping straight to calling her a bitch.", "ESH\n\nHer for bringing her child to your party. She should have stayed home and not put you in that position. BUT! You were a big AH in the way you communicated that to her.", "ESH.  Breeders acting like entitled AHs are tho.  You’re wife is a bit of an AH for telling you you should have catered to the “selfish B” at *your* birthday party.  BUT, dude.  You went straight for the misogynistic insults?  Really?  Maybe some therapy for that anger and misogyny problem.  \n\nI do feel bad for the kid, tho. Hope the kid doesn’t know they’re the reason mom had the leave the party. Would hurt a kid to know was their “fault”.  (They’re not the reason,  mom is the reason, but that’s how a kid would see it)", "For two grown ups your sure are acting like children ESH", "> While most of the guest got the message, one didn't.\n\nYou could (and after reading the rest the post, should) have ended the post here. \nIt dosn't matter her situation, and all her background was really unessery. \nNTA for the question given, but I do think you're a asshole in general. \n\n\n\nTo address your edit: you are wrong. \n> I was trying to explain that the child didn't have a father because the father left Jane BECAUSE she refused to get an abortion.\n\nYou said in the original post that the boyfriend left her AND she didn't get an abortion, not that he left her because she didn't get one. \nIt's clear why people would read that as Shaming.", "Wow. YTA. \n(Your edits make you sound like even more of an AH by the way).  Just, wow.  \n\nYou must know that it’s not ok to speak to people (especially your friend) like that, having a birthday does not entitle to you treat people like garbage (even if she is a *clutches pearls* single mother!) \n\nJane was slightly an AH too for bringing her kid along without checking with you first, but no way she deserved to be treated like that.", "Was leaning towards ESH until I read your edit but…. YTA. While Jane clearly should not have brought her child to an 18+ party, you didn’t have to overreact and call her a selfish bitch. Your edit just makes you sound even worse. The way you worded your original post makes it sound like Jane’s boyfriend left her when she got pregnant because he didn’t want to be a father and that YOU are the one blaming her for choosing to be a single mother and not getting an abortion. And then you act like Reddit’s Resident Genius in your edit and blame people younger than you for being stupid or not being able to read instead of just clearing up your poor wording. Sounds like you’re just a rude, miserable asshole in general as well as in this situation.", "YTA - the way you speak to people is atrocious. You’re not wrong Walter. You’re just an asshole.", "NTA your birthday party your house your rules.", "You are the asshole for calling people idiots because you very poorly worded your post. I'm 45, professional, an avid reader, and I read your original post as shaming her for not getting an abortion as well. \n\nIt's not everyone else's fault you can't write, don't blame them.\n\nFor the record, I DON'T think you're the asshole for telling her she can't be there with her 8-year old, given the environment you describe. I think the way you handled it, however, is immature and petty, which is reflected in your edits as well.", ">boyfriend left her when the baby was concieved AND she refused to get an abortion\n\nSo many people read this wrong BECAUSE YOU WROTE IT WRONG. The words AND and BECAUSE are not interchangeable. \n\nHow do YOU make this mistake? Good lord.\n\nYTA for your attitude here.", "\"You're not wrong Walter, you're just an asshole\"\n\nYou are correct she should not have brought her kid. Calling her a selfish bitch was unnecessary. It costs you nothing to be kind/polite. You can tell her no without being mean.\n\nAlso stop accusing others of being stupid for not understanding what you wrote. 'And she refused to get an abotion' sounds like you're judging her for it. 'Because she refused to get an abortion' provides the reason for the boyfriend leaving. Proof read next time.", "ESH.", "NTA.\nThe party isn't appropriate for children from the way you described it.\nJane Doe needs to take accountability for her actions.\nSucks thag she can't get a babysitter but that means she needs to miss the party, no matter how kuhc she wants to go!", "NTA - pretty simple stuff, when people aren't capable of reading they get what they deserve", "YTA just for how you talked to everyone in those edits.  Chill out my dude.", "Omg you were totally in the right for wanting her to leave, but the way you went about it makes you a total huge massive AH and after reading your edit, I think you're an AH in general and that's just who you are.", "YTA. YTA before your edit, and YTA x 1000 after the edit.", "OP, people “made this mistake” because you used the word and rather than because. \n\nAmbiguous: \n\nHer boyfriend left her when the baby was conceived *and* she refused to get an abortion.\n\nClear connection:\n\nHer boyfriend left her when the baby was conceived *because* she refused to get an abortion.  \n\nWhen you use and you aren’t conveying a causation, which is what you intended.  If you want the “younger generation” (or anyone regardless of age) to understand write clearly and with intent. \n\nHonestly with the way you’ve responded to people misinterpreting what you’ve written I’m willing to say Y-T-A because you’ve gone off on people instead of simply clarifying what you mean, and if you’re willing to snap this easily over your mistake I can only imagine how rough you were on this mom. But to be fair she definitely shouldn’t have brought a child to a child free party, so ESH.", "NTA our wedding was child free, when we sent out the save the dates I had one lady messaging me to bring her daughter. Just so happens her mum is my BFF and her usual babysitter and was also coming! Never heard another word after I explicitly told her no her daughter is banned. Well, on the night who was I very surprised to see at the bar?\n\nEdit: the STD's went out 12 months in advance!", "YTA. \n\nYou say you didn’t want the kid around an adult party to protect them from things including swearing, but had no qualms with calling this kid’s mom a bitch, presumably right in front of them. \n\nI would also like to point out that it’s absolutely ridiculous at how offended you are that people accurately read and interpreted what you wrote. Words have meaning (as you know, since you called your wife’s friend a bitch). If you want us to understand what you mean, you should probably write what you mean. I hope that didn’t insult your intelligence too much.", "Nta. I'm sorry, but she was selfish to show up with her kid to a party that wasn't appropriate for him. And it was wrong of her to call you inconsiderate when she had the option to come. There are sacrifices you make qhen you have a child, not going to adult only parties is sometimes one of them, and your childcare needs are your responsibility, not anyone elses.", "YTA just for your generation-shaming and snotty attitude when people misunderstood you. I’m more than a decade older than you and interpreted the abortion comment the same way. Next time use “because” instead of “and” if there’s a causal relationship between two events.\n\nAlso YTA for calling this woman a sexist slur instead of just standing firm that the party is adults-only.", "Original post: YTA\n\nEdit 1: Y still TA\n\nEdit 2: Clearly just an A", "OP, upon seeing that thousands of people have interpreted his wording in a way that he did not intend, calls an entire generation stupid, rather than acknowledging the ambiguity of his text. Even if he could safely assume the ages of the people responding, it would still be delusional belligerence to blame the masses rather than himself.", "ESH and I can't even decide who's worse. Your language was abrasive and needlessly so (although I'd have to hear audio of the exchange to know whether she was just as rude). But for her to presume that your VERY plainly stated rule didn't apply to her is infuriating. There's a worrying trend where parents believe that being a parent somehow makes them special -- even, inexplicably, more special than others who've done the same (as here). If, instead of determining assholery, we were deciding who's the more intrinsically *selfish,* IMO that'd be her, by a mile.", "Should Jane not have brought her child to your party? Obviously, she should not have. \n\nThe real problem you seem to neglect is: You are not able to type or speak without understanding that what you write or say is the only way people can interpret what you mean. \"She refused to get an abortion\" denotes you blame her and doesn't give context beyond that.\n\nYTA\n\nThis will be lost on you because you are not concerned about anyone or anything but yourself; you probably have never been wrong (in your own eyes).\n\nWords matter.", "1. Your party sounds gross\n2. You sound awful\n3. YTA", "YTA \n\nYou can be technically in the right but still ruin things and end up in the wrong by how you react. \n\nAnd you reacted like an asshole. \n\nAlso your edits really sound like something an asshole would say.", "YTA and you really solidified that claim by calling younger generations dumb.", "NTA, who brings a kid to an adult party? And who thinks there entitled enough to bring a kid to an adult party that clearly states NO KIDS?", "A lot of people are calling him an a.h. for this comment:\n\n\"(by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion)\"\n\nwhich honestly OP i read it the same as everyone else did and it pissed me off. I did however, read your edit and i NOW understand what you were saying but the way you wrote it, seems to be the problem. I see what you mean clearly now that I know what you were trying to say, but its VERY easy to read it other way.\n\n I am still going with NTA, because you wanted your birthday party celebrated a certain way,  you were explicitly clear on the invite and rando doesn't get to change that for her convenience.", "NTA.\n\n\nThere is no non confrontational way to tell someone who ignores a \"ABSOLUTELY no children at this event\" and shows up at your party with a kid in tow that they need to turn around and leave.\n\n\nThis woman was banking on you avoiding confrontation by allowing her to bring her child in.  She had no thought to how having an 8 year old present would ruin the party, only thinking of herself.  \n\n\nDid you get out of hand about it?  Yeah, I think so, but this was ENTIRELY justified.  She was practically daring you to publicly humiliate her.  \n\n\nYour wife needs to cool her shit.  It wasn't her birthday party, and this woman isn't your friend.   Both she (the friend) and your wife were the assholes here.", "NTA NTA NTA. Whole comment section is losing their minds over you simply pointing out the obvious - she chose to have a child knowing she’d likely be a single mother (creating less leeway re: affording childcare, having a partner to look after them, etc). She subsequently made that choice your problem by bringing them to your child free party.", "Im pretty sure all the smart people know your NTA here...your definitely correct on that one though the invitation said no kids some people are just dumb", "NTA. You clearly said “No kids allowed” and she decided against YOUR wishes to bring her child anyways. She didn’t want to miss the party, but clearly disrespected you & your requests. No, you didn’t have to say rude shit, but maybe next time she will be respectful enough so she isn’t in that situation again.", "Were you the asshole for kicking her out of your party? No! She was the asshole for showing up with an 8 year old expecting to be accommodated. Rude!!!! Your wife was an asshole for taking her side. It was YOUR party. NTA", "Soft NTA.  I have little tolerance for people who bring kids to child free weddings and and ignore the NO KIDS ALLOWED on your invitation.  You are right that she should have elected to not come when she couldn't get a sitter.  You were a little rough on her, but really, how unclear is NO KIDS ALLOWED?\n\nI am not going to get into the other stuff on why she is a single mom, as I don't feel it is really relevant.\n\nI don't actually have kids, so my view might not jive with everyone else's.", "YTA for clarifying that Jane Doe wasn’t her real name.", "It's his party. It was clearly communicated no children were to be there. OP even made arrangements to not have his kids there. It's a milestone birthday. \n\nFuck that lady for thinking \"I should be the exception cause I'm a si gle mom.\"\n\nOP is definitely NTA.", "Crazy. A child is brought to any adults only function and everyone is pissed the OP said the woman didn't have an abortion.\n\nHe states a fact, not an opinion.\n\nSo he's the A hole , not the woman bringing her kid to an adult party who knew it wasn't allowed.", "YTA. The younger generation isn’t dumber than a moron like you. No one is.  NO ONE. It’s also nice that you basically blame Jane for her bf being a deadbeat. Good reasoning. Just in case you are too dumb to understand (you are), the child doesn’t have a father because the bf is a bigger AH than even you are", "You’re calling people stupid for not understanding the abortion comment? Learn how to write. You said “her boyfriend left her when the baby was conceived and she refused to get an abortion”. In no way does that imply that her bf left her because she didn’t get an abortion. Either way, that information is completely irrelevant to this story. God you sound insufferable.\n\nAnyway, ESH. She shouldn’t have come with her kid. However, the way you spoke to her was a huge asshole move.", "Most of the gatherings I've planned in the past few years have been adults only, I might be peeved if a friend tried to bring their child to one but I certainly wouldn't call them a bitch over it.", "Yeah, you can kick her out and it go nta. It is the way he kicked her out makes him TA", "His edits are the cherry on top lmao", "Exactly. Like she did the wrong thing but he’s a massive jerk. And look at his edit basically belittling everyone who comments. I mean he could either see that he didn’t communicate the abortion part clearly or the whole world is wrong and he is right. \n\nAnd the way he formulated it in his original text did not insinuate that the boyfriend broke up with her because of it. \n\nI legit feel sorry for OP’s wife.", "Ha, right! This guy is a huge AH just in general. Nevermind in that particular situation..just all the time apparently. YTA now and forever old man", "Yeah, it was phrased poorly but instead of recognizing that, he just insults the intelligence of a whole generation of people. That is definitely asshole behavior.", "Considering OPs only other post was whether talking away TikTok was to severe punishment for his kid being a Nazi, he should probably be the last person to judge anyone’s parenting.", "I was almost on OP’s side until I saw the “younger generation” comment. Yeah, it’s irresponsible to bring a child to an adult party, but YTA OP for insulting people just because they don’t agree with you.", "Oh my god that edit is so much worse. OP I'm your generation and I understood your points clearly, which is exactly why I think you're judgmental and misogynistic. YTA.", "Same. I'm older than him and had the same thought. Sounds like he just wants to blame his inability to clearly convey his meaning on everyone reading.", "“The younger generation really is dumber” - oh the irony of this sentence.", "Yeah, his post reeks of contempt for this woman and for anyone who dared to disagree with him.", "The more he talked about her being a single mom, the more of an asshole he became.", "All of this exactly.", "Just because you're right, leave no kids allowed, doesn't mean you can stop being civil.", "Lol he's in my generation amd I thought the same thing.", "Me too 😂", "Has to ask if he's the asshole but when he doesn't like the answer he calls everyone who doesn't agree with him a stupid kid lol", "Yeah im 35 and it for sure came across as shaming her for not having an abortion not as an explanation of why the BF left.  I'm a big believer that more people should have abortions, but this guy is clearly an AH", ">Edit 2: I forgot to add...about the OP's younger generation comment. I'm older than he is.\n\nDitto...  And I taught college level English.  \n\nOP needs to understand that maybe the \"younger generation\" isn't the dumb one.  \n\n*I don't mean to insult his intelligence, but it is very infuriating.*", "Since the abortion comment has been addressed in many replies, I won’t remark on that.  You are not an AH for telling her she couldn’t stay with her child.  But you certainly didn’t need to call her a selfish bitch.  Why did you go so nuclear?  That makes YTA.", "My ex kicked my daughter out of her room while we were going through a divorce. She did it so she could have her sister move in exchange for a promise to claim I'm a bad father. A grown woman stealing a kid's bedroom and bed. My ex then had my kid sleep on the floor at the foot of her bed while she and new boyfriend were in bed.\n\nHow much of a bad parent does a woman have to be to deserve being called a \"selfish bitch\"? Men get called \"asshole\" for much less and nobody bats an eye.\n\nTaking a kid to an adult themed party that explicitly stated no kids allowed is worse than taking a kid to a dive bar late at night.", "Worded perfectly.  Even in the edit, OP gets needlessly defensive and resorts to insulting the younger generation’s intelligence - what does that even have to do with their post?", "She’s ok with her kid being at an adult party with sex and drugs and foul language remember?\n\nSome dumb ass who showed up to someone’s swinger birthday party with a kid deserves to be called a dumbass.", "This could have been a very easy N-T-A if OP instead said something along the lines of \"Sorry you couldn't get a sitter, I hope you can make the next one.\" Instead of what he did. I enjoy my adults-only/child-free gatherings but I'd never call a friend a bitch over it.", "Agreed.\n\nBut I do wonder what that invite said, beyond the leave kids at home part.\n\nI mean while the mom shouldn't have brought their child to the party, I highly doubt that they would have done so if the invite said that there's adult themes involved (which is what?? I mean I'd consider wine and nice food adult party and if I walked into an orgy instead I'd be surprised).\n\nLike did people know what kind of party they were coming to? Were they awarw and consent to whatever was planned to happen? Because it sounded like at least this person didn't understand that the no kids wasn't just a preference but related to whatever OP wanted to do at said party.\n\nEspecially given that OP states that they invited both his and his wife's friends. Like if your friends know how you party, they'd know what to expect and to leave their kids at home. Her friends, who might not know OP so well, might not.\n\nLike I'm no prude but there are things I don't want to see and walk into with no warning. OPs party sounds shady enough that I think I'd stick with the family birthday parties. At least everyone is dressed and there's usually cake.", "No it’s not. The consequences in the long run may be harder because of the responsibility, but it very well may be the easier choice in the moment. \n\nThere’s not a single woman I know who had an abortion that felt it was an easy choice to make. In fact, the pressure to not abort was higher, making it the harder choice.", "I mean, people come here asking whether or not they are assholes. It's not like Jane turned up and said \"am I the bitch for bringing my kid?\", he just called her one unprompted", "Well Jane didn’t ask us Am I the Bitch?", "I mean... just because it is her choice doesn't mean we have to say it was a smart choice.", "He wanted to make sure and provide evidence he is an asshole in a variety of situations. I appreciate the thoroughness.", "OP must really feel like an old man too cause he really took “these darn young whippersnappers” and ran with it.", "Lol seriously, what's with a 40 year old calling out how his party is going to have swearing and \"sex themes\"? I'm around OP's age, am child free, and like to party, but I don't know anyone that would describe their adult-only parties that way. It's like a teenager's idea of what grownups do.", "The edit just made it clear that everyone was right about his original abortion comment. \n\nJane’s “refusal” to get an abortion is a completely unnecessary detail unless OP has some problem with it. \n\nAnd then his edit is completely incoherent: “the child didn’t have a father because the father left Jane BECAUSE she refused to get an abortion.” That is pure illogic. It’s not like the child would have a father if the child had been aborted. The child didn’t have a father because the father left, full stop. It’s abundantly clear that OP is blaming Jane for her child being fatherless. There’s just no other explanation for framing it this way or even mentioning it at all.", "Yea he’s completely the ah for how he responded to her even tho she should have brought the kid, but calling her a b and his whole rant on single motherhood make him sound like he doesn’t like women", "And OP’s update explaining that particular statement makes him look about 300% more assholeish.", "Yeah, why doesn't the pro-life crowd get all up in arms about men who say things like this, \"Get rid of it\" \"It isn't mine\", etc? Aren't those men \"murderers\" as well?", "Probably like my ex. I got pregnant despite being on bc. He demanded I get rid of it or he’d leave. So, I lost 160kg that day.", "Yeh like wth is even the relevance of her not getting an abortion!? Why not mention things that the other guests haven’t done, “My wife, who won’t do a skydive”.\n\nI think OP is showing pure disdain for this woman and her child for what is a simple, mildly annoying faux pas.", "Yeah this is terrible writing on OPs end. He really should be better at written communication given his intelligence.", "He called her a selfish bitch right in front of her 8 year old child. What kind of person does that?\n\nYTA most definitely.", "bingo!", "OP frames it as if the child is fatherless because Jane refused to get an abortion. Logically “child is fatherless *because* father left *because* Jane didn’t abort” means “child is fatherless *because* Jane didn’t abort.” That is incoherent at best (it’s not like the child would have a father if Jane aborted it) and misogynistic at worse, and in actuality it’s definitely both. \n\nThere is simply no reason to mention Jane’s “refusal” to have an abortion unless he’s trying to blame Jane for the father leaving. If one were just trying to give a background they would say “the father left” or “the father left because he didn’t want kids” not “the father left because Jane wouldn’t get an abortion.” A woman’s choice to continue a pregnancy is in no way responsible for a man’s decision to not be a father for his child.", "Every mother ok, 99.99%) refused to get an abortion. No need to mention that.", "This stood out to me as well.   \nLike, what the fuck does that even mean?   \nAre you all just sat around in your BDSM suits while talking casually about all your kinks?   \nWhat kind of birthday is this???", "Omg was this a swingers party? Lol", "I feel people forget that’s an option", "She sucks for what she did, but he's a complete asshole. His edits don't make him less of an asshole.", "If the shoe fits you wear it.", "Plus the edit. My lord, this man is unhinged. He had a pretty easy NTA route to take here and chose otherwise.", "Exactly. I would have gone N T A if he hadn't been an ass to her.", "I have an 8 year old and I can't imagine taking him to an adult only party. I also can't afford a babysitter so I sit my ass at home most nights. That's being a parent, sometimes you miss out on fun.", "There’s still no need to call her a bitch, is there? You can be in the right and still be behaving like an asshole.", "My read was that he put the mom's history there in order to preempt all the \"but where is the father/why couldn't the father watch the kid?\" comments. But yeah, his overall tone/wording is super dismissive and kinda gross.", "I could see this playing into OP’s reasoning of how irresponsible Jane is, like she has a history of poor judgment. Single moms can be just fine, that in itself is no indicator. \n\nI’m trying to be charitable here, but I think OP thinks Jane wouldn’t be in this mess if she’d 1) chosen her partner better, 2) realized her decision to give birth would leave her on her own, and as someone on her own, 3) understood that having a kid means not living like she isn’t a mom. OP is right about one thing: that kind of party is no place for a kid, and Jane was awfully pushy about letting them stay anyway. OP’s an AH for the way he said it.", "Cringey isn’t it. A day time sweaty sex party", "Is he saying that if Jane had had an abortion, then sperm donor would have stayed and been a father? I can see what he’s calling us stupid: classic projection", "I agree it doesn't matter whichever way OP meant it, why bring up something so irrelevant unless OP  expect the audience to infer something.", "Which is a pointless detail unless he has some gripe with it. And the  this statement in his edit is revealing: “I was trying to explain that the child didn’t have a father because the father left Jane BECAUSE she refused to get an abortion.”\n\nThat is so fucking nonsensical. The child is fatherless because Jane didn’t get an abortion? The child is fatherless because the father left. The child wouldn’t have a father if Jane got an abortion, the child just wouldn’t fucking exist. \n\nAnd then OP wants to act like we’re all incapable of reading? No, I can read, thanks. This statement is completely incoherent but it’s abundantly clear that OP is blames Jane for her child being fatherless and not, you know, the father that left.", "Yeah, but again, we need to know any of that why??", "I just wanna commend you for apologizing for your turn of phrase. You're doing better than OP, who wrote unclearly and then lashed out at the community for reading what he wrote!", ">EDIT: I realize now that I shouldn’t have used the saying “killing it” while discussing abortion. I apologize for overlooking it.\n\nBlame it on the younger generation, and their lack of reading comprehension skills.", "lol I did indeed steel myself for this to be an anti-abortion comment.", "To show she could not have left her child with the husband. Her only choices were not to attend, or bring the child. He called her selfish because instead of not attending the party, she did show up with her child.\n\nAt least that is what I got out of the OP.", "Don’t you think OP would mention that since it would make him look better?", "That's what I'm also thinking.", "I mean that's why everybody sucks here. Jane for her actions, and OP for how he responded. Being an asshole isn't justified just cause someone else is an asshole.", "Lmao I didn't even catch that it was during the day. How weird. At first I thought that maybe OP had his kids young and was socially stuck in his teen years or something, but he's 40 and his kids are apparently young enough that they need supervision while the adults are partying, so he can't have been that young.", "zooted!", "Ya know, actually you're right, and that's definitely a reason that this lady shouldn't have brought her kid. I know I wouldn't have, but I wouldn't be friends with OP either.", "And to garner a reaction, one way or another.", "Insults other's intelligence when his inability to communicate something clearly and concisely creates a problem. Ha! And he's an asshole. Also a problem.", "Yes, it is ambiguously written. I work as a copywriter. This was easily misinterpreted and instead OP went on a rant about how dumb younger generations. Well, the younger generations think you're a stupid asshole and we're not wrong.", "> to all the people who read it exactly as he wrote it\n\nExactly. This pissed me off just as much as the rest, and only confirmed for me that he truly did speak to her in the most demeaning of ways.", "Dudes an idiot and an asshole. Says the single mom chose the party over her kid when she’s the only one that didn’t dump her kid off on some one else to come to a perverts birthday party. As a man I can’t understand what kinda grown ass “man” wants to have a sex themed birthday party.", "i interpreted it the way OP intended without the edit, im kinda very suprised everyone has come to the conclusion that op cares so much about his WIFES FRIENDS BODY. he gave an apt description of the chain of events", "We call that move the shoot n' scoot", "Yeah I was like \"then how is he writing this 😱\"", "I definitely would, it’s just a shame that I’m one of them.", "No, he called her a selfish bitch, which is different than just calling her selfish, and important to note. If he didn't want kids there, all he had to say in response is that she's also being inconsiderate, even selfish I suppose, and the answer is still no. Not sure I'd agree with him in that case, but at least he wouldn't have resorted to misogynistic name-calling.\n\nIf he wanted to clarify that she didn't have the option to leave the kid with the father, all he needed to say was that the dad wasn't in the picture and she can't afford a sitter, so it was either not attend or bring the kid. We didn't need the details of how she became a single mother to communicate that point. And the details he trotted out are exactly the kind society likes to judge single moms for.", "That's just the OP's asshole assumption and projection that she \"wanted to party\". \n\nIt sounds like this all occurred at the front door. How did he know this \"friend\" wasn't just stopping by for his 40th birthday (which can  be a pretty big event for people) to wish him well and maybe drop off a gift? Some people actually do that and aren't hunting for a buzz as soon children aren't around.\n\nAs others mentioned, OP was probably already sheets to the wind when she arrived, overreacted and is still piecing together his hangover. \n\nI'd also bet any mutual friends at his party gave him shit for it and now he's on the internet hoping for validation.", "Yeah didn’t even want his kids there.. I mean if you had kids and wanted a sex theme adult time - wouldn’t you do it at night? \n\nDay time orgies are  just awkward.", "Yeah if THAT many people are misunderstanding what you wrote, it’s because what you wrote wasn’t clear.", "I’m the same age as OP and, as everyone in this comment section, I can read “her boyfriend left her AND she refused to get an abortion” not “because she refused to get an abortion”. He’s obnoxious, self absorbed, definitely looks down on Jane, and apparently *checks notes* doesn’t know what he writes nor how to keep a story consistent.", "\"How are people not getting this?\" He whines. \n\nBecause you don't know how to write clearly op", "I feel like the edit makes him seem even more of an asshole.  Who makes an edit to clarify something and then call so many people stupid for not understanding?  They could have just said everyone is stupid.", "It was pretty ambiguous but still: \n\n - absolutely no need to mention it all- it came across as judge-y and weird, but I didn’t  read obsessed about her body\n- his reaction to challenge on his phrasing was an insulty rant, rather than a simple clarification", "Lol best comment", "Had to award that! Amazing lol", "Yeah, that edit is actually what pushed me to YTA for this one. It was incredibly revealing of OP's character.", "Definitely a superiority complex.", "I'm also the same age.\n\nI just wanna know why it was relevant on how she became a single mother...? The fuck the Internet need to know that part of the story for?", "I'm giggling at the 'younger generation' comment.   \n\n\nI'm 62. To me, a 40 yr old is a young whippersnapper. :p", "My Good sir 40 year olds are still millennials! Don’t let them fool you!", "Me too. I’m 66. I was a grown 26 year old when this little baby was born.", "YNTA - Sometimes people don't get it and need to be taught a lesson.  Hopefully now she gets it and doesn't think that her child is welcome everywhere!", "People have a hard time reading for comprehension. They interpret what they read to support their argument.    \nIf I was invited to an event with conditions,I would either meet those conditions or not attend.  If a party  started at 6:30 with dinner served at 7 and I was working until 8, I would not insist that my hosts delay the serving. You probably shouldn't have called her bitch because name calling is seldom acceptable but I suspect you were frustrated by being put on the spot in front of your other guests. NTA", "NTA, she knew the party was child free and chose to ignore it, you're entitled to kick her out for not following the only rule you had", "YTA for the first edit. Don't blame other peoples reading comprehension for your ambiguous grammatical choices. There would have been no confusion had you correctly put \"(By the way, she's a single mother. Her boyfriend left her when the baby was conceived as she refused to get an abortion.\") \n\nI was actually N T A up until that point, as this was an event a child would have completely changed the theme and tone of, but your rudeness in handling your own mistake of phrasing is making it seem likely that you WERE unnecessarily rude to Jane Doe.", "YTA\n\nJane was wrong for bringing the kid, but you shouldn't have called her a bitch. That's just disgusting. It is also weird how you felt the need to tell us _why_ she's a single mum, since that has literally nothing to do with this...\n\nAlso, you're an asshole because of your snarky edit #1. Buddy. Maybe if \"so, so many\" people are misunderstanding you, it's a problem with you, not them. We can read perfectly well. (And the generational comment is just hilarious, believe whatever you need to to feel superior, man.) If you wanted to indicate the guy left _because_ of something, you should have used the word 'because', not the word 'and'. Good god.\n\nIn summary:\nSorry I had to insult your intelligence, but the older generation really needs to learn to write properly. ;)", "Dude, I turn 40 in a year. You sound like a 20 year old. You can turn someone away without being a total asshole about it. Grow up and act your age. YTA.", "You call the younger generation stupid but feel like you have to ask if calling your wife's friend a bitch makes you an asshole? Get a fucking clue dude. \n\nP.S. you literally typed \"(by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion).\" There is exactly nothing about that sentence that implies the boyfriend left as a reaction to her refusal of an abortion.", "It's not that people can't read, it's that you can't write, YTA.\nYou had every right to refuse Jane + kid to your party, but you're still very clearly an AH for several reasons.", "YTA simply because of the way you spoke to her. Also it's not the younger generation that's the problem. It's you. The abortion part was literally not even needed. Lol.", "ESH.\n\nit was rude of her to come to an adults-only party expecting you to provide a place for the kid, and i don't blame you for turning her away\n\nBUT, i do blame you for the wording you used as it's unnecessarily insulting and misogynistic. was ths detail of her \"refusing to get an abortion\" relevant, and was calling her a selfish bitch really the best thing to do? there were more polite ways to handle this and your approach is not one of them.", "ESH - Jane sucks for bringing a kid to a party she knew she wasn't supposed to bring a kid to. You suck cause you're actually kind of an asshole.\n\nYou went too far when you blew up at Jane. You immediately went for the favorite gendered insult of lazy men everywhere, you called her a bitch. Unless you're a dog breeder you should have dropped that word from your vocabulary ages ago.\n\n&#x200B;\n\n>The younger generation really is dumber. Sorry I had to insult your intelligence, but this is very infuriating.\n\nFirst off you sound like a crotchety 70-year-old. Second, really, everyone who understands that the only reason you included that explanation as to why Jane is a single mom is that you do think Jane should have the abortion is just a child who can't read? Why Jane is a single mom had no bearing on this situation, you really should ask yourself why you thought it was important for us to know that. And last, but most certainly not least, you did not *have* to insult anyone's intelligence. That's a choice you made because again, you're kind of an AH. Also think just a little about who it is that typically talks about other people forcing them to do terrible things. Who says things like, \"You made me insult you\" and \"You made me hit you\"", "yta, learn some ducking manners. A simple “kids are not allowed because of adult themes” would have sufficed. Jesus how is a 40 year old still acting 4.\n\nYour edits drive home what an ah you are, grow up and treat your wife with respect, that means be kind to her friends.", "YTA for not realizing that if \"so many people\" misunderstood what you wrote, the problem was the way you wrote it, not the people reading it.", ">(by the way she's a single mother, her boyfriend left her when the baby was concieved and she refused to get an abortion).\n\n\n\n\"by the way she's a single mother, her boyfriend left her when the baby was conceived BECAUSE she refused to get an abortion\" \n\nThere ya go big guy, fixed it for you\n\nYTA", "I was thinking he was drunk during the verbal altercation, and was probably still drunk when he wrote this post. Wtf, guy. Chill the fuck out.", "I reacted the same way, and I am 50. 🙄 It was wholly unnecessary to make the remark about abortion. YTA for that, OP, and for the “bitch” part- she was selfish, etc, and I would have told her to leave too - but calling her a bitch? Again, wholly unnecessary.", "100% agree. His edit only makes it worse.", "Not sure why OP feels it's important to add so much extraneous information. We don't need to know which day is really his birthday or the circumstances of why Jane is a single mom. In fact being a single mom is irrelevant to post.\n\nAgreed that OP's TA because of the manner he addressed her. There were so many more courteous ways he could have addressed the situation. \n\nI would die if I was his wife, and he probably killed the whole party with that behaviour.", "Agreed. I was glad however that OP clarified that Jane Doe wasn’t her real name…", "This.  Edit 1 gives off major Principal Skinner energy.\n\n“Am I garbage at communicating?  No…it is because thousands of others can’t read.”", "> OP seemed to put a lot of emphasis on Jane being a single mom and explaining why. It just came off as very unnecessary to me.\n\nAgreed. No reason to mention that she wouldn't get an abortion. Not your fucking concern, man.", "Love your second edit. \n\nOP’s second edit makes him sound unhinged.", "OP is an idiot and a shit-writer, according to the edits. That \"and she wouldn't get an abortion\" should be \"because she...\" if that's truly what he meant.", "Also found the younger generation comment ignorant and amusing. Someone should introduce OP to studies on the Flynn effect.", "Yeah it just comes off as TMI. Easily could have ended after saying she is a single mother. \n\nThis could explain why they were immediately so hateful toward her.", "OP has a holier-than-thou complex and it shows.", "I'm going YTA just because it seems OP likes to insult people based off the post and his comment saying, \"The younger generation really is dumber. Sorry I had to insult your intelligence\".", "I'm the same age as OP and I understand that wording matters when you're trying to get your point across. OP just seems to expect everyone to try and infer how real meaning without him making the effort", "OP worded it wrong if he ment baby dady left her because he wouldn't get and abortion he should've just said that. Yet he chose to say AND, not BECAUSE. The \"misunderstanding\" is 100% on OP, not on the \"dumb generation\"", "I know they’re such a huge a hole it’s insane how people can post stuff like this and have no self-awareness.", "It’s helpful OP included the info that makes it clear that they are unhinged.", "I'm older than him too. Great he's using our generation as the excuse for his poor behavior.....(sarcasm and eye roll there)", "Right? 😂 I'm usually a stickler for e s h if both parties fucked up in some way but OP assholed so hard it undid her assholery.", "I see I'm not the only one who looked at his post history.", "Right? He seems to have a serious problem with that.", "Honestly if I were there I would've left after that.", "She wasn't selfish because she couldn't afford a sitter. She was selfish because she chose to bring the kid anyway instead of just staying home", "Imo he could even go ruder than that without being an asshole. Eg \"inconsiderate of what? Your entitlement to prioritize what you wanted over the boundaries of the host and the person the party was for? Or your attempt to emotionally manipulate me into making an exception by showing up with your kid and your sob story instead of contacting us in advance and asking for help making arrangements? Why should I be considerate of your problems when you don't show consideration for my boundaries?*", "He mentions it because he judges her for it and it explains why he was cruel to her. \n\nYeah, bringing the kid was a no-no. Blowing up at her was a bigger fuck up.", "Are we sure op isn’t a teenage troll? I am an adult but what in the world is a sex theme?", "Also doesn't want kids because swearing, then swears at mother in front of child.", "Honestly, I thought the phrase \"killing it\" in this case was pretty funny.\n\nAnyway, I'm in this camp, too. My dad peaced out because my mom \"refused\" to get an abortion. Pretty good call on her part, I'm happy and grateful to be alive, and my mom is doing really well in her life, eventually remarried a great guy. She did get another abortion, a little later, though. Timing was different, made sense at the time. It's a complicated issue.", "Yeah I get OP needs to work on his grammar AND his tone but none of that takes away from Jane being an AH who deliberately ignored the terms of invitation and then had the audacity to criticise the hosts for throwing their party on their terms. Judgment solely based on the AITA question should be more ESH than YTA. OP is the AH for how he kicked her out (the B comment in front of her child is unnecessary and abusive), Jane is the AH for showing up at all and then being stubborn and somewhat derisive in her attitude. ESH.", "Maybe because the term single mom doesn't imply the father is not present in the child's life. Single as in not in a couple and mother as being the kid's mom. \n\nIt also sounds more like the father suggested abortion and the mother declined. Which is what refusal is. \n\nI don't think OPs reaction was warranted, but a lot of people seem to be making it a lot worse than it actually is because of how he tried to give context. The context being that the father isn't in the child's life. Did we need to know about why he's not there? Not really.", "😆", "Lol Probably like adult board games", "An a-hole", "He very well could be. It reads like the content warnings on TV. *OP's party is rated NC-17 for foul language, alcohol consumption, and sex themes*", "If that is the case, he got hammered today as well considering how he responses to the comments and the party itself was 5 days ago. Or, he's one of those people where it takes a week to sober up...?", "I think he shared all that to give us more reasons to hate on Jane.", "Yeah…. I’m older than he is and I read it as “daddy dipped and she refused to get an abortion” not “daddy dipped *because* she refused to get an abortion.”\n\nI mean, I didn’t take it as “shaming” her for not getting an abortion, but the phrasing was odd.", "Exactly. If I say “I like to ride my bike and eat sandwiches”, I GUESS you could interpret it as I like to eat sandwiches while on my bike, but there are much clearer ways to word that to get that point across. No need to insult everyone younger than you as if your inability to write clearly is some indication of the overall intelligence of the younger generation.", "I giggled.", "Why no \"Happy Birthday! We just stopped by to say hi and give you a hug\" option?", "\"Maybe because the term single mom doesn't imply the father is not present in the child's life. Single as in not in a couple and mother as being the kid's mom.\"\n\nTrue, so all he had to say was the dad isn't in the picture and she can't afford a sitter. That communicates the point without giving us a paragraph on the circumstances from nearly a decade ago that led to being a single mom. None of that had bearing on the story.\n\nAnd from where I sit, the reason I'm reacting so strongly is bc he not only gave us so much unnecessary back story -- with the kind of details society loves to judge -- he combined it with misogynistic name calling.", "Not necessarily. I’ve read a lot of posts here where people don’t think information is pertinent (even though it is) and they don’t add it.", "OP has united the generations.", "He's also so caught up in the 'and/because' drama he is not getting the central point of the fact that he mentioned any of this for the purpose of this story seems judgmental and a red flag- like when someone mentions a person's race in story where it doesn't belong.  The kid is 8. Why he wasn't aborted is not at issue in this story ( even if the mother didn't fully think through that she have to miss out on OP's birthday party at some stage if she went through with the pregnancy) yikes man", "Funny, him trashing younger generations. Reading his comments from a now deleted post, his thirteen year old daughter got caught vandalizing school grounds with antisemitic slurs with her friends.….. \n\nHis wife defended the daughter so he and her added to the degradaption of the gene pool imo. But I’ll take stupid over antisemite any day.", "\"Sorry I had to insult your intelligence, but this is very infuriating.\" is the kicker. He had to do no such thing, insulting everyone's intelligence was a choice he made. It makes me wonder what else he finds himself \"forced\" to do to keep the people in his life in line.", "His edits made me immediately go that he's TA.", "I suppose. I still firmly believe this is a shit post written by a teenager who is imaging what adult birthday parties are like and how 40 year olds behave, but you are right that it’s possible to forget pertinent info.\n\nI’m early 40’s, and I know many early 40’s people, and none are having sex themed 40th bday parties full of swearing and screaming at people in front of their children. None of this screams normal 40 year old real life behaviour. This is adult life as imagined by a 16 year old redditor.", "I like how you phrased this as if you were personally at an awkward daytime sex party and it was classless ha.", "He honestly is cause I'm seeing a lot of people OP's age and older who think he's a stupid asshole", "Yeah, he says the kid has no father because she refused an abortion. The reality is the kid has no father because the father chose to not be involved. Way to blame the woman.", "Maybe it's actually quite clear, and he just doesn't like what that means. I think he wrote exactly as he intended it, he just expected more people to have the same view of his childish behavior towards another grown ass adult.", ":D"]}