{"id": 7183, "submission_id": "10a9fqx", "title": "AITA for telling my date to go back home when she showed up 30 minutes late and half drunk?", "selftext": "I (28M) am currently dating this woman (28F) (not BF/GF yet, but we were kinda reaching that stage). I'll keep the prompt super short. But basically she was hanging out with friends before our date night and she showed up to our date at my place (I was cooking something for the both of us) 30 minutes late (without texting) and she was half drunk.  \n\n\nI'm usually chill about someone being late up until 15-20 minutes, but for some reason the 30 minutes combined with being half drunk made me super mad. I basically told her to go back home and that I was too mad to even enjoy our evening. She responded by saying I was over reacting and that I was at my house anyways so I could do something else while waiting (as opposed to waiting at a restaurant/bar).  \n\n\nAITA for doing that?", "created_utc": 1673554551, "permalink": "/r/AmItheAsshole/comments/10a9fqx/aita_for_telling_my_date_to_go_back_home_when_she/", "score": 567, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I told my date to go back home when she showed up late to our date at my place (and was also half drunk).\n\n(2) It might make me the asshole, because she said I was one by taking that action. I thought my action was pretty normal, but apparently she vehemently disagreed.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If she's trying to date you and already shows you this lack of respect, I'd be hesitant about moving forward honestly. Had she apologized and just said time got away from her and she was sorry, that would be fine and it happens. But blowing it off and saying it's not a big deal just makes me angry when people do that.", "NTA. She never reached out about being late and was drunk and hanging out with a drunk person is no fun. If you're upset then I agree there was no point in hanging out it's already a wash of a night.", "NTA at all. that is so rude, you aren’t close enough yet to be okay with something like that, and even if you had been dating for a year or something it would still be a shitty thing to do.", "NTA. I would be ok with it but it's my culture and people are usually ok with these things where I live. I have lived and visited other places where this is not ok so op has the right to not accept it.", "This is super disrespectful and trashy. NTA", "NTA. Not respecting other people's time is super rude. And so is showing up drunk. Good riddance!", "NTA. It’s ok to have standards and that behavior ain’t it", "NTA. It’s disrespectful to be that late especially with no notice, and I can understand why you weren’t interested in spending time with someone who wasn’t able to be fully mentally present. I don’t think you’re overreacting. I hope she can understand why you were upset after she gets a chance to think about it.", "NTA, it's disrespectful to arrive that late and in such a state.", "NTA - she could have let you know she was late and been honest about having being drunk. A text doesn’t take a minute.", "NTA - Being late is disrespectful of other people's time. The very least she could do is text you and let you know she was running behind.", "NTA. Trying to time food for someone's arrival only to have them show up half hour late without texting or calling is frustrating as hell and can ruin the meal depending on what you made. I think we've all been there where we got having fun with friends having some drinks and lost track of time though, so I can sort of see how that could easily happen. But if you're not feeling it that night and that made you upset enough to not want that person to stay and be around, then you had every right to end the date and send her home. Although I think you'll be cooking for someone else after this lol", "NTA.  She was being inconsiderate.", "INFO did you know she was going to be hanging out and maybe drinking before the date?\n\nFor me, I knew that beforehand, I think I’d expect something like that. But if I didn’t, I’d be pretty pissed.", "NTA. She kept you hanging and showed up inebriated. What if you were planning something time-sensitive, or something where you both needed your wits about you. She should have postponed with you if she knew she was going to go out with her friends beforehand and drink. Pretty rude on her part.", "NTA \n\nTwo 🚩🚩in one night, no waiting. Consider this a prelude to what's to come.", "Take it from a guy who dated a woman who did this except in my case she was really drunk, Don't date her. \n\nThey'll take advantage of that act of forgiveness and will constantly be doing it even if they say they won't.", "NTA. You might want to move on from here. This relationship is way too early to put up with nonsense.", "NTA.  I only wait 10 mins past the dating time for them to show up.  Past that, I'm out.", "NTA\n\nYou get to set your own boundaries.  If her showing up late and drunk is a line for you, it's a line for you.\n\nSet firm boundaries with this person if you want to consider seeing them.", "More information needed. Did you know what her plans before seeing you were? Did you communicate your expectations about timeliness and sobriety to her? Would you ever do such a thing to her or another dating partner? Sounds like you have decisions to make about your boundaries and expectations. Be aware that this is who she is, and she just set a precedent, so if you don't want to be with someone who thinks what she did was totally cool, you should think hard about future plans or commitments with her.", "NTA.  This is what dating is for.  Now you know.", "She should have texted that she was running late. Yes, she's right there's a difference between showing up late to someone's house and to a restaurant where you could lose your table, but 30 minutes warrants a text.\n\nIf you had told her that it bothered you, and if you gave her a chance to apologize and see it from your POV, then you would not be the AH. But to kick her out? That makes ~~Y T A~~ ESH, and this is a great sign that you're not compatible.\n\nOn top of that, it's weird to be mad at her for being \"half drunk.\" What's that—buzzed? She was hanging out with friends, she had a couple of drinks. She wasn't projectile puking on you.", "NTA who shows up to a date drunk? Honestly I’d be wondering if she has a drinking problem, that’s completely unacceptable and rude on her part, I think you just dodged a huge bullet!", "ESH, though it's pretty low on the scale.\n\nDon't show up late and visibly drunk to a date. Don't boot someone the first and only time it happens.\n\nRight or wrong aside, there goes the BF/GF thing, perhaps.....", "Mild ESH. \n\nYeah she could have sent a text to say she had been held up, but I wouldn't care particularly if it was me. I'd crack a beer from the fridge and play catch-up. If you really got 'super mad' over this, she was right - you did over react. \n\nYou probably both dodged a bullet with each other if this is the kind of thing that bothers you.", "NTA. She doesn't respect you enough to give you a heads up that she's a bit drunk or going to be late.", "NTA you don't want to date someone with this attitude:\n\n>She responded by saying I was over reacting and that I was at my house anyways so I could do something else while waiting\n\nPlans are still plans even if they're at your house. She expects people to wait around at home for her until she feels like showing up?", "NTA\n\nIf it was the other way round, it wouldn't even be a question. Its not hard to text to say you're gonna be late. Just a little communication", "NTA. Maybe some people wouldn’t have a problem with that, but you do. You’re allowed to not continue dating someone for any reason you want.", "NTA.  At this stage in the relationship, you were right to not deal with this.  The only thing I'd want to know - is how did she get home?  OP says she was 1/2 drunk - so I hope OP didn't let her drive in that condition.  If OP did let her drive drunk - then I'd change my vote.", "Honestly, it seems like you are pissed she had fun with friends and wasn’t fully focused on you, that you got jealous and are making a big deal out of something minor to justify it. Well, you were cooking and not at a restaurant or somewhere waiting. You definitely overreacted on this. It would have been nice if she texted but your reaction was over the top.", "ESH   she was out with friends, lost track of time & had a few drinks. Would I be a little upset - yes, but I think you over reacted.  Plus- she must have been hungry & could have used some food to soak up the alcohol.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (28M) am currently dating this woman (28F) (not BF/GF yet, but we were kinda reaching that stage). I'll keep the prompt super short. But basically she was hanging out with friends before our date night and she showed up to our date at my place (I was cooking something for the both of us) 30 minutes late (without texting) and she was half drunk.  \n\n\nI'm usually chill about someone being late up until 15-20 minutes, but for some reason the 30 minutes combined with being half drunk made me super mad. I basically told her to go back home and that I was too mad to even enjoy our evening. She responded by saying I was over reacting and that I was at my house anyways so I could do something else while waiting (as opposed to waiting at a restaurant/bar).  \n\n\nAITA for doing that?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta. She is giving off red flags already and you aren’t even in a relationship yet. Yikes.", "Info: \n\nWhat does ‘half drunk’ mean?\n\nAnd what was said about what time she would arrive prior to this?\n\nAnd what’s the precedent for lateness in your relationship? Are you both usually very punctual, is there an unspoken ‘20 minutes is fine’ that might be construed by one party as ‘30 minutes is fine’?", "NTA. I mean I MIGHT be able to forgive 30 mins late on it's own... but also drunk. Hell no.", "NTA - sounds like you’re dodging a bullet already tbh", "NTA she was disrespecting your time you put into making a nice dinner by being sloppy half drunk and being lazy by showing up 30 minutes late.  You definetly were not the priority for her that night.", "NTA and cut her off that behavior is for the streets not commitment", "NTA but if you really liked her you probably wouldn't have cared or forgiven her. The fact that you kicked her out tells me you weren't that into her", "NTA, and this is a sign of things to come.", "NTA. Sounds like she was with someone else, maybe another guy before she got to your place. She is definitely not GF material. Treat her as a FWB and be on the lookout for someone else.", "NTA - it's terribly disrespectful on her part.  Good for you.  Gonna warn you though, this probably won't be the last time this happens.", "NTA. Please keep this in mind when you decide if you want to pursue this relationship.", "NTA.  If you don't set your boundaries now, she'll never adhere to them later.  Is she driving while she's half-drunk?  I guess what I mean is, did you let her drive half-drunk, or did you at least call her an Uber?  Having seen up close and personal the damage drinking can cause, I don't think you're TA at all.  And being late when somebody has invited you to dinner is just plain rude.", "Yeah I can't imagine leaving someone waiting for 30 minutes and not apologizing. \n\nYou're so right. It's a basic respect and decency thing.", "This! She was unrepentantly disrespectful. If you had let it go, she would would keep treating you this way or worse. \n\nI agree that if she apologized and didn't repeat the behavior it would be different.", "For me if I have multiple plans in a day I plan accordingly. I don't say they know I have plans I can keep them waiting", "I don't think she's right. There's a difference. Both are disrespectful to the person you're making, wait for you.  Also both have consequences, restaurant you can lose your table. Cooking at home, he could have had everything plated ready to go, and now the food is cold waiting for her. \n\nAlso if he no longer want to continue the date he had all the right to ask her to leave, unless you believe people are obligated to allow people to stay in their home even if they no longer want them there.", "It’s rude to drink to the point someone can tell and show up at their house. Having one drink is fine.", "Does someone have to say \"hey when we have a date can you be sober and not a half hour late\"?", "You're laid back, and that's fine. But no one should have to put up with someone having an attitude of 'it's just a meal at their house, they can wait'.\n\nThat's not a habit you want if you're the one cooking regularly.\n\nIf she was genuinely apologetic it would have been different.", "It would have been an overreaction if she was apologetic. Since she didn't apologize for being late, I don't see it as an overreaction.", "She was too busy getting drunk with friends… /s", "I guess I’m potentially envisioning a scenario where there this could happen and I wouldn’t consider it rude. \n\nEg: “I’m going out for a few drinks with my friends after work, so I’ll come by after that, around 7?” \n\nVS “I will be there at 7 for our dinner date!”", "No, you see, if a guy showed up to a girls house late and buzzed, it’s a red flag and she should kick him to the curb.\n\nBut here, she was *clearly* just girlbossing! OP is being such a a killjoy! You can’t just turn someone away if you’re uncomfortable!\n\n/s, obviously.", "I'm wondering what state she was actually in. OP was (rightly) upset about her showing up late, so could he be rounding up \"in a happy mood and w/breath smelling like booze\" to \"half-drunk\"? If she were drunk, he would have said \"drunk.\"", "Right, I'm wondering if there may have been a misunderstanding about how firm the time was. Makes sense that he would be getting angrier and angrier sitting at home, while she was unaware that he'd feel that way.", "I admit that while I don’t think he’s TA, I do find OP to be a bit angry/punitive. This is a situation that would have the potential to annoy or frustrate me, or lead to a more serious conversation, but I can’t picture myself getting that mad over this, or making the person leave. \n\nThis isn’t a first date, OP says they were on the cusp of making it official. I feel like at some point in all relationships, timelines get more flexible, and you stop showing up at 7:00pm and start showing up at “7ish,” or “whenever I get there after work.”\n\nAnd she showed up buzzed (that’s all I can imagine that “half drunk” means.) I also don’t find this that crazy. She didn’t show up shitfaced, she just came over after going out with friends. In a broader context, this seems like normal life stuff. It feels like something I’d do, and it feels like something the people I’d date would be fine with and do themselves, when the relationship progresses to that point. \n\nIt’s clear they have different expectations, and that’s okay, but the more I think about this, the more ambiguous I find it.", "Info: did she drive herself to your house half drunk? Did you send her out to drove home half drunk?", "Did she drive to your house? If she did and you put her on the road drunk because you were mad, you'd be an AH.", "NTA\n\nI already don’t have enough hours in the day to get things done. If someone wasted half of a WHOLE ASS HOUR and didn’t apologize or have a good reason, I’d be upset", "You say you are reaching the gf bf stage... you might want to reconsider.\n\nNTA.", "NTA I could maybe forgive the lateness with no notice if it was something important but showing up half drunk and late? Nope. That just means that she has more respect for getting drunk than making an already set date with you. Then her trying to justify it like there is any justification is just icing on the cake. All she had to do was apologize and let you know your time is important to her. I would take this as a warning of what is most likely future episodes of the same type and cut your losses before you waste more time and energy. Best of luck.", "NTA.  She couldn't even make a simple apology.  This may not be a deal breaker  for you but know you have been warned. 🚩🚩🚩", "NTA", "NAH - I think it depends on the group but at least in my friends group half an hour late is a pretty normal time to arrive for anything. I'm not sure if this was implied in your post but I wouldn't expect to be able to keep seeing her after that though", "YTA for kicking her out. If there hasn’t been an expectation or boundary set around drinking or punctuality you have no right to expect others to behave in a certain way. Personally I don’t see the big issue here, but I’m a pretty flexible person. Should’ve had a conversation about it and moved on.", "NTA. It's about respect. I've been the asshole in this situation before, and she/we deserve it.", "NTA - she’s showing you that she doesn’t respect you enough to show up on time or sober - wasting your time. You know what to do.\n\n(Also did she drive drunk???)", "NTA when you're in the early stages of dating everyone is on their best behavior. They're looking, acting, and playing their best self. If she's already showing you she's inconsiderate believe it.", "This could be NAH.  It could very well be possible for miscommunication and both parties good intentions.\n\nOr it could be NTA.", "NTA. It sounds like to me she’s not as interested in pursuing a relationship as you are. If I were excited about a potential relationship, I don’t think I’d even make any other plans knowing I have a date. You deserve better.", "NTA. You had a date planned, and you were making dinner. She ruined the dinner plans. I think it's weird to show up drunk to a date. It's not classy.", "NTA.  She didn't even bother texting.  She has no respect for you, already.  I'd nip this one in the bud.", "I’m going to go WAY against the grain. Half an hour late is not that late. No one plans to have food ready the second the other person steps in the door. Also, half drunk… half drunk for most people is fun. \n\nI think you were pissed and blew something tiny out of proportion. YTA.", "I'm sure I'm gonna get downvoted but is there no room for error?  People sometimes hang out with their friends and have too many and lose track of time.  She didn't ditch you, leave you on read or ghost you.   I didn't see where OP says this has been an issue, he's complaining about the one time and then he threw a tantrum and ended a date.  \n\nYou just kicked out of your place a female you are semi-serious dating because she was half white girl wasted?  So dumb.  No spontaneity.  \n\nNow what?  You thought you could be \"serious\" with this person but your resolution to some percieved slight is to kick her out of what could be someday a shared space if you Live together.  She's probably on the phone talking to her girlfriends about you while you are on reddit, eating alone.  You good job.  \n\nI'm sure her next boyfriend won't be as immature, less uptight and will be most certainly be more fun to come home to.", "NTA she doesn’t like you. If a woman was really into you should would have been a little early ( men too) . Don’t waste your time. You’re her back up.", "Yeah had she sent a quick \"sorry, lost track of time, see you soon!\" message I'd say OP was an AH, but to give no heads up and show zero remorse makes it NTA", "Agreed. Here he is making a special dinner and he's thinking I'm going to make it official. She shows up blitzed and late. Where in there does it show she cares about him this much?! 🤔 I understand if she went out but I feel like of I'm crazy about a guy I'm dating, I would be communicating with him that I'm out, maybe start dinner later, and hey, I'm about to leave to head your way now. If he means anything to me, I'd be communicating with him.", "When I hear \"half drunk\" I picture a person who definitely has a buzz... and probably shouldn't be driving.  Not falling down drunk, but clearly on their way there.\n\nI would have been unimpressed too, and not very interested in continuing the relationship... mind you, I generally don't like hanging around drunk people.", "Op wasnt worried about drunk driving? Buzzed driving is drunk driving.", "I just commented something similar.  A person in a serious relationship doesn't kick the other one out for some perceived slight about something in the grand scheme of things is unbelievably minor in comparison to literally just about everything else.  I wouldn't fault the gf doing some thinking of her own about the person she is dating.", "It doesn't say anywhere in the post that she was driving, just that she showed up. She could have walked, taken public transit, Uber, a friend dropped her off after the drinks... We don't know.", "Do we know she drove?", "Relax it was half hour ahe was already out with friends she didn't blow you off. She had a few drinks what's the big deal?? Being a bit Of a prude", "NTA, not too far from NAH wouldn't be a dealbreaker for me, she'd been enjoying time with her friends but you have a boundary and you kept it, nothing wrong with that", "Slightly different because I'm married - but if she turns up late *and* half-drunk... well that's a good time right there.\n\nThere's enough annoyance to find in the world; take the opportunities where you can!", "NTA - if this is how she’s treating you this early on, don’t expect it to shape up to be any better.  People usually put their best foot forward in the beginning and this one is already stumbling.\n\n\nYou can have an honest conversation about how it made you feel (time wasn’t valued, minimal respect, didn’t communicate tardiness) and see how she reacts to it. Up to you to take it from there. \nShe can either apologize, understand and be more courteous moving forward or not.", "NtA but you may have ended things. Hope you’re cool with that.", "NTA, if a person doesn't show up on time it means they don't respect your time, never mind that being half drunk shows she would rather drink with her friends than see you, I'd reconsider getting in a relationship with someone like this.", "NTA. \n\n\nBut her lack of respect for you, your time and the time you want to spend together speaks volumes.", "Im not sure, maybe YTA but I understand you. Once I was going to have a first date with this girl and she texts me 5 minutes after the time saying she was going to be a little late. Liike oh really, you just noticed? So she would be like 20 or 30 more minutes late and I answered \"you know what, I am mad and I am sorry. We cant have our date today because I wont be able to fake it so lets just meet some other day and please be on time\". \n\nThat second date never happened. Was I wrong? Maybe, but Im the most punctual person ever, so I cant stand unpunctuality.", "NTA she doesn't seem to have considered how you would feel to her showing up half drunk and late, if I was you I wouldn't forgive her but I'd have a talk with her about how you felt it was inappropriate when she's sober", "NTA, drunk people are boring, and to show up 30 minutes late on top of that is just taking the piss.", "Agreed, if you were sat around in a restaurant for 30 mins on your own you could be justifiably annoyed. But you were at your own house, could have stuck some music on, had a drink or 2 and maybe been on a similar level to her. Could have been a great night had by you both but you took this way too personally", "I’m wondering this as well", "I’ll bite. If I’m cooking dinner for someone I just started dating, it’s likely something I’m cooking to impress them that could cost anywhere from $50-$150. Showing up a half an hour late without a heads up and drunk to a meal I invested time and money in because I want to show them I’m interested would infuriate me, it’s disrespectful. And I would not continue dating that person.", "OP seems like he has a stick up his ass. but people on this sub are obsessed with punctuality so he'll get NTA votes", "I’m obsessed with punctuality and I still think OP sounds like he has a stick the size of a redwood up his ass.", "I'm exactly the same regarding drunk people. I do not have the time nor the patience to deal with individuals like that. However not everyone is okay with people being late.  \n\n\nBeing late to a pre-planned event without phoning to apologize speaks volumes on how that person has no respect for anyone else's time or plans and is only concerned about themselves.", "INFO: Did you communicate your thing with punctuality? Does she have a habit of ignoring it? Did she tell you she would arrive at x time, or was it more like a \"around x\"? Did you know she was going drinking?\n\nThere are so many nuances, none of which you have made clear.", "you have a stick up your bum", "YTA, and I say that as someone who's always on time and expects the same. Stuff happens. She had one drink too much with friends, might not have seen time pass and still got there 30 mins later, which isn't too long to wait, especially when you're literally at home. She could have texted but didn't. Alright, it's still just 30 mins and you're home, comfy. \n\nTo the people who imply this is a red flag, like what? I think OP not giving her the benefit of the doubt, and kicking her out instead of just giving her a chance and enjoying the date together is actually the red flag here.", "NTA, I wouldn't go either.", "NTA and don't date her anymore. She's not remorseful for her disrespectful behaviour. I hope you were calm and didn't yell. Calm reproof in most cases, will have a much bigger impact than yelling will.\n\nThere are much better people out there than her. Hope your standards are high.", "Nope nta", "Shes showing you her friends are more important than you are. Red flag!", "NTA. If the inconsideration for your time is already starting now, it's only going to get worse.", "Yeah, we couldn’t date. She was out with friends and made it to you a little late and a little drunk. Not a big deal. I mean, you’re NTA but clearly not compatible with this woman. I remember a guy getting bent out of shape when I was a little late for a date. I thought, this won’t work. But I acknowledge timeliness matters to some people.", "You were a chore basically. Since she agreed to go to you already. She was only there because she felt obligated, not because she wanted to. Hell if im serious with someone. I could be late. But sure as hell id be in touch to make all the excuses i can so not to offend my date. I have never been late on a date though.", "Sounded like she was trying to put herself in that ‘MOOD’… I think you overreacted and dropped the ball on getting some smh", "Seriously if I were to act like that toward my latino friends we wouldn't speak anymore", "Someone’s setting the bar extra low.", "I dont think what she did was particularly wrong. Sometimes you get the taste for it after a few drinks with mates. However this guy was left in limbo, didnt know what was happening. I think that is just unfair on him. Did he need to ask her to leave, no. But if the guy felt uncomfortable and was unable to shake it off and enjoy his night, then I don't blame him. I think she deserves a second chance, but don't sacrifice your own expectations just to find someone. It becomes then a slippery slope.", "I'm going to flip out because they were out with their friends before out date? What she supposed to be all home all day until their date? Geez it's not the end of the world", "OP said they are on the cusp of being official. \n\nIf they were both thinking about getting serious, the girl was probably looking at OP as someone she could “come home” to. My partner and I don’t always do things together but there are plenty of times where we’ve made plans to hang out after being out with friends. I’ll cook or vice versa. I wouldn’t be mad if they were late.", "One can go out with friends and still be on time for a planned date. It was rude of her to not text or call and then to show up half drunk, especially when you consider it's pretty normal to have a glass of wine or two on a dinner date. Was she just gonna continue getting drunk at his place?", "I can agree she should have sent a message but this is just my opinion if they were just going to hang out at his place and not go anywhere I wouldn't be upset over half hour. It's not like he was sitting at a restaurant waiting on her, unless we had somewhere to be a play, a concert, a sporting event, dinner reservations at a certain time its not a big deal also She had some drinks what's wrong with that??? Sounds like he is bothered she has alife aside from him", "Whenever someone uses the argument “you’re home anyway” I can’t help but wonder. When you’re at home, do you just sit and stare at a wall doing nothing? Waiting for something to happen? Being home doesn’t automatically mean you have nothing better to do than just wait around.", "There is no indication that she drove. Could have had a cab drop her off. \n\nAnd that's fine that you do not enjoy drunk people, but I am assuming you would communicate that with someone you were potentially about to enter a serious relationship with. It's unclear whether OP shares your reservation, or made it clear", "More of a reason to not be bothered if he has things to do at home. I would think someone is crazy if they flip out because I was 30 minutes late to hang out at their house  🤣. Not like the Netflix movie started without her. Maybe the girl wanted to go out and not hang out at home.", "People whoe doesnt care if they waste my time and our plans goes straight to trash, NTA", "NTA Is it possible she has a drinking problem?", "NTA, it was disrespectful to show up to a preplanned date 30 minutes late and tipsy. You didn't have to put up with that, especially when she didn't bother to let you know she was running late", "Yeah if she wasn't absolutely sloppy drunk I'd say you've just successfully killed that relationship. Well done", "NTA. Who the hell shows up to a date half drunk and late on top of that? You were right that she should have gone back home....but did she drive drunk? - That's super irresponsible of her if she did, and I'd be noting that as a red flag moving forward - if you move forward.", "NTA. Thankfully you aren't a couple yet so it will be much easier to tell this person to kick rocks. Obviously you can still try to have a relationship with them if you want but I wouldn't want to date someone with no respect for me like that.", "ESH. I think your reaction was a bit extreme. 30 min is not that long of a time and she could have been nervous so she had a few cocktails with friends. Either way sounds like you guys weren't right for eachother bc she didn't respect your time and you got angry and sent her home lol", "Long time super-lurker, first time commenter. But this post left me *shooketh*.\n\nCan't give a judgement, because I have never in my life seen an AITA post that is more culturally alienating to me. I am Irish, and OP sounds like the definition of shit craic (an uptight, Moody Michael). Then again, if Irish people kicked out friends for showing up 30 minutes late and lightly fried, no one on the island would have company, at all. \n\nI'm 4 years sober by the way, so I'm not a fan of v drunk people... but like.... a little loosey goosey and 30 minutes late for calling on my *in to my house, where I am at my leisure* is something Id never, in my wildest dreams, consider 'wildly disrespectful'. \n\nAs Lorelai Gilmore would say, 'Calm down, German Train'.", "As someone who generally get annoyed as hell by lateness, I would have kind a been ok with it IF she had communicated she would be late and been apologetic when she showed up. But she did/was neither, which I understand why he was pissed.\n\nYTA", "Hi, I get what you're putting down.  OP's story is differently tho as they hadn't just started dating yet.  Also it's better, at least in my experience, to allow for delays when inviting someone over.  7p is come over and chill, maybe keep the cook company whilst drinking an adult beverage.  \n\nRelationship are difficult enough without resorting to exiling your partner off the island for being 30m tardy for a home-cooked meal because they got caught up with their friends.  You cannot control everything and OP seems to be skating on the edge of being that guy.  OP wants to pursue a serious relationship with this person and gets angry over a perceived slight, then proceeds to ruin the night? How dare she not contact me that she's going to be late when I know she's out with her friends!  \n\nOP wants to be bf/ gf but just showed his partner that he will not tolerate this behavior (30m late), and that's okay.  He could have maintained his cool, salvaged the night and maybe made a core memory.  He chose otherwise.  He might not be as ready or mature enough for a long term relationship as he thinks he is.  My opinion.", "Why are you trying so hard to excuse her behaviour? Being late if they agreed on an hour is rude, end of..."]}