{"id": 720, "submission_id": "yjnyn5", "title": "AITA for shouting at my uncle because “my mum has been through so much” when I had cancer?", "selftext": "I (f18) was diagnosed with Hodgkin lymphoma, which is a type of cancer, last year and I had 4 rounds of chemotherapy. My mum would help me by driving me to and from hospital so I could get this awful disease out of my body. When it was almost fully gone and I was having my last round of chemo I decided to have a get-together with my family. I was really happy that it was finally gone so I decided to have a few drinks to celebrate. By the end of the get-together, my uncle was alone with me in the room and decided to start saying “your mum has been through so much since you got cancer and you shouldn’t be getting drunk and stop being stupid, you should be grateful.” At this point, I was tipsy, not drunk at all and I felt hurt that my feelings had been invalidated because i had a couple of drinks. I can understand why he was upset since my family was probably just afraid of losing me. Although, my mum wasn’t the one with cancer, I was. I decided to yell back at him saying “I was the one with cancer not her!” I went upstairs and didn’t go back down until they had left. No one has ever spoken about it again. I just don’t understand how someone could say that I was being rude when I was just celebrating my cancer being gone. AITA?", "created_utc": 1667342942, "permalink": "/r/AmItheAsshole/comments/yjnyn5/aita_for_shouting_at_my_uncle_because_my_mum_has/", "score": 45, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I shouted at my uncle because my feelings had been invalidated since I had cancer.\n2) I may be the asshole because I shouted back at him when he was just probably scared of losing me.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Esh. He invalidated your experience, and you invalidated your mother's.", "Info: how long after your last treatment did this party take place?\n\nESH. Congrats on beating cancer.\n\nYour uncle shouldn’t have said that. But it’s absurd for you to disregard the fact that your mother hasn’t also been under a lot of stress.\n\nEdit: I’m asking because a doctor would actively warns someone about drinking while/shortly after chemo for lymphoma-types cancers.", "NTA\n\nYour uncle was completely out of line.", "NTA\n\n(Based on 'mum' I'll be assuming 18 is your legal drinking age)\n\nI don't see the connection.  I assume you also ate something.  Did eating something turn into a dismissal of your mum?  Did having people other than your mum at your party diminish your mum?\n\nSounds like your uncle drank to much and was upset that there was a party in your honor.\n\nBTW, taking you to the hospital and taking care of you while you are recovering falls squarely in the job description of 'mum'.\n\nI bet you probably thanked her more than once for her attentions.\n\n'Happy birthday, three cheers for the birthday child's mum.  Mum, blow out the candles and open your presents.' \n'Congratulations, graduates, and everyone give gifts to the parents.'  And other similar nonsense.\n\nCongrats on beating cancer!", "NTA. you’re so strong. congratulations", "NTA if your mom had a problem with you drinking she could have said that. Your uncle seems judgy.", "Oh, tricky! NTA, firstly.\n\nOn the one hand you have every reason to celebrate! And you should be validated.\n\nOn the other, people are often insensitive and learning to deal with that in a way that *you* like is important. It’s a skill, not something you’re born with. Personally I’d think through some options about how you could have reacted in a way that would make you happier (forget his feelings). If you want to share that with him, something like — when you said (x) I felt (y) and because of (a, b, c) I reacted like (z), but what I really wish I’d said was (d), then ask him what he thinks of that. Might deal with the tension as well as help you understand how you want to react when people are insensitive. And would give him a chance to apologise. Because, boo, you didn’t get to enjoy your party.", "NTA\n\nYour uncle was extremely tone deaf and while it is understandable that the cancer was a shock for everyone its no excuse to chastise you for a well deserved moment of relaxation, just dont let it go out of hand.  \n\n\nETA: Only thing that is a bit iffy is that it seems like your reaction invalidated your mothers feelings, but I am giving you the benefit of the doubt here and say it wasnt with malicious intend, just make sure to show your mum how grateful you are and how much you love her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f18) was diagnosed with Hodgkin lymphoma, which is a type of cancer, last year and I had 4 rounds of chemotherapy. My mum would help me by driving me to and from hospital so I could get this awful disease out of my body. When it was almost fully gone and I was having my last round of chemo I decided to have a get-together with my family. I was really happy that it was finally gone so I decided to have a few drinks to celebrate. By the end of the get-together, my uncle was alone with me in the room and decided to start saying “your mum has been through so much since you got cancer and you shouldn’t be getting drunk and stop being stupid, you should be grateful.” At this point, I was tipsy, not drunk at all and I felt hurt that my feelings had been invalidated because i had a couple of drinks. I can understand why he was upset since my family was probably just afraid of losing me. Although, my mum wasn’t the one with cancer, I was. I decided to yell back at him saying “I was the one with cancer not her!” I went upstairs and didn’t go back down until they had left. No one has ever spoken about it again. I just don’t understand how someone could say that I was being rude when I was just celebrating my cancer being gone. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  Your mother had not been through more than you had.  Chemo is no joke.  She certainly had been through a trauma, but the party was for you not for her.", "ESH except your mother. You are entitled to celebrate, but don't negate your mother's sacrifice to trump your own. It's not a contest and you can both have your sacrifices recognized without having to negate one for the other.", "What's the point of surviving if you're not allowed to be a normal eighteen year old and live your life? Are all cancer patients obligated to perform endless gratitude for others or just the very young survivors? \n\nYour uncle is trash. Tell everyone what he said. \n\nNTA.", "NTA. It's unfortunately common for adults to see kids/teens as something their parents have to deal with instead of human beings with emotions and needs all of their own. What your uncle said/did makes sense if you only focus on what your mom went through and completely ignore that you're a person.  \n\n\nAs scary as it must have been for your mom, your cancer isn't something you did to your mom, it's something that happened to you. Having a couple of drinks also isn't something you did to your mom, it's something you decided to do to celebrate. Even if you did get drunk, your cancer is irrelevant to whether or not that was inappropriate.", "Call for irrelevant info wastes OP's time.", "Doctors advise you not to drink for the week after you finish chemo. **Especially** for lymphoma related treatments.", "Like I said, your comment is a call for irrelevant info and wastes OP's time.", "It’s not irrelevant though. If mom has been leaning on her brother while seeing her kid through chemo and said kid is doing something against medical advice, it makes her uncle’s outburst make a lot more sense.\n\nETA: I want to call for INFO too. WAS OP cleared to drink? Had OP’s mom asked her not to drink? Reminded her of what the doctor said about no alcohol? Etc. Either way her uncle flipping out at her was a bad move, but there’s a huge difference in yelling at someone doing something dangerous and flipping out at someone for no discernible reason out of nowhere, and it would make the difference in a n t a and an e s h vote for me.\n\nEdited to change “this kid” to “said kid,” which is what I meant in the first place, no disrespect intended. I only meant that OP, despite being an adult, is still her mother’s sick kid to her mom.", "It would provide context for why the uncle would overreact like this if there’s a chance OP is about to start vomiting uncontrollably and actively disregarding doctor’s advice.\n\nIt wouldn’t justify it but that’s still something OP should take into account.", "How about you don't refer to OP as \"this kid\" since they have been through more than most adults. \n\nWhy are you so keen on OP doing something against medical advice? Why are you digging?", "NTA. Your uncle owes you an apology, but he sounds like the kind of self righteous AH who would never consider offering one.", "NTA.  I'm sure it was hard for your mother, but this was about you beating your illness and not about your mother.  It was really inappropriate of your uncle to try and invalidate your struggle and focus on your mother.\n\nEdited to fix a typo.", "Esh.... ur first thought was to get trashed?  Yes, ur loved ones do go thru cancer with you. You didn't do it alone.... as you pointed out.", "Nta", "Softly the AH for not understanding what your mother went through. You had the cancer but your mother watched her ‘baby’ have cancer. (Although you are eighteen, and will relate to your mom in some adult ways, a part of you will always be her baby.) \n\nI am the mother of adult children and wish I could take any of their hardships away. And as a mom, I put on a good face while my mind goes to every nightmare scenario when my children or husband have health problems. \n\nYour cancer was not a competition on who had it worse -you or your mom. It was a hell you both endured. While you are celebrating (and I am glad that you are and that you have reason to celebrate), I imagine your mom is still in the ‘what if it comes back’ ‘what if something else goes wrong’ stage.", "Hi! Lymphoma survivor here… drinking after chemo really depends on your body and how your exams come back. Every body and dr is different and I promise you she wouldn’t be drinking if it wasn’t cleared by her doctor.\n\nThat being said, yes its hard on families but she just went thorough hell… I promise you that the difference between her experience and her mom’s are WAY different ( and i say this as a cancer survivor and as a person that had to go through it on the family side with my father). She wanted to decompress and celebrate, she has EVERY right to lash out for that uncalled comment. \n\nAnd I can tell you that she KNOWS her mom also went through a lot but both things cannot be compared. \n\nShe is NTA.", "Because, as I said, if OP’s mom had told her several times she was under strict instructions not to drink because of her chemo and OP ignored her mom, possibly risking mom having to call EMS or rush her to the hospital, she was being an AH and frankly deserved to be called out, though not in the way her uncle did it. If uncle flew off the handle unprovoked, that’s a whole different ball game. I don’t understand what you don’t get about the difference in the situation. If OP’s mom and uncle just don’t like drinking, that’s one thing, but if OP is violating medical advice and putting herself at risk people in her life have the right to call her out.\n\nAnd I’m so keen on if OP was ignoring the whole “don’t drink after chemo” advice because depending on the chemo, putting alcohol in your system before your body’s cleared the drugs is an almost sure fire way to make yourself sick in a vast array of spectacular ways, anything from mild alcohol poisoning to freaking liver failure, which very way may have been why her uncle flipped out at her in the first place."]}