{"id": 7225, "submission_id": "10awluf", "title": "AITA Best of 2022 - Best ESH", "selftext": "##[Y’all suck](https://media.giphy.com/media/lkeglkgUiZvsFpCuDR/giphy.gif)\n\nLet's see, yesterday we talked about the biggest AH and the day before was best NAH. Today we want to talk about the posts where everybody sucked. \n\nTell us about the posts that made you want to send everyone to the corner to think about what they did. Where every person in the post was absolutely, positively, without a doubt an asshole. Share those glorious messes with us and submit your nominations below!\n\n___\n\nTo nominate a post, make a top-level comment with the link to the post. To vote on your favorite, upvote the top-level comment that contains the link. Contest mode will stay on for the entire 2 weeks to keep things as fair as possible, so make sure that you pay attention and read through the threads so you’re not making a duplicate nomination.\nAt the end of 2 weeks the thread will be locked and contest mode will be turned off.\n\n___\n\n###Keep things civil. Rule", "created_utc": 1673622018, "permalink": "/r/AmItheAsshole/comments/10awluf/aita_best_of_2022_best_esh/", "score": 60, "replies": ["[AITA best of 2022 mASSter post](https://www.reddit.com/r/AmItheAsshole/comments/1041a4g/aita_best_of_2022_masster_post)\n\n- [AITA Best of 2022 - Best Post Involving Food!](https://www.reddit.com/r/AmItheAsshole/comments/1041d6p/aita_best_of_2022_best_post_involving_food/)\n\n- [AITA Best of 2022 - Most Persuasive Comment](https://www.reddit.com/r/AmItheAsshole/comments/104umlm/aita_best_of_2022_most_persuasive_comment)\n\n- [AITA Best of 2022 - Most sympathetic asshole](https://www.reddit.com/r/AmItheAsshole/comments/105yaia/aita_best_of_2022_most_sympathetic_asshole/)\n\n- [AITA Best of 2022 - Most Empathetic YTA comment](https://www.reddit.com/r/AmItheAsshole/comments/106n7on/aita_best_of_2022_most_empathetic_yta_comment/)\n\n- [AITA Best of 2022 - Funniest comment](https://www.reddit.com/r/AmItheAsshole/comments/107gh9q/aita_best_of_2022_funniest_comment/)\n\n- [AITA Best of 2022 - Most difficult decision](https://www.reddit.com/r/AmItheAsshole/comments/108bvhj/aita_best_of_2022_most_difficult_decision/)\n\n- [AITA Best of 2022 - Best NAH post](https://www.reddit.com/r/AmItheAsshole/comments/10971av/aita_best_of_2022_best_nah_post/)\n\n- [AITA Best of 2022 - Biggest Asshole](https://www.reddit.com/r/AmItheAsshole/comments/10a1o00/best_of_2022_biggest_asshole/)", "[Telling My Parents That They Ruined NY Celebration ](https://reddit.com/r/AmItheAsshole/comments/1031mvi/aita_for_telling_my_parents_that_they_ruined_ny/)\n\nEdit: I can’t read and this comment is a mistake.", "[Missing FIL's funeral after MIL booked husband first class and me an economy seat](https://www.reddit.com/r/AmItheAsshole/comments/ydcy8i/aita_for_missing_my_fils_funeral_after_my_mil/)", "[deleted]", "[Everyone in this lightbulb of a story.](https://www.reddit.com/r/AmItheAsshole/comments/wgon7i/aita_for_getting_matching_tattoos_with_my_best/)", "[The one where the definition of “Harvard alum” became such an issue](https://reddit.com/r/AmItheAsshole/comments/wefulu/aita_for_telling_my_date_that_he_shouldnt_call/)\n\n… so many levels here. Why not be honest about who you are; why only date Harvard alumni… and who googles the details of a course on a date!", "I am so bad at using reddit on my phone that I don't know how to make this a hyper link. But I had to disgrace myself publically because we all know the one and only answer is...\n\n[Essence of Tomato.](https://www.reddit.com/r/AmItheAsshole/comments/tmxe42/aita_for_being_mad_my_bf_wont_make_noodles_the/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button)\n\nEdited because u/OSUStudent272 showed me how to link! Thanks pal!", "This was 2023.", "Damn I had missed that one. It needed the classic response to \"it was just a joke\": \"explain to me how it's _funny_.\" Because it sure as hell wasn't.", "Yikes.", "How is this one ESH? The verdict was asshole and the parents and the brother did nothing wrong? \nMaybe I don’t understand the criteria.", "This is the one. Everyone except the FIL (who’s dead) behaved in the worst possible way at the worst possible time.", "This was grim beyond belief. \n\nThank you for sharing.", "Also 2023", "I love how in the edit she says “stop attacking me, no one asked.” Um, you literally asked AITA?", "I mean, how long has a 19 year old been dating her gf. I can see a long time partner being shocked to hear about this second hand, but teens getting a tattoo without discussing it with, presumably, someone they haven't been dating that long? Not out of the ordinary imo. (Tho I think the tattoo I'd a bad idea since they ARE so young, but that's a different story)  edit: op said they were serious and she wanted to propose. Increases my feeling that op is young and wreckless, but not am ah", "I understand only dating Harvard or Ivy League alum. There is a whole dating site catering to elite school alumni.\n\nShe was incredibly rude though. No need to put him down and he was wrong for acting like he went to Harvard. For some reason Harvard alums need everyone to know they went there while everyone knows that Yale is the most selective /s\n\nEdit: [Right Stuff Dating](https://www.rightstuffdating.com/). This is the one I knew about but it seems there are more apps that do the same thing. You can use it as a student, not only for alum.", "I had forgotten that one, that was hilarious.", "Oh wow, you’re right.", "“Well *now* it’s not funny because I had to explain it to you”\n\nOne of the best delusional posts I’ve read in a while.", "I guess it wasn’t technically everyone, but the wife and the husband.", "I’m not sure how the girlfriend is wrong in this one.", "I mean, she verbatim says \"they’ve been in an extremely serious relationship for a while, and he was starting to consider proposal\" in the post so I dunno...", "I'm a fool, haha. I have trouble reading the teen posts for the usual reasons. That increases rhe amount that I think op is young and reckless, but I still don't think op is an asshole.", "This one is easily the best IMO. The GF is clearly dumb for wasting food and eating like a toddler. The BF is clearly in the wrong for being controlling and cruel about his GF's dumb thing. The drama would be incredibly trivial between normal people but this combo just elevates it to a breakup lol.", "You just type [text](link) for a hyperlink.", "this one definitely, i feel like it has been nominated in so many categories that it should have an honourary award in itself", "Ok I never understood why the OP was dragged so much for this. If she has worked hard her entire life (I presume to go to an Ivy), why is she such a monster for wanting to be with someone who also has worked similarly as hard?\n\nI went to graduate school quite a ways from where I went to undergrad. If I saw someone on a dating app who claimed they went to school where I went to undergrad there, I'd be incredibly excited and would want to go on a date with them, just so I can connect with someone similar to me. Mind you, my grad school was a lot more prestigious than where I went to undergrad. If I found out that person lied, or took a free course and claimed to go there, I definitely would be more than a little bummed out because the reason I swiped right was on that fact.\n\nHow is her reaction any different from someone who found out they got catfished?\n\nedit: a word", "I mean, you’re going to filter out a ton of interesting, smart, driven, successful people if you only look for Ivy leaguers, but people are entitled to their preferences.", "Sorry. I’ll delete.", "I agree it’s shallow but obviously going to Harvard is a core part of the OPs identity. Some people and their families are like that.\n\nThere is also a dating service that only lets you in if you earn more than $200,000. Lots of niche dating sites I guess.\n\nI googled them so not that familiar. A friend from Williams told me about the Ivy League match thing.", "For going after OP instead of her boyfriend", "We don’t know what happened with the boyfriend because Op doesn’t mention it.", "The blow-up that happened when MIL’s fiancé didn’t like the chili made with maple syrup, chocolate, cinnamon, and brown sugar. [LINK](https://www.reddit.com/r/AmItheAsshole/comments/sm52ob/aita_for_kicking_my_mom_out_of_my_house_because/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "Not necessary for me to go beyond this, like *everyone* but the dead guy is AWFUL. I chose dead FIL.", "I don't actually have a lot of sympathy for the girlfriend in this situation. She's aware of this relationship. She likely always has been. Her reaction to this displays a lot of insecurity. If your SO has a relationship with someone that is this strong, you have to be ok with it or the relationship will fail from self sabotage. I'd be giving it the side eye, except OP said she was a lesbian.\n\nIf you can't trust that your SO and their best friend aren't behaving properly behind your back then you leave. It doesn't actually matter in this case if there's cheating going on or not. If he's cheating, he's not worth it, and if he's not cheating then you just don't trust him enough and you either need to work on yourself or leave.", "That should go to the best post involving food category", "This PART. \n\nIma a lesbian my bestie is a straight man. Super platonic. We’d totally get matching tattoos like this. We have a matching tattoo right now to honor a friend of ours that passed. We’re currently looking to get matching tattoo for just our bond. \n\nMy wife has ZERO problem with this. She gets I’ve know him forever we been through so much and the love we have for each other is infinite. \n\nShe probably be happier if we got the tattoo so she didn’t have to listen to us get stoned and plan it out anymore lmaoooo", "But it's not OP's responsibility. She has no obligation to the gf.", "How many people think that her father also just served her plain noodles?", "I am 100% certain that her dad was making them the same way.", "Eau of breakups.", "That only got voted as ESH because we don't have an abbreviation for avant-garde dessert chili sucks here.", "Is the wife Buddy the elf?", "Can you get diabetes from reading this?  Asking for me", "I actually have a mom who would serve weird shit like this, probably the only reason I’ve never eaten chili with syrup is because it never occurred to her. The person that made that and expected other people to eat it is TA. I will die on this hill. If you like weird ass food, go ahead and eat it, but do not expect others to choke it down and get mad when they don’t like it.", "Convinced this is the case.", "I feel like a good rule of thumb is if you’re going to serve something that’s a, uh, “culinary adventure” for a group, give people a heads up and also serve something that they’ll be more familiar with so they can just eat that.", "Kinda obvious since you also didn't get that the person that OP got the tattoo with was a man who wanted to propose to his girlfriend. OP and girlfriend are female. OP got matching tattoos with her male best friend."]}