{"id": 7236, "submission_id": "10ayxpy", "title": "AITA for asking a lady to catch the next elevator with her dog", "selftext": "This morning I was going shopping.  I parked 2 levels underground in the parking garage.  I go to take the elevator up to floor 1. Two other people and I get in.  It stops on underground level 1.  Door opens.  A lady with about a 30 pound  dog is waiting to get on.  I'm not comfortable around dogs at all.  I do my best to avoid them.  I politely ask her if she can wait for the next one and let her know i'm uncomfortable around dogs.  She simply says \"no, we are getting on\". \n\nWell this pisses me off. I respond with \"Really?  You are going to be an inconsiderate bitch and force me to be around your dog?\".  She just looks at me shocked. Doors open.  She calls me an asshole and quickly walks off.  So was I?", "created_utc": 1673627863, "permalink": "/r/AmItheAsshole/comments/10ayxpy/aita_for_asking_a_lady_to_catch_the_next_elevator/", "score": 880, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for letting a lady know I was mad she forced me to be around her dog  This might make me the asshole because instead of staying quiet for the 10 second elevator ride, I opted to have a conflict and let the lady know she was inconsiderate to others.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You can ask someone to go out of their way to accommodate you, but they can indeed say no. Insulting them like you did because you don’t like their answer is childish and extreme. \n\nYou feel that she should have changed her behavior for you, and sure, a lot of people wouldn’t have minded doing so. But it was just as easy for you to change your own behavior, but you incorrectly put all that responsibility on her. \n\nIf she’s a b**** for getting on the elevator, YTA for not getting off the elevator.", "YTA. If you are uncomfortable around dogs, you are the one who needs to take actions to handle it. In this case, you should have gotten off the elevator and waited for the next one. She has just as much right to be there as you, and you have absolutely no right to verbally abuse people for not sacrificing their own comfort, time or energy for your sake.", "Absolutely YTA\n\nIt's a public elevator. YOU can choose to get off if you are that uncomfortable.\n\nBeing rude and insulting makes you a giant entitled AH", "Maybe don’t call women bitches because they’re doing something to “inconvenience” you.", "From polite to calling her a bitch in 30 seconds; you must be a winner. YTA.", "YTA - You asked a stranger for consideration, she said no and then you cussed her out?\n\nLittle aggressive response there. You had space in the elevator to move yourself away from dog. Your phobias aren't her problem.", "YTA, Not because you asked but the fact that you just called her a b****. If you're so uncomfortable being around dogs what stopped you from getting out and waiting for the next elevator. The world doesn't revolve around you because you're uncomfortable around dogs.", "Info: Why didn’t you get off the elevator, since you were the one with the issue, and wait for the next one?", "YTA. Your discomfort is not her problem and not her responsibility to accommodate. Why should she have to wait for another elevator? You were very rude to her.", "This is a ***you*** problem. Then you verbally escalated and attacked someone. YTA", "“Inconsiderate bitch” is unnecessary and assholish imo", "YTA. You can’t inconvenience other people due to your fear of something. It’s a public elevator. If you’re the uncomfortable one, then you can either get off and wait for another elevator or take the stairs. Your reaction to her saying no was completely over the top and shows how entitled you are.\n\nCould she have been nice about it and waited for another elevator? Sure. Does she have to? No. Does that make her a bad person? No.\n\nYou are the AH.", "YTA way over reacted. You’re not entitled to ride or just be by yourself in a public elevator. If it’s a trigger you have to remove yourself.\n\n“Excuse me, I’ll get off here. I don’t like dogs. I’ll catch the next one.”", "YTA for reposting this story... Try again troll.", "YTA-Damm i would be uncomfortable around you honestly. You was way to hostile unlike the dog who I assume was a good boy.", "YTA. And I say that as someone that's allergic to dogs and doesn't particularly like them.", "YTA.  \n\nYou asked her politely not to get on, but she refused.  You could have easily exited the elevator at that point - your discomfort is your issue to handle.  \n\nCursing at that woman was uncalled for.  She had every right to get on that public elevator, and you had no right to try to stop her from doing so.", "YTA. Kinda no other way to see it.", "YTA Your issue isn’t hers. And calling her names makes you a bigger ah", "YTA.\n\nBeing uncomfortable is not reason enough to make others accommodate you while in public, not to mention that you called her a bitch for not wanting to do you a favor.", "YTA, it was fine to ask, but she isn't obligated in any way to accommodate your phobia. You absolutely were the AH for calling her a b\\*\\*\\*h when she declined. Just get off the elevator or take the stairs.", "YTA. You being uncomfortable is a you issue, not a her issue. If you did not want to be around the dog that badly then you could have simply gotten off the elevator and waited for the next one yourself.", "If you had an allergy I’d get it. She had her dog in a leash (I assume). YTA", "You politely asked, she politely declined. YTA for the name calling so quick.", "YTA for getting that easily tempered and calling someone a bitch after what? 15 seconds of convo? Embarrassing", "YTA. If you were that uncomfortable you should have gotten off and waited for the next elevator yourself.", "YTA You her and the dog had the same right to be in that elevator. If you didn't want to be there with them you should've been the one to catch the next one", "Yes, YTA. You called her a bitch! You could have put your point/reason across without the insult.", ">\"Really? You are going to be an inconsiderate bitch and force me to be around your dog?\"\n\nIn what world is this an appropriate reaction? YTA.", "If the building allows dogs, then she has as much of a right to use the elevator as you do.  Instead of trying to command her, why didnt **you** exit the elevator and *just wait for the next one?*  The world doesnt revolve around your fears and insecurities.  YTA", "YTA - she had as much right to the elevator as you. If you were uncomfortable, you should have gotten off.", "Opposite viewpoint to a different post that was on here a while back that I believe otherwise went a lot like this… from a new user to boot. Karma farmer/social experiment?", "YTA. When she declined the request, you had the option to politely get off and wait for the next elevator or go nuclear with name-calling.", "Uh. That escalated quickly. YTA. It’s annoying if someone doesn’t accommodate your request but going off on her was way out of line.", "YTA.  The simple solution is for you to get off and take the next one.  Why should someone else have to accommodate your needs?", "YTA - your triggers are your and yours alone and the world is not obligated to walk on egg shells around you.  You are in a place that allows dogs which means that you do not get to tell people with dogs to do ANYTHING just because you have a trigger.  What the lady said to you as she got off of the elevator is true.  You asked, she answered but then you pushed.  You pushed yourself right into AH territory.", "YTA. \n\nDo you not think the rest of us haven't had to share an elevator with our own triggers. She was probably in a hurry to get somewhere  Cursing at her like that makes you the AH.", "YTA. The world doesn’t revolve around you, kiddo. It’s your issue. It’s your job to deal with it.", "YTA, If you didn't wanna ride with the dog why didn't you got out?", "YTA, it’s a public elevator for public use. If you have a problem with someone or something using the elevator YOU can get off and wait for the next one", "YTA...Face the fact that the problem is yours, stay quiet, and take the next elevator.  Problem solved.", "YTA. It’s your problem and only yours that you don’t like bring around dogs.", "YTA she’s just as entitled to the use of the elevator as you are, if she’s a bitch for getting on it then so are you. calling her a bitch for getting on a elevator with her dog because YOU have an issue is an insane level of entitlement. don’t wanna ride with the dog? then YOU can get off and wait", "YTA.  You asked, she said no, you got aggressive.\n\nIf you're uncomfortable with dogs being in a space where dogs are allowed to be, it's on you to leave and go somewhere else.", "you called her a bitch because you...don't like being near dogs? and you're really wondering if you're the asshole?? lol YTA i wish her dog would've peed on you", "Yes, you were. If dogs bother you that much, why didn't YOU step out and wait for the next one? YTA", "YTA. If you're the one who had a problem with it, why didn't you just get off the elevator? \"I do my best to avoid them\"?? You, Ma'am/Sir, just lied.", "Yes. YTA. You don’t own the elevator. Your response was totally unnecessary.", "YTA.  When you are out in public, you have to accept the fact that not everything in the world will cater to you.", "YTA. Screaming babies make me very uncomfortable but I have to put up with them in public spaces, because it's PUBLIC. Same goes for you.", "YTA. You should have left the elevator as it’s your problem not the woman’s issue. She has every right to say no as it inconveniences her. Maybe you should get some therapy for your dog issues if it affects you that much. 99% of dogs won’t approach you or give a shit about you.", "YTA for expecting accommodations from others when you could have easily accommodated yourself by getting off the elevator. You’re an even bigger one for calling them a “bitch” about it.", "YTA it's a public place, and, as long as it is not against the rules -set by whomever has the actual authority over said place-, people are free to do as they please. You can't say who gets, or doesn't get into a public elevator.", "YTA\n\nShe is perfectly entitled to be on the elevator with her dog.  If you have a problem with it then you could always get off and wait for the next one.", "YTA. You having issues with dogs is your problem not hers. If you had an issue with the dog then you should of got off the elevator and take the next one. If someone said this to me while I was with my dog I would laugh in their face and mock them too lol. Again YTA!", "YTA it's your problem. You wait for the next one. People don't owe you shit.", "Yta plain and simple.", "YTA\n\nYou are uncomfortable. You get off the elevator. This is the way.\n\nThe path you chose included an uncalled for insult.\n\nTo reiterate, YTA.", "You were *wayyy* too much\n\nYTA", "YTA unless the dog actually did something to you which you don’t mention or if it was against the building rules. \n\nWhen you’re in a public place, you don’t get to dictate these things. You could have stepped out of the elevator and waited for the next one if you were that uncomfortable.\n\nI don’t enjoy being in an elevator with smelly people or children or people yapping on their phones or big scary looking dudes but…I can either take the elevator or step off. No one owes you.", "YTA- it’s really frustrating that now a days we need to tip toe around people’s “triggers” your triggers and you feeling uncomfortable is YOUR problem, not hers. She didn’t want to wait, and you didn’t want to be uncomfortable so the best thing to do is get off and wait for the next elevator. You calling the lady a bitch is just a reflection of your character. Get over yourself, people will never try and make you comfortable, that’s your job.", "YTA yelling at her is a bit too much. And I’m sure you can be around a dog for less than a minute to go up 1 floor. I can understand if the dog was jumping on you or being aggressive but by the sound of it the dog was fine.", "YTA. You didn't ask, you phrased a demand as a question then got ridiculously mad when she used the elevator meant for everyone anyways.", "YTA.  You could have gotten off and wait for the next one.", "YTA.\n\nYour trigger is your problem. Stop expecting the whole world to stop turning on it's axis to accommodate you.", "Is this a repost? I remember reading this a few months ago", "YTA\n\nNot her job to accommodate you.\n\n*however* in the future, you should get off the elevator and let someone with a dog go first.\n\nYou can then wait for the other one and have a dog-free elevator ride.", "Doing your \"best to avoid dogs\" is taking action/responsibility and removing *yourself*, not asking other people to avoid you. \n\n&#x200B;\n\nThere was no need to resort to name calling because a stranger (who wasn't obligated to) didn't accommodate your discomfort. YTA.", "YTA. I’m scared of some dogs, was bit and it was somewhat traumatic. But I don’t make it anyone else’s problem. If it was a smaller dog I could handle it, but if it’s a bigger, energetic dog I’d get off and take a different elevator.", "YTA", "YTA 100%. Why would you call her a bitch a demand her not to go into the elevator. It is a public space and she’s allowed to get on. Maybe if you would’ve asked her nicely by saying “excuse me miss do you mind catching the next elevator. I’m not good being around dogs” you would’ve been fine.", "YTA. If it bothered you that much take the stairs.", "You should have got off if you not comfortable with dogs", "YTA your triggers are not someone else’s problem.", "I’ve been uncomfortable around all kinds of people in elevators. I don’t ask them to get off because I’m in public and they’re not doing anything wrong and it’s not all about me. \n\nI wouldn’t call you TA just for asking (even though it’s pretty entitled) but YTA for what you said to her when she declined.", "YTA. Your hangup on dogs is your issue, you get on the next elevator. You forced yourself to be around the dog by being an ass.", "YTA. What do you think you get to control the world? If you didn’t like the dog, you should have exited the elevator.", "YTA\n\nThere is a say in my country that roughly translates to: \n\n\"Let the bothered ones see themselves out\"", "YTA for expecting other people to work around your fears.  They are your fears and while, yes, it may suck for you, that doesn't mean you have the right to shove that inconvenience onto others instead.  \n\nIf I was you I would have stepped off saying \"sorry I have an issue being around dogs\" and there's a good chance she would have said \"oh no its fine you stay on we'll just get the next one\" \n\npeople can be nice, but it's their choice.", "YTA. As a general life rule and for most people posting here, you can’t control how other people act but you can control how you respond.\nYour response is entirely inappropriate. In a public place, she is allowed to have her dog, assuming it’s leashed and under control per local ordinances. If you asked politely, and she declined, you either get off the elevator or suck it up for a few seconds to a minute until you all get off.", "YTA. Last time I checked you don’t own the elevator", "YTA for how reacted when she declined your request. If you're that uncomfortable around dogs, you can get off the elevator and wait for the next one. She is not obligated to coddle your discomfort at the expense of her own time or energy.", "YTA\n\nDogs exist. Get over it", "Wow YTA for sure. A 30 pound dog, seriously?? And if you were uncomfortable with being around the dog, *you* could get off the elevator and wait for the next one or take the stairs. It’s absolutely ridiculous to ask other people to accommodate something like that. Her dog didn’t do anything, your discomfort is on you not her to handle", "YBTA in my opinion. \n\nI used to be petrified of dogs up until my late teens early 20s, so I can appreciate the apprehension you might have felt about being around a large dog in an enclosed area, and why you might have felt the need to make the request\n\nShe could be considered a bit of an ass for continuing onto the elevator when you had politely requested that she wait until the next. I like to think that if someone expresses discomfort with me / my actions I will do my best to accommodate them when it is brought to my attention politely, however there could have been a reason for her to need to get on this particular elevator, such as running late for an appointment and without knowing the reason for that I guess I can't judge her too harshly\n\nHowever, you did not need to respond to her rejection with aggression. As another pointed out, you could have gotten off the elevator rather than continue the ride.", "YTA. I understand your concern and being uncomfortable, Id support you yo continue talking and explain you are afraid/dont like/ are allergic, etc. \n\nBut you made shit scalate fucking quickly. The bad words were not needed, did not hp your point and only made you an AH.", "YTA The world is not going to change to accommodate you and your fears, triggers, and phobias. You have to learn to  deal with those yourself. Get therapy, learn methods that can help you appear in public life.", "YTA. The world doesn’t revolve around you.", "YTA", "YTA, and also I swear I saw this exact post a couple months ago.", "I don’t think asking her to wait makes YTA but you could have gotten off since she was refusing. I understand it not being easy to overcome a fear of dogs but also you have to take some responsibility that it is “your issue” and make the concessions.", "YTA", "YTA get over yourself.", "OP I’m going to warn you about posting things about dogs on socials media especially Reddit because in America a Dog has more right than a human. In their minds you need to adjust your life to the dogs not the other way around. In my book your NTA but hey I’m a cat person, so there .", "YTA and an inconsiderate one too.", "YTA its not her job to deal with your problems. Granted she could've been nice and stepped off but at the same time its also your choice to not ride the elevator with the pup.", "YTA, the world will not cater to your fears. If you can’t be around a dog for about 30-45 seconds then being out in public in general is a huge risk for you.", "YTA \n\nnot liking to be around dogs is YOUR issue \n\nif you dont want to ride with a dog get off and take the next one YOURSELF", "YTA. You should get off the elevator yourself if you're uncomfortable. That's your problem, not hers.", "YTA, wtf", "YTA. Need some help with the attitude?\nYou could have got out instead of trying to get her to leave. Your trigger.", "YTA! She's under no obligation to wait and you swore at her!", "YTA, next time take the stairs.", "Yes. You are absolutely an AH and incredibly rude. People don’t not have to cater to your unreasonable preferences.", "YTA. \n1. It’s on you to manage your phobias, so you should have exited the elevator and waited for the next one. \n2. You spoke to her rudely.\n3. You need to get your expectations in line. When you’re asking someone for a favor - especially one that inconveniences them - understand that the answer might be “no,” accept that this is reasonable, and manage yourself accordingly.", "YTA take the next damn elevator. She isn't obligated to accommodate you.", "YTA, it’s a little dog who can sit away from you for 30-60seconds. And you bullied this woman for no reason! Big time AH", "Yta, if you're uncomfortable then you need to hey off,  not expect someone else to accommodate you,  then not only that you're so entitled as to call a wellman a bitch when she was doing zero wrong ?? Holy shit.. yes you're the asshole", "YTA.\n\nJust because you're scared of dogs, does not make you lord of the elevator. \n\nYou can't boss dog owners around and tell them what to do.", "YTA, get therapy.", "YTA. You're not comfortable around dogs? That's a you problem, as in *you* get off the elevator!", "I would've left the elevator it wasn't worth the argument yta", "YTA. You say you politely \"asked\" her to take the next elevator and threw a fit when she declined. So you weren't really asking were you? Because framing it as asking implies you will accept any answer. You were demanding that she take the next elevator and called her a bitch when she wouldn't comply. Get over yourself.", "YTA", "The initial request was okay, but the name calling makes YTA.", "Yeah obviously you are. How about you get off the elevator instead of expecting strangers to make accommodations for you in public", "YTA it was a reasonable *request*, but you lost me when you called her a bitch because she opted not to. You aren't entitled to inconveniencing other people, especially when you could just \"done \\[your\\] best to avoid \\[it\\]\" and got off yourself.", "YTA. I too am terrified of dogs. I can’t be in close proximity without honestly blacking out from fear. But if I were you, I would have gotten out and let them go first, because it’s my issue that I am scared of dogs.", "YTA. And an entitled one. A remind that your triggers are your responsibility. You could have had a calm conversation with her. You could have left the lift if you were scared of the dog. She wasn’t obliged to wait because of you, and you instantly turned to name calling. Get over yourself.", "Yta\n\nYou were allowed to ask but she was also allowed to say no. You could have exited the lift when she got on and waited for another one but you chose to stay on. Calling her names was childish and just beyond rude.", "YTA - just wait for the next lift yourself if a 30lb dog bothers you so much", "You are a major AH…who are you the elevator police? If you have a problem with dogs, that’s a YOU problem. If the dog bothers you that much that you simply could have moved further away and sucked it up like a big boy/girl or get off yourself and use the stairs or wait for another elevator! Jeez entitled much!!", "YTA. You could have explained your situation but you went ahead and called her a bitch straight up. Like, damn, man. Talk about escalation. You need to calm down and grow up. Learn to talk to people in a civilized manner and not take everything like it’s a personal attack.", "There is no issue with asking but you went hostile. Your problem is your problem. Next time, just step off. You can't control her but you can control yourself\n\nYTA", "YTA - get off if you don't like it.", "YTA- you should’ve gotten off the elevator if you weren’t comfortable. Also, had no right to call her a b****.", "Yta you didn't ask her you demanded politely.  You're not entitled to accommodations that inconvenience them from everyone in the general public because you're uncomfortable because a dog is existing near you.  \n\nI think it was reasonable to ask but you needed to accept,\"no\" as the answer.", "YTa. The world doesn’t stop for you because you don’t like dogs. If you don’t want to ride a lift with a dog then YOU get out. Get over yourself and grow up.", "YTA. If she had said no, you could have gotten off and waited for the next one. There’s nothing wrong with asking, there is something wrong with expecting someone to cater to you because of your fear, and then calling them names because they didn’t.\nI suggest some therapy.", "Who the fuck do you think you are telling people what to do in public and bitching at them because you’re uncomfortable. Stay the fuck home next time asshole", "YTA\n\nYou not being comfortable around dogs is your own issue and no one has to go out of their way to make you comfortable. Get over yourself.", "I was going to ask if you had a phobia of dogs but, the way you jumped to insulting her without even trying to articulate your feelings makes it irrelevant. \n\nYTA.", "YTA take the stairs next time.", "YTA\nYou asked, she answered. Take the stairs next time or you get off and wait for the next elevator.", "YTA\n\nYour phobia is your own responsibility and no one else’s. Strangers are not obligated to accommodate you and you are not entitled to accommodation just because you aren’t comfortable.\n\nNot trying to be dick, but please seek therapy. My sister had a severe phobia of dogs for years and therapy was the best solution. \n\nAnimals and pets exist in the world and you’re going to have learn how to cope with that.", "YTA. You’re the one with the problem, YOU get off.", "YTA\n\nYour triggers are your responsibility. If the dog didn’t pose any threat, you could have removed yourself and taken the stairs. Instead you chose to be rude to someone who didn’t deserve it.", "YTA you asked she said no so you verbally assaulted her... the same way you are entitled to ask she is entitled to say no", "YTA...", "YTA\n\nWhy didn’t you get off instead? You’re the one with the issue.", "YTA\n\nIf it’s that upsetting to you then you can get off the elevator and wait. You are no more entitled to use it than her, and you are the one with the problem.", "Yes YTA\n\nYou have the problem, you remove yourself. The elevator is not your home,so the rules are not yours.", "Who forced you?  were you trapped in the elevator. Could you have got out?\n\nYTA", "YTA.  You needed unreasonable accommodation, you should have waited for the next elevator.", "I hope you get in a very compromising situation where your only chance of rescue is cooperating with a dog.", "You may have triggers for dogs and that is okay, but it is not other people’s jobs to cater to your triggers. That is your job to work around your triggers and to find solutions to them.", "Why do people pat themselves on the back for being TA to others and then brag about it?", "I hate when people get mad bc others don't want to accommodate their needs and I hate when people ruin people's entire days by being assholes that call them bitches etc. for just doing normal shit. YTA 1000 times over", "YTA! Seems like the dog didn’t do anything in your short time together but you berated a woman. You should figure out better ways to distract yourself from stressors than cussing women out.", "Sounds like you went from 0 to 100 really quickly. Calling her a bitch was really extreme. It’s not like she insulted you personally. I can’t really fathom the level of anger here. YTA", "YTA\n\nYou're the one with the problem here so you need to remove yourself from the situation, not demand that others go out of their way to make you feel comfortable. You could have waited for the next elevator or taken the stairs.", "YTA. You asked, she said no, so if you really didn’t want to be around the dog then YOU get off the elevator and wait for the next one.", "YTA", "YTA\n\nYou seem to be more aggressive than the average dog.", "YTA- you weren’t as much of an AH at first when you politely asked. But then you called her a bitch “forcing”\nYou to be around her dog. She’s not. You could have easily gotten off. I understand that not fair. She could have been respectful and said sure, I’ll wait for the next one. But at the end of the day she doesn’t have to. She’s has just as much of a right to use the elevator than you do. \nYou were both AH\n\nThe world doesn’t function just to accommodate your fears.", "YTA. It’s a public elevator. If you have that much of an issue you should have stepped off the elevator. Not everyone needs to cater to what you’re comfortable with. Besides from your post it doesn’t sound like the dog was doing anything that would really warrant you being an AH. \n\nAnd in your judgement bot reply you say the elevator ride was around 10 seconds, and you actively chose to have a conflict and call someone inconsiderate which *newsflash* they weren’t even being. You actively choosing to make a conflict over such a quick exposure in a public place is enough in itself to make you the AH. YTA", "I've seen a weird amount of \"dog in elevator\" posts recently, but this is the first one I've seen from the perspective of the person in the elevator who doesn't want said dog to enter. It's strange how the dog owners in the other posts were chewed out for acting like the dog owner in this post, but here, it is the opposite and OP is getting chewed out for acting like the people in the previous posts who \\*weren't\\* deemed to be TA. FWIW, I think you're both assholes here, the lady for not waiting for the next elevator and you for being rude about it.", "YTA… I will never understand what’s the ongoing theme in these recent posts about calling people bitches because you don’t get your way.", "Yes, YTA. \n\nAlready, telling someone to not get on an elevator because YOU are uncomfortable around dogs makes you an AH, but then you double down and actually swear and insult the woman on top of it? You are a major AH. So incredibly entitled. If you are uncomfortable, you can leave, simple as that.", "You're some dose is all I'll say", "Bro, you don’t own the elevator. Its for use to everybody on the building, therefore it’s public. If you’re so uncomfortable around dogs;\n\nGet off next time, since you’re only carrying a tiny bags of shopping stuff, which is easier to control than a 30 Pound dog that has its own brain.\n\nYou’re the asshole, and an entitled one at that.", "YTA because you went from 0 to 1000.", "The world does NOT revolve around YOU YTA and a MAJOR one and you needlessly escalated the situation by swearing at her and call her names!", "Nah- you’re the hero everybody needs. NTA.", "YOUR 👏🏻 TRIGGERS 👏🏻 AND 👏🏻 PHOBIAS 👏🏻 ARE 👏🏻 NOT 👏🏻 EVERYONE 👏🏻 ELSE’S 👏🏻 PROBLEM 👏🏻\n\nYTA", "Clarifying question: do you own the elevator? Because it sounds like you felt very entitled to something that’s not even yours. I don’t really like kids or assholes but if I was stuck on an elevator with you or a child I wouldn’t start calling you a “bitch” And throwing a fit. That dog probably has a better personality than you anyways. YTA.", "YTA. You should have gotten off the elevator and taken the next one. Unless dogs are banned in the building or in the elevator, she's doing nothing wrong. You're the one with the problem. I sincerely hope this is clickbait and not an actual interaction that someone had with a perfectly normal acting dog and their human.", "If you don’t want to be on the elevator with the dog YOU have to get off. Not the other way around you don’t get it both ways", "yta. should have let her go on first and caught the next round yourself", "YTA you just assumed you was more important than the woman and your time was more precious so you deserved to make another person wait for the next elevator? Your the one with the issue, an issue that doesn't even involve an allergy or PTSD enduced trauma around dogs, you just don't like them.\n\nYou verbally abused a stranger because you asked for a favour and they said no, she wasn't forcing you to be in an elevator with her dog but you most certainly was assuming she'd accommodate your wants, not needs, neither of you own the damn elevator it is to be used freely by the public.", "YTA and unnecessary. I guarantee the others would have preferred the dog over you.", "YTA, maybe if you had explained you’d be less of one, but your comfort does not outweigh her right to the elevator", "why didn’t you do the adult thing and remove yourself from an uncomfortable situation? why do you expect the world to cater to you? grow up and look out for yourself and don’t call people names when they won’t cater to you, an entitled, selfish stranger. YTA", "oh yea, like zero doubt, major YTA. If you are not comfortable, then get of the elevator.  It is obnoxious for you to expect everyone to work around your discomfort.", "YTA. I understand being scared of dogs, but a lot of cities are super dog friendly nowadays. A big reason I moved to where I did was because it was dog friendly and I could bring my dog with me. If someone asked me to accommodate them, I would probably say the same thing. My dog has just as much a right to be there 🤷🏼‍♀️", "Really you are going to be an inconsiderate AH and expect the world to bend to your wants? Do you honestly think you are in the right here? She has just as much right to use the elevator as you do and you have absolutely no right to demand special treatment from others. You are definitely TA here and also mentally challenged for thinking you could have possibly been in the right", "YTA", "YTA\n\n30 pound dog??? That’s pretty small. You don’t indicate it was misbehaving or being aggressive? Just a normal dog. Get out and take the stairs or wait for the next elevator.", "YTA. You’ve got the problem you step off.", "YTA. the world revolves around you and simply should get out of your way. but this is an extremely prevalent attitude.", "Calling me a bitch definitely makes me want to do nice things or regret not being accommodating, said no one ever. I’d rather be on an elevator with this woman and her dog than a reactive and verbally abusive person like you. YTA.", "ESH\n\nAbsolutly reasonable request. You ended up being YTA for insulting her and she is a huge asshole for being a classic case \"my dog can be everywhereeeeee\" person while generally being an asshole for lacking any empathy. Not everyone has to like your overbred canine.  Stop forcing it in others people faces.\n\nCome on downvote me you weirdly obsessed dogfanatics lol.", "This is a repost. A very recent repost at that.", "Honestly you need to ask?? entitled, easily offended woke people have no idea that the world doesn’t revolve around them.\nYTA", "YTA. You could have simply waited for the next elevator instead of calling that lady a bitch and getting aggressive.", "yta, the entitlement is crazy. your first reaction being to insult them to save yourself the 5 minutes but EXPECTING them to. wow", "Yta of course. How dare you talk to a stranger in that way that did nothing but use a public elevator.", "um obvs YTA. if she said no you could’ve just got off and waited.", "Yes - YTA. I love these ones, they're so easy. I can churn through them all day long.", "YTA you have emotional baggage, that's fine.  What isn't fine is letting your emotional baggage impede or inconvenience others.  \n\nI was raised in a hoarders house who had at least 20 dogs at any given time in filth; I hate dogs.  At the same time, I'm not gonna let that stop people who have them from being around me in appropriate environments.", "Yta. So entitled", "YTA, especially for now you reacted. It’s a public space. The least you could have done is explained why you felt uncomfortable. I once had an apartment neighbor who was a practicing Muslim, and when I brought my dog on the elevator with him, he kindly asked that I not let the dog sniff him or be anywhere near his feet because he was going to be praying soon. I obliged because he wasn’t a dick about it and took the time to explain it to me.", "YTA\n\nShe has every right to be in the elevator - the same rights as you. If you have issues with dogs, YOU get out of the lift and get the next one. Your issues are your problem, and your problem alone. Grow up and stop thinking the world revolves around you", "YTA, you clearly were shopping in a pet friendly area. Not everyone with a dog is obliged to avoid you because of your delicate sensibilities.", "YTA, take the stairs if you're scared of dogs. It's not the dog's fault, nor is it the dog's owner. This is a you problem.", "YTA. I don't like getting in elevators with large dogs because I'm allergic, so I let them have the elevator and I take the next one. You could have done the same.", "YTA. You get off and wait for the next one.", "YTA", "YTA.\n\nYou called her a bitch and yet you still question If you are in the wrong or not?", "YTA. And an entitled one at that.", "YTA. \n\nYou stooped to name calling. You could have waited if it is that big a deal to you. \n\nAs a person who isn't the biggest fan of dogs, I would have said 'excuse me, just gonna hop out. Me and dogs don't get on'\n\nOr... \n\nI'd have been an adult and sucked it up for 20 seconds. Depends on my anxiety levels that day.", "YTA why couldn’t YOU leave the elevator? That dog has nothing to do with your fear", "YTA you should have gotten off the public elevator if you had a problem.", "YTA that's a small dog and if you are the one with the issues you can get off. It's not a dog free zone and they have a right to exist. Unless the dog was showing aggression, the onus is 100% on you for your personal comfort.", "yta a dog for less than  a minute its not a big problem", "YTA No one cares what’s happening in your life and your reaction was insane. I’d be so embarrassed if I was a friend with you on the elevator. You get off the elevator if you have a problem", "YTA\nreally? when I am uncomfortable with someone in elevator I getting off myself without forcing another absolutely random person to get off for me. you shouldn't make your triggers everyone else's problem", "YTA. This lady wasn’t inconveniencing you, you were inconveniencing her. If the building allows dogs, she’s allowed to bring it on the elevator. If you have such fear of dogs, you could’ve gotten off and waited for the next elevator, or move to a building where they aren’t permitted.", "Who the hell do you think you are? \n\nYTA.\n\nThat was entitled as fuck. I'd have told you to eat shit and walk up the stairs.", "YTA, you should have simply gotten off to wait for the next one and I'd tell you to stop using gendered insults but at least it helps everyone around you see that scratch you and the lady hate is right there under the surface.", "YTA. If it made you so uncomfortable, you should have gotten off the elevator and waited.", "Info: What was preventing you from getting off the elevator and waiting for the next one?", "NTA for asking but YTA for the way you responded to her. Ultimately, ESH.", "I'd say ESH as you were already on the elevator, that's what happens when you take dogs in public places.\n\nESH Because you went straight to being incredibly rude", "YTA. You could have got off if *you* are uncomfortable around dogs", "YTA.\n\nThe world doesn't revolve around you. No one is required to make you feel comfortable. Next time get off and deal with your own triggers yourself while you wait for the next elevator.", "YTA. You get off and wait for the next one.", "I have a very severe dog allergy and generally don’t like being around dogs…but YTA. It’s called living in a society. The elevator ride couldn’t have been more than a minute. Dogs are a part of our society.", "Yta. Other people shouldn't be on the hook for your issues. You're not avoiding dogs, you're making other people cater to you. Ytfa.", "YTA. Not for asking her but for your completely uncalled for response when she said no. Your issues are not hers. You can’t tell someone they cannot use a public elevator. If you were that uncomfortable that you can’t be around a dog for less than a minute then YOU get off. Your response was inappropriate and the real B**** was you.", "concluded. OP is AH.", "YTA.", "YTA. Your issue, your responsibility. If the lady had waited, it would have been NICE, but she's not obliged to. After all, you hardly know her situation or what her day looks like. Rather than throwing a fit, and staying on- if it was such a big problem for you, you could have stepped out and waited. Also calling someone a bitch...not a good look.", "YTA, It’s okay to be triggered by dogs but insulting someone who is not ain’t it.", "YTA. You can ask, but you’re not entitled to get the answer you want.", "YTA you could have easily gotten out yourself, I get it if you are uncomfortable around dogs but that doesn’t mean others have to bend to that. Especially when you were so rude when she got on anyways, it wasn’t necessary to go insulting her so harshly.", "YTA. If you were so bothered by the presence of the dog, you could have stepped off of the elevator and waited- you didn’t have to insult her. You get what you give, and you deserved it.", "YTA for sure. I can understand making the request, that's your right, but if they decline you have two options: stay on the elevator and deal with it, or get off the elevator yourself. The Asshole option is to yell and berate a woman who has as much right to be on that public elevator as you do. She does not have to agree to your request and she definitely doesn't need the vitriol you spewed. Your reaction specific seems to be extreme IMO given the circumstances described.", "YTA, privileged much? Next time drag your own self off that elevator instead of expecting others to accommodate you.", "YTA. The world doesn’t revolve around you. I’m uncomfortable around people wearing perfume, it irritates my lungs and makes me cough, but I wouldn’t ask some one to not get on the elevator with me if they were wearing perfume. I just have to suck it up sometimes, like we all do. You are inevitably going to be around dogs at times, it’s up to you to manage your discomfort.", "YTA. You are the one with the issue in this case, therefore, YOU are the one who should get off the elevator. You are definitely the AH in this scenario.", "YTA it's no one's responsibility to make sure you're comfortable in public. If you're uncomfortable YOU get off the elevator.", "YTA. Sounds like you were looking for a fight. No one is obligated to accommodate your issues with dogs. Don’t make your problem someone else’s problem.", "YTFA. Walk up the stairs or control your trigger. The world does NOT revolve around you", "YTA\n\nYou asked and she said no. The immediate hostility towards the dog owner was uncalled for.", "YTA. Stop throwing tantrums because a stranger doesn’t let you get your way. There was no reason for you to call her a bitch because she said no and got on, you could’ve just took the next elevator. I honestly wouldn’t be comfortable being around a person like you.", "YTA. This was YOUR problem so you should have gotten off. Calling her a bitch was totally uncalled for.", "YTA. Not just an asshole, a massive asshole.", "Woah!! YTA\n\nMy sister is super allergic- so it’s fine to ask; but it’s NEVER okay to call a stranger a bitch because she didn’t follow your request. Especially in an enclosed public space.\nYou just took it to fight level. \n\nYou can’t control other people. Control yourself!", "YTA. She didn't \"force you to stay around your dog\". You had every chance to leave. You didn't and that's your problem. Act like an adult, not like a 10 year old.", "Yes.\nYTA", "100% YTA you could have gotten off if it was that big of a deal. Making the request was completely fine, but name calling because your request was denied was out of line and immature.", "YTA - if you felt uncomfortable,  you should have gotten off the elevator not been so nasty to her because of your issues.", "YTA YOU wait for the next elevator", "YTA. If you’re uncomfortable then you get off or you take the stairs. It’s a public elevator.", "YTA. Your rude and your issues are a you problem not a her problem. Only entitled asshats make their issues other peoples responsibility.", "Yta asking is fine. You didn't ask though, you demanded. What's the difference? Asking can be answered with a yes or a no.  You weren't willing to accept a no, therefor it's a demand.", "You definitely didn’t need to cuss at her. YTA", "YTA - your phobia is your problem, you should have gotten off and waited for the next elevator.", "You’re both AH. She could have easily accommodated you and I absolutely would have in the same scenario. You are the AH for feeling entitled to accommodation.", "Yes YTA in a huge way.  Take the fucking stairs if you have an issue.", "Why didn’t you wait and take the next one? You are the one with the (possibly irrational) fear. YTA.  She and her dog had every right to take the elevator and if you don’t want to ride with the dog, wait for the next one or take the stairs. \n\nGlad she wasn’t intimidated by you being unreasonable.", "TROLL ACCOUNT!\nclick on the profile", "you are entitled asF .YTA", "YTA\n\nOther people are under no obligation to manage your anxiety for you.", "YTA- you don’t get to dictate who takes public elevators, if you’re uncomfortable with dogs then you get off and get on the next one", "Also, a 30lb dog isn’t that big. I know because I had one. If she had 2 people sized dogs I might be more sympathetic, but it sounds like this lady had a chubby corgi.", "YTA. The world doesn't revolve around you. It's on you to manage your issues, not to expect everyone around you to accommodate them.", "Yes", "YTA\nPublic elevator. \nYour issue with dogs is, is just that, YOUR issue.  It condemned you so much, you should have stepped off and taken the next one.  Instead,  you assumed your phobia should be accommodated by strangers in a public setting.  I am severely allergic to animal dander.  It’s my issue.  In public I inevitably am in such as this.  I step off the elevator,  it’s my responsibility to meet my needs,  no one else’s.   Entitled much?", "YTA\n\nIt is not everyone else's job to cater to random strangers being \"uncomfortable\".\n\nYou don't like the dog, either get out of the lift yourself or don't go anywhere other people exist. You also escalated to an extreme and over the top degree by being obnoxious, rude and maliciously aggressive.\n\nGet over yourself.", "YTA. I don’t think she was very considerate of you, but your reaction was way over the top and out of line. You don’t swear at people just because they inconvenienced you.", "YTA. The onus is on you to take care of your own situation. The lady has no obligation to you. You are allowed to get off the elevator and wait for the next one.", "Yta", "YTA\n\nI understand not being comfortable around dogs, but this was not the way to handle it at all. Really you should have been the one to step out of the elevator, it’s not her job to accommodate your dislike of dogs in a public space that allows them. You calling her a bitch really seals the deal lmao, totally uncalled for", "YTA.  You being afraid of dogs is a YOU issue, meaning, you get off the elevator.  People do not need to pander to your insecurities", "YTA. You started calling names. If you’re uncomfortable with dogs it’s your job to get off the elevator and catch the next one. God, people these days are so fucking entitled. I hate that I sound like an old person, but it’s true.", "You're uncomfortable with a 30-pound dog?  I feel sorry for you.  And yes, YTA for being so self righteous.", "YTA. Why didn’t you just get off the elevator?", "YTA but you are getting it wrong. \nThe reason why she should not have waited for the next one is because you are the one having problem with it and you can't expect other people to solve it. \nAs you stated you do not get why a person with a dog would be on a place like that but your understanding or not is apsolutely irrelevant. That is due  to the fact that is a public property and dogs are allowed. So as weird as it is to you the weirdness plays no part.Fact is it is allowed.\nNow if you have a problem with something but it is allowed and it is the others persons right-why would you expect them to solve your problem? Maybe out of politness according to your standards? but if expecting that and see that is not happening you should not have asked cause that is the exact opposite of what you are expecting from them aka plain rude. It translates to \"hey could you not excersise this right of yours because of me\". You should have quietly gotten off instead.\nIt might seem like it is a question between a dog and a human but it is essencialy a question between someones wishes and assumptions and someones rights. \nNext time think harder and preferably before you speak.Good luck.", "What is wrong with people", "YTA. i'm not sure if you meant your apartment elevator or shopping center elevator, but if it was your apartment you should apologize the next time you see them for your outburst that probably ruined their day.", "YTA. I can't imagine feeling so entitled. Why couldn't you get off the elevator at that point and then wait for a dog free one? And to call her a bitch on top of it? It's not her responsibility that you're uncomfortable arounds dogs, that's your trigger to deal with.", "YTA. You wee way out of line having a tantrum when you didn't get your way. If it made you so uncomfortable, you should have got off the elevator when she got on.", "YTA \n\nyou must be one of those internet people who think they can talk to people any type of way. You are gonna say some sideways shit to the right person one day lmfao \n\nYou don’t own the elevator you should’ve gotten off and walked your ass up the stairs.", "YTA. Tbh, if you had asked me politely, I would have totally waited with my dog - all the easier for me because I hate crowded elevators, especially since everyone's butt is usually at my face level (wheelchair user). But your time and comfort is not more valuable than everyone else's, and you had the option of getting off and taking the next elevator yourself. Instead you chose to be extremely rude by calling her the b-word, which is never acceptable, and misogynistic to boot. What's next? Lady, can you please take the next bus?", "You're a moronic asshole, take the stairs or offer to get off.", "YTA\n\nTake the stairs.", "YTA  why didn't you get off? It's a public space. Your comments were not warranted at all.", "You are inconsiderate and YTA! You could’ve just taken the next one instead of being a jerk or sucked it up… not that deep…. That woman was right to call you an AH because simply put… You are", "Man wtf. Yes YTA. You should go see a doctor about Main character syndrome", "YTA\n\nYou are not entitled to anything that isn't yours in the first place. It's a public space.", "YTA - it is a public elevator. People do not have to make you comfortable. She had every right to be on that elevator, and if it was too much for you, it was up to you to learn to handle it somehow or get off and take the stairs.", "You dont get to dictate other peoples time or experience and how it goes. If you get on a public elevator keep your selfish thoughts and wants to yourself. No one owes you ANY accommodation and you clearly don’t deserve any acting like that. You are majorly TA.", "YTA. Control yourself, not other people.", "YTA. You could have got off the elevator. Weird how this fear is strong enough for you to berate someone but not to actually remove yourself from the situation, which you could have done very easily.", "YTA. It is no one else's responsbility to accomodate your fear of dogs. She also has just as much right to use the elevator that you do. You're lucky she kept her cool like she did with the way you spoke to her.", "YTA", "YTA. When will people learn it’s not other’s responsibility to accommodate someone’s emotions/needs. Public elevator, you asked she said no if you are truly that uncomfortable get off and take the stairs/get on another elevator. And then you had to insult her because she didn’t inconvenience herself to accommodate you? 😐", "YTA. Next time, *you* get off and wait for the next one if you’re that uncomfortable. It’s a public space, and you don’t have the right to control who gets on.", "YTA I'm sorry for the dog", "YTA. You’re the one with the issue and you can’t expect people in a public place to accommodate you. Also a 30 pound dog is like a corgi.", "Came back to say you seem like an truely unbearable person to be around. Have problems with ppl? The common denominator is you.", "YTA\n\nYou were uncomfortable, so OF COURSE the appropriate course of action is to be rude and vulgar. \n\nMost people simply remove themselves from an uncomfortable situation.  Next time, get off the elevator and YOU wait for the next one.", "Big time YTA. Unless you're severely allergic (which you are not) you have no right to ask her not to enter with her dog, and to be so rude about it is disgraceful. If you were so bothered you should have got off the lift and got the next one yourself.", "Asshole", "Wow YTA. Like, wow.", "YTA. Go see a therapist", "Yes, YTA.  It is not a private elevator for your exclusive use... other people can use it too, including people with dogs.\n\n You asked her to take another elevator (not a problem) and she said no.  The responsible (non-AHish move) was to accept her answer and take the next elevator.  Not to attack her.\n\nI say this as a person who's not crazy about dogs, and would rather not take an elevator with one... but I would never attack another person because they have a dog and want to use the elevator.", "I don't understand all the YTA comments..op is  uncomfortable around dogs..with all the news about dogs attacking people..can u really blame him..op shouldn't have called the woman names..u are not the Ar$eh0le...people are more important than animals..Idc what any1 says", "Wow, how else can the rest of the world tiptoe around you to preserve your precious feewings? YTA!", "YTA. Do you do this for service dogs as well? Do you tell everyone in the park that they can't walk their dogs? You're in public, you don't get to control your surroundings. Calling the woman a bitch is a major AH move.", "Yes. YTA. You don’t own the elevator.", "YTA. You should be the one getting off. I might be bias because I’ve been around dogs my entire life but when something makes me uncomfortable, I remove myself from the situation rather than inconvenience other people based on my comfort levels.", "NTA Dog owners can be some of the most entitled people in the world. I bet it was a fake service dog. I can’t stand those people.", " YTA. You’re lucky that lady walked off and didn’t get with you.’ Are you out of your gourd? All you had to do was get off and wait for the next elevator. You might not be so blessed next time. You need to learn emotional regulation.", "YTA. If you want to be in a different elevator from someone, you wait for the next one, not ask them to. YTA. If you are uncomfortable around dogs, take the stairs or wait for the next elevator. You didn't have to curse at her. She was not doing anything wrong. People are allowed to use elevators.", "NTA regardless of how all the dog nutters wanted a dog pile of you you simply asked her to be considerate of your personal boundaries with her dog and she wasn't. This is why I hate our current pet culture because they've gotten so entitled that they want you to treat their dog like a human with human rights. It would have been simple for her to catch the next elevator so that everybody could have been comfortable", "She should have left her precious doggo at home. So inconsiderate to force other people to be around your pet, one of which no one knows their behavior. \n\nNTA and I'll die on this hill.\n\nLet's edit this and remind everyone of the near daily videos and stories about \"sweet innocent baby doggies\" attacking people on the street, let alone in a small enclosed area like an elevator. It happens. Leave your dog at home.", "NTA\n\nI love my dogs, they are family. They are big dogs and love everyone. Weather permitting, we take them with us often. We never take our dogs anywhere they might not be welcome. We share our lives with our furry family. Others have the same right not to. \n\nIt doesn't take that much time out of your day to skip an elevator trip to allow someone else to be comfortable. I would have just smiled and said, no problem.", "ESH but some more than others. In this case, she was rude in her response. You were, understandably, rude back.\n\nTo quote a famous person of great enlightenment, \"we're living in a society\" here. Sometimes we have to compromise. She could have easily taken another elevator. She didn't even give you an empathetic, \"Oh, sorry, we are late to an appointment\" or something. Condescending bench.  Except, saying it to her face makes you a bit of an AH, unfortunately.", "NTA. She can wait.\n\nI had an ex who had only 1 calf muscle because a dog ripped it out. You could be like him for all we know.", "ESH you went straight for calling her names and her for not being a responsible dog owner and respecting that not everyone is comfortable around dogs. It’s an elevator, y’all realize that they go up and down all day.  She could have waited or you could have gotten off and ride the next one.", "1. She was the T A for not respecting your boundaries.\n\n2. You’re T A for completely overreacting and name calling. \n\nSo E S H\n\nEDIT: Thanks for the comments explaining why my reasoning was off. I think I’m so used to accommodating other people when I have dogs I never stop to think how I’ve been inconvenienced. \n\nSo OP YTA 💁🏻‍♀️", "Nta", "NTA you were there first. She was exactly as you described her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis morning I was going shopping.  I parked 2 levels underground in the parking garage.  I go to take the elevator up to floor 1. Two other people and I get in.  It stops on underground level 1.  Door opens.  A lady with about a 30 pound  dog is waiting to get on.  I'm not comfortable around dogs at all.  I do my best to avoid them.  I politely ask her if she can wait for the next one and let her know i'm uncomfortable around dogs.  She simply says \"no, we are getting on\". \n\nWell this pisses me off. I respond with \"Really?  You are going to be an inconsiderate bitch and force me to be around your dog?\".  She just looks at me shocked. Doors open.  She calls me an asshole and quickly walks off.  So was I?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "Simple. You were N-T-A until the word bitch. Then YTA. Control your temper.", "Forget the dog part, you called a stranger an “inconsiderate bitch” after a one-sentence exchange…I can’t believe you don’t see how rude and inappropriate that was. YTA.", "[removed]", "[removed]", "[removed]", "[removed]", "Yes YTA.  You're the one that's uncomfortable around dogs.  If it was that big a deal for you, you should have gotten off and waited.  Also, you really thought it was appropriate to then call her an inconsiderate bitch because she didn't do what you wanted and then you need to ask if you're an AH.  Yes, yes you are.", "[removed]", "YTA for \"bitch\", not for asking, or even for being unhappy when she declined your (reasonable) request. But gendered insults like \"bitch\" are always a problem.", "N T A for asking her to take a different elevator but YTA for calling her a bitch ! If you really didn’t want to take the elevator with the dog you could have also gotten off and taken a different one. Unless you have an intense phobia where you’re not able to even walk by the dog then yes YTA. You don’t own the elevator.", "Agreed; this was a your problem. You asked she said no. Then your choice is step off the elevator or endure the dog. Elevators are public", "No kidding, talk about main character syndrome! \n\nOP - you get to ask, you don't get to demand. This is a \"you problem\" to solve. If you want to be in a place without dogs, move out into a cabin in the woods. If you want to be around other people, then you are going to be around dogs. It's on you to learn coping skills for dealing with your anxiety about dogs. YTA", "I fully agree.\n\nOnce the owner had said no she should've asked if she could step aside for OP to get off so she and her dog can get on 🙃", "\"I demand that you inconvenience yourself to suit me, a total stranger\" is pure arrogance and narcissism. 100% YTA territory.", "This is the take right here. YTA", "Or just walked the ONE additional floor up…", "No notes. YTA", "The only time that this isn't the case is: people walking their dog off leash in public and if the dog is violent", "OP should seek therapy. This a phobia and it’s negatively affecting their life. Dogs exist in the world and they need to be able to cope", "Exactly, you asked. She didn't want to comply.\nYou could have said \"Ok,  in that case I will leave the elevator\" and walk away.\nWhy should she accommodate your needs if you can do it yourself by getting off?\nAnd yes, insulting her makes you even more an asshole. \nYTA.", "I feel sorry that the dog needed to be around OP. YTA", "This.\n\nOTHER PEOPLE ARE NOT IN CHARGE OF DEALING WITH YOUR TRIGGERS!", "OP seems like the type of idiot who would take their phone out then post it, hoping it goes viral", "Seriously. YOU wait for the next elevator. How dare you call *her* a bitch when she’s just living her life with her gigantic 30 lb monster. YTA. This is a “you” problem, fix it or deal with it, don’t depend on strangers to coddle you. We ain’t your mama.", "And jumping to call a woman a bitch", "The fact that you have to even ask this is telling.\n\nYou not being comfortable with dogs is a YOU thing. If it bothers you that much then you get off and take a different elevator. YTA.", "Amen\n\n\nOp yta", "There was another Aita asking if they should’ve got off the elevator because another tenant has a fear of dogs and they got yta. Reddit confuses me lol", "I feel like this scenario or something similar is posted here often. The OP of each is always an AH.\n\nOP, thanks for not breaking the streak! YTA", "Yeah.. OP was incredibly self-centered. Ok, you don't like dogs.. I mean, I'm not a fan, either. But I would either suck it up and deal with it, or get off the elevator myself. OP just kept escalating the situation.", "He was already on the elevator. Unless it’s a service dog, the woman should’ve complied. Not everyone is a dog person. People have allergies and fears. It’s not fair to make someone feel uncomfortable because you wanted to take Toto somewhere.", "Yep, I was with OP and empathize with his fear being near a large dog…but I had to re-read his response to the lady like 3 times to make sure he did not put “end quote” like after “Really?” WTH OP?!?! I am in shock-what kind of seemingly normal, rational, grown-up throws some shit profanity such as this and with that kind of ease (not behind or in their head), but just spits that word at this woman’s face?? I have a hunch that u might be YTA in more than just this one situation in ur life…", "Seriously. Could you imagine being trapped in an elevator with someone that got that aggressive suddenly calling you a bitch? Talk about phobias..", "This! So nasty and vile.", "This.  YTA for jumping straight to calling a stranger a bitch.  I’ll never understand people who go about life in such an aggressive way. Must be exhausting.", "I very much doubt someone who reacted like this was all that polite in the first place.", "After reading she called her a bitch you just know she wasnt polite at first..", "It’s clearly not an “ask” if saying no isn’t really an option.", "yeah, I needed to get into a building yesterday and someone was like \"do you have a dog? I have a phobia of dogs.\"\n\nwe didn't but all i could think was 'what if i did? there are certain kinds of dogs allowed into the building. it's an office.'", "Is it a repost?\n\n*Man*, I hate when I spend time responding to these just for the story to turn out to be fake lol", "😂😂 Your style is humorous, thanks!", "Not suggesting that OP wasn't TA, but do dogs really have the same rights and access to space that people do?\n\nETA: Note that service dogs are an exception. I didn't account for that. But otherwise, I don't see why dog owners should believe that their choice should be automatically tolerated by everyone. \n\nRegardless, OP was way out of line with that reaction.", "Right! OP should have stepped off the elevator. I’ve done it myself when a group of drunk guys were getting on the elevator, another time when a lady actively using a vape walked in. I’ve been the person with a dog and have offered to wait for the next one when the door opens and there are small children in there who look nervous… but the onus was on her to step off if she didn’t want to share the elevator with the dog and calling her names was just mean.", "OP YTA you don't get to inconvenience others for your phobias,  you have a problem that is your problem to deal with, the world doesn't revolve around you.", "She is entitled. OP is also entitled.  How do you deem her dog more entitled to a comfortable ride than OP?  \n\nIt's funny that in today's coddling, catering culture, most people are not giving a break.\n\nShe didn't have to accommodate OP, true, but as a nice person, there's no reason she couldn't have. She is not a nice person.", "This is the right take. It’s bullshit someone else should be inconvenienced for your irrational phobia.", "I feel like the one from a few weeks ago was somebody getting on with somebody who was phobic of dogs? But it was pretty similar.", "there have been various versions of this, always an elevator and someone with a dog", "No, it was a little different. \n\nIn that one, OP was the one with the dog.", "OP has to be a dude. As a woman I can't even imagine the result if I asked every creepy dude who got on the elevator I was riding to take the next one. Lol OP is a trip and a half.", "Lol 30 lbs is like a chubby cocker spaniel. Get a grip man.", "I agree with your evaluation. Just for clarification, 30lbs is definitely not “large” in the dog world. It’s on the petite end of “medium”. Think of a beagle.\n\nThat said, this doesn’t really change the sentiment of your post. It’s not a 6lb dog, and fear is valid. It was fine for OP to ask, but they should’ve left the elevator when the answer was no.", "How did she politely ask? She called her a \"bitch\" and basically demanded she get off.", "I think by the same token, dog owners should understand that not all people love their dog as much as they do.", "It's a freaking elevator, not a plane. She can catch the next one.", ">and also mentally challenged \n\nthis aint it.", "You personally get extra AH points for insisting this  has anything to do with people being \"woke\"", "I mean, that was nice of you for sure but no one should have to explain or have good reason to ask you to keep your dog from approaching them. “Please don’t allow your dog to come near me” is a reasonable ask, regardless of the reason. If you have to dog in a public space it’s your responsibility to have it on a leash and ensure that it’s not a nuisance.\n\nNot really the same situation as just sharing a space like OPs post but, like, “please don’t let your dog sniff me or touch me” shouldn’t need any further explanation. Ever. 🤷🏻‍♀️", "Lady is not obligated to wait because OP doesn’t like dogs. OP requested and she declined.", "YTA\n\nIf it's a case of bad allergies and she still insisted on getting on then I'd say no you weren't.  As it is, I agree with this person and you should've gotten off of the comfort issue is that bad.", "It would have been equally simple for OP to get off the elevator.", "No thanks. My dog can go where dogs are allowed to go. You’re just gonna need to deal with the existence of dogs or you can stay home.", "He’s TA. If he’s uncomfortable, he should have got off and waited for the next elevator. The world doesn’t cater to your comfort. She had just as much of a right to the elevator as him. Asking her was fine, calling her a bitch when she refused is not. \n\nIf he’s incapable of sharing an elevator with dogs, he shouldn’t live in an apartment complex that allows dogs. They are bound to end up in the same space as him sometimes.", "OP decided to live in a dog friendly apartment.. If they are scared around dogs, they should make sure not to be around them. OPs issue with dogs isn't anyone else's problem and if they have an issue with some lady doing her thing, then they should take the stairs", "\"she was rude in her response\" no she wasn't? she's entitled to be on the elevator with her dog \n\nOP was definitely the one who started with the nastiness.", "Why should the dog owner wait when OP is the one with the problem?", "She is the one with the problem she should get out", "You don’t get to have boundaries about who can use the shared elevator. If OP needed to ride without a dog, OP should have stepped out and taken the next one or live in an apartment building that doesn’t allow dogs. You cannot say “I am uncomfortable with your dog riding with me take the next elevator” when the elevator is for everyone that lives in the building, including the dog.", "I disagree. She is not responsible for OPs boundaries, OP is. If they were uncomfortable in the situation walk away. \n\nYTA OP.", "OP chooses to live in a dog-friendly building and acting like she owns it and the other person doesn’t pay to live there\n\nOP is clearly the AH. She can take her dog-fearing ass to a non-dog friendly building otherwise recognize she isn’t entitled to the elevator in a dog-friendly building \n\nOP - YTA.", "What does being there first have to do with it? It’s a public elevator.\n\nYou seem to be assuming some “unspoken rule” that doesn’t actually exist…", "Found the OP.", "> talk about main character syndrome!\n\nMy husband suffers from this. Truly terrible", "You changed my mind on this one. Take my gold.", "I love this response. Short, and to the point. 😂", "May I use this response in the future? It's incredible.", "Yep OP wouldn’t have been TA just for asking politely, but immediately jumping to calling her a bitch absolutely makes them TA. YTA OP", "i really don’t wanna be one of those guys, but cmon, a dog has priority over a human being using the elevator? wtf", "Because she was there first. This isn’t a dog park. It’s a public place. For the public, not animals. Let me just bring my pet peacock on an airplane, I’m not bothering anybody /s. \n\nThe public shouldn’t have to be forced to deal with your pets. For the exception of service dogs, the entitlement dog owners have in how they bring their pets everywhere and anywhere really grinds my gears. And don’t get me started on unleashed dogs… \n\nNTA.", "This post is a perspective flipped version of one from a couple months ago.\n\nIn the other post the OP was a man getting on with his dog and a woman asked him to wait for the next one. (The OP was also a doctor for anyone who remembers it).\n\nHe got massive hate for getting on anyway.\n\nI'll see if I can dig it up later.", "Poor dog. Hope it got a treat later to make up for it", "\\*30 lb dog... itd be one thing if it was large breed, but come on. YTA.", "Seriously. OP needs to check her privilege at the elevator door.", "Agreed...major I am the main character vibes", "Thus why OP should've excused themselves and left the elevator without insulting the dog owner. What exactly did that lady do to deserve OP's reaction? OP is the one with the adversarial attitude not the dog owner. OP's behavior is reprehensible", "OP can learn to share space with others.\n\nToto seems far more well behaved here in comparison", "OP was the one with the issue.  He needs to take the action to avoid the dog, not the dog owner.", "asking is fine. where they become TA (imo) is calling her a bitch because she declined.", "30lbs is a medium dog size.", "I have a medium sized dog and she is 40 pounds", "30 pounds is at best a medium size dog. OP would have pooped her pants if I got on with my 90 lbs pitbull (who is an absolute lovebug)", "A 30lb dog is not a large dog???", "Or ever", "Yeah, and that’s the issue, along with OP’s reaction afterward. \n\nOP could’ve still essentially demanded that the person wait, but had the decorum and maturity to hold their tongue, and then come to Reddit to ask and it would’ve probably been a “NAH” from me. \n\nTrying to get someone to accommodate you, in general, shy of shouting at them and demanding something, isn’t in and of itself asshole behavior, but OP deciding to yell at this person does make them the asshole.", "💯", "Wait, who brings their dog into an office? Like, if it’s a helper dog or something fair enough, but just an average dog?", "I would guess 85% of the posts here are fake lol", "Yeah, it was posted a few months back.", "To some they do, service dogs more than regular ones, for example, if you try to shush someone's dog out of a public park you are likely to get arrested, just if you try to shush a person, if you try to shush someone's service's dog out of a bathroom (Where the owner is) you're likely to get arrested.", "I wish people would learn what popular catchphrases really mean. \n\nAnd as for your “no reason?” How utterly silly to think you have enough info to even speculate. That woman could have been feeling ill. Or tired. Or had to pee. Or any of a hundred different things.", "She is expecting someone to go out of their way because she doesn't like dogs.  The women is in her rights to get onto the elevator with her dog.  If the OP doesn't like it then she could get off and walk or wait for the next one.\n\nFar too many people expect the world to revolve around them without them doing anything to help themselves.", "OP could have gotten off and waited for the next one. This is not an indicator that the lady isn’t a nice person.", "I wouldn’t be nice either if some random person got aggressive and called me a bitch", "Irrational is correct 30lb is a small dog, I kind of would understand if I got on with my 110lb dog but still.. if I'm within the rules/ law and the dog isn't going to touch you then tough shit..", "You’re right, it was also written in separate paragraph form, and longer.", "Thank you for clarifying! I'm not overly good with weights for dogs :) about the only dog I'm familiar with is FIL's boerboel and his weight gets discussed in stones (he's about 2 stone heavier than I am!)", "In the first paragraph OP says that the politely asked the woman to wait for the next elevator and expressed their discomfort around dogs. It was after this refusal that OP then called the dog owner a bitch.", "Yes but let's think about service dogs you don't have to like them but certainly have to deal with them. I think that this is a situation of EHS dog owner could have kind and wait for next elevator and OP shouldn't be calling people's name when they don't do what he wants.", "That's completely irrelevant. \n\nJust because someone doesn't like dogs, DOES NOT give them the right to boss around people who own dogs.", "Omg so true!!!", "Yayyy..", "Not sure about dog friendly Apts. OP said they were going shopping, parked 2 levels below. The problem is people have a hard time just being nice. I imagine if person and dog were on the elevator first, the guy would have waited for next turn.", "Personally, I would have gotten off myself and not said a word to her but not everyone is the same. If she is absolutely terrified maybe that’s why she asked instead of just getting off? IDK why some people do the things they do, I think OP is 100% the biggest AH in this story for sure!", "I think I’m biased because I walk dogs and always make sure people are okay with dogs before I approach so I assume everyone does this? Apparently that’s not true 😅", "But they dibsed it!  /s\n\nIt would have been polite of the lady to wait, but she isn't obligated to and there are gradients between polite and AH. Based on the OP's account,  I think she was just meh.", "Ha of course!", "There are two humans who want to use the elevator.  OP has decided that he takes priority over the woman, as the reasonable thing to do if there's a person/animal you don't want to be around, *you* take the next one.", "No? But I am not sure if the dog would be able to take another elevator itself, I guess his human would have to be involved, too. So it is a person vs a person with a dog", "As others have said, it's not the *dog* being inconvenienced, it's the dog *and* the human with it.\n\nSay for example you walk in with a bag of groceries and your take out from the Indian place. I tell you I get sick when I smell curry, so could you please wait for the next one. You are 100% right to tell *me* to get out and wait for the next one since I'm the only person here bothered by the smell.\n\nAgain, I'm not asking you to drop your curry outside and come back for it, I'm asking *you* to get out solely because of me.", "Okay that's clearly not the issue here. It's a person asking another PERSON to inconvenience themselves and then being an AH when they rightfully said no.", "I have a news flash. Service animals exist. OP is going to have to deal with the existence of dogs in public at some point. \nAnd regardless, If you ask someone to inconvenience themselves for you they have the right to say no. OP could also have waited for the next elevator.", "This is the dog owners home too, she’s entitled to use the elevator anytime she wishes. She’s not forcing OP to interact with it at all, OP said it was a “10 second ride.”", "So let’s rephrase the scenario. It’s a crowded elevator, the lady is the last to get on. OP says can you wait for the next one I’m uncomfortable. Should he get off because she didn’t care for his comfort?\n\nHe was already on the elevator. She could’ve waited.", "And not even the larger side of medium.", "Yeah, definitely not a large dog", "I’m looking at my 25k medium sized dog and wondering how a dog almost half her size can be thought of as big.", "Okay, yes, this is true (my Yorkie is pushing 20), but I have to say, if you have fear of dogs, it really doesn’t matter what size they are. (I just posted this morning about a traumatic experience I had as a child that left me petrified of dogs for 30 years.) Idk if OP has some trauma and maybe that’s why he didn’t want to ride with the dog but hey-if I am in this situation, I would just say okay, then, I shall await the the elevator!", "Imagine if I got on the elevator with my 130 lbs dog. OP might have had a heart attack. (Not that I take my dog on elevators lol)", "Imagine OP if I got on with my 120lb Dane", "Let me know when you get on the elevator so I can get Pitties kisses and smooches!!!!", "You are right. A have a belgium shepard and she ways 70 lbs and she is not that big", "Oh, come on! You can't take a pit on an elevator!! People will get hurt! You just can't put that tail in that confined a space. Irresponsible. ;)", "I would consider it a large cat, but I grew up with Saint Bernards.\n\n(30 lbs is the low end of a medium-sized dog.)", "Australian shepherds are around 45 pounds if that helps put it into context.", "I try not to make snap judgements of people based on first hand accounts of situations, but it really feels that if OP’s reaction to being told no is to jump to “inconsiderate bitch” then it leads me to reason that they are used to putting their needs first and raging at people if they don’t go along with their “request”.", "Assistance dogs for the disabled.  Not common, but sometimes it happens.", "Some offices are dog friendly, so people bring their dogs into the office.", "Gotta be honestly. I see so many deleted on a daily basis it’s unreal. These trolls have way too much time on their hands lol", "I think 100% are but it's still fun to participate.", "Yeah wasn’t there one where the women like screamed bloody murder from a woman holding a small dog in her arms in the elevator? Is that the one you mean? But it was from dog owners POV", "As above, I agree that service dogs are an exception. \n\nBut otherwise, owners of pet dogs sometimes need to step down.", "Be direct and clear:  \n\n>what popular catchphrases really mean. \n\nWhat? Who? You think, \"perfectly entitled\" is a catchphrase? And I don't think you actually know what a catchphrase is, either. It is something a character says according to certain conditions, or some pattern - usually in a show or comic.\n\n>How utterly silly to think you have enough info to even speculate.\n\nBAM! Exactly! That's where the woman, if a nice person, steps in and says, \"Oh, I'm late\" or whatever, rather than, \"No.\"  Well within her rights, but unkind.", "Agreed!\n\n>Far too many people expect the world to revolve around them without them doing anything to help themselves.\n\nWhat's ironic is that our culture is has developed in that direction recently.  Everything is about mitigating the risk of possibly offending that one person.  Or, protecting that one stupid person who doesn't know how to use a blowdryer.  And yet, the comments here are mad at OP for politely asking a kindness of another human being.\n\nYou could argue that OP was more entitled because of being there first. Why does that have less value than her entitlement to ride with her dog? You see?\n\nYes - \n>The women is in her rights to get onto the elevator with her dog.\n\nBut, you can be well within your rights and still be an AH.", "OP could have. And, instead of cursing at her, should have. Agreed.\n\nBut, no, she's not nice.", "No, OP is an asshole, the lady in question even a bigger one.", "But that happened *after* she was rude with her, \"no.\" I did say ESH, because OP's response was bad", "Previous one was a man I think, and the phobic woman had been screaming in fear  not just uncomfortable? If I'm thinking of tge same one..", "It’s tricky if you don’t have exposure to lots of different dogs 😊 also, 30lbs can look very different on different breeds/individuals, so it is not always straightforward\n\nETA: I used to dogsit for a friend who had a 9 stone Doberman and a 1 stone dachshund. Funny pair. The dachshund was the boss 😂", "So you ask once and when told \"no\" you call that person a bitch. Yea real adult. Sounds like a child to me. Also, if she went straight towards cursing the lady how \"polite\" was that first ask. She's a child.", "Oop sorry, didn't mean apartments but in general.. If you're going to a place that's dog friendly, you can eventually expect dogs.. OP asked, the woman said no. Simple as that.", "Then why would you put e s h", "That is very kind of you, but in no way necessary. I could see it being somewhat different if you had 5 dogs but a single 30 lb dog? No. Besides we have no idea what is going on in this women's life at the moment. What if she's on her way to say goodbye to her mom at the hospital? The OP is asking her to wait another 3 or so mins for their \"boundaries\" when they could easily just gotten off and used the stairs or wait for the next when all they are doing is going to the store. It is not always about \"you\".", "I'm pretty sure you could train them to figure out to press the call button, (my friend did it with the front door bell once with his dog) but it's going to be a real pain in the ass trying to teach him which floor he's on.", "Only person OP can control is himself. He asked, she refused. OP's only civil course of action to make himself feel more comfortable at that point is get off the elevator. This isn't rocket science", "I get claustrophobic in lifts, if it gets too crowded I do get off rather than expecting people to inconvenience themself for my sake.", "I mean, I’m sure that’s true, but I wouldn’t bring my pet to the office with the assumption it would be allowed", "I’m on this team with you", "I assume it must be that one, yeah. It was a person who lives in a dog friendly building posting about a woman (maybe it was a girl?) screaming because she was scared of dogs and didn’t want to ride in the elevator with one.\n\nI don’t think I’ve seen a similar one since, so people probably think it’s repackaging that.", "it was a dog owner and a girl who was scared shitless. the post was from the dog owners perspective. pretty sure that one sided with the girl with the phobia who was already on the elevator. interesting how this one is an opposite ruling", "People with allergies/fears of dogs can’t avoid all places that allow dogs. I saw someone with a dog at my local Kohls a few weeks ago. Dog owners should be considerate of others in public places that aren’t specifically understood to be geared toward dogs (like “dog friendly” establishments that are clearly marketed as such and dog parks, etc.) \n\nNot a comment on OP yelling at someone like a lunatic but it is very frustrating to read so many people implying that I should just like, never go to a store or a park or wherever with the expectation that I won’t have to physically interact with a dog or be in close proximity to one. A dog coming near me for too long, brushing up against my clothing, or licking my skin can make me sick for DAYS. \n\nI avoid anywhere specifically marketed as “dog friendly” but I should have a reasonable expectation in the general world that I can go shopping or to the park or whatever without getting sick. Just because a lot of people like dogs doesn’t mean that dog owners should have free reign to drag their animal anywhere with no consideration for those around them.", "As a dog owner myself I would have waited if someone asked me. That’s me, it might not be you. I think the dog woman is irresponsible for saying “no, we are getting on” you never know with people how they will react, case in point OP lost her shit and started calling her names. I personally would not let my dog be around some who appears to wound up so tight they could snap. I have been around dogs my whole life from tiny little guys to massive guys. I am totally cool with being an outlier in this situation I actually started with n t a but then I started thinking about my next door neighbors dog. I always took my dog around the house because he actually scared me, not because he was mean but he was freaking huge, his head was bigger than my head and he wouldn’t have to jump far to bite my face. The first time I met him he came right up to me, the GC told me he was huge and mean. I froze, he kept nudging my hand to pet him so I did. He went to my husband who is not an animal person at all, smelled him and kept going down the line until he got to the contractor and you could see the dogs demeanor change. The owner recalled him and he kept his eyes on the GC and he went to attention. I tell you this because not all dogs are the same. Please understand I am taking OPs side she is the one who started the whole thing and she is the one who escalated the issue.", "Yes thank you for your comment, I’m realizing maybe I accommodate others a bit too much,", "If she did something to my dog I would throw hands she has the problem. No one should have to bend to her will in public. It’s her responsibility.", "Hey as someone with serious dog allergies, I really appreciate people like you who ask before approaching. I will move my seat in a restaurant/on a plane/etc if a dog is sitting near me but SO MANY people just approach me with dogs while I’m out in the world and I don’t notice until it’s too late. Like, if I’m at the store and you come up behind me with a dog for too long before I notice, I can have an asthma attack. If I’m at the park and you walk past me on a trail too closely and your dog licks me or brushes up against me I can break out in hives and/or end up sick for the rest of the day.\n\nI don’t think you’re being too considerate to ask people before approaching them with an animal. Animals are great but they are not people and with it becoming more and more common to allow dogs in stores/restaurants/etc it’s becoming increasingly hard for me to just be out in the world as a human being doing person things. Dogs don’t have more right to be in a space than I do and a warning and/or a little understanding from dog owners should be expected when you are in a public location that isn’t intended for dogs (dog park, business that specifically markets being dog friendly, etc) \n\nSo, thanks for being a good person and I hope this thread doesn’t sway you from being considerate when you’re out with the dogs! ♥️", "I agree with that."]}