{"id": 7447, "submission_id": "10d108t", "title": "AITA for refusing to do makeup on a client because of their skin?", "selftext": "Hi all, I'm 34F and live in the US. I'm a professional makeup artist and I work for a small company that provides makeup to people for things like weddings, prom, photo shoots, etc. Basically I do their makeup for them. I've had this job for the past 10 years. \n\nFirst of all let me clarify that this has nothing to do with skin tone or race. I don't want to mislead with my title. This was over skin TEXTURE/condition. \n\nI had a client yesterday, who I assume was 16-18, that wanted makeup done for a school dance. She made the appointment through the company I work for and I didn't meet her or see her at all before she came in to get her makeup done. \n\nWell, long story short, her skin was in terrible condition and I didn't feel comfortable putting makeup on it. \n\nShe had a lot of open wounds on her face, which I assume were acne scars, some of them with literal dried blood smeared on her face. She also had a rash(?) around her eyes and mouth, I still don't know what it was, but it was light red patches around her eyes and mouth. \n\nI was genuinely worried she might have a skin condition or something that's contagious. And her face had blood on it, which I don't want on my tools. Yes, my company sanitizes everything, and I know if it's done properly nothing should spread. But tbh it still weirded me out to put makeup brushes over her blood and what I think was a rash, then later use those same brushes on other clients. It just didn't sit well with me. \n\nI also don't think makeup on her skin would be good for her in general. Foundation going into open wounds isn't necessarily recommended and might have made her skin even worse. \n\nI tried to be very nice to the girl and explained that due to there being open wounds on her face I couldn't do her makeup because of risk of infection. I made it seem like my only concern was her own skin health, since I didn't want to seem mean and basically say \"I don't want you spreading diseases around to my clients.\" \n\nI was very careful with my words and honestly did my absolute best to not offend her. But I still had to be firm in the fact that I wasn't comfortable doing her makeup. \n\nThe company offered her a full refund, and even offered to weaver the cancellation cost, but she insisted she \"needed\" her makeup done. My manager ended up sort of siding with me and not forcing me to do it, but talked to her and asked if she'd be okay with just eyeshadow and not a full face. (Which I still didn't really want to do but if she agreed to that I would have.) \n\nShe kept insisting on a full face and made a big scene, ended up calling me a \"bitch\" and a \"Karen\", then eventually stormed out. \n\nShould I have just done her makeup and not said anything? AITA?", "created_utc": 1673831783, "permalink": "/r/AmItheAsshole/comments/10d108t/aita_for_refusing_to_do_makeup_on_a_client/", "score": 60, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because I need to be professional and serve the clients, and I probably hurt her feelings.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - she clearly was acting out due to her situation. I would not take that personally. Poor girl.", "NTA You were actually protecting her, your cosmetics are not sterile, and if she has open wounds applying anything could cause infection. If it was just application of materials you could stock some disposable brushes, sponges, etc. I just googled \"Is it ethical to apply makeup on someone with open wounds\" Top answer was \"Open wounds that are still in the healing process are vulnerable to infection\"", "NTA; you have cleanliness/hygiene/health standards to adhere to.", "NTA\nYou were doing the right thing protecting your other clients.\nI feel sympathy for her but on the other hand, it's pretty selfish of her  not understand that her open wounds / dried blood could spread illnesses to other people.", "NTA. You don’t want to be held liable for causing the girl a medical crisis because some chemical in your makeup caused or worsened an infection on her face. Nor do you want to get an infection from her. It sounds like your company should make clear before people schedule an appointment that none of the employees will do your makeup if there are open wounds, severe rashes, or blood on your face. I think you need to be accommodating for acne and cuts that are mostly healed/don’t have peeling scabs. But you are not a medical facility so you shouldn’t be made to deal with a situation that implicates your or your clients health.\n\nI feel bad for the girl because she’s obviously not getting the skincare she needs, and if it’s as bad as you say I’m disappointed her parents didn’t stop her/get her help. She is probably already self-conscious about her skin and being told it’s so bad that she can’t get her makeup done probably felt terrible. But that’s not a good enough reason to put yourself at risk medically or legally.\n\nIt doesn’t sound like you did a particularly bad job handling it, but I think you probably should have gone to the manager right away rather than handling it on your own. Turning away a client for their skin is an incredibly risky move from a legal perspective, so while you were right to do so, you want to pass the decision up the ladder.", "NTA: That is a safety and health issue. I don't think it is ethical to do it anyway when you have clear concerns.", "NTA.\n\nOpen wounds is a no go for just abut everything. \n\nAlso, I have seborrheic dermatitis on my face which means I get lots of flaky patches on my skin.\n\nThere's no way I'd have someone do my makeup without first letting them know about the issue and see it beforehand and to give tips on how I work around it.\n\nPlus, I'd definitely have my skin care on point to make the sub derm and minimal as possible before the appointment. \n\nThis woman needs to learn how to care for her face and respect that people don't want her blood on their tools.", "NTA.  Open wounds are a deal breaker for pretty much all make up artists.", "NTA, I wouldn't do makeup on open wounds either", "NTA. You absolutely made the right call. As someone with some amount of professional makeup experience (not as much as you), I wholeheartedly agree. Makeup in open wounds is a terrible idea, and if your skin is in that rough of shape, you need to get it under control before even thinking about makeup, professional or otherwise.", "NTA you're likely not the first to turn her down. Professionals aren't about just money. You were taking you and other clients health in mind, as well as care about what would happen to her with foundation in open wounds. Any true professional would let her down easy then show her the door.", "NTA. Sounds like she may have over scrubbed,  maybe micro-abbraded, and aggressively plucked immediately before showing up. Teens have no good sense. You are the professional and handled it like a professional.", "NTA. Seeing that the company is small and fairly new, I recommend the company add a section that the MUA has the right to refuse service if there are active skin conditions or open sores on the face.", "NTA it is part of your profession to determine if makeup is healthy for a person’s face and preventing the spread of skin infections is something I know for a fact you have to do continuing education on. I am a cosmetologist and there are times you have to say to a client “no I’m not doing this, please get out of my chair” because of health or hygiene issues. It protects you and every other client that comes through your door.", "NTA\n\nAs a professional you have an obligation to do what you think is best for your clients and for yourself. It sounds like you had valid reasons for making the decision you did.", "NTA. I'm not touching *any* open wounds or blood, dried or not. It's a biohazard, unhygienic, and a risk to you.\n\nI say this as an adult with cystic acne: any time I book a treatment or service over the phone I state \"I have active acne on these parts of my face and body, is this an issue\". Every time the response has been either letting me know it's fine, further queries or a confirmation that service may be limited on the day, or (rarely) a polite refusal of service.", "NTA. You were not only worried about making her skin conditions worse, but also didn't want to risk contaminating your tools/makeup with her blood or possibly contagious skin conditions. The well-being of multiple clients trumps one client's \"need\" for a full face of makeup. However, you could've possibly remedied the situation by suggesting she come back with her own makeup/tools from home and you doing her makeup with those at a discounted price.", "NTA, but I think it would be important to consider some pre-appointment consultations in the future if there are cases where you would decline someone.", "NTA, im not a professional makeup artist but I do makeup from time to time and I’ve also refused to add makeup on people with these type of skin conditions. It’s just not right and like you mention it can be worse in the long run, to add it’s nasty imagine you just spreading puss on your tools and then using it on clients who have a healthier skin. I’m sure that your company as many other businesses choose their rules and can deny service if chosen .", "NTA \n\nWhile I don't like how you assumed she must have an infection or disease, you still shouldn't have to work under those conditions. Any other place, that would be considered a violation of blood pathogens / biohazard training. Doesn't matter that the tools are sanitized later, it is irresponsible to be in close contact and working on someone with open wounds and sores, unless you're a doctor and that's your literal job.\n\nI get why she wanted the makeup. She likely felt ashamed of her face, of the scars, pimples, and picking she had clearly done, and this absolutely may have hurt her feelings and mortified her. But sometimes there's no way to word something where that won't happen.  \n\n\nAnd you're right. Makeup can absolutely make those things a lot worse. Covering them traps oils, and drainage can't happen. I'm sure that's preaching to the choir for you but it's still the truth. What she needed was a gentle face cleanup, not to pack down chemicals, powders, and viscous liquids to hide it.   \n\n\nIdk, I have sympathy for her, though not her behavior. But you're still well within your right to be uncomfortable and not want to do the job.", "NTA you were being reasonable and patient, with some solid logic as to why you shouldn't do it. She chose to get nasty which was unwarranted.", "NTA. I was a makeup artist for like 20 years and the one time I declined to do a face sounds exactly like your story. My girl was much nicer about it though.", "NTA. That doesn't sound like skin you should be working on, and way above your pay grade. Open wounds and dry skin could be the symptoms of anything but that's not part of your job!", "NTA. But you or your employer should research the best way to address skin conditions,  i.e. additional questions on the appointment website and for the receptionist regarding open wounds/rashes/skin conditions that can be made worse or become infected by the application of makeup or be conditions, and potentially a disclaimer posted that if these types of conditions exist at the time of the appointment the MUA may cancel the appointment and issue a refund. You not only need to protect yourself but the business too.", "NTA - as a MUA myself, you could be potentially infecting other clients indirectly but also in case of an infection, she could sue you. It wasn’t safe for her or yourself. Once i had a similar situation and asked her to bring her own brushes, makeup products and did the makeup with gloves. But in my country there are no laws to sue you for those situations", "NTA", "This is very sad and hits close to home for me as I use to have decently bad acne— HOWEVER! You did the right thing to say no. While I can understand the pain and shame of having acne and wanting to cover it; I also understand how she could be damaging her skin further and causing irreversible scarring. On top of the fact that it is unsanitary. \nNTA", "NTA. You made the right call", "NTA you made some extremely valid points as to why you couldn't do the make up on your client  I'm not a cosmetologist but I did study  beauty therapy (alternative name in the UK) it was the one thing instilled on is as students no open wounds would be accepted on a client, didn't matter if it was still healing, scabbed over we were to say no we cannot do the treatment period.\n\n This was to prevent any contraindications getting worse,  getting infected from products or infecting other clients from tools even with strict sanitization rules.\n\n As you stated you also didn't know if the skin issues were something that could be contagious, you don't know if it's treatable or If using make up or products could make her skin worse it could even have been an unknown allergy to products she was using herself some products can dry skin out badly which can lead to eczema i.e she might be treating herself for achne but the products also are so harsh and drying the skin out so much it's leading dry skin and redness from being dried out constantly. \n\nAdded a lot of teens do pick at blemishes to pop them thinking hey if it pops itl heal. So for YOUR safety, the clients safety, the other potential clients and the company itself you did the absalute right thing in this situation. It wasn't cruel or nasty as a make up artist you have every right to decline service based on whatever issue you feel may prevent you doing the best job possible.\n\nMy suggestion would be to ask the business to start  a consultation appointment prior to any treatment appointments being booked. This way you can determine any skin issues or body issues and see if they can get it treated via Dr, dermatologists or whatever specialist is needed beforehand or if need be ask for a Dr's note stating what the health condition is and that the person can have xyz treatment but avoid whatever product is causing the rash if it's a allergy then allow them to book an appointment.  This covers you and the business that way future clients can then decide after if they want to continue. It also allows them to see if it's something that  can be helped with  first rather than being super excited to be told eh no we can't do that when they are amped and excited.\n\n Teenagers tend to struggle with skin issues some more than others parhaps it would also be a good time to see if you can also get some contacts for facials or mini facials for teens before make up is done if it's a minor skin issue .  Doing the consult allows the client some time to either heal skin issues if feasible or find an alternative place that will work with their skin issues, texture problems you can be an amazing make up artist but there's a whole different level for covering severe skin problems with make up that takes a incredible amount of preparation and products to achieve that flawless look.", "Being someone with very minimal knowledge of makeup or skincare, I don’t think I have. A judgment here. I find it odd your company has no protocol here though.", "NTA - thats nasty. Cant blame you.", "Nta....i hate wearing make up period....and having suffered bad eczema over arms and legs as a kid with the open wounds....i can only imagine her face.....you were right but better safe than sorry...(i guess this is wheee and cheap dollar store supplies would come in handy for situations like this).", "NTA", "NAH\n\nThis should be in the realm of your professional knowledge over when and when not to do a face. Your professional knowledge should have a clear and resolute answer to this. This really shouldn't even be an AITA question.\n\nPerhaps you could have bandaged the open wounds and then done makeup to hide the bandages? I don't know makeup but I feel like \"where there's a will, there's a way\" seems applicable here.\n\nOne way or another there should be some kind of solution to this, even if that solution meant extra work (and therefore extra cost). Offering her some kind of option other than 'no' would be more professional and show a higher degree of skill in handling situations of this type.\n\nBut she should probably have said something about her extra needs when she made the reservation (so long as it was possible for her to do so; you may want to review your reservation procedure to confirm special notes like that are possible for a customer to add).\n\nBut say she had a wedding that same day or something and she's the bride, or any kind of important event. It's better for her to go home and do her own makeup, badly, than to let you, a professional, do it? She came to you for a solution to her problem and you offered her none at all.\n\nI would almost rate you as the AH here except you're not obligated to the customer at all and if you want to say no you have that right.\n\nI do think you could use a little more empathy/understanding for her situation and could have maybe worked harder to find a solution instead of just refuse.\n\nI also think being worried about your tools even when you know there isn't actually an issue there and that they get sanitized for exactly that reason is a little unprofessional as well.\n\nIf I knew makeup well enough to be sure that there was something you could have done, but avoided, then I'd change my ruling to you being the AH.", "I’m concerned that you don’t use disposable tools. Every MUA I’ve seen, uses disposable sponges, brushes, etc as well as a mixing palette so they aren’t dipping used items back into product.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi all, I'm 34F and live in the US. I'm a professional makeup artist and I work for a small company that provides makeup to people for things like weddings, prom, photo shoots, etc. Basically I do their makeup for them. I've had this job for the past 10 years. \n\nFirst of all let me clarify that this has nothing to do with skin tone or race. I don't want to mislead with my title. This was over skin TEXTURE/condition. \n\nI had a client yesterday, who I assume was 16-18, that wanted makeup done for a school dance. She made the appointment through the company I work for and I didn't meet her or see her at all before she came in to get her makeup done. \n\nWell, long story short, her skin was in terrible condition and I didn't feel comfortable putting makeup on it. \n\nShe had a lot of open wounds on her face, which I assume were acne scars, some of them with literal dried blood smeared on her face. She also had a rash(?) around her eyes and mouth, I still don't know what it was, but it was light red patches around her eyes and mouth. \n\nI was genuinely worried she might have a skin condition or something that's contagious. And her face had blood on it, which I don't want on my tools. Yes, my company sanitizes everything, and I know if it's done properly nothing should spread. But tbh it still weirded me out to put makeup brushes over her blood and what I think was a rash, then later use those same brushes on other clients. It just didn't sit well with me. \n\nI also don't think makeup on her skin would be good for her in general. Foundation going into open wounds isn't necessarily recommended and might have made her skin even worse. \n\nI tried to be very nice to the girl and explained that due to there being open wounds on her face I couldn't do her makeup because of risk of infection. I made it seem like my only concern was her own skin health, since I didn't want to seem mean and basically say \"I don't want you spreading diseases around to my clients.\" \n\nI was very careful with my words and honestly did my absolute best to not offend her. But I still had to be firm in the fact that I wasn't comfortable doing her makeup. \n\nThe company offered her a full refund, and even offered to weaver the cancellation cost, but she insisted she \"needed\" her makeup done. My manager ended up sort of siding with me and not forcing me to do it, but talked to her and asked if she'd be okay with just eyeshadow and not a full face. (Which I still didn't really want to do but if she agreed to that I would have.) \n\nShe kept insisting on a full face and made a big scene, ended up calling me a \"bitch\" and a \"Karen\", then eventually stormed out. \n\nShould I have just done her makeup and not said anything? AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\n but the we even offered to wave the cancellation fee... You guys canceled you kinda owe her a fee the the other way around", "YTA, if someone is paying you to do your job you should probably do your job.", "NTA", "Yeah, I really do feel bad for her, I know her situation must suck and I hate to have added to that. I just wish she didn't yell at me in front of the whole shop.", "Unfortunately, most commercial health insurance plans refuse to cover acne treatments. I spent years paying out of pocket for my teen son's acne treatment. Most medications were $150+ per month and on a tight budget not doable for most. I was able to make it work but had to forgo a cream that was close to $500. We finally gave medicine similar to Accutane a shot and it worked but now we need to address scaring. It's tough when insurance thinks acne and braces are just cosmetic and not necessary. Already spent $7,000 on braces and several thousand on acne treatment.", "Yeah, that's not a bad idea in hindsight, but I didn't think of it then. \n\nAlthough I'm not sure it would have worked anyway. Something like that I'd have to clear with my manager and they would likely have to sanitize all her personal tools and makeup before we start for legal reasons, so likely it would have been an extra 1-2 hour wait for her, and by then I'd be with another client.", "This company is pretty new and very small, so I assume that's why. They have a pretty short online process to making an appointment and that's about it. We do consulting for bigger events like weddings but not usually for teenagers and school dances. \n\nThe building we work in was bought from a larger makeup company in my area that moved to a newer building. I worked for them for around 6-7 years then immediately transferred to this company about 3 years ago once they got the location. I was more loyal to where I worked and being close to home/short commute than who I worked for, so it just worked out that way.", "If I was certified in correctional makeup, knew for sure what her skin condition was, and had a way to completely sanitize everything from said skin condition afterwards, then yes I could do something. But correctional makeup is a whole different ball game that I'm not trained in, and I had no background info on her or her skin.", "I'll copy my reply to another person: \n\nYeah we have disposable sponges for foundation and concealer but for things like blush, bronzer, contour, highlighter, we use brushes. Also obviously brushes are needed around the eyes. The disposable sponges aren't amazing quality tbh and don't do great at blending powders, it's a small company so anything that's disposable and can only be used once is very cheaply made so they can afford to go through it.", "And get sued when her face gets infected too. Adults have to consider future consequences when making business decisions", "She was offered a full refund", "Her job is also to know when to say no. She was doing her job.", "Part of OP's job is keeping a sanitary work environment, not causing damage to her client's skin, and keeping herself safe from biohazards like blood.", "Yeah that sucks I’m sorry. You guys should add a questionaire prior to the appt that includes face must be free of open wounds/ rashes to try to weed ppl out like this in the future. It seems like common sense…but 🤷🏻‍♀️", "I’m going with NTA, but I feel for the poor girl.", "What about disposable sponges for face makeup? I feel like that’s pretty normal, I’m fairly protective of my skin so I wouldn’t want to use a shared brush either way.", "So you didn't do anything wrong, but I don't think the customer did anything wrong either (except maybe be a little rude when getting upset). Without knowing the exact details of the conversation I tend to give the person the benefit of the doubt; not enough detail was provided for me to call the other person an AH, so 'none here' is my ruling.\n\nI would suggest either being clear that correctional makeup is not one of the services you can provide, or, look into providing it. Increasing your skill offerings can only benefit you.\n\nIf it turns out your business is already pretty clear about this and the customer ignored it, then yeah that'd make the customer an AH.", "Did you not ask her what the condition was?", "Agreed. OP had serious reservations. Client was given complete refund.  Sounds like it was handled well as it could have been. Think this person saying OP was wrong doesn't understand make up.", "because you wouldn't do your job.", "preeety sure her job is to do makeup", "That may have worked but you still run the risk of the open wounds getting infected and then, it could be lawsuit city for the artist and/or company.", "Yeah we have disposable sponges for foundation and concealer but for things like blush, bronzer, contour, highlighter, we use brushes. Also obviously brushes are needed around the eyes. The disposable sponges aren't amazing quality tbh and don't do great at blending powders, it's a small company so anything that's disposable and can only be used once is very cheaply made so they can afford to go through it.", "I didn't want to accuse her of a \"condition\" or anything, it felt rude, so no. I just told her she had open wounds on her face and I couldn't do makeup on her because it would impact her skin health. My manager offered her to just get her eyes done.", "Couldn't", "Pretty sure her job is to know when using makeup could hurt a clients skin.      \nWhy are you being such a dunce?", "Do you do consultations prior to treatment? This is one of my standard questions: \" Do you have any skin conditions?'. It's asked of everyone. If you ask this way, it shouldn't sound accusatory. However, the open wounds are preventory as it is, so you did the right thing.", "Appointments are made through the company's website or by phone and I'm not in control of them, they are specific staff who handle phone calls and the website obviously wasn't made by me. \n\nIt asks you your skin tone, what kind of makeup you're looking for, preferred colors, and other basic info. Then there's a section to input special requests or add picture references. When done over the phone basically all the same things are asked except obviously you can't give a picture. \n\n\"Consulting\" is really only offered for bigger events like weddings, clients who are teenagers or who just want it for something like a school dance or Instagram pictures usually don't meet the artist until their actual appointment. \n\nThe company I currently work for is extremely new, this might be a wake up call to ask about skin conditions. But that isn't up to me.", "Ah, I see. There's not a lot you could do about it then. They may want to add a medical section to their questionnaire, especially with the suing culture to cover your back and theirs."]}