{"id": 7509, "submission_id": "10dr5wb", "title": "AITA For making a scene and kicking my cousin out of a baby shower", "selftext": "My wife (28F) is pregnant with our first child.  She is about 5-months along and I (29M) am very excited to be a father.  This past weekend we had a baby shower at our house.  We invited both sides of our family rather than try to do 2 separate showers.  I have a cousin, Sue (22F), who I wasn't going to invite because she's very open about being childfree to the point, in my opinion, of being anti-natalist.  She's said some very out-there things in the past about these topics and I figured she wouldn't want to come even if we invited her.  But after getting pressure from both my mom and Sue's mom about not leaving her out, I reluctantly sent Sue an invite and to my surprise, she accepted. \n\nFor the most part things went well at the shower.  But when my wife started opening presents, Sue kept making comments.  First it was about how much waste diapers create and how wasteful baby clothes are because they outgrow them so fast.  Then it was about how so many baby and kids toys are made overseas where workers are taken advantage of.  Then, when my mom told us that they had already set up a college fund for our child, Sue made a comment about how parents shouldn't force their kids out of the house at 18 and how if people had to support their kids all through life, maybe less people would have kids.\n\nIt was at this point that I pulled Sue aside and talked to her in another room.  I told her that if she hates the idea of kids so much, then she might as well just leave.  She said she was just stating facts and that the truth can never be controversial.  I told her that in that case, I have a hard truth for her.  I told her that I the only reason I invited her is because her mom practically begged me too and I don't want her in our house and that she is no longer welcome, so she should leave.  \n\nI must have raised my voice louder than I thought, because my mom and Sue's mom came into the room and asked what was going on.  Sue said that I am kicking her out because she's childfree.  I told her I'm kicking her out because she's being an asshole on a day that is supposed to be about celebrating my wife's pregnancy and all Sue is doing is making it about her BS beliefs.    \n\nMy mom and Sue's mom tried to calm things down, but I insisted that Sue leave right then and there or I would be forced to call the police because she's currently trespassing.  Sue grabbed her things and stormed out and my mom and Sue's mom got mad at me.\n\nThey told me that Sue was just stating her opinion and that some of the things she said are true.  I told them that there's a time and a place for that kind of conversation and a baby shower sure as hell isn't it.  I told them this is exactly why I didn't want to invite Sue in the first place and as far as I'm concerned, they are just as much to blame as Sue is.\n\nLiterally no one is happy and the whole baby shower became about something else instead of focusing on my wife and our coming baby.", "created_utc": 1673901913, "permalink": "/r/AmItheAsshole/comments/10dr5wb/aita_for_making_a_scene_and_kicking_my_cousin_out/", "score": 591, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Against my better judgement, I was talked into inviting my childfree cousin to my wife's baby shower.  Of course, she made a scene and I had to kick her out.  I also placed some of the blame on my mom and aunt who convinced me to invite her.  Now everyone is pissed about how things went down.  I think I might be an asshole for kicking my cousin out of a baby shower and for blaming my mom and aunt for making me invite her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "There's a time and a place for stating your opinion. Being a jerk when someone is opening a gift and talking about how wasteful that gift is, and so on is not that place or time.\n\nNTA", "NTA.\n\nYour cousin sounds insufferable and you did the right thing by kicking her out. The focus should‘ve been on your wife, your baby & you — and the celebration of welcoming a new family member soon.\n\nShe did everything to ruin the mood and make you and your wife feel bad. She deserved to get kicked out and you‘re definitely not an AH for it, rather the opposite.", "NTA. Oh my *god*, Sue sounds tiresome. You did the right thing taking her aside and quietly throwing her out, and I'm sorry your family doesn't have your back on this. That was absolutely not the right time and place for her to air those opinions. \n\nAsk your mom if she wants your lectures about sweat-shops the next time she gets a Christmas present. No? *Then she understands there is a time and a place.*", "NTA, she has to know what she’s doing, she’s trying to undermine your wife and make her feel bad for having the baby she wants which is not on. Reusable diapers are a thing and baby clothes can be donated, toys can be passed down. Everything she said wasn’t even the whole truth.", "While you weren't exactly nice to Sue, she *absolutely* deserved it in this instance.  She was 100% making this about her and how she thought babies were a waste.  \n\nSeriously, the moms are also AHs here... Sue was being INCREDIBLY rude at a party specifically geared towards celebrating babies and mothers.  \n\nNTA, I'd be rightfully pissed if someone were insulting my wife and future child in that way.", "NTA - and I’m also child free and hate baby showers…but she decided to go. The fact that she used that as an opportunity to be negative and rain on the vibe of the day makes her the asshole here. I absolutely agree her actions were super inappropriate.\n\nYeah if I’m being nit picky I’d say you went a bit too far…but really - she started it.", "NTA. Your mom and Sue’s mom are assholes for defending her. Since they insisted on inviting her they should’ve dealt with her and been the one to pull her aside. However, threatening to call the police is definitely over the top. I don’t think counseling would hurt anyone in your family", "NTA. Sue was being antagonistic under the guise of \"telling the truth\". Wrong time, wrong place, Sue. You were right to give her the boot AND for calling out the ones who pressured you to invite her. BTW, congrats on your new addition!", "NTA. I have no desire to have children and think people who do are absolutely insane, however, that's their choice and when people are truly happy to have a child, my opinion is invalid. To make such comments during a special moment in yours and your wife's life is so rude, if I was there, I'd have kicked her out myself and I agree with most of what she said. \n\nShe ruined your day by being an asshole.", "NTA and I'm sorry the shower ended the way it did. Sue sounds like an obnoxious, socially incompetent nightmare.", "NTA. Thank you for standing up for your wife. Also, a lesson there is to not let people pressure you into doing something that you know is probably going to go sideways.", "NTA...Like you said,  there's a time and place. If more people had kicked Sue out, she might have better public manners.", "NTA.   \n\n\nI... Jesus your whole family, OP! I think you need to cut Sue, your mom, and Sue's mom out of any baby stuff going forward. I don't think they deserve to see your kiddo when they get here. This is insanity.", "NTA Sue arrived with an agenda. You were right for having concerns about inviting her in the first place.", "NTA - I'm a child free adult myself and this behavior is gross. There's a time and space for introspection on \"waste\" and a baby shower isn't it. Stick to your guns and don't let her back into the fold once the kid is born unless she's matured.", "NTA While she's not wrong with the things she said, there absolutely is a time and place and also how something is said. If I were to just hang out with friends and discuss how a plant based diet is better because of certain health reasons, how animals are treated, etc. that would be fine. If I was invited to a BBQ and started lecturing everyone on how these animals they are currently eating were pumped full of antibiotics, how they often have cancer, absesses or parasites that are just cut away, how halal animals have their throat slit and are left to bleed out upside down, etc. I would be a massive asshole. I would be ruining everyones mood and appetite and for what? And your cousin was doing exactly this except the baby shower equivalent and that makes her an AH.", "NTA. She was going out of her way to be obnoxious.", "NTA \n\nYou put up with a lot before you pulled her aside. Sue may as well have creates protest signs on sticks and marched around the house. She was way out of line and also out of control.\n\nShame on both your mother and her mother for pressuring you before and their behavior during. The all ruined what should have been a joyful day.", "NTA. Time and a place. I hate it when the peanut gallery shows up and makes offhand rude remarks and state them as \\*truths\\*. Just because they are \\*true\\* doesn't make it appropriate to be spoken in certain circumstances. It wasn't her place to be giving her opinion out like that. Also, your mom and her mom are assholes for forcing you to invite her when you knew she would be an issue.\n\nIt's like when someone tries to force their religion on you in your own home. Heck no, get out of here.", "NTA but you probably should have kicked her out when she first started making the comments or have just stood your ground and not invited her.", "NTA\n\nSome people are unbearable as a hobby.", "NTA - They asked you to do something that you didn't think was a good idea, and you did it.  It bombed because she was dragging the party down, proving you right, and rather than let it continue, you asked her to leave.  If anyone is in the wrong, it isn't you.", "Nobody asked for her truthfulness.  She was being rude. \n\nNTA. \n\nYou two are making a human from scratch. I don’t even make brownies from scratch anymore.  Celebrate your joy and leave her out of any future announcements.", "NTA\n\nThis shower is supposed to be for you and your wife and about your first child. You shouldn’t have been guilted into invited someone that you didn’t want there. She didn’t need to make the shower about her - she doesn’t have to want children to celebrate an event that her family member is happy about. It sounds like you attempted to address it quietly but weren’t able to because someone simply wanted to create drama\n\nLesson to learn from this event: don’t let your mother and mother in law dictate who you invite to your celebrations anymore.", "NTA. Your cousin sounds like a pain and your mom and aunt are idiots for thinking her presence would be a good idea. The statement \"the truth is never controversial\" is the most asinine thing I've heard in a long time.  \n\nDon't just kick your cousin out of the baby shower, kick her out of your life. Be sure to keep her far from your kid so she doesn't express how much of a mistake having a child is to the kid themselves.\n\nPeople like this are pathetic. It's fine to be child free but to purposely and vindictively try to ruin someone else's BABY SHOWER bc of your personal beliefs is immature at best and cruel at worst.", "NTA. Sue sounds like a bundle of laughs.\n\nYou handled it the right way by taking her aside first and then asking her to leave.", "NTA-nice job defending your wife and your future baby! Your mom and aunt owe you an apology. I’m so sorry that you had to put your foot down, but please keep the positive things in the forefront of your mind. \n\nYou didn’t ruin the party. You gave Sue yet another chance at your mother and aunt’s requests. At least you now know you were definitely correct in predicting her behavior and you’ll be able to say no if they ever insist again.", "NTA\n\n> I told them this is exactly why I didn't want to invite Sue in the first place and as far as I'm concerned, they are just as much to blame as Sue is.\n\nYep, you should indeed have refused to invite her in the first place.  \n\nI have no idea why family members insist that x person or y person should be invited just because they are a relative.\n\nAs I often say on this subreddit, toxic people are not entitled to be a part of your life just because of their relationship to you.", "NTA\nOh gosh that is such a hard one. I think you clearly saw that Sue is very immature and while she may believe that there is nothing wrong with speaking “the truth” (aka her truth), the fact of the matter is that a baby shower is not the place for her critical and cynical opinions.  Her mother is doing her daughter a disservice by not educating her on how to behave when you are an invited guest and are celebrating a joyous event.  I also think that you contributed to the blowup by giving in to your anger. You could have set some firm boundaries with her and expectations before the baby shower so it wouldn’t come as a surprise when you ask her to leave due to her inappropriate behavior.  Hopefully sue will one day mature, but until then setting firm boundaries with her is the way to go.", "NTA. Congratulations to Sue and the moms on their not-baby shower! They effectively made the event entirely about Sue. Your poor wife. Sue sounds like a child. \n\nYou have my sympathy. Good on you for going so far to protect your wife and her special day. I'm so sorry it was ruined. Congratulations to you on your baby!", "NTA Your home, your celebration. They should not have talked you into inviting her in the first place.", "Show Sue one of the Debbie Downer sketches from SNL.  It’s basically the same premise. \n\nYou’re NTA.", "NTA \n\nShe’s entitled to her opinions and maybe some of what she said is true \n\nBut there’s a time and a place for things and this wasn’t it \n\nWho on earth would be so negative and rude at someone else’s baby shower", "NTA. Why did she even show up but to cause a scene. She got what she wanted.", "I've found that a really great strategy for determining whether or not to say a hard truth is to ask yourself the following questions: \n\n1. Is it true?\n2. Is it kind?\n3. Is it necessary?\n\nIf the \"hard truth\" doesn't meet at least two of the above criteria, then it shouldn't be stated.  NTA because Sue knew exactly what she was doing. She had a goal to disrupt the party in order to promote her childfree agenda, and didn't care that her statements weren't kind or necessary.", "NTA but threatening to call the cops is a bit much.", "NTA. Shouldn’t have called her beliefs BS, but anyone who’s been invited to a party to celebrate someone else and then goes out of their way to antagonise shouldn’t be at the party. \n\nSue is young and immature and it’s not your job to tolerate her antagonism.", "NTA\nThere's telling the truth, and then there's being a jerk. Sue is old enough to know not to spend a baby shower complaining about babies.", "What really annoys me about militant \"childfree\" individuals is that they think no one should have children and try to make everyone around them miserable if they don't agree with them.   \n\nIf they live in the US,  who do they think will be paying for their social security when they get older?  Who will be their nurses and caregivers if they become infirmed?   \n\nIt's OK to not want children but it's not OK to expect everyone to agree with that stance. We need to respect other's opinions,  even if we disagree.", "NTA.  You lost when you called her beliefs BS.  They are facts.  That doesn’t make her any less of an A for saying it.  What you should have said was that you don’t appreciate her negative attitude about everything as this is a celebration.  Since she doesn’t see fit to celebrate this life event, there is no reason for her to be there and then showed her the door.", "Child-free people that go on and on are the worst.", "ESH. Great that you pulled her to the side. You didn't have to go hostile despite your history with your cousin. Like you said, it's about your wife and your baby. Your reaction became the center focus when you could have easily talked to your cousin at least in this manner: \"Hey Sue, I'm glad you're here and I know you have your beliefs about having a child which your entitled to, but could you refrain from making your \"facts\" on my wife's day? This isn't the time or place to be making these comments and I would greatly appreciate if you can hold them in just for this day.\" \n\nBut you straight up told her to leave and you'll call the cops. yikes.", "NTA. Your cousin is right. But nobody asked her opinion so she should have shut up. As it stand she opened her mouth and should not be surprised you did too.", "ESH\n\nSure it is questionable for her to say those things then and there, but it is obvious she isn't grown up enough to see that. In such a case it would be helpfull to tell her that but that should be enough. \n\nIt is very disturbing that you think you are mature enough to have a child if you think your behaviour was correct though.", "I'm gonna hit you with an ESH.\n\nNow obviously your cousin is the bigger asshole by not respecting the decorum of a baby shower. But based on her comments I don't see that it was a reason to kick her out of your house. It seems a bit extreme.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife (28F) is pregnant with our first child.  She is about 5-months along and I (29M) am very excited to be a father.  This past weekend we had a baby shower at our house.  We invited both sides of our family rather than try to do 2 separate showers.  I have a cousin, Sue (22F), who I wasn't going to invite because she's very open about being childfree to the point, in my opinion, of being anti-natalist.  She's said some very out-there things in the past about these topics and I figured she wouldn't want to come even if we invited her.  But after getting pressure from both my mom and Sue's mom about not leaving her out, I reluctantly sent Sue an invite and to my surprise, she accepted. \n\nFor the most part things went well at the shower.  But when my wife started opening presents, Sue kept making comments.  First it was about how much waste diapers create and how wasteful baby clothes are because they outgrow them so fast.  Then it was about how so many baby and kids toys are made overseas where workers are taken advantage of.  Then, when my mom told us that they had already set up a college fund for our child, Sue made a comment about how parents shouldn't force their kids out of the house at 18 and how if people had to support their kids all through life, maybe less people would have kids.\n\nIt was at this point that I pulled Sue aside and talked to her in another room.  I told her that if she hates the idea of kids so much, then she might as well just leave.  She said she was just stating facts and that the truth can never be controversial.  I told her that in that case, I have a hard truth for her.  I told her that I the only reason I invited her is because her mom practically begged me too and I don't want her in our house and that she is no longer welcome, so she should leave.  \n\nI must have raised my voice louder than I thought, because my mom and Sue's mom came into the room and asked what was going on.  Sue said that I am kicking her out because she's childfree.  I told her I'm kicking her out because she's being an asshole on a day that is supposed to be about celebrating my wife's pregnancy and all Sue is doing is making it about her BS beliefs.    \n\nMy mom and Sue's mom tried to calm things down, but I insisted that Sue leave right then and there or I would be forced to call the police because she's currently trespassing.  Sue grabbed her things and stormed out and my mom and Sue's mom got mad at me.\n\nThey told me that Sue was just stating her opinion and that some of the things she said are true.  I told them that there's a time and a place for that kind of conversation and a baby shower sure as hell isn't it.  I told them this is exactly why I didn't want to invite Sue in the first place and as far as I'm concerned, they are just as much to blame as Sue is.\n\nLiterally no one is happy and the whole baby shower became about something else instead of focusing on my wife and our coming baby.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Stating your opinion shouldn’t be consequence free, we have too much of that online. You can say what you want but you might sometimes lose friends or a job, or alienate family. She needs to live wi those consequences.", "NTA, I don’t like kids or babies in the slightest and will never have any of my own but I would never go to someones baby shower and rant about it! She sounds childish and self-centred. The party was about celebrating you and your wife’s baby, I hope she didn’t spoil it too much for you.", "NTA, and let them all be unhappy.  The baby shower was a celebration of your wife & coming baby, not a grandstand for your cousin to spout off on.  And don't allow anyone to pressure you into inviting Sue to your house ever again.\n\nCongratulations to you & your wife on your baby, I wish you all the best!", "NTA. If she actually cared, she would have been sorting all the wrapping for compost and recycling and not had time to run her mouth. Nobody needs that kind of energy around, especially at a baby shower.", "NTA, but Sue your mom & aunt are AH’s", "NTA.  \n\nI'm 60 and childfree by choice.  That was  *my* personal choice for  *my*  personal reasons.  Your choices are just that,  *yours*. \n\nYour cousin needs to grow up.   You and your wifes Baby shower, isnt her personal soapbox.", "ETA - you’re both the asshole. \nShe is 100% more the asshole and sounds like a miserable person. I’m child free and want to be for the rest of my life but I still absolutely love my families/friends kids like they are my own. Just because we want different things doesn’t mean either of us are wrong. \n\nYou were the AH for yelling/ threatening to call the police. I would have pulled her aside, politely told her that right or wrong doesn’t matter in this situation and to please stop the comments. If she doesn’t, ask her to leave. Don’t scream. And if she refuses have a calm discussion with your wife on how you’d like to handle it. Or just do your best to ignore, be the bigger person, and never invite her to shit again. Again, she’s the bigger AH and I think a lot of people would have done similar to what you did in the situation.\n\nIt’s a lot to easier to say what one would have done in the situation opposed to what one would actually do.", "ESH, because as much as she was ruining your wife’s party, you also ruined it by raising your voice and bringing up the police.", "Yes exactly NTA The cousin is clearly giving people are hard time and the mother and aunt are very oblivious about it. There's nothing wrong with being child free but it becomes a serious problem when they negatively affect others.", "I’m also childfree and hate baby showers, but I’ve been to more than my share and you know what I do? I keep my mouth shut (except when I’m stuffing it full of food), smile, and if the mood strikes me I’ll even coo over a onesie. It’s just what you do to be kind. NTA.", "Some are professionally unbearable", "🥇", "Its a tool to pull out and use when someone wants to argue with you and refuses to just leave.  This cousin deserved to be thrown out by the collar of her shirt.  I cant imagine accepting an invitation, consuming my host's food, drink & hospitality and then making such a scene at a party that it disrupted the flow of things.", "Facts? Baby clothes are wasteful because they outgrow them so fast? What are they supposed wear? You can say the same about children’s clothes in general.  Also, I doubt many baby/kid clothes get thrown out unless they are in very bad condition. Most get handed down or donated, in which case they will in fact be used again, which is the opposite of wasteful", " NTA,  have a hunch the conversation escalated to what OP stated and didn't start out with the gtf out.    Someone  who is militant about a topic will do anything to cause trouble", "A grown woman shouldn't need to be told to act appropriately and not be obnoxious. Not her day, not her party, not her agenda. Do you need reminders on how to behave! too?", "How is he not mature enough.  Sue likes telling her truth, she should be able to handle OP telling his truth", "WTF\n\nDid we even read the same post? First of all, he did pull her aside. Secondly, Sue is a grown ass adult who should know how to behave without anyone telling her. This woman arrived with an agenda.", "Clearly you didn’t even read the post. He DID pull her aside and ask her to stop and when she argued, asked her to leave. She STILL argued. At that point, he has no choice but to get her to forcibly leave.", "What a laugh\n\nSue should continue to ruin the shower. Heaven forbid she is sent off.", "Mm good point.", "Which is why to keep it the day for her wife I suggested that. It’s not the right way to behave at all but don’t you think the OP sort of escalated that? Just stating that fact too.", "Yeah, sue should be sent off, I agree. She was definitely being as AH.", "NTA and if your mom and aunt agree with that asshole, don't let them babysit. They can visit your child under your supervision.", "NTA - Am child free. Your cousin acted extremely inappropriate and created a hostile environment during a joyful time. She’s entitled to these beliefs, but it is not her right to force this opinion onto others. I’d let Sue mature a bit before considering letting her back into your life (here’s to hoping her obnoxiousness is a symptom of youth). I’d also side eye the mothers for a bit, just in case.", "She knew exactly what was doing, and was enjoying ruining the day.  She also sounds like she is an attention seeker.  Good for you for not putting up with her.  NTA.", "NTA.\n\nBaby shower is about the family, Sue is anti-family and she was ruining the vibe, you are in your right to kick her out.\n\nThe whole thing about \"Not leaving her out\" is nonsense, she is an adult not a child, she is childless of her own free volition and choice.", "NTA. It’s obvious Sue wanted to use the baby shower as a forum to spread her BS and negativity.", "NTA, your cousin needs to learn some emotional intelligence. Just because you have an opinion doesn’t mean others want to hear it. The baby shower wasn’t about her and her opinions. I actually appreciate someone like you speaking up and settings boundaries. Just because someone is family doesn’t mean you have to include them. She doesn’t even sound like someone you’ll ever want around you kid anyway.", "NTA. I used to be one of these obnoxious assholes. I'd bring up how wasteful diapers are, how baby stuff was made by exploited people, how expensive kids are, how there are too many people in the world, etc. For me, those feelings stemmed from trauma. But as I've matured, I've had to come to grips with some major flaws in my reasoning:\n\nYes, diapers are wasteful... but they're no more wasteful than a majority of the stuff we use on a daily basis. Does she refuse to use plastic, or anything non biodegradable? If not, then she's being a hypocrite.\n\nYes, baby stuff such as toys and clothes are often made overseas by exploited people. It's an unfortunate fact. But it's also true that a majority of the stuff that we use in modern society is. It's something that needs to change, but it's not a flaw with baby stuff in particular. Does she track every single product she buys to make sure it is sourced ethically? If not, she's being even more of a hypocrite.\n\nAlso, have you ever indicated that you would just shove your kids out of the house at 18? Seems like a really random comment to make.\n\nFinally, I would like to leave off on just one observation. This is just my opinion, but I think it's quite frankly bigoted to hate children for just existing. They are humans first. They deserve to be treated with dignity and respect, just like any other human being.", "NTA - There is a time and a place and if she is so judgemental about them why did she come?  This war against kids versus no kids seriously needs to end.  It's a personal choice.  If it's not yours move on.", "NTA. Glad she didn't decide to bring her pet too. Seems to be the theme lately. I am 100 percent supportive of anyone deciding to be child free. But I expect the same respect as a person with children. I would never bring a child to a child free event, but I also wouldn't go to a literal baby shower to start crap with people procreating.", "NTA. Sue was being a complete AH. Being kicked out was the consequence of her actions.", "NTA. Good for you for standing up to Sue.", "NTA. Your cousin is an asshole.", "NTA. I share many of your cousin’s views which is why I don’t attend baby showers. \n\nIn fact, I don’t attend any type of shower because they all celebrate consumerism.", "NTA \nI never would have invited her family be damned", "NTA in this specific scenario, but am I the only one weirded out by how the wife is basically a ghost in this story? Unclear whether she is even happy about the baby, nor do we know how she feels about Sue’s opinions or anything else? The moms are involved, the wife is not…", "NTA.  Next time do not be pressured into doing something you know is likely to turn out badly.  You are 100% correct, there is a time and place, and your baby shower was not it.  Also, everyone has an opinion but that does not mean that we need to share that with everyone all the time.  Cut her out of your life and be happy.  If anyone has a problem with that they can join her as well.", "NTA. Your cousin was out of line and ruining a party because she had opinions that she couldn’t hold in. She got what she deserved.", "NTA, fuck Sue.", "NTA!", "NTA- making rude comments is not good guest behavior. Your cousin sounds insufferable.", "She’s anti-natalist and decided to go to a baby shower? Does she even know what a baby shower is?? NTA, she can take her negative ass somewhere else.", "NTA! I am childfree myself and would avoid most baby showers. But she chose to come and was a straight up dick the entire time. You should be able to enjoy these moment with your wife and child. I also recommend keeping her away from your wife and child for a while after your wife gives birth. She may say something really mean and you don't want to deal with that bull. Congratulations and may you have a healthy and happy baby💞", "Your cousin is actually right in the sense that much of what you have reported she said is true, but you can be right and still be an asshole. There is a time and a place for everything.\n\nNTA", "NTA\n\nI thought by the title you would be in the wrong but your cousin is just rude for no reason. You’re right, she clearly didn’t want to be there so she needed to leave. Not wanting children doesn’t mean you can’t support those who do. My SIL feels strongly that she doesn’t want any, but she’s a fantastic aunt and cried in excitement when I told her I was pregnant. Just like I have no interest in being a doctor but couldn’t have been happier when my friend finally finished med school.", "Nta. And I am also CF. Sue should have just said no to the invite. I strongly dislike baby showers to begin with, and while I would have been able to shut my pie hole about all her \"truths\" (some are just stupid, but she is right about a few) it just is rarely an enjoyable event for people like me, who don't want, or particularly like kids. She set herself up, and you and your guests. And until she can prove herself, I would not invite her to anymore baby events.", "NTA\nBaby shower suxx anyway", "NTA.  There is a difference between choosing to be child-free and just choosing to hate children.  Your cousin is the latter... but she doesn't have a free reign to inflict that hatred on other people who don't see things her way.  I can guarantee you she only accepted the invite because she saw it as an opportunity to flaunt her opinions and hurt your expectant wife.  Those types HATE seeing a pregnant woman happy about her soon to be born child.", "ESH. Your cousin the biggest one for not knowing the time and place rule, but you also for calling her beliefs bullshit (they aren't, she's right about the waste, the what is essentially modern slavery you're benefitting from, etc) and for threatening to call the cops lmao what a fucking overreaction.", "YTA for calling her beliefs bs and for threatening to call the police. \n\nNext time do everyone a favor and don't invite people you don't want at your parties. Your cousin is better off.", "Sue was on a mission to ruin the event for others, it seems.\n\nNTA", "Where do people even GET the idea that being brutally honest and giving everyone your unsolicited opinion about everything is some kind of virtue? It doesn’t make you edgy, it makes you an asshole. \n\nIf she was truly child free in the way she says she is, like against the whole damn concept of children existing or whatever, she’d just skip the event. Instead she attended and ran her mouth, because that’s what she wanted in the first place. Attention. \n\nShe’s already having the baby. You can’t stop her. What’s she gonna do, return it? Like what were you looking to accomplish here?\n\nIt’s like going to a BBQ you know isn’t going to be fully vegan and accosting every guest that has meat on their plate or hanging out with the host at the grill making snide comments the whole time. \n\n**Hon, if you didn’t want to be there, don’t go. It’s an *invitation,* not a fucking summons.**\n\n> Literally no one is happy and the whole baby shower became about something else instead of focusing on my wife and our coming baby.\n\nAaaaand that’s why you don’t cave to family pressure to invite the arsehole who thinks being child free is a whole fucking personality in the first place. You don’t want kids? Okay. You can choose not to have kids. Just for the love of god stop *telling* me about it.\n\nYou don’t have to make as big a deal about being child free as people make about being a parent. No need to compensate. Celebrate the victories and milestones in your own life, don’t hijack other people’s events just to talk about how you made different choices.", ">I’m also child free and hate baby showers…\n\nMe too.\n\nSo I avoid them.\n\nI don't go with the intention of making AH comments.", "Yo...people..just...wing brownies???!!! 😳🤣", "It's laughable that you think there is going to be social security in the future.", "Stating your anti-kid beliefs at a fucking baby shower is er appropriate. Sue is old enough to know better.", "By the same token, the anti-natslist cousin could have declined to attend.", ">I’m also childfree and hate baby showers, but I’ve been to more than my share and you know what I do? I keep my mouth shut\n\nI'm usually hiding from the ridiculous games and chatting where the bottle of whisky is!", "Yeah imagine making babies go naked and not using diapers because it's all wasteful lol", "This. Beyond hand me downs, there’s a whole industry around reselling used baby clothes. Most of them look brand new.", "Same omg. Like bro idgaf about which binky is cuter where's the spiked punch??!!", "No I do not. Again, adults know better than to ruin a party and make it about themselves and their agenda. If you behave like an asshole, you get treated accordingly. \n\nSince when are grown ass people not expected to have manners and know how to keep their mouths shut without specifically being told?\n\nOP was kind enough to take it to another room. I would have kicked her out in front of everyone.", "You're right too you know. I merely stated the my suggestion as a means to keep everyone somewhat satisfied (I know OP won't be) in an a strictly unbiased opinion. \n\nI wouldn't want to invite a cousin like that to begin with. But for the sake of family. \n\nlol based on grown ups keeping their mouths shut without specifically being told? apparently not the OP's cousin", "NTA.  This is precisely why cousin accepted the invite.  I bet she was giddy in anticipation of having a hostage audience she could preach her personal views to.  OP was right to boot her but he and his wife need to learn not to be guilted into things they know will backfire. Boundaries are essential, especially with a LO on the way.  Steer clear of this cousin in the future as she’ll make a point of disruption.", "Follow that gut instinct which was clearly ON TARGET!!🎯\n\nNTA", "You should have told your mom and Sue's mom to leave also since they were apart of the problem with inviting Sue and then defending her after you told Sue to leave.  You are NTA", "Your cousin is an asshole. No one is telling her to have children (or shouldn't be). She doesn't get to spew her anti-child venom at your baby shower. There's a time and place. A celebration of a baby isn't it. Your instinct to not invite her was correct but you were talked out of it. She made your event about her beliefs. That is not a good look. Make sure she is not invited to anything else to do with the baby. NTA.", "NTA. My daughter isn't inerested in having kids, and won't babysit for little kids, but she'll go to her friends' showers and give cool arty toys or clothes. Because she's a decent human. \n\nThen, when the kid's 4 or so, she'll bring him or her along to a Little Tigers TKD class and be a kickass teacher. I, for one, would pay good money to see this adult of mine wrangle a class of wandering electrons in uniforms!", "nta", "NTA\n\nShe decided to go to an event that was all about opening gifts for a baby. What the fuck did she expect to see? You gave her the opportunity to chill out and just attend the event but she couldn't hold it together and made a scene.", "NTA your cousin is a real jerk! Don't ever invite her for family or kid related stuff you're hosting ever again because YOU KNOW you're just gonna go through this all over again", "Wtf did I just read? Baby CLOTHES are a waste?! Does she expect you to wrap your bundle of joy in a potato sack?! Wtf is this person talking about??? Baby clothes they'll wear for a couple months aren't any more of a waste than clothes you only wear on a specific day, a specific time of year, or a couple times before it goes out of style. Come on! She doesn't wear ANYTHING that didn't come from a second hand store? Doubtful. She's just looking for ways to hate on people cuter than she is. My goodness. It is possible to not want kids without having to vehemently despise everything around them AND spew that hate at a BABY SHOWER. Seriously, everybody already agrees that child free is the best answer for you, you can quit now. Sorry, NTA. I respect the decision to remain child free and everybody has the right to their opinion, but nobody has the right to push those opinions or take over somebody else's event to discuss them. It's not \"sharing\" if the other person declines it, at that point it's forcing and that's almost never okay. She wasn't saving anybody so her forcing her opinion on others, not okay.", "NTA. Sue, your aunt, and your mom, however.   Your aunt and mom owe you and your wife (not to mention your other guests) one hell of an apology for insisting that she be there when you knew exactly how she would be. You need to have a serious come to Jesus with your mom about this.", "NTA. Your mom and Sue’s mom thought you didn’t want to invite her purely because of her opinion, and I mean.. did they consider that maybe you didn’t want her to come because, opinions aside, Sue’s personality could ruin ANY party?", "Nta. Sue doesnt want kids because she would rather be a kid forever.", "NTA. I’m childfree and would NEVER be an AH like that to anyone I knew having a baby. Sue is full of herself if she can’t shut her trap for an afternoon for a family event. Yes she can have opinions but there’s a time and a place to voice them. I’d have yeeted her out the door too.", "I have an opinion, Sue's a c\\*\\*\\*.  \n\n\nHonestly, good to see you having your wife's back. NTA and you should send the biggest gaudiest \"We just gave birth balloon\" to Sue.", "Nta - Sue is TA, your Mom and Sue’s Mom are Aholes (for agreeing with her and forcing you to come), and I guess they don’t want to see the baby when it’s born if they think it’s wasteful to have a child. I’m so sorry you had to go through this. Congrats on your baby and may all go well.", "Bro.. I am child free and I can't imagine being this audacious. At a freaking baby shower!? Like.. its my personal choice not to have kids. But that doesn't mean the whole world caters ro me? Sue is whack.", "Yes sue is the asshole but unfortunately you let her ruin the day by feeding into her crap when you should have just ignored it.", "NTA. Sue’s mother and your mother insisted you invite her into your home. Why didn’t they insist Sue keep her mouth shut and her opinions to herself?  \n\nI’m also child-free and was dragged to more baby showers than I can remember. I was also raised to be polite when in other people’s homes.", "“The truth can never be controversial.” Um, what?", ">They told me that Sue was just stating her opinion\n\nAnd why did she think that there was a place for her opinion when literally no one asked for it??? NTA, your mom, aunt and cousin are weird af", "Sue sounds like “THAT” redditor on every thread. You know, the one that absolutely has to piss on the most wholesome post or comment.", "NTA. You did the right thing by giving her a shot. She showed that she can’t be trusted to be pleasant at an event that isn’t about her. Now you are easily able exclude her from events going forward.", " NTA. I’m childfree but I’m not an AH.", "Man you are a great husband and soon to be dad. I might have swooned over you protectiveness of you wife and baby. Wish more men would have the balls you do in having their wives backs.\n\nEdit to add NTA", "NTA but your cousin, mom and aunt are major AH. Your cousin came determined to spoil this happy time for your wife, glad you kicked her out. Sue is just an entitled brat who hides behind her supposed “honesty” with her BS beliefs. There’s a difference between being “child-free” and choosing to “hate children” she sounds like the latter. You mom and aunt ought to be ashamed of themselves for enabling such person. Go NC with the cousin and LC with mom and aunt until they recognize and apologize for their part in this.", "NTA she sounds miserable", "NTA.  Sue hijacked the shower with her negativity just as you feared, stealing the show with her supposed truth telling.  Childfree shouldn't mean child hating.  It's bewildering to me as they should be grateful to the folks who want and are having children for the next generation.  How do they think humans survive as a species if not for those who are having children?", "Soft ETA. Everyone knew she was being AH - she was being judged harshly by all attending I am sure. You making a giant scene almost certainly ruined the event more than just keeping your mouth shut and blasting her later which IMO is what you should have done. I get why you did it though. I think going NC with her is the right choice going forward though.", "The entire time I read this all I could think of is that baseball scene in the Naked Gun movie.. \"You're outta here!\"  https://www.youtube.com/watch?v=IprIO1nly-Y", "It was \"I just tell it like it is\" cranked to 11.", "Like babies are only wasteful things in society… Does Sue go to stores and complain to the employees about overseas production and waste?", "Not to mention who does Sue think will be paying for her old age pension... If she thinks babies just create waste she should opt out of society entirely.", "This - I would personally never have invited her, I'd rather deal with whoever moaned about the exclusion (i.e. Mum and Aunt) than the person themselves (i.e. Sue).\n\nI get that the pressure can be exhausting, and people cave... but hopefully OP has learned that the caving just creates another problem, and it's not worth it.", "sue wanted to sue the event", "\"Where do people even GET the idea that being brutally honest and giving everyone your unsolicited opinion about everything is some kind of virtue? It doesn’t make you edgy, it makes you an asshole.\"\n\nThis is a question I've asked myself a time or two.", "People like Sue don’t want others to make different choices. They want others to feel bad and inferior about their choices so she can feel better about herself.", "Good thing she's child free. Can you imagine how her spawn would turn out!", "She Sued all over that baby shower.", "Oddly enough, I actually like the games part (unless they’re truly horrible) because they make the time go by faster. Once I had to attend a baby shower for a family member who was married to a pastor’s son and we had to sit there for three hours watching her open gifts from every member of the congregation. It was actual hell. I’ll take a few games over that any day of the week."]}