{"id": 7540, "submission_id": "10e4h5m", "title": "AITA for bringing the receipts when my ex had me shunned from our mutual friend group?", "selftext": "So my (26F) ex bf (27m) broke up with me a week ago. It felt sudden to me, and there was no warning it was going to happen. However, we handled it very amicably imo and he wanted to try and stay friends.\n\nI met him online through a mutual friend and had been friends with him and the rest of the group for a few months before dating. When I went into hospital back in August, I sort of just fell away from that group of people where I couldn't be online. However one of our mutual friends had caused a lot of drama and we both cut her out of our lives because it was very toxic.\n\nNow in December she reached out to me, apologized and we started to talk slowly again. My ex bf during this whole time would message me and tell me over discord that he hated her guts, she was an *insert bad word here*, and I could talk to her but he was completely done with her. \n\nI'd always ask him about hanging out with other friends or playing games with other people and encourage him to do so while I was sick and or offline. His responses were always \"I don't really talk to anyone anymore\" or \"I only want to talk/play with you\" and when I'd dig deeper he said they all just fell out of touch.\n\nFast forward to the breakup, the first thing he does (after our apparently amicable and no hard feelings talk) was to go straight to that mutual friend he said he hated with a passion, and tell her everything I ever did or said wrong in our relationship. He told her a private conversation we had where I'd jokingly brought up how often she cycled through flings and then told her and every other mutual friend we had, that I was the reason he stopped talking to everyone. That he was worried I'd get jealous or upset if he talked to/played with anyone else but me. Because, and I am quoting him verbatim here, \"I know how I would feel in that situation and I didn't want to put you through that\" I'm sorry what??\n\nSo this friend came for me hard over dms and asked why I would say and do such things. I was shocked and extremely hurt. I never would ask/make someone give up his friends or isolate them from anyone as this seems controlling and I didn't want that. So my petty ass said screw this. I went through our past conversations, took screenshots and privately messaged everyone he told this bs to, apologizing that I was the reason they lost their friend. Then followed up with the pictures to prove he did this on his own and against my wishes. These photos may or may not have also shown the crap talk he said about that one mutual friend.\n\nHe's been blowing up my phone since asking how could I do that and call him out like that? All he wanted was a clean break and to get his friends back, and that I'm an asshole for making them question him. I haven't responded because imo he lied about me and our relationship to friends we both had, who then took his side no questions asked and kicked me out of their lives and discord servers based off word of mouth.\n\nSo Reddit, AITA for sending proof to our friends?", "created_utc": 1673934906, "permalink": "/r/AmItheAsshole/comments/10e4h5m/aita_for_bringing_the_receipts_when_my_ex_had_me/", "score": 3225, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I sent screenshots of him bad talking friends and lying about not wanting to talk to them and sent them to our friends, which definitely hurt his feelings and now everyone is questioning what he's told them about our breakup and not trusting him right away.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Soooo NTA. I can't even imagine how twisted he got himself to try and throw you under the bus like that.", "Sounds like a situation I was in with online friends. The guy tossed me under the bus to make himself look good and me look bad. I let it go at the time but over the months and weeks after, they'd ask me questions and I'd just share screen with them so they could see unedited discord conversations. \n\nYour guy FAFO. He got exactly what he deserved. Zero sympathy for him. You absolutely dodged a bullet, just like I did. Remember this going forward also. It's a life lesson.\n\nNTA", "Sashay away from all of these people. You will be happier.", "NTA.  Paybacks are hell!", "Since there is not a justified A H judgement in this sub I’ll just give you a NTA. He was the one to expose your private conversations by telling the one friend about the offhand comment you made before you got to know her better. And then he used that to start a smear campaign against you. If he’s going to start some BS like that he really should have thought things through. \n\nYeah you could have just walked away from that mess and the people who would blindly take his side without talking to you first but revenge is so much sweeter. What’s good for the goose is good for the gander. You just finished what he started. He wanted to show them one text that reflected you in a bad light and you showed them all the text to clear up any confusion. Was it an A H move on your part? Maybe but it’s a justified one. His way was manipulative and yours was informative. I’m sure your friends are all a bit uncomfortable with being put in the middle of this but they can all talk to him about that since he’s the one to drag them all there. \n\nI’m sorry your breakup wasn’t as amicable as you thought. At least he’s out of your life now and you see what a huge bullet you dodged.", "NTA.  He made his bed.", "NTA lol he dished but couldn’t take it. Well played, op.", "NTA. sure this was petty, but justified. Ex decided to talk major shit about u behind ur back and tried to ostracize u from the friend group. you merely defended yourself and uno reversed on him. keep them receipts, babeyyy", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my (26F) ex bf (27m) broke up with me a week ago. It felt sudden to me, and there was no warning it was going to happen. However, we handled it very amicably imo and he wanted to try and stay friends.\n\nI met him online through a mutual friend and had been friends with him and the rest of the group for a few months before dating. When I went into hospital back in August, I sort of just fell away from that group of people where I couldn't be online. However one of our mutual friends had caused a lot of drama and we both cut her out of our lives because it was very toxic.\n\nNow in December she reached out to me, apologized and we started to talk slowly again. My ex bf during this whole time would message me and tell me over discord that he hated her guts, she was an *insert bad word here*, and I could talk to her but he was completely done with her. \n\nI'd always ask him about hanging out with other friends or playing games with other people and encourage him to do so while I was sick and or offline. His responses were always \"I don't really talk to anyone anymore\" or \"I only want to talk/play with you\" and when I'd dig deeper he said they all just fell out of touch.\n\nFast forward to the breakup, the first thing he does (after our apparently amicable and no hard feelings talk) was to go straight to that mutual friend he said he hated with a passion, and tell her everything I ever did or said wrong in our relationship. He told her a private conversation we had where I'd jokingly brought up how often she cycled through flings and then told her and every other mutual friend we had, that I was the reason he stopped talking to everyone. That he was worried I'd get jealous or upset if he talked to/played with anyone else but me. Because, and I am quoting him verbatim here, \"I know how I would feel in that situation and I didn't want to put you through that\" I'm sorry what??\n\nSo this friend came for me hard over dms and asked why I would say and do such things. I was shocked and extremely hurt. I never would ask/make someone give up his friends or isolate them from anyone as this seems controlling and I didn't want that. So my petty ass said screw this. I went through our past conversations, took screenshots and privately messaged everyone he told this bs to, apologizing that I was the reason they lost their friend. Then followed up with the pictures to prove he did this on his own and against my wishes. These photos may or may not have also shown the crap talk he said about that one mutual friend.\n\nHe's been blowing up my phone since asking how could I do that and call him out like that? All he wanted was a clean break and to get his friends back, and that I'm an asshole for making them question him. I haven't responded because imo he lied about me and our relationship to friends we both had, who then took his side no questions asked and kicked me out of their lives and discord servers based off word of mouth.\n\nSo Reddit, AITA for sending proof to our friends?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. He fucked around and found out. \n\nSo because he wanted his friends back, he could throw you under the bus and slander your character. But you aren’t allowed to correct those lies with irrefutable proof of his own words? This man is the victim of his own stupidity. I’m glad he broke up with you.  He did you a huge favor.  You are sooooo much better off.", "How old are you all?", "Edited.\n\nNTA.", "I assume it was his way of getting closure? But it was very cruel and so out of left field. Especially since he was the one who broke things off.", "The friend group? Ranges from 22-35", "I made one comment before knowing a situation. This was one single comment to my bf over a call. He consistently talked about her in a bad way, on a call, over messages. I apologized to her profusely when she initially asked me about it and admitted that it was wrong to say that. Didn't deny it to her and told her I'd understand if this changes our friendship.", "I'm sorry you have to deal with such short sighted self satisfaction and hope you have a bright future ahead.", "And what about the other times he messaged you about someone else? Did you just let him vent and not say anything in return, did you contradict him and stand up for your friend, etc?", "Thank you very much. The experiences I've had this past week are making me realize the breakup is a blessing in disguise.", "I let him vent to a degree. I would ask if he wanted a solution or a listener. If he needed to vent that's fine. Everyone has issues with their friends, but there were multiple points where I had to stop him because it was getting out of hand. Those responses were also added in the screenshots I had sent. One of the biggest issues he had was he didn't like how I wouldn't let him continue if he said something out of hand.", "He lied about you to all your friends but he's mad at you for defending yourself? Narcissist! Good thing you aren't together anymore.", "NTA. You defended yourself using the truth.", "NTA", "NTA\n\nSorry this happened to you.  You dodged a bullet with this ex.  You did good setting it straight.   He deserved it.  Let him stew in his own s\\*\\*t soup.", "nta obviously but consider that anyone who would cut you off without hearing your side of the story isn't a friend", "Reputation destruction of partner after breakup is common among narcissistic leaning individuals. Sorry he lied. Nta", "NTA.\nI remember my ex tried to trick me similar way when we were in relationship.\nEarlier he said, he didn't want to meet his friends.\nLater: he didn't meet them because of ME.\nI answered immediatelly that HE was who said that he didn't want to meet them. He wasn't able to refute me, because he knew I remembered exactly what he said.\nI never forbade him from anyone, so he had other intentions with it.\n\nThanks God, he is just an ex long ago.", "NTA. If the truth paints someone in a bad light, it’s not the truth that’s the issue.", "Both of you are immature. The internet is not real life. ESH.", "\"Wait wait wait wait...you lied to MY friend about me....she came to me....and you expected me to...what...lie for you...about me?  If you wanted a clean break...then you should have kept my name outta your mouth.\"", "Eh.. technically NTA-but you kinda are the AH for even caring. You already dropped that group anyways-so who cares what nonsense your ex is saying to get his friends back? \nThey all sound flakey anyways. And if you’re in the type of hospital I am assuming-they all seem pretty wacky and self involved to bring drama to you while you are in there.", "I am so sorry you went through that. It's never good when someone tries to ruin a reputation. I am technologically illiterate 99% of the time and wouldn't know how to edit anything on a laptop or pc if my life depended on it. All my screenshots were from my phone and they knew immediately nothing was cropped or edited.", "I disagree that this is a justified ah move. IMO it's never being an ah to defend yourself against slander. Setting the record straight is always the fair thing to do.\n\nIf someone experiences consequences from their lies being exposed, that's on them for lying in the first place.", "I do feel slightly bad because for the most part, during our relationship, he was sweet and kind. A little near sighted with being open minded, but kind. But it definitely feels justified as I went out of my way to not say anything bad about him or our relationship after the fact. Not even to my best friend. And he knew this, and did the opposite. I don't usually take the petty route, but this time it felt amazing", "Why do people try to do the full 180 acting like you have memory loss and won't remember the conversations? \n\nGlad he's your ex as well!", "To clarify, I am not currently in the hospital. That was a couple months ago. I had slowly been talking to them again once I was well enough to come home as I wasnt able to keep up with them when I was in there. I don't understand how caring if someone tries to ruin my character makes me an AH? Please explain that part further.", "So let me get this straight.  He lies to the friend group about you but when you tell the truth, with evidence of what really transpired, he's hurt that you called him out?  What an AH \n\ndefinitely NTA", "I am so proud of you. That was epic.  \n\nHe did it because he's an asshole.", "I can see where both of you are coming from. And you make a valid point that it's always fair to set the record straight. I do still feel like a little bit of an AH just because I know it hurt him and I seriously hate hurting people.", "Thank you! :)\nMy theory that he is narcissistic and wanted to make me feel guilty and manipulate me. Luckily he was weak and too coward for this.", "Now I feel old and out of touch, I’m in my 30’s and had no idea what Discord was. So are these like all online only friendships/relationships with other gamer people?", "Maybe that was harsh-you’re not really an AH for caring-but don’t care anyways. If these people were worth being friends with they would of looked beyond the ex saying things in a break up. You wouldn’t need to show ‘proof’ after the fact-cuz they would of shut that crap down.", "Basically yes. And before I found out he had done this, he had taken the opportunity to vent to me about me. About every inadvertent thing I'd said or done to hurt him during our relationship and that he believes I don't actually like men and am a sexist to men because I am wary of men I do not know. And I just let him say it while constantly apologizing and validating his feelings towards things like that.", "Lol thank you! It was the most powerful I've ever felt. To be able to actually have a \"Well actually what happened was\" moment!", "It's nice that you do, but he doesn't have the same concern about hurting you. \n\nYou are redressing the balance here, not starting something to hurt him. He hurt you and you are allowed to say, \"that thing you did - that was hurtful to me because it was a lie.\"\n\nYou don't have to accept being hurt to be the bigger person. It's ok to tell the facts of the situation and walk away.", "Some of them are online only, and some are people I know in real life. But yes, it's great for connecting to other gamers as well", "I did respond to another comment saying that at this point, I don't care if I do get that whole group back. I am content to stick with the friends who did shut him down and believed I was better than that", "I'm so glad he's out of your life.  What a jerk", "Out of curiosity, what has been the friend group's reaction to your evidence of what really transpired?  are you back in the group and he's out?", "My video game skills ended with Sega as a kid haha. Other than commenting on like a Reddit post which is anonymous I am way too wary to talk to people I don’t know online. When I was in middle school I believe we watched this movie “Strangeland” that scared the f out of me. Oh and by the way good riddance, on to better things for you!", "I rarely read the comments under the initial posts-so I didn’t see. But that circle sounds flakey. Anyone that bases their connections on gossip doesn’t seem like people worthy of your time. And even if you have been out of the hospital a bit-if it was for mental health-good friends would not bring a bunch of hearsay and drama that could harm your recovery to you.", "I've had one friend completely ignore me, another reach out to get my whole side, and another who completely forgives him but still blames me for him not talking to her. One friend had my back from the start, before any of this happened and never believed what he said. The 2 others have yet to say anything. Honestly though, at this point I don't care about getting back in the friend group or him being out. This has showed me the insanity that can happen based on word of mouth. So I will stick with my couple of close friends who didn't believe the lies and move on from the others. I was more worried about just clearing my name because I try my best to be nice to everyone and non judgmental. So I hated that they believed him without a second thought for my character", "Smart.  Surround yourself with true friends, the rest aren't necessary", "ESH. This is middle school crap. All couples say things to each other about people they wouldn't say to their faces. They don't necessarily type them out, but your whole friend group's dynamic and your own behavior is very immature. You should spend some time alone contemplating that.", "ESH", "Discord relationship problems. ESH", "ESH and your poor friend is being used and abused to fight your battles.", "NTA for defending your reputation. \n\nA clear case of FAFO", "NTA\n\nWhen someone lies about you and completely misrepresents who you are (slander/defamation basically)… you have the right to defend yourself and clarify things. \n\nIt’s not your fault if his actual words to you make other people upset. He lied about you and this is the only way to clarify things. \n\nHe chose to dump his friends for you DESPITE you actively wanting different. It’s best those friends know how little he values them so they also don’t need to waste any more time on him. \n\nBlock him and be done with him. If he makes new accounts to harass you - block them. Don’t delete the messages - you want it to documented. But block him. You have no need to stay in communication with him.", "NTA. He tried throwing you under a bus and got hit instead.", "nta", "NTA\n\nHe lied about you for his own ends and to your disadvantage. He deserves it.", "NTA. Of course you would defend yourself against defamation with evidence, what is he on? What you did was not petty. It's what any person would do in your shoes. Shout out to that mutual friend that confronted you instead of just ghosting and excluding you solely on his words. That friend who communicated and basically asked for your side is worth keeping. The rest of them, relegate to acquaintance status. And block the sad, pathetic excuse for a man that is your ex. He does not deserve to live rent free in your mind even a second longer.", "Nta. Hope he stretched before he made those accusations. Anyways if those friends are going to hump and play sides then they aren't worth being friends with.", "NTA", "Ahh yes. Another \"fuck around and find out\" post. Adulthood is far too late to find out actions have consequences. The poor fool.\n\nNTA", "NTA\n\nBut I think you should look for other friends.  If they were that ready to believe the worst of you...well, you deserve better.  He's an AH, but they aren't much better.", "NTA- he tried to manipulate them to be his friends only. Really if he wanted that he could have just been honest with them.", "NTA", "NTA. He tried to throw you under a bus but ended up tripping and falling under it himself.", "Not to be the one to throw this word around, but those are some pretty strong narcissistic behaviors on his part. HE isolated YOU in the relationship saying he’d rather just hang out with you and nobody else, he discarded you out of the blue yet “wanted to stay friends” aka keep you around for supply until he finds someone else, then he started a smear campaign to turn people against you and when proven that he was lying he flipped it and blamed you for it. The fact that he’s an adult and exhibiting these behaviors means it’s likely this is just who he is and how he goes through life. Look out for the “Hoover” next which is where he’ll likely fake apologize or tell you other things you want to hear to hopefully win you back. The best thing to do in this situation is to ignore him forever.\n\nNTA", "NTA. Time for a whole new friend group. Him for what he did he wanted closure and he got it. And them for believing without question.", "You are NTA.  You have every right to defend yourself against any attacks in any means necessary.  I'm sorry he did that to you.  Cut him out of your life, and block him.", "NTA if he wanted to be friends with people again, he NEVER needed to talk shit about you to do it. Instead, he went to war on your character. So you went nuclear. Alls fair here.", "NTA. He could hace kept his friends without trying to drag you through the mud. This wasn't about his friends. This was about him trying to maximize damage to hou and he's a creep for that.", "You are well rid of that one. You showed the conversations to them after he lied about you, to demonstrate it was rubbish. He started what he couldn't finish. NTA.", "How’s it immature to correct the record?", "It’s not closure. He was a shitty friend. And he didn’t want to be held accountable so he put all the blame on you, and thought he had sufficient control over you that you would never call out his lies.", "I hate when people throw the word narcissist around like Lambert’s throws rolls, but this person sounds like a total narcissist. I’m glad you are away from this relationship, and I’m glad you had the receipts! You are NTA, and it honestly makes me happy to read your post and know he didn’t get away with trashing you to others.", "If the truth makes you look like an asshole….", "It's an online chat group. It's not real life. They're both overly invested.", "He literally accused you of being an abuser. That could have come back to bite you hard.", "Online doesn't ever translate to real life ever. It isn't like people have lost jobs cos of their online comments or anything. It isn't like people have ever committed suicide cos of the 'online'. So when the aliens who inhabit online lie and defame your character, you just support and help them tarnish your image further cos online is in saturn", "Your ex sounds like a right piece of work that's rapidly headed for incel territory. Count your blessings and be glad you dodged that bullet.", "That’s probably a lesson to keep in mind for future relationships (friends, family, SOS or other relationships). If they like to bad talk other people to you, then as soon as your relationship has any wrinkles they will be bad talking you to everyone else.", "NTA, but did you guys have a purely online relationship? Doesn't change the verdict just wondering. Seems hard to be as invested as a regular relationship if you don't have (frequent) real life interactions.", "He wanted a clean break aye? Then he shouldnt have flung shit around to start with nta. Sorry ya had to go to that extent. I hope your done with the lot of em", "NTA - as an accountant always keep receipts.", "NTA, but now you see why it is so much better to cut ties completely and block exes.", "NTA. I officially crown you the \"Queen of Petty\" and I love it!!!! Girl! I am glad you dropped the receipts and showed everyone his true colours. After all, he started it by lying and all you did was defend yourself.", " Okay but where’s the rest of the tea? 👀 Did they apologize for being blind believers? Or? 👀👀\n\n\nAlso NTA, djscord servers can be full of so much drama sometimes 🤣. I’ve been in similar situations", "ESH: Your ex for being a gaslighting a*****e; your “friends” for believing BS about you without even asking you about it; and you for stooping to the same petty level as your ex. \n\nWhy would you want to associate with people like that? Maybe I’m reading too much into it, but it seems like you have low self esteem. If you have insurance, your employer provides an EAP, and/or can afford it, I would encourage you to talk to a therapist about how to feel more confident, set boundaries, and make better choices in friendships.", "You jokingly mentioned that she \" cycled through flings\". You seem like a shitty \"friend\".", "NTA but honestly? I’d get new friends. Better ones. That all sounds super toxic.", "My ex broke up with me because he said I wasn't attractive anymore, gained weight, and due to stress (STEM in college) he didn't want to be around me anymore. We were 4 years in and engaged. The he went and told all of our friends I cheated on him (not true) and that they should all drop me as a friend.\n\n10 years later I don't miss a single one of them.\n\nI am really into gaming as well, have a few really good friends on Disc that I've never met in person, and a ton of people I 'play with'. Over the years, they come and go. You will make new friends without this baggage and be much happier for it!", "NTA. Your ex is a jackass and got what he deserved when you sent the truth out to the friend group.", "NTA! He probably went with his narrative thinking no one would correct it and you have said a big F U. It is best those friends are protected from this manipulative dude!", "Your ex wanted to bang your mutual friend because he thinks she is easy, keep you as a friend so once he is done banging her, he can come back to you. You ruined that for him. NTA", "Is there a reason he couldn't start hanging out with his friends again without trashing you?\n\nYou merely cleared up his lies because yeah, screw that. He shouldn't have created the situation. \n\nNTA", "NTA.  He made his choices and should have just found another way to get back in with his friends instead of trying to use you as an excuse.  It sounded like he wanted his cake and to eat it too.  He had a clean break, but that was just not good enough because now he needed a reason for dipping on his friends.", "NTA I say good job OP.\n\nI can be very amicable and keep secrets as well, that discretion however reaches its limit when you start telling lies about me.\n\nJust respond to him with something like “…I don’t care about what you talk about or to whom, but if you tell lies about me I will tell the truth about you….”", "NTA block him", "NTA he pisses in the soups and now he’s complaining that he didn’t think He himself would have to eat it.", "NTA\n\nHe deserved it and tell him that he deserved it too.. maybe tell him you do like men you just dont like AH like he was. Then block his ass on everything!!!", "NTA.\n\nHe ran you through the mud. And they need to know the kind of person he is. Because if he could do this to you, he will do it to them.", "NTA \n\nI love this. I had a recent breakup where this man blamed it on my past while his trauma was like a third person the whole relationship. It made me so angry that he could pretend I was someone I’m not and not own up to his own bs, and I’m not even friends with his friends. I’m happy for you. Liars deserve to be called out. I had to decide to forgive him, and I have, but I was absolutely furious for weeks. Fights and breakups are eye opening sometimes.", "NTA he was lying about you and you were telling the truth about him. He’s upset you wouldn’t go along with the lie", "Your ex: “I want to stay friends!”\n\nAlso your ex: talks to everyone in your friend group in order to push you out, wanting a “clean break” from you and the friends for himself.\n\nResult: you are NTA, Your ex is a toxic liar who you and your friends are better off without.\n\nBut please note the warning signs for future reference: someone who trash-talks a friend behind their back, so much and so badly, is likely to eventually do that to you too.", "NTA but if they kicked you out just from believing the word of mouth, they're NOT your friends.", "NTA\n\nI don’t think I even need to go into the reasons why this is obvious. Question for OP, did anyone else in the group just blindly believe anything he said without any proof? Could be a lot of assholes in there if you ever think about reconnecting with them.", "Wow!  You dodged a bullet, OP.  I love that you had the receipts to prove it and stood up for yourself.  This should be filed under “don’t start nothin’, won’t be nothin’” 😎. Go completely NC with this guy now - he showed you who he is and it’s a toxic mess.", "NTA. You're doing what he tried to do, just more successfully.", "NTA.\n\nYou are clearly a people pleaser as evidenced by your willingness to put up with his moody behavior and the fact that you kept trying to make it better ***for him***, when you were the one who was in the hospital which was NOT YOUR FAULT.\n\nPeople like your ex are attracted to people like you because you feed their egos and do all the work to keep the relationship viable. \n\nYou need to realize that your exes behavior was PREMEDITATED. The whole let's stay friends bit was for his benefit so that you wouldn't make a fuss and make him feel bad. He deliberately sabotaged you with the friend group so that you were the bad guy when he failed  to stay engaged with them. He's now trying to make you feel bad that you found your spine and didn't let him get away with it.\n\nI think now is a good time for some self-reflection. Have other romantic relationships followed the same pattern (e.g., getting dumped unexpectedly, apologizing for stuff that is not your fault)?  Or is it a one-off and you got taken in by a smooth operator? \n\nBecause if it is a pattern, people will continue to take advantage of you if you let them.", "NTA And it sounds like it may be a good thing you're out of that relationship. Correcting a vicious lie never ever, makes you an a****** .", "FAFO\n\nNTA", "NTA. He needs to learn the important life rule: “Don’t start shit, won’t be shit.”\n\nHe started spewing lies and half-truths, you showed the facts. Maybe he’ll think next time before he does stupid shit.", "Nta.\nYou had a lucky escape", "NTA. Am I the only one who marvels at the modern way to prove justice over he said/she said with archived screen shots instead of the old fashioned way of real life verbal smears? Kudos to you, dear.", "ESH except for that girl you slut-shamed. Are you sure that y'all are 26-27 years old?", "He FA&FO, OP, and you're NTA.", "NTA", "Nta", "Nta. He started it", "Nta you are a legend for that", "As John Adams said \"Facts are stubborn things; and whatever may be our wishes, our inclinations, or the dictates of our passions, they cannot alter the state of facts and evidence.”\n\nA super rationalizer cannot be reasoned with.  But this does not make him/her right.  Based on your post, I vote no you TA.", "NTA is this guy Josh from Boston? Because this is almost the exact situation I was in a couple year ago. Guy really blamed me for making his friends not like him and when I said \"they don't like you because you treime like shit in front of them\" he blew up. You're absolutely so much better off without this loser. He just wants to bitch about everyone behind everyone's back and I'm sure it's a lot to handle rn, but you and your friends are ultimately so much better off without him.", "Definitely NTA! You wouldn’t have had to “call him out like that” if he hadn’t lied and tried to make you out to be some sort of villain. You were just defending yourself after he tried to scapegoat you to get his friends back causing you to lose friends. \n\nEdit-were from we’re", "This. OP, I had a BF I broke up with when I was younger. He went to college with our friend group and told everyone I cheated. When I found out, I cleared it up with people, but I also called him and asked him why he said that after we ended things nicely. His response was, \"What was I SUPPOSED to say? That you just fell out of love with me.\" Like, yeah, the truth. \n\nI still wish I would have recorded him and played it for everyone, because I'm sure some of them still think I cheated on him...\n\nGood job clearing it up. He made a tangled web of lies, let him untangle them.", "I obviously understand what you're saying, since it's human nature, but there's literally no such thing as **justified revenge**. You can try to justify it, but that doesn't mean it's justified. You literally even admitted that OP could have walked away but \"revenge is so much sweeter\".\n\n&#x200B;\n\nThis sub isn't about whether you're justified in being an AH...it's about whether you **were an AH**. In this case, she was. Sure, I would easily say I might do something similar and I understand her reasons...but it's still a petty AH move to go through the trouble to make him look bad just because he hurt you.", "I do agree with this. If I didn't ask him/encourage him to hang out with/talk to his friends then I would feel worse. But there were so many times I did that and he denied having friends or wanting to talk to anyone else", "I have a feeling it’s a purely online relationship and purely online friend group and it sounds exhausting", "He could have just apologized for losing touch with them and be done with that. Most people would understand to a degree. Definitely no need for a smear campaign", "I have no idea why this made me giggle, but it did. Thank you, I am done with most of them", "Truly is the best way to live", "Agreed. I did this after others suggested the blocking route", "Haha thank you for the title! I did believe in this instance it was the right thing to do. But I don't like to make a habit of being petty!", "I have already said, in other comments on this post, that I said that to him over a call once before knowing a situation. And apologized profusely to the person when she confronted me. I didn't make it a habit of doing it. And have already spent the time thinking about the group dynamic and decided it is best to be done with it. I do not agree that my behavior is immature, he spoke blatant lies and had people accuse me of horrible things. I am not someone to sit there and take that. If you're not someone willing to stand up for yourself then that's fine, but I do nkt believe standing up for myself by giving the bare minimum to clear my name is immature. Thank you for your feedback though", "And you know these “flings” are 100% online", "I was curious why no one is pointing that out, lmao.", "He 1000% could have been honest. I have been totally open when anyone has asked me about things he said. And of course he is not fully to blame for the breakup. It takes two to make and break a relationship. But I was under the impression that we would communicate to each other about that stuff. Except he did not and instead ended things and went to talk to others about me instead. I would have loved genuine honesty", "First of all, that is absolutely horrible that he did that to you! I never understand the exaggeration people use after a break up. I am very glad that you don't miss them after 10 years!\n\nI agree, I still have friends on discord and irl that I am really close with, who were not part of that friend group. And they have been amazing through the whole thing.", "I'm sorry what? How is this happening again?", "You two broke up but had mutual friends. That usually lead to a very informal custody share of said friends.\n\nWhat he tried to do was to manipulate your friends into picking only him by tarnishing your reputation. It's akin to parental alienation, really. He got caught and couldn't believe you wouldn't just let him keep all the friends at your expense.\n\nNTA.", "Bro got lucky with a lass that wanted him to not just spend all his time on her and game with his other mates too sometimes and still made her look like an asshole. Damn talk about being a right jackass and taking advantage of a good thing.\nSo my vote, you're definitely not the asshole going based off this context 😂", "This is classic f'around and find out... NTA and well done.", "YEP at 27 I would expect a lot more maturity than this. NTA OP", "OP isn't the only one who dodged a bullet.", "Other story:\n\nOne day he came home from work and said:\nHe: one of my female colleague was watching me.\nMe: I didn't want to hear it.\nHe: I wanted you to know it.\n\nThat was all. \nLater I was thinking about it and realized that until that time I wasn't jealous at all, but after it I was uncertain. \nAnd that was what he wanted to reach.", "He was sweet and kind to lure you in. You see who he really is now. And yeah it usually feels good to put a bully in their place, you did the right thing.", "He told you what you wanted to hear. Think about it.", "I honestly thought yall were a bunch of teenagers. They all sound immature af. You'll be better off without all the drama.", " \n\nIt's worth keeping the friend who contacted and asked for your favor first.", "Being from south East Missouri, I screamed at the Lambert's reference 😂😂😂", "Something I recently learned that kinda blew my self-identity as a rather independent person up: one of the big signs of codependency is being unwilling to let people suffer from the consequences of their own actions, because you don’t want them to be hurt. I’m not saying that’s definitely the case in *this* situation, but as someone who also “seriously hate[s] hurting people” it’s a good thing to keep an eye on.", "He hurt himself. You didn't do anything. He got lazy about maintaining his friendships and then lied to them about your relationship to get back together with them as if nothing happened. He might have thought that all he was doing was making up excuses to fix his friendships but really he was making you out to be abusive. That's a serious allegation, and depending on where you are, and where you work, they could have really made your life miserable if they wanted to. You are absolutely in the right to set the record straight with proof. \n\nIf he only wanted his friends back, he should have taken the hard road of building the friendships back up.", "Um no, he deserved it. I thought justified A H because it caused drama in your friend group when you could have just walked away from these people who’d believe his lies so readily. But you probably saved them from his narcissistic manipulation too. The way he put that one girl down so badly but then ran to her so quickly was probably because he actually liked her so she’d could have been his next relationship victim. No OP, you should sleep well knowing you did the right thing.", "Beautiful,\n\nTake this in the spirit it is offered - don’t confuse being a doormat with being nice. \n\nThink about the hurt he has caused you and his “friends” already being twofaced. And imagine all the pain he could have caused his friends in the future had you not given them the receipts. It’s his own actions that have caused the pain, not you.", "FYI, it was originally for gamers, but it's kind of morphed into a combo of Slack and old Yahoo chats. There's subs and content creators I follow that have their own discords on politics, mental health, writing, etc. You can also set up a Discord for IRL groups. Our friend group did this for a D&D homebrew game/social activities.\n\nThere's something there for us older people too! Lol", "[deleted]", "He is a bad friend who messed up his relationships and tried to lie his way into forgiveness. While destroying your reputation. Your friends deserve a heads up about your ex's true self — if he lied so easily and horribly about you, what else could he do just to save face?", "You are absolutely right to be wary of people you don't know, regardless of their gender. Unfortunately, men pose a greater physical risk to women and it's only logical that women would be more wary of strange men than strange women.", "Ah, so you made him feel like less of a man I see. You must be smarter, make more money, and have your stuff together. Good for you for dodging that incel bullet. Keep being yourself and don't apologize for being who you are. He attempted to take your friends from you to make himself feel bigger and validated. You took it from him (awesome you did it) and he is butt hurt.\n\nQuery: what game do you play? I am a Football Manager nut.", "LOL if it CAN be destroyed by the truth it DESERVES to be destroyed. Home boy did this to himself and you just sped up the collapse. Good for you girl! This is why keeping receipts is always a good idea.", "Ug good bye to that garbage. What a very bad dude", "Such projection. *He* doesn’t like *women*.", "I had an ex like this. The minute he knew it was over he went running to as many mutuals and even MY MOM crying or drunk as pitiful as possible to try to get them on \"his side\" with whatever warped version of the truth he could sling. \n\nHave you ever noticed your ex seemed to enjoy subtly mentioning how terrible other people are or spilling their dirty laundry and encouraging you to get mad about what others supposedly did or said? Bc my ex did that and boy did he like to stir shit with people. Like he actively enjoyed when i thought my friends hated me (and vice versa). He would even misconstrue out of context screenshots as \"proof.\" It's such a dirty narcissistic isolation tactic.\n\nReally glad you got out of there. He sounds like my ex and if he's anything like my ex you dodged a huge massive bullet there. NTA also for standing up for yourself, but in the future if he doubles down and your friends actually believe him fully you may want to consider it a lost cause. Fighting it is just exhausting. The people who believe in you will believe in you.", "It sounds like you truly dodged a bullet.  Congratulations?", "Keep it up.", "Yass. This. Being unwilling to hurt bullies and narcissists who intentionally cause you pain is like baring your neck for a serial killer. It's healthy to take care of yourself and healthy to want to thrive and survive. Defending yourself is loving yourself. The instinct not to hurt is a positive indication to yourself that you are not a narcissist or wantonly cruel. But you still have to act if someone/something is hurting you. Took me too many years to learn. Hope you can also find that space, OP.", "Interesting. Thank you for this, I will genuinely think about this comment and keep an eye on that", "He is already there. He wore the mask for as long as he could but could not do it anymore.", "Haha love the hesitation in that congrats. Thank you nonetheless", "You are right. I grew up with a narcissistic mother and only was able to defend myself years and years being out of that house. I will try my best to try and remember that sometimes people getting hurt isnt my fault or responsibility and can be a consequence of their actions", "That's actually the cool thing about Discord, as much as my personal server has like 3 dozen people on it, I'd say only 5 maybe I don't know well cause they're just friends of a friend. You can join big servers if you want, but you can also make just a solo one for yourself and fill it full of all your notes! Or funny memes, or links. Or you can make a small one and share it only with your 5 closest friends. It's kind of like a personal forum/chat.\n\nAnyway, you can use the internet how you like and your method is equally valid, I just wanted to advocate for the tiny server discord experience. It's kind of like an extremely tiny social media that only goes to people you trusted to invite. As someone who's very bad at Facebook etc it works for me. And all my friends get my latest cat photo anyway XD\n\nAnyway, have a nice day!", "NTA.  Sounds like OP is way better off without the ex.", "I had a ‘friend’ who would orchestrate every group she was in through behind-their-back insults and gossip to each member, creating resentment between people who she didn’t want to interact with each other and stuff like that, and making herself the one we were all ‘closest’ to and reliant upon. It could be he was doing something similar, at least with that one other person. NTA, he’s being a petulant child. \n\nOn a separate note…this situation is ridiculous. It’s not your fault at all, but a group of adults creating this much drama is crazy and potentially a ticking time bomb, consider if it’s genuinely worth being in a group where stuff like this is still going down 10 years after people should’ve grown out of it, because from experience this kind of thing can become a huge issue real fast, you know? I get why you did what you did, but the fact that the situation called for it when you’re in your 20s is insane.", "lol NTA. \n\nHe lied, you proved him wrong, what did he expect when sowing the fucking around seeds?", "op=NTA\n\nSince you only showed the truth, how could it be wrong?", "NTA\n\nHe lied about you, destroying your friendships.  \n\nHe seems to have lost his friends because he didn't bother with them, so he decided to make up a pack of lies about you, to garner sympathy with them.  That makes him a real AH.  He's annoyed because you showed up his manipulative deceit and everyone can see that he is a really an AH, not a victim.\n\nYou are justified in exposing his deceit, protecting your own reputation and he fully deserves to have everyone see the truth of his behaviour.", "NTA", "NTA.  You should be blowing up his phone asking how he could say such things about you, and how he could lie to you and your mutual friends.  If he wanted a clean break, he should have made sure it was clean.", "NTA. But a perfect example of how toxic online groups can get (specially in gaming for some reason?). Hope you get out it there.", "NTA excellent rebuttal to his bullshit tactics", "He easily broke it off with you, his girlfriend. No warning. Of course it was easy for him to dump his friends the same way. Some people are just like that. Glad you kept proof.", "Nta.", "NTA \n\nHe got what he deserved after spewing nonsense to everyone. What did he expect, for you to just suck it up and not tell anyone you're not the ah he made you seem to be.", "NTA\n\nIf he \"wanted a clean break and wanted his friends back\" he shouldn't have been spreading drama and crap about you behind your back.  He should have just resumed the friendships on their own merits, not tried to trash you behind your back.\n\nThat's not just petty on his part.  That was cruel and two-faced behavior.  \"Let me appear all nice and mature and civil while I trash you at length.\"\n\nAll you did in response was, well, show precisely what he really said.  If that made his friends question him, well, it **should**.  He shouldn't have done that in the first place.", "NTA. He tried destroying your friendships. Most likely to try and fuck them.", "NTA: though I would question being friends with a group of people who were so quick to believe him right after a breakup. That would scream revenge to me. I would have reached out and asked you about it not believed him and gone after you for it. Except maybe the specific young woman who was kind of in the middle of all that and was probably feeling very emotional and very hurt. But the rest of your friends I'd be questioning.\n\nHe tried to destroy you through lying. Any destruction you did was through telling the truth in response to his bullshit. You've done nothing wrong", "NTA. So he can dish out lies to make you looks bad, but the second the TRUTH comes out, he can’t take it? Ha. What a baby.", "NTA, he fu£3& around, and found out. Don't lie, but especially when there is actual proof that what you are saying is a lie.", "nta. he was trying to paint you out as the villain when he did it all himself. i don't understand why people do that kind of crap especially if there's messages that can prove otherwise.", "all this while you were in the hospital? Did I understand correctly? Wow. That’s petty (from his end).\n\nNTA.", "NTA.  And wow, I want you in the trenches with me if I'm ever trapped in interpersonal warfare.  \n\nYour ex lied about you in order to turn your friends against you.  You climbed out from under the bus and showed your friends the truth.  And he's complaining that you did something wrong?  Right, you should have just let him get away with it!  That's what a really good victim would have done!  What can I say?  You just don't make a good victim.", "Definitely NTA sees to me he thought you no longer had those conversations saved on your phone.  \nThe truth hurts.\n\nHis actions have consequences and he should learned to stop running his mouth", "NTA\n\nI'm not even going to explain my reasoning because it's so obvious it barely even belongs here", "Nta.\n\nLet you ex know not to start shit he doesn't want someone else to finish.", "[removed]", "NTA He slandered you all over the place and you used evidence to clear your name. That he is angry about it is just continuing to victim blame you.", "It was a LDR, I was buying tickets to fly to see him this summer. But we would facetime on our phones and text that way as well. You can absolutely be as invested as long as you make the effort. We would have \"date nights\" where we'd facetime and watch the same movie to be able to see each others reactions during it. I met his family through a video call and vice versa. It is harder to make things work if you dont physically see each other in person, but if you're willing to put in the work then it can be worth it.", "One apologized. One asked for my side. One still completely blames me, another ignored it. The vedict is still out but honestly at this point I think I am better off.\n\nThey absolutely can! I'm all for reading the drama sometimes, but I do not want to be apart of it 🤣", "It was not my intention to slut shame. I did not know her situation and he would just tell me about a new person every couple of days so I made the comment \"Wow, she really cycles through them. Not for me but if it makes her happy you do you\"", "I agree. And I doubt I would have ever known the full reason I was shunned if not for that one woman who questioned me about what I said to him", "One person didn't believe it at all as we were close friends anyway and knew my character. But a few absolutely did just blindly believe him because, and I quote \"he's such a nice guy, why would he lie?\" Those are the friends I am done with", "It was definitely a one off. My last long term relationship ended very amicably. We have children together and co parent really well. There were no hard feelings or any bs that was close to this kind of drama. I do believe I got taken in by the idea of what kind of man he was vs. What he actually was. And it is definitely a learning moment. A hard one, but a moment regardless.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Is there a chance that he went so hard against that specific friend when you were together because he was interested in her? It sounds to me like he started to catch feelings for someone else while you were dating, pulled back from the friend group because of that, then when he broke up with you tried to get in with the other girl by trashing you.", "He’d decided to ditch you and wanted you completely gone. His “stay friends” line was to give him space to peddle his lies against you.\n\nSome people unfortunately take the mindset that when they’re done with someone, they want that person to essentially disappear.", "Closure never means \"I need to be cruel and two-faced,\" which is what he did. He was basically trying to destroy your reputation to his friends.  That's really toxic behavior on his part.\n\nHe could have said \"Things didn't work out\" and moved on.  That's closure.", "So he breaks up with you and HE needs closure? Wtf?", "Which would eventually lead to you not hanging out with anyone either because you’d feel bad for him either choosing to not hang out with you and your friends or making him do something he’s said he’d rather not do if he did tag along.", "Thats good on both and i hope ya recovered well.", "Sounds like a really fun time. But being in the \"butterfly stage\" of a relationship I would like to kiss my girlfriend, hold her hand, feel her head rest against my shoulder as I brush her hair. Brush my hand through her hair and smell the comforting smell only she has. But you wanted to meet him in person, so it seems you were also looking to do this.  \n\n\nI think each relationship goes through stages: butterflies/erratic love - diminishing butterflies/increasing stable love - stable love. Some relationships strand at the diminishing butterflies stage and some progress. I think relationships that lack any form of physical closeness in the butterflies stage are more at risk to not survive the diminshing butterfly stage.  \n\n\nThe butterfly stage is easy it's a rush of uppers, It seems as though your boyfriend reached the next stage before he build enough true love for you to survive the waning hormones.\n\n&#x200B;\n\nYou do seem very giving and invested in your relationships, I just wanted to give you my take. I wish you the best in processing this painful situation.", "Because now she knows that not just one but two of her friends secretly don't like her and discussed it with each other, and you've gleefully each told her that the other disliked her, in order to score points on your ex. She must be devastated. She's the collateral damage and the real victim here, not you or your ex.", "I hope not. As far as I know, she's only ever viewed him as a friend.", "Ah the good ol bait and switch. He wanted you to come across as jealous or insecure so he could use that to his advantage. Very rude of him", "I don’t think you hurt him. His actions and the consequences of his actions were what did it. You were just defending yourself from some pretty serious allegations. It sounds like you were trying to clear your name, not intentionally make him look bad (yeah that’s what happened, but he shouldn’t do dumb things if he doesn’t want to look bad).", "You are helping your other friends, who need to know that he is a lying toxic AH. You are saving them from future hurt that he would cause.", "I'm 42 and I have discord friends. You're not out of touch, you just have different interests, and that's okay.", "That is not the case at all. I made one comment ages and ages ago before I got to know her. I in no way shape or form \"gleefully\" told anyone that I disliked her. There is so much more to this than what was posted. And if you would like some more context, when she found out we had started dating she gave an ultimatum to him of its her or me and if he chose me she would be too grossed out. This I found out after the breakup as well. The one comment I made was priot to knowing this knowledge. And I had already apologized to her. She even joked about this same thing to me before", "It sure seems like those accusations can be translated to \"I realized you would pick up on my abusive and manipulative nature and I would rather pursue someone naive.\"", "it sounds like your boyfriend was using your insecurities to keep you off balance.\n\nFor your own health, you should work on those insecurities.  You can apologize for \"hurting\" someone but shouldn't need to be their validator, esp. at your expense.", "And you now got rid off a similar guy. If you feel bad yourself and/or miss him, just think what he did with you and give yourself time to heal. It will be better and better and your true friends will remain and help you. I wish the best you. <3", "Well and him and I had gotten amazingly close throughout our relationship. At a point, i trusted him completely. He knew everything about me and my job and my family life. If he told them all of this without me defending myself, they absolutely could have ruined my life", "I haven’t heard of Slack either! Wow, I’m out of the loop. I remember older Yahoo back in the day tons of creepy older dudes surfing for younger girls on that when I was like in middle/high school. I play Words With Friends with a couple friends haha I’m so lame.", "I do have friends I have met through the dog park! We have a group text and schedule times to meet down there with the pups… maybe that’s my version.", "Ahhh okay, ya I guess I’m just not that hip to a lot of tech stuff we just use group chats for my friend groups.", "\"Men are afraid that women will laugh at them.\n\nWomen are afraid that men will kill them.\"", "Thank you for speaking that common sense he seemed to lack.", "If you think he'll try and get back at you through your family or work, keep them informed. Speak to your manager about this and inform them of what your ex has been doing and that you're worried he'll come after you at work as well. That should take care of things before they become anything.", "I have made friends online who I have later met in life.\n\nIt can be great.  But one does have to be careful, Not everyone is who they claim to be(one woman in her 50s(?) claimed to be a early 20ish woman). \n\nThis wasn't catfishing or anything, I think she just thought she'd be more likeable to the group as a young woman than an older woman.", "This is very cute but I must ask for the dog tax", "Well, even if it's ultimately a good thing for you, breakups still suck and this one sounds especially ugly.  Here's hoping a much nicer person is out there for you and you'll meet them soon.", "Because you wouldn’t notice the extra 30 or so years? Starting a friendship or any sort of relationship on a lie is never the way to go. Before I met my partner and tried dating apps it blew my mind how many people either didn’t look like their photos or just weren’t honest.", "I don’t do Facebook either. the only social media I have is Instagram but it’s all photos of my pets, cooking and travel. I know so many people that live their lives by social media.", "Haha here you go, this is her right after coming back from the “dog spa” hence the goofy bandana they put her in.\n\n[Stella](https://i.imgur.com/kjdgKX9.jpg)", "NTA! He made his bed and now he has to lie in it. I love the ole “how could you do this to me after I did the same thing to you?!” 🙄", "NTA guess he didn’t watch MIB and hear the line don’t start something won’t be something", "NTA but I hope you're not considering staying friends with them.", "NTA. A clean break doesn't mean lying. He wanted to have his friends and keep them from you, which is a dick move.", "NTA you were protecting your reputation.  His friends who cares,  Mutual friends you had prior to you dating, I would have defended myself also.", "NTA - he wanted to be shady behind your back and didnt expect you to defend yourself? He's the AH and completely deserved it. If he JUST wanted his friends group back, he couldve just told you -- \"hey im not comfortable with you keeping my friends as your friends\".... instead of trying to make you look bad.", "No. He's gaslighting you. But I'd be very careful where it came to him. Gaslighters can be dangerous people. And if he's pissed off at you, perhaps cut him off completely, and block his phone. If he keeps pestering you, get a restraining order. If he disregards it, arm yourself and keep your eyes open.", "NTA. He messed up with his friends and breaking up with you provided a ready made excuse/scapegoat to get him off the hook. Plus provided payback for whatever imagined offense you did, in his mind, that FORCED him to break up with you (that was sarcasm btw). Unfortunately for him, you came to play \"Now He Found Out\", which is exactly what he deserves for playing \"F'ed Around\".", "NTA\n\nHe learned the lesson:\nPlay stupid games, win stupid prices. \n\nHas he really been that stupid to do all his rants via dm's?", "NTA - sounds like he F'ed around and subsequently found out.", "This reminds me of one of my exes\n\nI met him through mutual friends, got added to their little group and all, but one day he told me he just wanted to date me to get his mother off his back (he was bi, was with a guy before we started going out and his mother was quite against it), but that he turned out to actually like me... And I dumped him cause god-f-dammit, it hurt to know I was lied to like this\n\nI told him we could be friends and could still be close, but that dating was off limits from them on\n\nWell, he went and tried to get me kicked from his friends group \"you either kick her or kick me\"\n\nWell... He got kicked within a second and I ALMOST felt bad for him \n\n\nNowadays I saw that he graduated as an architect and seems to be doing well, I'm happy that he seems ok... Though I'd never talk to him again, I don't wish him ill, he was just immature as fuck and needed to grow up... And seems like he did, so great!", "Lmfao he tried to do the same thing to you and gets upset that when you did it back you have nothing to feel bad about I wouldn’t", "NTA", "INFO: So you're asking if YTA for getting r/pettyrevenge against your ex boyfriend?", "Nta, he intentionally tried to hurt you. He blamed you for his lack of commitment to his friendships and made you look like an abuser. He got caught and is now blaming you for what he did. Block him and move on.", "Sounds like he felt inferior to you and wanted to make sure he had the friends so that there was no risk of anyone finding out about his perceived inferiority. I dunno man the insecurity is awful. Sorry OP. NTA you been to be on r/pettyrevenge", "NTA, he didn't like the taste of his own medicine, fuck'em.", "NTA", "NTA and 👏 for the pettiness. HoW cOuLd YoU cAlL mE oUt LiKe ThAt ummm excuse me?? He was making you look like the bad guy only to make himself look better and he needs to grow up, sounds like you dodged a bullet with that one.", "Y'all are acting like you're in highschool. If he wants to pull some crap like that on your mutual friends and they automatically take his side, then they don't deserve to be your friends and you shouldn't be going to such petty lengths to win them over. \n\nYou're a grown ass adult just move on. ESH", "this is his personality. woe betide the next one he gets involved with.", "Wildest part is he could've easily gotten his friends back by telling the truth and apologizing. Most people have experience getting wrapped up in a relationship and forgetting to keep in touch with others. It's an incredibly common occurrence, and, in my experience, most people tend to be pretty understanding about it if you give a genuine apology.", "I have cut him out completely. And he lives in a different country so thankfully it would never get to that point as it is pretty impossible to get a weapon over into my country. And guns are not acquired easily here. I always keep a samurai sword and machete in my bedroom just in case of break ins though. (Just realized how nerdy that sounded lol)", "Yes, every single thing was lengths and lengths of dms to me", "My intention was not to win them over. I've stated a few times that I believe it is better that I be done with them. My intention is and was to clear my name. As people talk and in our community of online people, things get blown up over small things. I wasn't about to have my character ruined based off word of mouth. As you said, I am a grown ass adult. And a grown ass adult can still stand up for themselves then walk away", "his way which is nasty, toxic, and destructive", ">I went out of my way to not say anything bad about him or our relationship after the fact... And he knew this, and did the opposite\n\nThat's what he expected to happen this time, too.  He thought he could climb back into the friend group by stepping on your back.  Turns out he was wrong.", "Would be pretty funny if they were ngl", "Oh boy... \nI wish him the best of luck :chuckles:", "I have no intention of sharing anything else with any other person. The only thing I wanted/did was share enough to clear my name. No use completely destroying someone", "Would you have taken this venting and responded in this way before you met him? Often (Not always but often, I know some people just don't like confrontation like that) when we end up in relationships with people like this, they cut down your confidence and self esteem over time. It can take some time to build it back up,   \n\n\nAlso I would utterly disregard everything he said in that verbal rampage, he was talking out of his borthole to try to hurt you and cut you down", "He’s a jerk and that friend group isn’t worth it if they take his side after the proof you sent. Sorry you had to go through this, hun. There are really good men out there, you just have to dig a bit to find them. NTA", "yes and be grateful it occurred before it got even more complicated. you can make a break. if you had a kid it would make it that much more difficult", "I lived 25 minutes from Foley and briefly in Missouri! Same!!!", "I don't need more details on than that clarification and I didn't expect any details. I didn't have the impression you where out on a vendetta.\n\nJust thought you'd like to know, his actions amuse me after he tried to badmouth you.", "Fafo. NTA", "NTA. He started this as soon as he started with the lies. You had every right to defend yourself, and from what you said about them taking his side no questions asked, the screenshots were completely justified.", "NTA. YOU did not get his friends to question him, HE did that perfectly on his own. He's just angry he got caught. Good for you for not being in a relationship with this piece of work anymore.", "Nope. Your ex is the asshole here.", ">I'd jokingly brought up how often she cycled through flings\n\nUmm what? Why?\n\nESH. Yall sound exhausting and obscenely immature.", "So...did you get the friends back? Do you even want them back after this episode of bs? Inquiring minds (mine) want to know.\n\nOh, and NTA.", "NTA.\n\nYou don't get a clean break if you date within a friend group if they are in fact completely mutual.  They're not going to tell the other person they're no longer welcome in the group, as much as you'd like them to disappear.  Possibly even if the person cheated, if you've all been friends forever.  That's the chance you take.  It can be great if it works out, but if it doesn't, the other person likely isn't going away.", "NTA", "NTA. This sounds very high schoolish tho. I almost got a headache reading it.", "NTA, and bravo! ( insert slow clap)", "NTA", "NTA", "You are NTA but you need to put this group of friends behind you and move in.  There is far too much drama in this group", "Nta", "NTA. You set a boundary to not accept his lies and betrayal. You backed up your defense with actual evidence. Your ex is suffering the consequences of his own actions. So are the mutual group of friends for blindly trusting him. \n\nYou’re better off with out the whole bunch. If I were you, now that you’ve proven your innocence, I’d walk away from them all with my head held high. Block them all. Nothing he can say or do now will matter. He’s proven to be the liar and manipulator and they’re always going to doubt what he says now. And you don’t have to deal with that drama.", "NTA\n\nHe fucked around with your reputation to cover for his shortcomings, he finds out that you NEVER put anything in writing that could bite you in the arse later.", "You answered their questions honestly.  Not sure how this situation is all your fault. NTA", "Never let anyone disparage your reputation! Ya done guud, gurl! \n\nNTA!", "You're not TA , but you need to distance yourself from this entire group. It all seems incredible unhealthy and toxic.", "You already know that answer. The question is why do you care that his feelings are hurt?", "NTA \nI would've done the same and don't be friends with those other that believed him so easily", "NTA.", "No way Jose you did really well.", "NTA", "NTA but it also sounds like you need some IRL friends.", "Oh my god so childish. Nta", "NTA but damn. Maybe he shouldn't go talking shit if theres proof of lying? Play stupid games, win stupid prizes.", ">He told her a private conversation we had where I'd jokingly brought up how often she cycled through flings \n\nESH and all y'all have some growing up to do.", "NTA.", "I have both lol", "That’s quite an extreme way to “get closure”. There are better ways than shunning her from the group. You can’t say A (amicable breakup), and finish on Z (completely screw her over).", "He definitely wanted a clean break and wanted you to go away. You are NTA, but think about if you want these people in your life after all of this. Good luck to you. You will definitely find someone better.", "You're protecting yourself! If that \"hurts\" someone else, it's because their own shitty behavior is coming back to bite them. It's Ike if you were to hold up your hand to say stop, and they run their face into it. Repeatedly. You are not the source of the harm here.", "He hurt himself with his lies. He took a risk with lying and they came out. \nThat's not on you. \n\nCongratulations that your trash took itself out. Bullet dodged.....", "Did we date the same guy? Your whole story is so painfully familiar, best of luck and strength to you", "- Maya Angelou", "I dunno, I'm a man and I'd be afraid of a woman killing me. Crazy comes in all shapes and sizes after all...", "NTA\n\nDon't start none, there won't be none. He threw himself under the bus.", "Ding ding ding! I thought I recognised that. I  grew up with a narcissistic mother as well and it took me a long time to realize this. \n\nIt's because you get blamed every time the consequences hit the narcissist, because it can't possibly be their fault, and eventually your normal meter is completely off.\n\nDid you know that children of narcissists are more likely to find a narcistic partner? \n\nDo not take him back, and be aware of hoovering. Look that up online and don't fall for it!!!!!!\n\nETA I highly recommend the videos by Dr Ramani on YouTube.", "Ok, but do you fear going out after dark, going out with your mates for drinks, getting onto any public transport, because you're scared that *any* woman would k\\*ll you (let alone drug/r\\*pe you)?\n\nBecause I have heard plenty of women being afraid because of men for these reasons and many more. I've heard of a very few men being *concerned* about getting into a fight or mugged by *other* men. But I've NEVER heard of men generally being afraid of women.", "Bring those receipts! Yes! NTA.  I’m glad you stood up for yourself..", "NTA. Play stupid games, win stupid prizes. He played himself.", "Sounds like he fucked around and found out.\n\nNTA op.", "NTA.   \n\n\nOne good turn deserves another.", "Oh yeah. Discord friends, players, servers... This bring back memories. NTA. I understand what he tried to do, get back friends while dirting you. Maybe the break up was something he had been thinking about for quite awhile, Idk. You're better off without him, and in my experience it's always good to keep the receipts.", "NTA", "NTA. FAFO didn’t he.", "NTA!!! He f’d around and found out! You see the more you f around, the more you going to find out… 😂😂😂", "Definitely NTA! Did those mutual friends work things out with you after the proof was sent? If not, they’re not worth it either. Lots of amazing gamer communities out there (I’m in lots of discord places myself!) so you will find something better :D", "NTA he fucked around & found out", "NTA.. play stupid games, win stupid prizes.", "NTA. He threw you under the bus only for the bus to fall on its side where he was standing. \n\nSmart on you keeping the evidence for the rainy day.", "Bingo", "Crossstitch 💡", "Narcissists tend to (subconsciously) target people who are “pathologically kind.” When someone is always happy and willing to oblige the other, that can be a recipe for disaster. It sucks because it really is the kind person’s true nature to be kind, but they have to learn to be careful."]}