{"id": 7540, "submission_id": "10e4h5m", "title": "AITA for bringing the receipts when my ex had me shunned from our mutual friend group?", "selftext": "So my (26F) ex bf (27m) broke up with me a week ago. It felt sudden to me, and there was no warning it was going to happen. However, we handled it very amicably imo and he wanted to try and stay friends.\n\nI met him online through a mutual friend and had been friends with him and the rest of the group for a few months before dating. When I went into hospital back in August, I sort of just fell away from that group of people where I couldn't be online. However one of our mutual friends had caused a lot of drama and we both cut her out of our lives because it was very toxic.\n\nNow in December she reached out to me, apologized and we started to talk slowly again. My ex bf during this whole time would message me and tell me over discord that he hated her guts, she was an *insert bad word here*, and I could talk to her but he was completely done with her. \n\nI'd always ask him about hanging out with other friends or playing games with other people and encourage him to do so while I was sick and or offline. His responses were always \"I don't really talk to anyone anymore\" or \"I only want to talk/play with you\" and when I'd dig deeper he said they all just fell out of touch.\n\nFast forward to the breakup, the first thing he does (after our apparently amicable and no hard feelings talk) was to go straight to that mutual friend he said he hated with a passion, and tell her everything I ever did or said wrong in our relationship. He told her a private conversation we had where I'd jokingly brought up how often she cycled through flings and then told her and every other mutual friend we had, that I was the reason he stopped talking to everyone. That he was worried I'd get jealous or upset if he talked to/played with anyone else but me. Because, and I am quoting him verbatim here, \"I know how I would feel in that situation and I didn't want to put you through that\" I'm sorry what??\n\nSo this friend came for me hard over dms and asked why I would say and do such things. I was shocked and extremely hurt. I never would ask/make someone give up his friends or isolate them from anyone as this seems controlling and I didn't want that. So my petty ass said screw this. I went through our past conversations, took screenshots and privately messaged everyone he told this bs to, apologizing that I was the reason they lost their friend. Then followed up with the pictures to prove he did this on his own and against my wishes. These photos may or may not have also shown the crap talk he said about that one mutual friend.\n\nHe's been blowing up my phone since asking how could I do that and call him out like that? All he wanted was a clean break and to get his friends back, and that I'm an asshole for making them question him. I haven't responded because imo he lied about me and our relationship to friends we both had, who then took his side no questions asked and kicked me out of their lives and discord servers based off word of mouth.\n\nSo Reddit, AITA for sending proof to our friends?", "created_utc": 1673934906, "permalink": "/r/AmItheAsshole/comments/10e4h5m/aita_for_bringing_the_receipts_when_my_ex_had_me/", "score": 364, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I sent screenshots of him bad talking friends and lying about not wanting to talk to them and sent them to our friends, which definitely hurt his feelings and now everyone is questioning what he's told them about our breakup and not trusting him right away.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Soooo NTA. I can't even imagine how twisted he got himself to try and throw you under the bus like that.", "Sounds like a situation I was in with online friends. The guy tossed me under the bus to make himself look good and me look bad. I let it go at the time but over the months and weeks after, they'd ask me questions and I'd just share screen with them so they could see unedited discord conversations. \n\nYour guy FAFO. He got exactly what he deserved. Zero sympathy for him. You absolutely dodged a bullet, just like I did. Remember this going forward also. It's a life lesson.\n\nNTA", "Sashay away from all of these people. You will be happier.", "NTA.  Paybacks are hell!", "Since there is not a justified A H judgement in this sub I’ll just give you a NTA. He was the one to expose your private conversations by telling the one friend about the offhand comment you made before you got to know her better. And then he used that to start a smear campaign against you. If he’s going to start some BS like that he really should have thought things through. \n\nYeah you could have just walked away from that mess and the people who would blindly take his side without talking to you first but revenge is so much sweeter. What’s good for the goose is good for the gander. You just finished what he started. He wanted to show them one text that reflected you in a bad light and you showed them all the text to clear up any confusion. Was it an A H move on your part? Maybe but it’s a justified one. His way was manipulative and yours was informative. I’m sure your friends are all a bit uncomfortable with being put in the middle of this but they can all talk to him about that since he’s the one to drag them all there. \n\nI’m sorry your breakup wasn’t as amicable as you thought. At least he’s out of your life now and you see what a huge bullet you dodged.", "NTA.  He made his bed.", "NTA lol he dished but couldn’t take it. Well played, op.", "NTA. sure this was petty, but justified. Ex decided to talk major shit about u behind ur back and tried to ostracize u from the friend group. you merely defended yourself and uno reversed on him. keep them receipts, babeyyy", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my (26F) ex bf (27m) broke up with me a week ago. It felt sudden to me, and there was no warning it was going to happen. However, we handled it very amicably imo and he wanted to try and stay friends.\n\nI met him online through a mutual friend and had been friends with him and the rest of the group for a few months before dating. When I went into hospital back in August, I sort of just fell away from that group of people where I couldn't be online. However one of our mutual friends had caused a lot of drama and we both cut her out of our lives because it was very toxic.\n\nNow in December she reached out to me, apologized and we started to talk slowly again. My ex bf during this whole time would message me and tell me over discord that he hated her guts, she was an *insert bad word here*, and I could talk to her but he was completely done with her. \n\nI'd always ask him about hanging out with other friends or playing games with other people and encourage him to do so while I was sick and or offline. His responses were always \"I don't really talk to anyone anymore\" or \"I only want to talk/play with you\" and when I'd dig deeper he said they all just fell out of touch.\n\nFast forward to the breakup, the first thing he does (after our apparently amicable and no hard feelings talk) was to go straight to that mutual friend he said he hated with a passion, and tell her everything I ever did or said wrong in our relationship. He told her a private conversation we had where I'd jokingly brought up how often she cycled through flings and then told her and every other mutual friend we had, that I was the reason he stopped talking to everyone. That he was worried I'd get jealous or upset if he talked to/played with anyone else but me. Because, and I am quoting him verbatim here, \"I know how I would feel in that situation and I didn't want to put you through that\" I'm sorry what??\n\nSo this friend came for me hard over dms and asked why I would say and do such things. I was shocked and extremely hurt. I never would ask/make someone give up his friends or isolate them from anyone as this seems controlling and I didn't want that. So my petty ass said screw this. I went through our past conversations, took screenshots and privately messaged everyone he told this bs to, apologizing that I was the reason they lost their friend. Then followed up with the pictures to prove he did this on his own and against my wishes. These photos may or may not have also shown the crap talk he said about that one mutual friend.\n\nHe's been blowing up my phone since asking how could I do that and call him out like that? All he wanted was a clean break and to get his friends back, and that I'm an asshole for making them question him. I haven't responded because imo he lied about me and our relationship to friends we both had, who then took his side no questions asked and kicked me out of their lives and discord servers based off word of mouth.\n\nSo Reddit, AITA for sending proof to our friends?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. He fucked around and found out. \n\nSo because he wanted his friends back, he could throw you under the bus and slander your character. But you aren’t allowed to correct those lies with irrefutable proof of his own words? This man is the victim of his own stupidity. I’m glad he broke up with you.  He did you a huge favor.  You are sooooo much better off.", "How old are you all?", "Edited.\n\nNTA.", "I assume it was his way of getting closure? But it was very cruel and so out of left field. Especially since he was the one who broke things off.", "The friend group? Ranges from 22-35", "I made one comment before knowing a situation. This was one single comment to my bf over a call. He consistently talked about her in a bad way, on a call, over messages. I apologized to her profusely when she initially asked me about it and admitted that it was wrong to say that. Didn't deny it to her and told her I'd understand if this changes our friendship.", "I'm sorry you have to deal with such short sighted self satisfaction and hope you have a bright future ahead.", "And what about the other times he messaged you about someone else? Did you just let him vent and not say anything in return, did you contradict him and stand up for your friend, etc?", "Thank you very much. The experiences I've had this past week are making me realize the breakup is a blessing in disguise.", "I let him vent to a degree. I would ask if he wanted a solution or a listener. If he needed to vent that's fine. Everyone has issues with their friends, but there were multiple points where I had to stop him because it was getting out of hand. Those responses were also added in the screenshots I had sent. One of the biggest issues he had was he didn't like how I wouldn't let him continue if he said something out of hand.", "He lied about you to all your friends but he's mad at you for defending yourself? Narcissist! Good thing you aren't together anymore.", "NTA. You defended yourself using the truth.", "NTA", "NTA\n\nSorry this happened to you.  You dodged a bullet with this ex.  You did good setting it straight.   He deserved it.  Let him stew in his own s\\*\\*t soup.", "nta obviously but consider that anyone who would cut you off without hearing your side of the story isn't a friend", "Reputation destruction of partner after breakup is common among narcissistic leaning individuals. Sorry he lied. Nta", "NTA.\nI remember my ex tried to trick me similar way when we were in relationship.\nEarlier he said, he didn't want to meet his friends.\nLater: he didn't meet them because of ME.\nI answered immediatelly that HE was who said that he didn't want to meet them. He wasn't able to refute me, because he knew I remembered exactly what he said.\nI never forbade him from anyone, so he had other intentions with it.\n\nThanks God, he is just an ex long ago.", "NTA. If the truth paints someone in a bad light, it’s not the truth that’s the issue.", "Both of you are immature. The internet is not real life. ESH.", "\"Wait wait wait wait...you lied to MY friend about me....she came to me....and you expected me to...what...lie for you...about me?  If you wanted a clean break...then you should have kept my name outta your mouth.\"", "Eh.. technically NTA-but you kinda are the AH for even caring. You already dropped that group anyways-so who cares what nonsense your ex is saying to get his friends back? \nThey all sound flakey anyways. And if you’re in the type of hospital I am assuming-they all seem pretty wacky and self involved to bring drama to you while you are in there.", "I am so sorry you went through that. It's never good when someone tries to ruin a reputation. I am technologically illiterate 99% of the time and wouldn't know how to edit anything on a laptop or pc if my life depended on it. All my screenshots were from my phone and they knew immediately nothing was cropped or edited.", "I disagree that this is a justified ah move. IMO it's never being an ah to defend yourself against slander. Setting the record straight is always the fair thing to do.\n\nIf someone experiences consequences from their lies being exposed, that's on them for lying in the first place.", "I do feel slightly bad because for the most part, during our relationship, he was sweet and kind. A little near sighted with being open minded, but kind. But it definitely feels justified as I went out of my way to not say anything bad about him or our relationship after the fact. Not even to my best friend. And he knew this, and did the opposite. I don't usually take the petty route, but this time it felt amazing", "Why do people try to do the full 180 acting like you have memory loss and won't remember the conversations? \n\nGlad he's your ex as well!", "To clarify, I am not currently in the hospital. That was a couple months ago. I had slowly been talking to them again once I was well enough to come home as I wasnt able to keep up with them when I was in there. I don't understand how caring if someone tries to ruin my character makes me an AH? Please explain that part further.", "So let me get this straight.  He lies to the friend group about you but when you tell the truth, with evidence of what really transpired, he's hurt that you called him out?  What an AH \n\ndefinitely NTA", "I am so proud of you. That was epic.  \n\nHe did it because he's an asshole.", "I can see where both of you are coming from. And you make a valid point that it's always fair to set the record straight. I do still feel like a little bit of an AH just because I know it hurt him and I seriously hate hurting people.", "Thank you! :)\nMy theory that he is narcissistic and wanted to make me feel guilty and manipulate me. Luckily he was weak and too coward for this.", "Now I feel old and out of touch, I’m in my 30’s and had no idea what Discord was. So are these like all online only friendships/relationships with other gamer people?", "Maybe that was harsh-you’re not really an AH for caring-but don’t care anyways. If these people were worth being friends with they would of looked beyond the ex saying things in a break up. You wouldn’t need to show ‘proof’ after the fact-cuz they would of shut that crap down.", "Basically yes. And before I found out he had done this, he had taken the opportunity to vent to me about me. About every inadvertent thing I'd said or done to hurt him during our relationship and that he believes I don't actually like men and am a sexist to men because I am wary of men I do not know. And I just let him say it while constantly apologizing and validating his feelings towards things like that.", "Lol thank you! It was the most powerful I've ever felt. To be able to actually have a \"Well actually what happened was\" moment!", "It's nice that you do, but he doesn't have the same concern about hurting you. \n\nYou are redressing the balance here, not starting something to hurt him. He hurt you and you are allowed to say, \"that thing you did - that was hurtful to me because it was a lie.\"\n\nYou don't have to accept being hurt to be the bigger person. It's ok to tell the facts of the situation and walk away.", "Some of them are online only, and some are people I know in real life. But yes, it's great for connecting to other gamers as well", "I did respond to another comment saying that at this point, I don't care if I do get that whole group back. I am content to stick with the friends who did shut him down and believed I was better than that", "I'm so glad he's out of your life.  What a jerk", "Out of curiosity, what has been the friend group's reaction to your evidence of what really transpired?  are you back in the group and he's out?", "My video game skills ended with Sega as a kid haha. Other than commenting on like a Reddit post which is anonymous I am way too wary to talk to people I don’t know online. When I was in middle school I believe we watched this movie “Strangeland” that scared the f out of me. Oh and by the way good riddance, on to better things for you!", "I rarely read the comments under the initial posts-so I didn’t see. But that circle sounds flakey. Anyone that bases their connections on gossip doesn’t seem like people worthy of your time. And even if you have been out of the hospital a bit-if it was for mental health-good friends would not bring a bunch of hearsay and drama that could harm your recovery to you.", "I've had one friend completely ignore me, another reach out to get my whole side, and another who completely forgives him but still blames me for him not talking to her. One friend had my back from the start, before any of this happened and never believed what he said. The 2 others have yet to say anything. Honestly though, at this point I don't care about getting back in the friend group or him being out. This has showed me the insanity that can happen based on word of mouth. So I will stick with my couple of close friends who didn't believe the lies and move on from the others. I was more worried about just clearing my name because I try my best to be nice to everyone and non judgmental. So I hated that they believed him without a second thought for my character", "Smart.  Surround yourself with true friends, the rest aren't necessary"]}