{"id": 7550, "submission_id": "10e7ass", "title": "AITA for asking my girlfriend to help with the purchase of a new truck and “punishing” her when she didn’t?", "selftext": "First time posting here, but I have been lurking for a little while so give me a little slack. \n\nI (26M) have a “beater” truck for the occasions my regular vehicle isn’t enough, but it’s older than me with upwards of 350k miles on it. Roughly a year ago I asked my girlfriend (27F) of 3 years to help me out with a better truck as she also gets use from it (I take us to the cabin with it to accommodate our 3 large dogs + stuff, I help her friends move, haul stuff for her on occasion etc). I didn’t ask for much money and made it clear I’d still be doing upkeep on said truck out of my pocket. She declined, which I completely understand and am not mad about.\n\nHere’s where the issue lies - my truck recently finally gave out (engine damage) and it’s not worth fixing, so I had to back out of helping her friend and I explained that, unfortunately, we will have to drive separate to my cabin this summer because neither of our regular cars can accommodate 3 large dogs, 2 people and food/crates/clothing etc and I can’t afford a truck for a while yet. I don’t think I’m being an ass but she has been accusing me of “punishing” her for not helping, saying I can just get a loan and her friends agree. AITA?\n\nEdit to add since people are asking; no, I’m not avoiding buying a truck to punish her. I need a truck myself and I will be buying one ASAP, I simply don’t have the money for a quality truck saved up right now and I don’t believe a loan for a beater truck would be a wise financial decision", "created_utc": 1673944966, "permalink": "/r/AmItheAsshole/comments/10e7ass/aita_for_asking_my_girlfriend_to_help_with_the/", "score": 387, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because realistically I could buy a truck with lower standards or get a loan, although I don’t believe either option is financially wise.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour car dying isn’t “punishment” for her.\n\nOn the other hand, if you’re thinking of this as punishment for her (I.e. you are gonna buy a new truck and you only waited so that you could tell your girlfriend you’ll have to take 2 cars) then you’re an AH.", "Info: are you actually doing any of this to punish her, or to show her what happens when she doesn't help you? Or is it all simply the unavoidable results of your truck breaking down?", "NTA\n\nThis is more or less an example of life dealing a hand and then everyone involved experiencing the transition from lamentation to the acceptance stage of the current reality, assuming you two are being contributing and honest partners of course.  I can’t really blame either of you in that context, though hopefully she reaches that point of acceptance as you seem to have.\n\nEven beaters are expensive now with the way that the used truck market has inflated as of late. Taking a loan with current interest rates is not advisable assuming vehicle demand will eventually be met and the current inconvenience is not insurmountable.", "**NTA**    Personally, I think your mistake was in asking for her financial help to purchase a secondary vehicle   I don't understand though, why you had to bring up arrangements for your summer vacation when talking about not being able to help her friend.    Why go down that path?   If you don't have the means anymore to help with these chores, you can say that as the situations arise.\n\nGood used trucks are notoriously difficult to find -- people tend to drive them into the ground.   You've been lucky that you had beater you could use and now you don't have one, it's just that simple.    Keep saving and be on the lookout for a good value used truck.", "NTA. She doesn’t sound like long term material. \n\nAlso, cars and trucks are very overpriced right now, thanks to the chip shortage.", "NTA. OP, in hindsight, though you meant well, don't ask a friend (you're not married yet) to help pay for your personal property though you will give them access to it. As you have already noticed, people can be weird about financial obligations. \n\nPeople depended on you and your vehicle to do certain things. Now that your vehicle has broken down, notice the different reactions of others around you. Either they will pick up the slack or they will drift away.", "NTA I don't see this as a punishment it just went out and that's it.\n Also why is a problem for her to drive to the cabin?", "NTA, why doesn't she get a truck?", "NTA - You didn't destroy your truck on purpose. You don't hold back on buying a \"new\" one to punish her, you just don't have the money. And yes, taking out a loan to get another beater that more likely then not will end up a money-sink isn't a wise financial decision. \n\nOh and her friends can just shut up, that is none of their buissenes. If they need someone to help them move they can hire a moving company. If they can't afford that they can just take out a loan.(I wouldn't advise you to tell them that though)", "Of course y t a, you say your truck was older than you so you clearly had it before you met her. Then you lured her with your truck into a relationship with you. Now the truck is gone, and you are not fullfilling your side of the relationship deal anymore. You need to take out a loan to provide her and her friends with a truck immidiately, period! Thats how it works. You can't just not replace stuff you owned before the relationship, your gf has a right to them or can claim you missleaded her when asking her to be your gf. \n\n/s", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst time posting here, but I have been lurking for a little while so give me a little slack. \n\nI (26M) have a “beater” truck for the occasions my regular vehicle isn’t enough, but it’s older than me with upwards of 350k miles on it. Roughly a year ago I asked my girlfriend (27F) of 3 years to help me out with a better truck as she also gets use from it (I take us to the cabin with it to accommodate our 3 large dogs + stuff, I help her friends move, haul stuff for her on occasion etc). I didn’t ask for much money and made it clear I’d still be doing upkeep on said truck out of my pocket. She declined, which I completely understand and am not mad about.\n\nHere’s where the issue lies - my truck recently finally gave out (engine damage) and it’s not worth fixing, so I had to back out of helping her friend and I explained that, unfortunately, we will have to drive separate to my cabin this summer because neither of our regular cars can accommodate 3 large dogs, 2 people and food/crates/clothing etc and I can’t afford a truck for a while yet. I don’t think I’m being an ass but she has been accusing me of “punishing” her for not helping, saying I can just get a loan and her friends agree. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.", "I will be buying a truck as soon as possible because this is inconvenient for me as well, but I don’t think I’d get a quality truck for the money I have saved right now (although I am looking) and I don’t think a loan on a beater truck is a wise financial decision on my part", "This is just the results of my savings being chipped into by a few unrelated issues and a 30 year old truck well beyond it’s life expectancy finally giving out. I will be buying a truck ASAP but I haven’t been able to find something quality for the money I have and I don’t think a loan on a beater is a smart idea", "Our cabin trips were mentioned ahead of time because she hates driving long distances and the cabin is about 4 hours away, really just to allow time to plan more than anything", "Why should she pay for HIS truck? If she pays then it’s their truck and not only his. They are not married and being a bf isn’t that important", "Why is she obligated to give a random boyfriend money for a truck that she has zero legal rights to?", "The only reason I even considered asking was because we are in a serious relationship (honestly this has been the first “real” issue) and we live together in my house. I otherwise agree though, which is why I didn’t really expect anything from her either, you know?", "It's not even his friends, it's his gf's friends who are complaining that he won't help them anymore because he can't afford it... They sound like a lovely bunch", "She hates long drives and it’s about a 4 hour drive. Really just wanted to give her time to plan because we take a trip usually monthly during the spring and summer", "She hates driving large vehicles, even my crossover is too much for her", "So do as your girlfriend and other friends do, get by with one vehicle until you have enough to afford a decent truck -- either another beater or better, loan worthy truck.    Your girlfriend should not be part of that process at all.   Nor is it appropriate for your friends to advise you to take out a loan for their convenience.", "In that case, NTA. If you were *actually* punishing her, you would be one; but this is circumstantial and you can't really help it. She ought to have the sense to realize that, and on some level probably does -- she's just frustrated by what's going on, and looking for someone to blame. That's not the sign of a partner behaving decently.", "Understood.", "Maybe the better term would have been acquaintances.\n\nIn the olden days...if you couldn't afford a certain type of recreational activity, you didn't do it until you could, or found another less expensive activity. Really, this still applies.", "How about you make it a loan from her? I mean small amount. Personally i wouldn't give money to pay for a car i won't get back if i split with a partner i gave it to when needed. But i would definitely give money if he will pay me back. You get me? Ofc if i use my partnes service of driving me and my friends i would pay for gas occasionally. If that's not a option then she can plan how to get there cuz you gave her enough time to think it through.", "Don't know what to tell you then.  She sounds like a joy of a person to be around, I still think you are NTA here", "Yes, ESH... the decision to buy something big, solve transport issues, take a loan or not should be normal discussions in a relationship withtout anyone telling anyone else what to do, use words as punishing or involve friends to put pressure on it...or go to reddit to ask whether you are an A or not... Sit together and talk!", "Maybe mooches is even more fit, haha. Obviously I am being overly mean here, but them blaming op for what happened doesn't put them in a good light.", "There were a few options I discussed with her but I didn’t really elaborate in order to keep the post concise: I asked if she had any extra money, just like a couple hundred bucks at most, to pay for the initial stuff that should be done on any newly acquired used vehicle (belts/hoses/filters/fluids etc) and I’d pay her back when I can after I get a truck. I also mentioned maybe putting a touch towards a down payment and trading in one of our vehicles (I gave her the option of taking my newer and more valuable vehicle, which I would of course transfer to her name, and trading in hers so she has more room but she doesn’t like the thought of driving anything bigger than her little economy car) so I can buy something nicer and more reliable, or just chipping in for gas when we do ride together in the truck so I can save some money but she wasn’t a fan of any of these, and again, I don’t expect her to help with something that isn’t really “hers” so I didn’t push the issue", "Agreed. It seems that OP may be about to lose some dead weight. Some folks are only in your life for a season.", "Well if she isn't open to any of those you can't do much then just save and by when you can", "Give them the dead truck and wish them luck, they can use it as much as they wish :D", "NTA your girlfriend sounds like an asshole who wants all the benefits but none of the work for those benefits", "NTA, she also gets her use from it if she isn't willing to contribute an amount that equates to her uses makes her a freeloader. If you got a loan she isn't entitled to the truck. I don't want the realationship bs here, if she isn't willing to help why should op help simple as that.", "NTA\n\n&#x200B;\n\nTell her SHE can buy a truck if SHE needs one, too.", "NTA - I believe you should reevaluate your relationship with your girlfriend. Think about it, a woman who spends 3 years at your side, lives in your house, uses your car and even indirectly benefits her friends, since you use your car to help them move.  And now, when you ask him to contribute a new car, even though you've made it clear that you'll pay her back when you can, she refuses to help.\n\nThis is certainly just one of the first problems you will face in your relationship if you decide to continue with it.", "NTA.  You're not punishing her by not getting the truck - it is a financial decision.  If she's so hell bent on needing the truck for her friends and dogs then she can go buy a truck herself.", "NTA", "Info: What do you know that implies that your girlfriend can afford to help you out with a newer truck? Is she working?", "NTA. Makes since not to waste money on a Junker. Rather have one that won't need to be nursed to keep it on the road. Nothing stopping her from getting her own truck.", "I'm just skeptical because the wording in this post makes it seem like you backed out of helping her friend not because of your truck. I don't think you necessarily need your truck to help move things. IF they are large items, why can't they just rent a moving truck from home depot for $20/hour?\n\nIt's just oddly specific the way you mention the need/uses for the truck and those exact need/uses are the ones you back out of or make it hard for her later on. It seems a bit manipulative, but that's just from me reading your post with limited information. Can't say NTA/YTA. \n\nI'm just curious:\n\n1) How much did you ask for from her to help you buy a better truck? \n\n2) How much is the better truck and are you getting a loan or you wanted to do cash?\n\n3) What is the financial situation? Scraping by paycheck to paycheck or one more well off than the other?\n\n4) You own any other vehicles? What do you need the truck for specifically? (Work related?)\n\n5) How often do you help them \"move\" things and how large are the items?", "Nta", "NTA if she truly believes you are punishing her like this .. she apparently doesn't really know or trust you.", "Maybe the way you asked felt a little sketchy/gold digger like for her??  Maybe have it a little more \"legal\" with signed papers and such?  I know I would not want to be down for that kind of money without some good paperwork.\n\nIs selling or renting out the cabin an option for the down payment?", "Because renting a truck is expensive - there's the initial rental cost, the hourly rental charge and the gas cost for a very low MPG vehicle. It's safe to assume $100 all in. Plus, you never know if they'll have one available when you need one. So if she knows she'll be needing a truck multiple times throughout the year, it makes sense to give him a few hundred, because she financially comes out ahead.", "She lives in *his* house and her/her friends regularly use *his* facilities for their benefit and now they’re going to struggle to visit *his* summer cabin but it came across that *he* was like a gold digger? Seems she’s quite happy trusting him when it benefits her but now we know how she feels about helping him back. NTA OP.", "NO NO NO. NEVER borrow or loan money from/to someone you like. It rarely ends well.", "\\>or go to reddit to ask whether you are an A or not\n\nThen what exactly are you doing here?", "They already had the discussion and gf didn't want to contribute. There's no punishment here, op does not have the money for a truck right now and telling him to get a loan to buy a used truck so she won't be inconvenienced is ridiculous.", "Wait, even chipping in for gas when she rides with you is too much? Yikes.", "If they make a contract with a lawyer i guess it's ok", "Absolutely NTA. Your girlfriend is being selfish and entitled. While yes, its her choice to not want to help financially, she doesn’t have the right to complain and accuse you of trying to “punish her” (which is totally ridiculous). \n\nTruth be told, she doesn’t sound like the best of partners if this is how she acts when life happens and something doesn’t go her way. And to get her friends involved is just plain old immature.", "I was on the fence on this, but I finally went with NTA\n\nI'm kind of funky on you asking your GF for money for YOIUR  truck. sure, she get the benefit from it, but if you were to break up with her tomorrow, you still have a truck and her money.\n\nThe fact you were cool with her saying no, pushed me to NTA. She doesn't get to tell you to \"get a loan\" for a truck to help her out.", "Can't believe all the N T A s this is clearly ESH. You suck for asking your _girlfriend_ for financial help with a large purchase - especially a depreciating asset she doesn't really reap that much benefit from (you clearly have alternatives i.e. taking two cars), she sucks for assuming you not getting a new one right away is punishment for her not being willing or able to financially contribute. It's a logical assumption to make although a shitty one.", "NTA", "NTA\n\nBeing unwilling to get a loan to make somebody else's life easier is not punishment. It's pretty selfish of your partner to want you to go into debt for her and her friends.", "NTA\n\nNot the best time to be needing a new vehicle new or used. \n\nAgain NTA and she truly believes that you are punishing her for not dishing out a lot of money for the wrong vehicle for you? If she is unwilling to front some costs, she gets no say in what or when you buy a new truck.", "Op your girlfriend has been getting brownie points for all the good deeds you were doing with your truck, could not see the value in helping you get a newer one and now is upset cause she looked bad to her friend not helping(you and your truck) her move! Expecting you to go into debt to make her life easier is ridiculous, she had her chance to be involved and screwed up! NTA follow your plan and get the truck when you can legitimately afford it! Everyone else here excluding your dogs are arseholes!", "Info - if she helped pay for the truck you initially wanted, would it be both of yours ? Meaning if she would be on the tittle or if you would pay her back her contribution? \n\nAnd you guys were dating for 2 years, people are responding like you guys are married 🤚🏽", "NTA. seeing some of your comments where she won’t even chip in for gas is pathetic (her).", "Sounds like the two of you need to sit down and talk financial planning. Also this isn’t about money as much as it’s about communication. NAH Just talk this out and see if the two of you can agree on some mutual financial goals.", "NTA. Honestly your girlfriend and her friends should mind their own business rather than telling you to get a loan.", "Do you often feel like your girlfriend is taking advantage of you? It's one thing for her to not want to contribute to your vehicle given you're not married, but then to act like she and her friends are entitled to it and accuse you of punishing her by not making a poor financial decision indicates there are some serious issues with how your girlfriend views your relationship, you, and financial responsibility.\n\nNTA and I'd probably give this relationship a good think.", "Nta..but your gf and her friends seem to be..sounds like you and your truck were just an \"assumed convenience \"  for them..big red flag here.. I would be reviewing my relationship..", "NTA", " \nRather, there is one that will not require nursing to keep on the road.", "Or RENT one. When we got tired of our old truck nickel and diming us to death, we donated it to charity. We briefly considered a new one, but it seemed ridiculous for 2 people to insure and maintain 3 vehicles. The only times we've needed one since was for hauling large stuff home, and Home Depot rents them by the hour. \n\nOP says he has a crossover. If that's not enough for a weekend at their cabin, they're taking too much stuff!\n\nEdited to add: OP, what about a roof rack or small trailer for your weekend getaways?", "TBH, it sounds like replacement truck is a want rather than a need.   You are accustomed to having a truck handy but it wasn't your primary vehicle.  Don't rush to get something that won't last.", "As long as your finances are separate, you are making choices to use your truck how you are using it. Unfortunately, if you are the friend w/ a truck, you are always asked to help out. It is just a thing that happens. I have been on both sides of the equation. I'm sure this isn't something you are doing for just your GF and her friends, but family, friends and others. If you don't want to be the guy that every acquaintance comes out of the woodwork to borrow a truck, then draw some boundaries. Everyone who has a truck (who doesn't live in an area where everyone has a truck) has to do this at some point b/c people don't understand how often these requests for truck-help come in.\n\nI also don't like long distance driving and make up for it on roadtrips by buying or making dinner/finding the hotel/paying for all the gas/buying all the road trip snacks or something similar to pay for the wear/tear and extra effort of the driver, depending on the situation.\n\nYou shouldn't have asked your GF to help pay for your truck, and you telling her the list of things in the future you can't do w/o a replacement truck could have very easily come off as sounding like punishment for not giving you money.\n\nYou are in a relationship. If you feel like you are being taken advantage of, then that is a discussion you need to have w/ your GF about roles and responsibilities and boundaries. However, when you are talking about things like driving to cabin w/ your truck b/c it is more convenient, then look at the relationship overall, are their things she does that make the relationship easier that you don't \"pay\" her for? Are the scales pretty evenly balanced? This shouldn't be a tit for tat review of your relationship, but you can tell if things are pretty evenly balanced. Make sure to pay attention to things around the house. For example, does she help you upkeep the house in ways that a renter wouldn't be responsible\n\nI honestly can't tell if you are overall being taken advantage of and this came out of frustration or if  you are discounting things your GF does for you, but either way, her giving you money for the truck should never have been part of the convo.", "Does she pay rent? That would help with the truck.", "You've merged accommodation but not transport? Are you a proper couple or not? It sounds like she's not fully committed.\n\n/edit: and she won't even help with fuel costs for long journeys? Wow. You have bigger problems. I'd have no truck with her attitude.", "Why should she and her friends use HIS truck? If they use it then its their truck not his. They are not married and being a gf and her friends isn’t that important", "He does clarify that they are living together, and he considers this a long-term relationship.  It's more serious than just \"we're dating\".\n\nThat still doesn't mean that she has to feel comfortable entering into a financial obligation with him like this.\n\nBut that also doesn't mean she gets to call him an asshole for making his own financial decisions, like holding off on buying another new truck until he can find more favorable conditions.\n\nHer (and her friends) suggesting that he take out a loan for what is essentially HER (and their) convenience just shows how ready people can be to spend other people's money.  OP isn't wrong that right now is not a great time to take out a loan OR to get a good deal on a used truck. (Interest rates are high, and the used vehicle market is particularly hot right now.  Both will hopefully cool off over time, but it's hard to say exactly when that will happen.)", "> Why should she pay for HIS truck?\n\nshe's getting use out of it so she should contribute.", "She shouldn't, but he should then charge her a rental fee for any use of the truck for her friends or to go to the cabin. You either chip in on the front end, or subsidize the back end. No free rides.", "Is he really a \"random boyfriend\" when they've been living together in his house for several years?\n\nAt any rate, she ISN'T obligated to chip in on the truck with him.  But at the same time, then, if she doesn't feel that strongly tied to him -- why should HE make unwise financial decisions just to benefit her and her friends?", "She's not but she is pushing him to get a loan he doesn't want.", ">So do as your girlfriend and other friends do, get by with one vehicle until you have enough to afford a decent truck -- either another beater or better, loan worthy truck.\n\nI mean, it sounds like that IS what he wants to do.  And it's what he's being called an asshole for.  Hence, why he's here.", "That's... Literally what op is doing....", ">Your girlfriend should not be part of that process at all.\n\nThis is weird to me. Romantic partners should be a factor in making a major life decision, especially when you live together.", "Not really, he is more focused on replacing the truck than waiting to get a better truck.", "Though it sounds in this case like OP tried to get her invested in the coming decision, seeing the end of the current truck in the future, and she declined, but is upset and involving her friends after the fact that she has lost the benefit.", "Not until finances are shared.", "Unless they are sharing finances, buying a vehicle is not a major life decision.", "Wait a minute, “chipping in for gas” when you’re helping her friends was a no? So NTA, what a useless mooch she is", "No... op told girlfriend that they were going to have MAKE DO with how things are at the moment because he can't afford a new truck. She got mad and bitched to her friend who think op should take out a loan he can't afford.", "...... he literally said that he is waiting to save up money to get a quality truck. Did you actually read any of this?", "I think you may've misread OP's comment...he's waiting to get a better truck *while* keeping an eye out for deals that'd let him do so sooner rather than later."]}