{"id": 7563, "submission_id": "10eegqf", "title": "AITA For Stopping An Employee From Selling Their Own Products At Work?", "selftext": "Hi everyone, \n\nI’m a 59F in the midwest. I’ve been working as a bank manager for over 30 years. There is a teller I manage 35ishM, let’s call him Jim. \n\nJim has only worked here for a few months. Before this he was a self-proclaimed “Ebay guy”. He would buy products, then resell them on Ebay for a profit, which I didn’t know you could do, and found pretty interesting. \n\nAround Christmas time, he started selling random products he had at his teller station in the bank during his shift. Every customer that would come to his teller window would get a sales pitch for a painted Yeti cup, phone case, or whatever he had at the time. He would also hound people in the drive-thru about purchasing his items. \n\nI was shocked, and found this wildly inappropriate. It’s also completely against our company policy. To me, he’s not only selling something while working for another company, he’s also hounding customers who are just coming in for deposits/withdrawals, not looking to be sold to like a retail store. \n\nSome lead executives (my boss’s boss’s boss) from the bank also saw him do this and we’re not happy with it either. \n\nI told him he couldn’t do it anymore, and he lost it. He flew off the handle and accused us (bank management) of wanting him to stay poor. He said he has a surgery he needs desperately, and this was the only way he could get it. \n\nSo, AITA here? My kids (in their 20s and 30s) say I’m not, and I did the right thing. But he was just so angry when we told him to stop.", "created_utc": 1673967954, "permalink": "/r/AmItheAsshole/comments/10eegqf/aita_for_stopping_an_employee_from_selling_their/", "score": 1696, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > His reactions made me feel like me and the rest of bank management might be the assholes. We know our company policy, but we do care about our employees. I obviously don’t want him to have to worry more about money, but I also want to keep our bank an ethical and enjoyable place.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Oh my dear God, NTA so hard. That's a major conflict of interest to operate your own business while you're at work for another business. He should have been fired", "Nta \n\nI don't care if he is saving for his surgery\nHe can take his buisness else where", "NTA. This guy shouldn’t be representing your bank. As a customer, I’d be highly pissed if I came in for business and got a sales push. \n\nTotally inappropriate. And he flew off the handle! That’s even more concerning.", "NTA, but this is such a clear violation of typical rules that don't you worry about him having access to confidential account information?", "NTA. I don't even like it when a bank pitches its own products to me while I'm trying to make a simple deposit. I can't imagine how annoyed your customers were when your wayward employee started pitching products that were completely unrelated.", "Absolutely NTA, and very unethical behavior\n\nYour clients are there to do business for their banking, not be getting hounded and solicited to buy his EBay crap.\n\nAlso, it's added liability for the business because if any of those customers are dissatisfied, they could also come back with complaints and issues that will potentially affect YOUR actual business.\n\nDude should be fired. He's side hustling on your dime, not doing his actual job", "NTA - I'm not sure how he can pitch a fit when it's literally against company policy. If I was just making a deposit and got hit with a sales pitch, I'd be really uncomfortable with that. Sorry that he needs surgery - but that doesn't mean he gets to go against policly.", "NTA.\n\nEither he understood the policy and ignored it, or he's too stupid to understand the policy.\n\nHe easily could be fired for this. Simply requiring that he follow policy is the least you should have done.\n\nALSO:  If he is truly this desperate for money, he is a liability to the bank.  He might try his hand at embezzlement.   And if he DOESN'T need an operation, then he's a compulsive liar who can't take responsibility for his own actions,  which is another reason to watch him closely.", "NTA it's against company policy, if he has an issue he can't take it up with head office.", "Reading the title, I expected it to be something like Jim leaving an Avon catalogue in the break room for colleagues to look at/buy from him… not pitching his shit to customers of a bank, to the point of harassment, while working as a teller. \n\nI’m honestly shocked he wasn’t fired for gross misconduct. And as for his reaction… surely he can’t think that ANY business would be happy for an employee to conduct personal business on company time? When has that ever been acceptable? It reflects so poorly on the bank - if I went into my bank and an employee started trying to flog me unrelated goods I would be speaking to management immediately to make a complaint. It’s bad enough when they try to upsell other financial services provided by the bank, but this is something else entirely!\n\nAbsolutely NTA.", "NTA- way over the line professionally for him to be selling to customers and promoting “his business” at teller station", "Nta. Give a warning and if it continues fire him. Perfectly justified.", "Nta that’s insanely unprofessional on his part. Imagine just going to the bank and getting hounded to buy some random thing, noone would like that. Be very cautious of him with sensitive information", "NTA. This is a reasonable and extremely common policy companies have, including my own. I'm assuming he agreed to these policies when he accepted the job offer and stayed through training?\n\nAnyway, I would certainly not want a sales pitch on something totally unrelated when I'm just trying to deposit checks at the bank. If he needs extra money, I'm sure no one's stopping him from selling this stuff after hours or on the weekends.", "Nta. Your request was reasonable. His reaction to the request would make me want to get rid of him, though.", "NTA, at all. I’m failing to see how you could have done anything differently, it’s not like you personally reported him. He was seen by *your* seniors.", "NTA if I was your bank customer and this happened to me it would be enough to make me switch banks", "What's stopping him from selling on E-bay? He can't do sales pitch during his shift he's supposed to be doing his job! NTA", "NTA...He's putting your bank's reputation on the line.  It's incredible to me that he thought this was okay.", "NTA, this would make me hella uncomfortable as a person making a deposit. cus this boils down to \"Hey, nice paycheck, wanna buy something off me?\" Like hell nah", "NTA: This is a huge conflict of interest for all parties involved. His feelings about it are his own and you are not in control of his emotions. That's all on him. Stick to your official company boundaries and you'll be ok.", "Nope NTA. He is using the banks customer platform to sell his product. He has no contract with the bank to give them a share of his profits. Even eBay charges a fee for each transaction. He is silly to think the bank or any company would allow him to make a profit off their business model.", "NTA.  His actions and his behavior would get him terminated in 99.9% of the companies out there", "NTA\n\nIt would be fine if he sold it to other employees during break, or something like that, but selling it to the business customers, really?\n\nI work in a bank, and I think it's extremely kind of you (to a point where it's detrimental to yourself) not to fire him on spot first time you've seen him doing that.", "NTA - As a manager I would find it inappropriate as well.  As a customer, whose perspective you really have to take into account, I would hate getting a pitch (especially unrelated) in a business that I was not wanting.  The fact that he went off is over the top.  That is not his time or his place to be doing that.\n\nAs long as it didn't get out of hand, I trusted them, and they would leave it alone, I would allow them to have a business card with their etsy/ebay/whatever shop on it, so if someone asked where they got it, he could just hand them that.  He burned that bridge with his reaction though.  He should not be initiating the conversation with customers at all.", "NTA. What a dumbass this employee is. The whole point of Ebay is that you don't need to have shop to sell stuff.\n\nAnd of course you are right. People come to banks for their financial business, not to be bothered by people who advertise their crap to them.", "NTA. That is 100% against any company's policy. You can't run your own business from your employer's workplace or during work hours.\n\nHe's trying to use the client list for his own business and he has access to confidential company and customer information. That's a form of theft: the bank built this clientele, not him.\n\nHe's also stealing time from the company, obviously. Instead of doing his job and moving to the next customer, he takes time aside for his own business. Time that you pay him.", "NTA", "NTA, but how did you not know what ebay was?", "NTA. I also am a PT reseller, mainly my own stuff though, and mostly clothes and shoes. I sell on a few platforms, but I would NEVER think to harass or even ask my co-workers to look at my stuff, and buy it. He was WAY out of line.", "NTA. Most employers have a policy again running side gigs on company time. Fire his ass.", "NTA. \n\nI was expecting something along the lines of 'some customers have asked an employee about their (tumbler, hat, whatever their craft/hobby is) and offered to purchase them' not 'random bank teller is forcing customers through a sales pitch before allowing them to conduct their business,' holy hell.", "YTA to your customers for not warning him the first time and firing him if he didn’t immediately stop.", "NTA. Sounds like he’s taking advantage of the fact that he knows how much money customers have and that some of them will have cash on them that he’s hoping they will spend on his junk. If I saw that at my bank I would turn around and walk right out and make a complaint to the manager.", "Nta. It’s against policy and inappropriate.", "NTA - He is being incredibly unprofessional, therefore putting his job and finances at risk.", "No but it's a little unclear what's going on here. Does he report to you or are you on the same level?\n\nIf he's your report, then you should have shut this down immediately and then given a written warning. Your boss's boss' boss should never be in the mix on an issue of simple misconduct.\n\nIf you are at the same level as him, then sure, it's not you responsibility to manage him but it's very appropriate to speak up when someone is flaunting the rules and hassling customers at a financial institution.\n\nNTA.", "NTA if he wants to be \"ebay guy\" he can do it outside of work", "NTA    I would have been offended if my bank allowed their employees do this. It's beyond inappropriate, and this person has access to my personal information. \n\nHe shouldn't be working there. Sure I feel bad he needs extra money, but your bank needs to be professional.", "NTA and you should fire his ass", "I used to work at a goodwill where a bunch of rich people would do this. It’s scalping. They’re taking sometimes REALLY GREAT ANTIQUES and selling them for full price online and it’s deplorable. Those items are meant for people with lower income who can’t normally buy them at full price. Your coworker is an asshole and a worm. NTA tell on his ass.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi everyone, \n\nI’m a 59F in the midwest. I’ve been working as a bank manager for over 30 years. There is a teller I manage 35ishM, let’s call him Jim. \n\nJim has only worked here for a few months. Before this he was a self-proclaimed “Ebay guy”. He would buy products, then resell them on Ebay for a profit, which I didn’t know you could do, and found pretty interesting. \n\nAround Christmas time, he started selling random products he had at his teller station in the bank during his shift. Every customer that would come to his teller window would get a sales pitch for a painted Yeti cup, phone case, or whatever he had at the time. He would also hound people in the drive-thru about purchasing his items. \n\nI was shocked, and found this wildly inappropriate. It’s also completely against our company policy. To me, he’s not only selling something while working for another company, he’s also hounding customers who are just coming in for deposits/withdrawals, not looking to be sold to like a retail store. \n\nSome lead executives (my boss’s boss’s boss) from the bank also saw him do this and we’re not happy with it either. \n\nI told him he couldn’t do it anymore, and he lost it. He flew off the handle and accused us (bank management) of wanting him to stay poor. He said he has a surgery he needs desperately, and this was the only way he could get it. \n\nSo, AITA here? My kids (in their 20s and 30s) say I’m not, and I did the right thing. But he was just so angry when we told him to stop.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA x 100.\n\nNope you don't get to run your eBay reselling business at your teller job and pitch bank customers.  I'm surprised you didn't get any complaints from the bank customers.   He was completely out of order and you did the right thing.", "NTA - in what world would this be ok? I would be pissed if I went to the bank and someone tried to sell me something other than a banking product. Maybe girl scout cookies or candy for the local kids sport team, but that is it.", "By his logic: if I desperately need money, I can sell drugs steal cars rob banks, because that's my only way. \n\nThis clown cannot be doing his personal sales sht on company hours and company premises. Put a stop to it. NTA.", "If my bank teller started hawking tchotchkes at me when I went, I would close out my accounts and go to a different bank. NTA.", "NTA. His behavior is inappropriate and his response to your correction was more so. This is an HR moment.", "NTA, he’s doing something that is distracting him and the bank’s customers from the real business of the bank.", "NTA. His job is to service banking customers - not to make them uncomfortable by pushing his products.", "NTA yeah I would hard core complain not appropriate at all. I would seriously consider changing banks if this was happening.", "NTA. On the clock your dime. Not even open to discussion. Will chase costumers away. What would happen if someone called home office. That would have come back on you.", "NTA, he’s lucky you didn’t fire him.", "Nta - but tread lightly.  This feels like desperation behavior.  As a people manager i would pull him aside separately.  First reiterate that selling things at work ends now, full stop.  But if you are a bank i have to imagine there is an employee assistance plan you can put him in touch with if things are really bad health wise.  Empathize, but be firm and offer support if its needed.  But selling shit at work ends now no questions asked.    \n   \nI also agree with daughters assessment about him working near money.  NFW.", "NTA but your bank has a drive-thru. Did I read that correctly?", "INFO: does the bank job not come with benefits? Why does he need to sell knickknacks to pay for a medical procedure?", "Real talk - if this happened to me *one* time I would change banks. I don't like it when my Credit Union wants to sell me on the very *reasonable* services they *actually* offer.\n\nIf the company were to allow a local business to setup a stand and solicit sales from interested customers for a *quality* local product -- that I could tolerate and even patronize if the product is something I'm interested in.\n\nSome dude reselling eBay shit? Hard no. I'm gonna find another FI. It's just super unprofessional.", "Literally it's so unbelievably inappropriate, who on Earth can think this was an acceptable thing to be doing at work. At a bank no less!\n\nObviously NTA, jesus.", "I had the same issue with a member of staff last month. She had a huge tantrum, called me names, made threats, told my husband I tried to hit her (he knows me better than that but we have CCTV so I asked him to look) then she quit. She has been telling people I sacked her but I didn't, not even after all the shitty things she said and did. And it didn't end there, she demanded holiday pay for the next 4 months and her husband threatened to knock my head right off my shoulders if I ever spoke to his wife again. She borrowed an expensive piece of equipment and refused to bring it back.\n\nI am not sorry she's gone, her stupid mistakes were costing us money we don't have. Well, now we do because we aren't paying her wages anymore!\n\nNTA obviously!", "Especially at a bank. Dunno if I'd be trusting him with other people's money at that point.\n\nStill fucking sucks that a guy feels the need to do that inorder to afford surgery.\n\nBut op isn't the one deciding insurance stuff", "Yes exactly. My reasoning is if he was great at selling on Ebay before, he should have no problems doing so now.", "Thank you, that’s how I felt. If I walked into a bank just wanting to cash a check and got some weird sale pitch, it’s be furious. \n\nSomehow we didn’t get any customer complaints.", "My daughter said the same thing. She also didn’t like that someone so “desperate for money” (her words) was working in a bank surrounded by money", "Huh?!?", "I knew what eBay was, but I didn’t realize someone could use it to make a living selling small products like cups, and little collectibles.", "Deplorable? You don't understand how Goodwill works. The sales fund community programs and services. The more sales they make, the better it is for the community, especially lower income. Cut out resellers and you cut out a huge portion of sales and therefore funding. The so called \"deplorables\" are typically selling as a side gig to help feed their families. YTA.", "Same here! I hope every banking customer he harasses files a complaint!\n\nNTA We go to a bank to bank, not to shop or dodge salesmen!", "[removed]", "She sounds nice /s", "Definitely. He can go peddle his crap in a park on his time, not the banks.\n\nCould always ask him how he is going to pay for surgery when he is unemployed due to violating company policy...", "I wonder if that is because people are so weary of how on edge so many people are.  I certainly would have said something if I was a customer.", "Your daughter is a smart one. NTA and this guy should be let go", "Yes and Yes. This is major red flag behavior here. Please be sure to involve HR or whatever your chain of decisions is.", "NTA- way over the line professionally for him to be selling to customers and promoting “his business” at teller station!", "I would not feel safe banking at a place where the teller would say “while I’m looking at your confidential financial records, would you like to buy some junk that a picked up as a side hustle? I’m desperate for money.”\n\nHe’s a liability.", "I would too.  I would go so far as to demand the numbers for the regional, and State managers of that banking firm and make complaints with them as well.\n\nOP You Are NTA!!!  Your teller was being completely unprofessional!", "You claim to be a bank manager of 30 years yet this situation isn't clear enough for you so you need to come to reddit for advice?", "NTA. No matter what he needs it forx he is kinda destroying yoir work places image, and you my actually lose some clients, i dont know. Even if not losing them, the clients will be nkt happx woth this at all. When i go to the bank, i would find it very annoying or creepy i an employer came to me trying to sell his products. Even if i go to an actual shop i dont want sny employee to help me shop, when i need something, i aks it myself. What he is doing is hoghlx unprofessional. He can sell his items wherever, but not there", "NTA.  When he's at the bank, he works only for the bank.  Outside of working hours he can do what he wants.  Too bad he's angry, he can't hound customers, and they are there to do bank business only.", "NTA.  you just said it's against company policy.  there's nothing to debate there.", "NTA. Without question he shouldn't be allowed to do that", "NTA - I'm astounded that you didn't get any customer complaints! What an inappropriate use of company time and resources. And he had the nerve to get mad about it? WTH?", "NTA AT ALL, and honestly every customer and employee is probably so grateful to you for putting a stop to it! This is the exact kind of thing that would make me switch banks entirely.", "NTA, his behavior is pretty poor choice of behavior.", "NTA. I'd leave my credit union if that happened to me as a customer. And I love my credit union. They know everyone by name, and we know the tellers. Hell, I send all the tellers Christmas cards and a little gift card every year. But yeah I'd be upset. You did the right thing.", "NTA", "NTA, I’d switch banks if I came across this guy.", "If you and your highers are against this behavior, and it violates your policies, then there really is no room for debate. NTA. He knew the rules when taking the job, he risks the consequences of the act. And frankly flying off the handle like that probably isn't a good way to make sure you can pay for that alleged operation. Because if it were me? He would have to peddle harder, because a teller he would no longer be.", "NTA. You are absolutely correct,  people go into the bank for a specific reason and being hounded to buy things is Not one of them.", "NTA, and you should fire him.", "NTA.  Tell Jim his resignation is accepted immediately.", "NTA \nI'd definitely think about opening an account elsewhere if i was a customer. \n\nTotally off topic but as an Australian,  my mind is blown by drive thru banks!", "This is a Supervillain backstory. Smdh. NTA", "NTA. I would be incredibly annoyed as the customer. I also wouldn’t trust him with my money or banking info. \n\nHe won’t be able to pay for his surgery if he’s fired… but he should be fired if he’s breaking the company rules.", "NTA. How do you know the cash he is pocketing behinf the counter is actual cash from his sales and not skimming it off the top of their accounts?", "NTA. That is wildly unprofessional and the whole point of ebay is to quietly sell things online. You'd better start writing him up", "NTA...I offer print on demand services (custom apparel, cups, etc) but it's only by word of mouth at work when coworkers notice my shirts or cups. I never pitch to anyone. Had a few managers talk to me about it but they simply wanted to buy some items from me. If they asked me to stop, I would have. What he's doing is wrong and could potentially turn away a lot of customers. His reaction to your request for him to stop should have been a fireable offense", "NTA\n\nIt sounds like he needs more work to do.", "NTA\n\nBut why did it take a big wig coming in for you to act like a manager and tell him to knock it off? You allowed a super uncomfortable situation for your other employees and all of your customers. That was your job to sort out the very first day he tried it", "NTA. Seems like he just came up with a sad storie to try and justify his poor behavior.", "NTA\n\nThat's a quick way to lose bank customers.\n\nI would hate to come in to do my business and be hit by a sales pitch for crap that I can buy online. I only expect pleasant small talk and banking to happen with the company that I trust with my money", "NTA. At what job would it be ok to sell random junk on the side? Totally inappropriate on his part.", "NTA.  Someone should explain to him that doing this could be considered a fireable offense.  In fact, after his meltdown, he should have been fired.\n\nIf I had to deal with that when I go to my bank, I'd find another bank.", "NTA he's lucky he wasn't fired, that is completely inappropriate.    I thought this was going to be a \"hey I sell X Y and Z, I'll leave the info in the breakroom\" kind of thing, but harassing customers and using his teller station as a shop? Absolutely not.\n\nIf he's normally a good employee, maybe the surgery thing is making him desperate, but he should have talked to you all about it rather than selling stuff in the bank.", "NTA.\n\nThis is a serious conflict of interest that Jim is doing. He seriously should be fired for that.\n\nIf I had a teller trying to sell me useless crap when all I'm trying to do is make a deposit into my account, yeah, I'd be complaining about it too... And even go to a different bank.", "NTA!!!\n\nHe is welcome to keep selling on the side, on his own time, in the evenings and at weekends. He's welcome to have his online shop for ebay. He is being wildly, obnoxiously outrageous to think he should be allowed to run a stall at the bank as well, wtaf.", "NTA, I would have complained to the bank that this guy is trying to sell me stuff, IMO you should have fired him", "NTA.\nThere’s nothing to prevent Jim from being an “eBay guy” on his own time. \nUpcoming surgeries, wedding expenses, house down payments, whatever, do not automatically grant one permission to work their side hustle on an employer’s dime, nor the customers’ time.", "Just when i think I can’t see any more of an insufferable entitled individual someone makes another post in this sub. \nNTA", "NTA This is completely inappropriate no matter where someone works! He can go back to selling on Ebay. Work is NOT the place for it.", "NTA. I empathize with his situation, but he is doing something that is against company policy. Your higher up also asked him to stop, you did nothing wrong.", "NTA! In fact he may need to report this to corporate for possible “conflict of interest.” \n\nI worked as a bank teller and we weren’t even allowed to to sell Mart Kay or our kids’ fundraising stuff from schools! \n\nHe’s lucky if he doesn’t get a write up over this.", "NTA. Soliciting for a personal business while being paid by another employer is a huge conflict of interest.", "NTA. Geez! I thought he just put out like a flyer or like a box of goodies to sell passively but hounding customers?! That’s no thanks from me. Thank you for saving your customers sanity.", "NTA- \n\nTo be honest- I’d be watching all accounts VERY closely. I know someone personally who worked in a bank and over several months stole almost a total of $50k out of customer accounts. She was eventually caught and charged. She had no criminal history prior to this and had a clean background check. \n\nNot saying he would do that necessarily but his reaction and insistence that he needs money for something desperately- I would be careful.", "NTA. If this happened to me you bet you butt your branch would have got a bad review and a call to any corporate number I could find.  Wildly inappropriate!", "Absolutely NTA.   That guy needs to keep his job and side-hustle separate.    Super Inappropriate behavior.", "NTA - he's paid by the company to promote the interests of the company while at work. He shouldn't get to moonlight selling his random stuff to people at his job. Completely unprofessional and I would stop going to places that allowed it.", "NTA - and let him go if he doesn't stop it.\n\nSeriously - that's a lovely way to drive off customers.   If he pulled that on me,  I'd verbally complain to the manager, and follow up with a letter (to the manager).  And if the manager blew me off, the letter would go to corporate.\n\nI won't speak to the legalities of it.  IANAL.  But it is absolutely unprofessional and it makes your bank look unprofessional also.", "NTA. You are trying to save his job, and if he does not comply with company policy and gets fired, then he for sure cannot pay for surgery.  He is not thinking, here.", "NTA - my goodness, that’s so inappropriate and honestly, if I was a customer coming in to make a deposit/withdrawal I’d be hella annoyed at him. No one goes to the bank thinking they’ll have to deal with someone as annoying as kiosk workers in the mall who try to sell skin creams.\n\nDude can open an Etsy shop and then while he’s at it, learn some damn manners and that there’s a time and place. If he needs money then common sense should kick in so he can realize that getting fired would make his money problems harder than they already are… goodness.", "NTA. This is not even a question. Jim is in the wrong and would be no matter what situation it is in.", "Holy hell!! I am literally doing an internship and it’s not even been a month and have total work experience of 2 months (it’s the cultural norm here to start working after graduation) and even I know that this is highly unprofessional and a fireable offence in most places. NTA OP AT ALL", "I avoid a branch of my bank because there is a lady there whose job it is to always sell insurance. I cant imagine selling me actual crap. I'd probably try to figure out some way of shaming him into realising how awful this is.   \n\nNTA and also thank you", "NTA you said it's against your company laws. If I go to my bank I don't want to be bothered by such a guy to buy random stuff.\n\nCollect any incoming complains from customers, inform HR. This is minimum a write up.", "NTA. That’s wildly inappropriate.", "NTA. Your customers did not sign up for this when they agreed to bank there.", "NTA. He knows the policy.", "NTA. It’s a bank not a flee market. If he does his job, great. His eBay stuff is for his own personal time.", "NTA you can't harass your employer's customers to buy crap on your employer's timr", "Definitely NTA. No one is saying he can’t sell stuff online, just don’t sell it while you’re working. I have an online store in addition to my day job, but would never pester people to purchase while at work. Not to mention, this sort of hounding could drive business away. Honestly, I think he’s just very immature and spoiled.", "NTA. Jim should be able to sell stuff at the bank because people are far more important than banks and honestly screw banks but you could lose your job if you did nothing so you can't be blamed.", "NTA\n\nIt’s highly unprofessional and a conflict to try and sell or promote your own business at work. \n\nIf he needs the money for surgery he should try a yard sale or something if he has so much inventory. \n\nI’m surprised he hasn’t been fired yet, in my opinion.", "NTA. If my anxiety ridden behind rode up to deposit some cash and I had to deal with someone trying to aggressively sell me something, I would close my account all the way down.", "NTA. It's against company policy.", "Very much NTA.\n\nI once had a job in a normal old office building. One of the other employees had a personal side business. There was nothing wrong with that. However, this employee was caught having packages delivered to the office that weren't just personal packages, but were for the side business. They were also spending time at work making phone calls related to the side business.\n\nAs soon as they were found out, they were let go immediately. Absolutely no hesitation whatsoever. They were gone before lunchtime.", "His behavior is wildly inappropriate.  NTA.", "nta", "NTA\n\nIf a teller did this I would report them. It’s inappropriate and could cost the bank business. His eBay job is for his own time and not to bank customers.", "OK, I'm really not trying to be mean or anything, but you've **been a bank manager for thirty years** and you had to ask a bunch of reddit gremlins if your teller could **operate a retail business through your bank window during his shift**?\n\nNot gonna lie, that feels like a redder flag than anything Jim's doing.", "NTA. He's trying to run his side-hustle on the clock. I'd be incredibly uncomfortable if I went into my bank and had a teller do this, and I'd be downright pissed if I was waiting in line while he tried to sell someone a phone case. He's totally out of line and most businesses would fire him for this. As a millennial manager who ran a side-business for years I would only give one warning and fire him if it happened again.\n\nI was honestly expecting this to be something like handing out a business card or mentioning to customers that he sold Tupperware.", "Very unprofessional. I cant believe this went on as long as it did", "NTA - this could easily get your bank in trouble.", "So easy NTA.\n\nIn fact, he deserves to be fired, both for obviously violating company policy and for his reaction when he was reprimanded.\n\nDon‘t fall for the guilt trip surgery thing. Guaranteed EBay guy will do this no matter what his circumstances. It’s not ok and if I was a bank customer, I’d complain about him.", "Completely NTA! This would be a red flag in any decent business.", "NTA\n\nThat is completely inappropriate and unprofessional. It should have been stopped the FIRST time and not something that any executives should have witnessed. He is lucky he has a job at all. Many places would have fired someone for that, especially being so angry when his conduct was addressed.", "So I'm pretty sure what Jim is doing is actually illegal. It's a misrepresentation of the products and services your company offer, and in the process you forcibly assume liability for whatever he sells. If he sells your customers a faulty product, during the normal course of his employment as a representative of your company, and during operation hours? You could be held liable for it instead of him.\n\nNTA. He's lucky you didn't fire him. If he wanted to sell stuff on the side while at work, he should have at least talked to you about it first. It's your place of business to do business at, not some communal marketplace for him to set up booths and list his junk.", "The bank looks bad when you allow this to go on", "NTA.  If he wants to not be poor due to unemployment, then he can sell his products elsewhere. I can't believe you even question yourself here.", "NTA.  The second he flew off the handle and started playing victim should have been the moment you told him his services would no longer be needed and that his final check would be mailed to him.", "NTA. This sounds like it could create a huge set of potential legal headaches. He's handling bank customers' money, but also \"his\" customers' money - and sometimes those are the same people. Yikes.", "NTA at all. Not only is this against policy at most places of employment, it’s harassing the customers or at least making them uncomfortable. \n\nFor your own info, my MIL does this as well. She has it set up as a legitimate business and pays taxes on it. She does it all online, and does not encourage people she knows to buy from her. It becomes shady when it’s not treated as a real job.", "NTA. If the teller tried to sell me anything that is my last day at that bank.", "NTA but why is this guy still employed? He has no concept of boundaries/work etiquette, and seems to have anger issues. As a customer, if I was subjected to this nonsense and he was still there next time I go cash a cheque, I'd be changing banks", ">Around Christmas time, he started selling random products he had at his teller station in the bank during his shift. Every customer that would come to his teller window would get a sales pitch for a painted Yeti cup, phone case, or whatever he had at the time. He would also hound people in the drive-thru about purchasing his items.\n\nTotally inappropriate. He's on company time, not his own time. \n\n>I told him he couldn’t do it anymore, and he lost it. He flew off the handle and accused us (bank management) of wanting him to stay poor. He said he has a surgery he needs desperately, and this was the only way he could get it.\n\nHe should be fired!\n\nNTA", "There’s a reason why side hustles are called that - they are meant to be in the side, separate to their dayjob.  This is so inappropriate and unprofessional. Not to mention it would put me off, as a customer, from frequenting that branch.\n\nI wouldn’t feel guilty about this one.  Anyway, if he’s such a big “eBay guy”, shouldn’t he just be selling this stuff there? \n\nHard NTA.", "So he finds it unbelievable that you are paying him while he is selling his own stuff? And you are wondering if he is right? \n\nGoodness, that's a firing offence in my company.  \n\nNTA.", "NTA, sounds like he'd do better as a mall sunglasses kiosk guy. Then he can hound people to his heart's content. Plus... being an ebay guy doesn't take THAT much time? Like he might have to downsize, but the nature of the game is that it can pretty much happen in the background and you can just get your extra cash picking things up, listing and shipping them in your free time. There's NO reason to bring it to your day job. I hope he's on some sort of probationary period that makes him easier to fire, because it sounds like he's going to be a recurring problem.", "Just because someone is upset, it doesn’t always mean that you’ve wronged them. Sometimes people get upset just because they’re not getting their way. Not getting their way isn’t causing them any actual harm, they just don’t like it. \n\nNTA. If he wants to sell stuff then he is more than free to do it on his own time. He can’t harass customers at work.", "NTA. I would find another bank branch if that happened to me. I want the least amount of interaction at a bank. It’s already stressful enough. It could be costing them business.", "Fire his ass", "NTA, it's completely inappropriate. I would be pissed if I went to the bank and the teller tried to pressure me to buy junk.", "you are 100% NTA for prohibiting this, its really just basic common sense and is totally reasonable grounds to be angry over and is something any competent manager of any kind of business would prohibit. \n\nhowever, is he a full time employee? and if so, why does he need to sell trinkets on the side to pay for a medical procedure? im not saying you are the asshole here, but if this guy is working full time and genuinely cannot pay for a medical procedure due to low wages and/or lack of employer provided insurance, then someone or some people in your company are 100% the asshole, and its not him.", "NTA. He could’ve cost your bank customers. I would’ve not wanted to do business with a bank that allowed this. He can get as mad as he wants (my grandma would’ve said he can just get glad again.).\n\nAlso, if he’s that desperate I’d be afraid he’d mishandle funds.", "Not the A.  I also run a company and I would never let any of my employees pull this shit with my clients,  sure if you have something on the side, keep it on the side.  Or find a new job!!!", "I would wonder if it could open your bank up to some kind of legal risk (IANAL!) but if someone buys something from a teller at your bank i can see someone making a case that they might think they were buying it from the bank and in some case sue you over it. (probably not the biggest risk but it seems plausible to me)", "NTA.  If that was my bank, I’d avoid him like the plague & probably change branches.  I go to my bank to do my banking & leave.  I do not have the time, nor the inclination, to entertain any sales pitch.", "NTA\n\nAs a bank customer, I would actively avoid him. No shame in having a side gig but hounding people at your real job about it is inappropriate.", "He uses eBay. He can literally list stuff on eBay in the morning and it'll do its thing while he's at work. It's very unprofessional what he's doing. \n\nNTA", "NTA This is a bank, this is incredibly unprofessional. Banks have to appear perfect, because banks operate on the fact their clients trust them with their money. If a bank starts to lose customer trust, then you get panic mass withdrawals. I wouldn't bank with the company anymore if I had that teller. I want complete confidence in how my money is being handled.", "NTA. Your compliance department would have a field day with this. And if there was some sort of dispute oh dear Lord.", "Genuinely surprised he hasn't been fired.\n\nNTA\n\nI understand his medical bills but still absolutely not and he should have checked with his boss.", "NTA, I wouldn't trust a banking establishment that was trying to sell me something as I was withdrawing money. That's like shoeshine in the 1940s shit.", "YTA,\n\nYou should be paying Jim more, & better benefits.  If Jim is having to run a side hustle at work in order to pay for a surgery then your bank doesn't pay enough.", "I work at a bank, our rules are so strict. I can't imagine why he hasn't been fired. Like this is so unprofessional, I couldn't imagine doing that at work", "Yeah that's a non negotiable. They purchase your labour exclusively. A side hustle needs to be on the side for that reason. \n\nThat he wasn't fired is testament to your niceness OP because I would avoid anywhere that ever happened to me. \n\nYou honestly might need to improve your feedback system if no one complained about this.", "WOW talk about entitled, fire his ass!", "NTA. OP, if a bank employee did this to me, I'd probably file a complaint. Plus, let's say someone buys something, then he's stuffing money in his pocket, right? This would just be a HUGE mess. I'm shocked this guy wasn't fired.", "This!!!", "I was expecting talking to co-workers about buying tamales from his wife, or gift wrap for his kids fundraiser. Normal things reasonable people try to get away with at work that are technically against policy.", "He already got the warning, and he \"flew off the handle\" instead of saying that he'd stop. It's time to fire him, IMO.", "Not OP, but assuming if this is in the US, even if the job comes with benefits, not every place has good benefits and even with insurance, depending on the surgery, there could still be a hefty out of pocket cost. Also, even though he says he needs it, without knowing exactly what it is, in reality it might be an elective surgery, which insurance may not cover at all.", "Even if the company provides no benefits, that’s not the customers fault. It’s so wildly inappropriate and rude to hound these poor people just looking to use their bank. It can also be considered taking advantage of people. Many of the people here that stuff go in-person to banks are elderly people who aren’t comfortable doing it online, and he’s hounding potentially vulnerable people. He should honestly be gone if he’s doing this just a few months into working there.", "OP doesn’t own the bank and doesn’t decide how much he gets paid. And no matter what, no matter how shitty the company is, that isn’t the fault of the customers and it’s vile of him to be hounding them and taking advantage of his position to target people. \n\nIf the job is shit, get a new one or complain to the company. You don’t take advantage of customers.", "Don't most banks have drive thru? All the ones I've known have.", "I'd probably give the bank one chance to fire the AH or otherwise make them stop before switching (because switching is a PITA) but if it didn't yeah that's worth leaving heh", "I don't want any bank employee hounding me for buying their stuff. It's absolutely unacceptable. This needs to be stopped and reported ASAP. NTA.", "I just had a brilliant (yet horrible it's necessary) idea... \"No Solicitation\" tshirts.", "She sounds absolutely insane! She demanded the next 4 months holiday pay?! What kind of mental gymnastics is that?? 🥴 did you ever get the equipment back? I hope you filed a police report against her and her husband for the threats at least.", "At this point, if she has not brought back that equipment, you could look into charging her with theft.", "I'm surprised it took so long to tell Jim what he is doing is wrong and against policy. That crap should've lasted about one day before \"pulling the plug\" on his selling. In fact, the upper management should've NEVER seen it. That's why you have policies so you don't have to think this through or second-guess.", "Same.  Banks rules are very strict.  I can't even read my personal email while signed in.", "His surgery isn’t actually the issue.  He wants it to be the issue.  It’s not.  You don’t work for one business and use the resources of that business (time, resources, customers) for a different business.  It doesn’t matter if aliens are invading the earth or he needs surgery - these are to be kept separate.  Focusing on what he “could” do is wrong - he is required to not do this while on duty at your bank.", "this year they changed the rules so that anyone who makes more than $600 on ebay sales gets taxed. I think it even gets taxed as though it were income. it sounds like he was caught with his pants down holding a bunch of junk and thought he could avoid the fees by selling in person. what a dingus.", "If I was a customer, I wouldn’t complain. I would never visit again or try to switch banks if necessary. If this happened multiple times to the same customer, the customer probably thinks management is complicit and would never want to bank there again.", "If he's blatantly selling stuff from his teller desk I would assume management is OK with it and not bother complaining. I've complained enough to bad managers to learn not to bother anymore (like when my plate of food comes smeared with an unrelated, dried on substance from the last customer and the manager tells me I'm being \"picky.\")", "And the funny thing is when I was a teller 20 years ago, we were told to push referrals like crazy. We were supposed to force our little old customers to talk to the investment guy or open new lines of credit or whatever product they were pushing then. I always felt bad giving a sales pitch to these customers who just wanted to, as you say, cash their check or make a deposit and go on their way. If they wanted a sales pitch, they could go to the local used car dealership.", "Your daughter is a very smart person. In your position I would make sure I very diligently recorded every aspect of your interaction, especially the parts where he was acting irrationally - this dude seems like the suing type, so it’s best to have all of your paperwork in order before it gets to that point.\n\nNTA and good luck!", "Or the little bars of Whitaker’s chocolate for kid’s school fundraisers", "Absolutely! Having an issue with that sort of thing would have got an asshole vote from me, but trying to run a business out of a teller window and kicking off when told not to… that’s some assholery right there, and not from OP.", "Yep. He should be gone.", "The goodwill pays some of their differently abled employees $0.22/hr", "As someone who WORKED there, and got to know the regulars, you’re wrong. They’re usually rich and using all their richy free time to browse around goodwill for treasure they can resell. But hey, what do I know? I’m just a former employee at goodwill lmfao", "Also read my comment correctly. I’m saying the rich people that do that are deplorable.", "[removed]", "Heck, I don’t have patience for the bank teller trying to tell me about banking services they offer. Lol. “Have you heard about our new overdraft servic….”. Nope, not interested.", "Hahaha, I know, right?", "I mean, anyone who walks into a bank and *doesn’t* think that the bank is selling you “products” is just not paying attention. Some banks are just more aggressive than others, at certain times of the year. The difference is, the bank has their offerings, and OP’s troublesome employee has his. And he thinks he is entitled to sell his at the bank. Which he is not.", "Username checks out lol. A dog would never.", "I figured you were going to say he was selling his daughter's girl scout cookies to his cubicle neighbors or something. What he is doing is 100% unacceptable. I would fire him- not for selling stuff, but for arguing with you about it.  NTA", "NTA, not only against policy, as a customer, I’d switch banks if someone was giving me a sales pitch as I was trying to put my hard earned money into the bank to pay my bills.", "NTA for stopping him but… soliciting to customers is a “first and final warning” style offense. The fact that this happened a second time and he wasn’t fired immediately means you should reflect on what you’re allowing to occur in the workplace.", "NO  NTA -\n\nI would be uncomfortable going to a bank teller who was selling \"ebay\" goods at the \"window\".\n\nI don't think Walmart would allow this.", "He was in the wrong. Working in a bank and trying to sell his own products to people is inappropriate. It's not related for one thing, and just wastes the customers time. \n\n\nAnd honestly even if it was a shop that sold that kind of thing, he still couldn't just sell his own things and pocket the money all for himself. He'd have to get the shop to agree to sell them, and either the shop would take a cut, or they'd buy them all at a bulk discount and sell them at a profit.", "No you are not the A-hole here. He is an employee. Work hours are work hours, not a promotional site for his little side business. That should be reserved for his personal time.\n\nApparently he doesn't understand that if he were allowed to so blatantly violate company policy, as the manager YOUR job would also be on the line if his actions were noticed by the company 'head hunters'.", "NTA. Check your company's policy regarding solicitation.  Most do not allow employees to sell or distribute things during the work day.  Many employees sell makeup (e.g. Avon or Mary Kay) and they are not allowed to distribute the catalogs on premises during the work day.   \nEmployees may purchase items from each other; or must be done after hours.", "Nta. He was breaking company policies surely.", "NTA  This is not something on the side of a desk that someone may choose to look at or ask about on breaks and lunches.  He is turning this into his own personal store.  I would switch banks if a teller tried to sell to me at my bank for a non bank item.   I dont even like it when you try to push your bank products on me if I don't ask.\n\nI would refer this to HR ASAP.", "NTA. Any company would reasonably fire someone who was trying to run their side hustle at work.", "why is he still an employee?", "NTA Jim breaks policy and does something that any reasonable person would see as inappropriate. Then when confronted he jumps right to the victim card. I would watch my back around this shyster, he is probably looking for an easy lawsuit too.", "NTA", "NTA", "NTA. Jim's not worried enough about being poor to put his job at risk. He'll be even more poor soon if he can't control himself.", "NTA. You're not keeping him from selling things elsewhere, just holding him to the same policy as everyone else by not allowing him to use the bank as a storefront.", "NTA. What Jim’s doing is really unprofessional. There’s a time and place for selling his eBay items and that is not during working hours.", "NTA & as a customer of YOUR bank.. I'd be pissed if I had to listen to him, give me a pitch", "NTA. He is using space the the bank PAYS for to hawk his wares!  You are a banking business, NOT a market.  He doesn’t pay for his teller stall. Do not engage in his excuses. Tell him it’s a hard stop or he walks out the door immediately.", "There is no question who the AH is here.  Did he read & sign the handbook?\n\nNO business would allow this behavior & rightfully so.  As a customer, I'd be pissed if someone were trying to sell me stuff like that.", "NTA, this is a clear violation of the rules. He can sell his things elsewhere, not at work.", "NTA it would be one thing if he had asked you if he could do it, but he didn’t, not only that, but he was hounding people, \nIf he had asked and you wanted to help him out, you might let him have a small table with a small plaque saying handmade local crafts or something in the lobby. \nBut to be hounding people without consulting his boss? That crosses a line", "NTA. The fact that he got so mad does not change this. Some people, including your employee, are wildly unreasonable and entitled and get mad over ridiculous things, so please don't let that influence you over any actual reasoned-out thought.", "Hell no! I was expecting this to be someone who was making their own jewellery or whatever and trying to sell it to colleagues. And in that case there might be a balance to be struck. But harassing customers is an absolute non-starter. NTA.", "NTA", "NTA.  He's opening the bank up to a shit-ton of liability because of what he is doing on bank property while he's on the clock.  And I guarantee you that you are going to lose customers.  Truth is that you should probably have fired his ass when he reacted the way that he did.  He won't stop, he'll just be more discreet about it.", "NTA very obviously. Fire him.", "NTA imagine if the cashier at Burger King tried to sell you Herbalife while you wait for your food.", "NTA and you’re being lenient, considering any other financial firm in America would consider this an OBI with a conflict of interest, fire him and mark up his U-4 so he doesn’t work in the financial industry anymore", "A lot of companies have this policy. I had to tell management about a gal who was trying to pitch her Mary Kay business to our customers. She kept it to interested coworkers after that. Which was really only one. She tried pushing the makeup on me, but I told her I don't support MLM businesses, even one as old as Mary Kay. Took her a few tries before she finally stopped. I don't care if you have a side hustle, I do too. I just don't want to be bombarded with it every time I work with you, especially since it's against company policy in the first place!", "NTA honestly he is lucky he was not fired on the spot", "You are NTA. It's sad that a FT employee doesn't have good enough insurance to pay for a non-elective surgery though.", "NTA  It's totally inappropriate to use working in a bank to flog second hand stuff to customers. No company would let your do that.", "NTA, best case scenario it's wildly inappropriate. Worst case scenario it opens up liability against the bank as a business since a retailer can be held liable for selling dangerous or defective goods, which is what's happening on company property on company time to your regular customers.", "NTA.\n\nIt’s against company policy, which is business.  He’s taking it and making it personal.\nIf one has to resort to hawking things in person and putting their source of steady income at risk, quite possibly a better way to save money is to stop buying things.", "NTA  I would be so pissed if I was a customer.  If I wanted to buy someone's shit off ebay in person I'd go to a garage sale.  I don't have time for that nonsense when I go to the bank.", "NTA. And BTW I used to work for someone who was on the BOD for a local business bank in my area, and their benefits were outstanding. If \"Jim\" really needs a medically necessary surgery, I don't know why his health insurance benefit wouldn't cover it. (Maybe I'm being naïve here; not sure if your bank has a PPO or an HMO option).", "NTA\n He's guilt tripping you to make you feel bad even if this surgery is true. And you said 30s? He shouldn't be throwing a tantrum. IMO NTA", "NYA 1000x\n\nIf I was a bank customer, I’d have already raised hell about this. I am already so sick of people trying to constantly upsell me already.", "NTA.  I would change banks if this happened to me at my bank; you've saved your bank from losing customers.  Why wasn't this man fired?  (Also, why isn't this bank providing its employees with health insurance so employees can get needed surgery?)", "NTA But you would be the AH if you didn’t fire this man. He’s outrageously abusing his position, annoying the customers and potentially making the bank liable if someone had an issue with something or was harmed they bought from the huckster teller when he was in duty.", "NTA. Honestly you’d be an asshole if you don’t confront him and put an end to his behavior immediately. As the manager, it’s your responsibility to ensure your other employees and customers aren’t pressured into buying shit they don’t need.", "NTA", "oh my god if i went to my bank to deposit money and they kept me there for who know how long trying to sell me junk, i’d be SO pissed. you are absolutely NTA", "NTA You probably saved him from getting fired.", "NTA. Just because someone gets angry, it doesn't mean that they are justified in their feelings. In fact, many times when people are their angriest, it's because they know they are in the wrong. He is an employee, and there are policies in place, so he can just go back to his station and do his work or find another job. If he thinks he's poor now, imagine how tough it's going to be to afford surgery without a job.", "NTA. What he did was a conflict of interest and as you stated is against company policy. It is against most companies' policy. It would be one thing if for instance he made salsa and he brought a free sample jar into the office break area for staff to try and told folks to email/text him if they wanted to buy some outside work I can kinda see that one sliding, but actively selling items to bank customers yikes no. What if the customer felt pressured into buying said items thinking they couldn't get their own money unless they told him yes. I am no lawyer but I just feel like that is trouble waiting to happen.", "NTA, it is completely inappropriate and is likely to drive your clients away if you allow it to keep happening. \n\nHe's quite fortunate that you didn't fire him after his reaction to being told to stop, that is not normal.", "\"It's also completely against our company policy\"\n\nNo more words. NTA", "It's side hustle etiquette to not be working your side hustle during paid hours at another job. I also sell stuff on ebay and craigslist to make an extra buck here and there, and the most I would ever do during business hours at my real job is respond to an email inquiry in downtime that I use to scroll reddit anyways. I have offered to let someone pick up an item I was selling locally during my lunchbreak, but even that felt like a breach of etiquette somehow and I'm glad he chose a different time so I didn't need to feel conflicted.\n\nIt's bad enough when a cashier tries to upsell me on candy. I definitely don't want that at the bank. NTA. This guy needs a stern talking to from management, and to have repercussions if he doesn't stop.", "NTA But you have to contact HR to give him a formal written warning about breaking bank policies, making clear that he can't work for another companies or perform business activities in his working hours and using bank installations or resources.", "NTA and you NEED TO FIRE THIS GUY. Someone that desperate for money should not be trusted to handle customers' bank accounts.", "Nta, he can work his other. Job when he isn't working at the bank. It's not appropriate what he's doing and honestly I would switch banks if my teller was pressuring me to buy something.", "NTA.\n\nOh my god, reading the title is was going to be like trying to sell some stuff to coworkers that they make and then list on Etsy or something.\n\nBut pitching to *customers,* while he's *working?!* And random junk no less.\n\nHe should be thankful he was only told to stop.  Dude is lucky he wasn't fired on the spot.", "NTA", "Unless you're letting ALL the employees break the rules like this, YTA for letting this happen even once.", "NTA, fire Jim", "NTA", "NTA.. he's lucky he still has a job. If you did that where I work, you'd get fired instantly..", "You should’ve sacked him.", "NTA\n\nNo business would allow him to do this", "NTA\n\nI'm surprised he still has a job to be honest.  I figured that would be an offense worthy of being fired.", "NTA - You are paying him for a job, and he is using said job for his side gig perfect example of why the companies have a policy against this.  Now if this was during his lunch time, or when he was not working (And not on bank property) you all would be TA for stopping him, but it is during working hours.", "Don't even worry about it.  The higher-uppers have told him the policy and it is up to them to enforce it.  As a customer, I would be FURIOUS!", "Nta", "NTA. It is inappropriate, and like you said, it's against company policy. He can make a tik tok or youtube channel to push his store just like all the etsy stores do.", "Oh wow, NTA at all! I can't believe he thinks this is at all appropriate. I'd quit coming into the bank if I knew I was going to get hit with a spiel selling a bunch of crap I don't want or need when I'm just trying to do my banking.", "ESH. He’s violating policy and you’re willfully allowing it as his manager. If you permit it, you promote it. I would recommend stopping it immediately or you both may be looking for a job.", "NTA.\n\nJim was a by-the-book AH. He misused company time and customer relationships to moonlight for another business (in this case, his own). When confronted, he acted like a complete AH and made your decision to call out his behavior totally warranted.\n\nIf he had approached his side hustle more casually and tactfully, with the reasoning behind it, I can understand maybe some leeway. But based on how he acted, I would put him on a PIP and fire him if he did it again.\n\nJim sounds like a problem employee who may try to sue due to an illness(?) that necessitates the surgery. Tread carefully, but you were right to discipline him and tell him to stop moonlighting on company time. I would document any and all future instances of this.", "NTA.  I personally would take my business elsewhere if this was happening at my bank.  If he is so desperate for money, he can side hustle like the rest of us do....after hours.", "NTA, what he's doing is not appropriate at all and since it's against company policy, you would be well within your rights to terminate him if you chose to go that far. If I was a customer in your bank and an employee approached me to try and sell me something, I would be pissed and report them to the manager. What he is doing can be considered harassment.", "OP=NTA\n\nThis should have been stopped the first day.  \n\nYou will be the A-H to your customers/clients if you don't stop this.  I thought this was going to be Avon in the office(selling to coworkers) and yes, that's not acceptable to ME either.  But this is literally pushing his business on your customers and WILL impact the Bank's business.", "Totally NTA. That’s just absurd! It’s a BANK. Not “Jim’s Emporium for Weird and Whacky Crap”!", "NTA for telling him to stop, but I am surprised you don't seem to understand the gravity of this situation. \n\nWhat he was doing is so *incredibly* inappropriate, you should have put an immediate stop to it before anyone else had a chance to see it happen. If your management knew you were aware of this before they said something to you, that would have been grounds for them to take disciplinary action against *you* for allowing such a gross policy violation, not to mention a violation of your customer's trust.\n\nThis isn't up to you. It's against company policy. Your leadership is upset. Your customers are definitely unhappy. This isn't \"you doing the right thing\" this is you doing your job. And if you allowed it to continue, you could both lose your jobs. \n\nDo your job as a manager, shut him down over the outbursts, let him know that the way your bank can support him is to continue to employ him, provided he can behave himself in the workplace and no longer break policy or throw tantrums. Anything beyond that is for him to work out elsewhere.\n\nFrankly this man does not seem to have the right mindset to be a bank teller. He should be entirely focused on customers, and their security and privacy. I guarantee he has already cost you business, either customers moving more of their funds to other banks where they have better trust, or closing accounts entirely. This is so far over the line.", "NTA - even in Europe you’d be sacked immediately if you sold your stuff at work to customers (fireable offense 1) and went off after a warning from manager (#2 and it’s gone).", "NTA.", "NTA. Completely unprofessional in a work environment, especially a bank.\n\nIf I went to a bank for some sort of transaction reason, and I get to his til and he’s standing there peddling goods and not really getting on with what I want done (after (at times) having to wait in a substantial queue), I would absolutely start going to a different branch of the bank.\n\nEven if it meant having to travel a bit further.\n\nCompletely unprofessional.", "A teller at the bank pushing Yeti cups?\n\nThis is surreal, in a very entertaining way.", "NTA- He is wildly inappropriate both selling products at work and for his reaction. I also have a my own business where I sell products I make, and while my coworkers know what I sell I do not hound them nor do I ask my Job A customers to buy from my Job B business. I have had coworkers buy from my business I have never pressured any of them. I would also NEVER ask my Job A customers to buy from me. That's actually grounds for termination.", "NTA. If I went to my bank and the teller was trying to sell me some crap, I’d rethink using them as a bank. It’s tacky and unprofessional.", "NTA", "NTA. This is sooo inappropriate and might even be illegal (if something happens to one of these products, the bank may be held liable since the customer bought it at the bank from someone working for the bank at the time). I can't imagine being a customer, going into my bank branch for a quick issue and then having to deal with this. Not to mention, it'll slow down the lines and people will be waiting longer.", "NTA. In my country post offices does this (sort of). They have business partners and people working for post offices were forced to sell this stuff (toys, books, coloring books, but also some banking and insurance services). There was a big scandal because they (used to) have quotas on how much they have to sell especially banking/insurance, they ended up selling it to themselves and their own families. There were many people quitting the job because of it. Point being nobody was buying theese products there , because you know, that's not what you gonna do at post office! And the pushing was annoying as hell. They still sell the stuff but they don't push it anymore. NTA.", "NTA. Wildly unprofessional and you are going to lose customers.", "Most major corporations have a very strict non- soliciting policy for employees. If caught soliciting on the job or on the employer’s property, that could be grounds for dismissal.", "NTA", "Why wasn't he fired?\n\nNTA\n\nPeople going to a bank don't want to have some door visiting salesman pushing shit on them at the bank teller window, why is that even tolerated???", "NTA, not even in the slightest, how have you not fired him already? I can only think of one situation he should sell anything and that wouldn't be something he nor the bank profits on.", "NTA. He was taking time away from the bank to pressure customers to buy his stuff. It’s a waste of the bank’s time and the customer’s time, and I’m sure he made people uncomfortable.", "I thought this was gonna be some Avon lady business in the break room haha NTA", "This!\n\nAND he needs to be reminded that if he needs to pay for surgery he's about to lose his only other way of paying for it!", "Not only that, Ops superiors saw what he was doing, he could be in trouble for not managing his employees well, and it could expose the bank to all sorts of liability.", "Totally agree. You're NTA here. When you represent a company or government entity, you don't peddle side projects while representing them. If he was hounding customers to buy his personal products when they came in to do business at the bank, that was WILDLY inappropriate. I'm a criminal attorney for the state where I live in the US. I don't offer people outside legal work, especially not while working! But we literally have to sign something saying this is our only source of employment/income to prohibit exactly this. \n\nAdditionally, if I came to the bank to do business (withdrawal, deposit, mortgage payment, etc.) and I got a high pressure sales pitch from the teller, I would seriously consider not doing business with the bank anymore. Also, Jim's reaction was so unprofessional and he really owes you an apology.", "Can this be real? I just can't imagine any financial institution allowing an employee to remain after doing this once. Banks are governed by incredibly strict federal regulations. Perhaps a very lenient manager might give an initial warning rather than immediate termination, but I would think any subsequent instance of the behavior or pushback on the warning would  result in prompt dismissal. (Even in \\[most\\] industries w/far less stringent oversight, this behavior is completely beyond anything resembling professional norms.) I'm shocked that there's a financial organization out there where this would not be the case...", "Don’t forget..this is some guy that’s looking at your bank account of money and then trying to sell you stuff…\n\nHe is also complaining about money issues and being poor while again..having access to customers funds, that’s a huge red flag in the financial world..", ">I was shocked, and found this wildly inappropriate.\n\nHOLY F NUGGETS! Inappropriate indeed. Definitely would have fired him immediately. NTA.", "I'd also be concerned about going to a bank and having someone try to hawk ebay junk at me. Not only am I not there to buy things, I'd be worried about someone who thinks that is appropriate having any sort of access or knowledge on my account. If I were a customer I would have absolutely complained, and I sell things on ebay all the time. I would never try to get people to buy my stuff.", "I was also immediately like, “Ah, MLM bullshit in the break room.” Not a “Hey, wanna buy a watch?” pitch to clients. What on earth. How has he not been fired? Especially if it’s happened multiple times??", "They shouldn't be selling things below market value then. How is it deplorable? Do you get mad at every single store lmao", "Okay, everyone commenting under mine, are y’all the richies that do this?", "\n>I don't like it when my Credit Union wants to sell me on the very *reasonable* services they *actually* offer.\n\nAs a former credit union employee in charge of training employees to sell this stuff, I 100% agree. I knew our products were mostly good products, knew they were a good value as opposed to other financial institutions' products, and I still felt bad offering sales tips to employees. If I'd been asked to buy an overstocked yeti cup from Ollie's while I was trying to deposit a check? I'm running.", "NTA- The bank is the one public place I don't have to worry about people selling me crap I don't need. I'd be furious. (Unless it's Girl Scout Cookies. Give me all the cookies)", "Straight Up, one single time. \n\n\\-\"would you like to buy this yeti cup, would you would you would you\"? \n\n\\-\"empty and close all my accounts plz\"", "100% agree. It would feel like Jim saw my bank balance and decided I have enough money to buy his crap. What an enormous violation of my privacy, misuse of my information, and creepy overstep of my boundaries. \n\nI would fire an employee the FIRST time I saw this. No second chance. This is egregious and someone whose judgement is this poor has proven himself unqualified to work in a bank.", ">I don't like it when my Credit Union wants to sell me on the very reasonable services they actually offer.\n\nLOL.  No kidding.  I upgraded my checking account and the bank manager said, \"I can get you a flashy new debit card now.\"\n\nI said, \"Do I look flashy to you?\"", "Came here to say the same thing basically. It's annoying when I go to the bank for quarters and the teller tries to sign me up for a credit card or whatever (I know, corporate makes them, it's not their fault, I'm never rude about it, all I'm saying is I *don't like it*), but if I went to the bank and the teller started trying to sell me random shit that had nothing to do with the bank he worked for, *hell* no, I'd make a complaint and avoid that branch at all costs unless I knew he was either fired or forced to stop.\n\nReminds me of the time this one stylist I used to go to all the time started telling me she had her own line of cosmetics, and started convincing me to buy some while I was in the chair, hair still wet and everything, and she *angrily* blow dried my hair after I politely refused to buy anything. She still insisted on giving me samples, I never used them and never went back to her.", "Also, if he sells something that ends up malfunctioning and the customer ends up injured, the bank may be held liable, if it was sold on their property by someone representing their business", ">he’s also hounding customers who are just coming in for deposits/withdrawals, not looking to be sold to like a retail store.\n\nI don't even like being \"sold to\" in a retail store, I always politely tell them I'm just looking even if I'm on a quest for something specific.\n\nFor a bank though? Where I'm trusting this person with my personal identifying information and literally all of my money? This sales pitch would make me lose any trust in their ability to handle my private information. While there are definitely honest and trustworthy 'ebay guys' ... there are also shady dudes doing shady things. Maybe I'm biased because I've had my cc info stolen from an ebay seller though.", "Passive sales only, no trying to talk people into it or upselling, preferably things for a local charity, like xmas ornaments made by local blind people, profits to help homeless, something like that, put on a nice prominent display.", "I'm jumping on this comment.  Agree I would have gone to a manager, reported it, closed my account, and found a new bank.\n\nUnprofessional and conflict of interest. I dont go to a bank to get \"sold\" stuff.\n\nNTA", "Same and I can't believe they've seen him do this more than once without him being fired. We're not even supposed to sell girl scout cookies to our coworkers and this guy is hounding actual customers??", "Me too!  I thought this was going to be a Girl Scout Cookies / Mary Kay / MLM thing.   But this dude is trying to have like a yard sale at his teller desk!?!  WTF  How in the world does anyone think this is appropriate?", "Yeah this dudes blown his income on a failed hustle, and is now probably desperate to get anything he can for his ever-growing inventory of Ebay shit", "report it higher. it has the potential to be huge issue if the customer believes its the bank that is selling not him", "Considering he is now working for you and apparently desperate for money, id say someone can't make a living at it.", "I’m talking about rich people taking the lower priced items and reselling them at a higher price, while lower income people who actually need it at the lowered price go without. Jesus read people", "No they don't. Never seen that.", "I've never heard of it. I live in Europe though. So it must a U.S. thing", "A manager with 30 years experience is here asking if she's an asshole for telling him not to sling his ebay shit at his teller window? Like I'm completely gobsmacked.", "I'm not fully up to speed on the regulatory rules regarding banks, but I believe it is more than just company rules. I think there are regulatory laws in place about conflicts of interest like this; and owners of banks and managers could be held liable for breaking regulatory rules.", "He’s also using his presence in the bank to lend authority/legitimacy to his products.\n\nEven if he tells people, people are still going to view any sort of purchase that happens in a bank from someone employed by the bank while they are working as a transaction with their bank. I bet something will break and a customer will blame the bank/demand their money back from the bank.\n\nPlus, are all these transactions virtual? Or is he handling personal money while at the window? Because that’s not ok, he’s gonna be like “Oh no, I accidentally put my own $20 in the till, I just need it back, oops, I just need personal change, blah blah”.", "Actually that $600 rule was ebay's reporting threshold. (and all other resale platforms and payment processors such as PayPal and venmo)  Meaning if someone made over $600 ebay was required to report that income to the IRS. It was previously over $20k. That actually has nothing to do with resellers paying taxes. Any income that you make is taxable and he should have been paying taxes on it all along.", "I call BS that rich people are buying up every single item in the store that poor people can't get anything. If you're selling something to the public you're selling it to the public.", "So weird. I can only think of one that I have been to that didn't have a drive-thru, but I assumed it was the location in the heart of town and lack of space to do so. \n\nHere in the upper Midwest it's the norm.", "Absolutely, and no offense to OP, but she is a manager with 30 years experience, and she is here asking if she's an asshole for telling him to stop? Ma'am. \n\nHe should have been fired the 2nd time he did this, after being told in no uncertain terms to stop the first time.", "I know.  I’m a Costco girl through and through, and told them if they talked to me ONE MORE TIME about an executive membership at the register, I was quitting.\n\nThey put an orange dot on the back of my card, which means DON’T ANNOY ME about the stupid EM, but not every employee has gotten the memo.  As soon as someone scans my card and hands it back, I stick it in their face and tell them ’the orange dot means STOP TALKING!’.\n\nI’m starting to think it’s trigger for me, lol.", "Yup.  That jumped out at me, too.  It's a total no-brainer.", "Yup.  Right you are.", "Right - it’s a liability for the bank.", "Knew it had to be a Murica thing.", "Dude should have been fired the FIRST time. I’d bet there are very explicit policies on that kind of thing", "Thank you for writing about this. I want that dot on mine", "There's a woman at my local Tractor Supply who, in addition to being hardworking and efficient, never forgets to bring up add ons but somehow manages to do so without adding any time or aggravation to my checkout experience. I messaged customer service that they need to do whatever it takes to keep her happy there.", "They usually have suckers for the kids and dog treats  for furry friends if they notice them, they'll send them through the chute with your receipt. Heh.", "Suddenly we are going to  have a shortage of orange markers in stores after this post", "Can’t speak for the banking industry but I work in the finance industry and this would violate so many regulations that he’d get sanctioned by FINRA and lose his licenses. The firm would also get fined for allowing it to happen.", "NTA he needs to do that shit on his own time", "NTA he needs to be fired ASAP or at the very minimum given a final warning, this is a major lawsuit waiting to happen against your bank.", "NTA\n\nId frankly be pissed if some shmoe was trying to sell me a painted yeti cup while im trying to do my banking. \n\nHes lucky he wasnt fired on the spot.", "NTA.  I would not do business with a company that allowed it's personnel to hassle me about purchasing their own products.  Jim needs to go back to being an eBay guy.  Jim also needs anger management and I wouldn't expose my customers to him knowing that.", "NTA. It's against company policy! End of story. This can affect your job security or promotion chances by allowing it.\n\nTell him there has been customer complaints and if he doesn't stop, you'll have to write him up and possibly fire him. \n\nTell him ebay is his platform. Not the bank!", "NTA\n\nHe's been hired, presumably, to be a teller. I also presume that it is understood--or even explicitly stated somewhere--that selling cheap ass tchotchke on the side isn't part of his job duties. \n\nI would explain to 'Jim' that this is a place of business, that he's hired to do his job--which means selling his shit on his time not the bank's, and if he disagrees, he's welcome to find employment elsewhere. \n\nYou're the boss. Be the boss.", "NTA at ALL! I'm an ebay reseller and have a full time job. The two don't mix. I check my messages on breaks and that's it.\n\nAs a bank user. I would be so annoyed getting sold to while trying to conduct bank business.", "That is a whole new level of \"would you like an apple pie with that?\" Definitely NTA, that guy should be fired immediately.", "NTA you did do the right thing. Imagine if he were doing this at a place that was a store and not a bank. if he keeps it up, write him up.", "NTA. If I were one of the bank's customers and I got his \"sales pitch\" while just trying to make a withdraw I would be sending nasty emails and making major complaints to management.", "NTA You & the other employees all know the policy & if you don't enforce the policy, you could lose your job. The rules/policy are that for a reason. I know I would not be pleased to have to deal with a bank employee trying to sell me goods when I was trying to do my business. I don't know about other countries but in US that is a good way to lose business.", "Umm tbh I think YTA to your customers for not shutting this down immediately, the first time anybody heard anything of it. The fact it took him doing it in front of lead executives for you to finally tell him he can't do it anymore was honestly so inappropriate, and I hope for your company's sake that those lead executives don't support you in moving up in the company when you let this happen under your nose!\n\nAnd the fact that you had to come to reddit to check if someone attempting to conduct private business from a bank teller window where he has loads of private financial information of the person he's talking to is doing anything wrong... as a bank manager? Dude YTA SO MUCH to your customers my god tell us which bank you run so we can all take our business elsewhere! (This is an exaggeration/joke but that is how serious I do think your assholery to your customers is right now. How on earth did you make it to management if you weren't comfortable enforcing corporate policy whether or not you understood it, and if you weren't able to automatically know the issue here. Like I'm pretty sure this is probably *illegal* in some way, nevermind the rest.)", "NTA. I respect his hustle, but it is literally your job to stop him from doing this at work.", "Nooo, you're NTA.  He is a total A-hole.  That's a ginormous conflict of interest, and frankly, he's lucky he's not been fired.", "The real question is what kind of bank has a drive-thru?", "Honestly, I would have probably fired him.", "NTA. My MIL worked for a bank for 30 years. She started selling some sort of MLM scheme on the side (I don’t remember which one now). She got fired for selling to her coworkers (not customers) because it broke company policy.", "NTA... wow...this is an HR nightmare.    It is necessary you stop him.  He will ruin the business you have.", "NTA, I sell things on ebay and makes things to sell on etsy and would NEVER imagine using my job as a platform for selling my stuff to customers coming in through the door. I may bring in an item or two when I sell something to print off a shipping label or use a box from work (which my bosses know about and have no problem with) but never to that extent. That is just insane.", "NTA OMG Your teller is so unprofessional.", "NTA - That's blatantly unacceptable for virtually every job.", "NTA - he is violating company policy by pimping his products.  You enforced that policy.  If he can't abide by the terms of his employment, then he shouldn't work there.", "NTA What makes him think he can hound customers to buy things from him when going to a bank?! How many customers have avoided coming in because of him? That’s ridiculous! He wants to circumvent eBay fees by selling direct he can do it on his own time, that’s embarrassing!", "NTA \n\nthis was inappropriate and really annoying for customers. \n\nso he got angry, too bad, he also needs to control his temper.  If he isn’t happy with the employment terms and conditions, he can choose to leave.", "NTA.  Most businesses consider this a conflict of interest and depending on the severity, it can range from being a verbal warning to termination of employment (Usually the latter requires something like poaching customers that would otherwise be utilising  the business itself, admittedly).  That is not taking into account that he is also giving the company a bad name by hawking his own wares when someone is there for their own business.\n\nComing from someone with managerial experience, it may be in your best interests to start disciplinary proceedings.", "NTA. Sack him", "NTA he'll be poorer when he gets fired", "NTA.  I buy things and resell them on e-bay, and I've been doing it for years.  I can't imagine why this guy thought that selling things at work to people who need you to do a transaction for them is acceptable.", "NTA. He shouldn’t be selling products to employees or customers. Bad form in his part. Give him a 30 day probation notice.", "NTA.  It might have been negligible if he kept it just between coworkers, but pitching to clients of the business unsolicited is definitely crossing a big red line.  Your company, I take it, is not in the business of providing employees a brick-and-mortar location to sell their Etsy crafts, right?  That's not their responsibility as a business and it's his responsibility as an employee on their payroll to conduct himself in a manner consistent with company protocol while on the clock or on-location, which would logically include not making customers uncomfortable by making them make decisions they didn't go there to make.\n\nHe's welcome to pitch his stuff to the public on Etsy and possibly at community events just like everybody else, but being an employee of your company should not entitle him to impose on customers for his side hustle.", "NTA\nOmg at first I thought you meant he was selling stuff to employees in the break room but then I saw he’s trying to get clients to buy while he’s working??? Definitely NTA I would expect most companies to do a formal write up if not terminate employment.", "NTA  \n\n\nHe's lucky your boss's boss's boss didn't didn't fire him on the spot.\n\n  \nWhen he's dealing with a customer at work he's being paid to be the face of the bank.  \nTaking advantage of that interaction to conduct his own sales is \\*wildly inappropriate.", "NTA.\n\nStopping him from selling is the most benign thing for you to have done. Outright firing him would have been what happens under other managers. Document and report to HR.", "NTA - Most businesses have a do not compete clause.  He's being paid to work at a bank not to sell side products.  How much of his side business was taking away from his job at hand and being put onto co workers?  Plus customers are going there to do banking business not get a personlized sales pitch for side products totally unrelated to banking.  It's a form of harassment.\n\nKind of different but my manager use to sell avon in my old department A co worker slipped payment under door and informed me what it was because I was the secretary.  It turned into this huge ordeal because my manager said she didn't see it in her office.  They started screaming and yelling I along with several other supervisors had to make statements to the Director and our Director pulled the plug on her selling Avon at work.  It was a very hostile situation for awhile.\n\nYou did the right thing but he should have been fired for his outburst like that.  Like wtf!", "Oh god definitely NTA!!!! It’s annoying enough when coworkers try to pull that crap, but this dude was literally trying to sell CUSTOMERS his bullshit while he was on the clock?! I can empathize with him needing to pay for a surgery, I’ve definitely been in that boat myself.  But no, that’s absolutely not the only way he could have tried to raise money. He’s lucky he still has a job.", "Next thing you know you're buying ice cream and the guy asks you about your car's extended warranty.\n\nInfo, drive through at a bank? Please explain I've never heard of this before", "NTA.\n\nHe should be instantly fired. Follow your reporting protocols for this btw. You may need to fire him still and have security escort him out. \n\nKeeping him on after this is extremely nice. I'd double check with higher ups too, as they may still want him gone.\n\nThis isn't going into the break room like hey my kid is selling girl guide cookies, anyone want. (which is still banned in some workplaces) This is using your customers as a captive audience. \n\nWhen I worked for a bank he would have been fired on the spot. When I worked at McDonald's he'd be yelled at and fired as soon as rush ended. This is WAY out of line.", "NTA.\n\nWhen I go to the bank, I go to do bank things. I absolutely do not wish to experience an in-person hard sell for random crap from the teller.\n\nThe real asshole here is America's for-profit healthcare model, that makes Jim desperate and unable to afford the care he needs. And possibly your employer (the bank) if they offer shoddy or non-existent health insurance.", "NTA when people come to the bank they don't expect someone trying to sell them a mug. His behaviour is outrageous. He doesn't get to run his business in his employer's time. And customers won't appreciate the longer wait either. It's not appropriate to \"lose it\" on your managers either when they call out unacceptable behaviour.", "NTAH. Straight to jail.", "NTA. If I went to my bank and the teller tried to sell me something - I'd never go in again!  \nHe's trying to sell me something while he has access to all my financial information? I absolutely do not think so.", "NTA!!!! There’s is literally no company you could sling goods at while working unless it’s retail and your directly selling that product.", "YTA only for not stopping it sooner and thus having your customers endure through that nonsense.", "NTA. I don't want somebody trying to coerce me into buying random crap when I go to the bank. And I don't want all the people in front of me in line dealing with that either because that's not what anyone's there for and nobody has time for that crap.\n\nAnd regardless of anybody else's feelings, the high level management didn't like it so you had to make him stop. Plus the internet has to be a more efficient method of selling these items.", "NTA - There’s a time and place to pitch. At work isn’t one of them.", "NTA, I work for a cellphone company and thought about doing this but it’s just wildly unprofessional. He can meet them in the parking lot during his break or after hours.", "NTA. If someone went wrong or someone got sick or injured from a product he sold there, the bank could be liable too.", "… bank drive-thrus are really a thing?", "NTA that’s not appropriate he’s there to do a job for his company he can run his side business on his time", "NTA oh my god thank you. I would not want to deal with that as a customer at the bank!!", "NTA!!!!!! As a bank CEO’s daughter and a customer at the same bank I would be horrified if one of the tellers tried to sell me something. I would definitely take this to a higher up ASAP. It would be different if he was using company time to get online every once in a while to sell his crap on eBay(still probably a fireable offense) but to actually harass customers is absurd!!", "It's pretty much standard in any employment contract that I have seen to exclude other forms of work when employed by the company. You can probably just confirm this with HR.\n\nI'm amazed that none of the customers have made a complaint yet, and it's definitely damaging the reputation of the bank.\n\nNTA.\n\n&#x200B;\n\nEdit: agreed with others, no way a manager of 30 years in a bank wouldn't know this stuff. This has to be fake.\n\n# I checked poster's history- no way he is a 59YO bank manager.", "NTA - He's making customers uncomfortable. He's violating company policy. Write him up.", "If your employee can't survive, your banks the asshole. Not you, but you represent them. If they are having to ebay shit to get a surgery then your bank is failing at caring for its employees. You should stop him, cause it's not good to have him sell to bank customers, but need to step up and get him a raise or get the health plan your bank has set up put in an override and get the surgery covered. If you don't step up, YTA", "I guess NTA but how the fuck do you have 30 years experience in management and not consider an employee using this job to sell things to your customers, thereby bothering them and hurting the bank as a whole? I kind of want to give you a Y T A just for having 30 years experience and still asking this question.\n\nTo any functional adult, that is an obvious no no.", "No matter what industry it takes place in, massive conflict of interest.\n\nOP should have put a stop to it the first time they saw it happen.", "They weren't asking if it was legal, they were asking if they were an asshole. When someone tries hard enough to make you feel like an asshole, whether you really are or not, sometimes you start wondering if they're right.", "Or stinking up the place with her scented oil diffuser", "Should you have someone so desperate for money working at a bank?", "He probably doesn’t want to do eBay anymore because eBay now gives 1099 forms for even just $600 of sales per year when it used to be that you had to sell much more for them to do that. I don’t know a lot about the details as I am not a reseller, but I have a friend who is and said that within their online groups about reselling people are complaining about the new eBay / tax rules and trying to find alternatives of where to sell stuff. Doesn’t excuse what he’s doing as he shouldn’t be trying to essentially work a second job simultaneously while doing his main job and if this is the case then it makes him even more sleazy so you’re still NTA.\n\nAlso I just wanted to add that when I first saw your title I fully expected him to be shilling an MLM haha", "A watch would've been a nice change from what I read. But a phone case or a painted Yeti cup..? I can't imagine what I'd do as a client if the bank teller offered me to buy something LOL. Probably would be shocked and definitely avoid the bank afterwards!", "I used to sell things on eBay as a side hustle/hobby.  Jim isn't really selling things on eBay if he's selling them off their site.  In order to sell on eBay you have to list the item on their site and pay eBay a portion of the proceeds.  If an item is already listed on eBay, you still have to pay a portion of listing price if you remove the item and sell it to someone else and if you do that very many times they will ban your account.", "And what changed your opinion on that?", "Info: Honest question, who do you have 30 years experience in management and even question the obvious fact that an employee cannot run their business on company time while you are paying them?\n\nThat might come off rude and I'm sorry, but I'm seriously baffled to your reasoning that led to any doubts that aren't illogical to any functional adult with any kind of work history.", "Every bank I know has a drive-thru ATM, are drive-thru tellers a real thing???", "Girl Scout cookies, too. I don’t want to be guilted or shamed into buying overpriced calories I actively don’t need by some winsome moppet with sad puppy eyes set to attack every customer near the grocery store door.", ">It would feel like Jim saw my bank balance and decided I have enough money to buy his crap. \n\nYeah, immediately fired and then refer to the SEC to monitor possible issues in the future. Just sketch as hell.", "Holy crap, you must want to buy a shitload of yeti cups!", "\"It has holographic velociraptors on it.\"\n\n\"Sold\"", "I'd file a complaint against the management everytime if I was getting those kinds of \"offers\".", "It's the harassing customers at the desk yard sale for me. How did he not get fired on the spot?!", "Haha this one I'd agree with tho (like no, don't let it happen)", "Comment stolen from: /u/purplewoodcarver \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/10eegqf/aita_for_stopping_an_employee_from_selling_their/j4qdrkz/\n\nBot Reported.", "lolz", "A hair stylist may be a gray area, depending on the salon some of them basically \"rent\" a chair at the salon and are considered independent contractors.  They would not be violating salon policies to sell their own stuff, but they still have to know which customers to approach and how.  If they are employees of a chain they are often stuck trying to get us to buy salon shampoos and stuff.", "Yeah, this story is fake, I can't believe people are buying it. I worked in the financial industry for years; this wouldn't have been allowed to go on for 5 MINUTES, let alone weeks! There are regulations against this, (including but not limited to doing your own financial transactions while also acting as the teller??!) Nope, the guy would have been fired a long time ago.", "I know right, I kind of want to say she's TA for not immediately pulling him of the floor and contacting the bank president the very first moment it was noticed he was doing this.", "The stylist I was talking about owned her salon and may have had one or two employees besides her, so there was no management to report her to.\n\nAwkwardly enough though, she now rents a chair at my current stylist's salon. Good thing she's usually not there when I am!", ">A dog would never.\n\n...family dogs steal and destroy expensive shoes and then demand the next 4 months worth of treats with pitiful looks all the time.", "There are. And he would have been fired immediately. This story cannot be real.", "Lol, stop by the service desk.  I did the day I HAD IT with getting ‘the talk’ and really did tell them I was going to quit if it didn’t stop.  She put an orange sticker on the back of my card and handed it back.  I stared at it and said ‘That’s it?  It’s that simple to make it stop? WHY DIDN’T SOMEONE TELL ME SOONER?!’\n\nWe’re not alone.  Something started the ‘orange dot’ solution."]}