{"id": 7568, "submission_id": "10ec7bi", "title": "AITA for telling my mom and my aunt that I think my aunt will always have to accept she's a stepmom and not just a mom?", "selftext": "So I'm 16f and my aunt is my mom's twin sister. When I was 6 she married her husband who's ex-wife had died weeks before (my aunt's husband was divorced and they were already engaged at the time). My aunt's husband has two sons Jax and Rocco who are 17 and 19 now but were 7 and 9 when they got married and I'm not sure how long they were together before that. My aunt's stepsons don't really like my aunt. Jax is in college now and I don't think he's really spoken to my aunt or his dad since he moved out. Rocco still lives with them but he pretty much acts like he lives alone. I hear all about this shit when my aunt and mom hang out. My aunt also has Cam who's 6 with her husband and they lost baby Paige four years ago (she was stillborn).\n\nSo anyway, it's never been hard for me to see that Jax and Rocco didn't really like my aunt and it was never hard to tell my aunt considered them her sons and not her stepsons. She'd call them her boys a lot and she used to tell people she had two sons before Cam was born and now she says she has three sons and a daughter. I remember once asking why the boys called my aunt by her name and not mom since she was always saying they were her sons. I would have maybe been 7ish at the time. She and mom told me that the boys were being grumpy and that they'd start to call her mom eventually. It was later that year I became better aware of stepfamilies because my best friend's parents divorced and she told me how she didn't see her mom's husband as her dad or second dad. So I got a better understanding. But Rocco told me a few years ago that my aunt and her husband had them in family therapy and my aunt said she wanted a more loving relationship with them but Jax and him didn't want that and always kind of planned to just keep her at a distance.\n\nThe last few months my aunt has started to realize that despite all her talk, neither of the boys give a shit about her. Mother's Day was when it started because Jax didn't call and got pissed off at his dad when he called him out a couple of days later for not calling my aunt and Rocco refused to celebrate with them and was grounded for refusing to acknowledge my aunt. Ever since she has seemed less certain and vents way more. So my mom and aunt dragged me for a road trip last weekend and they were talking about it non-stop and my mom kept assuring my aunt that she might not be their bio mom but she raised them and deep down they love her but teenagers can be insensitive and not always grateful. It started to get a lot and my aunt was like oh yeah, one day I'll be grandma and all this will be different and I told them that they should start listening to Jax and Rocco and she should work on accepting she will always be a stepmom and a mom and not just a mom. My mom and aunt were so angry with me and they told me it was an adult topic I couldn't understand and when I didn't apologize and say I was wrong, they kept being angry at me.\n\nAITA?", "created_utc": 1673961919, "permalink": "/r/AmItheAsshole/comments/10ec7bi/aita_for_telling_my_mom_and_my_aunt_that_i_think/", "score": 148, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my mom and my aunt that my aunt would have to accept she's a stepmom and a mom and not just a mom when they were talking about her stepsons and her relationship. Maybe it wasn't my place to say anything and maybe I shouldn't be taking the stance that I am. I feel like I wasn't being asked and could have stayed quiet. That I'm tired of always hearing this talked about and it might have made me a jerk in this moment.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\n>My mom and aunt were so angry with me and they told me it was an adult topic I couldn't understand and when I didn't apologize and say I was wrong, they kept being angry at me.\n\nIronically, your comment was the adult one and their response was not.", "NTA but they’re not going to listen to you.  You’re “just a kid” so you can’t possibly contribute (/s)\n\nYou’re not wrong but I’d stay out of it. This doesn’t involve you and you putting yourself into it will only bring your grief.", "NTA but you're at the hilarious part of your youth where you can see clearly that adults are a bit bullshit, either lying to others or to themselves and not dealing with their problems properly, and they don't like it when you call them out. Take it from me: pick your battles carefully. You're not helping anyone because at 16, no one will listen to you. They'll just get mad about it and you'll feel belittled and also get mad.\n\nI'm 33 now, but the scenario you described with your mom and aunt could have very well happened with my mom and my aunt when I was younger. I remember one time my aunt was visiting us and she kept lecturing us about how good it was to be vegan and how it was helping the environment to be vegan and how she really learned a lot about herself while being vegan, and I said to her, \"I didn't realise smoked sausage was vegan\" while we were having dinner and she was partaking in all our non-vegan food (even though there were options for her if she wanted them). Not only did she get mad about it, but she proceeded to sulk and ignore me for the next three days, going out of her way to show me she was still mad about it.\n\nLesson learned: adults don't like hearing the truth. Sometimes they just want to be listened to and appeased, like toddlers.", "NTA. Reality isn't always kind. Sometimes the truth is necessary. Sounds like your aunt would've been accepted as a step-mother but she wasn't content with that and may have damaged any future relationship with her step-sons.\n\n>they told me it was an adult topic\n\nIf it was an \"adult\" topic maybe they shouldn't have been talking so openly if they didn't want an almost adult's opinion.", "NTA\n\nIt sounds like you understand the \"adult topic\" far better than the two adults!", "NTA\n\nYOu are obviously right.\n\nBut why would you get involved?", "I feel bad for your aunt.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I'm 16f and my aunt is my mom's twin sister. When I was 6 she married her husband who's ex-wife had died weeks before (my aunt's husband was divorced and they were already engaged at the time). My aunt's husband has two sons Jax and Rocco who are 17 and 19 now but were 7 and 9 when they got married and I'm not sure how long they were together before that. My aunt's stepsons don't really like my aunt. Jax is in college now and I don't think he's really spoken to my aunt or his dad since he moved out. Rocco still lives with them but he pretty much acts like he lives alone. I hear all about this shit when my aunt and mom hang out. My aunt also has Cam who's 6 with her husband and they lost baby Paige four years ago (she was stillborn).\n\nSo anyway, it's never been hard for me to see that Jax and Rocco didn't really like my aunt and it was never hard to tell my aunt considered them her sons and not her stepsons. She'd call them her boys a lot and she used to tell people she had two sons before Cam was born and now she says she has three sons and a daughter. I remember once asking why the boys called my aunt by her name and not mom since she was always saying they were her sons. I would have maybe been 7ish at the time. She and mom told me that the boys were being grumpy and that they'd start to call her mom eventually. It was later that year I became better aware of stepfamilies because my best friend's parents divorced and she told me how she didn't see her mom's husband as her dad or second dad. So I got a better understanding. But Rocco told me a few years ago that my aunt and her husband had them in family therapy and my aunt said she wanted a more loving relationship with them but Jax and him didn't want that and always kind of planned to just keep her at a distance.\n\nThe last few months my aunt has started to realize that despite all her talk, neither of the boys give a shit about her. Mother's Day was when it started because Jax didn't call and got pissed off at his dad when he called him out a couple of days later for not calling my aunt and Rocco refused to celebrate with them and was grounded for refusing to acknowledge my aunt. Ever since she has seemed less certain and vents way more. So my mom and aunt dragged me for a road trip last weekend and they were talking about it non-stop and my mom kept assuring my aunt that she might not be their bio mom but she raised them and deep down they love her but teenagers can be insensitive and not always grateful. It started to get a lot and my aunt was like oh yeah, one day I'll be grandma and all this will be different and I told them that they should start listening to Jax and Rocco and she should work on accepting she will always be a stepmom and a mom and not just a mom. My mom and aunt were so angry with me and they told me it was an adult topic I couldn't understand and when I didn't apologize and say I was wrong, they kept being angry at me.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[deleted]", "NTA", "NTA but at this point you've had your say. Let her figure it out now. Not your circus not your monkeys.", "NTA. You are right and your aunt will realize this soon enough.", "NTA. It sounds like you were pointing out the obvious but neither of them want to acknowledge the truth of the situation. She is hoping to become grandma someday but if those boys dislike her they will not have their kids give her a title that was meant for their mother she will most likely be their grandpa’s wife.", "Also, if it's an adult topic, they shouldn't be discussing it in front of OP, or taken her on the trip if they were going to talk about it.", "I think I'll do that next time and keep headphones on me at all times so I can drown that topic of conversation out.", "I mean, it sucks to care about people who don't care about you in return. But at some point you have to accept reality. Same thing happened to me with someone I loved and thought of as a friend. Eventually I had to learn to let go. My aunt has to do the same.", "[deleted]", "I don't get to say no to this kind of stuff. I don't think they assume affair. Their parents were long divorced. But she's still not mom to them.", "I would also say NTA but stay out of it in the future. There's nothing you're going to say that is going to change the way they view this. Your mom is saying those things to help alleviate your aunt's hurt feelings.", "You don't see the difference between a \"friend\" and children you helped raise? They most definitely are not the same thing. Have you no empathy?", "They were already a couple and engaged before the EX-WIFE passed.", "[deleted]", "Of course there's a difference but it does still apply. You can't make people feel the same about you and it only hurts more when you pretend they do. I know that from experience.", "Sorry that wasn't clear. My aunt was never married before her husband. He was divorced and they'd been dating and engaged a while when his ex-wife died.", "How do you expect your aunt to \"let go\" of her husband's children and her son's step siblings? Her situation is much more involved than your \"friend\" thing.", "She needs to let go of the idea that she's their mom. She might even need to let go of the idea that she'll be known as grandma to their kids. Jax and Rocco do not care about her and don't want to make their relationship with her closer than it is. Maybe she can't let go the same way I did with the person I thought of as a friend. But every time she keeps trying to tell herself she's their mom or when she becomes invested in trying harder, she just gets hurt when they show they don't feel that way about her. Mother's Day was always forced. But it was also the first one where Rocco wasn't home and Jax didn't have his brother there so he chose to get into trouble rather than celebrate the day with her. I think that says a lot and yet I know she and my mom have still mentioned how next Mother's Day will be different.\n\nNone of this will help her. She's just fixating on this and of course it hurts her but we have to find acceptance in the truth otherwise we set ourselves up for years of hurt.", "NTA.  You are 16 but wiser than your elders.  They should listen to you and stop deluding themselves.", "NTA.  Your aunt is trying to achieve some kind of idyllic relationship with her stepsons, and refuses to acknowledge the reality that they aren’t interested in participating in her fantasy.  \n\nBut they won’t listen to you.  Stay out of, keep your stress down.", "ESH. Your aunt can’t force a relationship that your cousins don’t feel, but it was unnecessary and unkind for you to point that out.", "NTA\nThey are mad because you're right.  Truth hurts and when someone hurts you it's human nature to want an apology even if one isn't owed.", "NTA. Maybe they should listen to you. I mean you are not an adult yet, but you are getting there and seem to have it figured out already! Being around the same age as the boys, and having a friend that was in the same situation, you obviously are more aware of what your peers perspectives are. I think they just don't want to accept that.", "NTA. Sounds like your mom and aunt are both delusional. Arguing with delusional people isn't worth your time. Time to sit back and watch the drama unfold with popcorn and a soda.", "NTA\n\nYou are showing an outstanding amount of social intelligence for your age. Your parents really are not. \n\nWell done.", "NTA. How is this an \"adult topic\"? I would suit them to listen to someone the age of Rocco and Jax. But I guess they would praise you for your adult insight, if you'd be complying in aunties attempt to force motherhood to them. I smell hypocrisy here.", "NTA", "NTA but I'd keep that opinion to yourself, they obviously don't want to hear it", "NTA. You can force your own expectations on other people. It sounds like your aunt's stepsons have made it abundantly clear that they don't want that sort of relationship with her. They may change their opinion in the future, but your aunt needs to limit her expectations. She is not respecting their wishes and pushing what she wants on them.", "Sounds like the boys’ “plan” to keep your aunt at a distance is working. Not sure when that started but it sounds like they did it from the beginning and their father didn’t help them process their resentment over the divorce, or they’re just naturally emotionally distant. Your aunt may want things to be different but obviously they aren’t. A reality check from an interested observer is exactly what she needs. NTA", "Yeah. Like its not What shes asking about But What a bunch of assholes to take someone on a roadtrip and then only discuss things shes not allowed to have an opinion on.", "Why are you continuing to push? OP is right; her aunt can't force her stepkids to see her as a mother and has to accept that if it hasn't happened already it's probably not *going* to happen."]}