{"id": 7572, "submission_id": "10ehdvn", "title": "AITA for ordering pizza even though we had dinner reservations?", "selftext": "We were supposed to go out with my family for dinner but I was craving pizza all day and I was hungry so I asked my husband if he would buy me some. We ordered pizza at 5:45pm and we had dinner reservations for 8:30pm.\n\nWhen the pizza arrived, everybody wanted some but my sister was upset because she wanted to go to the restaurant so she refused to eat any. Nobody wanted to go out after they had eaten the pizza because they were full so my dad told my husband he should cancel our reservation.\n\nMy sister is blaming me for us not going to the restaurant and has accused me of making everything about myself. My parents have tried to speak to her and my dad told her I was pregnant so I needed to eat when I was hungry but it’s only made her more angry with me.\n \nIt’s difficult to get a reservation at the restaurant we were supposed to go too so I understand why she was initially upset we never went as she was excited to go. However, my husband knows the owner and has promised he would make another reservation before we went home but my sister doesn’t want me to be invited as she thinks I’ll ruin it again which I think is an overreaction.\n\nAITA?", "created_utc": 1673975213, "permalink": "/r/AmItheAsshole/comments/10ehdvn/aita_for_ordering_pizza_even_though_we_had_dinner/", "score": 6720, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I ordered pizza even though I knew we had dinner reservations for later on. I ordered enough pizza for everybody to have some so nobody wanted to go to the restaurant after as they were full. The action that might make me an asshole is ordering the pizza in the first place and for ordering so much that people were full up when I knew we had dinner reservations.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. What you did was really uncool. You could have just eaten a snack, instead you ordered enough pizza to feed everyone even though you had dinner reservations.", "INFO:\n\nWhy did you order enough pizza for an entire family to gorge themselves on?\n\nDo you often do things to undermine your sister?\n\nDo you often use your pregnancy as an excuse for bad behavior?", "YTA. You could have gotten a single slice or a calzone/personal pan pizza if you were craving pizza. I'd be pissed if I were your sister, too.", "YTA\n\nTwo 13” pizzas is not a snack, it’s a meal - for multiple people. Yes your family had a choice in eating it or not, but it’s a bit of an imbalanced choice because there’s plentiful hot pizza sitting there now - at a normal dinner time - with a few hours before dinner reservations. \n\nI don’t blame your sister for being upset when y’all had arranged this difficult-to-acquire family dinner reservation that she was excited for and then you turned it into “family pizza night at home” at the last second. \n\nI think you should’ve ordered a small personal pizza or found another snack", "You ruined dinner. You sound like a child without control. YTA", "YTA. Having a snack would have been fine, having an entire pizza is ridiculous when you had dinner plans. You’re being spoiled and your sister has a right to be upset.", "YTA x 10.  Pregnant or not doesn’t give you license to make it all about you.  You ruined the evening.", "Yes, YTA you put your \"craving\" above plans that had previously been made.\n\nYou could have had a snack to tide you over instead of ordering a whole other meal\n\nETA: I can see why your sister would not want you included in future plans.", "> I was pregnant so I needed to eat when I was hungry\n\nThis is the part that makes me say YTA.\n\nSure, you are pregnant, and you were hungry. There are thousands things in your fridge/pantry that you could have eaten without spoiling your appetite.", "YTA\n\nyour sister is right, it was obvious you had no intention of going to the restaurant the second you ordered that pizza", "YTA, but congrats on using your pregnancy as an excuse for your awful behavior.", "The fact that you ordered 2 large pizzas for everyone and then justify it and blame your sister for her reaction shows me you did this intentionally to hurt her.  YTA.  I don’t know why you are doing this to your sister.  Instead of validating that your actions help contribute to the disappointment of your sister, you act like the victim and gaslight her.  Are you competing with her or are you thinking that because you are pregnant everything should always go your way?", "YTA. Your sister was looking forward to something. And instead of maybe getting a pizza slice for yourself, you roped the whole family into it. You could have compromised with her somewhere. Also, have you ever thought that your sister is tired of it always being about your pregnancy?", "YTA easily. if you were hungry, have a snack. why did you need to order a whole pizza in front of everyone?", "YTA, you could very easily have made a snack and had pizza the next day. (Currently pregnant for the 3rd time, so I do know what I'm talking about.) You ALSO could have been honest when ordering the pizza that no one was going to want to go out afterward. Your sister was looking forward to the restaurant and didn't eat the pizza so she could still enjoy the dinner she'd been looking forward to.", "YTA. at first I was going to say N T A if it was just you and your husband at home and you were meeting at the restaurant. But with everyone there what did you expect to happen.", "ESH but your sister\n\nYou have the right to eat whatever you want, but you should have ordered pizza just for yourself, and eaten one slice, if you already knew about the plans.\n\nYour sister has the right to be upset because you and the others who decided to order pizza ruined her plans, and she was probably looking forward for it.", "YTA.  \n\nHaving a snack when hungry is fine, pregnant or not.\n\nOrdering a full meal to share when you knew there were set plans to go to a restaurant is what makes YTA", "YTA and your husband too. You wanted pizza so your husband should have gotten you a very small pizza that no one else ate. How much pizza did he order that everyone ate enough to be full. Y’all were jerks to your sister.", "YTA. Even when I was pregnant I didn’t make everyone change their schedule around my cravings. It’s hard to get reservations…clearly this was planned in advance. Who orders pizza 2 hours before you’re going out to eat?", "YTA", "YTA - you could’ve had a snack or something rather than cancel a hard to get reservation.", "YTA. I'm astounded by the amount of women using pregnancy as an excuse. I have a 6yr and 2yr old and I never acted like an entitled AH or that I was deserved to be the center of attention for 9 friggin months.", "YTA. You could have eaten pizza the next day. Your sister was right you did make it all about you.", " BUt I aM preGNAnt!\n\nSo?  You’re also an adult who knows how to structure her day. You had reservations. You had plans that involved people other than yourself. And snacks exist.  Also, what do you mean asked your husband if he would buy one for you?  You don’t know how to order a pizza?\n\nYTA", "YTA. Girl you know you could have had pizza for lunch or earlier in the day. I feel so bad for your sister. Lol", "YTA", "YTA. Bring pregnant doesn’t give you a pass to be inconsiderate. You were craving pizza all day why didn’t you get it for lunch? Why didn’t you get a small one just for yourself and eat a slice then save it? You knew about these reservations and you knew this was a dinner your sister was excited about.", "YTA - derailed the previously planned family dinner", "ESH, except your sister. We get it, you're pregnant, but you're not a child who HAS to eat pizza because they want pizza. Did you not have anything to eat at home to tide you over until dinner plans? Because that would've been much more appropriate. \n\nYou ordered the pizza less than 3 hours before your reservation, giving yourself a very short window for it to show up, eat some, and be ready (and hungry) for dinner. And you ordered enough to feed the family instead of getting something small. Couldve gotten enough for yourself.\n\nYour family shouldn't have indulged even if you didn't have the foresight to see this happening. Your husband made this reservation, so It's not like she was roping everyone in to this dinner from the get go (correct me if I'm wrong). Inconsiderable all around.", "How much pizza did you order for one person, that five people were full?", "YTA. If you're hungry but have dinner plans, eat a freaking snack. My kids, who are 10 and 5, even understand this without it being explained to them.", "YTA. There were surely other options for you to eat something, beyond \"let me order enough pizza for everyone, 2 hours before our dinner reservation.\"", "I am also pregnant and super sick so I understand eating when you need to... but it seems like you purposefully ordered enough for everyone so close to the time to leave so you would not miss out at the restaurant since you knew you'd be full yourself. You could have gotten a small and then more people would have been hungry and want to go with your sister. YTA.", "If you were craving it all day why didn’t you get it for lunch? Like that’s so rude of you to ruin the plan. The rest of your family are AHs too\nYou did make it about yourself.", "YTA. Way to hijack the whole evening.", "YTA could have eaten something small instead or even gotten a small pizza...but you got enough to feed everyone spoiling the dinner. \n\nI get that you can have cravings but you spoiled it for everyone.", "YTA - You set the wheels in motion that ruined the plans.  I am not sure how one person having a craving leads to an entire family being full of pizza, but apparently that is what happened.  If the intention was to feed the craving, then get a personal pan, go somewhere to get a slice, etc.", "If you were craving it all day why did you not get it at lunch time? Or go out and eat pizza? Or have it tomorrow?\n\nOrdering food just before you go to a restaurant is just silly. \n\nI’ve had 3 kids and I love food way too much, but you honestly can just eat normally, being pregnant is absolutely no excuse for being rude.  You don’t “NEED” to have a whole meal before your proper meal. You just wanted too and didn’t care about the families dinner plans. \n\nCan you really not see why your sister is upset!?\n\nperhaps she had been craving this restaurant and had been looking forward to the food and being with the family.", "YTA. Order enough pizza just for yourself then, why order enough to make everyone full? You yourself said its difficult to get a reservation, so your sister must have been looking forward to it, and yet that wasnt considered when the pizza was ordered. Your sister has every right to get pissed at all of you. Honestly this makes me mad as it makes your sister seem like the spoilt brat, but when in fact it is the rest of you lot who are the AHs.", "YTA - do you guys normally eat dinner at 830?\n\nIf you were hungry, eat a snack at home to tie you over.", "YTA - being pregnant isn’t an excuse to ruin plans your sister was clearly excited about and looking forward to.  Your husband should have taken you to get a slice instead of ordering a whole pizza.", "1. Toast some bread.\n2. Spread tomato puree on the toast.\n3. Sprinkle cheese (and a topping of your choice) onto the puree.\n4. Grill until melty.\n\nYou have a little pizza snack for your cravings, and promise yourself pizza the next day.\n\nYTA. Pregnancy doesn't give you a free pass to be an AH.", "I would have been upset as well. Have a sandwich. If I was so hungry that my stomach starts to hurt, I will take some biscuits or small snacks but will not ruin my family's plan. Or if I \"really crave\" pizza and I would die without it right now, I will still go and sit at the restaurant as planned. \n\nYTA. Obviously no one asked you to order for the rest of the family.", "YTA... For obviously couldnt be bothered to wait and more so because you ordered so many pizzas that several people could eat their fill.\n\nThis was 100% intentional of you", "What the actual hell? You say \"When the pizza arrived, everybody wanted some\". That, to me, implies that no one said they wanted pizza before it was delivered. So you only ordered some for your husband and yourself? But the rest of your family, consisting of at least two parents, got enough pizza to also be full? So you ordered enough pizza to feed at least 4 adults even though you had dinner reservations? You don't sound like an asshole, you sound like an idiot.\n\nYTA. Your sister didn't even eat pizza because she thought you guys would still go, so I can only assume she had nothing to eat and had to fix something for herself. I'd be pissed with you too.", "YTA, you absolutely made it about yourself. And you are still doing so.\n\nYou had reservations at a difficult to attend place and, in getting the pizza, you clearly made a second dinner and ordered enough for everyone to eat, sabotaging the previous plans.\n\n* If you don't want to go, say so before the evening of the dinner. Flaking out two hours before you head out to an exclusive location reservation is pretty assholeish.\n* If you need a snack to tide you over while pregnant, ordering pizzas is clearly not appropriate in this scenario. Something small and, frankly, healthier for you and your child could have tided you over.\n* ***Edit Addition:*** *Also, as many below have pointed out, if this place is that hard to get into you've essentially wasted both your chance, someone else's chance for that table, and the restaurant's limited space. Which: not great!*\n\nWhat you did here was ruining previous plans in a petty, undermining way and your lack of forthrightness with it makes you an asshole in this situation.", "YTA - I’m so tired of pregnant women coming on here and pretty much trying to use their pregnancy to justify being a dick. While it’s not entirely your fault that everyone decided to eat the pizza instead of going out to eat, you could’ve just had a snack to tide you over until dinner", "YTA.  You craved pizza all day and waited until 5:45 to order some--and it arrived how long before you all were supposed to leave for the restaurant?  And ordered so much that everyone ate until they were full?", "YTA. Jesus, OP. Get a small snack. You are a grown adult. You can last a couple of hours, even when pregnant. Pizza was over the top.", "YTA - you did not go directly becuase you ordered pizza. You said it was hard to get a reservation and you cancelled last minute. I bet your next reservation is sitting by the bathrooms.", "YTA (you + your husband followed by who ate)\n\nyou should have quietly ordered your pizza (slices of) without making it a \"pre-dinner\" thing. Saying you were craving for something since you are pregnant, exactly how you write here. Instead, you confirm in comments you have ordered large pizzas, clearly for multiple people. De facto changing the plans without even having the courage to say it directly. I guess she knew the plans were canceled like one before the reservation time, more or less. It wasn't nice. \n\nIn short, you were TA for \"I order various large pizzas. But of course *wink wink* if nobody wants that now, I'll eat the excess later, even if I have ordered for everyone so....\" because OF COURSE you implicitly changed the dinner plans doing so. At that point, everybody was pushed to eat pizza, you clearly wouldn't have finished the pizzas alone and you ordered it for everybody. As adults, we need a bit of ability to predict things.\n\nThe others eat, but you build the situation and I'm not even that sure you actually didn't predict the outcome tbh. Especially because you confirm in comments that the attention in these days is all for you. I'm sure your sister is understanding the dynamic very well.", "YTA.  If you so desperately needed to have pizza right then and there you could have ordered a personal pizza, but you chose to order enough pizza for everyone to eat obviously ruining the dinner plans.  Most people don't eat 2 different dinners on the same night.  You obviously didn't feel like going out and chose to ruin the plans.", "Yta", "YTA", "YTA. Wow, how incredibly rude of you. Honestly how rude of your whole family. Being pregnant doesn’t mean you get what’s you want, whenever you want.", "YTA- this was an easy one", "YTA - there were so many other solutions to this problem other than order a pizza and ruin dinner. You could have made yourself a snack or gone and gotten fast food. You made the whole night center around you and what you wanted instead of considering what was best for everyone", "YTA. Even being generous to you and saying you absolutely had to have your craving met,  you know pizza bites are a thing, right? You could've even just gotten a small frozen pizza. You didn't need to order a whole pizza, let alone enough pizza too leave 4 adults too full to go out to eat in a couple of hours.", "YTA. You could've gotten one slice somewhere or limited how much you ate. Quit using pregnancy as a crutch to get your way. \n\nAnd you have zero remorse for your sister, who was waiting to eat at a restaurant that's difficult to get reservations for because \"pregnant\" & she didn't get to eat there. Just because of you. And your family are AHs, too, for enabling you.", "YTA\n\nYou could have had a snack, made a sandwich, a salad, etc…and that would have taken care of being hungry. Have pizza the next day or have it earlier in the day for lunch. \n\nYou ordered a dinner before dinner. Your husband excused it because you’re pregnant. Yes, you may need to eat more frequently, it didn’t need to be pizza that ordered in so close to dinner.", "YTA. I think everyone has explained why.", "INFO was there a particular reason you guys were going out to dinner? I would say you’re in the wrong either way, but it feels like there’s something you’re leaving out here in regards to your sister.", "YTA. You ruined dinner plans.", "YTA, u had reservations if you crave pizza then get enough for yourself not enough to feed the entire family and spoil the plans. That said the blame also lies with your family cos who stuffs themselves with pizza when they know full well they have dinner reservations?? That’s just rude", "Well that was a dumb thing to do.", "Omg. YTA, so much. Eat a damn banana if you’re hungry, or go have a pizza slice by yourself if you’re having cravings. Don’t ruin everybody elses plans.", "YTA And the fact that you’ve got your parents running game for you suggests that your sister is right in her accusation that you make everything all about you.", "You course YTA. Who orders dinner in when they have other dinner plans?", "YTA. Pregnancy does not excuse your behavior. If you’re hungry and you know you have dinner plans later, you eat a snack. You could have waited a day to eat pizza.", "YTA. \n\nReally 2 large pizzas. It sounded like you purposely did this so you didn’t have to go. Why couldn’t you ordered a small pizza just for yourself?", "YTA - and it’s obvious. You are an adult. You could have gotten pizza earlier in the day, or waited till after your dinner to satisfy the craving. You ruined your sister’s night and don’t want to be held accountable. Pregnancy is not an excuse and I get why she doesn’t trust you now.", "Why not make a mini pizza with a bagel or something? YTA", "YTA You could have had a small, personal pizza but apparently you ordered enough to feed the entire family. Seems like you sabotaged the dinner on purpose.", "YTA, and I say this as a currently pregnant lady with HG who needs to eat every 2.5 hours or I get violently ill. If you’re hungry, you eat. You don’t order several pizzas and change the plans your whole family had. You could’ve had a snack or even ordered a personalized pizza and eaten it away from everyone else. I’m on bedrest so I don’t go out often, but if I have appointments I need to go to, I bring a purse full of snacks so I don’t inconvenience my whole family with having to stop multiple times. Plan ahead, OP.", "I am 7 months pregnant. YTA.", "Wow YTA big time", "YTA just because your pregnant doesn’t mean you don’t have to have manners. Why wouldn’t you just get a small pizza? It makes sense your sister is upset and it seems like this might be a common occurrence hence why she doesn’t want you invited next time", "Why did you order so much pizza? I understand that you were hungry and pregnant people often need to eat more, but what the fuck? Your sister was excited for this and you ruined it. YTA.", "YTA - obviously you ordered enough pizza for everyone and not just yourself. If everyone else hadn't eaten it, it would have gone to waste. \n\nNext time, stay home or grab a bite from the fridge.", "YTA. Being pregnant does not excuse inconsiderate behaviour. You could've got a small pizza for yourself if you really wanted to. You didn't need to buy enough for everyone so that no-one wanted to go to the restaurant. Your husband is also TA because he should've also realised this.", "Everyone is somewhat TA except your sister imo.", "YTA. Pregnancy isn't a license to be a dick and ruin things for other people.", "YTA you could’ve eaten something else and you did ruin the evening. Pregnancy is used an excuse for rude behavior too often. I’ve been pregnant multiple times and I found a way to nourish myself without ruining everything for others.", "YTA and I feel sorry for your kid if you and your husband are this entitled. “He knows the owner so me acting like a child is totally fine” 🙄", "YTA. you ruined the dinner plans. being pregnant isn't a legit excuse to do what you want when you want.\n\nyou should have had a small snack and had pizza the next day or later in the evening.", "YTA\n\nNot everything is about your cravings, you should have looked into the fridge for some quick snack instead of behaving like a baby", "Well let's see.. \n\n\"*We* were supposed to go out... but *I* was hungry... So *I* asked *my* husband to buy *me* some pizza.\"\n\nYour sister is right, you did make everything about you, and you expected everyone else to (kind of literally) cater to your hunger. You're gonna pull the \"but I shared!\" card but it's because of your choice that your sister missed out on an opportunity she had been looking forward to. \n\nYou're an adult, get a damn snack. YTA\n\nBTW the whole eating for two thing is a myth.", "YTA. ONLY enough pizza for you should have been ordered, or eat something already on hand.", "YTA.. Your sister was waiting all day to go out to eat at a restraurant that is difficult to get a reservation at and you ruined it for her for what , Pizza... Because the world revolves around the pregnant daughter", "YTA. Pick up a slice discretely to tide yourself over next time. Your family sucks too for not just having a slice or waiting until dinner. \n\nThat said, if I was your sister I'd have just gone with my hubby without you.", "Info: What was the reason for the dinner? Was it a special family event? Or was it just a normal night out? Did you hijack your sister's birthday dinner or something similar? You not mentioning the reason for the plans I'd say is pretty suspicious.", "Do you and/or your family wreak things for your sister like this often?", "Yta. You had dinner plans and you ruined it because you couldn't wait two hours. Considering your sister stated that you make everything about yourself it seems like you have main character syndrome and your sister is right.", "INFO: why did you order so much pizza that it was enough for everybody? Cravings fair enough and all, but then get a tiny one for yourself so everybody still gets dinner after.", "YTA. When you’re truly hungry you’d be willing to eat anything. You really didn’t have anything else to eat in the house? Why didn’t you just eat a few snacks..? If you were really craving pizza all day why didn’t you eat it during lunch? Or the next day? I crave pizza often but I’m not gonna eat it every time I do. Who orders enough pizzas to keep everyone full before dinner??", "YTA. You could’ve gotten yourself a slice if you were craving it.", "YTA, you ruined dinner plans. If you’re hungry get a snack.", "YTA. You know you didn’t need to do that. Being pregnant is super hard, I know. But even pregnant people can show self-restraint.", "YTA.  Eat a snack.  Make yourself an English muffin pizza.  Have a hot pocket. Don’t use pregnancy as an excuse to tank family plans.  You essentially offered people a meal three hours before dinner.  You knew they wouldn’t end up wanting to go.", "YTA. If you were that hungry, you could have had a small snack. What are you? 5 years old.", "YTA. Why didn’t you have pizza for lunch when you knew your family had a reservation for dinner?", "I would have put away the pizza before family came over. Still woulda smelled like pizza but oh well.  Also wondering why they all came to your house instead of going directly to reservation", "YTA oh good, another pregnant person thinking they deserve special treatment while being selfish and self centered", "YTA - why did you have to have a whole meal? Why couldn't you have a snack so that the plans everyone had could still happen? Make a piece of cheese toast, have a bowl of cereal, carrot sticks and ranch dressing, peanut butter and jelly sandwich, anything else. OR why not just order one slice of pizza instead of enough to feed the whole family? I have a hunch that these kinds of things (ppl catering to you) must happen fairly often because your sister thinks you \"ruin it again\".", "8:30 is late for dinner for me, and I would have needed something to eat before then myself, especially pregnant. However! What stopped you from getting a personal sized pizza and had a snack?\n\nEdit: YTA. I get being pregnant and cravings, but damn. A nice dinner was planned and canceled because you wanted pizza. Are you the sun? Does the earth revolve around you?", "ESH except the sister. I'll concede that your pregnancy is a mitigating circumstance, but you're still an AH, and your family have no excuses.\n\nEdit: Just reread and saw that you intentionally ordered pizza for everyone. That cancels out the mitigating circumstances. All condemned to AH prison for life, I'm afraid, with no chance of parole.", "YTA.  You could have had a snack if you were hungry before going out.  “Craving” pizza is not an excuse to cancel plans.", "YTA. I have never understood why pregnant people think it’s ok to make everyone dance around their cravings.", "YTA\n\nYou were well aware that you had dinner reservations, yet you ordered enough pizza to make an entire family full? You could have gotten a personal pizza or eaten a snack and wait to order pizza the next day when you didn't have reservations. If you're reasoning is that you didn't want to feel rude and eat in front of your family, then you could have gotten a small pizza and offered people a single slice. You should not have ordered 2 larges as I've seen in the comments", "YTA. A medium pizza would have been like an appetizer for everyone. Ordering 2 large is a meal. You were more worried about being rude if you only ordered for yourself, but you aren't worried about being rude to your sister knowing she was excited to eat out.", "YTA  so you ruined dinner for everyone because you couldn't wait a few hours for dinner. and being pregnant im sure you had something in the fridge", "YTA pretty selfish of you", "YTA, I’m pregnant too. When I’m hungry I have to eat, and I absolutely could not have waited from 5:45 to 8:30 to eat. But I would have made myself a snack to tide me over, not ruined dinner for everyone.", "YTA. Why couldn't you just have had a little snack? Why order a bloody pizza before a dinner reservation? I'm not surprised your sister is annoyed. Also being pregnant isn't an excuse to be selfish (and I've been pregnant). Go apologise to your sister.", "INFO: How much pizza did you order? Because it doesn't sound like it was just 1.\n\nI'm torn between YTA and E-S-H except your sister. How can everyone have eaten so much pizza that they can't make their dinner reservation?\n\nAlso, a craving is just that. A craving. Not a life and death situation. Congratulations on being pregnant, but it doesn't excuse having 0 self control. You really could have craved just a slice or two.", "yeah YTA, you just changed a person's plans because you wanted something for yourself.", "This must be what happens when OP goes more than an hour without everybody focused on her. YTA, and you know it.", "YTA. Being pregnant doesn’t make you entitled over everyone else", "As a woman who is currently pregnant, YTA. You don’t get to use it as an excuse to do whatever you want. If you were nauseous, eat a handful of pretzels or go home, don’t ruin the night for everyone.", "Yta. You all are ‘cept your sis. Your husband could have ordered a single/personal size pizza. Instead your ordered a fuckin party platter.\n\nId be pissed too", "YTA", "YTA. You just crapped all over her plans. Your sister planned a nice evening at a restaurant that was hard to get reservations for and you just crapped all over he work and decided to eat pizza instead. \n\nAlso, the idea that ordering a pizza at 5:45 (which means you are eating pizza at 6:00 at the earliest) would cause people to not be hungry. If you were so hungry and did not want to make it all about you, you should have ordered something a lot smaller that would tide you over but not be enough to share and ruin the appetites' of your family's members? Also, being pregnant is not a cover all excuse for bad behavior.", "Asshole.", "INFO: was this dinner a special occasion? And has your sister ever accused you of making everything about yourself before? This didn’t sound like a one time thing from the way you described it. \n\nMy initial judgment is YTA, but I’m curious if there’s more to it since it seems you left some stuff out", "YTA.", "YTA. Why are you even bothering to ask? It’s as clear as day. If you want something to tide you over until your reservation then have a sandwich. Or something else that isn’t going to fill a whole f***ing family.", "YTA and so is your husband.\n\nBoth of you knew exactly what you were doing when you ordered enough pizza to feed the entire family.", "YTA.  Exercise some gd self control.", "YTA. \n\nYou could or should have asked your husband to pick up one slice or a personal pizza and eat it before the company arrived. You could have ordered pizza for lunch. But you ordered pizza which was enough for everyone to eat at 5:45. Assuming pizza was at the house in 30 minutes, it's 2 hours and 15 minutes before your reservations. \n\nHaving cravings and acting on them isn't the a hole move. Waiting until it was so late, having your husband get it, eating it in front of everyone and getting enough where no one else was hungry for dinner was the a hole move. You actively picked a different dinner for everyone.", "Pregnant or not, YTA.\n\nThere are \\*many\\* options to satisfy ***your*** craving for pizza. so easy to mix something from the cupboard - toast with pizza or sauce and some cheese. etc.\n\nEDIT: for clarity \"pizza\" toast  - toasted bread with sauce and toppings.  \n\nRather than act appropriately on your wish, you forced your whole family into something which would be hard to resist and then allowed everything to be derailed.\n\nI will be curious how you are able to deal with a toddler.", "ESHDoes the whole family just have zero self control?\n\nOrdering a pizza this close to a planned dinner is an asshole move. You say you *ordered* at 5:45. But when did it *arrive*? I am guessing you would have had to eat, and then leave for the restaurant immediately after. Asshole move #1, from the OP.\n\nIf people had one slice each, they still would have been hungry enough to go eat at the restaurant as planned. But apparently they all had to eat until full. Asshole move #2, from the entire family.\n\nALSO, how was there enough pizza for everyone to eat until full in the first place? It seems OP must have ordered a LOT, not just for herself. At this point, it seems pretty malicious. Asshole move #3, from the OP again.\n\nBlaming exclusively OP and not the whole family for eating pizza is a minor asshole move on the sister's part. Sure, OP ordered, but they all happily joined in.", "Yta how do you think you aren't?  You had a dinner plan that you decided didn't apply to you, ordered another pizza for everyone to have dinner, and agreed with canceling the original dinner plan. \n\n You're pregnant not a friggen invalid.  You could have had a small snack, *by yourself* instead of ordering dinner for everyone.", "YTA and you didn’t need to come here to figure that out. Pregnancy doesn’t excuse you. Go have a damn snack to hold you over.", "YTA for not recognizing it would negate your dinner plans - maybe you could have gone out for a slice or ordered a small pie for yourself to bridge the gap between feeling hungry and the time of the reservation. Or you could have asked your family how they would feel about rescheduling and getting pizza instead since ordering food at 5:45 would obviously impact most people's appetites in advance of an 8:30 dinner reservation. You could have even had pizza for lunch, I would imagine. You're not an AH for wanting pizza or having pregnancy cravings, but definitely YTA for lack of foresight and consideration of the initial plan which involved other people. I'd also be pissed if I were your sister and had been looking forward to a family dinner at a nice restaurant only to have it sidelined by one person wanting pizza.", "YTA\n\nBeing pregnant is a ridiculous excuse. I've been pregnant 4 times and not once did I have to eat that very second because I was pregnant. Lol", "YTA\n\nMissing missing reasons.  Book it.", "Yta could have had some fruit or snack. Gross behaviour", "YTA. Yes, you ruined the plans because you decided to be selfish.", "YTA and everyone else who ate their fill of pizza also. It is not that difficult to have a small snack to tide yourself over until a meal.", "Nah YTA. I’m sure it would’ve been fine for you to at least get a snack. Not a damn whole pizza, especially if you and your family already had reservations for later on. So yeah, don’t get this logic tbh.", "YTA you craved pizza all day so at any point you could have gotten pizza for lunch or an afternoon snack but no you had to do it at dinner knowing dang well nobody would be hungry for the restaurant at 8.", "YTA. As a fellow pregnant person with many cravings, it's not going to kill you to not have it. Don't use pregnancy as an excuse.", "YTA- get a snack next time. you did ruin it for everyone and I dont blame your sister if she doesnt want to invite you.", "Wow, you couldn't eat something to tide you over until dinner? Bowl of cereal? Protein bar? Sorry, you were rude by hijacking the dinner plan.", "YTA. Who else should she blame but you?", "YTA obviously. You had dinner plans and ruined them for everyone. Either don’t make such late dinner reservations or be an adult and forego a craving for one whole day.", "YTA I’m sure you had food in your pantry or fridge. Also if you were “craving pizza all day” why didn’t you get some for lunch.", "YTA: you ruined the entire evening. Control your pregnancy or you will lose family forever", "YTA. You weren't hungry, you were craving pizza. You could have eaten anything else jus yourself and then go to dinner with everyone and have pizza there, you're not a child. Also, how big was this pizza that everyone else got to eat and got full?", "YTA. You could have gotten pizza before you went to your parents house or brought a snack with you too. I get hungry easily as well , but I was raised not to eat snacks before a meal. You did ruin this night for your sister. I would also be pissed to have a hard to get dinner reservation because someone wasn’t patient enough to wait to eat.", "YTA x 2000000 and I would neverrrr invite u ever again either", "YTA\nSeriously, you could have had a snack. Everyone but your sister is awful.", "YTA. But please explain in what scenario you wouldn’t be the asshole.", "YTA.   Everyone was full?   So you ordered enough for everyone not just you.   You didn’t run out for ONE slice you got PIES!   And really are you that demanding you need pizza NOW.  Have an apple and order pizza at the restaurant, you’re selfish", "YTA a little bit, but mostly the rest of your family is the asshole\n\nYour sister is upset because it seems like she was looking forward to the reservation and then,  apparently, the entire family essentially canceled on her at the last minute.\n\nYou were hungry and had a craving so you ordered pizza. That is fine. The issue is that you and the rest of the family then decided to eat so much pizza that they didn't want to go out anymore, leaving the sister all alone.\n\nA polite way to handle the situation would just be to have people eat less pizza. Have only 1 slice instead of 2 and then at the restaurant order something light.", "YTA, you obviously should have just had a snack knowing you had a commitment to dinner reservations later…", "YTA. 100%. You knew what the plans were and you sabotaged them. And you didn't even apologize. There was no reason to bring in enough pizza to feed a crowd a couple of hours before you were all supposed to go out for dinner. I wouldn't risk giving you a second invitation either. You still don't get that what you did was wrong and why. How can you be trusted not to wreck the new event? Maybe you wouldn't wreck it the *same* way. And maybe you wouldn't wreck it at all. But if you selfishly decide you want something and that something will wreck the plans, you'll do it anyway.", "Being hungry? Not your fault, especially considering your pregnancy.\n\nOffering food to others during the 3 hour wait until dinner? Not your fault.\n\nOffering enough food to fill the entire family to the point they skipped the reservation? Certainly you are the AH.\n\nIt could be argued the others in your family might have shown self control and refused the large amount of pizza - it can certainly be eaten later or the following day. Still, you enabled their lazyness and glutony and knowingly helped ruin your sister's hard fought dinner reservation.\n\nPersonally I'd apologise and don't blame 'pregnancy brain'.", "YTA and quite selfish.  As others have said pregnancy is not an excuse.  You could have gotten pizza the next day but instead you ruined everyone la dinner plans.  You also sound spoiled since your whole family was willing to ditch dinner for pizza.  Your sister is right - you should not be invited next time.", "YTA for the amount you ordered. To satisfy a craving you could have ordered a small one and shared that, and then for you personally you could have still eaten a different snack, without ruining everyone’s appetites.", "YTA.", "Why didn't you go to the restaurant early? Why didn't you think about making a reservation for an earlier time knowing you get hungry a lot? Why didn't you just have a snack? Oh that's right, because YTA.", "Info: How much pizza did your husband buy?  By all means feed the pregnancy cravings but did he get enough to feed everyone?  Why would he have done that?", "Yta", "Your sister was excited to go out to this restaurant for the experience of going, she had probably been thinking about it for a long time and thought it was going to be an adventure. You rained on her parade for some pizza and ruined the adventure.\n\nYTA", "YTA. Another pregnant woman who thinks the world revolves around her. Being pregnant doesn’t mean you get to shit on everyone else’s plans. There are things called snacks. When you get hungry, have one.", "YTA. Mother of 6, and have been pregnant 9 times. Stop using your pregnancy as an excuse to be inconsiderate and selfish.", "YTA. \n\n1) it’s super rude to order takeout a couple hours before a dinner reservation. Eat a granola bar and wait. \n\n2) if I screwed up and orchestrated a situation in which no one wanted to go to the dinner my sister was really excited for, I would double down on backing my sister. I would insist on going with her even if it was just us two, I would tell my other family members they could get dessert even if they didn’t want a full entree. The fact that you ruined the dinner plans and then left her to fend for herself with your fam is so incredibly shitty. Golden child syndrome for sure.", "Why didn't you just run out and and grab 2 slices to hold you over? Slightly TA because of the amount of ordered.", "YTA. If you didn't want to wait that long to eat you should have just had a snack. A whole meal? Especially enough for everyone else to eat? Their cravings. You can very easily control them if you try a little.", "YTA. A huge one.", "Yta\n\nAnd why was was enough pizza even ordered for that many people if only you wanted? Like what?\n\nWhy so pregnant people always pull stuff like this and then make it about that. There’s so many things that could have been done differently.", "YTA", "ESH, not because of the pizza, but because you ALL bailed and left your sister hanging. I hope you didn't leave the poor woman hungry and got her something", "YTA You ruined her plans, I would not want you around either you silly git.", "ESH (except sister) There are places where you can buy a single slice. If you were craving it all day I don’t know why you didn’t just get it for lunch. You had hard-to-get dinner reservations and then went about things in a way that ruined everyone’s appetite for eating at the restaurant. You do need to eat when you’re hungry but it sounds like you didn’t actually do that if you were craving pizza all day and then waited until a couple hours before dinner to get it. You also picked up enough to share. This realistically makes everyone who ate pizza an asshole along with you though because they’re all adult enough to know that eating pizza would make them too full to want a fancy dinner. For whatever reason, no one apparently wanted to go to the restaurant but instead of just telling your sister that immediately so that she could eat the pizza or find an alternative dinner, you all got full on pizza and then canceled on her.", "YTA", "YTA\n\nI almost went with NTA because you're pregnant but you should have just gotten yourself a snack, not fed the entire dinner entourage pizza until they were too full to go out", "ESH except the sister. Everyone knew there were dinner plans and ate pizza just 2 hours before the reservation, with predictable consequences to their appetite. You wouldn't really have been an AH if you just ordered a snack for yourself, especially considering being pregnant...but yeah you did contribute to the ruined dinner plans by ordering and sharing pizza with everyone.", "YTA - next time eat a snack and don't ruin your husband's dinner plans with the family.", "YTA you should have eaten a snack. Enough with the I'm pregnant excuse. Women have been pregnant throughout history. And most of them don't expect the world to revolve around them. And that is exactly what you did.\nYou could have ordered a small pizza or even a mini pizza for yourself but you decided to order 2 large pizzas for everyone to get full. Andthen cancel the reservation.  You knew exactly what was going to happen. That is what makes you a massive AH.", "YTA. If I was planning on going to a nice restaurant in the evening, I'd hardly eat anything beforehand and I'd be very hungry by the time dinner came around. I'd be furious if I ate very light in anticipation of a big meal only to have it cancelled because of your selfishness.", "ESH but your sister. You could have had a snack and your sister is overreacting (she was probably hangry), but seriously why did everyone eat pizza if they KNEW they were going out to dinner?", "YTA obviously. Why couldn't your craving have waited one day?", "YTA\n\nCravings aren’t a license to screw up the plans of others.\n\nThe number of entitled pregnant women on this subreddit is astounding.", "YTA - who eats a whole ass pizza before going to dinner? Big Baby behaviour", "YTA. Being pregnant is such a cop out for inconsiderate behavior. You could have had a small snack. I'm so over pregnant woman using cravings to justify selfish and inconsiderate behavior. Your sister has every right to be pissed at you, you spoiled the evening because you simply couldn't make a small snack and ordered enough pizza to feed everyone instead.", "YTA. Being pregnant doesn’t give you the right to ruin an outing being looked forward to by others. You could have had a snack or gotten an individual sized pizza (not caving in to cravings doesn’t hurt you, even if pregnant, btw). Selfish.", "YTA i'm so sick of the world bending over and catering to pregnant women.  You stole the evening.  You could have gone to the fridge and eatin a pickle or something small to hold you over.", "Yta", "why didn’t he order you a small one to tie you over til dinner? like a personal or small?", "YTA, and WOW what an unbelievable AH you are.... do you have NO self control?  You can't wait to have pizza later?  JFC.", "YTA. Make yourself a sandwich next time.", "Damn i feel so bad for your sister:/ I know how it feels and she probably gets treated like this often", "What would you do if you wanted so bad to go to  a restaurant and then your sister comes home with 2 boxes of pizza, everyone eats and you end up not going anywhere? YTA", "YTA, Just because you're pregnant doesn't make you the center of the universe.  You could have grabbed some cheese and crackers which would have fed your craving.  But instead you ruined dinner out for everyone.  Apologize to your sister and the rest of the family.", "Why didn’t you order a small pizza, eat a couple of slices, and put the rest away? Why did everyone gorge themselves in pizza three hours before dinner, then wait until the last minute to cancel the reservation?\n\nESH except your poor SIL. You and your husband owe her a lovely meal there after a sincere apology for *your* selfishness, OP.", "YTA I get needing to eat when you’re hungry when your pregnant, I literally threw up if I didn’t eat as soon as I was hungry and it always had to be whatever I was craving or it would come up anyway. What makes you the asshole is waiting until 2 hours before your reservation to get your craving (ordering at 5:45, it’ll take 15-30 minutes before it’s ready, then another 15ish minutes before it’s delivered to you or you get it so 30-45 minutes after ordering it puts it at 6:15-6:30), having it in front of everyone else, and then cancelling a reservation that you all knew someone was looking forward to. \n\nIf your family caters to your needs and wants over your sisters, I can understand why she wouldn’t want you invited to the do-over at this restaurant.", "You'll notice OP didn't say why they were going to the restaurant. What was the occasion? To celebrate something related to your sister? I wouldn't be surprised... YTA", "yta- so selfish and only thinking about urself, dont you have any pity or think about what it will cause  if you've been wanting it all day?", "YTA. And im willing to bet that the restaurant has pizza on the menu", "YTA \n\nWhy do I get the feeling this isn’t the only time you’ve screwed your sister over? Maybe this time she’s learned you’ll always destroy her plans just so you can be the center of attention.", "INFO: Why exactly did you want pizza so bad?   \n\\-Was the reservation too late for you?  \n\\-had you not eaten the rest of the day?  \n\\-Was the opportunity too good to pass up?  \n\n\nI feel like there is info I'm not getting and don't really feel it's fair to make a judgement without filling the holes.", "YTA for ordering so much pizza, it's practically dinner. You could've done many things different so yes, YTA.", "YTA, not for wanting to eat sooner, but for ordering a meal for an entire family when you KNEW true reservation was coming late in evening. You should have made a smaller personal snack, not make it a big thing and order out pizza. That’s all your fault. And using your pregnancy to excuse your poor planning is a complete disregard for your sister’s plans.\n\nThese actions would have not been acceptable if you were not pregnant. So why should it suddenly be acceptable if you are pregnant? Being pregnant does not give you a pass for being inconsiderate. Eating a snack or even a mini-meal before dinner would have been fine. But you completely thwarted your sister’s plans because, “I’m pregnant, and I had a craving, so it’s okay.”", "YTA.  You don't \"need to eat\" just because you're pregnant.  You're fine.  If you were truly hungry, you could have had a snack and still waited for dinner time.  She was counting on the plans that were in place and it does sound like it was all about you.", "YTA. You must be exhausting to live with.", "YTA. There was a plan for the evening and you straight up yoinked it as a power trip. \n\nIdc about cravings. When I was pregnant I was obsessed with mashed potatoes, I'd pick up a little snack size portion of some to take the edge off. I didn't make evenings about me and what I felt like having.", "YTA - you don't \"need to eat when you're hungry\" just because youre pregnant and everyone else bending to your cravings is mad. Think of someone other than yourself maybe? No wonder your sister is upset.", "Yta!!!! Fun fact.. pregnant women only need about 300-500 additional calories on top of a healthy caloric intake for themselves. \n\nBaby doesn’t want pizza. You want an excuse to exhibit poor self control and than blame it on the pizza. \n\nIf you needed pizza so bad, go to the local place for a slice. Common sense.", "First mistake was making the reservation for 8:30pm, I try to eat between 4-5pm so my stomach can digest my dinner before I sleep and so I’m not starving until 8:30pm.", "Yta look I had horrible morning sickness, so if I was hungry I’d get sick… so I get being hungry while pregnant and wanting what I crave…. But I just made sure to carry crackers so if I needed something to tide me over till a meal I’d have a few…..\n\nYou did this on purpose", "I mean. Clearly YTA. Your sister was absolutely correct. And your parents are also AH here too.", "YTA. Even if it would somehow be okay to order pizza 2 hours before a dinner reservation, you apparently ordered enough to feed 4 adults. That's not just 1 pizza because you have a craving, that seems intentional.\n\nOn top of that you had table at a restaurant that's difficult to get reservations at. Which you canceled. So now you're also TA because the restaurant has an open table that someone else could have filled.\n\nPregnancy is no excuse for this kind of behaviour.", "yta - you could have just had a snack, but instead you ordered pizza and fed everyone. you all knew you wouldn't be able to eat after eating that, but you did it anyway. This is 100% your fault. and if you keep doing it, your sister will resent you even more. Please stop being so selfish! She isn't overreacting, why wouldn't you ruin it again, you don't care about anyone else.", "There is so much more to this than pizza. You are entitled and probably have been your whole life. You have no remorse for ruining an evening out. Your hubby knows the owner, so it doesn’t effect you.Sounds like you always have an excuse for everything and are being enabled. Your sister is right and did not overreact. This is probably a pattern and she’s tired of it. Now that you’re pregnant you probably want to be treated like fine china and your cast of enablers is right there to tell you it’s ok and you’re the victim. \nYTA!", "YTA. Cravings are one thing, but you seem to be using the pregnancy as an excuse to do whatever you want, disregarding other peoples' feelings, and your family seems to be coddling you and enabling this behavior. I don't blame your sister for being upset, first you ruined the evening, then your whole enabling family took your side, and now you're belittling her feelings.", "YTA. Unless there was no food in the house for you to snack on, it's very odd to order a whole pizza when there are plans to go out. I've been pregnant, had cravings, yada yada and what you did was weird", "Never been this early b4. Comments so freshhh. YTA", "YTA, get some consideration for other people", "YTA. \n\nHave pizza the next day.", "YTA. I’ve had 3 kids and I don’t understand these cravings that literally put a wrench in other peoples lives and you think it’s okay. Why couldn’t you just have a snack? Why couldn’t you order a small pizza? Obviously, y’all ordered enough to feed several people. I wouldn’t want you to come next time either.", "Yta \n\nInconsiderate and I'd be pisser too. Plenty of time for pizza for lunch or breakfast the next day but you had to have it then and it's cause your so special and pregnant  🤰 lol hate that mentality.", "INFO: Who made the reservation and planned the dinner?", "It's a slight yta\n\nIt's pretty predictable that if you order pizza everyone will serve themselves. You can just grab something from the fridge regardless of being pregnant.", "YTA- You didn’t order a pizza just for yourself to satisfy your craving. You ordered enough for the whole house to have and eat and be full off of. You knew what you were doing 😂", "YTA, you're pregnant not 5 years old. Have some self control. Eat a snack if you're hungry and go out to dinner as planned.\n\nGet pizza the next day.\n\nAlso if you had been craving it all day, why didn't you get it for lunch?\n\nIve Been pregnant 3 times, don't use your pregnancy as an excuse for horrible behavior.", "YTA. Selfish and entitled.\nGee many girls in here has a ton of stupid excuses to use when they are pregnant.\n\n\"But i was craving\" \"i eat for two now\" \" the baby wanted\"\n\nGuess what, ones brain doesn't stop function because your pregnant, and it doesn't make it ok to stop being a decent human being to your family. I totally get why your sister won't want you to be invited the next time.", "Asshole. Gonna use the excuse that your pregnant to make this seem reasonable. Get over yourself.", "YTA, stop using ur pregnancy as a excuse to be an ah lmao", "YTA", "ESH  \n\n\nYou intentionally ruined your dinner because you were craving pizza. If you were a child, you would be chastised by your parents for making such a childish and impulsive decision. You're an adult now, so nobody is going to chastise you... but you literally derailed your entire family's dinner plans because you \"had a craving for pizza all day\".   \n\n\nYour sister is not reacting to the dinner plans. Not sure what she's reacting to, but she pointed out that make \"everything about you\"... which means she's alluding to some baggage that she's pulling in. Most likely, this is a pattern of behavior on your part (at least from her perception) and she's not broaching the topic with an eye towards reconciliation because she's angry. If it was about the restaurant, you're right... \"I can get us in tomorrow, I know the guy who owns it\" would've been the end of it. Her reaction is indicative that what she's saying isn't really what she means and she isn't sure how to talk about it. But her reaction is also not really conducive to conflict resolution.   \n\n\nEverybody else just sounds like they're caught in the middle of some weird sibling tensions", "YTA. Your purposely AND unnecessarily ruined your sister's plans. You easily could have ordered pizza delivered all day, but instead you waited until 2 hours before everyone was supposed to go out to dinner and you ruined their appetites. You can be pregnant and an asshole", "YTA! You just should have had a bar or something to hold you over, so rude what you did.", "INFO: How many pizzas did you order? And of what size?", "YTA, having cravings isn't an 'eat now or die' situation. Do you have no self control?", "YTA. If it was you craving pizza, you could have ordered it earlier in the day, and just get one for yourself. Being pregnant isn't an excuse.", "YTA. Things Like that seem small but are super infuriating,. Don't order a family pizza when you are planning to go out. There are good trucks that sell slices of pizza, get one of those!", "Info: was this a regular dinner with family, or a special occasion?  How often do you go out like this as a family? Who planned the dinner? Making reservations for the entire family at a restaurant where it’s hard to get into does not seem like a random dinner and probably is difficult to plan.", "YTA but IMO not as big of an asshole as some other stories I see on this sub. but don't pat yourself on the pat your sister is right to be pissed at you AND right to assume you'll do it again because your past behavior is the best predictor of your future behavior.", "YTA.  Being pregnant and hungry is no excuse for what you did.  You could have had a snack and waited for dinner.  You were acting entitled to have pizza ordered when everyone was waiting for dinner reservations.  I wouldn't trust you again either.  What will it be next time?  Your pregnant self has an upset tummy so you're not going, then your husband doesn't go because you're helpless to be left home alone?", "INFO:  Kind of a tough one... I mean, how much pizza did you order that everybody ate so much they no longer wanted to go out for dinner?  Was it a craving so eating some kind of snack wouldn't have worked?    How old is your sister?  Could it be a case of (not your fault or anything) but that being pregnant might have you being put as the center of attention and she is younger feeling a bit ignored/put out?", "YTA and you know it", "YTA. Being pregnant isn't an excuse to ruin the already previously explained dinner plans. If you are hungry, make a sammich. I was an AH when I was pregnant and my best friend paid a good amount for a nice buffet dinner. All I ate were oranges with salt. Then had 6 different burritos and didn't eat any of them because none of them were made correctly. They explained to me that I was being ridiculous and though I didn't want to admit it, I was. We laugh now but being pregnant is not an excuse to make everything about you.", "YTA u should have eaten a light snack. It was rude to cancel.", "Is this your first kid?\n\nYTA either way", "YTA. You pulled the rug out from under someone who was looking forward to a specific event. It may not be a huge thing but if you're looking forward to a nice dinner at a restaurant and then everyone around you cancels it's extremely annoying. Why couldn't you just wait, or make yourself a small snack? You're an adult come on.", "This is easy - YTA.\n\nThe family had a dinner reservation and you didn't care. I'll grant that 8:30 is a little late for dinner, but you could have easily had a snack to hold you over.", "YTA: I was craving some weird shit and alcoholic cocktails while I was pregnant.\n\nI didn't drink the alcohol or eat the weird stuff.\n\nYou don't have to cave into every single craving, and you didn't need to for pizza. You could have had some control and snacked on something else until you had dinner. \n\nPregnancy is not an excuse that everyone should abide your wishes.", "INFO... Did you tell everyone that they should all eat pizza and cancel the reservation and then order enough for everyone and encourage then to eat, or did you just have your husband pick up pizza and everyone else decided to eat it? If you wanted pizza instead and was still fine with going out after, even if you would not eat there, then NTA but your family is.", "NTA. You didn't force anyone to eat pizza.", "ESH. You're all acting like children. Who orders large pizzas right before a dinner reservation? Her reaction seems OTT too.", "YTA.  You will ruin it again.  You enjoy wrecking things your sister looks forward to.", "Holy shut are YTA. I’m really really interested to hear some more excuses for why you suddenly don’t have to be a decent human being.", "YTA, just… unnecessary. So unnecessary. Ever heard of delayed gratification?", "ESH -- You probably could have just had a snack out of the kitchen to hold you over.  \n\nWhy did you husband order pizza for everyone, when only you are pregnant and HAD to eat right then and there?  Everyone else could have waited for the restaurant.   \nI'd have been annoyed if I were your sister, mainly at everyone else, but at the end of the day it's just a restaurant reservation.  Get over it.", "YTA.  I get that you’re craving pizza but maybe instead of ordering Pizza you could have just made a peanut butter sandwich for yourself or something. You could’ve fed your a pizza craving later at the restaurant. Even if they don’t have pizza, I’m sure you could’ve had something with cheese and tomato sauce that would’ve fit the bill.\n\nYou’re not TA for having a craving but you are TA for treating the craving like an emergency situation, and then ordering so much of it that The entire family lost their appetite for dinner.", "ESH, you didn’t force anyone else to eat the pizza and if everyone knew the reservation was for 8:30 they should’ve not eaten it. Your sister has a right to be upset, but I think it should be aimed at everyone not just you.", "I’M PREGNANT FEED ME AND FULFIL ALL MA DEMANDS OR I DIEEEEEEEEE AND YOU ARE BÉBÉ KILLAHHHHH", "YTA. You might have been craving pizza due to pregnancy, but the other people involved were craving a dinner they had been looking forward to. You could have had something from the fridge or had hubby get a small frozen pizza for you, but no, you ruined the whole planned evening for everyone.\n\nThe dinner wasn't just about you.", "YTA plain and simple. Pregnancy doesn’t give you rights lol", "ESH Good lord, please, act like adults, all of you.", "Yta.", "YTA", "YTA. As a pregnant woman you may have needed a snack to hold you over. A pizza is not a snack; you are an adult and need to exercise some self control", "YTA, not the end of the world but holy crap don't do that again. Exceptionally poor taste in every way.", "YTA. You acted in a completely self-centered manner with no regards to anyone else", "Congrats on being pregnent. NO It not an excuse to be selfish YTH", "YTA- Cravings are temporary. You said yourself that you know this is a hard restaurant to get a reservation at. Regardless of if your husband knows the owner, you knew your sister was excited. If, by chance, you are still craving pizza later or the next day? Then you order pizza!\n\nBut if you truly wanted pizza *that* badly, go out and get yourself a slice. That way, you don't drag others into your decision. That way, if you feel too full, you're the only one not going to the dinner. Instead, you chose to order enough for everyone, most likely knowing the implications.\n\nedit: word", "ESH. Your sister for uninviting you for future events. You for not waiting to satisfy a craving. Your family for making you the golden child.", "yta", ">my dad told her I was pregnant so I needed to eat when I was hungry but it’s only made her more angry with me.\n\nNonsense. You were just selfish and anti-social. YTA.", "YTA.\n\nYou're childish as hell.", "YTA. If you had been craving pizza all day you should have ordered some for lunch (around 12 or 1), problem solved", "Why not just order enough for you to get you to 8:30? You didn't have to order 2 large pizzas. Smalls exist for this exact reason. Everyone but your sister is an AH here so I'm going with YTA since it could have waited and you didn't have to order enough to feed an army.", "YTA\n\nAnd it seems like your sister should know better since I wouldn’t be surprised if this wasn’t the first time this happened.", "YTA. You should not have ordered the pizza period. If you were craving it, then you should have had some prior to getting there. Being pregnant isn't an excuse for being flat out inconsiderate.  AND if you were going to be a brat about it just order for yourself. Ordering enough to ruin everyone's appetite is petty and rude. Obviously, there was a reservation, but you made it all about you and if I was your sister, I wouldn't want you there either.", "ETA you could have ordered a pizza slice instead. You did not have to ruin your appetite. Pregnant is not an excuse for everything. About half the people on earth go through that, and most of them do  not become self-catered A's. \n\nEveryone else could and should have respected the dinner reservation and not ordered pizza just because you wanted some. They are TA big time! \n\nAnd your sister should not blame you alone for all of her family caring so little about her that they ordered pizza and bailed on going to the restaurant with her. \n\nI hope she has some friends who actually care about her, who she can go with.", "YTA. You could of gone to the the fridge and made pizza toast to hold you over, or something. Your sister has ever right to be pissed.", "Absolutely YTA.\n\nMaybe I'm a little jaded and suspicious but the way you snuck \"oh I'm pregnant\" makes me pause and wonder if you are actually pregnant. My suspicion tells me you're not, you know you're an asshole, and you snuck that little blurb in thinking \"oh, Reddit won't vote a pregnant woman an asshole for eating.\"\n\nMaybe I'm the A-H for being suspicious but at the end of  it all, pregnant or not, you are the asshole. Goodbye.", "NTA. You were pregnant and hungry and ate early enough that you knew you could still have dinner a little later. Everyone else besides you sister sucks for also eating the pizza knowing they weren't that hungry and wouldn't want to eat in another couple of hours. You didn't force them to eat pizza and it doesn't sound like you were intending on ordering pizza instead of going out.", "YTA. this was a frustrating read for sure.", "YTA. Make yourself a sandwich. Pop some popcorn. Eat a granola bar. There are a zillion ways to eat enough yourself to hold yourself over til dinner without ordering a whole other dinner for everyone.", "YTA:\n\nYou could have waited another 90 minutes.  That would have made dinner that much better. You really had to make it all about you tho.", "YTA. Like so many people have pointed out, you could have had a snack for yourself to satisfy your pregnancy cravings / hunger without sabotaging everyone else’s plans.", "YTA and while I default to a lot of leeway on pregnancy, it isn’t an excuse here. Make it up to your sister.", "You’re pregnant not disabled you could’ve eaten something small instead of ordering pizza for everyone. \n\nYou did ruined her dinner plans and being a no show to a reservation is just rude. Your sister should have gone by herself and enjoyed the restaurant without you.  \n\nYTA", "Yta. Why could you just eat something small so youd be hungry again come 830? This was very selfish of you.", "NTA. I'm gonna make the absolutely wild assumption that OP didn't order enough pizza for everyone before asking others their thoughts. ('hey, I'm ordering some pizza, do you wanna wait for the dinner later or want some?')\n\nif others went along with her change, and everyone but the sister was happy to eat pizza, then the sister is the AH here for being intolerant of a change in plans.\n\nit sounds like that is the case. everyone but the sister was happy to just get in on her order and eat pizza.\n\nalso, 830 reservation? nobody else is noticing how problematic this is with pregnancy lol. like sureee, a snack will hold you over for the 9hrs between lunch and the reservation even with the extra load of pregnancy.. give me a break\n\neven if she didn't ask anyone else and simply ordered pizza, others ate it.. clearly they wanted to.. it seems the sister is the only one upset here and it's because she was too attached to her plan", "I feel like it's everyone's responsibility to not eat too much, you're all big enough to know how much you can eat.", "NTA jeesh people. She didn’t force feed the other people to make them full.  She got herself some damn pizza and everyone else changed their mind at some point about dinner.  Sucks for the sister but no one is the asshole - sister is just outvoted.", "NTA. Im not sure how its all OPs fault, when everyone ate the pizza but the sister. Clearly, there were others that didn’t really feel like going out lol. Making a reservation doesn’t mean you are forced (as an individual or a group) to maintain that decision. And you absolutely should eat when you’re hungry, pregnant or not. If everyone was still gungho to go out, they could just get drinks/apps. Clearly the sister was the only one really itching to go.", "Do you have a history of this? \n\nYTA", "Idc what anybody thinks,im gonna go with NTA.\nOrdering pizza was your choice,its not your fault everyone wanted to eat it.But that being said you could've had a single slice or something.", "Truly ESH. \nI totally get that you're pregnant, and obviously I don't know what's in your kitchen, but would you not have been able to sneak a little snack for yourself, to hold you over until you went out to the restaurant? You didn't know that your entire family would dive head first into the pizza, which makes them suck too. Then deciding not to go to the restaurant because they all felt full? More. Your sister, for blaming everyone because she wanted to go to the restaurant that night. Even the restaurant, for making it so difficult to make reservations! I think this can be a \"lesson learned\"kind of a deal. Having a snack before going out to eat is one thing, but devouring an entire Pizza could be a game changer, so let it go come apologize to your sister, let her have an extra dessert when you do get to the restaurant.", "Everyone else couldn't control themselves so you get blamed? NTA", "Husband ordered the pizza. Did it occur to anyone that he got a good deal and was planning on leftovers? \n\nI say NTA. I'm a T1 diabetic and I hate when people make crazy time meal reservations....I'd have had major problems with an 830 dinner rez. Maybe she just wanted a snack and was going to get dessert at the restaurant you folks voting that she's the ah are making some assumptions about intentions.", "or you also could have waited until after the dinner?", "YTA. Pregnancy doesn't give you a pass to be this selfish.\n\nPeople like this know they're the AH. It's why they make throwaways lol", "Eating when you need to eat is fine. Disrupting everyone else's plans in inconsiderate. YTA.", "YNA\n\nAren't the others at fault here? \n\nWhat your father said is true, you are pregnant and should eat when you want to. If the rest of your family, who are not pregnant (!!!) can't hold themselves back for two hours, it's entirely their fault. It would not have made much of a difference if you were the only one full.", "YTA x 1000000000. You acted selfishly and entitled and now are completely dismissing her feelings. You did not need to order pizza. Pregnancy is not an excuse for asshole behavior. I would disinvite you too.", "YTA. News flash: pregnancy cravings can be held off until later. Just because you crave something NOW doesn’t mean you or your baby will die if you don’t get it right away. You should have just snacked on something available to tide you over until you were at the restaurant. Actions like these contribute to making pregnant women seem crazy and unreasonable.", "NTA you can only control yourself and nobody else. You were craving pizza, you’re pregnant, you ordered something for you, but everybody else ate too and got full which you didn’t know would happen. You can get another reservation and it’s through your husband so it’s unreasonable for you to not be there for the reservation. Your sister needs to chill", "NTA - I think your sister should get over it unless she's a teenager and can't go out to a restaurant on her own time and dime.  If I had a pregnant sister who needed pizza and that pre-empted my plans to stuff my face somewhere else, I would be alright with it.  I do hope you cancelled the reservation with enough time for the restaurant to fill the table so that the staff didn't have to sit around without getting paid.  Your sister was probably HANGRY especially if she didn't eat any of the pizza.", "YTA and extremely selfish and childish. How often do you crash a get-together and make it about you? There’s no way you haven’t done this to your sister before. Your parents enable you.", "BRO WHY IS THIS ON AITA!? \n\nOP: Am I the asshole for being hungry?\n\nThis Sub: Umm yes 🤓", "NTA, the pizza was for you. You didnt make everyone else eat pizza.", "YTA. I get being hungry. I would be starving if I had to wait till 8:30 to eat. And I get wanting pizza. What stopped you from making white bread pizza.  Or ha I g a piece of fruit to tide you over until dinner, you are an adult not a toddler.", "YTA you’re selfish", "NTA.  If a pregnant woman is craving something you go through hell and high water to get that thing for her.  The rest of the family lacking self-control is not OP’s fault.  Still sucks for the sister though.", "YTA.  Go and get a small personal pan pizza that feeds one person if you wanted it that bad.  Don’t ruin everyone else’s plans.", "NTA - just because you wanted pizza doesn't mean EVERYONE had to eat it. That's on them. \n\nI get why your sister is mad, but she shouldn't be mad at JUST you - turns out everyone wanted pizza instead. 🤷‍♀️", "YTA. apologize to your sister and make a new res somewhere she likes.\n\nYour intentions dont seem malicious. But YTA once you order 2 large pizzas and share them.\n\nPlease don't respond with how many pieces you would have eaten or some other excuse like your other comments.\n\nYTA. Own it and be better", "Whoever scheduled a dinner reservation for 830 is TA", "I feel like I need more context. What was the dinner for? Why are you all together? Is there something special happening?", "ESH, I don't really get the judgements that are putting this all on OP. Everyone eating their fill in spite of the reservations wasn't OP's choice. How did it go from your husband ordering you some food to a meal's worth of pizza for 5+ people?", "I'm a bit agog at the responses here.\n\nI, personally, CANNOT be in a room with pizza (or any food I like) without eating it. This is a big personal problem of mine.\n\nAnd that's what it is: A Big Personal Problem of MINE.\n\nThat the family decided not to exercise self control is a Big Problem of Theirs, not of OP's.\n\nI do think OP should have ordered just for herself, and I think in that case everyone would have or should have understood, we got a pregnant lady here, extra hunger, strong cravings, not hurting anybody, it's not rude for her to eat a bit o' pizza now.\n\nBut ordering a lot didn't make her an asshole, it just meant she made a mistake in judgment. The FAMILY are assholes, for not controlling themselves. And remember, I say this as a person who CANNOT CONTROL themselves in a situation like this. I'd end up being one of those assholes. But an asshole I would be.", "ESH - I stand by your right to have pizza but your family also did not have to stuff themselves if they truly wanted to go", "I like how 'pregnant' and 'periods' are being used as best excuses 😅", "YTA. And your parents are enabling you. Cravings don’t mean you order everyone pizza. Yes, you need to eat when hungry and 3 hours from dinner, but that isn’t what you did. The fact that your dad supported you is bizarre. Have you always been the golden child?", "This is such a pointless post I don't even want to vote. \n\nESH", "Seriously. Like how much pizza did she even order that 3(?) grown ass adults became full. At that point, she clearly wasn't intending on going to the restaurant anymore.", "I’ll say YTA.     How much pizza did she get that fed the whole family? That’s at least OP and husband, the two parents, and enough to offer the sister some too.  It sounds like she got *at least* two pizzas.    That’s more than a quick snack for one person.\n\nI also gotta say, how does the whole family decide to eat so much pizza they can’t go out? I’ll say OP started it by not getting just a snack for herself and ordering enough for a whole family meal, but the rest of the fam kinda sucks too for ALL of them eating enough pizza to cancel plans.", "YTA GAH! I’m so over this. \nYou do not get to be completely selfish regarding food when pregnant.", "Am I the only one also wondering if maybe this fancy dinner was some sort of celebration meant for her sister? Because that, for me, would explain a lot. I feel like OP wanted to sabotage the dinner and since the sister is the only one so upset, part of me feels like maybe there's a missing detail here that OP is deliberately leaving out.\n\nYTA", "Or, you know, be an adult and accept that not EVERY craving must be fulfilled at any moment. I’m so tired of pregnancy cravings being an excuse for terrible behavior. \n\nYTA OP", "Adding to this. It's so unfair on the restaurant to cancel a reservation last minute. OP is very inconsiderate.", "Yeah in this case I would pick up something that’s a single slice, why did they order so much pizza?", "She could have used her pregnancy to get HERSELF out of going to dinner if she really didn’t want to go. “Hey, sis, I’m kind of tired, don’t think I’m going to make it to dinner at 8:30. Ya know, pregnancy.” Then order a personal pizza for herself and call it a night while everyone else still went out for dinner as planned. This is why she’s selfish and clearly wants to be the center of attention. No one else besides her and the sister even needed to be told there was pizza involved.", "She was craving pizza ALL DAY! why not get pizza at lunchtime? Why wait till it was almost done time and then order a whole party worth of pizza?", "I'm sick of reading about these selfish AHs who act as if they are the first people on the planet to be pregnant. I don't blame the sister for being angry. I bet the OP is the favourite and acts even more of a princess because she's pregnant.", "Agree, OP YTA\n\n> My sister is blaming me for us not going to the restaurant and has accused me of making everything about myself.\n\nSeems pretty spot on to me!", "That's a good point that I hadn't considered.", "Eh, I kinda think esh. Even ordering a full pizza didn't have to ruin dinner; everyone has a single slice (maybe preggo op takes a few cause she's craving it, whatevs) they'll be hungry again by 8:30. They didn't have to fill up, no one forced them to. \n\nOp is definitely an AH for ordering that much, but everyone else also sucks for filling up when they know they have a reservation. Especially when one person has made it obvious that they really, really want to go.", "Multiple large pizzas. Not even just an entire one 😂", "Hard agree as a currently pregnant person. I’m actually super pissed that OP is using pregnancy as an excuse here. It isn’t an excuse for this Ahole behaviour. Ordering enough pizza to fill up everyone to the point that nobody wanted dinner was completely unnecessary. In fact all those in this story who gorged themselves on the pizza are assholes. Have one slice and be done.", "But she had \"Pregnancy brain\" so it doesn't count. /s", "I HATE when people use pregnancy for an excuse for bad behavior or to get out of things.", "Agree - and I’m currently pregnant. I prepare by having snacks and will get something small if needed so as to not ruin dinner for myself and my husband. And that’s just for week night meals! Much less for a nice restaurant/reservations that are difficult to get/and LOTS of people involved!!", "The special priviledge attitude will carry on after the baby is born. We all know people who think they get special treatment in friend/family situations for being a parent or coworkers who's time is \"more important\" than the ones without kids.", "The snack could have been a few slices from a small pizza. I would say the husband and others are ah for all filling themselves.", "And what about the rest of her family who decided pizza was the better option? \n\nDo they get excluded from the plans too?", "Yeah.  I've been pregnant three times and i absolutely had cravings.  It doesn't make you insane though.  Sure, you might really be craving a certain food, but never to the extent that you can't wait until the next day or something. YTA", "As my mom would say “there’s food in the fridge at home”", "even if she got pizza she could have ordered a small one for everyone to share and call it an appetizer or whatever, not enough for everyone to be full", "Right, make a piece of toast.", "I feel like too many women take the whole “eating for two” thing way too literally. Like, a typical baby is, what 6-12 lbs at birth, so much smaller until then? You don’t need to eat literally two times your daily intake lol. I’ve always heard 250-500 kcal over normal (not now or ever pregnant, so those who are/have, please Correct). I know cravings can be tricky, but, if you are able to go out to a place with reservations, you aren’t destitute. You can hecking wait, you’re not gonna starve.", "Wow, YTA. You just didn’t want to go out to dinner. That’s the only reason “your husband” would have ordered enough pizza to feed at least 4 adults at 5:45 in the damn afternoon. \n\nYour sister is right, you were an entitled ass.", "I hate when people pull the pregnancy card and then gorge themselves on fucking PIZZA! Like eat a carrot lady!", "I agree. Why couldn’t she have made herself a sandwich to get through until dinner? Ordering a pizza when you know you’re going out for dinner is rude.", "Apparently she ordered *two* whole pizzas. That’s not *I* was hungry, that’s I want everyone to eat.", "BC then the center of attention wouldn't be on here. OP clearly just wanted attention bc she's \\*gasp\\* creating life. \n\nto quote Olivia Wilde in the movie Butter: \"You want a cookie bc you're pregnant? pfft I get pregnant like once a month\" Get over yourself YTA", "She should've just gotten something small from the fridge", "She ordered two large ones...", "Right? “Craving pizza all day”.  Then order at lunch time.", "My thought exacly, how big was that damn pizza?", "I'm with the sister, better not invite her next time to play safe. Neither she nor her family seem to have any self-control, and who knows what she will crave then. YTA OP.", "Right, she had a craving for pizza so she ordered like 4 pies? I'd be pissed too if I was excited for a night out and then everyone bailed at the last minute, I think I'd be pissed at everyone though, not just her. \n\nUnrelated but 830 is WAY too late for dinner for me, but that's a different story.", "Right??!! I'm pissed off on behalf of the sister too.", "That’s what I was thinking", "that is a pretty common time to out out in many parts of the world. In some places that is very early to eat dinner.\n\nI remember in Egypt we went out \"really late\"  for our evening meal, the hotel hadn't turned the BBQ on yet.", "Amen.", "Ya ordering pizza isn't the AH move, but ordering so much is.", "Exactly - and if the craving was specifically for pizza, there's a room of pizza akin snacks. Hell, a tortilla woth tomato purree and cheese does the job, she should've made do and waited.", "Or ordered a smaller pizza, just enough for a small slice each with maybe some extra for OP. One small slice of pizza isn’t going to totally fill most adults appetite. It’s like a pizza appetizer a couple hours before the meal. \n\nThere could have been a compromise, but OP bulldozed those plans knowing her sister was looking forward to it. It may not even be about the restaurant exactly. My family never did many sit down meals together. It’s like pulling teeth trying to get them to go out and enjoy each other’s company at a restaurant. It’s just as much about the food as the experience for me so that would be an added layer of disappointment if I was OPs sister. \n\nIf I was the sister I’d be plotting my revenge, junkfood for the kids from auntie right before meal time once they are of age. Then auntie goes home when the sugar crash happens. lol", "And they had a reservation for how many ppl, >5? Not to show up or cancel it on time makes OP an extra AH!", "That’s what gets me. Why order enough pizza to feed everyone till they were full??? I can just imagine OP saying “everyone dig in!” as the sister stands there trying to remind everyone about the dinner reservation. Jfc.", "Probably ordered one of each because she’s pregnant and craving them all", "And enough pizza at that to feed an entire family to the point they don't want more. That's way more than \"a\" Pizza. We have her, her spouse/so, her sister, and both parents. That's five people. If she ordered one pizza, even a large, everyone gets one slice and pregnant woman gets two. She ordered *several* pizzas and everyone ate enough to be *full.*\n\nShe could have very easily ordered a single small pizza and eaten a few sliced and saved the rest for later. Or a calzone. Or any of the billion pizza bread options. Or sent someone to the nearest grocery store/convenience store and nuked up some pizza rolls.\n\nBut, some two hours before dinner, she chose to order *multiple* pizzas.\n\nSo over the top and clearly a power move.", "> You are a grown adult.\n\nI'm afraid for how her child will turn out if she handles herself so childish.", "I know, everyone here saying her a small pizza- that certainly would be better, but also rude and inappropriate. There were reservations, op should’ve planned accordingly and could easily have just had a freaking snack instead of two diners", "Even ordering a single slice of pizza would have been okay, not ordering enough for several adults to fill up on!", "Seriously. Peanut butter and jelly on toast was my go-to when pregnant and starving.", "This is exactly why I think they're the asshole. If they wanted a snack because they were hungry and craving pizza then a personal sizes pizza would have done the trick and not fed everyone else. YTA OP because you obviously ordered enough pizza to change the evenings plans and you did it on purpose.", "Right, you ordered a large pizza presumably, and offered it to everyone. This is what Pizza Rolls are for. Have a few yourself and don't ruin anyone's appetite.", "Agreed", "Or get a single slice, not enough pizza to fill several adults.", "Court adjourned, bring in the dancing lobsters.", "Thank you that's is what I said. She knew exactly what she was doing when she pulled this stunt  she should just say that she doesn't like her sister", "This, it wasn't like OP only got 1 pizza or a slice to hold themselves over, they got enough for everyone to have their fill and be full enough to not want to go to dinner. Def YTA move.", "Haha for real! Currently pregnant and I always have cravings and always end up eating bananas or pretzels.", "Or order one small pizza.", "I don’t think it matters if the reservation was for a special occasion or not. A dinner reservation is a planned event. This family completely disregarded the sister’s plan for them to share a meal together. Something that was planned in advance, prior to the pizza. OP YTA.", "OP could have gotten a single slice of pizza to tie her over, they Def are the AH plus they ordered so much food.", "Wait, what's toast with pizza?", "Right!  Why did anyone even let them order that much pizza???", "I did, it was all that stopped the nausea. But she's still TA, I'd have made a sandwich.", "Or even just ordered a personal pizza for yourself", "I don't want to lay this at the feet of pregnant people. This is OP being inconsiderate. She was probably inconsiderate before, inconsiderate now, and will continue to be inconsiderate all the way to a nursing home.", "This. “But I’m pregnant!” isn’t the get-out-of-jail-free card you think it is. You could have had a snack and not ruined everyone else’s plans.", "Or honestly pizza rolls as a snack", "This is my thought. Though I'm also of the mindset that I want to know did she order pizza for everyone or did she order pizza in a cost effective way with a mind for leftovers. Bc like when I have ordered pizza in the past a personal is way less cost effective than getting two large one toppings and then you can eat the leftover for like 5 days. \n\nBut definitely her family made the decision to eat the food and then not go out, why is the sister not mad at them? Also, did OP also refuse to go out saying she was full?", "I had to come so far down to see someone that I agree with. ESH. They’re adults, they make their own choices, OP didn’t force feed them. Sure she could have ordered less pizza, but there’s other people at blame here.", "I think entitled, selfish people have always been that way but just use pregnancy to ramp up the attention seeking, shitty behavior.", "Being pregnant is hard, yo! I'm 8 years out from my last pregnancy and my body still hasn't recovered properly. There is a reason everyone bends over backwards, pregnant women are literally creating another human. It's not easy and at the end you have to yeet a watermelon out your who-ha. \n\nThat said, I agree with everything else you said. OP should have had a snack instead or mentioned 8:30pm is too late in the first place. Catering to and bending over for pregnant women has its limits.", "The world bends over for white men, not pregnant women. Have you seen the mortality rates for births?????? When have you bent over for pregnant women? I haven't. That seems like a personal issue.", "The world doesn’t do this.", "For the first question, they wanted pizza bcs she's pregnant and had a strong craving", "Watching in real time lol", "I know. Algorithm is finally working in my favor.", "Or earlier on in the day, she was craving it all day but waited until the last minute to order one", "Literally could have ordered just a couple slices only enough for her or simply only let everyone else have a slice so that there would be no way anyone else could be full so they'd have room to eat out.", ">It's pretty predictable that if you order pizza everyone will serve themselves.\n\nI will say that is on the other family members. It is their fault for choosing to overeat, not the OPs.", "This. OP you've missed out important info that I suspect makes you look like TA. Pls tell us.", "In another comment she says its 2 large pizzas", "She ordered 2 large pizzas", "Idk it can be hard to get people together for dinner. Maybe the reservation was hard to get or at a place the sister wanted to experience with her family. Clearly it was something she was looking forward to and based on the response, it seems like this isn’t the first time something like this has happened", "OP says in her explanation that she specifically ordered enough pizza for everyone.", "OP, once your pregnancy is over - what are you going to do to be the center of attention?", "2 pizzas for a total of 16 slices", "I've been pregnant and I find these letters a little crazy.  I definitely ate a ton of salt n vinegar chips when I was pregnant (my personal common craving) but I never threw tantrums or sabotaged dinners.\n\nYTA, op.", "You didn't read the story very closely.   \nThe dad told the sister this, not OP", "right?! i survived a pregnancy and never managed to ruin anyone's dinner plans. get a damn snack and shut up already. i can't with these women who think that being pregnant means they're entitled to whatever they want.", "I wonder, are we going to find out it was the sister’s birthday dinner or some other special occasion which OP conveniently “forgot” to mention? 🤣", "I mean, I think you do. OP eating a personal sized pizza or a single slice even wouldn't have made everyone else not hungry. Sounds like they all didn't really want to go to this place.", "It's not exactly OP's fault that everyone else ate her pregnancy craving food and then didn't want to go out for dinner.", "This is what I don't get. The lack of self control from all the others is sad. Leftover pizza is awesome. Have a slice and then go to dinner later. Ruining your appetite because someone else bought pizza is sad control.", "Sometimes I really understand pregnant people going through it, but sometimes they’re spoiled and stupid about it. OP isn’t the former.", "I was obsessed with mashed potatoes, and had to eat on a schedule because of gestational diabetes. \n\nI didn't make the world revolve around it. I kept little snack portions available. And I would have simply cancelled on such a late dinner, vs making such a big show of ordering enough dinner for everyone.", "Pregnancy brain is a very real thing, but it’s no excuse to be an A-hole.", "You'd be astounded at what this sub will bend over backwards to excuse if a woman is pregnant. Literal felony assault is fine as long as she's knocked up! Extreme levels of emotional and verbal abuse? Perfectly fine, hell if it's against a man they'll find a way to make it his fault!", "So is OP who ordered a whole damned meal. I'm sure there was something in the house to snack on.\n\nI've never read a case study saying that a pregnant person has suffered any I'll effects by not getting exactly what they wanted to eat. They're weaponizing their pregnancy to get their own way", "How much pizza did she order for just her craving if it was enough to fill up everyone?! Like that’s not an insignificant amount of pizza and not like they would’ve ordered more after she got herself a small one type thing.", "I’ve never been pregnant, so I wondered about how strong cravings really are. It seems like a pretty recent idea that pregnancy cravings are so overwhelming  and and unbearable, that you can’t be held accountable for what you do to get food.  I’m in my 50s and I never remember my friends, sisters or coworkers eating other peoples’ food, or having a tantrums, or demanding their husband go to the store at 2AM in a rainstorm, or the other crazy stories I see on this sub", "I haven't been pregnant, but I am diabetic. If I need to eat I just tell the group \"hey, I'm gonna have a snack, I'm low\" and then we just go out to dinner after I've retested. I'm curious to know how much pizza OPs husband actually ordered for everyone to get full, if it was just for her. YTA, OP.", "As my mom would say, \"eat an apple.\"", "Correct- it is not much more you are supposed to eat. You also have the weight of the placenta, etc, that add on physical weight to you, but people go wild.", "Lol, yeah. I saw “Everyone was full” and thought “Damn, how much pizza did you order?!?” \n\nAlmost feels like OP didn’t want to go out to the restaurant so vetoed it in this way. I understand sister’s frustration", "You wonder if this is a whole thing with her and her pregnancy. \n\nTeehee oops pay attention to the pregnant lady, don't be mad at meeee, I couldn't help my baby brain.", "YTA-I was wondering how 1 large pizza would fill a group of at least the 4 mentioned adults plus I'm assuming more (mom, and sisters partner not mentioned). OP also doesn't mention why they couldn't get the pizza they were craving earlier or before people arrived", "yeah, this is absolutely AH move", "that is 2 huge pizzas if if feed an entire family to being \"gorged\"", "Wow, that is such a shitty thing to do.", "Not to mention if it's a place that is hard to get reservations to, then I bet you want to dress up, maybe shower and do your hair/makeup. I would be pissed if I did that, maybe even had to get a sitter for a baby, and my sister ruins it by turning it into a pizza party at home", "It was definitely too late for me to eat dinner when I was pregnant. By 8:30 I would have been passed out for an hour already.", "If it's a popular restaurant that's hard to get reservations for, I've definitely had to settle for weirdly early or late reservation times. I'm assuming it's the same case here.", "8:30 is normal for me. I rarely have dinner before 8 even at home", "I've a funny feeling OP likes being in the limelight. \n\nFunny how she's trying to downplay how upset the sister is too, makes me think this is not the first time something like this has happened.", "Or eat one slice of pizza and have dinner 3 hours later.", "On the other hand though, the rest of the family other than sister made the decision to eat the pizza. They all are also supposedly functioning adults that could have said “I’ll pass, thanks,” if they wanted to go to the dinner.", "I may have not been clear - \n\nmake a piece of toast, butter it, slather with sauce and cheese.  If you want you can broil it.\n\nI also make \"skillet\" pizza which is cheese melted in a small skillet and crisped. slater the top with toppings and you have  a personal pizza. Again, it can be broiled for bubbliness if you want it", "Very true! I didn't think about the possibility of her not feeling well. But for sure she could have made a sandwich or had some kind of snack while she waited for dinner.", "I agree, it’s more the aspect of using pregnancy as an excuse to be rude, and the. Shocked when called out. Like, but I’m pregnant how can you be mad?!", "We should definitely adjust and accommodate pregnant people, but I agree in this case she is leaning on it to justify shitty behavior.", "People need to be accommodating to an extent but they don’t need to bend over backwards.", "A lot of things in life are hard", ">Being pregnant is hard, yo! I'm 8 years out from my last pregnancy and my body still hasn't recovered properly. There is a reason everyone bends over backwards, pregnant women are literally creating another human. It's not easy and at the end you have to yeet a watermelon out your who-ha. \n\n\nyeah, but like....folks *choose* to be this miserable and then hold it over everybody and have a martyrdom complex about it.", "Hard no.   Pregnant 3 times.   Pregnancy is not a pass for special treatment.", "YTA, yeah it is hard, done it twice, she is an arsehole. I ate a mainly veggie diet before pregnancy and I craved meat during the pregnancy.\n\nYou know what I never? did ordered enough takeaway to feed a whole family before we were all going out for dinner.", ">and at the end you have to yeet a watermelon out your who-ha.\n\nI lost...I am rolling over here.", "Wow.  Except whoever ordered…… op or husband….. ordered enough pizzas to feed 4-5 adults.  If she truly wanted a snack before dinner they would have ordered a small or just a single large. Instead it sounds like they ordered multiple large pizzas less than 3 hours before a dinner reservation.\n\nFamily sucks but op/husband are assholes", "Yeah, you're right, it should be esh", "It was 2 13inch pizzas ☠️", "In another comment she says 2 large pizzas", "YTA - sabotaged seems to be the right word for this. It's not that you're starving from not getting food within two hours and you could easily get yourself a single Pizza or something different to eat like chips or other snacks. But it somehow sounds like you're the princess of the family as your whole family did the same thing and no one told your sister that you all wouldn't go to the restaurant after this. She ate nothing and nobody cared. How much pizza have you ordered that you've feed the whole family until they were all full? Doesn't seem to be an accident at all.", "Right? I craved all manner of salty shit, and I kept it on hand. I also usually kept a snack in my bag. No one needs a full pizza two hours before dinner.", "Are we the same person?! I was so sick during pregnancy that some days I would only eat a handful of those chips!", "I think all these pregnancy craving posts are fake. There are too many of them, and also pregnancy cravings don't work like that.", "Yup saaaaame!", "Pregnancy brain is putting the hairbands in the fridge and the fresh milk into the cupboard 😭", "Oh absolutely, but it's more of an understanding, not an excuse.", "This story is about pizza.", "It’s quite literally the opposite. Y’all decided the girl 7 months pregnant with triplets was an asshole for being upset her husband ate her candy.", "Well, it is the first time I read about craving by proxy. She could have ordered a small pizza. She took two large to fill everyone.", ">ch pizza did she order for just her craving if it was enough to fill up everyone?! Like that’s not an insignificant amount of pizza and not like they would’ve ordered more after she got herself a small one \n\nHow much pizza did her husband order? I'm not sure.   \nDid her family show up as her husband was ordering and they mostly decided pizza was okay to order more of? \n\nDef missing some info here, but they decided to eat and not wait, that's for sure", "I've been pregnant 2x. I craved Taco Bell 2x with my first pregnancy, and really, that could have been coincidence because once a year, I usually hit one up. I think some people have stronger cravings than others, but I also think that happens in normal life too. The difference is that people allow themselves to think that because they are pregnant, it's different, and they HAVE to have it. I had so many people ask me what cravings I had with both pregnancies and then looked at me weirdly when I said, \"Uh, none?\"  Now, if someone's craving chalk or gravel or some weird shit like that, it's an entirely different matter, and your body is trying to tell you something.", "As a mom, I tell my kids this all the time.", "That’s what I was thinking.  Maybe she was tired, or didn’t want whatever the restaurant serves, or whatever, and instead ordered a different dinner for everyone to eat at home instead so she didn’t have to go out.", "For the sister’s sake i hope it’s just the pregnancy and not her whole life in a golden child/main character sitter of way.", "It doesn’t need fill them to gorged to ruin everyone’s appetite enough to not want to go out to go to a pricey diner that they then won’t fully enjoy.", "Right it's not just about the food, but the whole experience and planning that went into it was ruined.", "Sure, I was just saying me. I know lots of people eat later, I usually don't eat anything after 6pm.", "This is my logic, she deliberately ordered TWO LARGE PIZZAS instead of one small one for herself.", "Yep. Mom here. OP is TA for sure. Yeah yeah, body is creating life and it's not easy (I didn't yeet a watermelon out of my hoo-ha, I had a c-section which is a whole 'nother can of worms), but being pregnant does not give you a free pass to be an asshole.", ">yeah, but like....folks   \n>  \n>choose  \n>  \n> to be this miserable\n\nSome of them do not", "Some have incredibly hard pregnancies.\n\n\n*this* isn’t an example of that but please don’t assume all pregnanct women chose to struggle", "In lots of places in the United States it’s not a choice anymore but go off", "Thank you! And with overpopulation,  I don’t think being pregnant is doing the world any favors", "I would say everyone sucks here except for the sister.", "How does the sister who wanted to go to the resturant suck?", "Damn. Yeah, she's TA.", "This is so right! I can't believe that a pregnant woman (that got enough money) doesn't have enough to eat at home, not even a single snack. Very suspicious!", "I survived my first pregnancy on salt and vinegar potato chips, too! I was queasy all the time with #1, and the chips really helped.", "My entire first pregnancy I craved Chicago style deep dish pizza. Guess what we don't have where we live? I tried to make it at home but it just wasn't the same. So yea, pretty sure she could've survived 3 hours. Even if she had a condition that required her to eat, a small snack or fruit should've been sufficient.", "The thing is I don't think she's TA even for ordering a pizza for herself, it's the fact she deliberately ordered enough to fill up four adults. She did that on purpose.\n\nAbsolutely nobody would have had an issue with her ordering a small pizza and having a slice for herself to kill a craving, hell, even offer a slice to people for a snack, but to go out of your way to order two LARGE PIZZAS, enough to fill up 4 people, that was planned and that was a power play to pull attention away from the sister. \n\nThe same way she is downplaying how upset the sister was. \n\nFlip it. \n\nImagine OP organised a baby shower with a nice meal reservation somewhere. What if her guests decided Nah, we want Chinese, and ate and then didn't want to go to the meal?\n\nYou think OP wouldn't be upset and hurt at their LACK of consideration?\n\nOP is absolutely without a doubt the AH, this was all deliberate. She could EASILY have ordered one small pizza.", "It is kind of late but depending on the size of the party and restaurant availability, that might have been the only time available.", "Literally could've just ate a slice or two and put the rest in the fridge. That pizza craving will come back again.", "I like to reference a c-section to chest buster scene on Aliens. Our children burst out of us.", "They’re referring to the folks who do", "Majority of them do though.", "This is like when guys harp on the small percentage of false allegations.", "then I'm not referring to those specific folks.  :)", "the world can handle at least couple more billion people. it’s been stated by researchers over and over again. the issue is not overpopulation, the issue is a small amount of people hoarding most of the resources. there was no need to bring in your anti-natalist viewpoints here.", "Overpopulation is generally considered an ecofascist myth, just FYI", "I was really just making a comment about how I don't eat that early, for some people it's normal\n\nTo your point though I've actually been trying to find a valentines day reservation for the past few weeks and am having trouble finding one before like 8 or 9.  Apparently I should have started looking earlier, reservations are hard to come by these days, I am assuming it has to do with the short staffing issues.", "Exactly this.\n\nOP has also refused to answer questions as to whether the reservation was for a celebration such as sister's birthday or something.\n\nThis would be very telling information. If it was to celebrate something for someone else, then the pizza thing was done on purpose to ruin the celebration and focus attention on herself.", "Also one of the biggest dining nights of the year. Good luck on your reservation search!", "#[Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Is the theme of the day getting way too invested in food related conflicts? Fucking chill y'all. No insults. No overly crude, dehumanizing language.\r\n\r\nPlease review our [FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq) if you're unsure what that means.", "Did your sister get to eat at all? It sounds like she got really screwed.", "Nta. 8:30pm is way too late to eat dinner, not to mention you probably wouldn’t have eaten until 9-9:15. Don’t feel bad, OP.", "NTA: Sister is being a cry baby. All the people in this sub acting like pregnant women make rational food choices blows my mind. I’d say that over half of them have never lived with a pregnant woman. You didn’t force your whole family to eat the pizza.", "NTA you didn’t make anyone eat pizza and you didn’t suggest canceling the reservation. I would bet you would have been fine to eat again. You aren’t responsible for what others do and if your family couldn’t gauge how much they should eat shortly before an important reservation, sounds to me like they are the assholes. If you explicitly did not want to go out to eat after either, then you’re right along with them, but just being pregnant and having enough pizza to share with your family doesn’t make you a jerk.", "YTA", "You couldn’t have ordered a small pizza just for you, or a couple slices? Make a sandwich, have some chips. I get being hungry and I get not wanting to wait till 8:30 to eat, but spoil the meal for yourself, not everyone else. What did you order enough pizza for everyone to eat?? Your sister was really looking forward to eating at the restaurant and took the time to get a reservation there. You **did** make things about yourself. I get the feeling your parents have probably taken your side in things like this many times before, otherwise why would your sister not want to invite you again? \n\nYTA, apologize to your sister. I know you’re pregnant but other people’s feeling still matter and you fucked up and hurt your sister.", "Why did everyone have to eat? They’re all AH for eating", "As a recovering alcoholic I can agree that cravings are not an excuse for shitty behavior.", "OP should be frankly ashamed", "she apparently ordered enough pizza to feed the entire family, then thinks it's not her fault dinner was derailed.", "She ordered 2 large pizzas.\n\nConclusions:\n- OP was not going to eat 2 large pizzas by herself and then dinner\n- she ordered more pizza then needed so that the others would eat too which filled them up before the dinner reservation \n\nOP seems to have it in for the sister so I understand why she doesn’t want to make a new booking and go through the same thing again.", "I totally agree with this. I’m pregnant myself and sometimes I do have to snack in between meals at times. But I don’t order a whole pizza. I make or get myself something personal sized and don’t eat so much I ruin plans I have with anyone else.", "The family except the sister are TA too for going along with it when they knew there was dinner.", "Plus pizza getting there takes a while.", "Not only that but I forget to eat a lot and when I feel my blood sugar plummet, I HAVE to eat that moment. Like, I wouldn't have time to order food and wait. So if OP had time to wait for the pizza she definitely didn't need to eat that moment and could've waited for the restaurant", "Even if she spoiled her own appetite, who cares?\n\nThey didn't need to order enough pizza for 4 adults to spoil their appetites.", "It is not about HER appetite, it is about bringing two large pizzas to make sure everyone was full.", "I’ve been pregnant before. Truly your hunger doesn’t change that much. Women use it as an excuse to eat whatever the hell they want.", "But why does ordering pizza mean everyone else has to eat it? Everyone else made the dinner plans top. They all decided not to follow through. Are they not adults who can plan and make their own decisions?", "she could have eaten some pizza rolls.. not order TWO WHOLE PIES LMAO", "Them some therapy questions", "I also want to know the answer to the first question. It may be the whole family that didn't want to go and have more than just 1 AH", "Why did everyone have to eat? They all ruined the evening", " this isn't a request for more INFO, you're just passively aggressively calling the OP an asshole", "Hijack from the family and whoever got turned away for a reservation. At least some walk-ins got lucky", "I mean it didn’t even have to be healthy \n\nGranola bars are a sufficient , delicious snack.", "Not only that, but as I understood the sister didn’t even get to eat, like anything at all? She didn’t want pizza because she thought they were still going to the restaurant but then they ended up not going.. \n\nSo yeah I’d be pretty pissed if I were in the sisters shoes and OP is 100% the AH", "Eh it's very normal in some places. I'm in Europe and it's currently 7.51pm and my dinner is currently in the oven.\n\nOp YTA", "I’ve done this. I got a street slice for myself before meeting friends for a late dinner because I was starving. Never even told them.", "Two large pizzas, ordered at 5:45. So delivery time, then eating,  yeah, if she truly was craving pizza all day, knowing she had dinner plans she would have eaten it sooner. Because, you know, most people don't starve themselves while pregnant until almost dinner.", "THANK YOU! Just because op ordered a pizza doesn't mean everyone has to gorge on it and run their dinner plans??? These are all adults. Did they really not want to go out to eat?", "Because maybe the sister is actually the insufferable one and they didn't even want to go out to dinner. If this is in the US, 8:30PM dinners are almost unheard of.", "I can’t believe I had to scroll so far down to find a comment like this. Everyone saying YTA is just fully ignoring that all of the other adults in the house have autonomy? \n\nI’m personally leaning with OP being NTA, because I totally get ordering enough for everyone to have a slice before dinner, not eat until they are full! The rest of the family is TA for having no self control and filling up on pizza when they knew they had reservations.", "But why would it make everyone an asshole if they just weren't feeling the plans they made? It sounds like no one really wanted to go to this restaurant but the sister. It isn't really an asshole move if everyone basically decides they don't want to go out.", "I honestly lean towards NTA. She ordered pizza for herself, if her family hadn’t eaten it they still would have gone out to dinner, and nobody made them eat the pizza. Her family decided they’d rather hang out and eat pizza and the sister didn’t like that. Honestly it doesn’t really sound like anyone did anything wrong, a group just changed their mind about what they wanted to do and one person disagreed with it. Everyone saying YTA is ignoring that adults can make their own decisions, and if they’d rather eat pizza than go to a restaurant thats what they’ll do.", "She didn’t force them to eat pizza? There was plenty of time for her to have a slice or two before dinner.", "Perfect answer, the whole family seems pretty shitty. I'd be pissed if I said I'll pass on the pizza because I'm so excited for the dinner reservations and then everyone agreed to just cancel them. Lame af. ESH.", "Respectfully, carrying a living thing inside you is not an easy task! Making their lives a little easier does no harm. However, ruining an evening and buying enough pizza for everyone to be full even though you have plans prior is wasting others time. She could’ve bought a personal pan pizza, or even got a pizza off the menu.", "Jesus the over reactions on this sub", "There's probably more to this story we are not getting. They must have ordered multiple XL pizzas for everyone to get full. The question is, did everyone partake freely after this point? Or did OP actually manipulate the situation by guilt-tripping people with \"wasted food\" or maybe offered to the kids first to make them make their parents not go to the restaurant?\n\nRegardless ESH except the sister.", "I agree mostly with the fact that the rest of the family sucks too. OP deciding to snack on some pizza wouldn't necessarily spoil the night as she could still go for some dessert or maybe get something light like a salad or w/e while the rest was eating. But instead they all decide to eat pizza to the point where they no longer want to eat, which is crazy to me. \n\nDid nobody want to go to the restaurant for some reason? Is there nobody with some self control?", "Agreed this is essentially an ESH except for the Sister rather than just a YTA.", "Agree with this wholeheartedly. My wife is pregnant and has weird cravings...  OP could have ordered pizza for herself and maybe shared a slice or so per person.  OP then could have gone to the restaurant and not eaten or gotten something small.  That's what my wife would have done.  Women carrying children should be given a lot of latitude, but OP is just taking advantage here.", "Tons of conjecture here, but this feels to me like first grandkid-gloves scenario. Everyone is holding the womb and the womb wants what it wants. \n\nAlso guessing pregnant person (I have been one) a little offput by 8:30pm dinner res. By 8:30 I was getting ready to climb into my pregnancy pillow with my unisom and my eye mask. Family is completely complicit in this case and even if OP didn't want to go, they should have gotten their asses to dinner.", "A question why other adults started eating while knowing about reservation? I would say ESH, except maybe the sister who didn't eat pizza.", "I’d be pissed if I was looking forward to a nice dinner out and someone else arbitrarily decided on pizza at home an hour before. It was definitely some kind of celebration for the poor sister.", "I was thinking the same. I feel like there is information left out here on what the dinner was for, it sounds like it was important to the sister", "> Am I the only one also wondering if maybe this fancy dinner was some sort of celebration meant for her sister?\n\nOr that the sister wanted to announce something.", "Wouldn't surprise me if OP had a pattern of doing shit like this and left it out of the story.", "exactly. I think OP left some things out on purpose to get the response that they wanted.", "Yeah, if it's an in demand restaurant, they've turned people away and now that table's empty.", "I would be fuming if I had made that reservation. People who flake at the last minute (for no good reason,) or invite additional people without checking without checking if that's ok drive me nuts. \n\nI have made a reservation. We have a table, for this many people, at this time. That is what the restaurant is prepared for. JFC. Apparently this is a trigger for me.", "*especially* one that’s supposedly really hard to get a reservation at", "Yeah. Eating when you're hungry? Definitely need to do that. Ordering a big ass pizza? Nope.", "It’s like when we get posts where the woman is pregnant, eats someone else’s specifically marked treats/food without consulting them, refuses to replace it, and then asks if they’re TA. Of course you are. Being pregnant isn’t a magical “get out of jail free” card that lets you act however you want", "Nah, don't you realize OP is being selfish for 2 now?", "I wasn't an adult during my first pregnancy. I was 15. I ate EVERYTHING I craved, gained 100 pounds and had gestational diabetes by the time I gave birth a few weeks after my 16th birthday.  You are correct.", "I'm on the upset sisters side, but like... all the other adults could have been adults too and not eaten pizza just because it was there. What's their excuse for the terrible behavior?  Everyone except the sister sucks!", "Yep. I am currently pregnant. The cravings and excessive hunger are definitely real and powerful, and sometimes override my better judgment in terms of health/nutritional goals, but they have yet to override my sense of good manners and compassion for others. I could maybe see myself running out to get a slice of pizza even if I knew I was going out to dinner in a few hours (and feeling kind of embarrassed about it probably), but I wouldn't make everyone change their plans around me! Also, my husband is very sweet, but there's no way he'd just cater to that; if I asked him to order me a pizza in that scenario, he'd be like \"What? No, we have dinner reservations.\"", "Yep, I’m pregnant now. I’ve had cravings and it makes me SOOO happy when they can be immediately satisfied. But they are also not urgent. I craved a burger recently, but didn’t have a chance to eat one until two days later. No big deal.\n\nAnd I also relate to needing to eat NOW when hungry, but that doesn’t mean you eat so much you ruin plans or feed everyone around you so that everyone’s plans are ruined. Yesterday, I nibbled on a granola bar while waiting in line to order a breakfast sandwich. Yes, I felt silly and like people were judging me, but I literally could not wait and was nauseous. But then I put half the bar away, waited 15min for my order, and ate the sandwiches with my friend. \n\nPregnancy does not mean no self control.", "Dude I'm pregnant right now and the number of stories on here I see about pregnant women behaving like this is appalling. I've been in OP's shoes and I have half a sandwich and go to dinner. Having cravings doesn't make you some uncontrollable goblin of gluttony. YTA", "Same as you! I’ve been pregnant 3 times, craving are real, but god, it doesn’t mean you HAVE to have it and nothing else. I hate when pregnant women act this way, it’s manipulative and immature. I feel like op intentionally sabotaged the dinner because she had to make it all about herself.", "That's exactly what gets me, why didnt she order just for herself? She knew they are going to the restaurant.", "What I've heard is maybe 200 cal over normal maintenance level by the third trimester, for at least the first half it's essentially no more than usual at all. It's eating for two while breastfeeding that'll get you.", "Yep. Makes the rest of us look bad. Most pregnant people don’t think the world should revolve around us and our “food cravings”. If I want to eat something different then I eat something different but I don’t go out of my way to change up everyone else’s plans for dinner. OP could have eaten a slice of pizza and sat through dinner while everyone else ate at the restaurant if she needed pizza that badly.", "Yeah, you really only need an extra 400 calories a day in the third trimester. It's really not a good reason to go all out.", "She ordered two large pizza (it is  hidden in her replies) to make a stunt. The others enabled her. Pissing off the sister might be a family game.", "Don't need a therapist to answer them though. \nYes.\nYes. \nAnd probably definitely yes.", "Things aren't adding up to me either. There's at least 4 people in this story maybe more. Apparently OP is crazy hungry, yet ordering a single pizza feeds OP, husband, and her dad?", "Why not both", "This was absolutely a job for bagel bites or pizza pockets.", "i usually eat dinner between 10:30pm and 12:30am. People who work different shifts have different eating schedules. I dont think the time of the reservation should even be a topic of conversation here lol. OP is a massive asshole for ruining the reservation when she could have just eaten a banana and waited for dinner.", "The replies say she ordered two large pizza, no way it was not planned.", "I am not sure it is not the A and neither is sister but everyone else is.  I picked up heavy snacks for my wife because of cravings in both pregnancies,  but no one else had them.  It had no impact on any plans.  Her husband ordering enough for everyone and everyone eating was the problem.", "Same, no one forced the rest of the family to eat a full meal. It honestly just sounds like the sister was the only one who actually wanted to go to this restaurant.", "Plus every pregnant woman I know keeps an emergency snack in her purse.", "Yeah I don’t really get the comments saying she ruined everyone’s night. They all chose to eat pizza and not go out?", "It’s first time pregnancy bullshit and I partially blame movies and television who have made this a trope.", "I have also not read a case study where it says that everyone has to eat pizza just because one person orders it. She could've put the rest in the fridge and had it the next day.\n\nIf I was sister I would be a lot more disappointed in the rest of the family than OP. I would feel momentary rage at OP but I'd personally feel that the rest of the family was worse.", "Probably have another kid.", "OP's about to have a whole ass BABY to exploit. If I were her sister, I'd just cut contact now.", "She sounds like a Golden child so I don't think she'll need to do much...", "You know the answer is keep having children she cares little for because they draw attention away from her.\n\nBabies as therapy animals! Cute until it's hard work.", "😂😂😂 take my award 🥇", "Exactly.  Anything to ruin something her sister wants to do.\n\nThis wasn't about pizza.  This has everything to do with the attention somehow being taken off of OP, and OP's determination to be the star in everyone's world.", "For real. I love going to nice restaurants for the first time, especially with a group as it means ordering and tasting way more dishes. If someone in my family pulled this on even a normal evening I'd be livid. But the way OP dismisses her sister's feelings I do wonder if there's some other reason for sabotaging the evening.", "Especially if it was a place I've really wanted to go to and there was little chance that I'd be able to get reservations and go on my own another time", "Yeah, if the sister is so upset but no one else seems to care about missing the dinner, it definitely feels like it's more than just the sister really wanting to eat at that restaurant.\n\nAnd intentionally getting enough pizza for everyone to stuff their faces only a couple of hours before a reservation at a restaurant? There's just no way this is just about OP wanting a slice of pizza.", "100% there is info missing. Hell, OP didn’t even mention she was pregnant until the end.", "Right? I'm positive there will be some buried explanation. \"Ok so the dinner WAS for my sister who just graduated medical school but I'm pRegNAnt.\"", "And she says in another comment it's difficult to get a reservation at that particular restaurant. So the restaurant need to try and fill the cancellation and understandably her sister is disappointed something she was looking forward to was cancelled last minute.", "I came close once in all 9 months. Of all things I wanted a hot dog with mayo (?) but there was none in the house. My dad offered to make some, and I realized how silly it was and went to bed. I can’t imagine ruining group plans for it. \n\nOp, YTA", "I’m pregnant with my third and it’s this shit from OP that pisses me off to no end. Her and others like her make everyone assume we’re uncontrollable beasts when pregnant which causes people to treat most pregnant women like we’re walking lunatics. I’m just over being invalidated.", "Yep, I had major food aversions whilst pregnant but I still went to people's birthday meals and found something to eat.", "Crazier still, ***A*** pizza filled up a family of 4 (or more) to the point they couldn't eat again over 2 hours later??\n\nHow big was this pizza?", "Same I ate milk duds daily. I get the cravings thing.  But this is just bad behavior.", "been pregnant twice, currently 27 weeks with my second. Have I cried into my husband's arms about wanting Taco Bell? Yes. Have I selfishly ruined my whole family's dinner plans because I want pizza? Fuck no.\n\nYTA", "If I had a midnight craving, you bet your ass I got in the car and drove myself to the store. Some of these stories are straight bananas", "3 cheers for salt n vinegar chips!", "Salt and vinegar chips were my thing, too! Early on, they were one of the only things I could eat without getting nauseated, so the day we were closing on our condo, we had to stop on the way to get some and I sat there the whole time, signing grown-up documents with my other hand wrist-deep in a can of salt and vinegar Pringles.", "Ooh good take on the situation.", "It's what I was taught in mom school. \"Eat an apple. Have some carrots. Drink some water\"", "As someone currently pregnant, they can get pretty strong but if its unreasonable, I just cry into my pillow till it gets better or the next craving comes and overrides it. Its my own problem and doesn't turn off the logical part of the brain 🤷‍♀️ \n\n\nMine are like a flash of memory of the smell/taste/texture and everything in me wants to eat it and I start literally crying if I'm going to get some out of happiness or whine out of despair that its unreasonable to aquire.\n\n\n(I'd be eating so much salmon sashimi right now if I couldn't control myself, but its bad for the tater tot, so tears it is)", "Durning my first pregnancy after breakfast one morning at work I suddenly decided that I needed broccoli (which is a fine vegetable, but I’d never gone out of my way for it before) and spent a few minutes figuring out where I could order DoorDash from to get broccoli with my lunch. And then I got back to my day waiting the few hours until lunch with no problem. It was surprising, but not all consuming.", "I think it varies. With my 2nd baby I would involuntarily (silently) cry every time a craving hit me (super embarrassing when you’re at work). It never meant I needed to indulge right away. With the other 3, it took up headspace, but not to the point it was anyone else’s problem.", "I drank whole milk during my pregnancy. GALLONS of it. \n\nI don’t ever drink cow milk, and even as a kid the whole kind was too thick.", "Pregnancy cravings are a very common thing across many cultures and time periods. \n\nIt's such a common thing that in Japan companies have worked to develop \"pregnancy-friendly sushi\" for pregnant women. \n\nFilipino culture has a word for it, even.", "I mean, it really depends. I've never been one to have a huge appetite but once the Hyperemesis Gravidium (basically chronic nausea/vomiting) passed, I had the strongest craving for apples. I lived in NYC at the time and the cheapest way to get groceries was to order via Fresh Direct. One time I ordered three kinds of apples, apple cider, apple crisp, apple pie, etc. After pushing my kid out there was a several year period where I couldn't stand apples because I ate so many. With kid #2, all I wanted to do was eat ice, which turned out to be a sign of an iron deficiency.\n\n\nStill, I never acted out of line if I couldn't get what I was craving right away.", "I had ridiculously strong cravings because I have an autoimmune disorder that makes me nutrient deficient even without a baby getting part of the nutrients I consume. I didn't make it anyone else's problem, but I did cry over vegetables more than once.", "She admits to ordering two large pizzas.  \n\n\nShe knew what she was doing.", "Because she clearly wanted to ruin the dinner plans.", "and for general advice, don't exploit it for stupid shit.  You need that pregnancy brain credit for the real dumb moves.  Like, hypothetically speaking, telling your work team lead that you didn't do the first-Friday-of-the-month analysis because today is June 31 so obviously it would be due next week.", "Absolutely correct! Apparently no one BUT the sister wanted to go out if they’d fill themselves with Pizza and cancel.", "Yeah that’s what I was thinking too.", "Exactly.\n\nMy daughter is pregnant with her first and hasn't needed to hijack special plans for the rest of the family. She can walk into the kitchen and have a snack & still keep our plans", "Ew, what? That shouldn't make sense for her to do, but she probably would. And you're right, it's really disgusting. To change the plans because of you not wanting to be there is selfish and rude. I understand being socially burnt out/too tired to do something.\n\nBut when I'm in that situation, I have 3 options: 1 - I can suck it up and go along, and talk to people consistently the entire dinner (not recommended, but sometimes necessary for when having family or friends you haven't seen in a long time) 2 - I can go, but tell people I'm a bit tired, so I'm gonna take breaks, and I'm sorry if I put on my headphones, I need downtime. 3 - Just fucking skip it, they'll be next time!\n\nCancelling the entire thing, (not even outright, just through manipulative means) is so unbelievably rude.", "Omg I'm choking", "That baby gonna be named Kaylee or Daxton/Grayson/Jaxon or some shit like that.", "As others have mentioned as well, in demand restaurants often blacklist people for late cancellations and often require credit card deposits for groups. Big no-no", "And they may be blocked from ever placing reservations there again, depending on policy.\n\nEveryone is an asshole here except the sister. She deserves a better family.", "This exactly.\n\nThere's no way they ordered a reasonable portion of pizza to satisfy her craving but it was also magically enough to completely fill up an entire extended family to the point that they cancelled dinner reservations hours later.\n\nA quick snack to tide you over would be a small pizza, or individual slice. To fully feed this many people you had to have ordered multiple large pizzas.\n\nEven everyone on your extended family eat two slices wouldn't be enough to have them all say cancel the reservation, I'm just too stuffed to eat more three hours later.\n\nThis  seems entirely premeditated.", "Sabotage sounds right. OP is YTA, pregnancy is not an excuse to be rude to others.", "Yeah, I agree. Sis was probably looking forward to this and had been anticipating it for awhile, given it’s hard to get reservations.  Op should have gotten a slice by herself in private instead of getting the whole family involved\n\nOp, YTA. Apologize to your sister sincerely. Pregnancy doesn’t mean you get to be the center of everything or ruin occasions for others.", "I was pregnant with twins. I ate \n\nwhat I wanted when I wanted. I was sick for most of it. If my face wasn’t looking inside the toilet, I did what I could regarding eating. I’m saying YTA. \nMy stomach touched the steering wheel and I have long legs. \nMany times I just went for functions and did not eat. It was understood. \nBut feeding the family when you know they have plans? \nNo. That’s F-Ed up. \nYTA.", "She ordered 2 large pizzas, that's about 20 slices.\n\nShe \"conveniently\" neglected to add that detail in her post.", "Yup, that was me. I craved chalk like none other. I believe it’s called PICA.", "Same. Currently pregnant a second time and sometimes I’ll crave things, but I can just easily say.. eh I’ll get it later. Same with my first pregnancy. It was never so bad I can’t think or function", "My mom craved the smell of gasoline when she was pregnant with my older brother. Cravings absolutely aren’t something you HAVE to have. Also, correct me if I’m wrong but don’t they go away eventually just like any other food craving?", "Oh man I ate so much taco bell while pregnant. I very much had strong cravings and if I didnt get a food it was constantly on my mind for days til I got it (extremely annoying to focus on food that much tbh) but I always went and got it myself. Drove to Taco Bell at least once a day for a few months in first trimester (the weight gain was real). One time craved funfetti cake with strawberry frosting really bad so I went to the store, got the mix, and made myself a damn funfetti cake with strawberry frosting at 10pm haha. So, I understand the pizza cravings, and I might've asked husband to do the same, but it would have just been one pizza just for me--aint nobody about to be allowed to touch my pizza! Or just get a pizza after dinner to bring home and eat to satisfy the craving. And I still would have been plenty hungry to go to dinner after too, so absolutely they're all assholes cuz the situation makes no sense besides intentionally feeding everyone and eating enough to miss dinner.", "My mom told me about craving pickles and ice cream (at the same time, supposedly). I think that the cravings are real because any sane person wouldn't even consider combining those two things", "And instead of walking leftovers to the microwave, you walk all the way to other side of the house and then stop and ask yourself wtf am I doing.", "I forgot the word \"hamburger\" for two days 😬", "During my first pregnancy I was really craving cereal. I got my bowl of cereal and put everything away...or so I thought. The next day I went to get more cereal and I looked in the cupboard and found the gallon of milk and the cereal was in the fridge. THAT'S pregnancy brain.\n\nI've been pregnant 3 times. You don't give in to every craving you have. It's not that damn hard.", "Two large? Hahaha 🤦‍♀️", "I’m on my third! Congratulations!", "I don’t disagree that it’s bad form but apparently OP’s husband knows the owner and he’s going to make sure they get another opportunity.", "She ordered two large pizzas. \n\nThat's about 20 slices. \n\nSo IF, as she says, she only ordered enough in CASE people wanted some, if nobody did, she was going to eat two large pizzas by herself?\n\nShe's contradictory.", "So on top of all the weirdness, you’re lying. YTA", "Agree - YTA.  Everyone cleared time in their schedules and made time for a special night and you ruined it.  If I had to guess, it's probably not for the first time, pregnant or no.", "\nOr everyone else wasn’t intending to go out because they made the personal choice to eat the pizza as well. They could have just not eaten it. But they did.", "I totally think people get pregnancy cravings just like in non pregnant life, but I don't think it's something that should rule your life or put others out. Like making your partner run out at 3am because you have to have something specific or having them drive across god's green earth to get that one specific thing because you suddenly had a craving. There are poor people the world over that can't just go get a certain food item because they want to have  it, and they manage to survive pregnancy just as well as anyone else. Barring a medical issue, I think it's bullshit and spoiled behaviour that people indulge and use pregnancy as an excuse for.", "Cravings are real but they're not \"drop everything, I am incapable of basic discipline and focus\" real. I craved fucking confetti cake for a month before I actually got myself some. It's just persistent urge. It's not something you usually act on- out of convenience. OP fucking up a family get together is just scumbaggery.", "Ha! So true. My kids are 7 & 3 and I still do that!", "Also, why would she order enough to give other people, KNOWING they were all going to a nice restaurant together less than 2 hours later? Sounds like she didn't want to go and sabotaged it on purpose", "Same here but I don’t have kids. Lol"]}