{"id": 7602, "submission_id": "10erczf", "title": "AITA for refusing to let my brother be part of the \"family business\"?", "selftext": "First some important info: I(44M) have a younger brother (41M), and we are the only children. Also we are not from the US or any western country, so please excuse any errors.\n\nMy father passed away almost 10 years ago, since our mother was also dead, we divided his estate equally. His estate was a farm of 12hectares (30acres), back then it had a house, a barn, a pond, wheat fields an olive fields.\n\nUs both were working office jobs in the city and did not want to be farmers. But after my dad died, my wife convinced me to quit, buy out my brother and start a business with her (she had degrees in business and hospitality, I was working in accounting). And that's what I did. I bought out my brother at market price.\n\nAfter that my wife and I transformed the farm: got government subsidies to make our farm more sustainable, transformed the area by the pond into a garden and romantic strolling route and a fishing spot, the closest farm plots were made into a pedagogic farm and some made available to guests to rent, built small houses, built a stable and bought some horses... We made it into a retreat where you can either spend the day, act as a farmer and have some authentic food, or rent a cabin and try farm life. The rest of the farm was left to farm hands.\n\nSince we are barely 2hrs outside city limits, it became a booming business, we are booked solid all year, we have schools coming for tours, activities every weekend, couples throwing their weddings here... And after the first 5 years, we were able to pay off our debt and are making great money.\n\nMy brother used his money to buy a house, 2 cars and on his children's schooling. And they are living well, I would say upper middle class by my country's standards. But nothing like me and my family.\n\nNow he says that he wants in on the business, that what he was paid was not fair. I told him no, that he got what his land was worth back then.\n\nNow he is no longer talking with me, and he is the only family I have left. So AITA?", "created_utc": 1673998544, "permalink": "/r/AmItheAsshole/comments/10erczf/aita_for_refusing_to_let_my_brother_be_part_of/", "score": 41, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I bought out my brother 10 years ago at market price, then business started booming and he wants back in. I said no, but I am feeling guilty because I am jow much richer than him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, he got market value for his half. He used it up, you invested your time and money and now you are getting your return on investment. No need to feel guilty.", "NTA. You paid him a fair price at the time. The land appreciated because of the work you and your wife put into it.", "NTA\n\nIf he had invested his half of the money into literally anything else, would he share the fruits of that investment with you? I don’t think so.\nYou had all the work transforming the place and you had all the risk of it not working too!\nAlso it definitely sounds like you invested some of your own money too to make all that possible. \nHe wants all the fruits of the labour without doing any of the labour \n\nI get that you don’t want to loose him, so maybe there is a calm way to talk about all of this? With a mediator present or something like that?\nHe needs to understand that you invested the money and succeeded, but I mean you could have failed too, and if you did would he just give you money from his half?", "NTA\n\nThe only way I could side with your brother would be if you took advantage of his grieving and bought his share. I do doubt this as a possibility considering it must have taken sometime for your wife to convince you to give up your career to suddenly become a farmer - also it's been 10 years and he hasn't mentioned any regret during that time?\n\nI think it's clear your brother is having money troubles or perhaps a mid-life crisis. Either way he got a fair deal for his share. If he wants back in he can offer to repurchase his half.", "NTA.  You bought out your brother at the market price.  After that you and your wife came up with a great idea, and poured your money and lives into it.  It took a lot of work, money and courage to do what you did, and it worked.  \n\nit’s Too bad your brother can’t see the hard work you and your wife put into this.  He can’t just walk in at this point and expect to be part of it.\n\nI hope he reconsiders in the future.", "NTA\n\nHe sold it to you at market value because he didn't want anything to do with it. It's not like this booming business you have now came easy, a lot of time and hard work went into making this into what it is now. \n\nHe's jealous of your financial success and salty he didn't think about doing this with you guys when he had the chance.", "NTA - He was paid fair market for his share, he is not entitled to fruit of your labors.  Also, he is not the only family you have left.  Family can be more than blood, for example, your wife.", "It sucks that he's the only family left but what you did was fair and square. Now that you guys have put in the hard work and money he wants to reap the rewards. Not cool.\n\nNta", "NTA. It is sad that your brother is jealous of your and your wife's success. He didn't have the vision, didn't put in the work or the money, but wants to reap the rewards.", "Is this an advert or AITA? Ahaha NTA\n\nHe could've used that money to invest. Instead he used it for what most people do I suppose, which is reasonable. It's what I would do. He gets to live an overall stress free life.", "NTA - You and your wife did all the work, planning, ideas, went into debt and paid off the debt. He did nothing.", "NTA. Your brother would have never turned that land into what you and your wife did. Even if he kept it. He didn’t have the vision that your genius wife had. Of course now he wants in, and he’s guilting you, but realistically he can’t claim anything here. I’d say nope. Also because in a few years the children will be involved and then it would be not be just you, your wife and your brother but all the cousins. It’ll be messy. You guys had the idea, you guys put in the work, enjoy the fruits of your labor with your children and hopefully many generations to come.", "NTA\n\nYou paid your brother a fair market price for his share of the land.  If you were interested in a business partnership, your brother would need to buy in at the current fair market price of the business.  \n\nYour brother has no more right to your business than you do to his house that he purchased with some of the proceeds.", "NTA.  If you paid fair market value, that's that.  It takes a lot of initiative to do that level of improvement to the property and your brother is not entitled to those benefits if he didn't participate.", "Don’t worry I’m sure if the business was failing, he would insist he got paid too much and give you the money back. \n\nNTA", "NTA, he got what he wanted. You and your wife worked hard. He’s just greedy and jealous. He was paid his fair share. If he wanted in on the business, he shouldn’t have sold his share to you. He should have helped you build the business.", "NTA in any way my friend, buyers remorse sucks but he was paid fairly. If you dont want him in it that's your choice.", "NTA- he got his share, then you were smart with yours, put lots of money into it and now have the rewards.   He isnt owed anything.", "NTA I would be sympathetic if he really just wanted to be a part of the family business for sentimental reasons. But he's made it perfectly clear that his motives are purely financial, and after he had the audacity to imply he wasn't paid fairly, simply because he missed out on a great opportunity that he had *nothing* to do with, tells me involving your brother in any way will come back to bite you.\n\nIt's no coincidence he only came around now that you and your wife are living it up after putting in the effort for all those years to build this business *without your brother.*", "NTA.\n\nI assume he agreed on the price at the time, and assuming it was market value, then it's fair.\n\nYou took all the risks involved in the business and have well deserved the success you have optained.\n\nI think it might be nice to let your brother work for you, or let him buy in at what it's worth now.", "NTA\n\nYou paid market value. That was perfectly fair. The difference between when you bought the property and now is 100% due to your work and investment.\n\nIf you want your brother as a partner. Tell him he can buy in at half of the current value of the property and business. If you don’t want him as a partner. Tell him no thank you.", "NTA - He's not entitled to the market value gained from your work.", "NTA\n\nYou paid market price for what you received and built it into something amazing.   You did the work.", "NTA", "NTA. You both got what could reasonably be considered half of the inheritance, which was as fair as it could possibly be. The fact that you got more out of what you received does not make him entitled to more of yours.", "NTA - I'd tell you to offer him a job, but it's clear he wants all the benefits without working for them. So I'd doubt he'd be happy with that offer. Plus, he'd almost certainly be a poor employee with a major chip on his shoulder.", "NTA - you gave him a fair price for his half and now he wants the profits from all your hard work.  That's not how it works!!!  I somehow doubt he would make a very good partner, even if he was willing to \"buy in\" and you certainly dont't owe him anything more.   \n Congratulations on building such a wonderful business!", "NTA he chose what to do with his money you chose what to do with yours. You aren’t responsible for him or his choices.", "NTA, don't even entertain the idea of him doing anything with your business, if you do it'll just escalate to 'our business' and trying to manipulate equity out of you. He got his half.", "NTA. He sold it years and years ago. No takesies backsies.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst some important info: I(44M) have a younger brother (41M), and we are the only children. Also we are not from the US or any western country, so please excuse any errors.\n\nMy father passed away almost 10 years ago, since our mother was also dead, we divided his estate equally. His estate was a farm of 12hectares (30acres), back then it had a house, a barn, a pond, wheat fields an olive fields.\n\nUs both were working office jobs in the city and did not want to be farmers. But after my dad died, my wife convinced me to quit, buy out my brother and start a business with her (she had degrees in business and hospitality, I was working in accounting). And that's what I did. I bought out my brother at market price.\n\nAfter that my wife and I transformed the farm: got government subsidies to make our farm more sustainable, transformed the area by the pond into a garden and romantic strolling route and a fishing spot, the closest farm plots were made into a pedagogic farm and some made available to guests to rent, built small houses, built a stable and bought some horses... We made it into a retreat where you can either spend the day, act as a farmer and have some authentic food, or rent a cabin and try farm life. The rest of the farm was left to farm hands.\n\nSince we are barely 2hrs outside city limits, it became a booming business, we are booked solid all year, we have schools coming for tours, activities every weekend, couples throwing their weddings here... And after the first 5 years, we were able to pay off our debt and are making great money.\n\nMy brother used his money to buy a house, 2 cars and on his children's schooling. And they are living well, I would say upper middle class by my country's standards. But nothing like me and my family.\n\nNow he says that he wants in on the business, that what he was paid was not fair. I told him no, that he got what his land was worth back then.\n\nNow he is no longer talking with me, and he is the only family I have left. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Info: what does he think he can bring to the table? \n\nNTA no matter the answer though. I’m just curious why he’d want to slip in to your established business now that it’s got roots and is flourishing", "NTA. You didn't cheat him out of anything. The business you bought was a farm and you changed it into something totally different through you hard work. He did nothing to help transform the farm into a thriving business. Its a family business for sure. YOUR FAMILY.", "NTA. You gave him a fair split when your father died. Did he even ask what you planned to do with the farm when you bought him out?", "NTA. It seems like your wife used her background to turn nothing into something for the both of you. If this venture had been a massive failure, would your brother bail you out?", "NTA. Agri-tourism is huge right now. Great job getting in on that market! He didn't put in any of the money, work, or risk that you did. No way he deserves to be handed what you busted your butts to make", "NTA\n\nYou are living my dream life! Sounds amazing. And you built it yourself and worked for it. \n\nYou paid your brother a fair price to buy him out. He wasn't interested in farm life til your work started paying off. It's clear he just wants in on something that turned out to make a lot of money. \n\nIt's not clear what he would add to the business though, and I have a suspicion that if he never wanted to be involved when you were building it, and only wants in now for the money, that he won't add much value. \n\nObviously the value you have added to the land by your efforts is yours, it does not mean that he wasn't paid fairly when you bought him out.", "NTA.", "NTA.  He did not help build the business so he isn’t entitled to your hard work.", "NTA \n\nAsk your brother if he’s contacted the previous owners of his house and offered them the difference in market value….if not then I guess we know how he really feels", "NTA - Your transaction was fair he is claiming something that does not belong to him.", "NTA - you bought him out at fair market value. He got the money, you got the land. YOU AND YOUR WIFE are the ones who built the business - it was your brains, your business savvy and your add'l funds that brought it to life. None of this had anything to do with your brother. Sure, he can ask to have an \"in\" but you are in no way obligated to give it to him.", "NTA- You actually saved his ass. Too bad he can't see it that way.", "NTA, he made his choice.  YOU might have lost it all", "Yes NTA The land is OP's fair and square. They were sold it and took care of it.", "OP says his brother is \"upper middle class \", so I think it's regret for missing out on the opportunity. If OP never told him he & his wife had big plans when they bought out the brother, I could see why he feels a little resentful. That's pure speculation. I asked about it elsewhere, so maybe OP will clarify. But, brother wasn't forced to sell.", "If it was an advert, it would have been way better, because my wife would write it. And her wnglish is better too.", "This is how you know the answer - his brother wants in because the venture was successful. If the venture was unsuccessful, would he share half of his inheritance with OP?\n\nYeah, I think we all know the answer to that question...", "I told him about our plans, but not in detail since we only had vague ideas then.", "I just mean this seems like an amazing place. Well done haha I wanna check it out lol", "If you are ever in Morocco, you are welcome to visit. We have a \"technology free\" offer: if you surrender all your technology for the duration of the stay, you receive 20% off. Not a lot of people succeed in getting the refund", "That's amazing! Maybe I will find myself in Morocco one day. \n\nI could probably do the tech thing as long as there was a way for my family to contact me through the venue. I have ill/elderly relatives.", "We have a landline in the cabins, and of course email that we check all the time that people can give out."]}