{"id": 7672, "submission_id": "10f9n2s", "title": "AITA for asking my mom why she asks about my dad?", "selftext": "My (14F) mom (51F) got divorced from my father almost two years ago. They would never fight, were married for 29 years. Ever since they got divorced, my mom asks every little detail about my father's life. What does his house look like? Was there alcohol in the house? Is he texting someone when he's with me? Does the house have any indication that a woman has been there before? Did he ask about my mom? Where is he going after dropping me off? Does he smoke? How much is his house? Is he gonna buy a new house? Did he drink alcohol, if so how many did he drink? etc. so I would answer but for the past few months I keep saying 'why do you ask?'  'why do you care?' 'it isn't for you to worry about' because I genuinely want her to get over him. Today, my mom called me when I was in the school bus asking if my father had work on tuesday, I told her that I cancelled my plans on tuesday so she doesn't have to worry about anyone picking me up. (the school bus will drop me off) and she insisted, asking if he had anything on tuesday so I said no. After that she asked me if he had anything to do on wednesday and I just simply said 'why do you need this information' and she just started yelling at me to never ask her this again and hung up the phone.  I was home about 5 minutes later and she continued yelling at me saying 'I don't care about your sh!t father' and so on. I was already crying at this point so I just said 'okay' and went to my room to change. After 2 minutes she came into my room and yelled at me again, saying that she is hurt and I never try to understand how she feels. Also she went on about how my sister and I always bear down on her about this. I just continued crying and she made me eat dinner alone. I'm just so tired and idk what I'm doing wrong.. AITA?\n\nEDIT: My mom is over my dad but she isn't over him betraying her quite yet. My dad does not want custody so that isn't an issue here. She does not want to get back together, although my dad tried quite a few times and I support her for that.", "created_utc": 1674054567, "permalink": "/r/AmItheAsshole/comments/10f9n2s/aita_for_asking_my_mom_why_she_asks_about_my_dad/", "score": 88, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1- the action Asking my mom why she needed to know about my father (idk if I'm being inconsiderate) \n2- Because she was super upset and yelled at me\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA please address this with your father.  Not sure if she didnt want the divorce and is holding on, or if she wanted the divorce and now regrets it.  \n\nEither way her questions are inappropriate.   Unless she is concerned about your safety when you visit, nothing in his life is her business.", "NTA\n\nAnd if this is the way your mom behaves I'm beginning to see why they got divorced. She is clearly not letting go and is obsessive over your dad. You didn't do anything wrong, but she clearly has issues.", "NTA. It isn’t your job to spy for your mum. If she wants to know about your dad’s life, she needs to talk to your dad.", "NTA.\n\nIt is bad co-parenting to ask the children to pass messages between the parents, but even worse to ask them to spy on the other parent.  Obviously if your father were drunk often or abusive to you, then you should tell your mother.  But this is not that.\n\nShe may need to know if your father is picking you up or not, but nothing about whether he is working or not or what he may be busy with.\n\nSince she doesn't want to hear \"Why do you need that information?\" again, I suggest you just say \"I don't know.\"", "It's not your job to comfort your mother.\n\nYou're doing nothing wrong. You are, unfortunately, caught in the middle. And unless your mother is willing to have a calm, open conversation about this, I have to suggestions.\n\nOther than to remind yourself that this is all about her, not you.\n\nYou can always respond with, \"that's not my responsibility\" and \"I'm not going to answer that\". And remind yourself daily that this is emotional abuse and manipulation, and it's *not about you*.\n\nAny claim that your sister and you  \"always bear down no her\" can be met with, \"no, we don't.\" \n\nAll said as calmly as possible. Your primary goal is to work on objectivity because *it's not about you*. And if your mom isn't going to step up as a mother, *you can't fix that*. You can start to make mental adjustments now. Sorry for the bad news; lots of parents suck.\n\nNTA. Good luck.", "NTA. But your mom is hurting from the divorce and isn't coping well. Show empathy but dont let her take it out on you.", "You didn't do anything wrong, your Mom seems to want to stalk your Dad, or at least dig dirt to make his life difficult. She shouldn't be asking you or your sibling this info, and you are correct in pushing back.\n\nLet your Dad know this is happening, tell your Mom you won't be caught in the middle of their squabbles nor be used as a spy for her. Yall are children here, thinking of your mom's feelings isn't your job. That's her deal to sort out as the adult here.\n\nNTA", "NTA.\n\nYour mother is using you for information.  It is inappropriate.  She is putting you in the middle of the issues with your father and that is not fair to you.  She has no need for the information.  Guessing she is either not over him or wanting negative info to justify the divorce.  Either way, it shouldn't be your problem.  Mom needs therapy.\n\nIn the future, try telling her \"I'm not getting in the middle of your issues with my father.  If you want that information, you will have to contact him.\"", "NTA I'm sorry you're dealing with this. You've done nothing wrong in this situation. That's ALL on your mom.", "Sounds like she's not over it at all and got mad when it seemed you brought it to attention. No your certainly NTA. Obviously she is hurt by whatever happened between them but she is completely non understanding of your feelings when she takes these types of personal issues out on her child. She can't ask all those questions all the time then say she doesn't care about him. The fact that she mentioned your sister also gets on her about it, means others also notice. So it doesn't make sense to say she doesn't care about him. Sounds like she needs help getting past this. Sorry to hear you're taking the brunt of her anger.", "NTA. Tell if she doesn't care about your \"shit\" father, she wouldn't be asking all these questions unless she had an ulterior motive. And I would bet money with the kind of questions she's asking that motive is finding anything she could use against him in a custody hearing and driving a wedge between you and your father. Don't be a flying monkey for her. If she asks a question like that, simply tell her that you don't know.", "NTA. You didn’t do a thing wrong. This adult woman needs to get her sh*t together, and that is not your responsibility and not your problem. You might consider telling your dad, if you think there’s a chance they could talk and get to a place where you’re not so in the middle of it all.", "Info - was the divorce your mum or your dad's idea?", "NTA\nYou’re not doing anything wrong. If she only ever asked about the drinking, I might think she was concerned for your safety, but all of the other stuff is none of her business and she shouldn’t be asking you to snoop on your dad for her. That’s entirely inappropriate and unfair to you.", "nta, talk to your dad because your mom is not over him and she is now gaslighting you and getting upset because you are bothered by her asking you about him constantly. I think a new custody arrangement needs to be considered.", "Info : what betray has your mum not gotten over?", "I really think nah your mom needs help bc obliviously she still has something to do with him she really need help to get her feelings prioritized", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (14F) mom (51F) got divorced from my father almost two years ago. They would never fight, were married for 29 years. Ever since they got divorced, my mom asks every little detail about my father's life. What does his house look like? Was there alcohol in the house? Is he texting someone when he's with me? Does the house have any indication that a woman has been there before? Did he ask about my mom? Where is he going after dropping me off? Does he smoke? How much is his house? Is he gonna buy a new house? Did he drink alcohol, if so how many did he drink? etc. so I would answer but for the past few months I keep saying 'why do you ask?'  'why do you care?' 'it isn't for you to worry about' because I genuinely want her to get over him. Today, my mom called me when I was in the school bus asking if my father had work on tuesday, I told her that I cancelled my plans on tuesday so she doesn't have to worry about anyone picking me up. (the school bus will drop me off) and she insisted, asking if he had anything on tuesday so I said no. After that she asked me if he had anything to do on wednesday and I just simply said 'why do you need this information' and she just started yelling at me to never ask her this again and hung up the phone.  I was home about 5 minutes later and she continued yelling at me saying 'I don't care about your sh!t father' and so on. I was already crying at this point so I just said 'okay' and went to my room to change. After 2 minutes she came into my room and yelled at me again, saying that she is hurt and I never try to understand how she feels. Also she went on about how my sister and I always bear down on her about this. I just continued crying and she made me eat dinner alone. I'm just so tired and idk what I'm doing wrong.. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I mean you're literally asking her \"why\" so you can understand her feelings... \nNTA, sorry you're going through this OP", "NTA and your mom needs to get some help. Her preoccupation with your Dad's new life is startling. She definitely shouldn't be putting you in the middle and asking you questions about his life. There is an unwritten rule that divorced parents should leave their kids OUT of discussions about the other parent. Also, she shouldn't be calling him names or saying anything negative about him to you. Issues she has with him should be addressed to him directly. I wouldn't give any information either.", "NTA. I'm with the popular opinion. Respond with \"ask Dad\". She is interfering with your visitation and relationship with your father. So wrong in so many ways.", "NTA your mom needs counseling. She’s not coping with the divorce well. Just because she’s “over him” doesn’t mean she’s okay. Like you said your self she isn’t over the betrayal.\n\nIt screams like she’s searching for answers to her questions and possibly also looking for anyway she can feel vindicated hoping she’ll be able to say, “Hah, he lives in a cheap house,” or “hah, he can’t even get a new woman” maybe I’m off base here. \n\nMaybe she’s also looking for anything she can to get revenge. Like if he doesn’t pick you up when he’s supposed to, or doesn’t provide for you at his house like he should, she could go back to court and get him less visitation? \n\nIt’s hard to say, but I think you’re on the right track with not answering questions that do not directly pertain to you or your sister. It’s not her business. He has a right to privacy and a lot of those questions are just not her business, like if he’s texting anyone, had a woman over, how much his house is, etc. And you definitely need to tell your father about her inappropriate questions so he can at least be aware in case she does try something.", "I am leaning towards NAH - but it's more that I don't really have a judgement to offer in that I don't think you are an ah, you're a kid, and I think your mum probably still loves your dad, so all these spying accusations from other posters seem a bit harsh. She is snooping but, I don't think it's malicious. OP mentions that her dad betrayed her mum, and that he tried to get back together and she said no, but that they otherwise had a pretty solid marriage for 29 years. 29 years is such a long time, it's really hard to just stop caring about someone - for her own self respect, and maybe to show her daughter not to stay with a cheat, she left someone she loved. 2 years isn't a long time to get over a 29 year relationship.", "NTA. Your mother should not be badgering you and your sister about her ex husband.", "My mom did this. \n\nNot anywhere near to this extent. \n\nBut enough that I came to dread it. It made me deeply uncomfortable. \n\nI ended up deciding on a short script I repeated, verbatim, as often as necessary: \n\n\"I am not comfortable discussing my father with you. Nor will I discuss you with my father. Please respect that.\"", "NTA. Your mom should not be doing this to you. I'd make your father aware of the situation though", "NTA but to respond to your edit it sure doesn't sound like she's over him her questions are improper you aren't her spy and you shouldn't be and her massive overreaction to your small push back is concerning.", "It sounds more like her mom is fishing for anything she could use against him in court with the kind of questions she's asking rather still hung up on him.", "Yeah, we're missing info.  Why did they divorce, and who initiated it?  I'm wondering if Mom wants to get back together with Dad.", "Doesn't matter that OP is a child. That actually makes mom's behavior way worse.", "That's my thought. That the dad wanted the divorce and she's still in love with him.", "Does knowing who initiated the divorce change anything? \n\nMom still seems like she'd be TA for involving thier kids\n\nCould be she wants dirt on dad to force a change on custody", "Yeah it would explain a lot and if it wasn't the mums idea should entitle her to a bit of patience and empathy."]}