{"id": 7779, "submission_id": "10gcjfz", "title": "WIBTA if I told my mom “no” to living in my guest house?", "selftext": "For background I F(25) and my husband M(30) bought a home in the last year, we have a second house on our lot we currently rent to my husband’s friend M(28) he will be moving in June to live with his girlfriend. We are happy for him and wish him the best. We will have a vacancy and are planning to do short term rentals for people that travel for work. \n\nMy mother F(60) lives with her boyfriend but they aren’t really very happy, each has past issues that neither will deal with nor change their minds. Basically refuses to compromise on things and it creates a lot of tension between them. I have recommended couples therapy but I don’t wish to get involved. My mom has 4 dogs and will refuses to admit she cannot handle them, it’s been a major pain point in the past (this is relevant for later) \n\nOn to this issue, I accidentally let it slip that we will have a vacancy in June and while she hasn’t asked yet I have a feeling she will ask if she can move in. I assume she would offer to pay but I cannot live with her again, she wouldn’t be a tenant, she would constantly ask me to do things for her. She can’t keep to a boundary to save her life, I was never so depressed in my life than when I lived at home. I do not want her living near me let alone renting from me. Plus she’s a slob, dogs use the bathroom inside at times and she will ignore it for hours before cleaning it up. Also I wouldn’t feel comfortable with someone with more than two pets and she has 4 big dogs. Also I don’t feel like I can trust that she wouldn’t take advantage of me. I’m afraid she will try to guilt trip me about how she wants to move out of her boyfriends and I’m a horrible child for not helping and she raised me so I should do this. \nSo WIBTA if I don’t let her move into my guest home?", "created_utc": 1674160724, "permalink": "/r/AmItheAsshole/comments/10gcjfz/wibta_if_i_told_my_mom_no_to_living_in_my_guest/", "score": 63, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Telling my mom no to moving into my guest home. I may be the asshole because she can’t afford to move into an apartment and they wouldn’t allow her dogs and she is unhappy in her current living situation. I will have an empty guest house that would be reasonable pricing wise and she could “technically keep” the dogs. Even though I don’t want to allow this due to my own comfort.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n# [Check out our upcoming Reddit Talk With John Hodgman on January 18th @ 7pm EST](https://redd.it/109b8y5)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nWhen she does ask. Just tell you that you already have a new renter lined up.", "NTA, and I applaud you for being willing to tell your mother “no” in the interest of your own mental health.", "NAH - That rental unit is your business.  It's not a good idea to do business with family.  Especially family who you have a contentious history with.\n\nYou don't owe your mother anything for raising you.  That was her choice, not yours.\n\nBut, since she hasn't even asked you to move in, she's not an AH (in this situation) either.", "NTA, do not let her move in!", "YWNBTA. It’s your house and you can freely chose who you want to rent stuff out to.\n“No.” Is a full sentence. You don’t need to justify yourself.", "Thou WNBTA here.\n\nThy mom sounds like hard work and thou shouldn't feel thou needeth risketh thy own mental health in this case.", "NTA...not mixing business and family is just smart. If she asks, you can just say you have other plans for the building or that you don't want to be a full time landlord.", "NTA.\n\nIf she asks, tell her you already have plans for the rental.\n\nIf she asks what plans, steeple your fingers and tell her \"Oh, BIG plans!\" and laugh maniacally.", "NTA. just lie and tell Herr you found a new Tennant.", "NTA, it’s important to set a firm boundary with people with poor boundary management. No is a complete sentence. You don’t need to explain, just say no, then change the subject.", "Nta and I don't think sugar coating your reasons is a good idea. When she starts arguing just show her what you wrote here.", "NAH\n\nI wouldn't blame her for asking but this situation seems like it would end in disaster.  The only way it seems like it could work would be if she got rid of her dogs and you could come to some sort of agreement about her respecting certain boundaries, but it doesn't seem like she is really capable of that and it will inevitably become a problem.\n\nThat said, you can still expect her to be mad at you and lay on the guilt trip.", "Nta\n\nIf she asks just say the amount of horror stories you've heard about mixing business (because you're renting it, it is totally business) and family 99.99999% never ends well, and you don't want to risk ruining your relationship over something like money.", "NTA\n\nIf she asks to either say sorry no that's not a good idea or you have someone ready to move in.", "YWNBTA - you have an investment and you need that investment to make returns for you and your husband’s future. I had a similar situation, minus the large dogs, and I would STRONGLY recommend you definitely NOT rent to family", "WNBTA sounds like a nightmare waiting to happen if you let her move in. Do not give in, stay strong", "No, YWNBTA - who in the seven hells would ever actually WANT someone like this living with them?  The issue with the dogs alone is a total dealbreaker and I love animals.  It's sad that you feel you have to lie to her, but you do what you have to so as to avoid an invasion.  Don't let her in, not for a weekend, not even for an hour.", "NTA and find a way to stand firm with your no. She's a grown woman and can find alternate housing for her and her dogs. I have allowed this, you will never get her out. The only reason to move her in will be when the plan is that she will live out the rest of her life there,  and  is easier for you to provide end of life care if she's in your back yard than if you have to travel a half hour to her house every day to make sure she eats and in the middle of the night when she falls and can't get up.", "NTA, but ignore the advice to lie and tell her you already have a renter lined up. That will do even more damage to your relationship.  Don’t rent to her, tell her that you don’t want to risk your relationship by doing business with family, and stick to it.", "NTA I think telling her that your rental will be pet-free is the best way to go. It's your choice to keep your home (and yard) in good condition. That's your right.", "NTA. I'd encourage you to learn that boundaries are a good thing and no can be a complete sentence, but if you aren't comfortable with that, lie and tell her you rented it out already.", "NTA\n\nRent it out, burn it down, do whatever you can to keep her from moving in. If she moves in it's only a matter of time before she stops paying and you'll never be able to get rid of her.", "NAH\n\nYou’ve made a list in your post of all the bad things you went through when you lived with her before. You also say you cannot live with her again. So, you have to prioritise yourself and your husband. \n\nIf she asks, you need to say no. And you need to keep saying no. I’m sure she’ll be angry and upset, but it’s not worth ruining your life just to keep her from feeling like that.", "So much better to have her annoyed at you from afar than in your space!! Definitely WNBTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor background I F(25) and my husband M(30) bought a home in the last year, we have a second house on our lot we currently rent to my husband’s friend M(28) he will be moving in June to live with his girlfriend. We are happy for him and wish him the best. We will have a vacancy and are planning to do short term rentals for people that travel for work. \n\nMy mother F(60) lives with her boyfriend but they aren’t really very happy, each has past issues that neither will deal with nor change their minds. Basically refuses to compromise on things and it creates a lot of tension between them. I have recommended couples therapy but I don’t wish to get involved. My mom has 4 dogs and will refuses to admit she cannot handle them, it’s been a major pain point in the past (this is relevant for later) \n\nOn to this issue, I accidentally let it slip that we will have a vacancy in June and while she hasn’t asked yet I have a feeling she will ask if she can move in. I assume she would offer to pay but I cannot live with her again, she wouldn’t be a tenant, she would constantly ask me to do things for her. She can’t keep to a boundary to save her life, I was never so depressed in my life than when I lived at home. I do not want her living near me let alone renting from me. Plus she’s a slob, dogs use the bathroom inside at times and she will ignore it for hours before cleaning it up. Also I wouldn’t feel comfortable with someone with more than two pets and she has 4 big dogs. Also I don’t feel like I can trust that she wouldn’t take advantage of me. I’m afraid she will try to guilt trip me about how she wants to move out of her boyfriends and I’m a horrible child for not helping and she raised me so I should do this. \nSo WIBTA if I don’t let her move into my guest home?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "......imagine she never asks lol", "YWNBTA. Just tell her you must have positive references.", "NTA\n\nKeep those boundaries boundaried.", "NTA\n\nParents have a responsibility to look after their children (to a point) but it doesn't go the other way. Your under no obligation to provide housing for her if you don't want to.\n\nThat rental property is a route to your own financial freedom and your right to do with as you wish", "NTA, you have extremely valid reasons to not want to rent to her.  You can use your lease clause of no more than 2 pets as reason.  If/when she goes on her victim poor pitiful me diatribe, just shut her down.  Block her if necessary.", "Absolutely YWNBTA. Sounds like you have found a healthy boundary where you can maintain some sort of relationship with your mom. That will be lost if you let her move in. There are plenty of ways to tell her no without having to be specific you are telling HER no, like only short terms, no pets, no family, crazy high rents, etc. Or just additional flat truth of 'all that plus, I don't think it would be good for our relationship, so no\"", "NTA and make sure she doesn't have a key", "NTA.\n\nNot sure exactly where you live, but in the US, for example, laws tend to favor tenants and not landlords. Ending up with a bad tenant can be an absolute nightmare; it wipes out any profit or gains you might have had, and evicting someone who fights back is a long and drawn out process. Bad tenants can bleed you dry to the point where you'd rather not even own the property, but you'll be stuck with it and miserable.\n\nGiven that you already know your mother has some serious issues, I wouldn't even remotely consider renting it out to her, if she asks.", "NTA. It's business, not personal, & I would explain it to her exactly that way. If your mother is willing to sign a lease with a specific amount of rent due on the first of every month, you are not on call to help her for anything that isn't directly related to the property, & a *massive* security deposit due up front for pets, maybe consider it? But by no means should you let her insert herself in your life & sponge off of you as you believe she will do.", "NTA you don’t owe her anything. Your wellbeing is more important", "NTA.\n\nJust very sweetly tell her that you cannot possibly mix business with family--and the guest house is most definitely business.  After all, you wouldn't want to have potential problems in your relationship with her, right?", "My sister ~~threatened~~ offered to help my mom out by moving in with her if something happened to dad (he was very sick at the time).  My mother's response was priceless: \"If she moves in with me, one of us is going to die--and it won't be me!\"  (my sister is extremely bossy).", "YWNBTA\n\n&#x200B;\n\nBut maybe drop that you are so happy you already found a new tenant. This will solve your problem nicely.", "Never mix family and business. You know deep down this'll end in tears.  Nta", "NTA.  I have firm rules about family:  never loan them money unless you can afford it being a gift, never go into business or do business with family (and that includes renting property), and never let them move into your house unless you are good with it being long term (because it always is).  Allowing your mother to move in will drive you crazy.  Don’t do it.", "NTA\nWhy no casually mention you’ve gotten a tenant? And going forward don’t talk about the vacancy state of the guest house.", "NTA\n\nCould your Mom even qualify to pay market rent?  Like, does she have a good credit rating and sufficient income?\n\nBut whomever you rent to, your lease should specify \"no pets\" (or the number, kind, size of pets allowed).  \n\nTell Mom, \"Sorry, but we can't possibly risk renting to anyone with dogs/pers.  It's too high a risk of them causing damage.  I can't break your heart by asking you to give up your dogs, so I would never ask you to move in.  Besides which, all the experts say, 'Don't mix family and business'.  Like, if things go bad, it just wrecks the whole relationship.  Let me know if you want help looking for a place, though.  I'd be happy to look through listings and good ones on to you.\"\n\n\"Sorry, Mom, but renting the house is a business for me and I can't risk losing money.", "Get a head start...\nMention you have a deal going with a new tenant..\nThen she will not need a no from you", "NTA.  I can see if she moved in that she probably will either not pay rent or expect a huge discount.  Be intruding in your life continually, not giving you privacy.  Don't do it.  Just tell her you've found someone else.", "That’s a great idea because I know she will ask", "Exactly what I was going to suggest.\n\nNTA", "And I don’t know how to explain that without her getting offended. I am thinking of saying that we already have someone lined up.", "She’s a lot, just a day with her is taxing. Oh and she’s not great at on time bill payments. So it would likely be a horrible business move on my end.", "Yeah she won’t take that well. She would sob and go into a “poor me” spiel", "I expect tears and “woe is me” as she would literally choose the dogs over any person in her life but if I said “no pets” she would be incredibly angry at me for even suggesting it. This has been a past issue so I already know that’s how she would react.", "I keep her at an arms length and we meet in the middle for things due to her disrespect for boundaries. Also I didn’t even mention that she has worse issues than what was listed I won’t get into those but it’s to the point where I will fear a phone call from her because I never know what craziness she will spring on me. I have had to call out of work due to the panic attacks she has induced on me. She does not take bad news well at all and I fear her reaction and how it will affect my mental health.", "When I let it slip she said “hmm interesting” that’s when I knew she was gonna ask at some point.", "She does not, it’s on a keypad. She also lives 2 hours away. She’s lucky we live in the same state still. Due to the boundary issues I keep myself distant.", "You can even tell her the lease is already signed if she tries to push the issue.", "Advertise it early and rent - that way you don't need to lie to your mom and it's a non issue", "She probably will be offended if you say that. \n\nYou could say, “Sorry, mom. I can not rent to you because you want me to be at your beck and call. Also I don’t know if you want to pay rent. Yes I will charge you rent even if we are family. Also I don’t want the house to be a mess. I will charge you for the repairs.”", "We give you permission to say no and not wreck your life. Lie if you need to do that.", "Unfortunately, unless you just let her move in, she is almost certainly going to be pissed at you.  Doesn't mean she's right or you are an AH, but she's going to see it that way.", " It really sounds as though you should put some serious limitations on any contact with her. Like maybe not at all? What on Earth are you getting out of the relationship other than panic attacks and misery? That's always a touchstone in my book.", "It sounds like you need to go veeeery low contact with her. And stop taking her calls.", "At full market rate", "That seems way more offensive than just saying \"sorry, we already have someone moving in\".", "is this a joke? this is terrible advice, the white lie is far better", "In truth? I pity her, she had a hard life and raised me and my brother alone. My brother was the problem child so I was pushed aside, I was independent since I was 11. She has since tried love bombing me as a young adult and did help me with things but it’s complicated and there are times it’s okay and I enjoy her and others where I wish I was NC. I’m sure she’s bipolar as I am too but she was never medicated or anything so the mood swings were violent. She’s never saved for her retirement and will likely die working. I feel like it’s responsibility to help her as my brother won’t. I am NC with him. It’s why I feel torn on this issue if I am the asshole. If I don’t help she will be a ward of the state eventually.", "And they've paid first and last month's rent already.", "Better yet a 12 Mon term. 🤣"]}