{"id": 7811, "submission_id": "10gssit", "title": "AITA for being “racist” to my son’s girlfriend?", "selftext": "I (39M) have a son (17 M) who recently got a girlfriend. His girlfriend is black and a very nice, kind and beautiful young lady. I have met her and invited her for dinner and family events plenty of times and she’s a joy to be around. But recently my mother has been staying with us because she  is recovering from a surgery she had and she’s going on 70 years old so she can’t do much on her own. Long story short my mother is a classic racist and being a raging narcissist and she is not one to hold back from her opinions. I showed her a photo of my son and his girlfriend and she went on a 2 hour rant about bloodlines and kept saying they “don’t look right” and when I said she was coming to dinner she said doesn’t want the girl near her because it’ll “disturb her” so last minute I told her she could not come. My son has been trying to invite his girlfriend over everyday since but I said no multiple times due to his grandmother being here and her saying she doesn’t want her near her, I just don’t want any problems. But he argues that I am being “a complacent racist” by even allowing her to be here. And even more so for not allowing her to come over to “protect a racist”. He says I should of told her to leave the moment my mother said all that stuff. But my mother is an elderly woman who can hardly make it on her own as it is. Definitely much harder after surgery. Though I don’t agree with her I can just leave her to fend for herself. I literally do not know what to do. My wife says my son is right about me being complacent but of course she’d agree because her and my mother don’t get along well. I know I am not a damned racist. But now everyone is saying I am aiding one by taking my mothers side. So AITA?", "created_utc": 1674207676, "permalink": "/r/AmItheAsshole/comments/10gssit/aita_for_being_racist_to_my_sons_girlfriend/", "score": 4940, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Defending my mother for her prejudice actions and letting her stay with us\n\n2. Because she is being prejudiced to my son’s girlfriend\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Hey op… your wife doesn’t agree with your son because she doesn’t get along well with your mother…. She agreed with him because he was right… \n\nStory time; I am half black, my mother is white and my step father (I’ll call him dad)is white. While visiting my dads dying grandfather in the hospital, one of my dads uncles made some extremely racist comments. My dad started arguing with him, because well, we are his daughter and you don’t talk about this man’s daughters like that. Out of nowhere grandpa shoots up, gets out his hospital bed while his monitors are going CRAZY walks over and punches my dad’s uncle so hard he fell on his ass. Grandpa proceeded to say that he would rather die, right then and there then watch someone he loves be so incredibly raciest to such loving, kind children, grandpa kicked that uncle out the room and that man wasn’t allowed back in, and grandpa made everyone promise not to let him go to his funeral. \n\n\nOp that’s what you said your sons girlfriend is she is nice and kind, yet you are 100% allowing your mother say whatever she wants and saying your sons girlfriend isn’t allowed over because of this. This girl has done nothing and will now will remember this for a long long time. You are punishing your son and his girlfriend because your mother is racist.\n\nEdit :  YTA", "YTA. \"my mother is so elderly and feeble that she will go on *two hour* rants about how much she's a proud bigot.\"\n\nman, i never even went on a two hour squeeling when i got pokemon for the first time. your son is right, you'd rather defend your bigot mother rather than go, \"hey, shut up and get over it\"", "Definitely YTA,  sorry but protecting a racists does make you complacent and enabling this behaviour. \n\nYou have no gumption to get her to leave and 70 isn't old, she can get in home care.\n\nI would send her racist ass packing.", "I get what you were going for, but if granny is incapable of living in the present, don't let her think she's winning. \n\nInvite his girlfriend. She's very special to your son, and thus, very special to your family. Don't invite granny. \n\nYTA. You and granny, both.", "So your mother, who is in YOUR house, gets to say who can and can not come to your house because \"they will disturb her\"? \nYour son and wife is right. You are just as guilty as your mother. You are a complacent racist and enabling your mother's bigot behaviour.\n\nYour mother can stay and eat in her room. She doesn't get to dictate who comes into your house. Grow a pair.\n\nAnd if it wasn't obvious, YTA", "[removed]", "YTA. Time you grew a spine and stood up to your mother. Specially when she's incapacitated. And yes, you are aiding a racist.", "YTA. If she’s being an overt racist towards your son’s girlfriend, you really do need to put your foot down and tell your mother that she can either keep her bigotry to herself and leave the poor girl alone when she’s around the house, go sit in another room when the girl’s over if she’s unwilling to behave like a decent human, or start considering which nursing home she’d like to go into. She isn’t living in the year 1950 anymore, and if she wants to create a bunch of tension and drive a wedge into your family because she’s unwilling to let go of bigotry that’s clearly causing significant problems in the lives of you, your wife, and your son, she shouldn’t be living with your family.", "YTA for not standing up to your mother. \n\nYou're accepting her horrible behavior in YOUR house and that's just baffling to me.", "YTA. I’m half black and my mom cut out her entire family due to racist comments.", "Okay so my grandma is a couple years older than your mother, she was raised in a very conservative culture so she has some racist opinions, despite getting better with the years. When she says something out of line, we (her children and grandchildren) tell her that what she said isn’t appropriate, and why it isn’t. \n\nYou don’t really mention any mental degradation in your mother, just that she’s got no filter. I’m sorry bud but someone isn’t off the hook for racism, homophobia, sexism when they pass the senior citizen milestone. If you refuse to tell her that she’s being racist, and that you won’t tolerate these opinions in her home, instead exclude your DIL from a family event to make sure mother isnt « disturbed »… yeah that’s being complacent to racism. \n\nCus DIL isn’t going away, she’s a package deal with your son now. If there’s family reunions where your mother will be, will DIL be asked to sit it out as well? If they have children, will all the grandkids be left out too because they’ll be mixed, or will only the white passing kids be allowed because they look acceptable to your mother (and perhaps other relatives)? \n\nYTA", "YTA you’re standing by a racist just to keep the peace..? You’ll loose your son", "YTA\n\nI'm in a similar situation with our son and my MIL. She doesn't approve of my son's girlfriend and we get told to tell him to tell her to not speak about this or that subject. They politely obey but just rarely visit her and she's complaing she never sees them. We just shrug it off and say \"oh well, you make your displeasure clear, of course they're not going to turn up and pretend it's happy families, pull your head in and they might come, otherwise we don't blame them for not visiting you\"", "YTA. Your mother is clearly in the wrong, yet you are punishing your son for her comfort. \n\nI don't blame your son for lumping you in with your mother at all. How are you ever going to be able to look at your son's girlfriend without guilt, knowing that you repeatedly barred her from your home because you were catering to someone you describe as a racist and narcissist?", "> But he argues that I am being “a complacent racist” by even allowing her to be here. And even more so for not allowing her to come over to “protect a racist”.\n\nYour son is correct.", "YTA. Only racist choose racists over decent people. Your son probably lost a lot of respect for you, when you didn’t stand up to her.\nWhy is a 2h rant about bloodlines something that you allow to happen in your home?", "YTA. You are taking the easy way out and letting your mother control who is welcome in your house. By not telling her she is wrong you are condoning her behavior so by default also racist. Apologize to the sons girlfriend, let her come over, tell your other to stay in her room, shut up or get out.", "Your son & wife are right OP. If your mother has the energy to be a vile human, then she sure can cope without your help. YTA.", "YTA. You should stand up to your mother. It'd your damn house. While I get you're not going to kick her out, at least set her straight. But if the gf does visit, you might just want to warn her that your mum is a raging racist mole, and that the gf is more than welcome to bite back.", "YTA. The racist can stay in her room. Or go on an extended visit to torment another child of hers. You are choosing her over your son.", "YTA-When you protect a racist’s feelings and prioritize a racist you become a racist and an asshole. Being elderly is not an excuse to be a racist asshole.", "INFO: \nOP, are you incapable/unable to afford/find a place for your mother to go to a home? Or are you against said methods? \nWas there no other siblings able to take her in?", "YTA 70 isn’t even that old, have an honest conversation with your mum and tell her to pull her head in", "You know what they say, if you got 12 people sitting around the table and 1 of themselves racist and the other 11 are silent, you got 12 racists at a table. Yta", "Yta, lock grandma in her room while you have dinner with the gf and don’t put up with that nonsense", "YTA  - 70 isn't that old, so you really have no excuse. Not standing up to a racist is as bad as being a racist because you're allowing it to happen. SMH.", "YTA. He’s right your being complacent in her racism. You should be standing up to her like your son stood up to you. While I understand you can’t just dump her you need to tell her that she’s not going to be racist in your house. You will have whoever you want over for dinner and if she doesn’t like it she can sit in a room by herself. She’s going to obey your rules as long as she’s under your roof. If she doesn’t like it she can take her racist ass and find somewhere else to go", "Is there some reason the old mean racist can’t stay in her room while company comes over?\n\nShe’s the one who doesn’t want to mingle.\n\nWhy is your son being taught to prioritize hate?\n\nGet your house in order.\n\nYTA", "My wife is half black. My grandad can be somewhat racist at times. He’s never said a word against or to my wife in any way shape or form and has only ever treated her with love kindness and respect. He’s 94. YTA", "if she's that helpless on her own, just set her up in her room and leave her in there while the girlfriend is visiting... let her be \"grounded\" and alone while you entertain your son's gf\n\nit will show your mom that her awful opinions are not welcomed in your house... she's a narcissist, so probably won't learn anything from it, but at least you can show your family you have a spine\n\nYTA", "You listened to a \"two hour rant\", during which you did not defend your son's girlfriend or tell her that the girlfriend IS coming to dinner and if she can't behave herself like the adult she pretends to be, she can stay in her room. AND if she doesn't, and says ANYTHING offensive, you will ask her to find a rehab center that will help her during her recovery?  All you got out of that two hour rant was that your son's girlfriend should be uninvited because you wouldn't want to upset your mom.\n\nShe's almost 70. If she does not have dementia, that is not so old that she can't zip her lip and be cordial.\n\nYTA and a complacent racist. Not a \"racist\", an actual racist. You think you are just protecting the lovely girlfriend who is a joy to be around, but you are actually protecting yourself from having to take a stand with your mother.", "YTA. Your son is right, your mother is the issue, and so are you for backing her. She isn't elderly! She's in her 60s! Far too young to pretend it's normal to be racist. She's a young bigot who is able to care for herself. Send her home.", "YTA\n\nGrow a pair and stand up to your mother, She either respects your son and his girlfriend or you ask her to leave \n\nHow DARE she treat people in that way, She needs to be ostracised and taught that her behaviour will cause people to avoid her", "As a white guy with a black girlfriend I would say you're enabling your mothers racist views.", "You are defending a racist. Tf is wrong with you yeah YTA", "YTA. If your son’s girlfriend comes over and your mom says something rude, she will stick up for herself or your son will do it. You probably won’t even have to stand up to your mom. Also, you should apologize to your wife for dismissing her view as just not getting along with your mom. \n\nI’m in an interracial relationship and I’ve learned that there’s no halfway compromise between racist and not racist. I don’t envy your position, but this is where you decide what kind of person you are.", "If you have a dozen racists in your home and you do nothing about it...there are thirteen racists in your home.\n\nYTA", "YTA your son wasn't asking you to throw your rasist elderly mother out of the house and leave her alone. He just asked to not be limited by someone's rasist views. You clearly chose to side with the rasist, even if it's just because you don't want to argue with your rasist mother. But being complicit isn't much better, especially since you are a grown man who can stand up to his mother, not a child who is dependent on her.", "YTA. Tell your mother that she is a guest in your home and she needs to respect your rules. And your rules are that no one is allowed to be racist or rude to other visitors in your home. \n\nYou aren’t a minor anymore. Stand up to her.", "YTA It should be the girlfriend's decision. \n\nIf she feels she can put up with your mother's racist rants then she should come over. She might even relish shutting down a racist. \n\nYou feel like your protecting your son's girlfriend from your mother, but you're actually enabling your mother's views.", "YTA\n\nWhat you do is explain to your mother in no uncertain terms that if she says another word about this, she no longer has your support in her recovery. That should have been said 2 mins into her 2 hour rant. Instead of setting a boundary, you passively let her go on and let it impact your son. Your mother is an adult who is capable of restraining herself or living with the consequences. You are being complicit.", "YTA, your son's right.", "Info: Why can’t you stay with your mother at her place while she recovers?", "Old white ppl, look almost nice and innocent. However they did some the craziest Sh** the world will never witness, hopefully the world will never witness. \n\nI just have a feeling this sweet look old lady has done really horrible things of a similar or lesser magnitude. As poc old white ppl of this gen really terrify me as I know or have a rough idea what they did to my grandad, fore fathers and my father and my immediate family. The decade I was born in wasn't perfect either and I have some real horror stories of my own. \n\nHas anyone heard the true story, during her generation. A young white girl prolly between 9-12 saw a black boy in the grocery store.\n\nShe went home distressed, and claimed the black boy took her around the back of the store and assaulted her sexually. The black never did any of that sort. \n\n\nEventually she admitted to a nurse on her death bed, and possibly in her diary, that she was jealous that his sisters had nicer dresses than her.\n\nThe black had horrible things done to him, he was violently beaten, tortured and his genitals cut off. His families home was burnt down.", "Elderly?! My dad is 75 next year, and he walks miles every week. 70 is not elderly. You are making excuses for her.", "NTA - you’ve got good intentions but you’re not being creative enough with your solution. It’s far too late to convince your mum to change her opinion, that generation tend to be stuck in their ways. \n\nYou should think of an alternate solution, like maybe go out for dinner without your mother, and just let your son and his gf chill out away from the grandma at home, this way you are minimising any interaction with the racist grandma. She will 100% say something messed up at the dinner table, at least from my experience that’s where my relatives tend to air their controversial opinions. Either way you should definitely be letting his girlfriend visit although I think the grandmother saying something messed up is inevitable. But the best you can do is try to reduce her chances to say something out of line.", "oof you are being put in a hard position not gonna lie. You are most likely the one who has the closest connection to your mother so it is understandable that it would be harder for you but i think that you should put your foot down and explain the whole \"your house = your rules\" and \"your son's life = your son's choice in partner\" to your mother. And if she refuses to listen then you should see if there are any alternatives to her staying with you.  \nYTA for taking the easy way out of a hard situation.", "YTA it may seem like the easiest option is to not let the gf come over during this time being.(to keep the peace with your mom) But by doing so your son is right your being complacent if your mom has an issue with it send her ass packing. The fact that your setting this example to your son and his gf won’t bode well for the future. And if the gf knows I can’t say she will be very comfortable at family settings know this", "YTA\n\nWe have a german proverb: If 10 people sit at a table and there is one Nazi, there are 10 Nazis at the table.\n\nYou can apply the same to racists. If you accept racist behaviour in your house you support it. Don't be a mama's boy and stand up to her. She can always go and live somewhere else if she is going to misstreat your guests.", "So you're against racism, except when the racist is your mother? For you your Mum's racism is ok because she's old and frail. Hunni she's old & frail now, your Mum has probably spent her life terrorising every POC she's encountered and now she's doing it to your son's gf while old and frail. YTA", "You're defending a racist. Definitely YTA", "Gently YTA. Not kicking her out is one thing but telling her \"Son's girlfriend is coming over. You can either be respectful or you can wait in your room until the visit is over.\" Would be caring for your mother AND refusing to enable her racism", "YTA and a complacent racist. The moment you stand up for, defend or coddle a racist, you are a racist.\n\n&#x200B;\n\n>My wife says my son is right about me being complacent but of course she’d agree because her and my mother don’t get along well. \n\nNo, your wife is saying that not out of spite toward your mother, but because you're behaving like a racist.", "I was in two minds about this one, but I've decided on YTA. If you were doing it to protect the girlfriend from your mother's vile attitude, and were actively speaking up every time your mother pushed the rubbish she's pushing, then maybe, MAYBE, it would be a little more understandable, but you've literally bared this girl from your home so as \"not to cause problems\" for yourself. Not cool dude. Support your son and his girlfriend, tell your mother that her thinking is outdated and gross, and stop being such a coward.", "YTA - like hardcore YTA. sorry to tell you but you and your moms relationship is in all likelihood going to end before you and your sons, but your actions here will go a long way to making sure you wind up losing both. \n\nI’m assuming your son is aware of the fact your mom’s a racist prick, so he’s bringing his black girlfriend over despite that and they’re likely ready for the bullshit, as best as they’re able. \n\nYou not wanting to deal with the conflict is a sign that yeah, you’re taking the racists side, which makes you a racist in this instance. Let’s take this to the next logical step: imagine saying: “sorry son, you can’t bring your black girlfriend here because your grandmother is a member of the Klu Klux Klan” you wouldn’t wonder if you’re racist, and that’s how this sounds.\n\nIf you, your wife, your son, and your sons girlfriend are all on the same page, then your mom has the options to shut the fuck up, or stay in her room through the evening, or just leave your home. \n\nOr you can take your racist mom’s side and keep proceeding as you are,", "I'm going to agree with your son. You may feel you aren't a racist, but you are coddling one at the expense of your son. Yeah, the surgery has been tough on your mom. YTA.", "YTA. I don’t think you are personally a racist, but you’re 100% enabling & pandering to one. By pushing your son’s GF away you are demonstrating that your racist mother’s views are more important than your relationship with your son’s partner.\n\nI get that she’s old and that she’s your mum, so you don’t want to abandon her. But at the end of the day she’s a really, really shitty person and you shouldn’t be enabling that.", "YTA since your letting a racist set the rules. You say your mother can't make it on her own because of old age and a recent surgery? Than make it clear to her that either she go home and fend for herself or she stays on as a GUEST and stop dictating who you or your family have over for company.", "let's see, your choice is to let your son be with her gf, a nice girl for your own post, or keep your racist, narccisist ungratfull mom calm? yep, you are an enabler, grow a spine and tell to shut up or get to a home.", "YTA. stop enabling your mothers racism.", "YTA, grow a spine and tell your mom to deal with it, it's 2023", "ESH why is your son so eager to expose his girlfriend to a racist’s abuse? I dont care about grandma’s feelings but if her stay is temporary, why ask the girlfriend to be around someone who is toxic in that way? I hope son is not trying to use his girlfriend to prove a point to his family or something. The girlfriend’s safety and well being should be primary in this situation.", "YTA you tell mummy dearest its your house and sbe can keep such comments to herself or be put into a care home you are being a racist by bending to your mother's racism and basically banning his gf who has done nothing wrong but is just black", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (39M) have a son (17 M) who recently got a girlfriend. His girlfriend is black and a very nice, kind and beautiful young lady. I have met her and invited her for dinner and family events plenty of times and she’s a joy to be around. But recently my mother has been staying with us because she  is recovering from a surgery she had and she’s going on 70 years old so she can’t do much on her own. Long story short my mother is a classic racist and being a raging narcissist and she is not one to hold back from her opinions. I showed her a photo of my son and his girlfriend and she went on a 2 hour rant about bloodlines and kept saying they “don’t look right” and when I said she was coming to dinner she said doesn’t want the girl near her because it’ll “disturb her” so last minute I told her she could not come. My son has been trying to invite his girlfriend over everyday since but I said no multiple times due to his grandmother being here and her saying she doesn’t want her near her, I just don’t want any problems. But he argues that I am being “a complacent racist” by even allowing her to be here. And even more so for not allowing her to come over to “protect a racist”. He says I should of told her to leave the moment my mother said all that stuff. But my mother is an elderly woman who can hardly make it on her own as it is. Definitely much harder after surgery. Though I don’t agree with her I can just leave her to fend for herself. I literally do not know what to do. My wife says my son is right about me being complacent but of course she’d agree because her and my mother don’t get along well. I know I am not a damned racist. But now everyone is saying I am aiding one by taking my mothers side. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA Your house tell mommy to take a hike if she is that uncomfortable.", "“why don’t my children talk to me anymore?” gee i wonder why!!!! because YTA", "I think you could have talked with the girlfriend and son in a better way. Explain the situation and ask if they’re still comfortable coming over. Not tell them they can’t because not they might feel like you’d rather hang out with a racist.  \n\nI’d love to see gf put your racist mom in her place. And if I were you I’d tell your mom she’s a racist every time she says something racist as well, let her know it’s not acceptable in your house. It’s time to step up and be a better ally. If mom doesn’t like it she’s the asshole.", "YTA. In the conflict between a racist and a victim of racism, you sided with the racist.", "YTA,\n\nI understand this a difficult situation and you don't wanna boot your mother out, but no one is too old to recognise that racism is wrong. You shouldn't simply make excuses that she's too old to be a decent person and bar your son and his gf because she can't stop being racist.\n\nMummy dearest might be  uncomfortable but it's the 21st century, she's going to have to get over it at some point or at least learn to behave herself in the company of BIPOC people. \n\nYou are in fact supporting a racist's feelings over your son and his gf's feelings, pretty much the definition of complicit racism. You might not be racist but supporting one is nearly as bad.", "YTA. your son's gonna remember this and it might be a reason why he goes LC or even NC in the future. i agree with him here - grandma should've been told hit the bricks after those remarks.", "Put her in a home", "Yta. You may not be saying all the racist stuff, but you are protecting your mom from what? Being in the same house as a interracial couple? You didn't even let the gf know about her boyfriends racist ass grandma and let her choose if she wanted to still come over. Grow a spine and stick up for her to your mom.", "No one is saying you should dump your mother on the roadside and leave her to live on the street. But you are also being a coddling doormat and enabler of extremely racist behaviour.\n\nYou can speak to your mother, make clear her racist bigotry is not acceptable and will not be tolerated. Right now you are sitting back as she spews bile and twiddle your thumbs. Instead of banning your son's girlfriend from the house to comfort a racist, find another work around.\n\nYour wife and son are right, you are being a complacent enabler of a racist, mother or not.\n\nYTA", "Get some third party help... \n\nYta\n\nBoth your wife and son are right... You are enabling this.", ">I know I am not a damned racist.\n\nWell you're pretty accommodating to people who are. YTA", "When you're asked to side with a racist or a person of colour and you side with the racist, that puts you on the side of the racists. I get that you say this doesn't 'make' you racist, but practically the distinction is negligible.\n\nIf the racist and the person of colour can't be in the same room, you tell the racist not to be in the room - not cater to the racist and perpetuate both the attitude and the problem. Not saying you put your mother in a home or kick her out, just tell her that if she's not going to get over it then she's not welcome at dinner. May cause a few problems in the home but, hey, at least you can confidently say that you didn't side with the racists.\n\nYTA. But I think you knew that, deep down.", "In germany we have a saying along the lines of \n\n\"If there are 10 people sitting at the table and a nazi joins them than you have 11 nazis sitting at the table\" \n\nJust insert racist instead of nazi, it's the same situation. You are complicit in your mothers racism, you say you don't agree with her but you accept it even though you have no reason to. And no, she's my mother doesn't fly in a situation such as this. she is the one that needs help, either she shuts up or she can leave (and that's allready generous) everything beyond that you are in fact supporting her racism. yta", "ESH. Neither you or your son seem to care about how his gf might feel about being around your racist mother. It’s not about what bothers your mother but how comfortable or uncomfortable your son’s girlfriend will feel. If she chooses to come over, will you and your son stand up to your racist mother or will you lock her and her racist views away to protect the gf? As the POC, the girlfriend is the only person who matters here.", "Racist: get out of the pool!\n\nYou: okay well you better get out of the pool to keep the peace I don't want any problems.\n\nClearer?\n\nYTA", "If you lie down with dogs, you wake up with fleas. You're racist and YTA. Stop sheltering a bigot and making excuses.", "Yta. \"Shut the F up and stop being a racist mom.\" It's not hard", "Had plenty to say after reading this, but it hasn’t even been 30mins and everyone has beat me to it. YTA.", "You are barring a black woman from your house because she is black.\n\nThat is racist.\n\nIt doesn't matter if you are being racist to please a racist.\n\nYTA", "YTA- Complacency is a huge factor in the perpetuation of racism. \"Silence is violence.\" There is no excuse.", "Tbh esh. I was waiting for the part where OP said he was trying to protect the girlfriend from the racist grandmother. But that never happened.", "YTA and beyond complacent. Complicit.", "YTR", "NTA. In any other situation your son would be correct, but it's not like you can just leave your mother to die, so I don't see how you have any other option.\n\nThis is one of those \"screwed no matter what you do\" kind of situations. \n\nUnless you put your mother in \"time-out\" for a bit. Depending on how mobile she is, you could just wheel her into another room for a couple of hours to keep her out of the way while your son's girlfriend visits. Out of sight, out of mind. Put Jerry Springer or something on.", "YTA but ignore all the people trying to dogpile and call you a racist, they're off their meds or something.\n\nRemind your mother that it is your house, and if she wants to continue having grandson in her life as well as you and wife then she needs to keep her mouth shut and behave.\n\nBut no, trying to juggle the demands of a racist mother and your wife and son doesn't automatically make you a racist.\n\nAnyone commenting such should be ashamed", "NTA not like you have a nursing home to shove your mother in, and not like you can hire a babysitter for her.  I see a lot of people saying YTA but your not letting his GF get surprised by unpleasantries. By his behavior I think things would get ugly if their paths were to cross. Older people.can be stubborn and you can scold them till your face is blue but they're set. But defending her is an AH move, never defend a racists actions. Treat her as what she is, the problem.", "[deleted]", "This is where generational difference starts. People here talk how vile the grandmother is. But people forget. Back in her day its normal to be racist. You cant change years and years of mind conditioning just like that. Your mom's old. She will expire sooner or later. Why cause more problems by forcing her to change? Better to just make them dodge each other. No argument. No hurtful words exchanged. Done.\n\nThis is coming from a non white person.", "NTA.\nThe hardcore lefty's on here cannot understand.\nYou are in such a difficult position. Your mother brought you into the world, you're obviously not going to kick her out!\nYou're trying to protect everyone.\nWhat about everyone going out for a meal and leaving your mother at home?", "̶E̶S̶H (not ESH at all, the OPs mom is the AH and OP is stuck between doing what's right and responsibility) Thanks for pointing it out. \n\nYour heart is in the right place for your mom and you cannot leave her to fend for yourself. But you need to also understand that your mom's beliefs and thoughts cannot decide what you and your wife want in your house. You need to have a conversation with your mom where you need to basically need to tell her that the girlfriend is a part of your lives and she has to behave around her, otherwise you will be forced to find other arrangements for her. Try to make her see you are serious af. Tell her times are changing and she doesn't have to interact with the girlfriend but she cannot be rude too. She can choose to stay in her room when she's over since she has the problem.\n\nYou're stuck between your mom and family so I get it. But you will have to side with the future here, instead of the past.", "NTA", "YTA. You're basically telling your son that you value your racist mother over his girlfriend. You may think you're protecting her (gf) but you're not.", "NTA. I think you could def stand up to your mom but it’s not like you’re keeping your sons gf away because you don’t like the fact she’s black, and in all honesty, right now it’s not SAFE for your sons girlfriend to be in your home due to your mothers behavior. I think you’re protecting your sons girlfriend and I’m sorry other people don’t see it that way. No reason to have her in your house when there’s actively someone who will belittle her and hurt her, I think it’s a good idea to wait until your mother is out of your house.", "YTA, invite the GF over, spoil her with the best cooking you can make. Make her feel special.\n\nAs for the OldBat upstairs, give her porridge and gruel until she learns how to behave. \n\nShe doesnt have to be present. She could also go home and pay someone to look after her.", "YTA and yes complacent is the exact correct descriptive word for your actions. Or \"enabler.\" Your mother is staying with you because she cannot care for herself, fine. That does not mean she is the new head of the household and gets to call all the shots. \n\nShe's uncomfortable being around a black girl? She can stay in her room. She in NO way shape or form gets to dictate who comes over or meddle in your son's relationship.\n\nImagine for a second what your son's girlfriend feels like when she's told over and over again she can't come over, whether or not she's told why. If you want to alienate your son, keep it up. Because he is going to (rightly) support her feelings on this.", "I don’t think you’re necessarily an asshole for not wanting her over, bringing a child into that situation wouldn’t be the right thing to do. she’s around 17 i’m assuming, and going over to her boyfriends house just to be verbally assaulted by his grandmother isn’t something she needs to experience. However YWBTA and a BIG one if you continue to enable your mother and let her run the show. your son should never have to worry or not be allowed to bring someone over for this reason. you need to grow a spine and explain to your mother that you won’t tolerate her racism. you need to do this for your son.", "YTA. You are the company you keep. The company you keep is a racist so therefore…", "YTA You are being complicit in your mother’s racism.", "OP.  Please go and talk immediately to your son and his girlfriend.  Explain that you are caring for an elderly person who is very racist but who you have a duty to look after while they recover.  Apologies for not explaining why you tried to keep her away and explain that you didn't want the wonderful and kind girlfriend to be exposed to this aweful person and that you were embarrassed.  Ask for forgiveness and understanding. Emphasise that you do not in any manner share these horrid attitudes but feel a responsibility to assist this elderly person temporarily and was trying to protect the girlfriend.  Assure them both that should they wish to visit while your mother is there that you will be on their team and try and shut your mother down.  Good luck!", "YTA, let the old racists fend for herself. Why does she deserve to be treated with kindness and respect when she’s in the wrong and being racist. Your wife and son are both right and don’t think your son is going to forget this treatment when he’s 18 and wants nothing more to do with you. You should tell your mother to shut up and keep her racist opinions to herself you’re family are welcome to have any visitors they want in their own home and if she doesn’t like it she can leave!", "Your son comes from a generation that actually practices be the change you want to see. \n\nYour mom is old and was raised to be a racist,  apparently.  Lots of people were I guess.  \n\nYou're stuck in the middle and you chose the side of protecting racism.  Well intentioned or not,  you excluded someone coming to your home based on he color or their skin. \n\nLet me say this again:\n\n*You have excluded someone from entering your home based on the color of their skin.*\n\nYou're not protecting your mother,  The Racist,  you're enabling her. You are enabling racism.  It is alive and well in your house. \n\n*You are enabling a racist.  Racism is alive and well in your home*\n\nYour actions are racist.  Whether you like it or not,  you are allowing racism to infect you and you are showing racist actions by allowing your racist mother to dictate who is allowed in your home. \n\nTime for Granny to grow the fuck up. \n\nShe was born into a world that was racist and enabled it.  The world is changing.  Granny isn't,  but whether she likes it or not,  her grandson isn't a racist like her - seems like it stopped at you or gran. But,  Granny The Racist is living with you, in the modern world with your son,  who isn't a racist. Who dates whom he wants without apparently being racist. \n\nThe optics here for you aren't good.  Put Granny in time out.  She doesn't want to change,  okay.  But racists don't get to come out and play to spread their hate onto unsuspecting people,  especially vulnerable ones. Allow her to make the choice.  It's your house.  She doesn't get to use racism to control what you do in your house. She can play nice or she can get a time out. There's no in between. \n\n\nThe choice is yours.  You can either be a role model for your son,  support him and advocate for him or you can keep enabling Granny and acting on her racist views. \n\nYTA", "YTA. If your son is so adamant about inviting her persistently then let her come over, whether this will make your mom upset. Let them meet and see what happens after that your son and girlfriend will decide if they want to keep being in the same place as the granny or distance themselves cause your moms reaction can push her grandson away", "Dude what… YTA. Your son is absolutely right.", "YTA\n\nYour son is right. You’re putting your mother’s racist views ahead of common decency. You’re complicit.", "Invite the girl, the first word your mother says tell her she can be excused to her room. she can get mad but if she needs help she won’t leave. i don’t think you’re protecting her i see the conflict because you have to help her, but can’t back her up bc she is racist. it’s tough. you really should invite the girl no matter what though.", "NTA. Your old mother is unfortunately racist, that will not change at her age. You can't just kick her out. However I would not keep the girlfriend out of the house. In your place, I would talk to your sons girlfriend, explain, apologise and \"warn\" about your mother's opinions. She can decide herself if she wants to visit then. If it upsets your mother that's her own problem.", "Okay. As someone who has been on the receiving end of racism by a partners grandparent, your first mistake is trying to appease your mother by not making HER uncomfortable. The only way you can tackle this is to confront it. Regardless of how old she is, being racists is wrong and a disgusting mindset. No one should be enabling her, both your son and wife are right. You are being complacent. Let your Son’s girlfriend come over and make her uncomfortable. That is step one to tacking the issue instead of burying her head in the sand. So what she is old. She should know better then. I’m sure your Son and wife will stand up to her when she is outwardly racist to his girlfriend. If she’s anything like me she will handle it herself. This happened to me, and don’t worry I stood up to the racist old bat and she backed off. Also 70 really isn’t that old. Stop enabling her!\n\nYTA… obviously.", "YTA\n\nYou excluded a person of colour from your home because you wanted a quiet life with your racist resident\n\nYou chose convenience over morals", "Sounds like grammy isn’t invited to dinner that night. Seriously I understand your point as this is exactly my grandmother but bad behavior means no fun for you. She knows she is not invited because such behavior will not be tolerated. She’s taken care of and she won’t die but she’s also not allowed to participate if she can’t play nice. If she needs to be treated like a child to behave then so be it.", "YTA; your mother can get civil or get out, and shielding a racist is itself a racist act. Be better for your son. If your mother can’t be civil she can stay in her room.", "I see a lot of comments saying not to “protect” the feelings of the grandmother, which is of course true, but I feel like OP is protecting the girlfriend. It’s not fair to expose her to that. So OP either has to kick the grandma out, not have the girlfriend over, or maybe be honest with the girlfriend about the situation and let her decide if she still wants to come over. If she does, tell grandma she can’t come to dinner or she needs to behave.", "Why do you harbour a racist in your house? She needs to go. YTA.", "YTA. a racist one, too", "YTA. I am not going to comment on whether your mother is well enough or young enough to go home and take care of herself - let’s take as a given that you do need to care for her. Still you can tell her that if she cannot be polite to sons GF when she comes over, that she will need to stay in her room / another part of the house. My mom is almost 80 and is struggling with the fact that her oldest granddaughter (my niece) has come out as gay and has bought a house with her GF. I made it clear when she shared her views with me that she is entitled to believe what she wants but that she needs to decide whether she wants to be at least outwardly accepting and still be included in all family events or express her views and be excluded. She chose to be included. I know her views have not changed, but I hope maybe they will someday. In the meantime, we at least have pleasant gatherings.", "A person I’m taking care of, in my home, going on a TWO HOUR RACIST RANT? Nah man. When my parents say racist shit - even accidentally - I fucking correct them. Immediately. And I explain why it’s not okay. If they ever fought me on it I would quite literally put my foot down. If you do not shut that trash behaviour down you are complacent in the racism, period. Parents don’t get a pass just because they’re parents or old or disabled. YTA.", "YTA sorry my man but you are being a complacent racist and you are protecting a racist. But standing by and not holding your mother accountable you are passively condoning her actions and you are enabling, you are now complicit in her racism.\n\nYou picked a bitter racist woman over your own son and that's appalling. You need to do better.", "YTA.\n\nYou’re choosing the side of a racist and every time you refuse the engage with your son’s gf, you’re enabling racism within your own family.\n\nYou may technically be a racist yourself, but right now it’s a pretty fine distinction. \n\nAnd If you don’t start standing up to your mother now and actually supporting your son’s relationship, then I can’t see you ever having a positive relationship with him after this.", "YWNBTA  \nYou are in an awful situation and I think it's really easy to say \"your house, your rules\", but the reality is you feel responsible for your mother who is old and I completely get that. She definitely should respect your son's girlfriend, for me, she's the asshole.   \nI think you should invite your son's girlfriend, and tell your mom that she is coming. If your mom is not happy with that she can leave the house or stay in her bedroom (it sounds really childish)   \nHope it will get better soon, hopefully, she will meet the girlfriend and see how nice she is, she can still change her mind :)", "“We must always take sides. Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented.” -Elie Wiesel, Nobel laureate and Shoah survivor", "YTA, and your son is absolutely right. If your mother is sick and can't care for herself, all the more reason for you to tell her that her racist behavior is unacceptable and will not be tolerated if she wants to be a guest in your house, she can go to a rehab facility instead. The more needy someone is, the LESS their poor behavior should be tolerated when you're going out of your way to do THEM a favor, not more, why are you reversing this dynamic? Your son and his gf doesn't need her negativity, your wife doesn't and  you don't.", "YTA and a racist apologist. Tell your mom to shut up or find somewhere else to stay.", "YTA Your mother being sick and old is not an excuse to be racist. By letting a racist be a racist you're contributing to the problem. If people think it's extreme that you would kick your mother out for such behavior perhaps those people can take care of her then instead.", "YTA. Actions speak louder than words; you have the words of a non-racist and the actions of a racist.", "EHS.", "You by denying your sons girlfriend to come have dinner or visit are taking the side of the grandmothers, you may not have a racist thought in your head but you are giving the grandmother (the actual racist) what she wants. You are the asshole here.\n\nI think you know what you need to do to make this right but as of right now you are favouring the quiet and less confrontational route of pleasing a racist rather than defending your son and his girlfriend. Don't be that guy.", "Your Grandfather was one hell of a man!  OP, read this over and over and over. THIS says it all.", "Your story brought tears to my eyes! What a beautiful example of a person sticking up for someone they love and saying no to racism and hate (I mean, I don’t usually condone violence but if there was ever a more appropriate time…) This man literally rose from his death bed to show everyone that he would not take such horrid behaviour. I am really glad you have such caring people in your life. I hope OP takes heed of all these comments and acts accordingly in future.", "gaw damn ! respect! may he rest in peace.", "Your grandpa was the best kind of badass!", "Also if you feel you can't kick your mother out, you need to tell her to stay in her room/out of the girlfriend's way when she's around, you need to put the consequences of your mother's racism back on your mother not onto your son and his girlfriend as you currently are. That's what is making you complicit in your mother's racism, is that you're not giving your mother any consequences for it", "They're talking about this woman like she's in her late eighties, not someone approaching 70 🤔", "Also people act like the minute you become a senior citizen, you’re incapable of being accountable for your actions and words", "This! And you let her spew racist Bs for two hours?Your house, your rules. You owe your son and his gf huge apologies and you must tell your mom stfu. \n\nShut that shit down. If she cannot zip it, she should not stay there. She should not be at dinner. \n\nWouldn’t it be a learning experience if you had a spine? You have messed up. Act now.", "Also, why can’t OP go stay with his mother at her house?", "Or she could eat in her room alone until she learns how to behave around guests. If OP insists that she can't be responsible for her actions, he should treat her as a big racist baby she is", "Granny is apparently living with OP while she recovers from surgery.\n\nIf she's fit enough to go on rants about her racist views, she's fit enough to be told to STFU.", "Okay. I snorted at that one.", "I’d agree but take a visit to justno and see that racist old white biddies aren’t really people you can reason with or tell what to do. They just go about making your life a living hell and you either chuck them out of your life for good or you find the path of least resistance. \n\nIn this case, OP still loves his mother, so he chose the path of least resistance. Keeping the gf from being attacked by a racist while keeping peace with the racist is the best he can do. \n\nYes I’m aware racists are horrible awful disgusting people. But I’m also aware it’s incredibly difficult to toss your elderly, physically disabled mother out of your life, no matter how wrong she is.", "My dad will say some Facebook meme level political shit while I’m sitting with him in my patio and I just get up and walk back in the house lmao", "If Granny is so unabashed and outspokenly racist, do you really trust her to stay away and keep her mouth shut?  I wouldn’t want to risk OP’s son’s gf to hear any of the terrible things GramGram might say. \n\nJust take Op’s son and his gf out to dinner or something and leave the old bat behind.", "The woman isn't even elderly! She's in her 60s.", "Took the words right out of my mouth", "That is the most asinine mentality that I see people parroting on a regular basis. Actively doing a terrible thing is always going to be significantly worse than passively observing a terrible thing.  \n\nYou will always have more responsibility for your own actions than you will for other people’s actions.", "Yeah and at least the best OP can do is own up to be defending a racist.", "I agree. But would add that he may actually be defending his mother from having her indefensible views taken down by the son's GF who is probably more than capable of putting mother in her place..", "Sadly this story is one of many. Many horrible things were inflicted on a black people in her generation as you put it. There are also many horrible things that have happed to black people in our lifetime and are happening right now.", "Everyone act in this sub like that racist mother would suddenly become the best BLM member, beacuse her son said so. Feel good moments are not something what should be at the expense of the black woman. If that stay is temporary, OP should apologise to the son's girlfriend, but nothing more is needed.", "Exactly like why is the son trying to invite this poor girl over when he KNOWS his grandmother is a racist and going to say something, idk why OP is letting his grandmother stay with them when even she doesn’t like her, but like in all honesty it is for the best that she doesn’t come over and get subjected to that racist woman’s rants.", "All of these people are far too young to be of the 'to be respected' mindset. The mother in question is in her 60s, the father making his kids girlfriend stay away will be 40 tops. They're just unpleasant people.", "Not really. If Grandma is 60 now, means she's \"young\" enough to not be a batshit crazy racist unless it was bred in the family.", "Nothing to do with 'hardcore leftys'. His mother is racist, he is allowing her to express those views in his house. \n\nSo what if she gave birth to him? It doesn't mean he has to tolerate her racist behaviour. He doesn't need to protect a racist. It's not a difficult position for anyone who is against racism.", "How", "Oh definitely, grandpa was fantastic, unfortunately within a day or so after grandpa was gone, but I can tell you who definitely wasn’t allowed to step foot at his funeral.", "Not even making an attempt is the issue here.", "How is this the best he can do? He can still tell her mother that her racist views are not accepted in his house and that she either shuts up and deals with it or she can stay in her room when the sons GF is visiting.", "I wouldn’t normally consider her elderly either. I was simply using the term OP used.", "“No, you don’t understand, I didn’t kill a baby! I just sat back watching quietly while doing absolutely nothing to intervene while someone else killed a baby in front of me!”", "Allowing bad actions, specially in your own home IS your responsibility as a human being.", "It not only black ppl the British did a lot to South Asians... The list goes on.", "Yes! Exactly my thoughts! If everyone knows this is how the grandmother is why would he want her around his gf. Who would be an innocent victim here. She doesn’t deserve that.", "But he’s not. He wants OP to stand up to racist GMA and either demand she be nice or she leaves. This is precisely why my mom warned me about interracial relationships though. She always said sure they may not be racist but what about grandma?", "[deleted]", "What a note to leave on, though! Amazing.", "If someone doesn’t want to stop the murderer for fear of getting murdered themselves, then that would be not nearly as bad as actually killing the baby. \n\nTry harder.", "You want to say you have some accountability for that? Fine. But if you are literally doing something bad, then you have 100% accountable for your actions.", "Yeah, fuck that baby. I’m not lifting a finger to help some crying little shit. If I see some little brat getting snuffed, I ain’t saying shit, I ain’t callin’ no 911, I ain’t goin’ for no help, *absolutely nothing,* that little shit can save itself 🔥💯 \n\nI bear *zero* responsibility watching that little shit die", "So your argument is that the mom is afraid Grandma is going to call her a slur?\n\nBro, you were just wrong, relax not everything is Jr debate club.", "This is such a weird point for you to be arguing lol", "I already said the passive person would bear some responsibility further up this comment chain lol. But there is a objective difference between being fully responsible for a bad thing and being partially responsible for a bad thing.", "Why do you think someone so brazenly racist wouldn’t call some POC a slur, especially if they are vocally against that specific POC being in a relationship with a member of their own family?", "Your argument was that someone might not stop the murder of a baby for fear of being hurt.\n\nThe father should tell the mother to behave herself or GTFO.\n\nFear of being called a slur isn't an issue for him.", "That was a hypothetical scenario someone else came up with that i just went along with to prove my point.\n\nIn the context of situation in this post, I would be afraid if granny calling the girlfriend a slur if OP were to invite the girlfriend over for dinner at the house. That sounds like a reasonably possible outcome. \n\nI think OP should just take everyone out to eat at a restaurant or something while leaving Granny alone in the house by herself.", "it is a hypothetical about this situation.  \n\nImagine this granny was trying to murder a baby.  Clearly no threat to OP.  Should he watch?\n\nOutside that, OP is banning his son's girlfriend from her house because he is black.\n\nThat's just racist before you even get to anything about allowing a bad act", "It isn’t a hypothetical about this situation lol, no one is murdering any babies in this scenario. If anything, OP is keeping the baby (the girlfriend) away from the murderer (granny) so that no murder can take place. \n\nOP isn’t banning anyone, he had the girlfriend over for dinner before. He just doesn’t want to put her in a bad situation by having her and his mother in the same place.", "Come on \nIn today’s world 70 is not old !!!! \nI’m sure she can do a lot for herself \nI’m coming on 60, the way your thinking, I may as well pack it in! \nJHC people, 70 is not old !!!!!", "Unfortunately your mother comes from a different time and can’t change her mind im sure. Your being protective of the gf so she is not uncomfortable as well as your family as I’m sure you don’t want her saying your all racist if the gramma slips and says something to her.  It’s hard to say because of that I don’t  think YTA I think your stuck in a really shit situation between people you love dearly.", "My favourite thing about racists is how they'll bend over backwards and jump hoops to explain how they aren't racist instead of doing the simple thing and not be racist to begin with. The amount of effort you're putting into excusing racism is way more effort than telling your mother to make tracks and shut the hell up if she's that vulnerable. \n\nYTA Op, and a raging racist. You think racist behaviour is easier to accept than being a good person. Your mother is a bad person.", "YTA. Racism won't die because \"good\" people like you are cowards.", "I was going to say N T A bc I thought you were protecting the gf but in the end you were really protecting your mother, so YTA. If I were you I would tell my son to wait to protect his girlfriend from dealing with your mother. \n\nShe probably has no place to stay at the moment. Unless she is living with you permanently, then you should have a looobg conversation with her\n\nGood luck", "Going against the flow here, but ESH\n\nYour mother is an AH for being a racist\n\nYou are an AH for tackling this issue rather poorly. I mean you know very well how she, so inviting your son's girlfriend, then disinvite her at the last minute is just plain rude. Your overall attitude about this is rather wishy-washy.\n\nYour son is an AH for being a lousy hypocrite because nothing screams \"I'm the epitome of moral righteousness\" by kicking your own 70Y physically-ill grandma to the curb because she is a racist.\n\nYes, the grandma shouldn't be a racist and the girlfriend shouldn't be barred from the house for this and the OP shouldn't be so passive about it, but situations like this are often far more complicated in practice than people actually think. It seems very likely that if the grandma, the grandson and the girlfriend end up in the same room, shit is going to hit the fan. So, in short term avoiding this to happen is just rational. That said, if this relationship is serious, in the long term the OP should very well realize that he needs to tackle this issue at one point.\n\nThough, you can't really blame him for not wanting to have his mother's condition worsen just so that his son could get laid as I sincerely wonder how much effort the son put into trying to sensibilise his grandmother about prejudice and racism prior to him dating someone of color.", "Little mommas boy afwaid to be a man and tell his mommy dearest off for her racist bullshit. \n\nYou are an adult. She is living in YOUR house. Tell her to STFU or can can find her own way of living, but if she wants to stay in your house, she WILL follow your rules. You are the adult in charge now - take charge.\n\nEdit for judgment: DUH OP, YTA", "Honestly you’re NTA because you clearly care about your family.  You just don’t know what to do about it. So this is where you need to put your mom in a nursing home and be racist there.  \nFix the issue", "NTA\n\nThis is not the first such post on this sub.  Parent asks teen not to bring black partner over to protect the kids from racist grandparent.  Teen is scandalized and calls parent racist.  \n\n&#x200B;\n\nIn a perfect world, you might take a stand against grandma and tell her to knock off the racism.  But you and I know that's probably impossible.  Even if she agrees in principle she will not be able to contain herself when confronted with a black person in a prolonged social setting.", "YTA \n\nLetting your mother decide makes you somewhat racist, time to tell the lady this is your house and you and your wife is in charge, if she does not like it she can get out, stop being a mommy’s boy\n\nRemember the one who does not speak up agrees, so time to right this wrong", "YTA,\n\nyour son is right, and so is your wife. \n\nI feel for your son's GF, put herself in your shoes and imagine what kind of message you are sending. \n\nYou're allowing racism and people being hurt by it just because your mom is fragile? There is such a thing a consequences of actions. If your mothers want to receive your help, she should learn go keep her mouth shut or she has to take care of her own.", "YTA and also, let me be incredibly clear about this statement that is going to sound heartless (as a man your age with children your age):  \n\nYour mother will be gone soon.  Might not be this month, but soon. Your son will be here a looooooooooong time. And if this girl is the one, she’ll be here a long time too. Choose your sides wisely because they’ll remember dad being racist, not dad trying to “not start trouble” with grandma Marge Schott when she got that new hip.", "YTA. you're enabeling a racist", "YTA- I get why you want to help your mom, despite her being a racist and acting that way, but seriously you are taking this WAY TO FAR.  \n\nBut now everyone is saying I am aiding one by taking my mothers side. So AITA?\n\nI don't understand how you can be this confused?  A racist is making a racist demand, one that hurts YOUR CHILD, you are complacently giving into the RACIST DEMAND, and thus aiding a racist.  \n\nYou yourself might not be a racist, however when you act in a manor according to how a racist dictates, then I fail to see a practical difference.  If there is one OP please explain it.", "YTA for not standing up to your mother (70 is not that old btw) but also for not standing up for your son and his girlfriend.", "YTA - Mom needs to be straightened out. *Your house, your rules.* She can behave or get out if public spaces in the house and eat later by herself. There's also assisted living. You owe her nothing.", "YTA come on OP you can do better. Your mom is not the one in charge anymore, you are. You can tell her to keep her racism for herself or go elsewhere when the kid is there. You don't even have to kick her out if you can't bring yourself to that, just keep her from expressing her racism and show support to your son's girlfriend.", "YTA. You know the ones who get angriest about being called a racist are in fact racists. You need to take a deep hard look at why you would allow that crap in your home", "YTA. Grandma needs to be put in her place. If she she can’t be civil to guests in YOUR home or refrain from comments about your son’s relationship then she can live elsewhere.", "I remember this quote from another Aita thread. \n\n“If you have 9 people and 1 Nazi at dinner, you have 10 Nazis”. \n\nYour son is absolutely right. Your son and his partner are the future. Think on that. \n\nYTA\n\nEdit : having seen OP’s other removed posts, OP can remove the quote marks around the word racist. You are a racist.", "YTA and you need to immediately apologise to your son, explain how your weakness stopped you from standing up to your mother, thank him and your wife for showing you what the right thing to do is, and tell your mother that if she acts up in any way then she's on her own. How dare you let her continue to control you in this regard?!?\n\n\"He says I should of told her to leave the moment my mother said all that stuff\" Tell your son how proud you are of him for having/sticking to his principles, and explain how humbled you are by his behavior.", "YTA, your mom too. She likely had care during or post surgery from people she considers beneath her as well. I’d kick my mother out of the house for this if she was on her deathbed.", "YTA. I can't believe you didn't work it out as you were typing that long ass essay lol. Starting off by complimenting your son's girlfriend and saying how beautiful and amazing she is, gives off \"I'm not racist but...\" vibes.", "Yeah, YTA, and I think you know it. Welcome the girl, and demand your mother keep a civil tongue in her head.", "YTA and while you may be complacent, in this case that’s not the right word. Here you are being complicit in racism, what you are doing and allowing is morally wrong no matter what excuses you give.", "YTA, your son is right. If she can't be around your son's gf then your mother needs to stay away, not the other way around. She needs something from you, so you get to set get rules.", "YTA. Your mother is a filthy racist and you're protecting her. Good luck destroying your relationship with your son forever.", "YTA. You chose the racist narc over the kind loving girlfriend. Have a long hard thing about who you actually want around you for the only life you have.", "Stuff granny in a bdrm and take the kids out for dinner. This is a pivotal moment in your child's life and what you do here will be a core memory forever. Choose wisely.", "YTA your wife hates your mother and I'm pretty sure son is feeling the same. \n\nInfo: Why do you feel it's OK for everyone else (maybe you also) to endure her stay? Have you researched alternatives seriously?\n\nEdit: OP has posted a year ago about his son", "She’s 70 not 115 ? Why is she so racist lol ? YTA for standing up to her and not protecting your sons GF !\nI literally can’t stand anyone who’s racist it makes me sick ! Tell your mother to get over it that she’s not the only person in the world", "YTA. You say you aren't racist, prove it. If you believe your Mums hopeless to change, ok don't bother trying to convince her otherwise BUT do not allow her to dictate to you how and who you love, like or socialise with (in your own damn home).\n\nYour son is watching you. Watching you bend to a racist, manipulative, mean woman. He sees you standing idly and he sure as heck has noticed that you don't have his back. \n\nTell your Ma that you will not tolerate the racist conversation and comments and when she, inevitably starts up again, leave her talking to the air every single time.\n\nInvite your son's GF for dinner and if Mama has a problem with it tell her to stay in her room for the evening, you'll serve her dinner in bed. Don't give her the option to behave and join, she'll fuck it up for sure.", "\"...But now everyone is saying I am aiding one by taking my mothers side.\" \nYep, you are. Just because your mother is elderly and unable to look after herself is no excuse. Racism is racism. Period. It's never acceptable. YTA.", "YTA so you listened to a racist 2 hour rant which presumably you could have walked away from and his girlfriend can't come over because it would make your mommy uncomfortable. Which part of that was you not enabling and contributing to her behavior?", "have you ever heard the phrase, \"silence is violence?\"\n\nYTA.", "I don't care how old and set in their ways someone is, you are never too old to learn and change and you're certainly never too old to be put in your place.. Your mother is \"going on 70\" so is late 60s, that's not even old! \n\nYTA for not calling out her behaviour and instead punishing your son and his girlfriend for her abhorrent behaviour. You are telling your son that you choose bigotry over him and the girl he loves. Honestly this is something your relationship may never recover from.", "YTA. You are at the least proxy-racist. If you say you aren’t racist at all: prove it! Stand up for the girlfriend, tell your mother off and do the right thing. Who do really want at the dinner table?", "YTA.\nBy being compliant to your mother's racism, you are -in fact and in spite of any arguments you may make- racist. That's on you.\n\nYour son is right.\nYour wife is right.\nThere is no defense for your actions.\n\nAnd the saying that comes to mind so loudly when I read this post is:\n\n\"There's no fool like an old fool\".\n\nYou've sacrificed the relationship with your son, and your familial reputation, for an old lady who hasn't figured out her manners and common decency. \n\nVery, very foolish.", "YTA. Everyone says you’re taking your mom’s side and are complacent because you are. Being old is not an excuse to be bigoted. The fact your mom is dependent on you is not the reason you need to take her side but the reason she should realize she needs to suck it up or she’ll be on her own.", "YTA - your mother being \"old and feeble\" does not mean she gets a free racist asshole pass. Your son is right. You are enabling her behavior and making your son feel uncomfortable *in his own home* and therefore just as bad as your horrible mother.", "YTA\n\nTell your racist mom to stfu and keep her bigoted opinions to herself. \n\n\nSiding with a racist makes you a racist. \n\nIf she can’t keep her racist mouth shut, tell her to stay in her room while your son’s gf (who is going to break up with him soon because of you) is over for dinner.", "Wait so people in this thread rather the son's girlfriend get racially abused by this old woman instead?  \n  \nI don't agree with the grandma's view at all but why cause so much upset by willingly letting someone be abused?  \n  \n  \nGo out with the kid and his GF instead?  \n  \nWhen grandma recovers kick her out,be done with her and then explain the situation.  \n  \nShe will never change her view regardless of what happens. Anyone with half a brain would understand. Unlike most people here.... ESH", "We recently moved states. We went from a very multicultural area to a rural area (absolutely stunning, postcard beautiful) We did know it wouldn't be as diverse as we were used to, we're not stupid we did research and it's country, my youngest kids 10 & 12 commented on it within a few days of starting school.\nMy (then)12 yo daughter is extremely introverted. She started high school in our previous state but her time was cut short due to floods and we made the decision to relocate (very happy). \nLong story short, her first day at her new high school (not knowing a single person) a fight broke out between senior students, the N word was used. \nHer \"buddy\" was filling her in on the details and when she said the N word DD said \"we can't say that word\". Unfortunately this was not appreciated by her \"buddy\" and this horrible little person went out of their way to make DD's life horrible. DD is starting a new school this year (fingers crossed) it's a small school and a little alternative but we're super hopeful she finds her people.\nMoral of the story, it's not always easy or convenient to do the right thing but even a child knows YTA.", "Yta x10 You sat there for a 2 hour rant? She’s racist end of, but If she’s so reliant on you, don’t give her a choice. You’re helping her, she’s not the boss. \n\nShe’s coming over, you may not like it, but this is my house, she has no interest in being near you and I’ll take your dinner into your room. \n\nI hate this attitude that ‘because they’re family’ I can’t have an opinion. \n\nIf you knew she was racist why did you rile her up showing her a photo of her. I’d be embarrassed if you were my husband. Enabling a racist over accommodating your son. At least he knows where he is on the pecking order.", "I’m going to go against the grain here… but my question is, how does your son’s girlfriend feel about being invited over right now, knowing that his grandmother is there? \n\nListen, I’m a perfect world OP should be kicking his mother out on the street and the girlfriend should come over and everybody lives happily ever after while the racist grandma stews in hatred. But that is truly not how this works.\n\nThe best thing OP can do, is tell his mother to cut it out. But unless there’s somewhere else that she can go, I don’t think kicking her out is the best option unless he’s prepared to put her into a nursing home. Otherwise he should not be making those threats unless he’s completely compared to go nuclear.\n\nSecondly, YES grandma needs to cut it out! But that is an awful lot to ask of OP over a high school girlfriend. Again, she shouldn’t be like this anyway. But how much longer is this relationship going to last?? The truth is, by kicking his mother out, OP won’t teach her any lessons. It’ll just embolden her even more. And unless this girl is someone that OP’s son is intending on marrying (soon) this is not a hill worth dying on, YET! \n\nAlso, back to the girlfriend. How does she feel about this?? She may not want to be invited over at this time and it’s important to consider her stance on this. Son and wife have the right attitude of racism shouldn’t he tolerated but (hate to have to add in the fact that I’m black for validation but here it is…) sometimes black people literally would just rather choose not to exist around racists lol. \n\nEdit to say: racist grandma is definitely an asshole but I can’t blame OP or the son.", "YTA and a racist. If you allow a racist person into your home, allow them to act racist toward others, and you allow it to continue, you are most certainly racist. Your mom is the type of racist that easy to point out and call out. You are the type that flies under the radar but you are still an AH and racist. The sooner you own up to it, the sooner you can make amends and address the racism you adopted from your mom.", "YTA and sounds like mom needs to go to assisted living or needs home health. How dare you support someone you yourself said is a racist. And if she's a diagnosed narcissist I bet she's not as helpless as she acts.", "YTA. You're enabling her racism which makes you a racist. Your son and his girlfriend deserve better", "Any time that you don’t confront and call out racism when it’s happening right in front of you, you are implicitly supporting racism. You could tell your mother “I’m sorry you don’t like it but my son’s girlfriend has every right to come to this house. We don’t support racism here. But if you don’t like it mom feel free to stay quietly in your room while she’s over.” And you also need to tell her that as long as she’s in your home she needs to keep her racist views to herself. If you don’t then YTA.", "No one thinks they’re racist but yes you are. By siding with your mother you’re basically telling your son and his gf that you agree with your mother. \n\nWhat will happen to your mother if the gf comes? It will “disturb” her? Do you not care that you’re “disturbing” both your son and his gf by asking her not to come?\n\nYTA", "My elderly aunt moved back to England from South Africa with some horrible views. At first we challenged her and when she became more frail we simply got up and walked out on her whenever she started. She stopped expressing those vile opinions after a while but I’ve no doubt she hadn’t changed. The trouble is she needed us so we couldn’t just drop her completely.", "“All that is required for evil to triumph is for good people to remain silent”\n\n“If you lay down with dogs, you’ll wake up with fleas”\n\nYou are enabling a racist. You are housing a racist. You are excluding a person of colour because a racist demands it. \n\nYou can’t let your elderly mother fend for herself. That’s admirable. But you CAN continue to invite your son’s girlfriend over and vociferously counter your mother’s comments.  \n\nIf you won’t take an active stance against racism, you are taking the side of the racists. There is no neutral ground. \n\nYTA", "Your son is a more adjusted human being than you are, pay attention to him, you could learn a lot. YTA", "Not only an ah, but a idiot", "YTA. \nYou are enabling her racism. Let the gf come over and make it clear to your mother that racist comments of any kind will not be tolerated in your house.", "The comment about your wife is so ignorant. Why should should she like a racist? Btw is your wife in general only right when she agrees with you? Have you ever shut your mother down, threaten to throw her out or anything? When your mother is so terribly frail why don't you put her to another room during dinner and tell her she can join when she get her shit together? Why don't you do nothing to stop her racist shitshow and think you're anyhow justified? There are a million ways to (at least try and) shut this down without kicking her out, but uh oh someone actually needs to be not racist to want to do that. YTA and racist", "Yes OP, YTA\n\nMaybe it's time that your mother recovers somewhere else. Stop putting her above your son and enabling her racist behaviour", "YTA big time! Stop showing deference to your racist mother. Just because someone is old doesn’t mean they can just get what they want and you have to obey their demands.", "Yta", "NTA going against the grain but you're put in a tough situation it's hard to throw your mother out if she really can't take care of herself and it's clear talking to her won't change her views it's very unfortunate for your son but also a very shit situation for you to be in", "YTA - Sorry OP, I understand that some people never went through the teenage phase of rebelling against their mom, but now is the time to do it. She isn't 90, she is 70, largely young enough to still educate herself.\n\nHere is what you should say to her : \"I'm sorry mum, but you are being very racist and I don't like it. Your grandkid loves this young lady and I have met her, she is indeed a perl to be around. Now, I am inviting her to dinner next Sunday. You are welcome to join us, or go to bed early if you would prefer. If you gave her a chance, I am sure you would realize how lovely she is. Also, if you do come, I want you on your best behaviour because I will not tolerate any insulting comment. Lastly, if you choose to stay in your room, know that you will deeply hurt your grandson, so think carefully about what is important to you.\"", "It's like that saying, \" if you've got a Nazi at a table and 10 people are sitting with him, you've got 11 Nazis.\"  You could tell your mom to keep her hateful thoughts to herself or leave, but you'd rather just keep the racist happy. So yes, you're racist. And YTA.", "YTA. Ugh", "YTA. Your son is right. You are being complacent and protecting the racist. There’s no other way to look at this. \n\nBeing elderly isn’t a justification for being an ass. Tell your mother to keep her mouth shut and if she can’t do that, rehab facilities exist. If she wants a place to stay, then she’ll shut up. Stop coddling the racist.", "YTA. You are complicit in her racism by allowing your mother to dictate who is permitted in YOUR home. Send your mother to her room if she's going to be a raging racist. You need to make it clear that you won't tolerate her bigotry. If you value your relationship with your son, stand up to your mother. It's not her house, not her rules. If this young woman is as lovely as you say, she may be around for a while. You're going to have to deal with this.", "OP: You can choose, what do you want, a son who loves and respect you, or a son who decides to no longer talk to you because you coddle a racist B?  \nThat's about it.   \n\n\nYTA. I'm sorry. Your protecting something disgusting because you fear her. Grow a pair.", "YTA it’s time to tell mom to shit the hell up and keep her forked tongue behind her teeth.", "YTA. Are you preventing them from crossing paths to protect the girlfriend or your mother?\n\nWarn the girl that racist grandma will be in the house and she can make her own choice, and warn grandma that she can huff a duff and nobody cares what she thinks.", "Yes, your mother is racist. That's horrible. What she said is unexcusable. But she is your mother, she's old and she doesn't have anyone else that can help her. I understand your viewpoint and you letting her stay doesn't make you an AH.\n\nPerhaps your son should go over to his gf's house, not invite her over when she will only be in a hostile environment.", "YTA, if anyone should be banned from the house, it's the racist mother.", "YTA but I don’t think his girlfriend should come over while your mother is staying. IMO,  if you can’t ensure your mother won’t say anything it’s not fair to invite a teenage POC to face up with a racist/family racism", "YTA. If someone takes you in after surgery and takes care of you the least you can do is keep your mouth shut. Alighieri wrote: \"The darkest places in hell are reserved for those who mantain their neutrality in times of moral crisis.\"", "YTA. There's no valid excuse for bigotry and racism, and there's absolutely no excuse for siding with horrible racists either. The message you're sending to your son and his girlfriend is that racism is totally a-okay if dealing with it inconveniences you. Shame on you!", "YTA\n\nImagine your son and his GF have kids one day. Are you going to not allow them over, either?", "YTA.\n\n Your mother is 69, not 100. That is in no way too old to learn how to hold her tongue and keep to her self. If she cant, kick her out. This is not hard. You are enabling her to be an awful human being, and you have made your household into a racist one. Congrats.\n\nAlso, your wife is siding with her son BECAUSE YOU ARE WRONG, OP. And maybe also because your mother is awful as you’ve clearly shown in your post.\n\nAnd your son would be right to never forgive you for this.", "YTA.\n\nI'd call you \"racist by proxy\" - you, whether you want to admit it or not, support your racist mother in her racism. You enable her. You should instead tell your mother that your son has a lovely girlfriend whom you *will* invite into *your* home. Then put her in a different room where she can't be \"disturbed\" and to spare your son's gf of her rage.", "My parents were told you can’t bring your racists views around our children. You may not share your views, opinions, or comments. If you do, we will go nc. Your mother can go home and hire a health aid or figure it out. You owe the support to your son Also as an older person, 70 is not really elderly.", "Grandma needs to have her dinner in her bedroom if she absolutely can’t leave yet. Your son’s girlfriend has not done a single thing wrong, but your mother has. Your mom is the one who gets the shaft, not her. You definitely are being complacent, and it doesn’t look great. Don’t ruin your relationship with son’s girlfriend.", "YTA\n\nQUESTION: Who will be more important to you in the next 30 years, Grandma, or Son and grand children?  \nTHE ANSWER: Is who's side you take in this argument.\n\nConsider :\n\nSon and Girlfriend come over, Grandma is also there.\n\nGrandma goes on her rant about bloodlines, how it disturbs her, and how it doesn't look right.  \nYou tell your mum that her attitude is not okay.  \nSon and Girlfriend get offended (understandably) stand up to Grandma and a larger scene ensues resulting in Domestic Violence.", "Tough spot but at some point change doesn’t happen unless you call out the people on these types of comments, beliefs and have a conversation on why things have and need to change.  \n\nYTA", "You're allowing your mother to dictate what happens in your own house and family.  Here's a couple of suggestions.  Tell her that you will whichever visitors you choose, and that if she isn't able to hold her racist tongue, she'll be confined to her room during the visit. Or she can go out for the duration. If this means she has to hire a carer who can rake her out, or a taxi, or she makes arrangements with another family member, that's what has to happen.  Tell her that her refusal to pick one of those options will lead you to seek residential care for her, because you refuse to allow her to rule your house or display racism there. \n\nPlease don't allow her to be present during the girlfriend's visits, trusting that she'll keep her mouth closed. She won't, and you'd be putting the girlfriend in a horrible situation.", "Well . It’s not about being an AH or not . How about inviting the gf to your house and explaining to your mom that she needs to either stay in her room or keep quiet at the dinner table . No one is asking you to throw your aged mother out of the house and everyone knows it’s almost impossible to change the kind of an elderly person . BUT you need to make sure your house is friendly and accessible to other members of the family . You can’t shut family and their friends out because your mother is a racist . Learn to work around it .", "Op gently YTA I get what it feels like to feel indebted to bad family, I 100% do. But you have to realize everyone who dislikes your mother does so for really good reasons. In fact most of your post is you listing great reasons not to like her. I think it’s a little silly of you to disregard your wife’s opinion when you yourself describe her as a fairly awful person. You should step in to stop your mother, or sit down with your wife and son without your mom present and explain that while you disagree with her vehemently, there’s nobody else to take care of her and she’s an elderly sick woman. Offer to fund alternative dates, go on outings with him and his gf out of the house, but you can’t change your mother. Your call, just know that fighting her openly is the option that will endear you most the those you love.", "I'm not a parent but I am a bit older than you. I think your job is both to be a model for your son and help him succeed in the world.\n\nWhat kind of message does it send that you're willing to let your mom scorn your son? What kind of message does it send that you're willing to let her dictate who your son loves?\n\nYou're enabling your racist, narc mom and letting her run roughshod over your life. Make no mistake, if you don't take action then you'll end up with an alienated son and you'll wonder why he doesn't come around much when he's an adult.\n\nIf she can't respect you and your family then she either needs to keep her trap shut or leave and keep her trap shut.\n\nYTA but I know you're in a shit family dynamic so I can sympathize.", "I think by all means do what you want to do, prioritise your mother before your son and his girlfriend, that's your prerogative and I understand the relationship you have with your mother. Buy don't come running back when your son doesn't answer your calls. When you're not invited to the wedding, when your daughter in law ignores you on the street, when you find out two months too late via social media that you're a grandfather. You're giving up a lot for a woman who'll be pining for the fjords in like fifteen minutes. Have fun explaining to the staff at the care home why there's nobody left to look after you. Why your son doesn't visit. I hope for the sake of your own peace that when it's your time you'll still feel it was worth it to choose a racist old crone instead of your loving family. Also YTA.", "YTA, and so's your mum...being old doesn't excuse her being a racist. If she wants to behave that way she can do so alone in her own home. Doesn't make it right, but at least no one has to listen to it.\n\nYou need to stand up to her, tell her that that behaviour is not ok. If it's going to be a problem for HER, then SHE should not be at your house. She's causing the problem, don't punish the innocent girlfriend because your mum can't behave like a decent human.", "YTA - I get that you are trying to “keep the peace” and you think that you are protecting your son’s girlfriend but you are siding with the racist. You are condoning and supporting racism. “She’s old”, “She’s from a different time” etc. These are bullshit excuses. \n\nRacism is racism. Doesn’t matter what year the person was born. They are responsible for their beliefs and the things they say and do. She’s 70, born in 1952. That’s not even that long ago. Stop making excuses for her. Hold her accountable. If you really aren’t racist then stand up to your racism mom. \n\nApologize to and stand up for your son’s girlfriend. Do the right thing. Tell your mom that that that kind of talk is unacceptable and if she says something in front off his girl you will embarrass her and there will be consequences. Maybe you don’t have to go right to kicking her out. Ban her from family dinner, she eats in her room if she can’t act right around people. \n\nTell her that being kicked out is on the table. She can be put in a home. Whatever you do stop putting up with it/protecting her. You are on the wrong side of this thing.", "YTA grandma can definitely stay in her room while your son’s girlfriend comes over if she is that bothered and can’t be polite at the very least. \n\nYour mum is basically a white supremacist if she is going on about bloodlines, this is some really serious racism not an elderly person using out of date language or something which would be embarrassing but not deliberately malicious. There are plenty of people her age who are not racists and also use up to date language btw.\n\nApologise to your son’s girlfriend and explain that you don’t want to subject her to your mothers horrible racist outbursts and rants and have been confused about what to do without having the girlfriend suffer abuse in your home and say that you have seriously considered kicking your mother out you feel so strongly about her behaviour and attitude but you feel you have an obligation to care for her after her surgery. You could speak to the girlfriends parents too so they understand your reluctance to have her round recently is due to wanting to protect their daughter from your mother’s behaviour and that you have made efforts but been unable to change grandmas attitude.\n\nGrandma needs to go as soon as she is well enough for home help to cover her needs, be clear with her that this is how things are and she is going purely because of her behaviour. No negotiation no exceptions unless she can make nice and behave 100%.\n\nDevelop a plan for if your mother comes in and starts a rant when the girlfriend is present (if girlfriend is comfortable with being in your home) like everyone ignores grandma/turns their backs/leaves the room etc so you are a united front. Your son and his girlfriend should not be punished for your mothers racism by being excluded.\n\nIf racism is a hate crime where you live you could tell her you will record the incident and call the police if she dares to be racist directly to your son’s girlfriend. You can testify to a judge how she behaves and the government can deal with her care in prison.\n\nShow her you mean business and she is the issue not anyone else.", "YTA. She goes on two hour racist rants and you just LET her spout that nonsense in your own house? Tell her you don't want to hear one more word out of her and if she opens her mouth you will put her in her room like a misbehaving toddler. Speaking of her room, that's where she is to stay whenever your sons girlfriend comes over. You don't ban the girlfriend, you ban the mother. Your house, your rules.", "YTA and it’s complicit, not complacent. Lock granny in a room and enjoy dinner.", "> But he argues that I am being “a complacent racist” by even allowing her to be here.\n\nYou...are.\n\n&#x200B;\n\n>He says I should of told her to leave the moment my mother said all that stuff.\n\nYes.\n\n&#x200B;\n\n>But my mother is an elderly woman who can hardly make it on her own as it is.\n\nThen maybe she should watch her words.\n\n&#x200B;\n\n> Though I don’t agree with her I can just leave her to fend for herself. \n\nYes, you can.\n\n&#x200B;\n\n>I literally do not know what to do.\n\nYes, you do, you just not have the courage to do so.\n\n&#x200B;\n\n>My wife says my son is right about me being complacent but of course she’d agree because her and my mother don’t get along well.\n\nShe agrees with your son because your son is right.\n\n&#x200B;\n\n>I know I am not a damned racist.\n\nYou're a coward. Your mother is trying to impose her racism, and you're allowing her.\n\n&#x200B;\n\n**\"She's family, she's welcome, and everyone in this house will do their best to make her comfortable. That includes you, mom, if you want to stay in this house.\"**", "The Grandma is an Asshole of the highest order and you get a YTA for not putting your foot down and doing what you thought was morally correct.", "YTA. Your wife and son are right.", "Yta", "YTA. \n\nYour Mom is 70, not 97. Tell her to shut-up and stay in her guest room (because she is a guest in your house) or drop her off at an assisted living apartment. I get she's your mom but she'll likely not be here in another 20-30 years but your son will. This, right now, will affect your relationship with your son for the rest of your life.", "Absolutely YTA!\nIf your mother is still alive, that means she still has things to learn as a human being and try to improve herself.\n\nSo sad you're enabling your mother to keep being racist in your own house, where she should respect everyone who lives there. If she is not happy with that, she can go somewhere else. \n\nAs we say in Germany, \"if there's a Nazi at the table and 10 other people sitting there talking to him, you got a table with 11 Nazis.\" subconsciously you are supporting your mother, so you should take the \"\" from the title.", "YTA Tell your mother to stfu about her rasist crap or she can find someone else to take care of her.", "YTA and definitely a complacent racist. You're allowing your mother to dictate these things when you absolutely should have kicked her out like your son said.\n\nIt's simple: there should be no tolerance for racists, mother or not. There's no excuse for punishing your son's girlfriend like this. Unless maybe YOU'RE using your mother's racism as the cover for your own and all the praise you had for this young lady was bullshit?", "YTA \n\nI understand that you want to care for your mother but there’s no excuse for being racist, not even being old. \nI’m fed up with the idea that old people cannot change, it’s not that they cannot it’s that they don’t want to. « Too old to change » is the lazy way out of many situation and is not alright. \n\nTell your mom that she have to start respecting the girlfriend or she can fend for herself. She is in your house so she has to respect you guest and your rules. \n\nTolerating racism make you a bad person", "YTA. You really need to OWN UP what you're doing and STAND UP to your mother.\n\nI get she's your mum and you love her. That doesn't mean you just let her act like that.As others have said you should have stopped that rant as soon as it started and your sons girlfriend should be coming over and your mum eating alone in her room if she can't keep those sort of views to herself.", "So your mother is, by your own account: \"a classic racist and... a raging narcissist\". Your wife doesn't get along with her and your son has pointed out the issues in you siding with your mother regarding his gf.\n\nSo tell me, why exactly is she staying at your house? She does't sound like a pleasant woman to be around at the best of times, but now you've decided to make your entire family endure her narcissistic ways and racist comments out of, what? I don't get the feeling from this post that you love your mother all that much. Maybe you secretly agree with her views? Or maybe she has you so well trained to accept her BS that you don't even question it anymore?\n\nEither way, your son's gf deserves an apology for how you have treated her, and you need to think long and hard about who it is you want to be in life. Because as it stands, you are being racist by allowing your mother to spew her vile rhetoric all over a poor girl who has done nothing other than exist. Age and infirmity are no excuses for being an awful human being and never will be. Check yourself, OP.\n\nYTA", "Yta for being complicit in her racism and enabling it. Don't be surprised if your son goes no contact with you", "YTA by not stopping your mother you are saying this okay when it's not.", "YTA. \nA house where racists aren't being called out and told to stfu or get the hell out is a house full of racists.  \nYou are not throwing your mum out, you are giving her an ultimatum,  stfu and behave or suffer the consequences.  Then it is her choice to struggle if she can't keep her mouth shut.  \nYou are spitting in the face of your son's girlfriend and on the way to losing your son.  Speak up to mummy now like the grown-up you are. Or you are just a bad as she is.", "YTA - what you do is make her stay in her room \n\nI get she is your mother and old n Hr she is also a racist, a bigot\n\nYou are going to destroy whatever relationship you have with this girl, and possibly your son\n\nYou do not enable bigots, you do not enable racists\n\nIf she wants to act like this then she can stay in her room until she can act right, to she can mature and be respectful \n\nThe more you give into her the worse she will get \n\nAnd of course your wife agreed with your son, because any reasonable person, even I, who have no previous issue with your mother agree with your son and wife\n\nAnd of course she has issues with your mother, your mother is a narcissistic racist \n\nAny reasonable person would have a problem with her \n\nTell me, is it worth the relationship you have with this girl? Is it worth the relationship  you have with your son?\n\nYou can say your not an” damned racist” all you want buddy, but here you sit, refusing to let a black girl in your house to appease a racist…you gotta see how it looks from the outside", "Yep OP, YTA. Give your mother the message. If you can't be nice to the sons GF you can just stay in your room while she is here. Follow up on it. By allowing your mother to treat sons GF like this make you complicit, a racist by default. Do better OP or lose the respect of your son and wife...actually I think you already have.", "YTA. Partially for your actions, partially for your reasoning. \n\nIf you had uninvited his girlfriend in order to protect *her* from your mothers comments, whilst you made arrangements for your mother to stay elsewhere, that would be reasonable.\n\nHowever, uninviting his girlfriend to protect your racist mother from feeling uncomfortable, is racist. By catering to a racist, you are feeding directly into racism, and being a racist person yourself. \n\nI understand she had surgery and requires support, however behaviour like that shouldn’t be tolerated in any household, regardless of how elderly or dependent on you she is. You should send her home and arrange care for her. Oh, and apologise to the girlfriend whilst you’re at it.", "YTA. I get that this hurts your feelings, because you clearly like your son’s girlfriend and want to be a good, non-racist person, but from one white stranger to another: if you’re prioritizing a racist’s comfort over the feelings of a person of colour, you are being complacent with and supporting a racist and that is in itself racist behaviour.\n\nI get that it can be difficult to stand up to your mother when she’s feeble and needs help, but like you said yourself: she’s a narcissist and a racist - she’s not a good person. And as much as you may not want to kick your mother out, you do need to set very clear boundaries with her regarding her racism. You need to tell her that you will not tolerate her badmouthing your son’s girlfriend. You need to tell her that if she is disturbed by being around a person of colour, that’s her problem and you expect her to find a way of dealing with it that does not inconvenience anyone else. You need to tell her that your son’s gf is going to come over, and that she can either behave civilly to her or stay in her room, or suffer the consequences - and then you have to actually follow through by either putting her into a home, setting her up with an at-home-healthcare service or shipping her off to other relatives.\n\nRacist people and their racism thrive on feeling like what they do has no consequences. They don’t care about the feelings and discomfort of people of color - that only fuels them. The only thing that truly gets to them is if they suffer consequences at the hands of other white people because they expect us to secretly agree with them and if we don’t and punish them for their racism instead, it shocks them. That’s why it’s so important that people like you don’t let them get away by being complacent.", "YTA your wife agreeing with your son has nothing to do with her and your mother’s relationship (or maybe it does and your wife just doesn’t like a racist asshole, either way it’s warranted) and everything to do with the fact that your son is correct. you’re only housing and enabling a blatant racist and completely disrespecting your son’s gf and their relationship.", "YTA\n\nIf your mother needs you so much then she needs to respect the rules of your home and keep her racist nonsense and hateful words to herself or she can make other arrangements.  You say she's always behaved terribly yet you've brought her in and allowed her to take over because you're too afraid of her to stand up for your family.  The fact that you brought her in to her home knowing she is a racist and narcissist rather than find some other option is not okay.  You have forced your wife and child to live with someone you know is abusive. Even worse that you know how she is then act like your wife is somehow wrongly biased against her and that your son should allow racist treatment of his girlfriend because THE RACIST might get upset.  You are the one that has been trained by your mother to pacify her rather than stand up to her and you need to break that training.  Not insist that other people submit to it like you do.", "YTA. If you didn't want your mother all worked up, why did you show her a picture of your son's girlfriend? How long is your mother going to stay? \n\nYour son is 17. He will soon leave your house. And what if he wants to marry his girlfriend? And your mother is still alive? Or if he has children with a Black woman? Do you really think he will let you have a close relationship with the children after you decided to put a racist person first? \"Because that's who she is, and she is old?\"\n\nYou are setting the tone on your future relationship with your kid. And it doesn't look good.", "Your mother is living under your roof so you can and must put some boundaries, also she's 70 not a 100 she can behave if you made clear to her that any racist behaviour or comments aren't allowed in your house and if she isn't ok with that she has to leave, because a) you don't want racism in your house and b) because your son and his confort comes before her. Your son and your wife are right your enabling the old hag, YTA and so is your witch of a mother.", "This is easy. YTA. Your son is right. You are a complacent racist.", " “I literally do not know what to do.”\n\nSome options: \n\n1.  Invite the girlfriend over, warning your mother you won’t tolerate any racism. If she says anything, actively confront and correct her over every statement.\n\n2.  Invite the girlfriend over, warning your mother you won’t tolerate any racism. If she makes any comments, have her go to her room. \n\n3.  Invite the girlfriend over, warning your mother you won’t tolerate any racism and that because she can’t be trusted, she will need to find somewhere to go that evening. \n\n4. Invite the girlfriend over, warning your mother you won’t tolerate any racism or you’ll throw her out permanently. Follow up. \n\n5. Buy a confederate flag and start learning white power hand signals, because you are going to need a new social circle once the non-racist members of your family cut you out of their lives.", "Lol you are a titty baby. A baby that can’t do anything if not hanging off the mom’ titties.", "YTA\n\nComplete stranger here who's never met your mum.  Shes a dick and you're a dick for putting up with her racism. Your son and wife are correct.", "YTA. You don’t need to kick your mom out of the house but you do need to shut her down when she makes racist comments. If she doesnt want the girlfriend near her then she is free to not participate in dinner.", "I am a black South African woman and I am telling you now that you are racist by association. YTA. I would drop a racist family member with the quickness of quick. I've called family members out for saying derogatory things about foreigners. I'd rather not have relationship with a bigot. Your wife doesn't agree with your son because she doesn't get along with your mom, she agrees with your son because it's true. Maybe you lack sympathy towards other races experiencing racism because you've never experienced it and you just don't care about how it affects them. Your mom is gross and she will never have a relationship with your son again. \n\nStop being a mamas boy and do better dude. You have chosen your mother over your own child, don't be surprised when he goes LC or NC with you after he turns 18. YTA!!!!!!!!!!!!!", "YTA, though I understand its a difficult situation, when that older generation has racist views, it is completely impossible to change or deal with it. I appreciate it's your mum, and obviously you lov her.\n\nMy advice, let your sons gf come round, but maybe give her abit of warning so she knows what shes about to step into. She may not even want to come if theres someone so incredibly racist there.\n\nThe path you are chosing is dangerous, you risk completely alienating your son by doing this. Its his signficant other and everything was going well until your mum came to stay, at which point he cant even bring his gf to his home anymore.\n\nTread carefully", "YTA, you need to stand up to your mother. Put her in a home and tell her why you’re doing this. It’s your house, not hers", "YTA. Lock your mom in her room when your sons gf comes over. She’s lived a long, racist life. Your job as a parent now is to protect the younger generation", "“Even though everyone around me is saying i’m a complacent racist and i continue to prove their point by allowing a racist to do whatever she wants in MY house and i know its racist, I know for a fact im no damned racist” \n\nself awareness really is a lost trait, YTA and you’re the reason people of color have fears of being in interracial relationships, because you’d rather comfort a racist than show any type of love or understanding to the girl that’s making your son happy.", "Yta", "YTA and racist by association. You aren’t a little boy anymore with mommy having all the power. She is a 70 year old sick woman; let her know if she says anything disrespectful she will be out on the street. That is how you deal with a racist otherwise you sir are racist by association.", "> But he argues that I am being “a complacent racist” by even allowing her to be here.\n\nYou really are.  Tell grandma she needs to cool it on the racism or she's off to Shady Pines.  YTA", "YTA\nThere are two issues at hand here. First of all the racism and the other being that you put your mom’s comfort over your son’s wellbeing. Please go do some reflection and figure out how you can be a better person, and also a better father. Your duty as a father supersedes your duty as a son.", "To be honest with you, comming to reddit to try to find some sence for this is like trying to find wisdom in the bottom of a dry well!\n\nThis is way above reddit paygrade. There are more nuances then everyone here can grasp from half a dozen of scribled lines!\n\nThat being said, NTA!\n\nYour mother is completely wrong! You know she is wrong. You know that putting them together in the same house, even for just a few hours will lead to something that is not welcomed! You know her position is racist, uncalled for and shouldn't be considered!\n\nBUT...\n\n...she is your mother! The way you treat the people that raised you days a lot about you! You don't have to agree with their points of view nor with what they say.\n\nThat being said, you mother is not in her home anymore! She is at your home! As sutch, if she wants to stay, she will respect your views, she will respect your son and his GF. She doesn't have to change (she is free to think whatever she wants to think) be she will be a lady, respecting and keeping her mouth shut and her opinions to herself! Or, you can find her a place to live in and you'll see her on the weekends, if possible! That is the choice you have to give her! Respect is a mutual thing! You owe her respect, because she took care of you! She owes you respect because you are taking care of her!\n\nIf she doesn't want to speak with your sons GF, that's fine! If she can't be polite, she can stay in her room and not come out.\n\nAnd this you have to tell her in no uncertain terms! She can think however she wants, but she will not disrespect you, your son or whomever you invite to your house!\n\nThen she decides what she wants to do and you hold her accountable every step of the way!\n\nIf she wants to stay, she stays on your terms. If she doesn't, she can leave on her terms.", "YTA.\n\nYour wife and son are right about you.", "You’re excusing you’re mothers racism towards your sons girlfriend, making you no better than your mother. \n\nYou should have made it clear the second she opened her mouth and said something about your sons girlfriend that that behaviour won’t be tolerated but you didn’t, instead you let her get away with it saying she’s old. \n\nYOU’RE THE ASSHOLE", "YTA and should tell your mother to hit the fecking curb.", "If you’re at a rally, and someone at that rally is wearing a Klan robe, and no one removes that person, you’re at a Klan rally.\n\nYTA. Not to be harsh, but if your Mother probably isn’t long for this world either way this goes, you still have your 17 year old son who’s always gonna remember that you chose to do nothing during this whole thing.", "YTA  your son is 17 he will leave soon and you will be able to be happy with mommy . Cause your son will hopefully see how horrible you really are .", "Age is no excuse for racism and 70 isn't that old. You are protecting a racist and you are a complacent racist if you don't do something about racism.  From working in elderly care, I knew a 90+ year old that was frightened of anyone that wasn't white but she finally unlearned racism at such an old age. She even began studying African history before she passed. Its never too late to realize you can do better. YTA", "YTA. My mother is not elderly and is turning 70 soon. If my elderly nan who is soon 95 would say that, I would boot her to the curb.", "Your wife sided with your son because he’s right, not because she doesn’t get along with your mother. Your mother would have been max 16 to 20 during the civil rights movement. She doesn’t get to use age as an excuse for racism here.\nYTA", "You tell your mom she's a part of the family. If she doesn't like it she can recover in her room and come out when the gf leaves. Racists are the ones who lose privileges not the people who aren't doing anything.\n\nI can also see why your husband doesn't like her yta", "YTA Your mother is a trashy person and can sit in her room while the family enjoys a meal and gets to know the GF more.  If you enable your mother you a trashy person too.  Your son is watching to see who you really are.  It does note bode well for your relationship with him to show you aren’t man enough to do the right thing.\n\nYou owe your son an apology", "YTA most definitely. Not only because you are most definitely aiding a racist, but because you described a woman in her 60s as elderly. This is the 2nd time in this sub I've seen a son call his mother elderly when she is nowhere near that. Wtf man", "NTA.\n\nOP is fully aware of where people stand on the issue of race. This is a case of winning the battle but losing the war.\n\nIf son's GF and everyone involved knows what's at stake and is willing to risk it and take the consequences, then go ahead and stir the hornet's nest. Just don't blame OP for the resulting fallout.\n\nThere is a small possibility of grandma coming around and accepting the GF, but again ultimately it will be up to the ones involved to decide if it's worth it.", "Nta\n\n\n\nBottom line is you can't do anything about your mother being a racist, but you can prevent the Gf from being insulted and humiliated.  You your wife and son we'll, it's a miracle you never learned your mothers hatred, and kudos to you for finding your own way on that.\n\nRacist or not, narcissistic or not, you feel you have a moral obligation to help your mother recover from her surgery..  Its not excusing her rcism.  And its not condoning her racism.\n\nHowever, you are preventing her hurting and humiliating a very nice girl.\n\nThe son should just tell her straight that his nan is racist as fck and will think nothing of throwing slurs at her.  She needs help to recover from surgery and my dad can't turn his back on her. As soon as she's on her feet she'll be gone, because dad doesn't want her around longer than she absolutely needs to be either.\n\nAlso, why can't they hang out at her house?  Does your son get invited over to Gf house for dinner, does he hang out there?", "YTA. It should always be the responsibility of the racist to not be racist, not the responsibility of POC to avoid them. I get that the person in question is your mother, but if she's living in your home then she should be able to understand that she shouldn't insult or be racist to a guest in your home and that you won't hide black people from her because she might act out.", "YTA\n\n&#x200B;\n\nAnd so is yo' mama", "YTA. Let your racist mother sit in her room in all her uncomfortableness cuz……..MY HOUSE MY RULES! I’ll have whoever I want over, whenever I want. I am super spiteful though. I’d go in there and tell her there’s also a lesbian coming to dinner too just to watch her head explode. I just can’t stand bigots!", "It's wild, I kind of expected the lack of invite to be bc you wanted to protect the gf from being exposed to the racism, not you nodding along when your ma declares the house whites only. \n\nSometimes yelling at an elderly woman is the moral option.", "Yta. You need to confront your mother and tell her that is unacceptable in your home. If she cannot behave. She stays in her room. Your son will remember how you handle this.", "YTA. OP get a damn back bone. You may not be racist but by accommodating your mother’s disgusting behavior you might as well be.", "I don't know if you're the \\*asshole\\*, but you are wrong. And you are being actively racist by acting as the extension of your mother's will. You want to take care of your mom, OK. She needs physical help, OK. Is she entitled to being cared for in an undisturbedly racist environment? Fuck no. So go to your son, tell him that you've allowed yourself to be blindsided by your love for your mom and you're sorry, and that he's free to invite his girlfriend. Then shove your racist mom into a closet if need be, nothing's gonna happen to her for these few hours. She'll be fine - she knows she needs help and will only do as much of this narcissistic shit as you allow her. SOURCE: had a grandmother with dreadful views, and my dad was waaaay too lenient on her for far too long.", "Your feelings for your mother and the rest of your family are clouding the issue for you., and I don't blame you. Narcissistic parents are TOUGH. However, YTA. \n\nWe tend to think of racism as something that people *are*, but that's not correct. Racism is a system. It exists because it's upheld by racist behaviors.\n\nYour behaviors can be racist even if you think you aren't racist. Bc any time you allow, tolerate, or ignore racist behaviors, you're strengthening the system of racism.\n\nEvery time you protest, argue, or shut down those behaviors, you fight the system. \n\nEvery time you choose who to make comfortable, you choose a side.  And you keep choosing to keep your mom comfortable.", "You are 100% a complacent racist. YTA too. I get that you think you are being a hero by saving your son's girlfriend from your mother's racism but you're leaving it unchecked and supporting it which is way worse. She is 70 and did just have surgery so I agree that kicking her out immediately could be harsh (I think racists deserve that treatment but I can see why you might be hesitant seeing as she is your mother) but you need to draw a line. If you truly are not a racist human you need to tell your mom she is wrong and that lovely young woman cares for her grandson and is welcome in your house AS USUAL. Your mom needs to know she cannot make racist comments OR make your son's girlfriend feel bad or uncomfortable in any way. If she disrespects this boundary, your mother should be publicly reminded that her behavior is wrong and inappropriate. If she still can't be nice or causes a scene she should be made to leave the table or living room or whatever space she is polluting. If she makes it a habit she should be made to find other healthcare assistance arrangements. You completely switched your behavior and treatment toward this young woman because your racist mom was in town. No matter your excuse, that's not ok and you need to really understand that.", "Bruh. Slide that woman’s food under the door next time. \n\nYTA.", "Info: Does the girlfriend know that your racist mother is there? Does she ... still want to come?", "I believe I’m respect for your elders-but not at the expense of hurting your kid. Set the old bag straight and tell her you’ll put her in the garage or on the damn porch when she comes over if she can’t act right. I know you prolly don’t want to disrespect your mom’s-so I won’t YTA you-but seriously. Check her ass.", "YTA\n\nGranny is not old. She may be frail from illness but she's not an 'old lady'.  \n\n'Set in their ways' is not an excuse for racism. \n\nGranny is a racist and you're condoning it. Tell her to stay in her room if she can't behave herself around your son's girlfriend. And make her stay there. \n\nDo you mean complicit (involved in an activity that is either legally or morally wrong) not complacent (smug about an achievement)?", "You are enabling your racist mother. Your wife and son are right about you too. Instead of standing up to your mother's cruel racism, you're protecting her. That, son, IS racist too. YTA.", "YTA. Take care of your mother while recovering, fine. But if she can't keep her racist tongue quiet lock her in her room while others are in the house. She doesn't get to dictate things due to her hatred. Grow a spine and stand up for your son and his GF.", "Grandparents wouldn’t come to my wedding because I had black friends in it. FIL also refused to attend never spoke to any of them again didn’t miss it. Mom plays by your rules in your home or takes a hike. NTA", "YTA. Let her come over, and make sure your mother knows her continuing to live with you is contingent on not engaging with the girlfriend in any way.", "9 regular people and 1 nazi sit down to dinner, there are 10 nazis at dinner. Silence makes you complicit. YTA", "Why are you enabling your mother’s attitude? \nYTA", "YTA and you ARE complacent. In this case that phrase about \"if you're hosting a dinner and there's a nazi among them, yiu have a table full of nazis\" really does work. You CHOSE the comfort of a racist woman over supporting your son and his gf AND over decency, as you're enabling a racist through your actions.", "A better term for you is complicit racist. Racism is perpetuated not just by those who hold the views, but also by those who do nothing to stand up for what’s right.", "NTA Your mother is not going to change. All you can do is protect the girlfriend by not putting her in a situation where you KNOW it’s going to end badly. Invite her over when grandma has gone home.", "NAH I understand your and his side. Difficult topic. Will your mother stay for a long time? In that case you need to look for a solution. And I would say the best solution would be to tell your mother that she has to go if she doesn't shut up. Because cold calculation she will die soon and your son will not. \n\nIf it's for a short period talk to your son and gf try to say why it's difficult for you and that you are sorry for the situation and you know that it is shitty. Try to make up for it in some way. Like paying for some dates or whatever.", "YTA. \n\nI GUARANTEE this girl has heard a comment or two in her life for who she is and now she's being excluded from your home because your mother is being a racist? Terrible. \n\nTell this girl your mother is ill and a racist and you've been keeping her from the house because she shouldn't be subjected to that and while you definitely do not approveof your mother behavior you can't unfortunately smack the racism out of her and apologize.\n\n On nights the girl comes over your mother can eat early or in her room. Tell your mother that if she is so bothered by the girlfriend she can stay in her room but you're not banning people from the house because she wants to be ignorant.", "YTA. Stand up TO your mom with what is right. Don’t let her rant to you or anyone else about her racism. It’s your house and she can keep her thoughts and feelings to herself. More importantly, stand up FOR your son. He is your future.\n\nINFO: Is your mother in the living room 24-7 or something? If not, move her into a room and she can stay there while your son and his girlfriend come over.", "If you act like a racist (and you do by not allowing someone in YOUR house not your moms yours) and protect a racist... well I'm sure you can finish that sentence by yourself.\n\nYTA", "YTA.  Why are you allowing an abusive narcissist in your home - much less caring for her - at the EXPENSE OF YOUR WIFE & CHILD?  Are they not more important to you than your abusive racist excuse for a mother?  She needs to be in a home where people are paid to put up with such nonsense - not inflicting her cruelty on your wife & son & their friends.  What’s wrong with you dude?  Surely you’ve been out of her clutches long enough to know that the right thing to do isn’t catering to her bigotry?  And even if you so warped from a lifetime of abuse at her hands, you should trust your wife & child enough to know what you should be doing with regards to her since your own judgement obviously cannot be trusted.", "YTA. \n\nMy grandmother and grandfather’s racism destroyed my relationship with a black man. As much as I argued with them about it he couldn’t see himself attached to a family where he wasn’t welcome in everyone’s home. \n\nFix this before you ruin their relationship.", "If your son marries this woman, I’d kiss seeing any grandkids goodbye.", "The following is your comment to another post:\n\n>It’s annoying and it’s at times dangerous. And most people would like if someone would help out or stand up for them, or get them away from the situation or just ask if you’re good- Especially people ur close with-I don’t think this is a chivalry thing but more like - If you see something dumb like that that could escalate I would say sum no matter who it is.Do better bro.\n\nI've no idea what it is in reply to, but I think you should apply this thinking to you and your son lol. Do better bro", "Stop placating old racist folks, shit ain’t right at all. Your wife and son are correct. Mom can be respectful to your guest as she’s in your home or she can stay in her room while guests are over. 2 hour racist rant, Jesus christ I would told my granny to cut the crap once she started spewing bullshit. YTA. Also, rehabilitation centers are a thing. 🤷🏻‍♀️", "NTA- you're in a tough spot and I can appreciate that. Talk to your mom about her words and actions and hope you can reach her. If not then you gotta walk this tight rope until she recovers.", "YTA. Tell your mom to shut her mouth because we don’t say things like that. Being old is not an excuse, and you are allowing, enabling her racism. \n\nStop allowing your racist mom to dictate who can and can’t enter your home. You are being a racist ah!", "YTA and so is your mother. You're condoning her behavior. Maybe it's time to send her to a convalescent home so you can have your house back.", "YTA. What’s the plan, never have your son over for the rest of your mothers life? I would tell my mother that I love her but will choose my son over her any day of any week.", "YTA \n\nIf your mum cannot cope on her own, you tell her to shut her racist bull crap to herself and that if she is anything but polite to your son’s girlfriend, you will kick her out. Because you will nog have a racist living in your house.", "YTA. Christ My dad is the same age as your mom, he lived in the Jim Crow South and he got maced for protesting alongside black people for their rights. Age is not an excuse. By saying it is the way it is uou are deferring to your mother's racism and telling your son to essentially sit down and shut up. How is his GF to feel, like this is a family she wants to be with long term? This reminds me of when I went to prom and my date was black. I posted the pics on social media and my gem of a mom flipped her shit and started yelling racist crao at my dad over the phone. It was humiliating and when I cried to BF about it he broke up with me since he thought I must be racist too. You've put your son in an awful position, fix it.", "Yta and while you may be complacent, I believe the word you're looking for is complicit. You are most definitely complicit with your mother's racism by not standing up to her. You are enabling a racist and prioritizing her wants and needs over everyone else's. If she can't handle eating dinner next to your son's black girlfriend, your mother can eat dinner in her room.", "OP, I am thinking you mean \"complicit \" and not \"complacent\"?\n\nYTA,\n\nYou should be telling your mother it is racist and disrespectful, in very strong terms..... Remember you hold the power here.\n\n I would go further and tell my son's GF, with an apology stating \n\"Sorry, my mum is a racist, bigot.... I cannot abandon her, so I'm just warning you and that it doesn't reflect my wife and I and our views\"\n\nOr something similar", "Yta. Your son is right. Anyone who supports a racist is racist. Anyone who defends a racist is a racist. Youre racist too", "YTA, big time.\n\nI get that no matter how disgusting your mother's views are that you feel the responsibility to care for her. I'd recommend having two conversations.\n\n1. With your mother telling her that she's being racist and that's unacceptable in your home. Tell her that this lovely girl WILL be coming round and that she must be respectful to this young lady. Tell her that if she has an issue with it, she can stay in her room because she won't be welcome to join in with the family time if she is being rude, racist or inappropriate.\n\n2. With your son, apologising for allowing your mother to dictate her racist agenda on your family home. You don't have much excuse for making the decision that your son's gf can't come around except that you're spineless and would rather be a complicit racist than stand up for your son and his perfectly lovely gf. \n\nWhen his gf does come around, I'd also recommend a heartfelt apology to her too because she needs to know that she is welcome and that you just struggled to try and manage the dynamics in the household and you made the worst possible choice in this situation.", "OP, you’re assuming all the responsibility here. In your shoes, I’d say to mom: “Happy to help. Here are the house rules. If you can’t follow them, you’ll need to leave. The first time it happens, you won’t be invited over for a month.” Then it’s her choice whether she gets your help in your home or not.\n\nI’d say to the girlfriend: We’ve put my mom on warning that her racism isn’t welcome in our home, and she won’t be welcome if she voices it. But she’s a terrible racist. You can come over anyways if you don’t mind the risk that she’ll erupt and make a scene as we kick her out of the house, or express petty disapproval of you in passive aggressive ways.\n\nIf you try to keep the peace, and your son marries this girl someday, how will she always feel about her FIL’s tolerance of racism at her expense? How will your son feel about dating any other people of color, knowing this about you? The buck should stop with you. Otherwise, you’re enabling the racism. \n\nIt’s nice that you care about your terrible mother, but not at the expense of other loved ones like your son.\n\nYTA", "YTA. You are acting in a racist manner by prioritizing the wants of racist grandmother over your son and his girlfriend. Stop doing that if you want to be taken seriously when you say you know you are not a damned racist. Demonstrate that. With actions. To your immediate family.", "Warn the girlfriend how bad she is and let her come if she wants to. I understand your reasoning but YTA.", "NTA. You're preventing a horrible night. Your mother will probably spew hate at her and the girlfriend probably has no idea she'll enter a hostile environment. Why can't dinner wait until she feels better?", "YTA and a racist too", "But your son and wife are correct not sure how you don't see that. I hear old folks homes are nice this time of the year.", "YTA\n\nIf your mother has a problem with being around a black person then she can simply stay out of her way while you and your family continue to enjoy the company of your son's girlfriend.\n\nThe fact you listened to a two hour rant about bloodlines and, rather than calling your mother out on her overt racism, decided to exclude your son's \"very nice, kind and beautiful\" girlfriend from family events says everything.\n\nHave you really not considered that there's a middle-ground between kicking your elderly mother out on the streets and indefinitely banning your son's girlfriend from visiting?", "How about this “mom, this is my house and as long as you are here you will respect ANY guest that might come over.  If not, get the fuck out”?  \n\nYTA.  This is a teaching moment, learn.", "YTA, i married into a very diverse family and i shut that bullshit down when i was like 21/22 with my family. Raised byy grandparents from MS Come on my guy", "YTA and not because of your mom. \n\nIt’s because you took the choice away from this girl. You could’ve explained the situation, how your mom is a racist, she will likely be very rude and disrespectful and you fully understand if she doesn’t want to be around that, but that you’re caring for your mom right now and can’t just kick her out even if her actions are deplorable. \n\nYou’re an asshole for just uninviting her. It should’ve been her choice to come or not and fuck the racist grandmas opinions. She can be ignored and her feelings don’t really matter when they’re because of being a racist.", "I was expecting you to say that you didn't want the girlfriend to come over because you were worried about HER being on the receiving end of your mother's racism.  It still wouldn't be the right move, but at least your empathy would be pointed in the right direction. \n\nBut no, what you were worried about is your hateful mother feeling \"disturbed\" by HER presence. Double YTA for this.  \n\nYou could easily be destroying any hope of a future relationship with your son if you don't take a stand. It is your SON'S home, not your mother's. And you should consider that this makes HIM feel unwelcome in his home too. YTA. Fix it, dude.", "YTA. You uninvite the racist. You don’t uninvite the victim. Doing something to make the racist happy makes you at the least complacent and enabling.\n\nYou apologize to that girl right this second and admit you were an idiot. \n\nAnd apologize to your son for putting him in the middle of it.", "Your mother may be ill and out of shape, but 70 is not old. My parents are in their 70’s and they hike mountains and AREN’T RACIST. Her racism is not a product of her age. It’s a product of her small mind and hatred towards others. Don’t condone that. Tell her to get over it or she will have no place to stay. Don’t allow that kind of hatred in your home.", "Yta and you're enabling a horrid racist. If your mum can't keep her mouth shut then she should be the one excluded from meals and events. Your sons gf has done absolutely nothing wrong. You're as bad as your mum for punishing the gf instead of the one obviously in the wrong.", "I’m going to assume that, having called your mom a narcissist, that there’s a lot of trauma there with her and you that had never been dealt with. \n\nGrowing up with that kind of mother must have been hard.\n\nBut you’re 39 now. You’re not a child. Your mother can’t force you to do anything anymore. \n\nSo when you tell your son that his he can’t come over because she’s blank, there’s no excuse, no blaming it on your mom. That’s what you did as a child, but you’re not a child anymore. \n\nSo yes, YTA. Start standing up to your mom, however hard that is for you. Go to therapy to deal with those issues.", "YTA - cut the umbilical cord. Who did you marry, your wife or your mother??", "While I agree the girl should not be around your mom's toxicity at all, YTA for protecting the wrong person in this situation.", "YTA! You'll be on Reddit wondering why you're not invited to a wedding.", "Yta . You are enabling your racist mother and at the same time hurting your son and his girlfriend.\n\nYour mum is entitled to be as racist as she wants , but in her own room or in her own home .", "Damn… YTA but I feel for you. It can be quite difficult to lay down boundaries with our parents especially if they have health problems. I remember my mom being a force unto herself and holding many a school admin or teacher to account. However as she’s aged, certain ideas have taken hold. She’s repeatedly gone on rants that would make Jefferson Davis proud. I can’t control her in her home but I’ve made clear to her and my dad (who, despite being the white one, is much less openly racist) that they would not be welcome to those words and actions in my home. \n\nI’m no paragon of virtue and like most people have inherited biases. But we try to make our home a welcoming place for all races. She’s in your home and hurting your son who should take precedence. It is his home too. If she want your help then she plays by your rules.", "You should have dis-invited your mother to dinner and told her if she can't play nice, she has to stay in her room.", "YTA. Of course you can’t throw your elderly mother out on the street, but you can make it VERY clear to her that her racism will NOT be tolerated in your house, instead of making your sons girlfriend feel unwelcome.\n\nWrong choice!", "YTA but you aren't a racist. I get it. Your mom is your mom, but you love your son and want him to be happy. He found someone who makes him happy. She is worth defending. And you failed to do that when you mother went on a racist 2 hour rant.\n\n\nYou said yourself she is a narcissist. So i assume she treats others, regardless of race, kind of badly. I imagine this is why your wife doesn't like your mom. Do you defend your wife against your mother? Your mother is the problem. But you are enabling it.", "Why is it so hard to say, I don't tolerate that in my home.You can feel that way, however we don't...so your choice is A not say that or b leave immediately or something along those lines...", "Also wanna point out that maybe the wife doesn‘t get along well with the mother because the mother is a raging racist and a bigot lol", "😭 omg I love that sm ❤️", "As a person of color, i agree that his mom is an ah, and that if she was healthy and well he shouldnt take her side rather than the gf, but as the situation is, i dont think OP is an AH for not wanting to raise chaos in his house when is mother might not have that long either in his house or in life?\n\nAlso i dont understand why the son is so ADAMANT on wanting his gf to be subjected to that kind of hatred? \n\nIf i was dating a white guy who had a racist in his home i would prefer he tells me \"hey my house isnt going to be a safe place for a while, i obviously wouldnt stand in the way of you defending yourself and I would defend you as well if it comes to it, but maybe rn coming will just bring unnecessary hurt, disrespect, anger and drama for us\" than bringing me there knowing whats coming for me ? \n\nBut i m really a flight rather than fight person when it comes to this shit so that might be just me ? Or does it sound like pot stirring to yall too?", "I think the problem with these sort of raging racists is that it’s impossible to stand up to them without cutting them completely out of your life, as your grandpa did to your uncle. I’m glad your grandpa was willing to do that for you, but I think that’s a huge ask to expect out of anyone.", "Hijacking top comment to say…..\n\nHi. Am POC. If I knew there was a raging racist inside of a house, I personally would not want to also be in that house.\n\nDoes that girl even WANT to come around right now? Why would she voluntarily subject herself to that kind of abuse? To make a point? That’s not her job.", "Yep, you don’t have to kick your mother out, but tell her if she doesn’t want to sit down for dinner with your sons girlfriend, she can eat toast in her room, and stay in her room till she’s ready to be civilised.\n\nI know what it’s like to be bullied by a narc parent and to not be able to see your behaviour around them, so maybe you need to stop seeing it as binary - I kick my mother out or subject the girlfriend to her behaviour - and start looking at the third option of setting some firm boundaries for your mother, and letting her know she’s goi g in a cheap home if she doesn’t shape up.\n\nYou’re the adult now - act like it.", "Fun fact, thats him a year ago:\n\n\"YTA kinda. Idk\n\nBut like come on bro. My 93 great grandma would speak up if some guys were yelling out at van me.\n\nAnd while out with friends if they get catcalled I’m helping out- and they help me out too.\n\nBeing catcalled or randomly harassed like that is common for women especially. No matter if it seems like some dumbasses that you wouldn’t take seriously. It’s annoying and it’s at times dangerous. And most people would like if someone would help out or stand up for them, or get them away from the situation or just ask if you’re good- Especially people ur close with-\n\nI don’t think this is a chivalry thing but more like - If you see something dumb like that that could escalate I would say sum no matter who it is.\n\nDo better bro.\"", "Yup, people are never too old to be called out on their bad behaviour. My siblings and I regularly call out any racist /sexist/homo/transphobic crap from our older generation, most of whom are all well into the second half of their 70s. If mum wants to be racist she can go be racist elsewhere, otherwise she can deal, shut up and keep quiet, if she can't be civil.\n\nYta op, your mother's frailty doesn't matter. She can go be in a home if she doesn't like her grandsons choices.", "Holy shit, I said OP's mum was stuck living in the past, but your grandpa was living in the future!", "Holy crap! ‘Go Grandpa’!!!🙌 Love this shit!!", "Crying tears over here! What an amazing man. My dad is the same over my girls… we need more people like them!", "YTA.  Why are you allowing an abusive narcissist in your home - much less caring for her - at the EXPENSE OF YOUR WIFE & CHILD?  Are they not more important to you than your abusive racist excuse for a mother?  She needs to be in a home where people are paid to put up with such nonsense - not inflicting her cruelty on your wife & son & their friends.  What’s wrong with you dude?  Surely you’ve been out of her clutches long enough to know that the right thing to do isn’t catering to her bigotry?  And even if you so warped from a lifetime of abuse at her hands, you should trust your wife & child enough to know what you should be doing with regards to her since your own judgement obviously cannot be trusted.", "The axe forgets but the tree remembers.", "This, OP. Grandma can eat her dinner in her room for a night or two, surely? Invite your son’s gf.", "Also she’s 70, which isn’t *that* old and wasn’t born *that* long ago. My dad is 70 and went to BLM protests and goes to Pride with my sister. None of his 70yo friends are racist either, and you can have civil conversations with them about issues they don’t fully understand. I’m so tired of this “once someone is retired they can do and say what they like because they don’t know any better” bollocks.", "If she’s so old and feeble, just make her stay in her room all night while the gf is over.", "Mother would have been in her teens/early 20s during the civil rights movement. \nThe age excuse is BS \nMy mom is just slightly older here, and she literally marched on Washington .", "She’s also just not that elderly. It’s not like a 70-year-old racist can be written off as just a product of their times or something. If she is going in long racist tirades this sounds like a viewpoint that you have probably been aware of and should have set some boundaries about a while ago. If this is a new thing you should definitely bring it up with her general practitioner.", "Lol my parents are the same age. My dad rides dirt bikes still and my mom goes fly fishing. Like wtf is this feeble shit? I’m currently sitting here typing this wait for my mom to come pick me up in her car to take me to the airport. Btw neither of them are racist in the slightest either.", "Almost 70 isn't elderly either.", "He's a weak man", "I agree with everything but in what world 70 isn't old, it's literally something like 5-10 years below life expectancy in first world country", "Don't agree with inviting the gf if the grandma stays too. If grandma had the strength she'd probably try to put hands on the gf but words cut just as deep. One or the other should stay but if its the gf she shouldn't have to endure the grandma's ugly words just so grandma doesn't \"win\".", "Op is an AH. But atleast he is keeping the girlfriend from being subject to grandma’s racist abuse. We know he will do nothing to stop his mother from harassing the girlfriend.\n\nWe all know that the update here is going to be: “update: AITA for letting my mother say racist things to my son’s girlfriend?”", "She wasn't even alive in 1950. She has no excuse for behaving like it is.", "Yeah, I don't get that bit. I view being anti-racist as a moral belief. Someone spewing unchecked racism in my home is no different than someone coming into my home and attacking my religion for two hours straight (not that I have one, but the sentiment remains). Almost any religious person has a limit on how much insulting of their beliefs they will put up with before they ask you to leave their home; therefore, why should the tolerance for other affronts to one's beliefs be any less? Either it's your sincerely and deeply held belief or it's not.", "My friends 70 year old grandma babysits for them and us all the time. She loves playing with kids. She is still young enough to enjoy doing stuff like that. So if she can do that OPs can deal with a cute black girl being near her.", "Raging racist mole…. God I love Reddit", "Yea I was waiting for the part where he at least tried to EXPLAIN the situation to the girl (and let her decide if she could handle it but he wouldn't be posting on here if he'd done that) but all I got from the post is that he told the girl she couldn't come.", "OP’s son should not be putting a 17 year black girl in harms way just because he feels like racists should be stood up too. \n\nThe sentiment is great but leave this poor girl out of it.", "This is where I am with it! \n\nLike… does the girlfriend even want to come around all this hatred?? Why is he *insisting*??", "thank you! this is what i was thinking, bcs if i was the gf i wouldn’t wanna be there anyway.", "I agree with this. I feel he’s trying his best to not let both sides meet to avoid any trouble. Once the old lady is better and goes away, it shouldn’t be a problem. Not everyone can be confrontational.", "Then you tell your 'elderly' mother that she needs to find a nice nursing home in the deep South that will meet her needs. Not bend over backwards to accommodate her vile thoughts.", "Just check yourself fully at this time because your Mom going on a 2 hour rant regarding bloodlines is racism, she is a racist full out & it would be a complete miracle if you were raised by her that you don’t have unconscious racial bias", "THIS. \n\nRacist: “The black girl can’t come to dinner. It will disturb me”\nReasonable human: “Oh well luckily she can’t disturb you when you have your dinner in this room because racists are not welcome to eat at our table.” \n\nOP, if you want to allow your mother to dictate who comes and goes, you are welcome to move into her house and you can care for her there. Your wife and son do not deserve to be restricted and made to feel uncomfortable in their own home by your narcissistic racist mother.", "this is a great idea!", "Lol like putting the dog in a different room if you have company coming", "Agree with this sentiment. It is your house, you need to let your mother, a guest, know that if she's not happy to live by your rules and respect the values that you and your family live by, she needs to avoid it or face consequences. It is a fair choice for her. You and your family must agree on the consequences.\n\nIn this instance, your mother is imposing her values on you and stating that **you** and **your** family must live by her rules. It's not an easy position to be in but you have a choice to make.\n\nIt's one of those situations where there is no middle ground and those people who want to stay conflict free and try to please everyone will be the loser. You need to make a choice. You know which one you should make, you just need to be strong enough and smart enough to figure out what the best way to inform her is. Ideally you will do it calmly and effectively but if she is not willing to comply, your moral compass must lead you to your family.\n\nAlso, you should speak with your son and his girlfriend about this. You should inform your son's girlfriend about the situation and maybe even her parents. If they would be happy with a situation such as grandmother stays in her room, then that's an option. If not you need to negotiate a situation that takes into account that this is your mother and you don't want her to go off and die alone. \n\nYou need to stand up in these situations in life and be a **leader.** You need to do it with a calm head and not be over emotional. You must show your family what values you believe in and that you are prepared to listen, negotiate and stay true to yourself.\n\nSure, this girl may not be in your son's future forever, but it's not about that. It's about you showing your son, his girlfriend and your wife that you are true to what you believe and that you will forever be a person they can rely on to be true to yourself. Otherwise... you are not that.\n\nBest of luck.", "same 😭", "I'm mixed like you and I love this. Nice one grandfather!", "Exactly. YTA, OP, not because you’re a direct racist but because you’re enabling one. I was surprised your reason for not having her over wasn’t to spare son’s gf from being exposed to a racist, but to kowtow to your mother. Lay down some boundaries for that racist old battle axe and stick to them. Apologize to your son and his girlfriend. And never stop trying to educate and shame your parent when she’s acting racist.", "I’m a flight person. BUT I have learned that if you just start crying at them, the other person ends up running off because it’s too awkward😀😂\n\nAnd to be clear I don’t just cry at people because I want to, every emotion ends up with me crying 🤷🏻‍♀️", "Oh No definitely, it’s a super huge ask, I really don’t expect anyone to kick people out their lives, but personally I think it’s really shitty that people will keep their mouths closed to ‘keep the peace’. \nOps sons girlfriend not being allowed over because grandma is raciest is punishing the kids and showing his mother that she can get away with it. I’m not saying he should kick her out, but I think he should be trying to think of other solutions rather than let it happen.", "Is it really that huge of an ask? Why would you *want* to have someone like that in your life, someone who denies the humanity of people you love? That's not even something I can begin to comprehend. Those aren't people I want in my life in the first place, and if that's how they're going to behave, they've already shown themselves the door. That's on them.", "No. No that's actually the bare minimum.", "This is also a thing, a lot of the time growing up I was told I was to black to play with my white cousins and too black to play with my white cousins, because of this I never felt comfortable around my cousins, aunts or uncles. I never wanted to go over and spend time with any of them …. because… would I even be allowed? Why would I go over, where everyone was hostile and judgy about what color I was? It’s not fun.\n\nThe girlfriend might just be willing to suck it up because she really likes him.", "I saw that earlier and snorted 😂\n\nHe can say something no matter what/who it is. Unless it’s mommy.", "Exactly this. My dad just turned 70 and I don’t see him as ‘elderly’. Same with my husbands parents who are in their early 70’s. To be fair they are all fairly healthy but they aren’t suddenly frail bigots. If you’re a bigot, you were a bigot before you turned 70 and now that you are 70 you should be held accountable even more because you have lived longer and should be “wiser”. If you are a racist and never held accountable for 69 years- the 70th year is as good as any to be confronted. \n\nWe need to stop coddling older people just because they are old(er). You may never change their mind but we all have a responsibility to confront racism. \n\nIf OP is set on taking care of his mother, then he should warn his sons GF that his mother is racist and GF can decide if she wants to put herself in a position to possibly be confronted by that racism. And OP should do everything in his power to ensure that doesn’t happen (eg. Mother eats dinner in her room). And if mother finds a way to harass GF and/or his son then OP needs to shut it down immediately. Don’t exclude POC because you don’t want to deal with the fallout of a racist being a racist. Exclude the racist because they are in the wrong 100% of the time.\n\nEdit: spelling", "Definitely not defending elderly bigots, but in cases such as sever dementia, oftentimes they will say/do things they wouldn't have done in their younger years.\n\nI work in the aged care sector and have seen many residents with dementia who completely switch their personalities with the onset of dementia. However in OP's mother's case, she's just a prick.", "Might just be that we are long-lived but I don't consider someone turning 70 as a feeble and weak-minded individual that can't be held accountable anymore because somehow a switched is flicked and it's now okay to be a moron to people.   \n\n\nNote: Not saying you can't be severely ill, \"feeble\" and begin to age but I just find it ridiculous that you get a free pass to be an ass.", "And he acts like late 60’s is decrepit. Sheesh.", "In my country people in this age still working.", "Right, my mom is 69 and perfectly capable physically and mentally. She retired but when back to work out of boredom.  Aside trom a few more wrinkles and grey hair shes the same woman w the same energy I remember having when I was growing up. Obviously people age differently and have different health issues but acting like 70 is some helpless, decrepit age is ridiculous.", "Haha I completely missed that part.   The rest of the description paints a picture of a 95+/-yr old.\nMy parents are mid 70s as are most of my friends parents. I wouldn’t cut 70yr olds any leeway at all for bad behaviour.", "I know a woman who took up sailing and ballroom dancing when she turned 80.", "This stood out to me too.  70 is not that old!  That isnt \"greatest generation\" age.  That is the age of a Boomer...and not even the oldest Boomer.  Telling Boomers to STFU is the cool thing to do now.  OP needs to act *his* age and tell mom what is up.  She can eat dinner in the bedroom when GF comes over or she can pack her bags.", "Yeah my parents are 68 and I stand up to them all the time", "Yeah my dad is 73 and still not a fucking racist. \n\nDon't get me wrong, he has said the occasional questionable thing, but it's always a lack of understanding (which he is happy to correct) rather than outright bigotry.", "This exactly. Can't shut your racist mouth for a second? Eat in the corner over there, bye.", "I like this plan haha. \n\nBtw if it wasn’t clear… YTA. Your mom is a bigger one though. I hope you take the advice from Reddit", "That would be my preferred solution: you want to be racist? Fine (sort of, more like \"I can't change that\"). But I don't want sweet son's gf to be subjected to her. So either she learns not to speak and not to make any heinous gesture, either she stay away.", "My parents are 85 and thriving. If you are struggling at 70 then you need to be put out to pasture.", "Life expentencancy is an average, not a mode. A lot of people live beyond the life expectancy. 70 is not old.", "Free healthcare would've been more beneficial to her than free speech. 😂", "Yeah, I would never let grammy in the same room as homie's gf. Even though nobody else in the family is racist and they all disagree with her, gf shouldn't have to suffer her garbage.", "Grammonster needs to go .  There’s no excuse for ambushing so innocent girl with a hateful bigot when she undoubtedly nervous about meeting her bf’s family for the first time.  Since grammonger doesn’t want to be in the girls presence, don’t make her.  Wheel her to the nearest care home & invite whoever the f you want into your house.", "I agree it's hard to kick out his sick mom, but telling the gf not to visit us the best he can do? No. He can tell his mother that her views aren't supported in his home. And while he loves her, he will not tolerate any more racist tirades. If she is uncomfortable, she can stay in her room. But the gf is welcome in his house, and if his mom doesn't like it she is free to go. And if he hears one more racist or unkind statement, she is out.", "Took me way too long to find this take. I'm currently dealing with finding the path of least resistance with my mother, and no one seems to get why I don't just go NC and be done. People don't seem to understand that NC is a last resort action, not one you take before trying any other tactic or when you simply don't agree with someone's opinions, and it doesn't just affect the two people involved. I'm convinced the \"just go no contact\" snap decision crew either come from real abuse or have never discussed it with a counselor before. \n\nAnyway you're right. He wants to keep the peace. He's responsible for his mother during recovery, arguing with her will just make things miserable for the duration, gf or not, and actually inviting the gf over would just be cruel to the girl. After listening to a 2 hour rant about blood purity over a picture, I wouldnt be keen to make any attempt to correct either. The fact it was 2 hours long told him more than enough about her suggestibility, and people only go that hard on the subject if they know exactly what they're doing or have absolutely no grasp on what they're doing. She's 69, so I'm better the former. Means there's no reasoning with her, better off to just protect the gf.", "Oh, shit, you’re right.", "If she says anything he can tell her on the spot to stuff it. \n\nI’m sure the gf has heard ppl say racist things before. Not being invited to dinner doesn’t protect her from racism. It does show her what lengths her bf’s family are willing to go to stand up for her. Or not to.", "That is my question as well because my guess is most people wouldn't want to be exposed to all of that. Unless grandma is planning on staying there forever I don't see why he's so desperate for her to come over now knowing his racist grandma is there. I can see why he'd want to have a conversation with his dad about standing up to her, but the begging for her to come over I don't get.", "Even if grandma is in her room the whole time, the energy will be off in the whole house.", "True not everyone can be confrontational - some people are cowards and unwilling to stand up for what’s right", "This.", "Ops enabling of his awful mother's racism actually made my stomach drop it's awful. I don't care how sick she is dump her back her own house or the hospital she gets no compassion as a result of her abhorrent behaviour  imo.", "Now that's easy to say as a healthy, well functioning human. Especially if you are confident. But OP also says his mother is a raging narcissist. If that is true, I might assume from childhood he has been conditioned into not rocking the boat and just being subservient to his mother so she doesn't fly into narcissistic rages, and his self-confidence took numerous blows. And this issue was neither recognised, but definitely not addressed in adulthood, therefore to avoid his mother throwing an adult-sized narcissistic temper tantrum, he is risking his relationship with his son.\n\nCasting off/distancing from a family member you knew all your life can be extremely hard for some, especially if the people are his parents (from whom he'd like love, acceptance, and approval, even if not, or rarely receiving any) but sometimes necessary if they are toxic to this degree. OP has a choice to make now, whether to appease his mother, who sounds like such joy to be around, or to have a lasting, good-natured relationship with his son.\n\n(I mean people have problems about making appointments over the phone, going to the gym due to the fear of being laughed at, taking cr'p from bosses instead of standing up for themselves, and just generally not functioning well in society, but we expect that it'll miraculously change if it's a narcissistic, bigoted, racist woman, who is your mother that you have to stand up against? Yeah, sure.),", "Your home, your rules.  If racist grandma can't deal with a POC in the home, then she can leave the home and figure out care for herself.  Her choice in the matter.  \n\nYou are setting yourself up for your son to lose all respect for you.  Complying with grandma's racist demands makes you complicit, OP.", "Why is his mother making the rules in his house? Sorry but why are some moms so controlling?", "Just for my understanding, your grandpa punched your dad’s uncle. I’m guessing that would be your grandpa’s brother, right?", "Dying punching a racist is something most can only aspire to.", "I love your gramps!", "Are yall still in contact with that guy?\n\nI hope he begged and pleaded to get to the funeral before he was still denied", "Are you crazy? This person is his mother, who birthed, raised, and loved him his entire life. That is a HUGE ask, even if she is a massive AH. Most people end up in therapy for YEARS before and after making a huge decision like that because of the kinds of emotional damage it leaves on them.", "Of course there’s exceptions but it doesn’t seem to apply to the mother here", "Same here. Had  the kindest grandpa that I have many fantastic stories about but as his dementia got worse, he even became racist towards Romani people...which he was himself for example.", "I was coming to say this. 70 is not a \"frail, old person\" unless they want to be or ill health is a factor.", "If she’s upset about it enough to go on a 2hr rant, I don’t think she’ll sit quietly in another room while GF is visiting.", "People have a very difficult time understanding that an ultimatum is used only when you’re really fully ready to walk away for good and loose someone completely. If they don’t do what you want, there’s no more chances. You have to leave and never look back. \n\nThat’s incredibly difficult to do, especially when you still love someone or when they’re immediate family. And often times, when you can’t change someone but aren’t ready to walk away for good, you just try to give up a little bit of yourself to everyone around you to make them happy.", "OP is using that term as a cover, to pretend that his mother is both incapable and naturally racist. Neither are true for people in their 60s.", "And I hate to be this person but also… they are 17. \n\nHow long is this relationship going to last? I do not expect OP to put his racist mom in a home over a teenage relationship. If they were older and moving towards marriage or something, then that’s a hill worth dying on. But otherwise, please leave this 17 year old girl out of this racist family drama. \n\nLike you said, this would be a conversation worth having about future relationships and friends. But you won’t make grandma become the pillar of racial equality overnight by forcing her to interact with his girlfriend, who probably wants nothing to do with any of this.", "Sometimes even if you’re right you just can’t win though, not every situation in life can be solved by confrontation. Sometimes you have to be creative and think of a work around. \n\nIt would be amazing if we lived in a world where people were flexible with their views and were willing to change their perspectives with new information, in someways the younger generations are coming around to being like this. \n\nBut this woman hasn’t got all that much time left and is very stuck in her ways, it’s just a massive waste of effort on both a physical and emotional level. In this case it’s just better to find a work around as it’s somewhat of a short term problem.", "Nope. You definitely need to lose that idea. Not everyone deserves respect. It's earned.", "Grandma’s brother", "I haven’t seen or heard about him since", "It’s not a huge ask to cut a racist bigot out of your life unless you’re a racist bigot. Parent or not. Be a good human.", "Did you read the OP? She didn't love him. She's a raging narcissist. She almost certainly manipulated and abused and used him his entire life. She's probably still doing it. I can understand that it'd be hard to cut her out of his life entirely, but he'd be far better off going LC with her moving forward.", "Coddling racists is how you get more of them", "Yeah my dad is 73 and if he makes a shitty comment towards someone I tell him to knock it off and he does.  He's still a fully functioning adult and capable of knowing how to treat others with respect.\n\n OP is being complacent and enabling racism if they think that their mother isn't responsible for her actions when having a pants shitting tantrum because someone is black in 2023", "Right? My parents are in their 70s and they still get in their RV every summer and travel. My father uses a walker and that doesn't stop him.", "Oh come on lets not start with my 75 year old grandmother does 100 pound squats everyday type shit… the average 70 year old has health issues", "Then she can GTFO as soon as she causes a scene.", "Yep my mothers 68 (white) and her 2 best friends from when I was little are Pakistani and Jamaican, it wasn’t a different world back then. They should know better! Can’t plead ignorance 😒", "She doesn’t have to change her views. She’s not likely to. But the right thing to do if OP doesn’t agree is to say as much. His son is right that he’s tacitly endorsing what she’s saying if he doesn’t even try to tell her to knock it off. Having the whole family tiptoe around her is absurd. \n\nAlso she’s 70? Not 97. \n\nShe could live another thirty years spouting nonsense and alienating her grandchild.\n\nOP is of a younger generation and apparently hasn’t come around enough to have learned to stand up to racist people. He can also do what he wants but he shouldn’t be surprised if his son is disappointed in him and trusts him less.", "Ah ok, well either way, he deserved what he got", "It IS a huge ask for most people who actually care about their family members, flaws and all. Being a good human means that you still love those people, even when you know without a doubt they’re wrong. Only a heartless person would find it easy to cut out someone they loved without second thought. I’d go as far as to say that if you find it easy to cut them out, then you never truly loved them in the first place.", "Even if she doesn’t love him, it’s clear he loves her. While I agree with you that he’d probably be better off without her, that’s a decision he needs to come to terms with on his own time, rather on the time of a bunch of Redditors.", "Yep my dad was until his late seventies in his garden from early spring to late fall.y mom still worked in home care.", "Damn, guess I’m a bad heartless human who’s never loved anyone now. \n\nI refuse to continue to keep people in my life who have treated me like trash or looked down on me. If I can’t get basic fucking decency from someone then they don’t need access to me. I’ve done it before and I’ll do it again. Some people aren’t worth loving, family or not.", "That’s not how that works. You don’t have to enable someone’s shitty behavior. I love my brothers but they are both awful humans. I am NC with both.", "Well sure. I wouldn't expect him to cut his mom off or go LC solely because people here told him to. \n\nBut that still doesn't mean it wouldn't be a good idea for him to start considering it. She's a toxic person.", "If you don’t want strangers on the internet to tell you what to do, don’t go asking strangers on the internet for advice", "Exactly. We can nudge him in the right direction, but escaping the claws of a narcissist on your heart can be hard for a lot of their victims. \n\nIt’s hope that really screws us over. Hope that if you’re good, kind, and loving/attentive enough you’ll eventually get the parent you needed/deserved. It won’t happen, you’ll probably end up hurting other victims of theirs while trying to chase after a pipe dream, but that dang hope and attachment gets in the way. \n\nOP, you may love your mom, but your actual responsibility is to your wife and children. You can respect and love your mother without allowing her to be cruel to others especially in your own home.", "Forgive me for presuming, but it sounds like you had a lot of time to emotionally process before choosing to cut those people out. It sounds like you went through a period of time where you first accepted being treated like trash before you finally decided you had enough. It sounds like to me it actually *wasn’t* as easy as you claim it to be, because by the time you hit your breaking point, you’d already gotten the hard part out of the way. This is the point I’m trying to make here.", "Asking people to simply cut others out of their lives is not how it works. You made the decision to cut your brothers out of your life. Not someone else. You weighed their impact on your life and decided you were ready and willing to take the consequences of losing them and possibly never reconciliating. That is your personal decision to make, not mine or any other Redditor’s. And even if it was done quickly, you had all the time you felt you needed to process. *That* is the point I’m trying to make. That’s why cutting someone out of your life is so personal and difficult for many people.", "I never claimed it was easy. Hell I even said I understood op not kicking her out (I was just saying he need to say or do something about it rather than stay quiet to ‘keep the peace’)\n\nIt’s not easy. It’s never easy. And for me it depended on the person. \nMy sister telling me I should never have been born, blaming me for our parents divorce then telling me I should just die already, made it easy. \n\nMy father never paying attention to me because he already had a son and a daughter so why would he need more, My father getting remarried (me finding out though Facebook) an hour away from where I lived after not seeing him for 6+years because we moved 2000 miles away, made it easy. \n\nI held out hope for a lot of years before I said screw it and cut those 2 out. So yes, I put up with being treated like trash for way to long, too many times people showed me I didn’t need them but I held out hope. I don’t do that anymore. Since then I’ve cut out both my brothers, that time I didn’t think twice and I sure as hell didn’t wait around to see just how much more they could hurt me. It’s different for everyone.", "1 nazi and 9 people at a dinner party are 10 nazis. Silence is agreement, even if it’s your mother. YTA", "Dude YTA. Look at your own post history of saying your 93 year old nana would call out a sexist jerk, and here you are letting a racist stay in your own house. Hypocrite much? \n\nYour son will never forget this. Either tell your mother to shut all the way up, or deal with the fact that your son will choose to end his relationship with you. \n\nWow.", "Hear me out here, y’all that are just out right calling OP a racist or aiding a racist need to learn to look passed your nose and hop off your high horses. You’re talking about the man’s mother for Christ sake, having a conversation with my mother would send me to the loony bin, or worse if she was my grandmothers age. \n\nI honestly saw OPs actions as trying to help the poor girl by shielding her and trying to prevent an incident. You might not be the asshole OP, but you are being an ass hat. Talk to your son explain to him that this isn’t a good environment to bring his girlfriend into right now and apologize to him like a man. And  then ask him to ask his girlfriend if she’d even want to be around a person like that, I know I wouldn’t.", "There is an apparent saying in Germany ‘If there’s a Nazi at the table and 10 other people sitting there talking to him, you got a table with 11 Nazis’\nIf you excuse the behaviour you are accepting the behaviour.\nYTA", "Why did you allow her to go on a two hour rant? How were you able to sit through it?", "YTA. I, a white lady have kicked people out of my home for less racist things and without there even being a person of colour present to hear it. Your sons gf shouldn’t be a factor, if you’re not racist why allow someone to behave racist around you?", "YTA, your mum is an even bigger AH. Nearly 70 isn't that old regardless of surgery. She's is your home, your SONS home. I'd tell her the gf will visit whenever she wants, your mum can either STFU or go elsewhere", "YTA. The ”old people don’t know any better” is such BS. Your mum had 70 years to learn not to be a rasist. You had 40+ years to learn to be a decent person who stands up against intolerance.", "YTA\n\nYes, allowing a racist in your home and abusing your family also makes you a racist. Sorry, not sorry. Also, YTA for showing your children that it is ok to allow abusive, narcissistic assholes around your children. If I were you, I would be so embarrassed. The apple obviously didn't fall far from the tree. Have fun in 20 years when your kid is no contact and your racist, abusive, and narcissistic mother is dead. Who will you have then?", "Fuck racists and their enablers. You’re no better than your racist AH mom.", "YTA\n\nYou might not be racist, but you are willing to side with them to keep the peace. Which is just as bad and historically enabled many not fun things to happen.", "YTA. You're not a damned racist, you just behave like one \"to protect\" your racist mother. Extra YTA for the \"should of\".", "As they say in Germany, \"if there's a Nazi at the table, and there are 10 people sitting there talking to him, you got a table with 11 Nazis.\" \n\nYTA.  Your son and wife are right.", "YTA. \n\nThe reason why your mother has these opinions, is because she has never suffered the consequences of having them. You have ensured this.\n\nYou had the option of telling your mother to keep her ignorant mouth closed, or if she refused, to keep her out of your house that day - perhaps a little coincidental trip to look at nursing homes might offer her a sharp dose of reality?", "YTA. Your son is right, you are being complacent and allowing your mother’s racism to control the household. Grow a fucking backbone and tell her to shut the fuck up", "Your mother is staying at your place so she should be the one who accommodates with your house norm and environment not vice versa. If she has a problem with black people then I guess she needs to find a compromise. You supporting her wishes can disturb your home environment. By supporting her you're being an asshole.", "YTA\n\nYou act like pushing 70 makes her the damn crypt keeper or something. You don’t owe the racist parent anything. Grow up, tell her off, and try actually being a decent person. Defending a racist makes you a racist.", "Your mother is a piece of work. Also she's 70, not 100, and whatever frailty you think she has obviously doesn't extend to her mouth and racist opinions. Maybe if she is so desperate for somewhere to stay she could learn to keep her trap shut and her Moseleyesque opinions to herself.\n\n\nYou are complicit in your mother's racism by not confronting her about it. YTA.", "A racist  by proxy, YTA in my opinion", "YTA for enabling a racist. Whether she's your mother or not is irrelevant. Her age is irrelevant. Her behaviour is toxic and your son can now see what kind of man you are.", "YTA. And you are a racist by shielding a racist. Your mom is horribly racist by the sound of it and you are complacent in her actions. Guilty by association right there.", "NTA..  \nAm I the only one who thinks that he is right to protect his sons girlfriend from this? What are we expecting to happen if the girlfriend shows up? If she starts to be the victim of a racist rant, so all the white people can call out the 70 year old mother for her racism and they all feel better? The poor girlfriend still has to subject herself to this woman’s insults..", "You're NTA, but your son is for wanting to subject his beautiful girlfriend to some abuse. Keep being a good dad", "Seems like people are maybe a little too quick to judge. NTA- Your elderly mother just finished a surgery and you’re having to take care of her. Regardless if she’s a shit person or not, you can’t just throw her out on the street. And if she HAS to stay, better not subject your sons girlfriend to her when you and everyone else knows all she would do is say hurtful, disgusting things to her. Your mom sucks, but you kinda don’t!", "NTA good clickbait mind. Ol granny stuck in her ways will say something fucked up. If possible though go out to dinner with them and your wife on a group date. Explain to his girlfriend your mom is a racist ol fuck but wont be round forever", "NTA : You are caught between a rock and hard place. They ( your son and wife) need to understand your point of view of keeping the peace and avoiding unnecessary unpleansatry. \nI say your son and wife are being the asshole for calling you racist after you have supported your family and taking care of your mother even when you don't agree with her point of view.", "Dude. If my mom was like this, absolutely no fucking way would she have stayed in my house after she started that rant. YTA", "YTA. And you know it.", "You allowed her to go on a two hour rant about bloodlines? Why? There is no world where I would listen to my mother spewing that crap and not call her out for being racist and walk away completely if she still kept going. I would honestly have cut contact with my mother a LONG time ago if I knew she was openly racist like that. I would also tell her that she is under your care as a courtesy, but you won’t allow this talk/behavior in your home and she would have to find other arrangements if this is how she acts. That you won’t allow her hate to negatively impact your son in his own home. But that’s what you allowed. You’re TA. \n\nTo be clear, allowing racism to exist around you like that is racist to some degree. Not being racist isn’t good enough, especially around people as ignorant and hateful as your mother. You need to be anti-racist. I hope you do some serious damage control to repair the way that your son, your wife, and your son’s gf view you.", "NTA. You were NOT racist dude.\n\nFirst of all, if I was in your position, I would NOT want to subject my son's girlfriend to my mother's racism. This isn't about protecting the grandmother to me - it's about protecting a young black woman from being around a 70 year-old woman who's simmering with vitriolic racism.\n\nSecond, as someone who's recovering from a surgery myself right now - *post-surgery would be the worst time to have any kind of discussion with your mom about how you want her to behave around your son and his girlfriend*. The best rational people become irrational while recovering from surgery. Trust me, while this 70 year-old is recovering from surgery is NOT the time to risk an ugly and confrontational dinner. For now, consider having the dinner out with your son and his girlfriend if your mom is able to be alone for a few hours, or if someone else is able to stay with her for the duration of a dinner out.\n\nThird, once your mom has recovered from her surgery and is living in her own space again, then have the conversation with her about how she absolutely is not permitted to be rude/racist to your son's girlfriend. And that if she cannot abide by that rule, then she will not be included in anything having to do with your son and his girlfriend.\n\nAnd finally, as your mom gets even older and the possibility of dementia/Alzheimer's/etc. increase, prepare your son and his girlfriend for the reality that they might not be able to see your mom because she'll say unhinged things - and that she's your mom and so you also can't just abandon her.\n\n(Not that this should matter - but I'm a brown guy who's definitely experienced his share of racism.)", "NTA. I’m a POC and I’m sympathetic to your situation. I know this is Reddit so you’ll likely be told you’re an asshole for not casting your racist narc mother onto the street but it’s your mom and she just had surgery. Presumably, she has nowhere else to go. She’s in a vulnerable state and it would be wrong to throw her out at this time. At your core, I can see that you’re trying to balance caring for your mom with protecting your son’s girlfriend from your mother’s views — does your son really think it’s a good idea for his girlfriend to visit and risk being on the receiving end of racist abuse? Because I don’t. \n\nThat said, there are some things that you should/need to do in order to preserve your relationship with your son and move further from the “complacency” you’re being accused of:\n\n1. If you don’t think it’s safe for her to come in, you need to take your son and your girlfriend out. Show them that you support their relationship. Honestly, depending on how close you are with her, consider also extending a delicate explanation accompanied with an apology to the girlfriend. Make it clear that you respect her and think she’s a terrific match with your son but you’re concerned about her wellbeing if she comes over right now because your mom has toxic views. Explain that your mom’s opinions do not extend to the rest of your family and you’re ashamed of the situation but you don’t think it’s emotionally safe for her to visit right now, and that you’re sorry. \n\n2. Set some ground rules with your mom. Make it clear that it’s your house and her views do not align with your beliefs or your family’s values. Say it over and over again. When she’s recovered and moved out, have a separate conversation about how her racism created a toxic environment for your family and you need to step back from her. It’s hard to permanently sever familial ties but once she’s back on her feet, you need to make it clear that your family comes first and if she can’t change her ways, she won’t be allowed back in.", "You're in a tough bind here. You're trying to be good to everyone and nobody is being good to you. The hard thing about racism is that once it shows its ugly head, all rational thought goes out the window. Racism causes people to feel, not think. Read all these messages. How many thoughtful, rational comments have you seen versus those full of emotion? People saying 70 isn't old even though it's ~90% of the life expectancy of a female. Not a single person seems to realize that your intention is to protect the gf from the racist. That's not racist. But the problem with that is that it's allowing your racist mother to win. It's an unintentional side effect, but a nasty one. \n\nQuestions that need to be asked:\nIs your mom not in a bedroom that's separate from the main living areas? \nWhen your mother went on a \"2 hour tirade\" did you attempt to shut her up?\nDid you stick up for your son and his girlfriend at all during said tirade?\n\nThe answers to those questions will point you in the direction of whether or not you're guilty of the accusations against you. \n\nRemember that racism is about feeling, not rational thought. While rationally you were protecting your son's girlfriend, she's going to feel as if some part of you doesn't like her because she's black. Otherwise, why can't she come over? Why is it okay for the white supremacist but not the loving black girl to come over? Must be because he agrees with the racist.  How is it that such a caring son was raised by a racist? Do you see how easy it spirals? \n\nSo I'm going to say ESH. I don't believe you were being an AH, but you're not being too good even if you're trying to be. Your mom is definitely an AH. And your son is a fucking hero. You raised him so some of that spirit must be in you. Use it on your mother. Let her know what you believe and that if she doesn't like it, she needs to find other accommodations. Her mouth obviously isn't affected by her convalescence. You can still be a winner in this.", "YTA, and a closet racist. Not to mention the fact that you referred to your mother, who is not yet 70, as 'elderly'. Maybe you should return to the 1800s. Seems like you would be happier there.", "NTA, your mother is based as fuck. I suggest you disown your son and do the griddy infront of him afterwards, ez", "NTA. My take is that you are trying to protect your son’s girlfriend. Tell her what she will be in for, in a text, and then let them decide.", "NTA. At 70 she won't change her racist  ways. It's a generational thing. It's irrational, and you can't use rationality to conclusions reached irrationally.\n\nBe firm with grandma. Say her behavior is unacceptable in your own home. Say she's behind times. Say that if she offends bf she will be called a FILTHY racist at the dinner table and will be expelled from dinner. Say that the girl is a gem and that if she is not respectful to bf she will be humiliated in front of the family.\n\nWarn bf beforehand that grandma is a racist. Surely bf has already a thick skin for that. Apologize for any mistreatment and say it won't go unpunished. Tell her to take pity on a 70yo who doesn't know better. \n\nI believe gf and grandma will never be friends, but grandma will know her place.", "I love, love your grandpa", "This is amazing. Go, Grandpa, go!", "I love your Grandpa!!!!", "You're dad is a good man, and your grandfather kicks ass - literally.", "100/10 best grandpa", "Same. I'm also mixed. Moms white and dad black. We were at a Christmas gathering one year on mom's side all white. One of my great grandpa's pulled the N word and said we devil children shouldn't be allowed at the gathering let alone get gifts. He thought we would be leaving, but the family stood up for us by saying either accept them or you can see your way to the door, but they will not be leaving they're wonderful kids and family nothing less. He shut up pretty quick. While he might not of fully liked us for a while he did come around\n\nWhile she might not be family your son likes her. By letting your racist mother dictate how often she can come over your only letting her win and feeding the racism ultimately. She might not like it now, but she needs you and she might come around you never know really. \n\nYTA if you do nothing", "You should add a judgement since you’re the top comment.", "Yep. Just because someone is elderly and recovering from surgery doesn't give them the right to be a racist asshole. And yes, he in fact is a complacent racist. \n\nIf I were the son I would go no contact with the grandma, avoid being around dad as much as possible and would be counting the days to get out of the house. \n\nHonestly, OP and his mom are disgusting. YTA", "> So your mother, who is in YOUR house, gets to say who can and can not come to your house because \"they will disturb her\"? \n\nThat would be reasonable under certain circumstances, say if the son and his gf had a metal band and were practising all day, but certainly not for this reason.", "YTA OP\n\nYou don't share your mother's racism, great! \n\nBut you are supporting it, and that puts you in the sympathetic to racists bucket. And that's a very near bucket to be in compared to racists. \n\nYou're allowing a racist to dictate your behaviour with racist actions, enforcing segregation in your own household, restricting access. You say your son's gf is a wonderful person you like. Right now your actions don't say that to her or anyone else. \n\nYou either challenge your mother directly and get her to shut her mouth and stop altering your life to accommodate her racism, or you fall real easy into the racist bucket with your mom.", "I think both you and OP mean \"complicit\" by the way", "She's a narcissist, so it wouldn't matter what he did.", "She's a narcissist... I guess you aren't familiar with that behavior. There is zero he can do to change her viewpoints.", "man, how can he not see that choosing a racist over his son and his “very nice and kind” girlfriend is racist behavior. None of this means he’s some full blown racist. We all have problematic thoughts or bias that pop in some time. Recognize them, apologize if necessary, and work to fix it. A saying I love is “You can’t control your first thought. You can control your second thought and your first action.”", "Yeah don't you like, tell someone to shut up when that happens? \n\n\nAnd if she doesn't I'm not saying slapping a frail 70 year old is the answer. But getting a spray bottle with water and spritzing her in the face is.", "I wouldn’t be surprised if he allowed it because secretly he thinks the same. That’s the woman who raise him after all.", "The good ol' tolerance of intolerance paradox. If a society is tolerant without limit, the ability to be tolerant is eventually seized or destroyed by the intolerant.\n\ntl;dr: Don't tolerate bigotry.", "My dad died from dementia a month after he turned 70, after years of getting worse and saying crazy shit. 70 is old enough.", "Yeah, my parents are 70 and almost 76 and that’s never stopped me from teaching their Boomer asses about what’s appropriate to say and what isn’t. OP is looking for any excuse not to have to stand up to mommy, like a coward.", "My man, 70 is old as fuck what are you talking about? The average life expectancy for a women in the US is 80 at good-average health", "Agree with this 100%. A lot people here are saying he should throw his mother out on the street, which is crazy to me. Being able to go on long rants doesn't mean she can fend for herself. Maybe she can't walk. I do agree that a home health aide is a great way to get her care and also get the racist out of the home, but it takes time to arrange that. It's not like ordering a pizza.\n\nOP made the wrong decision, but I don't think he's a *complete* asshole...I think his heart was in the right place (trying to keep the peace), but failed to consider all parties' POV. But the bottom line, like you said, is that people need to stand up to racists. Even (and especially) if it's your own family.\n\nHopefully there's still time for him to reverse course here.", "I wish we knew what the person actually impacted by the racism wants. It's just a bunch of white people making decisions for her at this point.", "Yes what’s with these invitations EVERY DAY. Why is the son so keen to expose his girlfriend to that. It feels more about him making a stance than caring about the girlfriend’s experience. \n\nI think that OP should probably get the help of a psychologist in how to talk to and navigate this situation with an elderly person who grew up in the old era but is in need of care.", "Finally.. someone in the comment section who sees things as they are. I find people are being too harsh on the OP. He's in a tricky situation and stuff like this is easier said than done. And having grown up with an aggressive narcissist myself confrontation is just not that easy to do. It's easy for everyone to tell OP to grow a pair but I bet you that 80% of the people going at him wouldn't be able to do it either in this situation.\n\nI definitely see it as trying to protect his son's girlfriend. He should communicate about it though and try to find alternatives. Ideally this nasty grandma should be leaving the house at some point and then the girlfriend can come over after that no problem. Hopefully it doesn't take too long. Maybe OP should put her in a home or something.", "Thank you! \n\nThey all knew grandma was racist and it wasn’t a problem until the son got a black girlfriend. Now he’s insisting that girlfriend come over but it doesn’t sound like he’s willing to do the real work to make sure she’ll be accepted in that household either.", ">\tYour son is an AH for being a lousy hypocrite because nothing screams “I’m the epitome of moral righteousness” by kicking your own 70Y physically-ill grandma to the curb because she is a racist.\n\nHow is that hypocritical? Racists don’t deserve the respect they deny others. That’s simply logic, not hypocrisy.", "This situation isn't a boolean variable.. i think people are far too quick to scream racist.. this is a no-win situation, and the dad prefers avoidance since he knows this is a shott term situation. The son is an ah for pushing the situation.", "There are plenty of rehab facilities that could accommodate the mom and sending her to one would be the consequences of her own actions.", "It doesn't matter if racism was perceived as \"okay.\" It isn't and it never will be.", "None of the 70yr olds I know (aunts, uncles and my parents’ friends) have ever said anything racist around me. My parents would have been in their mid 70’s if they were still alive and I don’t recall ever hearing anything racist from them growing up. My mom, born in 1944, was one of the most inclusive people I’ve ever known. Age has nothing to do with being a racist.", "I agree with everything you said,except ESH. How is it possible that the wife, son and girlfriend suck if that's your view on grandma?", "This, because OP definitely should not expose the girlfriend to his horrible mother. But not should the mother get what she wants.", "Yeah, I saw this as protecting the son's girlfriend from an asshole. \n\nI'm not sure if the mother here would keep her mouth shut/has a filter or all of her marbles.", "Thanks for sharing your perspective, I didn't want to step on any toes but it occurred to me that perhaps OP needs to sit down (maybe meet for lunch or coffee) with son and girlfriend and have a discussion about this. GF may be perfectly happy with keeping her distance. It seems all well and good to say \"you need to teach racist mom a lesson by forcing her to be around people she hates.\" But that person who she hates is a \\*person\\* who should have a say in whether or not she's spending time around someone who will almost certainly say racist shit to or about her.", "Exactly. Why does the son even want her around a racist? IDK if OP is keeping the girl out just to cater to the racist, or if it's also to keep the girl away from harm. He feels obligated to help his mom. Not many people feel that obligation, and it isn't on reddit to tell OP he's wrong for it.", "Yeah, I'm not a POC but this was also my thought. I think she is owed an explanation for why she was uninvited, but OP, your home is not a welcoming/safe place for her as long as your mother is there.\n\nYou're still the AH, OP, because you're enabling your racist mother. But this girl does not deserve to be anyone's teaching moment.", "Oh damn, I thought I had lol.", "My 100 yr old great grandma would 100% tell OP and his mom to go kick rocks and that they should be ashamed of themselves. It was always fun watching her put other people in their places for this kind of behavior and telling them they have no excuse besides for (and as I quote) \"a shitty sock muppet\"", "Right? \"Going on 70\" means she's not even 70 yet. Most people in their late 60s and early 70s aren't feeble and \"elderly\" and can do plenty and live on their own barring serious, serious health problems.", "my coworker is 70 and nowhere near ready to retire. My dad is 74 and takes my son to hockey practice and is right now (no school today) with my kids 6 and 8 taking them out for breakfast then to his place for a nanny and grampy's house sleepover.", "This is what I was thinking. Tell the mother she can't come to dinner and has to eat in her room while they all have family dinner with the gf. But also make sure the gf is aware of the situation so she can make her own choices.", "It's only fair, she said she wanted to be \"kept away!\"", "100%. He fully acknowledges she’s a narcissist and a racist, but somehow thinks his wife is unfairly biased against his mother because she doesn’t like her.\n\nI wonder why that might be… As though disliking someone is invalid for some reason?\n\nAnd if his wife hates his mother so much, why the hell is she staying in their house??? It’s layers of nonsense.", "That’s a really easy thing to say. Having lived under the thumb of a tyrannically narcissistic mother… it’s much harder to put into practice. \n\nI don’t mind telling my boss to fuck off. When I was in the Marine Corps I didn’t mind having arguments with the leadership that literally could tell me that I wasn’t allowed to live with my wife. Ive been in physical altercations over some things I believe in strongly.\n\nIt’s almost a compulsion to do what ever my mother says and not argue.\n\nEdit: I should specify that it isn’t simply that I wouldn’t stand for what I believe in, but that the concept of telling my mother to “sit in her room if she can’t be a decent human being” would never cross my mind.", "someone had to say it, yes", "He doesn't want to go to jail for elder abuse.", "My dad is 72 and my mom is 68. They're both old enough to remember going to an all white school and when schools were integrated. My dad's dad used the n-word with a hard r. My dad thought his father's racism was absurd, because my dad was mostly raised by a black nanny, including going over to her house to hang out with her kids.\n\nMany of my friends in high school (who I don't associate with anymore, for obvious reasons) definitely had confederate flags and told our \"token black friend\" that he was \"one of the good ones.\" Racism is still very alive and well in the southeastern US, and people don't have to be old to remember it. I'm not even 30 yet.", "I guess that would depend on genetics and what kind of life they had. I have 3 grandmothers- maternal, paternal and stepfather. Out of the three the only one that is independent is stepdad’s mom as she led a very active life. The other two require a lot of assistance with daily activities. They’re all in mid eighties except for maternal who passed 2020 of cardiopulmonary disease.", "My parents are 77(f) and 80(m) and aren't old at all.  Sure they have more aches and pains and have to make some adjustments, but they regularly work out, my dad plays tennis and golf weekly+, my mom watches my 3 yr old nephew several times a week (and will often come to visit us and hang with my 3 yr old twins).  They also both travel regularly.  They have been divorced for nearly 30 yrs and are each doing this with their current spouses (remarried 25 and 18 yrs respectively).", "It’s easy, just lay out the rules explicitly. Tell her that regardless of her personal feelings she’s to be polite or stay in her room. Make it clear that it’s not negotiable, but a condition of her living there.", "His mother is a narcissist... not much he can do or say.", "I'm just going to tell you that (incapacitated) patients who act this way in the hospital setting get spoken to about their behavior all the time, and 9 times out of 10, they shut their mouths and apologize because they are fully aware that they're being ignorant and fully surprised that anyone outside their inner circle will shut them down in a polite and professional manner.", "Actually it is not the same. People attacking your religious belief are attacking your world view. Racist people attack someone's very being, something they couldn't change no matter how convincing the argument or how much they wanted to.", "My mom is 66 ( son of far from 70) she’s an elementary school technology / science teacher. She’s one of the smartest people I know and is constantly growing and learning and I’ve seen her political views shift more and more liberal as she has gotten older. \n\nHim using age is an excuse", "Both my parents are over 70 and they are more socially active than me and still smarter than me.", "OP isn’t “passively observing” here. Passivity would be saying okay to the son and okay to the grandmother and letting shit fly when they’re in the same room at the same time.\n\nOP is *actively* siding with the grandmother by prohibiting the girlfriend from coming over—on grandmother’s behalf. And why is that so important? In a world where people like grandmother are vastly outnumbered, it’s the prevalence of people like OP that prefer the “negative peace which is the absence of tension to a positive peace which is the presence of justice,” and make active choices to that end, that lets the people like grandmother keep ruining things. Her racism doesn’t work without OP’s deference. \n\nFor what it’s worth, I don’t think that OP has to kick grandmother out. If she really can’t do much on her own, then she can stay in bed rest in a different room, on a different floor if possible, while son and girlfriend have their family dinner. If OP has siblings, one of them could possibly take grandmother for an evening. And maybe none of these are actually possible, but from the post, it looks like OP hasn’t even looked into alternative solutions to not letting a black girl into his house because a racist told him not to. \n\nSide note relevant to OP’s aiding-and-abetting-like behavior: people keep bringing up the 2-hour rant, rightfully, and not just because it’s a touch odd that someone so incapacitated and helpless could go on and on and on and on. Assuming OP isn’t incomprehensibly exaggerating (as in, the rant was only 5 minutes), OP again made a *choice* to sit through two hours of a racist rant. And even if it was only one hour, or half an hour, or ten minutes, I think that’s just a bit too long to entertain someone spewing racist bullshit about your son’s partner.", "The indifference of good men is an evil all of its own. Without the indifference of good men, evil for evils sake would not brew.", "\"The only thing necessary for evil to triumph in the world is that good men do nothing.\"\n\nYou are *just as bad* as the person doing the bad thing when you do nothing about it.", "You’re correct that no one has any responsibility for anyone else’s behavior. However, you’re not picking up on the issue here at all. This is an issue of OP bringing a hateful person into their home and refusing to defend his family to them because it’s more important that the racist be comfortable than everyone else in the home. No one needs to take responsibility for her behavior, but there’s no responsibility taken when you tell them you don’t tolerate a ridiculous and ignorant rhetoric/belief that has literally never once brought anything positive to a community, or society in general in the history of the world. \n\nIf OP’s mom wants to be a hateful, racist asshole, that’s her prerogative, but she’s a guest in their home and thinks she can dictate how things are gonna be run while she’s there. Her racist views are outnumbered, yet OP just stands there. \n\nIf you had guests over and one of your guests started insulting the one of the others, or assaulting them, or murdering them, would you just sit there and not intervene AT ALL?? Even if it were a dangerous situation, you wouldn’t call 911 or find a way to get help? You would just sit there and let it happen because you’re not gonna take any responsibility for what’s going on directly in front of your working eyes and brain?", "How the fuck is that not elderly", "This is where I’m at too, OPs an ass hat for sure. But, why would anyone want to be around someone like that?? Christ I feel for OP with it being his mom and all. I don’t think a lot of the keyboard warriors are actually putting themselves in this situation fully.", "For real, the only good option here is for OP to sit down with his son and explain the situation to him. It’s a bad look that he even wanted to bring his girlfriend into a situation like that in the first place imo", "The son is not an AH for wanting his father to stand up for their family values.  The son is a child in his own home.", "It’s very much a thing for a dying person to suddenly have one more burst of energy then rapidly decline and pass, it’s called the swan song. Your grandpa’s song was epic.", "What a champ. Your grandpa and my grandad would have been great friends (the highest compliment i can give a human).", "I think your grandpa was very happy he could stand up for his family one more time before leaving. I'm sure that felt great for him, and I'm glad your family had your back!", "I mean this will all the sincerity in the world. If I go out like your grandpa I will be proud of what a badass, respectful human being I have become. He sounds awesome.", "Your grandpa was amazing.", "He sounds like a badass! Good man, grandpa.", "It’s an absolutely lovely story. It makes me so happy.", "One of my borrowed kids had similar.  Too white to be accepted by her black family, too black for her white family, and she ended up at my house in tears regularly. She calls me mama and is NC with her birth mother. Her father holds our family in esteem for being there for her and being a soft place to land. He considers us family and my FIL & MIL treat her as one of their own grandchildren. I am so sorry that your relatives sucked so hard. It shouldn't be that way.", ">The girlfriend might just be willing to suck it up because she really likes him.\n\nSo can't they meet at her place? Or does she also have a racist grandparent there?", "When it comes to it I have the ability to stand my ground and the toxicity to hurt people back exactly where it hurts, but if I can, i would rather just not have to, i.e. to not be somewhere that makes me need to defend myself in the first place\n\nI dont know if i make sense lmao", "Is it really that hard to understand why cutting your own parents out of your life might be difficult?", "As someone who grew up with racist family members, the reason is complicated. For starters it’s because I grew to know and love the good side of them first before I ever saw their ugly side. But because I’d grown up seeing their good side, I knew that they were capable of love and I wasn’t willing to give up on the good I saw in them. I believed and hoped that they were capable of change. I tried to understand where they were coming from, which was usually a place of fear and ignorance perpetuated by the environment they had grown up in. Most of them had never met a black person other than seeing one walk by on the street. Most of them had never been taught to challenge their perceptions the way I had in school.\n\nLittle by little I tried to work on these people. Some worked, others kinda sorta, and yet others didn’t at all. Some I wonder if they would have worked, if only they had just a little more time in this world, or someone by their side who was better at explaining than me. I learned early on that it was a gradual process. For example, I would tell stories of a friend I met at school, but conveniently leave out their race until I was sure this family member had established a positive perception of them, then challenge their bigotry by dropping the bomb. Or when they made a racist remark, I would make an innocent comment like “Mrs. Smith my teacher is that race and she ain’t like that. What, you said she’s ‘one of the good ones’? Ok Aunt B, if you say so”. It wasn’t the scale of the fights that made them change, it was the frequency with which I made these little comments which made them rethink. Little by little, some people embraced the change and learned to challenge their own beliefs. Others just learned to keep their racism to themselves, but I still see that as a small win.\n\nMy belief is that most people aren’t beyond hope. And even if they are, most still have some good in them worth loving. Because even then, by loving them you can teach them that other people’s perspectives are worth loving even if they can’t find it in themselves to agree with those perspectives.", "Can confirm. My parents are bigots in their mid-80s just like they were in their mid-40s (and presumably before).", ">you are 70 you should be held accountable\n\nDamn right.  I'm 63.  Zero chance I become a raging bigot in 7 years.  But if I somehow did, it would be on me.  I'm responsible for my actions.  Always.  Anyone who takes that accountability and agency away from a 70 year old (or any adult) has robbed that person of everything he is and everything he has.  It is the most heinous and offensive thing you can do to any person.", "> Definitely not defending elderly bigots, but in cases such as sever dementia, oftentimes they will say/do things they wouldn't have done in their younger years.\n\nOh man, ain't that the truth.  My fiancee's great-grandmother passed away a few years ago in her mid-90s.  She was this tiny sweet little woman who pretty much always had a smile on her face.\n\nThe last time my fiancee saw her, she was literally a snarling, evil monster, spewing nasty words and trying to bite anyone who came near her.  Totally understand why some medical conditions used to be seen as demonic possession.  Dementia's a bitch.", "My dad's dementia never made him racist or anything, because he was the kindest man to ever walk the earth, but he did keep thinking someone was trying to rob or attack him. And also that he had to tell the government the Germans were coming, for some reason. \n\nAlso thank you for your service. It can't be easy.", "My great aunt is 102 and her sister, my grandma is 95, they might not be able to navigate everywhere on their own any more (due to 95% blindness) but they absolutely still know what they are saying, especially when it comes to talk about other people, something that wasn't exactly invented yesterday.", "My mom is 74 and chronically ill but she is more liberal than at any point in her life.", "Listen, shes clearly a nasty old bat, but if OPs mom isnt physically capable of doing XYZ on her own, the average physical capability of someone her age doesnt matter. Thats like saying someone young can't be physically disabled. If OP says mom can't do whatever,  I don't see why that's being challenged. Like my mom is only in her 60s but her vision is worse than someone older. Aging is not a standard process.", "> Right, my mom is 69\n\nNice.", "I have no idea why it’s a super common assumption that it’s just normal to hate your in laws and not get along with them ever. Like, OP is basically like “my wife hates her (obviously, she’s her in law, is what he would say) so she’s biased” like what???", "I don't know how the wife could have any respect fire OP.", "One of my friends would only serve foreign cuisine everytime she was forced to cook for her racist uncle. It was one of the most beautiful forms of malicious compliance I have ever seen. Especially because it triggered to uncle to be racist and then everyone had such a bad time the family dinners went away. \n\nSo maybe not only eat alone, but eat \"non white people food.\" Lol.", "Let’s not pretend it’s limited to the American South, it’s just more open.  In fact I’ve read at least a few black people who say they prefer the overt in-your-face old-fashioned racism to the more covert, subversive racism more prevalent in the north, because at least then you know where you stand with people.", "That depends entirely on lifestyle and the person. Just because some 70 year olds are still in good shape doesn't mean 70 isn't old. There are plenty of 70 year olds who can hardly walk or get around on their own", "What is the age span like in the country are you in? Here 70 is a senior citizen. Are senior citizens not old?", "Please do not subject a 17 year old girl to racist abuse just because you THINK she’s heard it before. \n\nLeave that girl out of it! And until we’ve heard from the girlfriend don’t assume that she would insist on being invited where she is not wanted.", "Congrats, your parents are in good health and I wish them very long lives, but they are the exception, not the rule. Your experiences aren’t universal, especially when you consider how prevalent certain lifestyles where back on the day like chain smoking and drinking. Not to mention environmental factors, the buildings they lived and worked in.", "Listen, if people on Reddit were even *half* as about it with standing up to racists as they claim..\n\nAmerica wouldn’t be where it is today.", "Plus it seems like grandma doesn't mind shouting her views at everyone who comes close. Nothing sets the mood like racist grandma shouting slurs from the bedroom. Just dumb. I think an apology would be nice to the GF but everyone here on Reddit seems to think op should just wheel grandma to the street and leave her there. Op clearly is not super fond of his mother based on how he describes her so i don't know why everyone is dog piling. He is clearly doing this because his mother has no where else to go which isn't surprising with her attitude", "Yep! As a Brit I can tell you sadly racism is the UK is still alive and kicking. Towards pretty much all minorities. Hopefully in our lifetime it’ll get better!", "The son is actively trying to bring his black girlfriend into the same house as his racist grandmother. Let me say that again, OPs son is actively trying to bring his black girlfriend into a situation he knows can only end poor if grandma has to interact with said girlfriend. How would you feel if your SO did the same? Yeah OP should definitely be standing up to his mom, but that his mom dude literally the person that brought him into this world and raised him. This a no-win situation and if I was OP everyone would be getting an ear full", "Exactly.  We had to cut off my husband’s entire family of narcissists and enablers due to their racist/xenophobic behavior.  They lost their goddamn minds when our daughter married a Muslim man - wrong color and religion both OMG.   And now our son is dating a black woman it would almost be worth having contact to see their faces when they find out.  OP would be wise to throw mother dear out the door as soon as possible.", "I agree with this and I believe that the best way to go about it is to be upfront with both the son and the girlfriend. “Grandma is a raging narcissist and racist. And while I feel beholden to help care for her while she is recovering, I do not want to put either of you into a position of having to deal with her narcissism and racism. It’s not you, it’s her. I grew up with her and I wouldn’t wish her toxicity on anyone. And because we think the world of you, we do not want to expose you to such vile filth.”\n\nAnd then maybe consider moving her into a recovery home. If she chooses to behave that way, she can do it elsewhere.", "This is the nuance I was looking for - if OP has had to put up with his mothers behaviour for his entire life, even where she is clearly wrong, it must be difficult to stand up to her even in this clear cut case.", "This. Plus if she's that much of a narcissist and hasn't been put in check that much so she can learn there are consequences, you'll be witness to some crazy escalations and lashing out. It takes quite a bit of work to get a narc who is not used to hearing no, to learn there are new rules. Meaning, you can tell her to stay in the room, but I would bet money that ain't gonna happen and it won't be pretty. No kid needs to be exposed to that, period. And if you can't guarantee the girlfriend a safe space, she shouldn't come over for her own sake. \n\nTrying to reign in a narcissist is like trying to ride a tornado with the emotional intelligence of a toddler.", "This is so spot on.  The crippling effects (sometimes lifelong) an NPD/BPD parent can have on their children is really hard for people who haven't experienced it to comprehend. No one has the ability to make a grown adult still feel like a scared child like a narcissistic parent does.\n\nWhile I'm usually in the \"let each partner deal with their own parent\" camp, OP may want to ask his wife to take the lead on this one (and fully back her up), depending on her willingness.  Mother's history of narcissism wouldn't have the same mental hold on his wife, so she could be better suited to assert/enforce *their* boundaries in *their* home.\n\nAnd I hope OP has a plan for potential long term care for his mother that does not involve her being in their home, because that's a home-wrecking waiting to happen.", "The fact that it is hard to escape as it propagates across generations is what makes it even more important to protect the younger generations from it at the expense of the older ones. It might be too late for the older ones but at least the parent-induced mental health problems will stop with their generation then.", "I don't think people are treating it lightly as of is easy, but the truth is that the problem is not gonna go away because he's avoiding any confrontation - his mother is the root of all issues and sooner or later he'll have to face it or lose the family he build in the process.", "It may be difficult, but your love for your children should outweigh this. I have a toxic mother, and she has been given notice. I went NC because she is evil.", "Agree but OP shouldn't be exposing their son to the toxicity. Hopefully this is the wake up call they need.\n\nIf they ignore it they remain the asshole", "My SO's family is like this, but their hangup is religious intolerance rather than racial. His own grandfather refused to say goodbye to SO on his death bed. He turned his head away and asked him to leave, then died shortly after. All because I'm not a member of their religion.\n\nOP is clearly struggling with what to do, which is why he asked for perspective on the issue. Being raised in that environment, being beholden to a narcissist, is incredibly difficult to get past because you've literally been groomed from birth to be compliant and subservient.\n\nIt's really easy to say \"Fuck them, they're racist\" and sure, OP probably feels that too, but those feelings are also mixed in with \"but she's my mom\" and \"she can't take care of herself\" and \"I have to help her because no one else will\".\n\nMy own father is starting to show cognitive decline and his health is poor. I don't want him to suffer, I don't want him to die, but I still remember that this is the same man who strangled me and beat my mother. Now he's just shitting his pants and forgetting things constantly. There are complicated emotions there.\n\nEdit: this won't solve everything, obviously. But Mom can stay in her room and eat her dinner there if she has such an issue with a black person being in her house. She's being taken care of, and it's a very noble thing to help someone who can't help themself, *especially* when that person has hurt you, but she doesn't deserve to run the house. She can have her hot meal and cozy bed all by herself in the other room while her family enjoys quality time together.", "Excellent point of view. OP is likely beating himself up over this. Decades of conditioning by his mother and now needing to stand up to her. \nI'm wondering if he \"practices\" what he'll say to her with his wife first would help?", "Stop making excuses for AH racist people.\nHer being narcissistic doesn’t make OP less of an AH for allowing her to behave like that. \nMaybe stop the circle so OP’s son doesn’t end up resenting his dad. Son and GF’s feeling are waaaay more important than OP and his racist AH mom", ">You are setting yourself up for your son to lose all respect for you. \n\nCorrect.  We have already lost all respect for OP after reading a few paragraphs.  I'd be surprised if son has much left at this point.", ">why are some moms so controlling?\n\nBecause they are allowed to be and encouraged to be so controlling.  If it's your house, it's your rules.  Which is both a right and an obligation.  If you don't set rules, somebody else will.  OP has abdicated his obligations so he has lost his rights.", "> I don't care how sick she is dump her back her own house or the hospital she gets no compassion as a result of her abhorrent behaviour imo.\n\nPretty simplistic way to look at treating one's own mother. I'm not saying it can't be done but it's not always easy to make these decisions, especially if what you decide could legitimately endanger the health of your relative.", "Grandpa's swan song was a 100% heavy metal tune. Rest in Peace, you beautiful bastard! 🤘🏻😝", "Grandpa’s Swan Song was “Stairway to Heaven”!", "Also called \"the rally\"", "That’s basically my fantasy", "Damn.  Grandpa went out the right way.  Epic.  Well done Gramps.", "[removed]", "No it makes sense, you’ll do it if necessary, but avoid it when you can help it.", "Honestly even in cases of dementia, it's more understandable but that doesn't mean it's just left alone. I knew a women who worked in a veterans home ans one of her patients was constantly nasty towards another patient, who was Korean. And the staff was taught how to make sure the two of them stayed apart. So even if Grandma had dementia, there is still no reason why the GF couldn't come over.", "Yeah, it would be a different story if OP's mother had just had a surgery, indicating ill health...", "I'm so blown away by those comments. My mom is turning 69 next week and goes for a 10km run every day at a minimum. 70 is not feeble end of life stage for all.", ">Aging is not a standard process.\n\nYeah, this whole \"70 isn't old\" argument is really odd for me considering majority of my family members died before even reaching 70.", "It’s almost like his wife has very valid reasons for hating his … \\*checks notes\\* “racist narcissist” of a mother.", "It frustrates me to no end that people can’t seem to grasp this.  \n\nMy father is 64.  I would say he is “old” because he just sits around and gripes, he has nothing going on.  \n\nMy FIL is about to turn 76 and is still kicking ass.  He’s at the gym every day at 5 am.  He does home improvement projects for himself and his neighbors.  He tinkers with antique engines and is teaching himself to weld.  He isn’t old.", "She can go live in a nursing home, they have therapy there and serve meals.", "We understand it. We are just trying to save some future pain before you guys learn that you can't negotiate with a narcissistic person (especially a racist one) because they will do anything to win. It is difficult to do, I have done it. However, life is surely much simpler than to continue to deal. Take it from those of us who know and have been there, cut the losses because you do not have any other solution.", "It is actually the norm, life expectancy averages around 80 which means as many people live over 80 as under it. Edit: in my country", "These old white ppl, man the world is full high definition color.. as painful as it as. They cry every Yr, how they are the heroes saved the world from evil nazis. \n\nWhat has availed after that? \n\nWaging illegal wars by misleading the public, slaughtering a mill plus civilians. Put in puppet gov so you can bomb them at later date. Make ppls effectively homeless the stateless. To me the nazis still rule the world.\n\nIt just one nazi for another. \n\nWell, well, well.... would you be insulted if I revealed to you that I am brit South asian", "He says he \"literally does not know what to do.\" I'd believe him", "Difficult, but not impossible. My husband's parents were/are both pretty bigoted. They had been divorced for years when I met them and his father lived in a different state. So he would come to stay for a week at a time and would drive me insane. The time he tried to tell me that it wasn't the fault of indigenous Australians that they weren't successful, just the fact their brains were smaller, while I was literally studying with indigenous knowledge systems as my major, oh my fucking lord. And he then got really snarky when I said I was walking away from the conversation (argument) because I didn't want to hear it. He was following me around the room trying to bait me further. Out of nowhere my husband lost it! It is rare to see him angry, rarer to see him argue with his parents, especially his dad since we saw him so rarely, but I could hear him from the other end of our large house telling his father he was ignorant and that he didn't care what he thought but he wouldn't tolerate that behaviour in our home. And yes, my husband got laid that night. Side note - in 12 years I've helped train my awesome MIL to put aside a whole lot of her bigotry. She didn't even die when my husband's cousin left her husband for a woman.They now have a baby together. For a European Australian family they've got that bigotry well under control :)", "Difficult.\nBut necessary.\n❤️‍🩹\n\n(With the compassion of literal understanding.)", "This is all very true and OP is deserving of this empathy. But his actions still make him TA and he needs to know that the way he currently copes with his mother's behavior hurts other people.", "Also btw 70 is really not old! My white 70 year old mother is fully independent, travels overseas by herself, does handy work, loves learning about different cultures, and is not racist!", "Just because something is difficult doesn’t mean we don’t do it, especially with some self-reflection. I have no doubt it’ll be hard for OP, but he’s clearly capable of at least wanting to do the right thing because he’s here, so he shouldn’t be allowed to use the difficulty as a crutch.", ">No kid needs to be exposed to that, period. And if you can't guarantee the girlfriend a safe space, she shouldn't come over for her own sake. \n\nThis was my thought. I would think\\* knowing your boyfriend's grandmother is racist is painful enough, but if the woman comes out to make a scene that seems like it would be an extra level of aggression and pain I wouldn't want to risk. \n\nIn a perfect world, OP would boot his mother. He is being complicit in racism by not doing so. But it's also true that it seems more complex, emotionally, to make that move immediately. But it might be a good time for OP to find new care and accomodations for his mother.\n\n\\* I'm white -- so I don't know what being the target of racism feels like.", "State run nursing homes exist for this reason.", "And I can only repeat my statement - every person is different. Just like with any other abusive relationship, where if you are on the outside, you simply don't understand what the heck the victim is waiting for. Especially if kids are involved. Some people can do it easy-peasy, for some it takes time; others never get away (and sometimes it's not even for lack of trying).\nMany are either afraid, justify the situation, or both.\n\nIt is great that you could do it. OP most likely is not at that point yet (but repeating myself again, this might pretty much be the moment he should, if not must). He is probably justifying the situation to himself - that's his mother who is in need of assistance, but also a nasty racist with narcissistic tendencies (it's quite likely she knows exactly what buttons to push to keep him from \"rebelling\"). If he withdraws the invitation, or delays the date until his mother is no longer in the house, the girl won't be subjected to whatever abuse the mother would want to dish out and he'll have avoided his mother's wrath. Isn't that a win-win? Where could be the harm in that?\n\nAll the while this is causing visible and invisible cracks into his other relationships.", "There's a difference between an excuse and an explanation. I see no excuses here. I see attempts to find the explanation.\n\nOnce you can find the Why of a matter, then you can get into that matter at it's roots and deal with it. \n\nCut the heads off as many weeds as you want, they'll just sprout back and you lose. Take them out by the roots, they're gone.", "Could they get a home health aide to watch her in her own place?  Making sure an elderly relative is taken care of doesn't mean you have to do it yourself, it is perfectly reasonable to hire someone qualified.", "Well that sucks.", "I sincerely hope he had that on his bucket list and finally got to check it off.  Grandpa definitely got his pick of afterlife.", "Good. Your family took care of you!", "Can you explain how that works? Say you cut off a racist relative. How does that prevent them from being racist? How does that prevent them from spreading their racist agenda to their children? If anything, they’re more likely to get angry, dig in their heels, and spread more racism.\n\nMy experience with racism has been the opposite of what you say. By talking to my racist relatives and understanding their stories, I could point out where their racist views comes from. By continuing to have a relationship with them, I can continue to have conversations and try to steer them in the right direction. For some it has worked. For others, at least they’ve learned that it’s not an appropriate thing to talk about in public, but I still see that as a small win.", "Yes! My aunt and uncle-in-law RV everywhere, they are currently living out of it for 3 months, my parents just moved across the country because they wanted a new adventure, my aunt and uncle snowshoe and hike as much as possible - they're all in their 70's.\n\nMy great aunt finally moved into a 55 and up community with some meals served when she hit 92, and did so more to be closer to her friends than anything else. She teaches art classes and is always working on improving herself, like not being racist. \n\nOP's mom is just being a shitty, miserable, narcissist and racist.", "70 is not that old anymore. Humans are having better life expectancy than ever before. No one is exaggerating by saying 70 year old's are doing 100 pound squats and have no health issues but they are hardly (on average) living frail elderly lives.", "The girlfriend will already be traumatized by then", "Exactly! His mothers parents generation were the first to be out there meeting new people from other countries regularly. My grandmother was born in the 1920s, and she wasn't racist and had Asian friends. He is clutching at straws. His mother is a extremely ignorant and rude person, and he is being the same for defending her.", "I get that she’s not going to kick the bucket just yet, but once she’s recovered she will be out of their way and will most likely have very little interaction with the sons girlfriend after that point. \n\nI do agree that it is something that should be addressed too, the whole bloodline business is beyond messed up. But having it erupt over a family dinner is just going to creat all kinds of a mess and the sons GF is going to feel horrible because of it. \n\nOP should just wait until she’s recovered and back at her own place then sit down and have a good chat with her, doing it now is just going to foster and even more toxic home environment. It’s just not worth it for the few weeks she will be staying there, at least when she’s back at her own home they won’t have the aftermath smothering them 24/7.", "The difficulty is a handicap, not a crutch.", "OP is in an awful situation and my first thought was that he was protecting this young woman. Having a dying narcissist mother who has probably guilted OP all his life, is one tough situation I wouldn’t want to be in. If you’ve never been in this situation, understand that it is not easy and for OP, protecting the young woman is probably the best he can do. Don’t be too harsh. OP, perhaps you can alleviate the situation by having family nights out and include the girlfriend.", "Sounds like dad needs to take the family (minus grandma) and girlfriend out to eat.", "That is why we attempt to give the advice of therapy and NC. We have been there and want to help others not suffer as long as we did.\n\nA narcissist is a narcissist because a narcissist is a narcissist. This needs to be conveyed, and offering assistance to those however we can is the solution, not creating an excuse tree for them to latch onto. Inadvertently as it may be, that is what your post is doing.", "Honestly I’m not even sure if I’d be willing to spend money on that. If you’re THAT racist you’re not a part of my family… but again I’m not  OP and I’m not that kind of abused. I do have some racist members in my family and will definitely be low contact with them once I have the chance.", "I can promise she has dealt with this shit her whole life. It would be good for her to see him stand up for her though. \n\nI rarely say anything when people are racist towards me but I fucking love seeing my white husband rip someone a new asshole. It means the most.", "I'm not coming down too hard on OP, really -- on the whole, complicit in racism is a pretty common place for us well-meaning white folk to land in if we're not being conscious and proactive. Self included, to be clear.\n\nI think OP means well and is trying, and also that he probably needs to be able to see that just because he knows he's not a racist (per his post) and doesn't intend to be so, doesn't mean that he isn't in a tough spot where his actions are supporting the racist in question more. \n\nAnd I agree -- planning nights out where the girlfriend can get to know the family in a space that's safe for her would be a wonderful compromise.", "Agreed, ditch grandma and go do something fun together.", "Disagree about your last sentence. An “excuse tree” is one thing, it’s quite another to recognize that this shit is orders of magnitude harder than “just do it, just go to therapy and just do NC” as if it’s as easy as raising your arm", "If you don’t want strangers giving comments on your advice, don’t go posting your advice on the internet for strangers to comment on.", "Lmao you can comment on whatever you want mate. You’re kinda white knighting OP right now like he’s super helpless and can’t do anything because “it’s family”", "I would like to say that my original comment was \n\n> Only a heartless person would find it easy to cut out someone they loved without a second thought.\n\nAnd your reply was\n\n> Damn, guess I’m a bad heartless human who’s never loved anyone now.\n\nSo I assume you misread my original comment? I’m happy for you and the decision you made, but my point to the commenter above me is that it’s not an easy decision and shouldn’t be. It’s a very difficult and personal one that no one gets to demand of anyone else.", "This thread is now locked due to an excess of rule violations. \r\n\r\nToday's book recommendation: [How to Be an Antiracist](https://en.wikipedia.org/wiki/How_to_Be_an_Antiracist) by Ibram X. Kendi\r\n\r\n[Sub Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) ||| [\"FAQs\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)", "As a someone who's half black and has a boyfriend with a closet racist mom... YTA. \n\nIf my boyfriend ever chose his mom over me, it'd be over. It's 2023, your mom being a bigot is no excuse. Put her in a damn nursing home.", "As a black woman, with my own black daughter, your son is actually 100% correct and I'm very proud of him for standing up to his own father and grandmother. You are the asshole and are racist, at the VERY least bigoted. You're no better than people who stood around and did nothing when people were being lynched. I'm just glad your son has his own mind.", "YTA. Granny is a grown-ass woman, she can get the fuck over it.", "YTA - your house your rules. Conceding this to your mother is weak, and potentially a lost opportunity to reform a racist.", "If you have 9 people and 1 Nazi at a table, you have 10 Nazi's at a table.\n\nYou're complacent with your mothers Racism, it doesn't matter if you don't hold her views because you are still allowing her behavior.\n\nBeing old isn't an excuse, she didn't time travel, she's been here the entire time and had YEARS to alter her shitty, harmful views. She just chose not to, like ylu are choosing to protect and accept that she has them instead of standing against it.", "YTA. Say this... mom, I love you, and I want to take care of you, however, this is my home, and I do not allow racism in any form. You are not allowed to dictate who visits my home or when they visit. GF is a lovely person, and I have no problem with my son dating her and bringing her to my home. If you can't control yourself and act like an adult, then you will have to remain in your room as long as she is here. I also will not be entertaining your racist opinions or thoughts any longer. If you have a problem with this, then you can either keep it to yourself or find somewhere else to complete your rehab.", "NTA,\n\nYou are stuck in the middle of an incredibly bad situation. Family is always difficult. You could have handled it better but you are not a racist, not supporting a racist or protecting a racist. You are trying to handle a difficult mother in her final years.\n\nI would contact the GF and your son, offer an incredible night out and let her rant. Explain how much you appreciate them, explain you are ashamed of your mothers behavior and explain you hope the new GF is around long after she has passed.\n\nYou aren't a racist.\n\nIf a nursing home houses her, do they become racists? If she visits a certain doctor, does that doctor harbor racists? You are not responsible for your mothers upbringing and ideas when they are wrong. Just keep trying to do the right thing, which you are trying to do, and ignore the comments here.", "It's a complicated situation. I don't think you are the asshole, nor do I think you are racist. I think you are trying to protect your son and daughter from an extremely uncomfortable interaction, and also care for the woman who gave you life. Just because your mother has some bad beliefs does not mean that she should be immediately cast out by your entire family and left to die. That's what people don't understand. If you think that doing so will fix racism, you're choosing ignorance. In fact, that will only anger her more. If we really want to address the problem here, you have to have some tough conversations and listen and influence the right behavior and thought. You can't just say ah I don't like that and cast people out. \n\n\nOne guys anecdotal evidence of his grandpa punching a racist does not say it all, despite what the internet might tell you. Your mother did not directly say these things to her, and while what she said was not appropriate, it was not a nasty racist attack so much as a reflection of a bad set of beliefs. But you should definitely speak with your mother and that conversation should enlist the idea that if she's going to act that way, she may not be able to stay at your home.", "I kinda agree with you, but maybe he also wants to avoid/prevent his DIL getting hurt by negative remarks from his mother and maybe even a big fight between his mother and son. So it's a difficult situation.", "IF A PERSON IS A WITNESS TO ANOTHER'S INJUSTICE AND DOES NOTHING YOU ARE JUST AS BAD. IF YOU SEE SOMETHING, YOU SAY SOMETHING. YOU DON'T GO TO REDDIT LOOKING FOR CONFIRMATION. THAT IS YOUR ANSWER RIGHT THERE.", "> Hey op… your wife doesn’t agree with your son because she doesn’t get along well with your mother…. She agreed with him because he was right…\n\nGreat point, I always get lulled into this kind of arguments. (Reminds me of my abusive ex, anyone criticizing his insane treatment of others would be shrugged off with \"of course they'd agree with you, you're a woman\", or if anyone else he'd find another exception as to why nothing counts as anybody's free will and opinion.)", "If the mods remove this post, it means they disapprove of punching racists, and this approve of racism and are racist themselves.", "The mom can ask her KKK friends to watch her.", "Lmfao do you know what complacent means?  You mean to say complicit. Yes I know OP's son said it, or OP getting confused, but its funny to see someone incorrectly repeat a word just cuz they heard it. \"Its a spectacle\"", "My b didnt know i was replying to you", "YTA People like you make their kids not want to date. Not to mention how he has to constantly explain to his gf as to why. Ive broken up with people over stuff like this before. Had this or a similar experience too many times.", "That’s what I was thinking. He let her drone on for **two whole fucking hours**??? That’s a long time for anyone to rant about anything. He allowed that nonsense to continue for two hours in his own home. OP just can’t stand up to his mother in any way.", "Yes..", "Yup. If she doesn’t behave tell her to make arrangements with a SNF (skilled nursing facility). Lots of people go there short term for rehab/after surgery care", "OP is also missing that this is probably why the wife doesn't get along with his mom. Granny is an AH and Mom realized that and washed her hands like a smart woman. Wonder how fractured his family needs to get before he realizes that he's TA.", "> you might just want to warn her that your mum is a raging racist mole, and that the gf is more than welcome to bite back.\n\nAs well meaning as this is, I wouldn't advise that (am black, for the record). I'm assuming this gf is the same age as OP's son and he should not put his gf in the position of having to defend herself against her bf's old racist grandma in his parent's house. That is awkward for anyone, but especially a teenager. If grandma gets reckless, OP has to immediately step up and take care of it.", "Ah yes Germany the land famous for its individualism and no cases whatsoever if grouping people together based off of loose connections. One Nazi at a table of 10 in the US means there one Nazi and 9 other people. Not every situation is black and white.", "One thing with OP: something about his Mom being elderly because \"she's almost 70\"??? That means she's probably in her 60's. I'm 62; since when is that elderly? 🤣\n\nAnd if she has her own home, why couldn't she recover at her own home with home care services and/or family checking in? \nSeems that her narcissistic self is milking the \"family as servants\" and \"poor me, I'm an old lady\" cards.", "This is the huge problem with complacent people who think racism in elderly people is just a 'quirk'. No, it's still racism. \n\nNot at all the same, but my ornery Grandma in her 70s tried to make some decrees about my wedding. She wouldn't go if it wasn't in a Catholic church etc. I had 3 or 4 phonecalls with her trying to reason and eventually just left it with \"here are the event details, I would love it if you come, but I understand why if you don't\". She called me a few weeks later asking what the colour scheme was so she could match her dress. \n\nAgain - not the same - but you don't need to bend over for people being unreasonable just because they're old (plus OP's ma isn't even 70 yet???). That goes triple when talking about racists.\n\nOP get off your ma's tit and stand by your son and his girlfriend", "Agreed. My dad is 64 and has ALWAYS been racist but used to argue that point vigorously bc he has a black friend.\nI don’t have contact with that side of the family anymore except a couple of my younger siblings but I know a “but dad’s just old, he can’t help growing up when that behavior was more ok…..”is coming soonish and I honestly cannot wait to explain to them how stupid that it. \nBecause as the oldest, I have memories of him when he was 27 in 1985 and he was tossing around the N-word. \n1985 wasn’t the dark ages and EVERYONE already know that that was unacceptable behavior.\nIt’s not like he one day woke up and the n-word wasn’t allowed anymore. It absolutely is his fault for refusing to stop being terrible at any of a thousands moments along the way. Particularly when I, or my siblings, were begging him to stop.", "My dad was raised in the American South, in the 1940s, with live-in \"help\". In his late 60s (same age as OP's mom) I asked him if, knowing the time/place,  he would have been grossed out sharing food with his nanny (whom he WORSHIPPED to the point he almost named me after her). I fully expected him to say no. He said, at the time it would have absolutely disgusted him, and looking back he was incredibly ashamed of that. He was kind of a jerk, so if HE can evolve, I have no patience with people who say you have to give a pass to bigots because of their age/how they grew up.", "My father in law is a robust 75 and one of the most compassionate humans I know. He is interesting, generous, loving, thoughtful, politically progressive, and reflective…and also, weirdly, racist.  \n\nIt is frustrating and off-putting and incomprehensible and just so damn disappointing. We’re working on it. :(", "This chick was like 24 when Rocky came out. I don't really buy the \"they're of a certain generation\" excuse for racism. If Grandma was 100, I'd say maybe just leave her upstairs with the TV on while we have a nice family meal with son's gf. At this age, it's more \"wise up or find another place you stay\"", "My grandma is 82 and she wouldn't throw a hissy-fit like that if my boyfriend was black. \n\nAnd I really hate the excuse of \"let them bei racist/homophobic, etc. They are old, they come from a different time.\"", "Even still, she’s a guest. She can request whatever she wants, and that would be a reasonable request, but she’s a grown woman and free to leave if she doesn’t like the free housing she’s being given.", "Yup. Put her in time out if she can’t sit through one dinner", "Exactly! I feel part of OP's decision may be because he doesn't want his son's girlfriend to be subjected to her racism, but you don't solve that by keeping the girlfriend away. You solve it by telling your mum that her views are racist and disgusting and that she's not fit to be in polite company. And then ground her to her bedroom. If she complains you can always pull the \"my house, my weeks\" card. I'm sure you had that said to you as a kid, it works both ways.", "This.\n\nOP I know it's hard with a narcissist. But remember this is your house and your rules. Unless she has full on dementia, she can understand the consequences of her actions. And if you have to kick her out, THATS ON HER. They have rehab nursing homes for a reason. \n\nIf she can't hold her tongue, she can keep her counsel in her own room. Remind her as often as needed \"if you can't say something kind, don't say anything at all.\"\n\nIt's YOUR difficult job to break the cycle, and it's your turn to do the work of unlearning the shit your narcissistic mother fed you.\n\nLearn boundaries. It's not too late, and *you* need them.", "I agree with this. But what if the mother doesnt obey? Also what about trying to protect the girlfriend's feelings? I'd hate to have her over, not know if the mother is going to  act out of not and have to have the girlfriend overhear or get her feelings hurt and be embarassed if the grandmother decides to tout some racist nonsense. I do agree that it seems better in this situation to punish the grandmother - if she cant be nice and civil, then she needs to stay in her room, etc...", "And “going on 70”  is 69 years old,  that’s not old,  what the hell is this “elderly lady” shit on about?    Cyndi Lauper, Chaka Khan,  Tim Allen are 69.", "Give her a PBJ since she wants to act like a child.", "Big, if true", "I'm not saying that people don't die at 70, just that you're less likely to now.", "He may not be able to change her view, but he doesn’t have to tolerate it either.", "Thank you for this! \n\nLike yes we all want racists to stop being racist. But taking a stand against your racist relatives should not happen at the expense of a black teenage girl.", "Ah yes a Reddit moment, automatic assuming the worst of a person you don’t know", "Yeah my boss is like 72 and still at work every day. Weird how he doesn't go on 2 hour racist rants!", "So true, didn’t even take in that OP’s mom is ONLY 70. That’s in no way old enough to start excusing behaviour, I know many people that age and older who are all of sane mind.", "Perfect answer!! (and as someone who is only about 10 years away from 70 I appreciate the fact that you don’t think of your father as elderly lol)", "That time has already passed. The civil rights movement kicked off in 1954.  People in their 80s today would have been teens at the time.  If they made it through all that without learning anything, it’s deliberate.", "Seriously, if my mother was a narcissist, my wife hated her, and she was nasty. There would be no way in hell she would stay at the house. I'd be first in life to stand up for my wife and say, \"sorry mom, due to your behavior you're unwelcome in my home. We need to figure out how to get you care elsewhere.\"\n\n\nIt's the price you pay for the decisions you make.", "This is a great fucking comment. I want to emphasize the sentence you wrote that really struck out to me:”it’s one of those situations where there is no middle ground and those people that want to stay conflict free and try to please everyone will be the loser.”\n\nThat’s hella powerful. It applies to so many situations.", "OP's mother is a narcissist and probably wouldn't stay in her room. She's the kind of person who would come out just to make trouble.", "The man got up off his deathbed to go punch a racist. I now have something to aspire to.", "Also, mom is 70 and highly unlikely to change her ways. Depending on how much help she needs, OP might be better off putting her in a rehab facility.", "My mom \"kept the peace\" with her openly racist and misogynist father despite \"disagreeing\" with him and my brother \"kept the peace\" by supporting my mom and her (2nd) abusive husband (despite 10 years of never disagreeing he is abusive) because I made a vocal stink after abusive man physically harassed me three times in one day, twice in front of my mom so nobody could say I was exaggerating. My brother stood by not liking her choice in abusive men but it was her choice and I was \"disrespecting\" her choice by vocalizing MY CHOICE to not tolerate any abusive targeted at me...\n\nI have always believed their choices did not mean they were \"accepting\" someone else's choice, it meant they are ass backwards shitty enablers, which I CHOOSE to not make any space for in my life. I don't speak to any of them anymore. My grandfather just passed and I have chosen to remain silent. Do I feel bad that I haven't given her my condolences? Yes. Do I want to make any space for a mother who has chosen two abusive husbands over her child? Never again. I choose ME. \n\nAll the drama happened in my racist grandpa's house (who agreed my mom's husband was abusive but didn't want to lose her...) so it was just a whole world of \"well its his house\", \"well it's her choice\", \"well he has done stuff for the farm\". It was a complete dumpster fire of shitty people I share blood with but I believe self respect is thicker than ANY blood.\n\nI have spent a LOT of time on this subject during my year of NC and have always wondered how someone can respect a racist or misogynist choice while staying true to their values. This post confirms you can't. There is no neutral with race or gender. You either support someone else's values or you support yours. I stand by seeing no color or gender and I will NEVER accommodate anyone who does. Thank you for the free therapy session!!", "OP was clear mom is racist. OP is trying to retain family harmony. \n\nHow was I assuming the worst?", "Exactly my point.", "As a dear friend raised by a narcissist mother in a highly abusive household told me once upon a time “How you are raised can explain your behavior but it cannot excuse it.\n\nWhile it is possible to see why OP has taken his stance, it does not make it ok or not racist.", "OP is about the age I was when I finally cut off my mother and went full NC. Not for my sake directly, but because my mother's actions negatively impacted my wife. I avoided confrontation for much the same reason as OP does, similar situation, but she crossed the line.\n\nPutting up with someone like OP's mom is understandable when you are the one negatively impacted, but when someone else is being negatively impacted, you can't let yourself cave anymore.", "Really, OP should be posting looking for advice on how to handle the situation. I'm a WOC and I feel bad for him! He needs to learn how to stand up for himself and his family and that isn't easy to do. You need to be taught how, and sometimes have your hand held through it. Hopefully he can figure it out before his son loses respect for him.", "Anyone got the don't rock the boat story? About leaving the boat to be a better person or something like that? Had something to do with a family? I wish I could find it because it would fit perfectly with ops story.", "Doesn’t mean he’s not an asshole. He needs to work on boundaries. It’s never too late to start. By letting this behavior continue OP is being racist. Codependent or not, this is unacceptable. OP, YTA", "Well-said.  Adding that OP sounds like he wants to shield the son and gf from this tirade, not just because of the content of the words, but even being the target of that anger can be hurtful enough on its own...*that* feeling he knows well enough.", "And that's why he's NTA and is stuck in a shi\\*ty situation, because he's an abuse victim trying to keep his abuser calm while people who weren't ***literally raised to be her victim*** are complaining. Dude has my sympathies, he needs to lock her in her room or get her back in her own home and help her there and then he needs to have a talk with the GF to apologize. If he can. He may need outside resources that will throw his mom off her game and keep her quiet while she recalculates her stand.", "It's gonna sound a bit cruel but oh well. OP, you have probably up to like 5-15 years left with your awful, racist, narcissist mother. But waaaaay more years ahead of you with your son and wife. Are you willing to screw up nice relationship with person dearest to your heart and one you have the most time left with over a short relationship with a person who sounds awful to be around? \n\nJust either uninvite the woman from family dinners if she can't hold back her horrible behaviours or AT LEAST talk heart to heart with your son and his girlfriend about how much you care about them and how you want to spare them the awful words from your mother's mouth. Take them out for a dinner in some nice place instead if you can't even stand up against your mother in your own house.", "Because she’s a narcissist and her son was abused by her his whole life. Unless he goes through serious therapy to break free from that cycle, he will continue to be controlled by her like most abuse victims who don’t think they can leave their abusers.", "Might not be a good environment, might not be allowed to bring people to her home, there are a ton of reasons as to why they don’t go to her house. Or they do go to her house but his son would also like to bring her home to see how his siblings and parents might like her", "That's it. Take the raisins out of the potato salad!", "plenty of people died before they're 70 too. Based on the death ages of my father's side, I will 100% be very old if I'm lucky enough to reach 70", "Maybe just let the girlfriend get one good in. I’m usually against hitting old people but this one sounds like she needs it.", "Going no contact with parents is a very hard thing to do. But it’s one of the best decisions I’ve ever made. Most peaceful six years of my life so far.", "Difficult is not impossible. People do difficult things every single day.", "That was my thought. I imagine inside it wasn’t about protecting the racist so much as protecting the GF from the raging, bigoted, racist, narcissist of a mother he has. Doesn’t make it right, but if he’s been dealing with this for a lifetime I’m sure he has scars & coping mechanisms (which, again, doesn’t make it right) but the old lady isn’t gonna change now no matter what is said, and ugly people like that can cause a lot of hurt to everyone in their radius.", "Being the son of a narcissist mother myself...if I had a dime for every time I hea4d \"but she's your mother?!!\"\nThe only way to heal from having a NM is to cut them completely out of your life. It will be hard and difficult but life will be so much better with them gone.\nI wouldn't be suprised if OP's Mom was faking her condition for sympathy and attention. Mine did similar many times", "I don't think anyone is trying to say it's easy to make the choice, just that it's a simple choice. The implication is different.  \n\n\nBut OP wouldn't need to make a choice to dump her somewhere... if she's capable of attempting to force OP to bow to her prejudiced desires, then she's competent enough to make her own decisions. Simple. \"Either you treat this girl with respect, or you live elsewhere.\" Simple. If she makes the choice to be disrespectful, she's made her own choice.\n\nNo one would object to people telling OP to kick the mother out if she was punching the child and refused to stop. Just because this type of abuse includes racism and is less blatantly/physically harmful doesn't make it any different. The child has a right to feel safe/welcome in their own home. That comes first. It's a simple choice.\n\nThat doesn't mean it won't be hard, emotionally, to follow through. I was raised by a physically abusive narcissist and I KNOW it's hard to break those ties. But honestly that doesn't matter. OP is an adult, and obligated to provide a safe environment for his \\*child\\*, even if it's hard. Lots of things in life are hard. As adults we have to do the hard stuff for our children, or we're just as bad as the generation before.", "Exactly! Thank you lmao!", "😂\n\nOkay, but she once made fried chicken, collard greens and watermelon. That's it. I didn't want to say it but I was dying of laughter at just how far she took it to make a point.", "I was waiting to see this comment. Why would anyone inflict this woman on an unsuspecting kid. \n\nNTA", "There’s a world of difference between “can’t do anything” and “cut this person out of your life”. My only comments have been against kicking the person out of your life entirely. There are many things OP can try — tell grandma that she needs to stay in her room, warn GF and give her the choice to be potentially exposed to racism, or take the son and GF out to eat and leave grandma at home."]}