{"id": 7811, "submission_id": "10gssit", "title": "AITA for being “racist” to my son’s girlfriend?", "selftext": "I (39M) have a son (17 M) who recently got a girlfriend. His girlfriend is black and a very nice, kind and beautiful young lady. I have met her and invited her for dinner and family events plenty of times and she’s a joy to be around. But recently my mother has been staying with us because she  is recovering from a surgery she had and she’s going on 70 years old so she can’t do much on her own. Long story short my mother is a classic racist and being a raging narcissist and she is not one to hold back from her opinions. I showed her a photo of my son and his girlfriend and she went on a 2 hour rant about bloodlines and kept saying they “don’t look right” and when I said she was coming to dinner she said doesn’t want the girl near her because it’ll “disturb her” so last minute I told her she could not come. My son has been trying to invite his girlfriend over everyday since but I said no multiple times due to his grandmother being here and her saying she doesn’t want her near her, I just don’t want any problems. But he argues that I am being “a complacent racist” by even allowing her to be here. And even more so for not allowing her to come over to “protect a racist”. He says I should of told her to leave the moment my mother said all that stuff. But my mother is an elderly woman who can hardly make it on her own as it is. Definitely much harder after surgery. Though I don’t agree with her I can just leave her to fend for herself. I literally do not know what to do. My wife says my son is right about me being complacent but of course she’d agree because her and my mother don’t get along well. I know I am not a damned racist. But now everyone is saying I am aiding one by taking my mothers side. So AITA?", "created_utc": 1674207676, "permalink": "/r/AmItheAsshole/comments/10gssit/aita_for_being_racist_to_my_sons_girlfriend/", "score": 93, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Defending my mother for her prejudice actions and letting her stay with us\n\n2. Because she is being prejudiced to my son’s girlfriend\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Hey op… your wife doesn’t agree with your son because she doesn’t get along well with your mother…. She agreed with him because he was right… \n\nStory time; I am half black, my mother is white and my step father (I’ll call him dad)is white. While visiting my dads dying grandfather in the hospital, one of my dads uncles made some extremely racist comments. My dad started arguing with him, because well, we are his daughter and you don’t talk about this man’s daughters like that. Out of nowhere grandpa shoots up, gets out his hospital bed while his monitors are going CRAZY walks over and punches my dad’s uncle so hard he fell on his ass. Grandpa proceeded to say that he would rather die, right then and there then watch someone he loves be so incredibly raciest to such loving, kind children, grandpa kicked that uncle out the room and that man wasn’t allowed back in, and grandpa made everyone promise not to let him go to his funeral. \n\n\nOp that’s what you said your sons girlfriend is she is nice and kind, yet you are 100% allowing your mother say whatever she wants and saying your sons girlfriend isn’t allowed over because of this. This girl has done nothing and will now will remember this for a long long time. You are punishing your son and his girlfriend because your mother is racist.", "YTA. \"my mother is so elderly and feeble that she will go on *two hour* rants about how much she's a proud bigot.\"\n\nman, i never even went on a two hour squeeling when i got pokemon for the first time. your son is right, you'd rather defend your bigot mother rather than go, \"hey, shut up and get over it\"", "Definitely YTA,  sorry but protecting a racists does make you complacent and enabling this behaviour. \n\nYou have no gumption to get her to leave and 70 isn't old, she can get in home care.\n\nI would send her racist ass packing.", "I get what you were going for, but if granny is incapable of living in the present, don't let her think she's winning. \n\nInvite his girlfriend. She's very special to your son, and thus, very special to your family. Don't invite granny. \n\nYTA. You and granny, both.", "So your mother, who is in YOUR house, gets to say who can and can not come to your house because \"they will disturb her\"? \nYour son and wife is right. You are just as guilty as your mother. You are a complacent racist and enabling your mother's bigot behaviour.\n\nYour mother can stay and eat in her room. She doesn't get to dictate who comes into your house. Grow a pair.\n\nAnd if it wasn't obvious, YTA", "[removed]", "YTA. Time you grew a spine and stood up to your mother. Specially when she's incapacitated. And yes, you are aiding a racist.", "YTA. If she’s being an overt racist towards your son’s girlfriend, you really do need to put your foot down and tell your mother that she can either keep her bigotry to herself and leave the poor girl alone when she’s around the house, go sit in another room when the girl’s over if she’s unwilling to behave like a decent human, or start considering which nursing home she’d like to go into. She isn’t living in the year 1950 anymore, and if she wants to create a bunch of tension and drive a wedge into your family because she’s unwilling to let go of bigotry that’s clearly causing significant problems in the lives of you, your wife, and your son, she shouldn’t be living with your family.", "YTA for not standing up to your mother. \n\nYou're accepting her horrible behavior in YOUR house and that's just baffling to me.", "YTA. I’m half black and my mom cut out her entire family due to racist comments.", "Okay so my grandma is a couple years older than your mother, she was raised in a very conservative culture so she has some racist opinions, despite getting better with the years. When she says something out of line, we (her children and grandchildren) tell her that what she said isn’t appropriate, and why it isn’t. \n\nYou don’t really mention any mental degradation in your mother, just that she’s got no filter. I’m sorry bud but someone isn’t off the hook for racism, homophobia, sexism when they pass the senior citizen milestone. If you refuse to tell her that she’s being racist, and that you won’t tolerate these opinions in her home, instead exclude your DIL from a family event to make sure mother isnt « disturbed »… yeah that’s being complacent to racism. \n\nCus DIL isn’t going away, she’s a package deal with your son now. If there’s family reunions where your mother will be, will DIL be asked to sit it out as well? If they have children, will all the grandkids be left out too because they’ll be mixed, or will only the white passing kids be allowed because they look acceptable to your mother (and perhaps other relatives)? \n\nYTA", "YTA you’re standing by a racist just to keep the peace..? You’ll loose your son", "YTA\n\nI'm in a similar situation with our son and my MIL. She doesn't approve of my son's girlfriend and we get told to tell him to tell her to not speak about this or that subject. They politely obey but just rarely visit her and she's complaing she never sees them. We just shrug it off and say \"oh well, you make your displeasure clear, of course they're not going to turn up and pretend it's happy families, pull your head in and they might come, otherwise we don't blame them for not visiting you\"", "YTA. Your mother is clearly in the wrong, yet you are punishing your son for her comfort. \n\nI don't blame your son for lumping you in with your mother at all. How are you ever going to be able to look at your son's girlfriend without guilt, knowing that you repeatedly barred her from your home because you were catering to someone you describe as a racist and narcissist?", "> But he argues that I am being “a complacent racist” by even allowing her to be here. And even more so for not allowing her to come over to “protect a racist”.\n\nYour son is correct.", "YTA. Only racist choose racists over decent people. Your son probably lost a lot of respect for you, when you didn’t stand up to her.\nWhy is a 2h rant about bloodlines something that you allow to happen in your home?", "YTA. You are taking the easy way out and letting your mother control who is welcome in your house. By not telling her she is wrong you are condoning her behavior so by default also racist. Apologize to the sons girlfriend, let her come over, tell your other to stay in her room, shut up or get out.", "Your son & wife are right OP. If your mother has the energy to be a vile human, then she sure can cope without your help. YTA.", "YTA. You should stand up to your mother. It'd your damn house. While I get you're not going to kick her out, at least set her straight. But if the gf does visit, you might just want to warn her that your mum is a raging racist mole, and that the gf is more than welcome to bite back.", "YTA. The racist can stay in her room. Or go on an extended visit to torment another child of hers. You are choosing her over your son.", "YTA-When you protect a racist’s feelings and prioritize a racist you become a racist and an asshole. Being elderly is not an excuse to be a racist asshole.", "INFO: \nOP, are you incapable/unable to afford/find a place for your mother to go to a home? Or are you against said methods? \nWas there no other siblings able to take her in?", "YTA 70 isn’t even that old, have an honest conversation with your mum and tell her to pull her head in", "You know what they say, if you got 12 people sitting around the table and 1 of themselves racist and the other 11 are silent, you got 12 racists at a table. Yta", "Yta, lock grandma in her room while you have dinner with the gf and don’t put up with that nonsense", "YTA  - 70 isn't that old, so you really have no excuse. Not standing up to a racist is as bad as being a racist because you're allowing it to happen. SMH.", "YTA. He’s right your being complacent in her racism. You should be standing up to her like your son stood up to you. While I understand you can’t just dump her you need to tell her that she’s not going to be racist in your house. You will have whoever you want over for dinner and if she doesn’t like it she can sit in a room by herself. She’s going to obey your rules as long as she’s under your roof. If she doesn’t like it she can take her racist ass and find somewhere else to go", "Is there some reason the old mean racist can’t stay in her room while company comes over?\n\nShe’s the one who doesn’t want to mingle.\n\nWhy is your son being taught to prioritize hate?\n\nGet your house in order.\n\nYTA", "My wife is half black. My grandad can be somewhat racist at times. He’s never said a word against or to my wife in any way shape or form and has only ever treated her with love kindness and respect. He’s 94. YTA", "if she's that helpless on her own, just set her up in her room and leave her in there while the girlfriend is visiting... let her be \"grounded\" and alone while you entertain your son's gf\n\nit will show your mom that her awful opinions are not welcomed in your house... she's a narcissist, so probably won't learn anything from it, but at least you can show your family you have a spine\n\nYTA", "You listened to a \"two hour rant\", during which you did not defend your son's girlfriend or tell her that the girlfriend IS coming to dinner and if she can't behave herself like the adult she pretends to be, she can stay in her room. AND if she doesn't, and says ANYTHING offensive, you will ask her to find a rehab center that will help her during her recovery?  All you got out of that two hour rant was that your son's girlfriend should be uninvited because you wouldn't want to upset your mom.\n\nShe's almost 70. If she does not have dementia, that is not so old that she can't zip her lip and be cordial.\n\nYTA and a complacent racist. Not a \"racist\", an actual racist. You think you are just protecting the lovely girlfriend who is a joy to be around, but you are actually protecting yourself from having to take a stand with your mother.", "YTA. Your son is right, your mother is the issue, and so are you for backing her. She isn't elderly! She's in her 60s! Far too young to pretend it's normal to be racist. She's a young bigot who is able to care for herself. Send her home.", "YTA\n\nGrow a pair and stand up to your mother, She either respects your son and his girlfriend or you ask her to leave \n\nHow DARE she treat people in that way, She needs to be ostracised and taught that her behaviour will cause people to avoid her", "As a white guy with a black girlfriend I would say you're enabling your mothers racist views.", "You are defending a racist. Tf is wrong with you yeah YTA", "YTA. If your son’s girlfriend comes over and your mom says something rude, she will stick up for herself or your son will do it. You probably won’t even have to stand up to your mom. Also, you should apologize to your wife for dismissing her view as just not getting along with your mom. \n\nI’m in an interracial relationship and I’ve learned that there’s no halfway compromise between racist and not racist. I don’t envy your position, but this is where you decide what kind of person you are.", "If you have a dozen racists in your home and you do nothing about it...there are thirteen racists in your home.\n\nYTA", "YTA your son wasn't asking you to throw your rasist elderly mother out of the house and leave her alone. He just asked to not be limited by someone's rasist views. You clearly chose to side with the rasist, even if it's just because you don't want to argue with your rasist mother. But being complicit isn't much better, especially since you are a grown man who can stand up to his mother, not a child who is dependent on her.", "YTA. Tell your mother that she is a guest in your home and she needs to respect your rules. And your rules are that no one is allowed to be racist or rude to other visitors in your home. \n\nYou aren’t a minor anymore. Stand up to her.", "YTA It should be the girlfriend's decision. \n\nIf she feels she can put up with your mother's racist rants then she should come over. She might even relish shutting down a racist. \n\nYou feel like your protecting your son's girlfriend from your mother, but you're actually enabling your mother's views.", "YTA\n\nWhat you do is explain to your mother in no uncertain terms that if she says another word about this, she no longer has your support in her recovery. That should have been said 2 mins into her 2 hour rant. Instead of setting a boundary, you passively let her go on and let it impact your son. Your mother is an adult who is capable of restraining herself or living with the consequences. You are being complicit.", "YTA, your son's right.", "Info: Why can’t you stay with your mother at her place while she recovers?", "Old white ppl, look almost nice and innocent. However they did some the craziest Sh** the world will never witness, hopefully the world will never witness. \n\nI just have a feeling this sweet look old lady has done really horrible things of a similar or lesser magnitude. As poc old white ppl of this gen really terrify me as I know or have a rough idea what they did to my grandad, fore fathers and my father and my immediate family. The decade I was born in wasn't perfect either and I have some real horror stories of my own. \n\nHas anyone heard the true story, during her generation. A young white girl prolly between 9-12 saw a black boy in the grocery store.\n\nShe went home distressed, and claimed the black boy took her around the back of the store and assaulted her sexually. The black never did any of that sort. \n\n\nEventually she admitted to a nurse on her death bed, and possibly in her diary, that she was jealous that his sisters had nicer dresses than her.\n\nThe black had horrible things done to him, he was violently beaten, tortured and his genitals cut off. His families home was burnt down.", "Elderly?! My dad is 75 next year, and he walks miles every week. 70 is not elderly. You are making excuses for her.", "NTA - you’ve got good intentions but you’re not being creative enough with your solution. It’s far too late to convince your mum to change her opinion, that generation tend to be stuck in their ways. \n\nYou should think of an alternate solution, like maybe go out for dinner without your mother, and just let your son and his gf chill out away from the grandma at home, this way you are minimising any interaction with the racist grandma. She will 100% say something messed up at the dinner table, at least from my experience that’s where my relatives tend to air their controversial opinions. Either way you should definitely be letting his girlfriend visit although I think the grandmother saying something messed up is inevitable. But the best you can do is try to reduce her chances to say something out of line.", "oof you are being put in a hard position not gonna lie. You are most likely the one who has the closest connection to your mother so it is understandable that it would be harder for you but i think that you should put your foot down and explain the whole \"your house = your rules\" and \"your son's life = your son's choice in partner\" to your mother. And if she refuses to listen then you should see if there are any alternatives to her staying with you.  \nYTA for taking the easy way out of a hard situation.", "YTA it may seem like the easiest option is to not let the gf come over during this time being.(to keep the peace with your mom) But by doing so your son is right your being complacent if your mom has an issue with it send her ass packing. The fact that your setting this example to your son and his gf won’t bode well for the future. And if the gf knows I can’t say she will be very comfortable at family settings know this", "YTA\n\nWe have a german proverb: If 10 people sit at a table and there is one Nazi, there are 10 Nazis at the table.\n\nYou can apply the same to racists. If you accept racist behaviour in your house you support it. Don't be a mama's boy and stand up to her. She can always go and live somewhere else if she is going to misstreat your guests.", "So you're against racism, except when the racist is your mother? For you your Mum's racism is ok because she's old and frail. Hunni she's old & frail now, your Mum has probably spent her life terrorising every POC she's encountered and now she's doing it to your son's gf while old and frail. YTA", "You're defending a racist. Definitely YTA", "Gently YTA. Not kicking her out is one thing but telling her \"Son's girlfriend is coming over. You can either be respectful or you can wait in your room until the visit is over.\" Would be caring for your mother AND refusing to enable her racism", "YTA and a complacent racist. The moment you stand up for, defend or coddle a racist, you are a racist.\n\n&#x200B;\n\n>My wife says my son is right about me being complacent but of course she’d agree because her and my mother don’t get along well. \n\nNo, your wife is saying that not out of spite toward your mother, but because you're behaving like a racist.", "I was in two minds about this one, but I've decided on YTA. If you were doing it to protect the girlfriend from your mother's vile attitude, and were actively speaking up every time your mother pushed the rubbish she's pushing, then maybe, MAYBE, it would be a little more understandable, but you've literally bared this girl from your home so as \"not to cause problems\" for yourself. Not cool dude. Support your son and his girlfriend, tell your mother that her thinking is outdated and gross, and stop being such a coward.", "YTA - like hardcore YTA. sorry to tell you but you and your moms relationship is in all likelihood going to end before you and your sons, but your actions here will go a long way to making sure you wind up losing both. \n\nI’m assuming your son is aware of the fact your mom’s a racist prick, so he’s bringing his black girlfriend over despite that and they’re likely ready for the bullshit, as best as they’re able. \n\nYou not wanting to deal with the conflict is a sign that yeah, you’re taking the racists side, which makes you a racist in this instance. Let’s take this to the next logical step: imagine saying: “sorry son, you can’t bring your black girlfriend here because your grandmother is a member of the Klu Klux Klan” you wouldn’t wonder if you’re racist, and that’s how this sounds.\n\nIf you, your wife, your son, and your sons girlfriend are all on the same page, then your mom has the options to shut the fuck up, or stay in her room through the evening, or just leave your home. \n\nOr you can take your racist mom’s side and keep proceeding as you are,", "I'm going to agree with your son. You may feel you aren't a racist, but you are coddling one at the expense of your son. Yeah, the surgery has been tough on your mom. YTA.", "YTA. I don’t think you are personally a racist, but you’re 100% enabling & pandering to one. By pushing your son’s GF away you are demonstrating that your racist mother’s views are more important than your relationship with your son’s partner.\n\nI get that she’s old and that she’s your mum, so you don’t want to abandon her. But at the end of the day she’s a really, really shitty person and you shouldn’t be enabling that.", "YTA since your letting a racist set the rules. You say your mother can't make it on her own because of old age and a recent surgery? Than make it clear to her that either she go home and fend for herself or she stays on as a GUEST and stop dictating who you or your family have over for company.", "let's see, your choice is to let your son be with her gf, a nice girl for your own post, or keep your racist, narccisist ungratfull mom calm? yep, you are an enabler, grow a spine and tell to shut up or get to a home.", "YTA. stop enabling your mothers racism.", "YTA, grow a spine and tell your mom to deal with it, it's 2023", "ESH why is your son so eager to expose his girlfriend to a racist’s abuse? I dont care about grandma’s feelings but if her stay is temporary, why ask the girlfriend to be around someone who is toxic in that way? I hope son is not trying to use his girlfriend to prove a point to his family or something. The girlfriend’s safety and well being should be primary in this situation.", "YTA you tell mummy dearest its your house and sbe can keep such comments to herself or be put into a care home you are being a racist by bending to your mother's racism and basically banning his gf who has done nothing wrong but is just black", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (39M) have a son (17 M) who recently got a girlfriend. His girlfriend is black and a very nice, kind and beautiful young lady. I have met her and invited her for dinner and family events plenty of times and she’s a joy to be around. But recently my mother has been staying with us because she  is recovering from a surgery she had and she’s going on 70 years old so she can’t do much on her own. Long story short my mother is a classic racist and being a raging narcissist and she is not one to hold back from her opinions. I showed her a photo of my son and his girlfriend and she went on a 2 hour rant about bloodlines and kept saying they “don’t look right” and when I said she was coming to dinner she said doesn’t want the girl near her because it’ll “disturb her” so last minute I told her she could not come. My son has been trying to invite his girlfriend over everyday since but I said no multiple times due to his grandmother being here and her saying she doesn’t want her near her, I just don’t want any problems. But he argues that I am being “a complacent racist” by even allowing her to be here. And even more so for not allowing her to come over to “protect a racist”. He says I should of told her to leave the moment my mother said all that stuff. But my mother is an elderly woman who can hardly make it on her own as it is. Definitely much harder after surgery. Though I don’t agree with her I can just leave her to fend for herself. I literally do not know what to do. My wife says my son is right about me being complacent but of course she’d agree because her and my mother don’t get along well. I know I am not a damned racist. But now everyone is saying I am aiding one by taking my mothers side. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA Your house tell mommy to take a hike if she is that uncomfortable.", "“why don’t my children talk to me anymore?” gee i wonder why!!!! because YTA", "I think you could have talked with the girlfriend and son in a better way. Explain the situation and ask if they’re still comfortable coming over. Not tell them they can’t because not they might feel like you’d rather hang out with a racist.  \n\nI’d love to see gf put your racist mom in her place. And if I were you I’d tell your mom she’s a racist every time she says something racist as well, let her know it’s not acceptable in your house. It’s time to step up and be a better ally. If mom doesn’t like it she’s the asshole.", "YTA. In the conflict between a racist and a victim of racism, you sided with the racist.", "YTA,\n\nI understand this a difficult situation and you don't wanna boot your mother out, but no one is too old to recognise that racism is wrong. You shouldn't simply make excuses that she's too old to be a decent person and bar your son and his gf because she can't stop being racist.\n\nMummy dearest might be  uncomfortable but it's the 21st century, she's going to have to get over it at some point or at least learn to behave herself in the company of BIPOC people. \n\nYou are in fact supporting a racist's feelings over your son and his gf's feelings, pretty much the definition of complicit racism. You might not be racist but supporting one is nearly as bad.", "YTA. your son's gonna remember this and it might be a reason why he goes LC or even NC in the future. i agree with him here - grandma should've been told hit the bricks after those remarks.", "Put her in a home", "Yta. You may not be saying all the racist stuff, but you are protecting your mom from what? Being in the same house as a interracial couple? You didn't even let the gf know about her boyfriends racist ass grandma and let her choose if she wanted to still come over. Grow a spine and stick up for her to your mom.", "No one is saying you should dump your mother on the roadside and leave her to live on the street. But you are also being a coddling doormat and enabler of extremely racist behaviour.\n\nYou can speak to your mother, make clear her racist bigotry is not acceptable and will not be tolerated. Right now you are sitting back as she spews bile and twiddle your thumbs. Instead of banning your son's girlfriend from the house to comfort a racist, find another work around.\n\nYour wife and son are right, you are being a complacent enabler of a racist, mother or not.\n\nYTA", "Get some third party help... \n\nYta\n\nBoth your wife and son are right... You are enabling this.", ">I know I am not a damned racist.\n\nWell you're pretty accommodating to people who are. YTA", "When you're asked to side with a racist or a person of colour and you side with the racist, that puts you on the side of the racists. I get that you say this doesn't 'make' you racist, but practically the distinction is negligible.\n\nIf the racist and the person of colour can't be in the same room, you tell the racist not to be in the room - not cater to the racist and perpetuate both the attitude and the problem. Not saying you put your mother in a home or kick her out, just tell her that if she's not going to get over it then she's not welcome at dinner. May cause a few problems in the home but, hey, at least you can confidently say that you didn't side with the racists.\n\nYTA. But I think you knew that, deep down.", "In germany we have a saying along the lines of \n\n\"If theres 10 people sitting at the table and a nazi joins them than you have 11 nazis sitting at the table\" \n\nJust insert racist instead of nazi, it's the same situation. You are complicit in your mothers racism, you say you don't agree with her but you accept it even though you have no reason to. And no, she's my mother doesn't fly in a situation such as those, she is the one that needs help, either she shuts up or she can leave (and that's allready generous) everything beyond that you are in fact supporting her racism.", "ESH. Neither you or your son seem to care about how his gf might feel about being around your racist mother. It’s not about what bothers your mother but how comfortable or uncomfortable your son’s girlfriend will feel. If she chooses to come over, will you and your son stand up to your racist mother or will you lock her and her racist views away to protect the gf? As the POC, the girlfriend is the only person who matters here.", "Racist: get out of the pool!\n\nYou: okay well you better get out of the pool to keep the peace I don't want any problems.\n\nClearer?\n\nYTA", "If you lie down with dogs, you wake up with fleas. You're racist and YTA. Stop sheltering a bigot and making excuses.", "Yta. \"Shut the F up and stop being a racist mom.\" It's not hard", "Had plenty to say after reading this, but it hasn’t even been 30mins and everyone has beat me to it. YTA.", "You are barring a black woman from your house because she is black.\n\nThat is racist.\n\nIt doesn't matter if you are being racist to please a racist.\n\nYTA", "YTA- Complacency is a huge factor in the perpetuation of racism. \"Silence is violence.\" There is no excuse.", "Tbh esh. I was waiting for the part where OP said he was trying to protect the girlfriend from the racist grandmother. But that never happened.", "YTA and beyond complacent. Complicit.", "YTR", "NTA. In any other situation your son would be correct, but it's not like you can just leave your mother to die, so I don't see how you have any other option.\n\nThis is one of those \"screwed no matter what you do\" kind of situations. \n\nUnless you put your mother in \"time-out\" for a bit. Depending on how mobile she is, you could just wheel her into another room for a couple of hours to keep her out of the way while your son's girlfriend visits. Out of sight, out of mind. Put Jerry Springer or something on.", "YTA but ignore all the people trying to dogpile and call you a racist, they're off their meds or something.\n\nRemind your mother that it is your house, and if she wants to continue having grandson in her life as well as you and wife then she needs to keep her mouth shut and behave.\n\nBut no, trying to juggle the demands of a racist mother and your wife and son doesn't automatically make you a racist.\n\nAnyone commenting such should be ashamed", "NTA not like you have a nursing home to shove your mother in, and not like you can hire a babysitter for her.  I see a lot of people saying YTA but your not letting his GF get surprised by unpleasantries. By his behavior I think things would get ugly if their paths were to cross. Older people.can be stubborn and you can scold them till your face is blue but they're set. But defending her is an AH move, never defend a racists actions. Treat her as what she is, the problem.", "Unpopular opinion, but leaning towards ESH.\n\nNot trying to defend OP but Maybe OP was protecting girlfriend from the harsh mother? Or maybe OP grew up in a traditional household where parents are upheld and “to be respected” at all times? OP should talk to his mom about the situation, that times have changed. Son should not be quick to judge/accuse. If this is the first time dad is encountering girlfriend, sure, he’s TA here and probably a racist too, but if they’ve spent time on more than a few occasion, son should’ve at least thought “why the sudden change in attitude” and why is son so adamant on bringing her over everyday? My next question is, what is the girlfriend’s take in all these too? Does she really want to come visit or it’s just son’s decision to bring her over.", "This is where generational difference starts. People here talk how vile the grandmother is. But people forget. Back in her day its normal to be racist. You cant change years and years of mind conditioning just like that. Your mom's old. She will expire sooner or later. Why cause more problems by forcing her to change? Better to just make them dodge each other. No argument. No hurtful words exchanged. Done.\n\nThis is coming from a non white person.", "NTA.\nThe hardcore lefty's on here cannot understand.\nYou are in such a difficult position. Your mother brought you into the world, you're obviously not going to kick her out!\nYou're trying to protect everyone.\nWhat about everyone going out for a meal and leaving your mother at home?", "ESH Your heart is in the right place for your mom and you cannot leave her to fend for yourself. But you need to also understand that your mom's beliefs and thoughts cannot decide what you and your wife want in your house. You need to have a conversation with your mom where you need to basically need to tell her that the girlfriend is a part of your lives and she has to behave around her, otherwise you will be forced to find other arrangements for her. Try to make her see you are serious af. Tell her times are changing and she doesn't have to interact with the girlfriend but she cannot be rude too. She can choose to stay in her room when she's over since she has the problem.\n\nYou're stuck between your mom and family so I get it. But you will have to side with the future here, instead of the past.", "NTA", "YTA. You're basically telling your son that you value your racist mother over his girlfriend. You may think you're protecting her (gf) but you're not.", "NTA. I think you could def stand up to your mom but it’s not like you’re keeping your sons gf away because you don’t like the fact she’s black, and in all honesty, right now it’s not SAFE for your sons girlfriend to be in your home due to your mothers behavior. I think you’re protecting your sons girlfriend and I’m sorry other people don’t see it that way. No reason to have her in your house when there’s actively someone who will belittle her and hurt her, I think it’s a good idea to wait until your mother is out of your house.", "YTA, invite the GF over, spoil her with the best cooking you can make. Make her feel special.\n\nAs for the OldBat upstairs, give her porridge and gruel until she learns how to behave. \n\nShe doesnt have to be present. She could also go home and pay someone to look after her.", "YTA and yes complacent is the exact correct descriptive word for your actions. Or \"enabler.\" Your mother is staying with you because she cannot care for herself, fine. That does not mean she is the new head of the household and gets to call all the shots. \n\nShe's uncomfortable being around a black girl? She can stay in her room. She in NO way shape or form gets to dictate who comes over or meddle in your son's relationship.\n\nImagine for a second what your son's girlfriend feels like when she's told over and over again she can't come over, whether or not she's told why. If you want to alienate your son, keep it up. Because he is going to (rightly) support her feelings on this.", "I don’t think you’re necessarily an asshole for not wanting her over, bringing a child into that situation wouldn’t be the right thing to do. she’s around 17 i’m assuming, and going over to her boyfriends house just to be verbally assaulted by his grandmother isn’t something she needs to experience. However YWBTA and a BIG one if you continue to enable your mother and let her run the show. your son should never have to worry or not be allowed to bring someone over for this reason. you need to grow a spine and explain to your mother that you won’t tolerate her racism. you need to do this for your son.", "YTA. You are the company you keep. The company you keep is a racist so therefore…", "YTA You are being complicit in your mother’s racism.", "OP.  Please go and talk immediately to your son and his girlfriend.  Explain that you are caring for an elderly person who is very racist but who you have a duty to look after while they recover.  Apologies for not explaining why you tried to keep her away and explain that you didn't want the wonderful and kind girlfriend to be exposed to this aweful person and that you were embarrassed.  Ask for forgiveness and understanding. Emphasise that you do not in any manner share these horrid attitudes but feel a responsibility to assist this elderly person temporarily and was trying to protect the girlfriend.  Assure them both that should they wish to visit while your mother is there that you will be on their team and try and shut your mother down.  Good luck!", "YTA, let the old racists fend for herself. Why does she deserve to be treated with kindness and respect when she’s in the wrong and being racist. Your wife and son are both right and don’t think your son is going to forget this treatment when he’s 18 and wants nothing more to do with you. You should tell your mother to shut up and keep her racist opinions to herself you’re family are welcome to have any visitors they want in their own home and if she doesn’t like it she can leave!", "Your son comes from a generation that actually practices be the change you want to see. \n\nYour mom is old and was raised to be a racist,  apparently.  Lots of people were I guess.  \n\nYou're stuck in the middle and you chose the side of protecting racism.  Well intentioned or not,  you excluded someone coming to your home based on he color or their skin. \n\nLet me say this again:\n\n*You have excluded someone from entering your home based on the color of their skin.*\n\nYou're not protecting your mother,  The Racist,  you're enabling her. You are enabling racism.  It is alive and well in your house. \n\n*You are enabling a racist.  Racism is alive and well in your home*\n\nYour actions are racist.  Whether you like it or not,  you are allowing racism to infect you and you are showing racist actions by allowing your racist mother to dictate who is allowed in your home. \n\nTime for Granny to grow the fuck up. \n\nShe was born into a world that was racist and enabled it.  The world is changing.  Granny isn't,  but whether she likes it or not,  her grandson isn't a racist like her - seems like it stopped at you or gran. But,  Granny The Racist is living with you, in the modern world with your son,  who isn't a racist. Who dates whom he wants without apparently being racist. \n\nThe optics here for you aren't good.  Put Granny in time out.  She doesn't want to change,  okay.  But racists don't get to come out and play to spread their hate onto unsuspecting people,  especially vulnerable ones. Allow her to make the choice.  It's your house.  She doesn't get to use racism to control what you do in your house. She can play nice or she can get a time out. There's no in between. \n\n\nThe choice is yours.  You can either be a role model for your son,  support him and advocate for him or you can keep enabling Granny and acting on her racist views. \n\nYTA", "YTA. If your son is so adamant about inviting her persistently then let her come over, whether this will make your mom upset. Let them meet and see what happens after that your son and girlfriend will decide if they want to keep being in the same place as the granny or distance themselves cause your moms reaction can push her grandson away", "Dude what… YTA. Your son is absolutely right.", "YTA\n\nYou’re son is right. You’re putting your mother’s racist views ahead of common decency. You’re complicit.", "Invite the girl, the first word your mother says tell her she can be excused to her room. she can get mad but if she needs help she won’t leave. i don’t think you’re protecting her i see the conflict because you have to help her, but can’t back her up bc she is racist. it’s tough. you really should invite the girl no matter what though.", "NTA. Your old mother is unfortunately racist, that will not change at her age. You can't just kick her out. However I would not keep the girlfriend out of the house. In your place, I would talk to your sons girlfriend, explain, apologise and \"warn\" about your mother's opinions. She can decide herself if she wants to visit then. If it upsets your mother that's her own problem.", "Okay. As someone who has been on the receiving end of racism by a partners grandparent, your first mistake is trying to appease your mother by not making HER uncomfortable. The only way you can tackle this is to confront it. Regardless of how old she is, being racists is wrong and a disgusting mindset. No one should be enabling her, both your son and wife are right. You are being complacent. Let your Son’s girlfriend come over and make her uncomfortable. That is step one to tacking the issue instead of burying her head in the sand. So what she is old. She should know better then. I’m sure your Son and wife will stand up to her when she is outwardly racist to his girlfriend. If she’s anything like me she will handle it herself. This happened to me, and don’t worry I stood up to the racist old bat and she backed off. Also 70 really isn’t that old. Stop enabling her!\n\nYTA… obviously.", "YTA\n\nYou excluded a person of colour from your home because you wanted a quiet life with your racist resident\n\nYou chose convenience over morals", "Sounds like grammy isn’t invited to dinner that night. Seriously I understand your point as this is exactly my grandmother but bad behavior means no fun for you. She knows she is not invited because such behavior will not be tolerated. She’s taken care of and she won’t die but she’s also not allowed to participate if she can’t play nice. If she needs to be treated like a child to behave then so be it.", "YTA; your mother can get civil or get out, and shielding a racist is itself a racist act. Be better for your son. If your mother can’t be civil she can stay in her room.", "I see a lot of comments saying not to “protect” the feelings of the grandmother, which is of course true, but I feel like OP is protecting the girlfriend. It’s not fair to expose her to that. So OP either has to kick the grandma out, not have the girlfriend over, or maybe be honest with the girlfriend about the situation and let her decide if she still wants to come over. If she does, tell grandma she can’t come to dinner or she needs to behave.", "Why do you harbour a racist in your house? She needs to go. YTA.", "YTA. a racist one, too", "YTA. I am not going to comment on whether your mother is well enough or young enough to go home and take care of herself - let’s take as a given that you do need to care for her. Still you can tell her that if she cannot be polite to sons GF when she comes over, that she will need to stay in her room / another part of the house. My mom is almost 80 and is struggling with the fact that her oldest granddaughter (my niece) has come out as gay and has bought a house with her GF. I made it clear when she shared her views with me that she is entitled to believe what she wants but that she needs to decide whether she wants to be at least outwardly accepting and still be included in all family events or express her views and be excluded. She chose to be included. I know her views have not changed, but I hope maybe they will someday. In the meantime, we at least have pleasant gatherings.", "A person I’m taking care of, in my home, going on a TWO HOUR RACIST RANT? Nah man. When my parents say racist shit - even accidentally - I fucking correct them. Immediately. And I explain why it’s not okay. If they ever fought me on it I would quite literally put my foot down. If you do not shut that trash behaviour down you are complacent in the racism, period. Parents don’t get a pass just because they’re parents or old or disabled. YTA.", "YTA sorry my man but you are being a complacent racist and you are protecting a racist. But standing by and not holding your mother accountable you are passively condoning her actions and you are enabling, you are now complicit in her racism.\n\nYou picked a bitter racist woman over your own son and that's appalling. You need to do better.", "YTA.\n\nYou’re choosing the side of a racist and every time you refuse the engage with your son’s gf, you’re enabling racism within your own family.\n\nYou may technically be a racist yourself, but right now it’s a pretty fine distinction. \n\nAnd If you don’t start standing up to your mother now and actually supporting your son’s relationship, then I can’t see you ever having a positive relationship with him after this.", "YWNBTA  \nYou are in an awful situation and I think it's really easy to say \"your house, your rules\", but the reality is you feel responsible for your mother who is old and I completely get that. She definitely should respect your son's girlfriend, for me, she's the asshole.   \nI think you should invite your son's girlfriend, and tell your mom that she is coming. If your mom is not happy with that she can leave the house or stay in her bedroom (it sounds really childish)   \nHope it will get better soon, hopefully, she will meet the girlfriend and see how nice she is, she can still change her mind :)", "“We must always take sides. Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented.” -Elie Wiesel, Nobel laureate and Shoah survivor", "YTA, and your son is absolutely right. If your mother is sick and can't care for herself, all the more reason for you to tell her that her racist behavior is unacceptable and will not be tolerated if she wants to be a guest in your house, she can go to a rehab facility instead. The more needy someone is, the LESS their poor behavior should be tolerated when you're going out of your way to do THEM a favor, not more, why are you reversing this dynamic? Your son and his gf doesn't need her negativity, your wife doesn't and  you don't.", "YTA and a racist apologist. Tell your mom to shut up or find somewhere else to stay.", "YTA Your mother being sick and old is not an excuse to be racist. By letting a racist be a racist you're contributing to the problem. If people think it's extreme that you would kick your mother out for such behavior perhaps those people can take care of her then instead.", "YTA. Actions speak louder than words; you have the words of a non-racist and the actions of a racist.", "EHS.", "You by denying your sons girlfriend to come have dinner or visit are taking the side of the grandmothers, you may not have a racist thought in your head but you are giving the grandmother (the actual racist) what she wants. You are the asshole here.\n\nI think you know what you need to do to make this right but as of right now you are favouring the quiet and less confrontational route of pleasing a racist rather than defending your son and his girlfriend. Don't be that guy.", "Your Grandfather was one hell of a man!  OP, read this over and over and over. THIS says it all.", "Your story brought tears to my eyes! What a beautiful example of a person sticking up for someone they love and saying no to racism and hate (I mean, I don’t usually condone violence but if there was ever a more appropriate time…) This man literally rose from his death bed to show everyone that he would not take such horrid behaviour. I am really glad you have such caring people in your life. I hope OP takes heed of all these comments and acts accordingly in future.", "gaw damn ! respect! may he rest in peace.", "Your grandpa was the best kind of badass!", "Also if you feel you can't kick your mother out, you need to tell her to stay in her room/out of the girlfriend's way when she's around, you need to put the consequences of your mother's racism back on your mother not onto your son and his girlfriend as you currently are. That's what is making you complicit in your mother's racism, is that you're not giving your mother any consequences for it", "They're talking about this woman like she's in her late eighties, not someone approaching 70 🤔", "Also people act like the minute you become a senior citizen, you’re incapable of being accountable for your actions and words", "This! And you let her spew racist Bs for two hours?Your house, your rules. You owe your son and his gf huge apologies and you must tell your mom stfu. \n\nShut that shit down. If she cannot zip it, she should not stay there. She should not be at dinner. \n\nWouldn’t it be a learning experience if you had a spine? You have messed up. Act now.", "Also, why can’t OP go stay with his mother at her house?", "Or she could eat in her room alone until she learns how to behave around guests. If OP insists that she can't be responsible for her actions, he should treat her as a big racist baby she is", "Granny is apparently living with OP while she recovers from surgery.\n\nIf she's fit enough to go on rants about her racist views, she's fit enough to be told to STFU.", "Okay. I snorted at that one.", "I’d agree but take a visit to justno and see that racist old white biddies aren’t really people you can reason with or tell what to do. They just go about making your life a living hell and you either chuck them out of your life for good or you find the path of least resistance. \n\nIn this case, OP still loves his mother, so he chose the path of least resistance. Keeping the gf from being attacked by a racist while keeping peace with the racist is the best he can do. \n\nYes I’m aware racists are horrible awful disgusting people. But I’m also aware it’s incredibly difficult to toss your elderly, physically disabled mother out of your life, no matter how wrong she is.", "My dad will say some Facebook meme level political shit while I’m sitting with him in my patio and I just get up and walk back in the house lmao", "If Granny is so unabashed and outspokenly racist, do you really trust her to stay away and keep her mouth shut?  I wouldn’t want to risk OP’s son’s gf to hear any of the terrible things GramGram might say. \n\nJust take Op’s son and his gf out to dinner or something and leave the old bat behind.", "The woman isn't even elderly! She's in her 60s.", "Took the words right out of my mouth", "That is the most asinine mentality that I see people parroting on a regular basis. Actively doing a terrible thing is always going to be significantly worse than passively observing a terrible thing.  \n\nYou will always have more responsibility for your own actions than you will for other people’s actions.", "Yeah and at least the best OP can do is own up to be defending a racist.", "I agree. But would add that he may actually be defending his mother from having her indefensible views taken down by the son's GF who is probably more than capable of putting mother in her place..", "Sadly this story is one of many. Many horrible things were inflicted on a black people in her generation as you put it. There are also many horrible things that have happed to black people in our lifetime and are happening right now.", "Everyone act in this sub like that racist mother would suddenly become the best BLM member, beacuse her son said so. Feel good moments are not something what should be at the expense of the black woman. If that stay is temporary, OP should apologise to the son's girlfriend, but nothing more is needed.", "Exactly like why is the son trying to invite this poor girl over when he KNOWS his grandmother is a racist and going to say something, idk why OP is letting his grandmother stay with them when even she doesn’t like her, but like in all honesty it is for the best that she doesn’t come over and get subjected to that racist woman’s rants.", "All of these people are far too young to be of the 'to be respected' mindset. The mother in question is in her 60s, the father making his kids girlfriend stay away will be 40 tops. They're just unpleasant people.", "Not really. If Grandma is 60 now, means she's \"young\" enough to not be a batshit crazy racist unless it was bred in the family.", "Nothing to do with 'hardcore leftys'. His mother is racist, he is allowing her to express those views in his house. \n\nSo what if she gave birth to him? It doesn't mean he has to tolerate her racist behaviour. He doesn't need to protect a racist. It's not a difficult position for anyone who is against racism.", "How", "Oh definitely, grandpa was fantastic, unfortunately within a day or so after grandpa was gone, but I can tell you who definitely wasn’t allowed to step foot at his funeral.", "Not even making an attempt is the issue here.", "How is this the best he can do? He can still tell her mother that her racist views are not accepted in his house and that she either shuts up and deals with it or she can stay in her room when the sons GF is visiting.", "I wouldn’t normally consider her elderly either. I was simply using the term OP used.", "“No, you don’t understand, I didn’t kill a baby! I just sat back watching quietly while doing absolutely nothing to intervene while someone else killed a baby in front of me!”", "Allowing bad actions, specially in your own home IS your responsibility as a human being.", "It not only black ppl the British did a lot to South Asians... The list goes on.", "Yes! Exactly my thoughts! If everyone knows this is how the grandmother is why would he want her around his gf. Who would be an innocent victim here. She doesn’t deserve that.", "But he’s not. He wants OP to stand up to racist GMA and either demand she be nice or she leaves. This is precisely why my mom warned me about interracial relationships though. She always said sure they may not be racist but what about grandma?", "On the contrary, everyone should be respected, regardless of age", "What a note to leave on, though! Amazing.", "If someone doesn’t want to stop the murderer for fear of getting murdered themselves, then that would be not nearly as bad as actually killing the baby. \n\nTry harder.", "You want to say you have some accountability for that? Fine. But if you are literally doing something bad, then you have 100% accountable for your actions.", "Yeah, fuck that baby. I’m not lifting a finger to help some crying little shit. If I see some little brat getting snuffed, I ain’t saying shit, I ain’t callin’ no 911, I ain’t goin’ for no help, *absolutely nothing,* that little shit can save itself 🔥💯 \n\nI bear *zero* responsibility watching that little shit die", "So your argument is that the mom is afraid Grandma is going to call her a slur?\n\nBro, you were just wrong, relax not everything is Jr debate club.", "This is such a weird point for you to be arguing lol", "I already said the passive person would bear some responsibility further up this comment chain lol. But there is a objective difference between being fully responsible for a bad thing and being partially responsible for a bad thing.", "Why do you think someone so brazenly racist wouldn’t call some POC a slur, especially if they are vocally against that specific POC being in a relationship with a member of their own family?", "Your argument was that someone might not stop the murder of a baby for fear of being hurt.\n\nThe father should tell the mother to behave herself or GTFO.\n\nFear of being called a slur isn't an issue for him.", "That was a hypothetical scenario someone else came up with that i just went along with to prove my point.\n\nIn the context of situation in this post, I would be afraid if granny calling the girlfriend a slur if OP were to invite the girlfriend over for dinner at the house. That sounds like a reasonably possible outcome. \n\nI think OP should just take everyone out to eat at a restaurant or something while leaving Granny alone in the house by herself.", "it is a hypothetical about this situation.  \n\nImagine this granny was trying to murder a baby.  Clearly no threat to OP.  Should he watch?\n\nOutside that, OP is banning his son's girlfriend from her house because he is black.\n\nThat's just racist before you even get to anything about allowing a bad act", "It isn’t a hypothetical about this situation lol, no one is murdering any babies in this scenario. If anything, OP is keeping the baby (the girlfriend) away from the murderer (granny) so that no murder can take place. \n\nOP isn’t banning anyone, he had the girlfriend over for dinner before. He just doesn’t want to put her in a bad situation by having her and his mother in the same place."]}