{"id": 7927, "submission_id": "10hz9d1", "title": "AITA for not doing my “fair share” of the house work?", "selftext": "My husband (32M) and I (31F) have a 5 year old daughter and a 2 year old son. My husband is a police officer, and works 1st shift (which is 2am to 2pm), he averages about 70 hours a week. \n\nI also work (as an account/sales manager for a pest control company), but my hours are more normalized, and I have more flexibility in my day. As a result, I am almost entirely responsible for taking care of our kids. I take them to and from daycare, I take care of them at home, I bathe, feed, clothe, and entertain them. They see him maybe an hour a day, and sometimes on the weekends if I have to work, he’ll watch them. \n\nOur house is extremely cluttered, I keep on top of it as much as I can, but my son is extremely attached to me and follows me everywhere. He’s a 32-pound 2-year-old who gets into everything, so it’s hard to tidy up while also make sure he’s not, for example, busting down the baby gate. \n\nLast night, my husband had just finished working a 16-hour shift, he walked in the door  and was visibly annoyed. Within 10 minutes, he started doing dishes (no dishwasher atm). I asked him what was wrong, and he said, “It’s very difficult living with someone who just doesn’t care about their living space.” \n\nAfter I fired back that it’s hard to juggle everything, and he has the luxury of not worrying about the kids on a daily basis, he said, “you need to stop being so lazy and do better.” \n\nI’m still angry, as much as I want to stay on top of everything, but I am so drained. My husband also isn’t the neatest person ever, I clean up a lot of his messes.", "created_utc": 1674329107, "permalink": "/r/AmItheAsshole/comments/10hz9d1/aita_for_not_doing_my_fair_share_of_the_house_work/", "score": 38, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I need to do more, so maybe he’s right. I need to suck it up and just get it taken care of.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nYou should switch roles with him for a full weekday day, the next time he has time off. You go out with friends, or visit family. Leave him with the house and the kids for a full day. And not on a weekend.\n\nHe'll stop complaining then. \n\nEdit: you're doing more than just housework, too— you're raising _his_ children practically single-handedly. He needs to grow up.", "NTA.\n\n>He said \"you need to stop being lazy and do better.\"\n\nYou work a job on top of doing all the house work and child care...and he calls you lazy? Let him try doing all the child care and house work if he thinks you are \"lazy\"", "NTA. I understand he has a stressful job that takes up the majority of his time but you’re essentially a single parent. Aside from the dishes he did when he walked in, has he assisted at all with any other household chores? To include his laundry? \n\nYour laundry and laundry for two children takes up a lot of time and energy. Especially when you have a child who’s incredibly attached to you. \n\nBut he may have had an especially rough day at work, especially in his career field. I’d talk to him about this tomorrow and figure out a better system or at minimum make it clear that it’s unacceptable to talk like that especially since he doesn’t know how much work you put in every day.", "NTA. “Cleaning the house while the kids are still growing is like shoveling the driveway while it’s still snowing”. You’re doing your best, and he’s stressed. Try to find a babysitter so you two can get some quiet time together to talk through what’s going on and come to an understanding before it gets worse.", "NTA. You do the best you can with what time you have. Has he considered using his OT money to pay for a house cleaner so it's up to his standards?", "NTA he needs to police his comments better", "Somehow arrange a week long work trip See how he manages even a tenth of the work you do!\n\nNTA", "I am appalled by so many of these responses. \n\nOP works 60ish hours a week in a job. She also parents nearly 100% of the time, she also cleans what she can and cooks for the family. She's working constantly to be able to do all that. \n\nHusband works 1 70 hour per week job and calls her lazy for house not being to his standards. \n\nMeanwhile, part of why they can't afford for her to quit her job (which I wouldn't suggest except OP said in a comment she would like to) is because husband bought an expensive truck he didn't need. \n\nNTA \n\nI hope you don't take to heart any comment blaming you here because this is NOT on you. I'd seriously recommend reading  (or listening on audio book - I know time is hard to find) Fair play and fed up. \n\nI also would recommend following diary of an honest mom (Libby ward) on Instagram. Her husband is also a shift worker and she has a lot of good content about sharing the load of parenting and house hold and how she helped her husband see her needs and how much she was managing alone.", "NTA\n\nThis is a tough situation. Husband works 70 hours a week, sometime 16 hour days. Coming home to a house that is turned upside down is disheartening and gets old fast. What's he working for if his family is living in squalor?\n\nYou are working full time and taking care of actual human beings who can't care for themselves. You clearly don't have the time or energy to keep everything looking shipshape in addition to a full time job. You don't deserve to be called lazy and told to work it out. \n\nSomething has to give but until you are both willing to sit down and have a meaningful conversation, nothing is going to change. You'll both just be trapped in a pressure cooker that's boiling away until something bad happens.\n\nWhat you need is extra help in the form of a nanny or cleaning service to help manage the house. Or you need to be a stay at home mom to keep the house according to his expectations, if that's something you're even interested in.", "NTA. You are essentially working several full time jobs at once. An account/sales manager is a full time job. A nanny is a full time job. A maid is a full time job. An in home chef is a full time job. If he really doesn't like it, he can employ someone to take over one of the many full time jobs you currently do. I understand he is stressed by long hours in a stressful job, but you are juggling a lot, and he needs to fully understand that.", "Read [THIS](https://www.theguardian.com/world/2017/may/26/gender-wars-household-chores-comic) and see if it applies. Most married women with children do MORE housework when married than not.", "NTA, especially if you’re picking up after him AND 2 toddlers. he’s TA for that comment, but it seems like you’re both overworked", ">“It’s very difficult living with someone who just doesn’t care about their living space.”\n\nHim trying to tell you how you feel is an unfair way to fight.\n\n>“you need to stop being so lazy and do better.”\n\nHe's right. You need a better husband.\n\nAfter leaving you alone with the kids for many hours, the best he can hope for is that everyone is healthy, safe, and fed. Anything beyond that (like a clean house) is a nice-to-have.\n\nDoes his spend his 2 or 3 days off every week doing laundry, cooking, and cleaning, while watching your children? If so, he's Superman. If not, he's a sexist AH.", "NTA. you are doing more than a fair share of work. It is literally impossible to stay on top of housework with a toddler because everything you do, they undo in moments. You can have the house sparkling 20 minutes before husband gets home, and the baby will trash it in 5. Sysiphus has a better gig. You're doing that with work outside the home, too. And my husband, who also enjoys a tidy house, doubles my tidying when he is home. I appreciate your husband must be frustrated, but you aren't the problem. The situation is hard. I don't know what the solution is, and if you figure it out, please tell me! But the problem isn't you.", "NTA - suggest that you stop doing any housework for a week so he can see what it actually looks like if did nothing.", "NTA.  Both parents working full time kind of sucks for being able to clean as much as one would want.  Even one kid is enough for me to never have enough time to clean and do what I want to do.", "NTA. It’s easy to see someone else’s life as easy. While I’m sure your husband is stressed because of his long hours, it’s unfair and unkind for him to lash out at you that way. Taking care of children is exhausting, especially when you do it day in and day out.", "NTA. Tell him that after you finish work, and presumably have grocery shopped, fulfilled appointments, bought clothes and shoes for growing kids, etc.  you will do meal prep, cook, wash up, do laundry, clean and tidy up if he is happy for you to put the 5 year old in front of a screen between school and bedtime, and the 2 year old in a high chair till you are finished.  Because the only way you can run a clean and tidy house while keeping on top of laundry and food and working full time is if you neglect young kids. I think you need to leave him solely in charge of the kids for just one day and let him see.", "NTA. You're doing more than your fair share, in that you're working full time like he is, taking care of 2 young kids for more than an hour a day which he is *not*, & cleaning however much of the house you can as you have time to do it. Maybe you should make him a fun spreadsheet showing exactly how much time you spend every day doing exactly what tasks, since he seems not to understand that child care is a job in itself, as is housekeeping.", "NTA but the harshness of his words makes me think this is not the first time he has complained about it. So rather than continue to let this fester, have a practical problem solving conversation, one where he understands he can’t talk like that. \n\nIs the issue that things are not clean, that there is clutter because things aren’t put away, or the latter plus you have too much stuff? Can both of you take a day off, give the kids to a friend or babysitter, and try to get the house to a clean slate with the mess? Then, devise a plan to keep some sense of reasonable order that you are both responsible for.", "NAH- You both just need some help. \n\nI was going to rip your husband a new one until I caught the part about his 16 hour shifts and 70 hour work-week. He’s literally not there, and you are doing everything in the home on your own plus working. \n\nI don’t think either of you gets the intensity and workload of the other. (Although calling you lazy seems uncalled for.) \n\nHas he spent a full day or two parenting your kids without you? Does he understand the tornado of mess these kids are at this age? Does he understand what your daily schedule look like? If not- I suggest he prioritize spending more time with your kids. He’s really missing out on the best time in their childhood. \n\nDo you know the types of cases he works with all day? Is it possible he is dealing with too many high stress situations in these shifts and he’s being an AH because he’s bringing his frustrations home? \n\nCouples counseling now may be an really good way to handle some of this now before you get to a place of completely disconnecting to each other.", "Someone coming in 1 or 2x a week for a few hours would be a solution. 16 hr day, coming home to a dirty house would be frustrating, and you are probably not thrilled with it either.", "NTA. I suggest listening to the Mom Room Podcast. She totally gets it. Women are so often the default parent and studies have shown how much more housework women typically do. You need to sit down with your husband and talk about division of household responsibilities and how you are feeling. A counselor may be helpful to help you both mediate this hurdle. \n\nI get that he has a tough job. Not questioning that in the least. I’m also in the field (on the legal side), so I see first hand how much of a toll being law enforcement can take on a person. That does not excuse him from his role as a parent and partner. It should not all default to you and he SUCKS for basically making it sound like you do nothing. You both need to understand expectations for the other person and divide the job of being a parent. You had these kids together and they are BOTH of your responsibility, as is the housework. Good luck!", "Sounds like your husband is the lazy one and should probably work harder to get on a better shift so he can parent and take care of your house too... NTA.", "ESH.  \nAs a married and working mother, I can relate. However, when I become overwhelmed (let's face it, you could work 149 hrs a week and a mom is still going to be the default parent) I talk to my husband about needing extra help around the house. I don't point fingers or lay blame or talk about how much extra is forced on my plate. I just point out \"Hey, ... this is a lot. I need more help at home.\" and it usually ends up that I get more help at home.  \n\n\nI hope you guys can have a conversation without talking about what's fair and who does what and who is entitled to not do what...  \nYou're both parents, you both live there, and you're both working. You both need to take care of your kids and your home.", "Sounds like he has something else going on.", "ESH \"he has the luxury of not worrying about the kids\" really?\n\n\"You need to stop being so lazy\" not\n\nYou two need to find a way to work it out.", "NTA you are doing your fair share. If it’s not up to his standards - he can hire a maid.", "NTA, wife is sahm while I work full time. I watch the kids alot during my days off and the house isn't all cleaned up from the daily \"mess\" until supper time, as there is no point. Expecting that at 2pm is ridiculous, and I would never expect my wife to that standard. Taking care of kids is not an easy job and he needs to realise that. If someone is busy cleaning all day and working on the side it just means the kids are not getting any attention.", "NTA  for the chores thing. Your husband is being extremely inconsiderate and rude.\n\nHowever, YTA for being married to a cop and expecting them to be anything other than a jerk.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband (32M) and I (31F) have a 5 year old daughter and a 2 year old son. My husband is a police officer, and works 1st shift (which is 2am to 2pm), he averages about 70 hours a week. \n\nI also work (as an account/sales manager for a pest control company), but my hours are more normalized, and I have more flexibility in my day. As a result, I am almost entirely responsible for taking care of our kids. I take them to and from daycare, I take care of them at home, I bathe, feed, clothe, and entertain them. They see him maybe an hour a day, and sometimes on the weekends if I have to work, he’ll watch them. \n\nOur house is extremely cluttered, I keep on top of it as much as I can, but my son is extremely attached to me and follows me everywhere. He’s a 32-pound 2-year-old who gets into everything, so it’s hard to tidy up while also make sure he’s not, for example, busting down the baby gate. \n\nLast night, my husband had just finished working a 16-hour shift, he walked in the door  and was visibly annoyed. Within 10 minutes, he started doing dishes (no dishwasher atm). I asked him what was wrong, and he said, “It’s very difficult living with someone who just doesn’t care about their living space.” \n\nAfter I fired back that it’s hard to juggle everything, and he has the luxury of not worrying about the kids on a daily basis, he said, “you need to stop being so lazy and do better.” \n\nI’m still angry, as much as I want to stay on top of everything, but I am so drained. My husband also isn’t the neatest person ever, I clean up a lot of his messes.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. The one who isn’t doing their fair share is your husband. Given his tantrum over dishes, does he take care of any chore at all? Or are you expected to work, take care of the children AND maintain a spotless house?", "NTA - you need to leave him with the kids for a week. Let’s see how much he gets done", "NTA but based on your comments he is. You work, do all the parenting and most of the housework. Would your life be easier without him in your house?\n\nEither way this situation needs some type of counseling", "NTA. clearly you have your hands full. if he’s so annoyed by the state of the house, he can pick up some supplies and clean it himself. you both work and you take care of the kids. there obviously needs to be some more balance here.", "You are working a full day, taking care of children and are doing all of the housework?  \nNTA", "Your husband is the asshole.", "NTA. You're paying for his fuck up. It's his fault bills are so high you can't be a SAHM with his dumb decision to buy an expensive truck when he had a perfectly good paid off car beforehand, *he* can figure it out. Maybe some of those 70+ hrs a week can be used to splash the cash on a maid service or nanny instead of working you to the bone so he can go bone his colleague, gamble money away that could be spent on a maid or nanny or play ungodly amounts of video games like a preteen boy. You have 3 kids, OP.", "NTA sounds like he still thinks that he is single. Have you sat down and talked to him about helping out more around the house, less hanging out with his buddie? Also keep an eye on the female coworker as I’m sorry to say that cops have a very high rate of cheating.  Not saying he is but he gets to hang out with her at work, once he is off the clock he should be spending time dating you, playing with his children and helping out around the house.", "[deleted]", "Look up minimalism and decluttering.  Just start getting rid of stuff.", "INFO: why is the house so cluttered, are you hoarders? If so, who is the hoarder of the two of you or do you both do it?", "NTA - he should take a couple of weeks off and see what it’s like to be in your shoes. If he’s clueless, but teachable, he’ll figure it out and you’ll be able to figure out a way forward that works for both of you.", "NAH. It sounds like you’re both working very hard inside and outside the home. Any chance you could get some help to get the house organized and decluttered? I’d imagine two kids those ages are difficult and draining and maybe someone could come in and help streamline things? Maybe you have some things you could get rid of or store away out of your immediate area?\n\nGood luck and it sounds like you’re both tired, Not assholes!", "I mean, you asked and he answered. His follow up was obviously not that polite, but", ">You should switch roles with him for a full weekday day, the next time he has time off. You go out with friends, or visit family. \n\nAnd not just for a day. Three days. A week if possible.", "love this idea. I dont have kids and can't imagine the madness of watching two kids.", "I don't see any information that says he doesn't do some amount of chores around the house. Or that he leaves her to do stuff and goes out with friends instead. Is there an additional post beyond the op?", "We did have a housekeeper, the dude broke our lawnmower trying to fix it (after we told him not to) and he never paid for it. We also live in a rural area, housekeepers are few and far between.", "I can’t tell you how much it means to hear that. I go to Reddit for unbiased opinions and help. Thank you for the resources, too!!\n\nI’m sending positive love vibes your way ❤️💕", "I would love to be a SAHM, but we can’t afford it. Our household bills are $6k a month before daycare. \nThis is partially his fault, though. He bought a $70k truck last year (which I’m still annoyed over) his payment is $800 a month.. he had a paid off vehicle before that.", "I love this idea. Years ago, I heard my dad say something similar to my mom and this is what she did. Their house has all white tile, so the difference was immediately noticeable. By the way, he chose the tile even though she pointed out it was a terrible idea and would require so much work to keep clean. After a day of it not being swept twice per day and moped at least once, the floor was disgusting. He asked what happened with the floor and my mom said, well this is what it looks like if I don't clean, since you accused me of not cleaning, I decided to show you what that actually looks like. He was so apologetic and it actually got him to do more around the house.", "He took them 1 day last week. When I came home, the living room was a wreck, but the dishes were done 😂😂. He may have done it while my son was taking his 3 hour nap because he was up all night screaming (guess who was up with him).", "If this house is cleaned, it will single-handedly be my doing. \n\nWe’ve had several days off together where my mom has taken our kids for the weekend. He sits on his ass for hours and plays video games. All he does is the dishes, and he runs a few loads of laundry. \n\nI’m off today, with No kids, and I’m cleaning my ass off. I’ve squared away most of the shit I haven’t been able to get to for a few days.", "I was thinking something was off with his hours. My dad was a cop and 1st shift was like 6am.  And if worked over night he went in at 6pm.", "Yeah, this is my take too. They need to communicate openly and kindly to work through it.", "“Luxury” isn’t the word I used, he doesn’t have the added responsibility of getting 2 little kids ready for the day, or being home alone with them for 5 hours, or getting them ready for bed. “Luxury” was a word I used for the sake of word-counting.", "This is pretty much where I stand tbh. OP also mentioned that when he does have time at home to help he sits on his ass and plays video games, hangs out with his coworkers playing poker, and also bought a super expensive new truck (with an $800 a month car payment) when he already had a paid off car. Why would anyone marry and have kids with such a stupid, immature AH??? This guy is never going to change and OP might as well get a divorce. It isn’t like anything would change anyway except incomes.", "This isn't anything to boast about. You're perpetuating an outdated misogynist model of relationships where the wife services all the husband's needs, then tearing down another woman who's struggling. Well go you for being a footsoldier of the patriarchy, but the rest of the world has moved on.", "It’s actually closer to 60 hours a week, I work 2 Saturdays a month, and my weekday hours are 7am to 5pm. I have a four-hour travel radius for my territory. \n\nI think the big difference here is that my husband does very little to help with anything. His garage is a disaster. We have $5k worth of rotting vehicles that his family left behind in our backyard that he refuses to do anything about. I shovel the driveway when it snows, I fix the plumbing when it breaks, so on and so forth. \n\nI can appreciate the judgement, I just think you’re comparing slightly different situations.", "Wow. You are something else. Apparently you are a perfect, saint. 🙄", "We’re not hoarders. Idk if you have kids, but they come with a lot of stuff…", "I'm childfree and took care of my nephew and his half sister who were under 4 years old for 4 months during a crisis and nearly lost my mind with the amount of stuff they could wreck in under 5 minutes. It isn't that they were bad or destructive kids, it is that watching a child that young is a full time job.", "I took care of six growing up (basically filling in for our mom). Let's just say I'm curious to see how this will go for him.", "He does very little to help around the house. He hangs out with a coworker who lives down the street at least 4 or 5 times a month (female coworker, but I don’t think anything is going on). He plays poker, he plays hours of video games…that about sums it up. He still does a lot of his own shit and lives his life like he’s single. \nI don’t do any of those things. The last time I went out on my own was on Halloween.", "The going out was meant for OP to imitate the husband being out of the house for the whole day. Nobody said that the husband doesn't do anything, the switch of the roles was to show him what it means to care for 2 young kids all day.", "That should be part of the discussion. His attitude is unacceptable. He's treating you like the bang maid incubator. At some point you're going to start thinking about if this situation is really working for you or if you're in a no win situation. Lots of women in these situations wait until both kids are school age and hit the road. Whatever you earn plus child support should be enough and you'd have one less person to clean up after.", "Whoa. \nHe used his wants to overrule the family’s needs. \n\n$800 a month on a vehicle HE drives? And had a fully paid for vehicle beforehand?\n\nHe needed to be 100% responsible for most of the day to day cleaning after that decision to make it up to the family.\n\nSo sorry this is your husband.", "I have changed my view slightly with this additional info. He is choosing to live Way beyond your means so he should expect to have some things  slip.", "Holy Batman that’s a huuuge financial commitment that benefits no one but himself. Sounds like you’ve got a lot of decisions to make and hopefully, couples therapy in your future. He’s missing out on so much of your kids lives right now and putting an unfair burden on you.\n\nOn the lighter side, to help with the clutter and insane pressure to keep the house clean: start getting rid of stuff. I was in a slightly similar situation (ie the majority of childcare, home care, working and being blamed for a messy house/being lazy) and after a lot of work I’m our relationship we decided we needed to remove a bulk of the shit that made it hard to keep on top of the house. Our three kids kept the toys they love and play with the most and everything else went. We did an initial sweep of the whole house and put everything on our front lawn as a “free garage sale” the kids loved watching other kids pick out their old toys and it was such a relief to see it all go away. People will take free shit that they wouldn’t otherwise buy on a garage sale and I had no patience for selling things online. It needed to go fast. It’s still a work in progress but it’s much easier to tidy the living room when there’s only a few things to pick up instead of an entire toy store 😆", "I think it’s the way to go because it puts the husband’s theory to the test. It’s amazing what happens when assumptions and assertions met facts.", "That’s so shitty of him. I’ve got to think a help out or shut the STFU conversation is in the future. Or, it should be.", "They’re on mandatory minimum 12’s due to staffing shortages. Shifts for ST’s are 2am-2pm, 6am-6pm, and 2pm-2am.", "Why did you have kids? Sounds like you resent living that life.", "Misogynist model of relationships?\nWife servicing all her husbands needs?\nFoot soldier of the patriarchy? \n\nYour ignorance and judgement from my comment is down right gross. \n\nBy the way…if you saw my response to OP I wasn’t tearing her down. She omitted key facts in her original post. \n\nYou need to check your misplaced judgement at the door.", "OP I totally respect that. Believe me I’m NOT judging another working mom, but in all fairness that’s now how you described your situation in your original post. \n\nI understand 60+ hours. It’s hard as hell! It’s exhausting.  (I’m sure 70 hrs from 2am - 2 pm is beyond hard)\n\nTell hubby he is 100% responsible for his garage and give him a deadline to get it under control and to check his attitude at the door until the garage is done.", "Let me guess Data Girl…you’re a judgmental AH??", "Well if it's just the usual level of stuff you'd expect with kids then I imagine he's taking out other frustrations on you. The state of the house was just an easy target. NTA but if this becomes a regular thing he might want to use his EAP to get some professional help.", "Yeah that sounds really lopsided and s*****. I'm sure his job is stressful and long hours aren't easy but it sounds like he expects you to be all of the domestic chores on top of having your own full-time job. NTA he sucks", "Ok. It’s just a weird shift time overall.  I have worked 12 hour shifts in hospitals and other places. And I never seen it that’s makes a life nearly impossible.", "I adore my children, this has nothing to do with them. They’re little and they’re exhausting to keep up with by myself. \n\nI’m one of 5 kids, both my parents were home every night, and my mom worked part-time for 10 years. I always had both parents around up until I was 16, when my dad died. Both my parents contributed to maintaining the house, and it clearly made a huge difference in their relationship and keeping the house clean.", ">Believe me I’m NOT judging another working mom\n\nThat is EXACTLY what you did. You assumed that she works less hours than you and that her husband actually gets things done around the house. You belittled her situation by saying she has one less kid. Your entire judgement was based on \"I CAN DO EVEN MORE THAN YOU, SO YOU ARE OBVIOUSLY WRONG!\" \n\nEven after OP pointed out that all of your assumptions were incorrect,  you didn't edit your judgement.", "It sounds like you're not happy at how much time your husband works, and that he doesn't give you much help with the kids. Have you talked explicitly about that part?", "Yeah, he told me he would happily switch places with me. Over the past week, been much better about helping with the kiddos after I made it very clear to him that I need more help there. I guess he took that as his opportunity to get up on his high horse."]}