{"id": 7973, "submission_id": "10ibttl", "title": "AITA for getting a co-worker I’ve had beef with fired for doing something I regularly turn a blind eye to?", "selftext": "I (23M) work in an office and in a fairly small team that I’ve been with since the company’s inception, which means I am one of the more knowledgeable employees at the company. About 5 months ago we hired a new employee (F40 or so) who seemed okay to begin with but became incredibly defensive very quickly and wouldn’t handle constructive criticism at all.\n\nI wasn’t her direct supervisor but I was her superior in terms of position and actual capability but she would very often undermine me at work. I can definitely admit this evokes an emotional response out of me since it’s happened twice before at previous jobs; I am quite young compared to other people in the company but I am very experienced having started in the industry at a young age, and some people do not like being told or advised what to do by someone 10-15 years younger.\n\nShe blew up at me a couple of times over some constructive criticism or even just advice and then half-apologised when we ran into each other on a night out. She said she “didn’t like to upset little boys” and that was the end of any respect I had for her. I am not a very confrontational person so I said nothing at the time.\n\nHowever an opportunity presented itself a few weeks later when she left work 10 minutes early without permission and left evidence of it as well. I indirectly reported it to my Head of department and they had a big shouting match that ended in her getting terminated. There were other behavioural problems that definitely had her on a shaky footing to begin with but if I had said nothing she’d still be working at the company.\n\nI have on occasion done the exact same thing as she did and have watched coworkers do it and said nothing. Did I let my emotions/ego get the better of me?", "created_utc": 1674364637, "permalink": "/r/AmItheAsshole/comments/10ibttl/aita_for_getting_a_coworker_ive_had_beef_with/", "score": 319, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I let emotion cloud my judgement and got an employee fired for something I have done and my coworkers have done, without me ever saying anything about it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH - Honestly you were petty. Yes.\n\nHowever, she was an ass. And definitely already on very thin ice when it came to her being fired over leaivng 10 minutes early. Honestly there's no way they'd fire her like that unless there was already a problem. This was just the last straw.\n\nIf I may leave some advice for your future:\n\n1. do not \"remind her\" that you're the more knowledgeable person... your manager should be doing this. Demand your manager handles her appropriately, and reminds her that she needs to play ball with you or others in the team. The manager should instruct her to seek your advice if you feel she's been ignoring you. I've been on the receiving end of that talk in the past. Always better from the manager than peer.\n\n2.  Don't do this petty shit. Either management takes care of it or not. It is a reflection of management if she does this shit.\n\n3. Consider why she reacted that way to criticism from you. Maybe you also had a hand in the problem. Always good to self-criticize a bit.", "I don't have a strong opinion either way, but you may have shot yourself in the foot, because it's highly unlikely nobody will find out who said what to who that led to the termination. So that great benefit that you used to have? Maybe you don't have it now.\n\nAnd really, 10 minutes more or less means nothing to anybody.", "Really surprised I haven't seen any ESH. Her comment is clearly demeaning and unprofessional, and it's frustrating to work with someone who is not open to feedback. It sounds like you were in a position where it is appropriate to give it and I do agree it sounds like she was uncomfortable taking criticism from someone younger than her. But is reporting her for a minor issue you yourself have done an AH move? Honestly yeah. She should have been fired or not fired on the merits of her work. This is sorta petty shit and on the flip side of what you said, as a person in a position of power and influence, you have a responsibility imo to be fair. If there's an issue with her work ethic (which includes her ability to take feedback and accountability), that's the conversation that should been had with her. Also maybe you all have a very different work culture but leaving ten minutes early is such a small thing to fire someone over and sorta controlling on the part of the company.", "INFO: at what age did you start \"in your industry\"?", "YTA. You weren't her supervisor, but you were trying to give her constructive criticism. It doesn't sound like she was trying to undermine you. It sounds like she got irritated at what she perceived to be you trying to undermine her. It also sounds like she had every reason to believe it was fine for her to leave a little early, since you and everyone else were doing it and she had done it in the past with no consequences. You reported her because you didn't like her, not because she did anything wrong. YTA.", "YTA - reporting someone (admittedly out of spite) for something you regularly do, is a major AH move.", "I’m going to go with YTA because you reported her for something which you yourself do sometimes to get revenge. That’s an asshole thing to do.", "ESH\n\nLook, I get it. I have a problem coworker as well. It sucks. But I think you   \ncrossed the line for turning her in for something you do yourself. It's   \nnot exactly wrong, but it's a dick move and you know it. That said, she   \ngot herself fired. She clearly has bad boundaries and lacks   \nprofessionalism. Probably she would have gotten herself fired without   \nyou being a hypocrite about it.", "YTA for reporting her on something that you let others slide on (including yourself) but she got herself fired.", "Yta", "Wait.. so you reported her for leaving early but so do other employees and yourself? All because she challenges your aUtHoRiTy?\n\nYTA and a lousy \"superior\". Report yourself and everyone else who has done this.", "A supervisor who is vindictive is all sorts of AH.", "You reported her for leaving 10 mins early without permission because you disliked her. That directly caused that confrontation and her being fired. Now, you have to report yourself and the colleagues you like every time you left early. \nRemember what goes around comes around.", "NTA. She wasn’t fired because she left 10 minutes early. She was fired because she has a history of behavioural problems and compounded them with shouting.", "YTA. If she's rude or insubordinate to you then report her for that. Don't pick some issue that's blatantly petty and bullshit because everyone knows you don't care about that. If you're young in your field and want to be taken more seriously then you need to be more mature. Bosses like you only breed conflict and drama in the workplace. Be honest, be direct but polite. And ffs if you have an issue with someone then deal with it, not wait until something petty like 10 mins whatever. I guarantee your other coworkers lost respect for you over this whether they admit it or not. You're not in high school anymore.", "NTA. Your management was probably looking for any excuse to fire her.", ">I wasn’t her direct supervisor\n\nThen you didn't need to give her advice\n\n>She blew up at me a couple of times over some constructive criticism\n\nMaybe she didn't want your advice?  And as you were not her supervisor she didn't have to listen\n\n>she would very often undermine me at work.\n\nOr maybe she had her own ideas or you didn't like that she knew something you didn't\n\nIdk, you come across as a butthurt because she didn't conform to what you wanted, so you eliminated your competition.  What are you going to do with the next new hire?\n\nYTA", "Yta. \"An opportunity presented itself\". It certainly did and you took it.", "NTA.  She got herself fired for yelling at her supervisor while already being on shaky ground.  \n\nIf you were a woman and she was a dude people would be tripping over themselves in here to white knight you.", "Yta. Did you stick out your tongue as she left?", "It's laughable how bad the people in the comments would be in navigating a coporate/office space.", "For Fork sake YTA,  a workplace bully.\n\nToxic to the core and I cannot believe you believe your own hype.\n\nI wonder whether all the other problems were also your indirect comments to management.", "YTA. And an upset little boy who should grow up.", "NTA Her little boy comment was incredibly condescending and wrong in many ways. Good riddance.", "YTA you sound like you have a giant chip on your shoulder. I cannot imagine she actually called you a little boy either.", "YTA \n\nShe called you a little boy. Okay. Now what? \n\nMove on. Honestly, first world problems. We’re going through a recession, rent is incredibly and unrealistically high, groceries are high, nobody has stable transportation, healthcare is high as it’s always been and yeah. You don’t know what that lady has to take care of. If she said something discriminatory I’d understand, but her leaving 10 minutes early is so minuscule. \n\nYou should’ve minded your business. Im 22 and a male close in age like you, but your reaction was a very little boy thing to do. You tattled for no reason. If someone called me a little boy i would not care especially if im ahead of them in terms of employment.", "I think a lot of times young people don't realize how hard it is for older people to have to be \"under\" you. They might even perceive it as humiliating. You may know more about the job but in my experience, some younger supervisors I've had haven't been very mature, some have been downright childish. Others have been good. Doing your job is one thing, managing people, especially older ones, is another. You can't try to micromanage them. You need to go out of your way to be a support source for them. In this situation, afraid YTA. But live and learn.", "YTA. C’mon, you even admitted you did the same thing she did. That’s 💯 AH behavior. I wanted to side with you at first, but the vibe coming off of this is not favorable. If an employee fails because they don’t accept criticism that’s on them, but you’re also a total AH if you keep trying to offer constructive criticism when they don’t want it from YOU. You weren’t her supervisor, you knew she didn’t want advice from you. And yet you kept pushing and interfering with her work. And got her fired for something not even related to the quality of her work.", "NTA - She left early.  Not your fault she left early. And not your fault you just \"coincidentally\" said something.  She can take her ageism elsewhere, where her ego can have its own office.", "YTA. Your \"constructive criticism\" sounds an awful lot like \"mansplaining\".", "YTA. And yes, you let your emotion and ego get the best of you.", "YTA 100% here. I am a young person who just started in the legal field, ya know where only boomers work. Never once has anyone been “intimidated” by my good work or constructive criticism. I would be willing to bet your criticism was unwarranted and not very constructive. Additionally, was she on shaky grounds because of actual behavioral problems, or was she on shaky grounds because you and the manager are butt buddies and you don’t like her? \n\nYou are only 23 and have stated you already had 3 jobs. Absolutely no way you have THAT much seniority. Grow up little boy.", "NTA\n\nWeird sexist/ageist vibes from this washed-up Oasis fan. The fact that she called you a little boy gives you a pass. Had she not dehumanized you in her half-hearted apology I would have said that you are an asshole for reporting her. But if she wants to treat you like a child, it’s ok to behave childishly.", "ESH - She sucks for not respecting your experience and position of leadership.  You suck for the hypocrisy of reporting her for something you admittedly do yourself and excuse in other people in her work unit regularly.  You should duck because karma will likely be coming around any minute now.", "NTA You didn't get her fired, she did it to herself by getting into a shouting match with the head of her department. No one gets fired for leaving 10 minutes early when others do it too unless they have a history of causing trouble.", "Nta.\nFor her to get fired, well, she was on a loose threas. Maybe she should be such a b***", "Yes YTA but also it sounds like she deserved it so I wouldn’t feel too bad\n\nESH I guess", "You're an asshole, but management wouldn't have fired her for that unless they were already regretting hiring her.", "NTA she couldn’t handle someone your age being a higher level and it showed in her words to you and her attitude.  Then she wanted to show her butt when called out for stuff and that’s what got her fired.", "Not sure how serious your company takes it when somebody leaves early, or if she was salaried/exempt, etc. Do you think *you* would be fired if you were reported for leaving work early? If no, then soft NTA, because her boss had other reasons to fire her and all you did was speed up the process. If you  think you would be fired for leaving early, then YTA because you are turning somebody in for something you and others do without repercussion.\n\nHowever, if you had reported her for being disrespectful to you, then you would clearly be NTA. The biggest issue here is that you didn't report her for the issue you should have reported her for.", "Yeah, you know YTA. That was a dick move. Was it the wrong move in this situation? I don't know. It sounds like you don't feel bad about it at all though. Still, keep this one to yourself, you don't come out of it looking very good.", "YTA.", "Slight YTA because you got her in trouble for doing something you and others do. You did that because you didn't like her (with good reason), not because you thought it was the right thing to do, otherwise you'd report everyone. \n\nBut you didn't get her fired. It would have come to a different end if your boss didn't have other reasons to can her.", "NTA.  She wasn't terminated because you reported her.  She was terminated for the argument with the department head.  Trust me, the early departure was just a footnote.  Her behavior was culturally destructive to the firm.  If she was undermining you to try to look good, she was doing it to others as well.", "YTA and a hypocrite.  You say this coworker gets defensive quickly, but you yourself admit the same with your 'emotional responses'.  An experienced Team Leader would not find opportunities to get people fired.  You may have been working in that industry for a long time, but longevity does make you an experienced leader of people.", "YTA. Proud of yourself? You acted like the little boy she accused you being. Karma a bitch!", "YTA! That’s illegal! Yes, you didn’t like each other! But, it’s work not play. I hope she sees this post and sues your ass!!", "NTA.  She couldn't do the work.  Simple.  As a worker you need to listen to your senior- she couldn't due to her chip (on her shoulder). Her having a shouting match instead of apologizing to HR for skipping time just cemented that she should be fired..", "NTA. She didn't have permission to leave early, got in a shouting match with the head of the department when confronted, and already had (likely documented) behavioral issues.  She lost the job all on her own. Unless you work in a very strict office, leaving 10 minutes early one day will not get you fired. It was how she reacted to the conversation with the department head that got her fired.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (23M) work in an office and in a fairly small team that I’ve been with since the company’s inception, which means I am one of the more knowledgeable employees at the company. About 5 months ago we hired a new employee (F40 or so) who seemed okay to begin with but became incredibly defensive very quickly and wouldn’t handle constructive criticism at all.\n\nI wasn’t her direct supervisor but I was her superior in terms of position and actual capability but she would very often undermine me at work. I can definitely admit this evokes an emotional response out of me since it’s happened twice before at previous jobs; I am quite young compared to other people in the company but I am very experienced having started in the industry at a young age, and some people do not like being told or advised what to do by someone 10-15 years younger.\n\nShe blew up at me a couple of times over some constructive criticism or even just advice and then half-apologised when we ran into each other on a night out. She said she “didn’t like to upset little boys” and that was the end of any respect I had for her. I am not a very confrontational person so I said nothing at the time.\n\nHowever an opportunity presented itself a few weeks later when she left work 10 minutes early without permission and left evidence of it as well. I indirectly reported it to my Head of department and they had a big shouting match that ended in her getting terminated. There were other behavioural problems that definitely had her on a shaky footing to begin with but if I had said nothing she’d still be working at the company.\n\nI have on occasion done the exact same thing as she did and have watched coworkers do it and said nothing. Did I let my emotions/ego get the better of me?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "Is anyone else getting the same sort of vibes as this BORU from a while back? Same sort of attitude and so much else!\n\nhttps://www.reddit.com/r/BestofRedditorUpdates/comments/xcs0gp/askamanager\\_is\\_the\\_work\\_environment\\_ive\\_created/", "I'm going to say ESH because if she would have just stayed cool in that meeting she probably would still have her job but you can't get into a screaming match with your boss... You shouldn't have reported her because it sounds like everyone does it... I would have just stopped trying to help her if she got mad at you for it.. Seems like you were a little pushy because if someone got mad at me for trying to help them I would immediately stop with my input.", "NTA - totally a play stupid games, win stupid prizes situation. But be warned, Karma…", "Why didn't you report her for the massive disrespect and other behaviour problems?\n\nOn its face YTA because you're hypocrite, but I doubt they fired her for going 10 minutes earlier", "YTA. Your only motivation is revenge which shows you to be petty and childish. She didn’t even do anything that bad to you", "NTA. She fucked around and found out. Karma a bitch.", "NTA\n\n&#x200B;\n\nBecause it was just the reason you used because it made it possible to do so without repercussions. \n\n&#x200B;\n\nShe sounds like a bad employee.", "Rarely am at odds with the comments, but honestly, everything I've read from the OP doesn't sound all that bad. You could probably develop better leadership skills, but you're definitely NTA.  If it's something that people regularly due then management knows it and also turns a blind eye. If one incident was enough to get her booted it was just the excuse to get her out. She must have be awful on multiple levels. She likely needed constant critiques to make sure she wasn't cutting corners and hated being called out. It's totally fair in skilled careers for equals to call each other out and even in basic jobs. If you aren't pulling your weight either step up or step out... I'd have probably made moves to remove her from my team sooner.", "NTA\nYou did it right. \nShe fucked around und found out.\nInsulted you and got the prize. \nMy hero!", "YTA.\n\nIf she deserves to be fired,  get her fired.   Not liking her because she doesn't bow to your ego isn't deserving \n\nYou've likely made her life very difficult now.   She'll have to find another job AND explain why she got fired, which will make the process longer.   If she's living paycheck to paycheck, bills start piling up, and that stuff snowballs quicker than you think. Only takes a few bills missed before evictions and repo actions start\n\nCan you imagine leaving work 10 minutes early once and being homeless a year later because one coworker was salty you didn't massage their ego enough?", "Just recently there was a post on this sub where someone got a coworker fired for coming in late and everyone said NTA. So I'm a little surprised people are coming down on you for this.\n\nI'm actually going to say if someone is a nightmare to work with and undermines and disrespects you, if there's a way to get rid of them, great. That behavior is not acceptable. And this person wasn't fired just for leaving early. This was the last straw. Was it petty and hypocritical, yes. But when someone is toxic to work with, you're doing everyone a favor here.", "YTA\n\nFrom how you wrote, I think you low-key know that. You keep saying in comments that many times middle-aged women treated you condescendingly so I think you should start asking yourself if maybe you actually have some behavioural pattern (including minimising what you say/how you say and at the same time blowing out of proportion what they say/how they say). I think you may realize something.", "NTA. People like this are insufferable, and they make work hell.", "NTA. It's literally her fault for leaving work 10 minutes early without permission. Also, she screamed at the head of department, and that's what got her fired in the end. To the people typing YTA, please reread the story", "NTA sounds like leaving early was the last straw but you know what they say about people in glass houses...", "NTA You would’ve had more problems arise in the future. The comment about you being a little boy was just the beginning. Don’t listen to the people here saying  y t a. You can’t coddle everyone’s emotions when you’re doing your job. It is necessary sometimes but in this case, NO. It absolutely would have gotten worse.\n\nIt seems the main problem, like you explained, is that she is older with someone younger telling her what to do or giving criticism. That’s not your problem. Good luck to you!", "ESH. Calling you a \"little boy\" is age discrimination. I don't care what you did to annoy her, she doesn't get to behave that way and you don't have to move on or accept it.\n\nHowever, you should have addressed that with your manager and asked them to support your development by helping you deal with it. Getting her fired over something everyone apparently does is not only asshole behaviour but has also set a precedent. Other people could now be fired for doing this and as a senior team member you could be in trouble for turning a blind eye to a sackable offence.", "NTA. That’s why professionals bend over backwards to avoid making enemies. She was stupid for tweaking you and then leaving herself vulnerable. I’d have done the same.", "NTA you did the right thing. I believe that everyone who says YTA would have a different opinion if you were a woman and the colleague was a man. In that case they would say it is harassment and disrespect.\n\nBut the rules apply to everyone the same, so treat all colleagues equally.", "NTA! The feeling that comes with being petty is the best. If she hadn’t been such an ass, this wouldn’t have happened 🤷🏽‍♀️", "NTA, no one gets fired for leaving 10 minutes early when doing so seems commonplace. The department head was already getting ready to fire her.", "NTA. She wouldn’t have gotten fired for what she did if that’s all she did wrong. They were probably looking for an excuse to fire her, and you gave it to them. She was clearly harassing you due to your age which is unacceptable, and you dealt with it. Nice job.", "OP, you are NTA. I have worked in offices most of my life and I can tell you that it only takes one person to ruin the entire atmosphere. She wasn't fired because of you. She was fired for her behavior in regards to her reprimand. After that \"little boy\" comment in the restaurant, you were right to do what you did. She was bad for business and bad for you. Screw her. And to all the people saying he was immature and acting like a little boy, you are wrong. I've been undermined and screwed over by women like this because I was always tried to be nice.  OP did the right thing. No one has his back but himself.", "No doubt, it probably would have meant nothing if she’d just apologised and moved on, which is what would happen if nearly everyone else got spoken to for the same thing.", "She would’ve still been working here if she had just apologised, acknowledged and moved on, it was more the fact she escalating into a shouting match and refused to back down.", "I started at 18. It’s not super high skilled so it didn’t take very long to start progressing in my first job, I moved into another industry for a year or so and then came back to this job and was hired as a team leader on the basis of that original experience.", "I wasn’t her direct supervisor, but it was my responsibility to train/guide her and very often I was the most senior person in our team at the office, so I was expected to give her constructive criticism from time to time. I am usually a pretty laidback person so when these personality clashes originally started my department head explicitly told me that I should gently remind her at times that she couldn’t just treat me as an equal or someone to ignore. That just made it worse in the end.", "Wouldn' t this be an ESH? Like, the woman clearly had an big enough attitude problem that when the boss faced her, the woman was was terminated as she escalated the situation to a shouting match over something She did wrong.\n\nIf she does this to bosses, I have no reason to believe that OP is wrong when saying that conversations with her   were very difficult/Impossible.\n\nI agree that the OP was also an AH because he took an immature cheap shot (showing his lack of experience). However, it was clear that the woman was a problem and had to go.", "And childish af. OP complains about not being taken seriously because of his age and then goes on to explain how he acts like he's still in high school.", "Well.. he reported her exactly like little boys with childish behavior do! They always tell on others just to see them suffer, and they always have done the same thing. \n\nYTA", "Yup yup yup. You don’t yell at your manager when you left ten minutes early and you know that’s not allowed and you got caught. You say sorry, won’t happen again. You take the L and do better. This lady was already doing poorly at her job, she should have been on best behaviour and working to improve, not slink out early then yell when she got caught.", "I had had several conversations with my superiors about this, I think everyone became lax about trying to enforce anything because of her behaviour whenever she got criticised by anyone, not just me.", "I’m a team leader, it was definitely within my remit to tell her why she got something wrong and how she could improve. I just wasn’t responsible for having a disciplinary meeting with her or discussing pay or anything like that, or reviewing all of her work. But it’s an industry that handles large amounts of money and I would probably get sacked if I let staff members get things wrong over and over again without saying anything.\n\nIt’s not a massive team with clearly defined structures which I can understand is confusing at times.", "Nothing wrong with using opportunities.", "She was drunk at the time but those were her exact words. It didn’t come across as a joke and we were never close so I don’t see why she thought it’d be taken as one.", "I definitely have a chip on my shoulder but this is the third time I’ve been at a job where a middle aged woman has referred to my age in a derogatory way because of what I can only assume is insecurity. I think there’s a line between letting things go and letting yourself get walked over and I’ve been on the latter a lot, just not this time.", "If she got fired for that she deserved it and if she's  doing a bad job it's probably hurting the rest of the team... usually I'd rather a peer talk to me then get reprimanded by my boss", "It’s a job, sometimes I have to tell a woman if she’s done something wrong and what she can do better next time.", "He's not a robot. He played his cards. I bet your an NPC in your own story.", "It’s a relatively new company and only one other person in the team has worked there longer which is my boss. I wasn’t pulling her into meetings because that’s not my job but as a team leader, telling her how she went wrong and what she can do better next time is literally my main job. And considering it’s a small and pretty capable team I rarely do it much anyway. I’ve overseen dozens of people previously of various ages and she is the only person to treat me this way.", "I wouldn’t be fired for leaving 10 minutes early, unless I did it enough times.\n\nI had reported her a couple of times for the comments, things just never improved from there. It was nearly impossible to have that kind of conversation with her as evident by the final one.", "I feel like he could have worded it better but it looks fine. So many people in these comments just let the world do whatever to them it's laughable", "She also could have just really sucked. Both at her job and as a person.", "I think she got karma'd not him?", "I’m not sure how it’s illegal, she didn’t get fired for leaving early she got fired for escalating it into a shouting match.", "What is illegal about letting a boss know someone has legitimately broken the rules and left evidence of it?", "How’s it illegal?", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "That's fair. However if this is a pattern of behavior of not taking feedback well, the way I'm used to seeing it done at a company is her direct manager having a clear conversation with her that this is an issue as well as what the process forward is (a PIP, warning system, etc) and acting accordingly. That's the conversation that needed to be had and there are reasons these HR processes are put in place, to avoid people being fired based on who likes them interpersonally. You are in a position of influence and she is not, and that to me means you have more responsibility to act fair as a team leader. She may genuinely not be a good fit or a productive member of the team, and she def is an AH in this situation - but I'd argue you just have more responsibility to be a bigger person because of your role and could have gone about this in a more direct way about the actual issue.", "Ok, so I had to work as a barista for a bit because of the recent shut down.  One of the shift supervisors showed clear ageism towards me. Imo it was due to their own insecurity and their being so worried that I wouldn't respect them b/c they are younger than me.  Several of the supervisors were younger - I respected them, but the insecure ageist one, not so much.  Obviously I don't know if that is the type of thing happening with you but it is something to think about.  No judgement as workplaces can have nuances not evident in one reddit post.", "Please tell me you did not explicitly say \"you are not my equal.\"", "I agree, and though the former coworker also sounds unpleasant, it’s not cool to narc on your coworkers to get back at them.", "This. No way she gets fired for leaving 10 minutes early ONCE. She yelled and screamed and they realized that she in not a fit.\n\nNTA", "Nah, i don't buy that. Nobody forced your hand to be that petty and immature. I don't believe for a second your supervisors were fine with insubordination but fire someone over 10 mins, that doesn't even make sense.", "If she did so many things wrong then you could have taken it to her supervisor and raised the issue of her getting fired on a legit basis.  \n\nInstead you took a petty opportunity because you \"let emotion cloud \\[your\\] judgement and got an employee fired for something \\[you\\] have done\" (your words) is an AH thing to do.  YTA", "I’m a shift leader in my work. I’m a mental health support worker with duel diagnosis \nWe have a lot of responsibilities \n\nOne of mine is training especially training in medication..\n\nHow did you present yourself the reason I’m asking is\nYou said to tell her why she got something wrong and how to improve- I would never tell a colleague in that manner.\n\nI would ask them how they are finding the task and if there is any pointers they need. If they say no, but then I would I have noticed you do the task different to how we have trained can you show how you come to do it this way. 9/10 its a miscommunication issue and we go from there.\n\nIt’s all about how your present yourself.\n\nI think you have gone in with the tone I’m right and your wrong.\nIt’s all about how your present yourself.\nSeems a massive misunderstanding was under way you didn’t like her so got petty", "Can you tell me more about her being drunk? Where did this interaction take place?", "I think if you keep getting this response from people that you should consider the common denominator here... You. In this post you complain you aren't taken seriously because of your age and then go on to say how you acted childish af. I think it's time you consider it's not necessarily your age that's making older people refer to you in a derogatory way.", "My guess is because you are rude to them. You may have more seniority at this job, but they are competent, adult professionals old enough to be your parent, and likely do not enjoy being condescending to any more than you do. If it happens regularly, it's more likely that your behaviour is the problem.", "Tell us you have a problem with women without telling us you have a problem with women…", "I'm a middle aged woman, and I wouldn't ever speak to someone that way. You're right that she is probably very insecure, and unfortunately I have seen people my age get annoyed with being supervised by a younger person. This never really bothered me. Anyway, it sounds like she was eventually going to get canned all on her own. Especially since she was already drawing negative attention from above.", "But you just said 3 other jobs have had this problem? \n\nIf it’s a new company how much seniority can you REALLY have? \n\nIf you rarely have to do it anyway, are you really doing that much work? \n\nThe way you phrase it makes it sound like you sit around and do nothing, and one day started criticizing the new hire.", "Then reporting her for leaving was probably just the item that got her called into her bosses office. My guess is they were probably looking to be rid of her, but needed enough of a paper trail to do it. Engaging in a shouting match with her boss is probably what ultimately got her fired. \n\nWhat you did is still kind of petty, but honestly I would never fire an otherwise solid employee for leaving a few minutes early (unless as you said it happened frequently). So there's more in her personnel file than your report.", "Because, it’sHarassment. One person is being singled out for something that is acceptable to everyone else! If all the employees were held to the same standard. How many would have been fired", "That’s fair, thank you for the constructive criticism. 👍", "Obviously as a person we are equals but there’s an office hierarchy. I never used those words in any case. I think I reminded her once that I’m senior to her.", "No one forced my hand, I made the decision myself, and she was fired for the shouting match not leaving 10 minutes early.", "She was well on her way to that point and what I dobbed her in for was the straw that broke the camel’s back. I’m prepared to admit it’s an AH move which is why I came here, I have total support in the office but that’s probably just because she had made herself into a pariah by the end.", "This is exactly what I thought. It reminded me of that saying that goes something like: If you meet one AH  today then they are the AH but if you met AH all day then you're the AH. \n\nOP is the common denominator and OP ought to know that just because you're good at the work doesn't make you good at leading people in the work. If you want to be an effective leader OP it's YOUR job to make your subordinate comfortable with you because you're in the position of power. You work with their style of learning and figure out the what/how/why they are motivated and use that to guide them. You failed her. YTA", "I was thinking the same. OP, if you continuously have problems with people due to the perceived mismatch between your age/experience, you might be giving off certain vibes to people.\n\nOne guy on my team, while really smart and capable, pretty much can’t talk to anyone anymore because he comes across as an arrogant know-it-all. He rubs everyone the wrong way so they’ve just tuned him out. \n\nYou might study up on effective communication techniques, giving feedback, conflict resolution, etc. This stuff doesn’t come naturally to most people, but it’s really important to have the skill, especially as a more experienced young person in the company. As you said, some people can be averse to having someone as young as you know more than them, but understand that a true leader will take it upon themselves to figure out how to make sure that doesn’t happen. \n\nIf you can’t or don’t want to make that effort, no problem, but that would mean that you’re probably not cut out for a leadership position.", "I acted childish by the end of it, I didn’t give her any reason to refer to me as a little boy in the 5 months previous. The common denominator is that I’m very good at my job despite being young and it’s only been two or three people out of dozens and dozens that have had an issue with it.", "I give feedback to every employee that I’m responsible for, I usually don’t get that kind of reaction.\n\nIn my first job I was constantly belittled by my superior for being young (when I was 18-19) and then again with another coworker when I was 21. It’s only been 3 people out of hundreds of coworkers but it has no doubt left a chip on my shoulder.", "She wouldn’t have been fired for leaving 10 minutes early, like I said. She got fired for shouting at the supervisor when asked about it. Not for the first time either.", "What did you actually say to her? Not generally, not paraphrased, but the specific words. \nOkay, I see you edited in that you did not say those specific words. I still stand by my judgment that you are an a****** for getting her fired just because you didn't like her. If someone you got along well with had also left early, you wouldn't have said anything.", "Lmao of course you did", "You suck", "So why didn't you go to your supervisor and tell them she was disrespectful to you? THAT would have been valid and a proper way to deal with this. But to not say anything about that, stew on it for months and then use some petty infraction you all do to get her fired is immature af.", "In a previous comment, you said that she said that when she was drunk. I’m assuming, she did not say that at work, but in an interaction not at work. (correct me if I’m wrong). Therefore, you holding it over her head for something done off hours is not professional and rather vindictive.", "Grow a set!!", "Bro you are not only violently biased, you are also so insecure that 3 bad interactions have turned you into a complete asshole in the workplace. \n\nI’ll say it again. YOU ARE THE ASSHOLE.", "The one time I put my foot down was mid-argument when I said “you know I’m a team leader right?” when she got something wrong and refused to acknowledge it. Normally I would just let my manager deal with it but I was the only person available. I probably could’ve let it slide and maybe would’ve in the past but this was after she called me a little boy.", "Oh I tried, I think the attitude towards the end though so to just let things go because any discussion with her would just go south immediately. At times I was a bit angry with my supervisor for not putting his foot down more, he left it to me to remind her that she’s technically my subordinate and I did that once with predictably poor results.", "Dude, it sounds like you are acting way too big for your boots. Your criticism probably isn’t anywhere near as constructive as you think it is.", "You need to grow up.", "You are behaving like a little boy. You might have professional experience but you are far too immature to manage people.", "The real problem here seems to be that you’re full of yourself and overly sensitive with a vindictive streak. Your revenge is that of a little, immature boy, not a mature man. YTA", "I mean it was still a shitty thing to do but given further explanation of the circumstances it's probably not as shitty as your original post made it sound.", "So it sounds like your supervisor put you in a shitty no win situation that you had to deal with day in and day out so they didn't have to and you eventually took the low road to get out from under it, that's actually more understandable (to me anyways).", "I honestly could have gotten on with things but it would’ve made my job significantly less enjoyable so yeah I took the low road.", "YTA nobody likes a rat. You also cost someone their job,  which you have no way of knowing could be easily replaced.  How is she supposed to pay rent/mortgage/eat?", "YTA the way the woman treated you had nothing to do with your age or lack there of. It was in response to how you approached issues with her. \nSource: 43 year old waitress who works for a 26 year old small business owner who happens to be male.", "When someone gets you fired as petty and spiteful revenge, using an incident that everyone would normally turn a blind eye to and would do themselves, you will know the answer to your question. YTA", "NTA - I've had experience with older people with attitudes towards younger people being above them or better than them at their job and tbh they can go feck themselves for that matter.\n\nShe was a dick looking for trouble, she got it.", "YTA and you sound insufferable. Training someone doesn’t make you the supervisor.", "And in the next episode of AITA\n\nNobody wants do be in my team, AITA?\n\nYour story reeks to me like a kiddo that can't handle that someone older does know their job and so tries to meddle in their affairs to get them fired. \n\nAnd before you whine about younger supervisors not being taken seriously.\nMy supervisor is ten years younger and brings twenty years more of experience. He's just not intruding on my work with his constructive bickerings.", "NTA\n\nI feel like everyone is completely ignoring the fact that when a different supervisor approached her to address the leaving early complaint, it turned into a SCREAMING match??! That is not the way a reasonable person would react, especially not in a professional setting. \n\nYes it was petty to pick out her issue of leaving early to report, since you and all your other coworkers do it too. But NTA at all for her being fired. Her reaction in that moment was completely her own choice.", "YTA \nBecause you come off as an arrogant know it all. I bet your criticism wasn’t very constructive to begin with.", "YTA. Grow a thicker skin, stop giving unsolicited “advice,” keep out of other people’s business, and if you see someone leaving early or taking a long break, no you didn’t. \n\nHonestly, I feel like there will be a point in your life when you look back at how you acted when you were 23 and you fucking cringe. You don’t yet know what you don’t know. Rein it in. It will serve you well in the long term.", "I'm going against the grain here and saying NTA. She very often undermined him at work and called him a little boy. Screwing with my work and calling me names? Damn right I'm using any weapon at my disposal to get rid of you!", "NTA", "Yeah yeah, ok, but I want to know is why her calling you a little boy upset you so much... I'm short and look much younger than I actually am, and get called all sorts of variations of that all the time by older women.. Though I guess it's not meant as an insult (they refer to my actual looks and not my maturity), and they tend to be surprised when they find out my actual age, but even as an insult it wouldn't bother me.\n\nI'm a man, I do what I gotta do and I don't let petty insults get to me.. Which is kinda what men do no? Or it use to be at least. (not that women don't, but it's a matter of pride for us guys lol so just bare with me)If people undermine you at work because of your age, there's a very simple solution actually.. Do their job better than they can just once, can't say anything after that. Worked everytime. Instead of telling them your team leader, show them WHY you are. \n\nSimple fact of life is that respect is earned, not just given, and the best way to earn the respect of others is to respect yourself first. Be the bigger man (don't let people walk over you sure but don't take everything as an attack either), let your actions speak for you and don't narc on people for things you do yourself.\n\nThere will always be assholes in the work place, learning how to mange and work with them is what makes you a good leader.\n\nNow as far as whether you're the asshole here or not.. I'd say the whole situation is unfortunate and she was maybe just not a great fit (that happens all the time in work situations) but you definitely didn't act like the kind of leader I would follow. Wouldn't break it down to ah or nta, just people in a situation that no one knew how to handle appropriately.\n\nI read you said something about how you've reported her behavior and nothing was done about it, that just means that whoever is above you is also not a leader worth following and that should definitely be addressed.\n\nAll in all though, keep on working hard, and I hope you can take something away from the experience that'll help you do better in the future. We're all just trying to get through this thing called life yeah, be the kind of person youd look up to as a kid, or the kinda person your dog thinks you are lol.\n\nPeace out, have a good one.", "YTA Don't fuck with peoples' jobs because of your feelings", "NTA. As someone who is constantly talked down to because of my age at work, it is unpleasant. Let me first validate you there. It also creates a very very toxic work environment, not just for you. Sounds like she wasn't fired for your petty action though (and yes, it was petty). It was a series of reasons. I've been reprimanded for being late, and so has my entire team. It was a fair call out. I said sorry and was better about it. Traffic is hell. Understandable. Worked with someone unpleasant at the same job, my manager was a really awesome manager. He had to fire very unpleasant person. It was not over one thing but multitude and because unpleasant person yelled at the manager in the end. Businesses seldom are able to fire someone due to a one off, unless it's really bad. They need repeated and trackable offenses and lots of paper work.", "YTA but I get it, there are things I let go with people I like vs coworkers I actively dislike.  I feel like if given a chance, she would have reported you for that 10 mins too.", "NTA. The reason you reported her for was just ridiculous, especially since you admit to doing the same. However her \"little boys comment\" should have bene reported and I guarantee she wouldn't have a job after that. I've worked with people like her, they're horrible and they don't keep jobs very long because of their own actions. Next time you encounter one report their sexist and agist behavior rather than the behavior you yourself join in on. Your team leaders will be watching clocks now", "YTA. You aren’t her direct supervisor, but you took it upon yourself to give her unsolicited criticism. Were you asked to do that by anyone? Fired for leaving 10 minutes early? Did she have a reason? Emergency etc? That sounds like a stupid reason to fire someone, but I guess someone could, but you sound like a snitch.", "YTA-Spiteful is spiteful. She was digging her own grave, but that doesn’t justify shoving her in it in a snit.", "NTA her general attitude is ultimately what got her fired, you just gave her the last bit of rope needed.", "NTA. Alls fair in love and war", "NTA!", "And you wonder why people like yourself get beat up in life.😎", "YTA. You definitely sound like an immature 24 year old, even though you are so confident that you’re not immature. You 100% let your emotions and ego get the better of you. Why were you threatened by this new employee? If you were seriously so confident in your presence at this workplace and your capabilities as an employee, then why were you so focused on this new employee? Worry about you next time!", "YTA\n\nThis was incredibly unprofessional and immature. You and your buddies do the exact same thing. Yet because you don't like this person you reverted to middle school behavior.", "YTA don't worry, karma will sort it", "i’ll say NTA just because 1. you indirectly mentioned it, not filed a report; 2. it turned into a screaming match which if that’s her first instinct it to yelled and get mad at any type of criticism, yikes and 3. she clearly had other behavioral issues at work and this was just the cherry on top.", "NTA. She crossed you and she paid the price. She won't get a second chance to slight you again.\n\nHowever I would argue that someone being fired over leaving 10 minutes early is totally insane. The USA is a workers nightmare. The country is an international joke where employee rights mean that you are basically slaves.", "Well, she sure nailed the ”little boy” comment. YTA", "YTA\n\nSo you don't like being belittled about your age, very understandable. Have you had a mature, adult conversation with her, HR or anybody else about this that could have helped? Have you acted on any comment like the little boy one, rather than just let it go and take revenge later which actually does make you sound a bit like a little boy?\n\n\"An opportunity presented itself\" - right, so you were waiting to get her fired over anything however minor, that's the first part of why you're TA. The fact that everybody does this, INCLUDING YOURSELF is the second part.", "YTA. You had plenty of opportunity to escalate for things that do make a difference - disrespectful comments, inability to handle criticism etc.\n\nInstead you reported her for leaving a little early which no one should realistically care about and everyone does.", "So you got her maliciously in trouble for something you do yourself because she hurt your ego. Rather than deal with the actual issue head on, you behaved exactly like her. YTA.", "Nta. Well played.", "YTA the biggest type of work place AH.", "ESH. I know a few coworkers like her, but you suck for the reporting her based on that reason. But I highly doubt that was the reason why she was fired. She has a history of behavioral problems", "YTA.", "YTA. No wonder people treat you like a child. You act like one.", "ESh\n\n1. You don’t get fired for leaving early once. She had other issues that was eventually  going to get her fired. \n\n2. You better stop, because someone going to report you for leaving early.", "I’m saying NTA. You “narcing” on her wasn’t what got her fired, there was clearly a lot more at play here and this was the last thread on the nail. Was it petty? Definitely but it was certainly justified, this woman wasn’t just “unpleasant” to work with, she couldn’t accept that someone younger than her was higher up than her and her “not upsetting little boys” comment proves that, her blowing up at you over advice or criticism proves that. The only one to blame for her getting fired is herself, the fact that other people have left work early doesn’t matter here, if the boss found out they’d most likely get a warning, you only get fired when you were already on thin ice. You didn’t do anything wrong here OP.", "Unpopular opinion NTA, upper management did not fire because she left ten minutes early they fired her because she is a pain in the ass to deal with constantly. I’ve worked with people like her before, if it was not you reporting her it would be somebody else reporting her trying to get her fired because she is pain the ass to deal with. The women is 40 years old and making snide comments to outside of work, which totally inappropriate. I’m willing to bet if you look at her job history you’ll notice a pattern where she does not hold down a job for no longer than year, which is the same amount of time where people get sick of crap.", "YTA. You got her fired over something petty you yourself do. \n\nFurther, I would be interested in examples of things she’s done you don’t like and your constructive criticism.", "NTA. You didn’t fire her, it wasn’t your decision. All you did was tell the truth.", "YTA for being petty with your authority, but it sounds like she got herself fired.", "YTA. And a little boy", "Honestly? ESH - She was the asshole in that she was clearly disrespectful and was not a team player. Just didn't play ball and that is something you absolutely NEED to learn when working in a company. You can't lone-wolf it in this world anymore, like other people said, it's a recession and incredibly difficult living here, so you NEED to be a team player. End of story.\n\nWas what you did dickish? Absolutely. You nitpicked something that everyone else was doing, but you did not make her scream at her supervisor who gave her, more than likely, what was going to just be a stern talking to. You are not responsible for her actions, she has massive behavioural problems that would have gotten her fired sooner or later. I sincerely doubt the screaming was only over that 10 minutes. At this point, she should have just kept her mouth shut, taken the L and then went off at home to whoever would listen like the rest of us.", "She brought it upon herself with her comments and behaviour. I feel youre justified since you did it for revenge and I can always get behind some good old fashioned vengeance when its earned. NTA", "ESH from what your saying she was not a good employee and should have been fired but you’re also a AH for reporting her for something you and other routinely do. Why not just report her for her disrespect and causing a hostile work environment", "NTA, \nThey were looking for a reason to get rid of her, you just helped them.  Leaving 10 mins early doesn't get fired, it gets you a write up or a verbal at the very least.  Odds are there were other complaints and this was the nail in the coffin.", "Yta... this is why she doesn't like to upset little boys....", "ESH. it was an ah move but had she not gotten into a *screaming match* with the head of your dept, she most likely would still have a job. she sounds pretty sexist and you mentioned she has other issues behaviorally, so i guess she had it coming anyway. however, if you’re gonna be petty like that, don’t use something that everyone else does as a way to do so. that’s why so many people are saying y t a.", "YTA", "YTA. And I suspect “not handling constructive criticism“ means “not acting subservient while getting bitched out by someone who has no authority over you”.", "NTA as unfair as it might sound it’s regular practice to “manage out” people.  This consists of making record of small infractions to later use to terminate an employee.  It sounds like she wasn’t a good fit for the company and no doubt has been on the radar to be let go.   \n\nA company doesn’t let a person go for one small infraction, especially a good one.  You gave them information that they added to the list.", "ESH. She did something that got her fired. You didn’t force her to do it. If someone else had have reported her, she’d have been fired. If the boss saw it for their self, she’d have been fired. It sounds like this wasn’t the only problem she had there. That part isn’t on you. If the boss found out you knew about her behaviour and said nothing, you’d have likely been fired too. \n\n\nYTA her because you do this too. I assume you won’t be doing it again? So. ESH. Learn from this.", "YTA", "I am curious about how you indirectly reported her.  Did you search for her and ask a coworker if they had seen her.   It doesn't sound like you stalked her and reported her every time she stepped out of line.", "ESH you wanted her fired and you found an excuse. The fact you do it as well means you really don’t care about her leaving early. You should have been honestly to your superior about her attitude and have them handle it. What you did was snakey. This isn’t a way to handle conflict and it shows how immature you are. She shouldn’t be a jerk and I am sure she helped herself get fired by reacting badly when it was brought up by the bosses.", "NTA. Posting because people are crucifying you for trying to give her constructive criticism. She was brand new and he had worked there since the company was created. You do not have to be someone’s boss to give them tips and tricks, it sounds like you were trying to be helpful. She’s new and left early without telling anyone and then screamed at her boss; sounds like the entire company dodged a bullet.", "nta. small work environment, not a team player. ypu dud not get her fired but perhsps it was the last straw. Betcha the team is much happier now..", "From the story you are both being assholes. ESH", "I’d add a 4. - that reporting her for something the OP and other colleagues do definitely has potential for management to clamp down on everyone who does what she get in trouble for. The petty response to report her could have actually put OP and the others at risk of a ‘talking to’, or of stopping those moments of leeway for everyone. \n\nI also would echo the other commenter who said that it’s perhaps not the colleague undermining OP, but that it’s more of a reaction to perceiving OP as undermining her because he’s ‘senior’, though not actually her manager. In short, if you’re not someone’s manager, don’t act like you are, even if your position is senior to them. \n \nI definitely agree, ESH.", "I would question if he is really providing constructive criticism, or if he is sticking his nose where it doesn’t belong. He isn’t her manager or direct report. He just thinks he knows more than her and therefore should get to tell her how to do her job. \n\nI’ve had coworkers like that and they are so frustrating to work with.", "Completely agree. ESH. Reporting someone for something you do yourself will bite you in the A. It would be been better to discuss the challenges you were having with your supervisor. But to be clear, leaving ten minutes early one time may be cause for coaching or a write up, but not firing. There were clearly other performance issues.", "Na, disagree. You fought fire with fire.\n\nYour workplace is not about having friends or appeasing colleague but primarily about making a stable income. Your colleague tried sabotaging your career and thus had it coming. Zero pity, zero regrets.\n\nPlus you don't get fired for leaving 10 min early one day. Your colleague must have had a history of BS she had pulled to make leaving early this day the reason for being let go.\n\nNTA, obviously.", "Yep… definitely a little boy move", "_\"I have on occasion done the exact same thing as she did and have watched coworkers do it and said nothing. Did I let my emotions/ego get the better of me?\"_\n\nAgreed. It sounds like OP's ego may have played a bigger part in this scenario than they may like to admit. OP keeps saying they are the _most senior person,_ but that means nothing if you are disrupting the flow of the workplace. OP says this has happened twice before on the job, so maybe he should take a step back and evaluate if it's really his age that is the issue or that he doesn't know when it's not his place to insert his feedback.... \n\nOP, if you keep encountering the same issue over and over, then maybe the problem is you. Also, the next time you leave early, don't be shocked if someone \"indirectly\" reports you.", "There a many workplaces where more tenured staff are encouraged to provide guidance or coaching for new staff. As a hiring manager, I couldn’t imagine being solely responsible for providing 100% of the on-the-job training or onboarding without some support from my other staff, especially since I don’t do many of their tasks on a daily basis and they have more specific knowledge on best practices. Him providing her ongoing feedback on their office standards for performing the work does not necessarily justify being considered the AH in and of itself.", "Exactly you also don't say things to coworkers like, \"I don't want to upset little boys.\"  Something tells me she said this and more to other people and yelling at her supervisor was the last straw.", "The fact that she went and approached a 'senior/ higher up' with a sexist remark and extremely back handed apology is probably also what came around for her? I have no compassion for that kind of behavior, and if she wasn't fired for that, it'd be something else.\n\nIn a private company  you are allowed to fire people as you like, and if she is being difficult, that is a legitimate reason to let her go.", "Why? OP reported her because she was being an asshole. If the other colleagues are not being assholes why would he report them? She treated him like an asshole so hes free to do the same thing to her.\n\nBut this is based on that OP is telling the truth and all of the truth so it gets muddy", "A team leader is generally supposed to review the work product, ensure its content and format are correct, comment and return it to the team for revisions before submitting for senior review. He was literally doing his job. The replies on this thread from people who don’t understand the ISO process is astounding. Yes - other people NOT your supervisor will review and comment on your work.", "It's not clear at all whether or not OP was patronizing or condescending in delivering the criticism.", "Mansplaining is the dumbest term ever invented by humans along with cultural appropriation but i digress", "> She called you a little boy\n\nthat's an ageist comment. it would be no different than OP calling her an old shriveled up hag.", "She treated him poorly so he can return the favour and treat her poorly too. Sure its petty but ehh thats fine.\nAlso shes the one that started shouting like a fool to her boss. If she has someone or something to take care og she shouldve thought of that before losing her temper like a child.\n\nHe didnt tattle for no reason, he tattled because lack of respect on her part. Again, its petty but understandable. \n\nBut this is all conjecture since were going just by one side of the story.", "That comment wasn’t even made AT work!", "Especially if she has a way to prove that others do it without repercussions. It could open the company up to a lawsuit if they fired her over it but everyone else gets away with it.", ">I’d add a 4. - that reporting her for something the OP and other colleagues do definitely has potential for management to clamp down on everyone who does what she get in trouble for. The petty response to report her could have actually put OP and the others at risk of a ‘talking to’, or of stopping those moments of leeway for everyone.\n\nAlso, the employee can claim it was not a fair dismissal if everyone else is doing it. Obviously depends on the employment laws but OP would have been far better off writing up their cases of insubordination than going after something they do themselves", "Based on how this post is written, I’m going to guess OP is insanely annoying about how they provide “constructive” criticism. OP is 23. Even if they started working at 16 they have 7 years of experience. Someone in their 40s has been working long than OP has even been alive.\n\nNot to mention OP isn’t this person’s manager, unless they’re seeking feedback you don’t give it. Being at a company longer doesn’t mean you’re in charge or you get to tell others how to do their job.", "My thoughts as well. Leaving 10 minutes early isn't usually a fireable offense, it's a warning at best. It was her insubordination that got her fired. The termination would have eventually occurred without OPs input.", "Well he is not her supervisor, yet gives unwanted 'advice' and 'constructive criticism'. I can see how that rubs colleagues the wrong way.", "How is it an immature cheap shot? Hypocritical, but not immature. The coworker undermined them, was condescending and outright aggressive to them. OP saw a chance to deal with a royal PITA who made their working life difficult for no reason other than their own insecurity/entitlement. They weren't fired for clocking off early, they were fired for a culmination of events that led to an outright shouting match. None of that is OPs fault.", "It could be the boss playing favorites. She might have mentioned that the OP is a condescending jerk and also leaves early. The boss probably defended the OP. Wouldn’t be the first time.", "but, but, but she started it!", "Exactly", ">...when these personality clashes originally started my department head explicitly told me that I should gently remind her at times that she couldn’t just treat me as an equal or someone to ignore.\n\nYour department head didn't do you any favors here. It sounds like this coworker's days were numbered either way, but definitely pretty shitty of you to rat her out for something that didn't have to do with your beef. In the future, ask your department head to be clear to new hires about the hierarchy, especially if they're older than you.", "Well you certainly act like a child", "I highly doubt that was what got her fired. Leaving 10 minutes early gets a verbal \"hey, next time let me know if you need to leave early\" most of the time. The more likely reason she was fired was due to how she reacted.", "Do you know how hard it can be to fire a terrible employee at some companies? Everything has to be documented, you have to have conversations, have to keep track of everything for months.\n\nOP's company probably thought 'Oh thank god! We can officially fire her now.\"", "That depends on how the job is structured. More than half of my job is giving coaching and constructive criticism to teams I do not supervise directly.", "A lot of senior people are expected to review, critique, and help with jr professional’s work. It’s literally in my job description", "I don't think that this is a correct assessment. While OP is not the official direct supervisor, it is clear that OP was given supervision and leadership roles, as well as given responsabilities regarding the results of the team (including the coworker). \n\nI also think that this is One of those workplaces in which these functions were given to OP by his supervisor, but in a somewhat unofficial capacity, and was not properly communicated nor enforced to the coworkers. Thus, OP was put in a position in which he had mandate to do things, but no real power to enforce things if coworkers did not immediatly comply.\n\nAnd to me, is another justification to why this is ESH, by including the supervisors by not clarifying to everyone what were the real functions and authority of OP.\n\nEspecially after OP identifying this as problem to the supervisor.", "OUTSIDE OF WORK…which isn’t that strange because I don’t hang out with co workers outside of work when I don’t like them", "You're being weird. It's three people, not everyone OP meets. OP is the common denominator because *he's the one these events happened to.*", "If she was being reprimanded for something everyone else does and none of them get reprimanded for it then it could easily be spun by a good lawyer that it was an unfair termination.\n\nI'm sure it was a straw that broke the camel's back situation, but it can't be something everyone else gets away with.", "Yup, I have a boss, but she doesn’t supervise 95% of my work. I get feedback from the leaders outside my department that I work closely with. \n\nEssentially, I’m a project manager. I report into a more senior project manager, but I “work for”, receive feedback and take my orders from different businesses owners and VPs. Those folks have far more oversight over my work than my direct supervisor.", "OP... You sound like the office AH. It may be unintentional, but it sounds like your communication skills could use a lot of work. It's not just what you say, it's how you say it..... You keep focusing on this \"seniority\" thing, instead of letting your leadship skills shine. \n\nLaslty, if you aren't someone's supervisor and keep giving them unsolicited feedback, you just end up coming across as a pest. If you had concerns, why not speak to her actual supervisor so that they can guide her?", "The shouting is on her. But if she is shouting that you only reported her to be petty and everyone leaves early so why is she being singled out, she has a point - and one that could be used legally against the company in some areas.\n\nYou would have been far better off writing up her insubordination or issues with her actual work as a direct complaint to her supervisor and having her fired based on that", "The shouting match that happened BECAUSE she left early. Whichever everyone else does sometimes with no consequences. That could potentially be considered discriminatory if everyone else does it and she's the only one who got into trouble because of it.", "I had a lot of issues at work with this sort of thing early in my career because I looked like a teenager despite being in my mid-late twenties. I’m in my thirties and I FINALLY look like I’m in my twenties (so I still occasionally get attitude but not nearly like I used to). Plus I’m a woman. There was a ton of sexist, ageist crap I had to deal with. And from the majority of colleagues, not just three people. [eta: if you think being called a “little boy” once is frustrating, imagine being called “sweetie”, “honey”, and other variations of “little girl” repeatedly for YEARS]\n\nI have to say that you sound really immature in how you’re handling this. If I could deal with this more professionally for over 10 years of my career (with the added sexism) then you can learn to handle this better. You behaved incredibly childish, reinforcing your lack of maturity and experience (which, you’re young and have only been doing this for five years. In the grand scheme of careers, you’re not actually THAT experienced).\n\nIf your supervisors aren’t addressing her inappropriate behavior and remarks then continue to press the issue with them. Tell them you will not work with her because it’s become a hostile work environment. But deal with it through appropriate channels, not by tattling on her for something you yourself do. \n\nNo matter your technical experience, your interpersonal skills need an immense amount of work. I recommend seeking out training for general communication skills but also supervisory / management skills. You need it.", "OP, as a woman, I can’t TELL you the number of times I’ve been dismissed or criticized or ignored due to my sex or age. So I understand 100% where you’re coming from! \n\nThat says: Your knowledge of the subject matter may be well advanced, but the way you handled this situation was incredibly immature. Your first step after the initial conflict should have been to have her manager speak to her, or email her, letting her know that you have the authority to fix things or guide her. You’re not her manager, and unless she had explicit directions there, I bet this felt like mansplaining. Second, never, never report someone for something super petty that everyone else is doing. That’s childish, immature, and only reemphasizes that there are double-standards in the workplace and could come back to bite you later.", "Look..I worked in the medical field and have always looked younger than I am…I have had elderly patients think that my job was my AFTER SCHOOL job 😂 I never had the level of issues supervising people that were older than me the way you’ve described . It’s you", "For most people, \"getting away with it\" means that you get a verbal reprimand. Then you say something to the effect of \"sorry, won't happen again\" and go about your day. Her reaction was yelling at her boss, so she got fired because she's a liability.", "My department is currently shifting roles (because of economy/pandemic/etc) but a big part of my job is training and then being able to be consulted about a specialized field of knowledge. It would not be outside my role, either, to report if someone left early, even though I do not specifically monitor those teams for that.", "And there is a proper way to deal with that - you file a grievance. You don’t shout at your supervisor right or wrong.", "Can’t grow what hasn’t apparently dropped yet", "OP - based on how you outlined things in this post, you aren't coming across as a competent leader. Being a leader has more to do with being able to guide, teach, and communicate than titles and knowing how to do a job.", "A team leader or her team leader? If you’re just “a” team leader I don’t know why you’d go out of your way to keep giving her feedback, tell her team leader, not her directly. It’s not your place. \n\nIt sounds like you were taking liberties and she didn’t like it, then you snitched on her for something everyone does regularly because you didn’t like her. If I were working with you I wouldn’t trust you as far as I could throw you, you sound sneaky and mean.", "So, what you SHOULD have reported was the “little boy” comment- directly to HR. As a supervisor, I would NEVER allow an employee to speak to another that way. I would have documented it and counseled her. \n\nThe correct response is not “we are not equals”, the correct way to say this is “we are not peers, I am the team lead my role on this project is ensuring the product meets standards and policies are followed.  Your work needs to reflect….”.  You should also document that in your daily notes. \n\nThen, if she does not change her ways, you bring that to your supervisor.", "You SOUND like a little boy", "Absolutely", "i'm gonna be honest, this response makes me question exactly what went down. if your supervisor didn't see these altercations as big enough to fire her (and i call BS on them just accepting that nobody gets through to her and moving on, because in that situation they would accept that's how she is and deem her an unfit employee), i feel like you were biased based off past people disrespecting you and assumed the same of her. if she was really being that insubordinate, leaving 10 minutes early wouldn't get her fired. and neither would yelling at her boss, because as far as they know, she has a history of insubordination and they've \"let things go\". don't treat new employees based on past employees' behavior, and if you want to be in a management position, be emotionally mature enough to handle confrontation. maybe the little boy comment was because she heard you talking a bunch of shit about her around the office while refusing to confront her, and honestly? that's acting like a little boy. you need to take criticism as well and mature."]}