{"id": 7986, "submission_id": "10ij4hm", "title": "AITA for telling my parents they aren’t allowed to come to my daughter’s wedding?", "selftext": "For context, I'm am in an interracial marriage and my mom has strongly disapproved of my wife since day one, but I married her anyway because I love her and screw what my mom thinks. My mom was still invited to our wedding, but from the moment she arrived she couldn’t stop making totally inappropriate remarks about “slaves” and “second world countries” which made everyone super uncomfortable.\n\nMy wife was in tears and told me my mom ruined the wedding and I was completely with her on that. I cut my mom out of my life after that day and we haven’t spoken since. I’ve now been with my wife for almost 30 years and we have a daughter together who is getting engaged soon to a lovely young man that happens to be of african-american descent.\n\nDespite my strained relationship with my mom, my dad has always been an active part of my life. Unlike my mom, he has never treated my family any differently because of how they look and has even helped raise my daughter over the years, who he adores and is very close with, and has a great relationship with my future son-in-law. I invited him to my daughter’s wedding, but not my mom, for obvious reasons.\n\nUnfortunately, my dad isn’t great at keeping secrets, and the very next day my mom showed up, unsolicited, at my front door. I hadn’t seen her since my wedding and I told her to get off my property or I’d call the cops. She begged me to listen to her and how she was a changed woman, and just wanted to be there for her granddaughter (who she has never once visited). Funnily enough, she never mentioned or apologised for ruining my wedding and offending my wife’s entire family.\n\nI told her absolutely no way she was going to be allowed at my daughter’s wedding and if she tried to visit my house again I would get a restraining order against her. My dad called me afterwards and said that I was too harsh and that I should give her a second chance. He said this could be a good opportunity for my wife and I to “reconnect” with my mom, which I found pretty insulting.\n\nI was really upset that he took her side, considering what she’s done and how she’s acted in the past. Also, the only way my mom would’ve known where I live is if my dad told her, and for her to show up uninvited means that he didn’t stop her from going to my house. I told my dad he wasn’t welcome at the wedding anymore.\n\nI’m afraid that my dad is going to try and bring my mom if we let him come, and I’m not convinced my mom has changed. Especially since she hasn’t even acknowledged what she did to us. But my wife told me I was wrong to uninvite my dad, and that our daughter will be really disappointed if her grandpa isn’t going to be there. She also said that both of her parents will be there and it will be weird if neither of mine are present. I do feel like maybe I was too unfair on my dad but I really really do not want my mom to ruin my daughter’s wedding like she ruined mine.\n\nAITA?", "created_utc": 1674392375, "permalink": "/r/AmItheAsshole/comments/10ij4hm/aita_for_telling_my_parents_they_arent_allowed_to/", "score": 322, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My dad has been an important part of my daughter's life, but I uninvited him from her wedding to prevent him from bringing my racist mom, and my wife thinks I went too far.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, you are trying to protect your daughter, BUT it is her wedding and should be her choice who to invite or uninvite.", "I think his invitation or lack thereof should be up to your daughter, tbh.  Have a discussion with her about your concerns of him being there and the potentiality of your mom crashing the wedding/reception. I would also step up and pay for a security guard at the wedding and reception if you can afford it.  I’m so glad your dad has had a relationship with your daughter.  I don’t know how he could keep news like this away from your mom since I assume they live together? Or are they divorced?\nEdit to add: NTA, but let your daughter decide.", "NTA. A major public life event is not the right venue for reconnecting after a serious harm followed by thirty years of no contact. If your mom was truly committed to repairing harm, she should do so by respecting your wishes and asking you whether/when/how you want to explore reconnecting (emphasis on whether). \n\nThat said, I agree with others that it's your daughter's decision to make about inviting your dad. Have you had a conversation with your dad about his role in your mom showing up, and how that affected your trust in him?", "NTA, not even close. Your Mom is the asshole in the situation, not you. You may want to consider setting up a time for your Mom to meet your kiddo to work on building that relationship if your daughter wants to pursue it. I definitely could see how this situation is difficult for your Dad. I'm sure he didn't do anything intentionally to hurt you, its probably coming from a good place in his heart. \n\nWith that said, I fully support your decision to not let your Mom come to your kids wedding. That's a natural, logical consequence to the hell she rained down on your wedding. \n\nAllow her a 2nd chance to have a relationship with your kid? Sure. Invite her to dinner, to a birthday party, out hiking. But dont invite her to the wedding.", "NTA. If she had changed. She would have picked up the phone before now and called you.\n\nYour dad has done well at keeping the things separate and staying involved with you. She probably overwhelmed him and got him to give up now. Dont hate him too much. It's tough living with the evil partner.", "Info: what is your daughter’s opinion in all this? It’s her and her so’s wedding", "You should talk to your dad about your mom not apologizing or even acknowledging what she did. That being said, it is your daughters decision on who will attend HER wedding. If she decides she wants one or both of them there, you all should respect that. Im going to go with NAH for now.", "NTA.\n\nBased on the information provided, it seems that you have valid reasons for not wanting your mother to attend your daughter's wedding. She has shown a pattern of inappropriate behavior and has never apologized for her actions at your own wedding. You have also had a strained relationship with her for many years.\n\nHowever, it is understandable that your wife and daughter may be disappointed if your father is not able to attend the wedding. It is important to consider their feelings and the impact it may have on them.\n\nIt may be worth having a conversation with your father about your concerns and setting clear boundaries for your mother's involvement in the wedding. It could also be beneficial for you and your wife to have a conversation with your daughter about the situation and explain why you made the decision you did.\n\nIn this situation, it may be difficult to please everyone, but it is important to prioritize the safety and comfort of yourself, your wife, and your daughter on your daughter's special day. Ultimately, the decision is between you, your wife, and most importantly, your daughter, and you are not necessarily in the wrong for standing up for yourself and your family.", "NTA. Ultimately your daughter’s choice but if your mother really wanted to reconnect then a big family event isn’t the time to do that. You and your daughter won’t be sitting around twiddling your thumbs that day, you’ll both be fairly well occupied. \n\nIf she really has changed the better approach would be to ask to meet for coffee or other low pressure option. If she is serious about fixing things then she should be happy to take whatever opportunity you give her on your terms.", ". [Edited]\n\nINFO: why don't you let your daughter decide? She is old enough to get married. Shouldn't she be old enough to decide who is invited to HER wedding?\n\nDoes she know what your mom did? And that your dad enabled her to break the NC?", "Info: How is it not your daughter's choice who comes to her wedding?", "Soft YTA. Your dad has spent many years walking a very fine line between you and your mother and on this occasion, he stumbled. He doesn’t deserve to be uninvited from the wedding. You should give him a second chance, but make it clear that your mother is not welcome.\nYour mother is an asshole. She may be a reformed asshole and she may not. You could try meeting with her on neutral territory to see if she has changed. She should be willing to apologise to you, your wife and your wife’s family. Then it would be up to your wife whether she wants to meet with your mother and up to both of you whether your mother gets to meet your daughter. Then all of you would have to agree on inviting her to the wedding. I don’t know if there’s enough time before the wedding to judge if your mother has truly changed or even if you’re willing to give her a second chance. But I do think that your dad deserves one.", "ESh. I get that your dad shouldn't have done it, but to cut him out of the wedding. Also, at least for me it sounds like you are making decisions without asking your daughter and soon to be son-in-law. That's not okay whatsoever. Your daughter and father seem to have a close relationship and you are right now making decisions for her, just like your mum tried to do for you...", "YTA. The wedding invites are the prerogative of the bride and the groom. This is their decision to make, independent of whatever mayhem and harm your parents created during your own wedding.\n\nIf the bride and the groom decide to invite her grandparents, it should be with the clear understanding that all the adults -- yourself included -- put aside their grievances for that one day and join in wishing the bride and the groom the best as they embark on their journey as a married couple.", "YTA, but barely. I understand the hurt and betrayal your mother inflicted on you, but uninviting your dad is not your decision to make. Your daughter should have final say on any invites including whether her grandmother can attend or not. \n\nAlso do not blame your dad for advocating for your mom. If you parents are still married then this has probably been hard for him to balance. Familial conflicts are not a zero sum game, where one side wins and one loses. He is not so much \"taking her side\" as trying to work towards a solution for everyone. Your father is in the difficult position of wanting to mend his family. He's stayed in your good graces for this long and earned the love of your family, so it might be worth trusting his judgement enough to give your mom a shot.\n\nYou have no obligation to reconnect to your mother or forgive her, but almost 30 years with no contact is a very long time. If your mother was essentially falling on her own sword trying to reconnect with you then I'd say it was at least worth finding a time to speak to her and hear her out. Also I'd say that proclaiming she's a changed woman shows she does in fact have remorse for her previous actions. I could be wrong, but you'll never know unless you actually speak to her. If she can't fully apologize or shows she really hasn't changed then you are fully entitled to keeping her cut off. Then if your father still insists after a botched conversation you could have hard reasons for why you don't want to see her.", "OP: Here's what you do.   \nStep one, have her write a written apology letter to EVERYONE in your wife's family that she insulted or made uncomfortable.   \nStep two: Have her write a promise letter that she will hold her tunge, and to not speak unless spoken two during the wedding and the rehearsal and the reception.   \nStep three: Understand that this is NOT your wedding, it's your lovely daughters, she gets to decide if grampa is coming or not.   \nStep four: Only ever engage in discussion with you mom with witnesses around, so that she cannot turn it against you.  \n\n\nVerdict: ESH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor context, I'm am in an interracial marriage and my mom has strongly disapproved of my wife since day one, but I married her anyway because I love her and screw what my mom thinks. My mom was still invited to our wedding, but from the moment she arrived she couldn’t stop making totally inappropriate remarks about “slaves” and “second world countries” which made everyone super uncomfortable. \n\nMy wife was in tears and told me my mom ruined the wedding and I was completely with her on that. I cut my mom out of my life after that day and we haven’t spoken since. I’ve now been with my wife for almost 30 years and we have a daughter together who is getting engaged soon to a lovely young man that happens to be of african-american descent.\n\nDespite my strained relationship with my mom, my dad has always been an active part of my life. Unlike my mom, he has never treated my family any differently because of how they look and has even helped raise my daughter over the years, who he adores and is very close with, and has a great relationship with my future son-in-law. I invited him to my daughter’s wedding, but not my mom, for obvious reasons.\n\nUnfortunately, my dad isn’t great at keeping secrets, and the very next day my mom showed up, unsolicited, at my front door. I hadn’t seen her since my wedding and I told her to get off my property or I’d call the cops. She begged me to listen to her and how she was a changed woman, and just wanted to be there for her granddaughter (who she has never once visited). Funnily enough, she never mentioned or apologised for ruining my wedding and offending my wife’s entire family.\n\nI told her absolutely no way she was going to be allowed at my daughter’s wedding and if she tried to visit my house again I would get a restraining order against her. My dad called me afterwards and said that I was too harsh and that I should give her a second chance. He said this could be a good opportunity for my wife and I to “reconnect” with my mom, which I found pretty insulting.\n\nI was really upset that he took her side, considering what she’s done and how she’s acted in the past. Also, the only way my mom would’ve known where I live is if my dad told her, and for her to show up at uninvited means that he didn’t stop her from going to my house. I told my dad he wasn’t welcome at the wedding anymore.\n\nI’m afraid that my dad is going to try and bring my mom if we let him come, and I’m not convinced my mom has changed. Especially since she hasn’t even acknowledged what she did to us. But my wife told me I was wrong to uninvite my dad, and that our daughter will be really disappointed if her grandpa isn’t going to be there. She also said that both of her parents will be there and it will be weird if neither of mine are present. I do feel like maybe I was too unfair on my dad but I really really do not want my mom to ruin my daughter’s wedding.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Agree with those who say the choice of invitation ought to be up to your daughter. Your mom should not have just showed up on your doorstep. As for finding out where you live, well don't your parents still live together? If your dad visits & contacts you regularly it'd be very difficult to keep your address secret. Your wedding was 30 years past. Apologizing for what took place probably wasn't the first thing on your mother's mind. Perhaps she thought best to let sleeping dogs lay. That is a long time to hold a grudge. Whether or not she's really changed her tune, however, that is impossible to say from the info available here. So NAH. Let your daughter decide.", "I’m going to tell you something that may shock you. There might not be a wedding. Your daughter hasn’t even said yes yet. She might say no. Or elope. Or want your mother there. \n\nAlso no one is going to wonder why someone isn’t at a wedding besides the bride and groom. \n\nNta.", "Uninviting your Dad was not really a fair response because there’s no actual wedding yet. However, making a list of expectations with outcomes is very reasonable. \n\n1. If you show up with mom you will immediately be asked to leave\n2. If Mom shows up & you engage with her you will be immediately asked to leave\n3. If either Mom or you create any drama prior to, at or after the wedding you will no longer be able to have contact with my daughter. \n\nIf & when there’s a wedding to plan.... Ask a trusted friend to be your “look-out” at the ceremony & reception. Neither wife or you should get involved with any disruption at the wedding. Your entire focus is your daughter. Unfortunately, you can’t control what other people do so just be upfront with your Dad & explain the consequences. \n\nBest of luck!! \n\nNTA", "NTA. Your mom is a racist asshole and doesn't belong around civilized people. She owes your wife and you apologies. Not sure if your dad all of a sudden feels like your mom is owed a relationship with your daughter or if he's been bringing her around your mom in secret over the years but you may want to ask your daughter. Also if they've never met before and your daughter wants to get to know her the wedding is NOT the time. She can have a lunch with her as an introduction but the more in depth parts of building a relationship and earning a second chance at a relationship with you and your wife should be reserved for after the wedding.", "NTA - Your dad is now a flying monkey (and should be treated as such) but I do think it's your daughters choice who to invite to her wedding. \"She also said that both of her parents will be there and it will be weird if neither of mine are present.\"  Cheezus!  I'm tired of people being so worried about OPTICS at these stupid weddings!", "NTA. Your father betrayed your trust. It's unlikely that he will go to the wedding without his wife.", "This is a hard situation to navigate. Your dad is in a difficult spot....he's stuck in the middle. It sounds like he has a great relationship with your daughter though...so ultimately it should be up to her who she wants to invite to her wedding. Sounds like she'd want him there.", "NTA, but it is YOUR DAUGHTER’s wedding. If she want grampa there he should be invited. If he shows up with your mom, have a friend follow her around ready to whisk her away if she causes trouble. Perhaps she really has changed - or at least learned to keep her mouth shut.", "She will ruin the wedding. I would get a RA. NTA.", "YTA.  This is not your wedding, and the guest list is not yours to control.  You should sit with your daughter and her fiancé, as well as your wife, and explain your feelings and then abide by whatever the wedding couple says.\n\nYour relationship with your mom is a separate issue, and whether reconciliation is possible there is entirely up to you, though of course your wife's views should be deeply respected.", "NTA but it should be your daughter’s decision ultimately.", "NTA - But invite your Dad.  Tell him that your mom is NOT allowed anywhere near your wedding.  Have some of your most trusted friends stand guard outside for when he arrives.  Let your father know that you will have your friends guard the entrance.  If he wants to go, he has to go alone.\n\nBut don’t get too mad at him if he doesn’t come.  It can’t be easy to keep peace with his wife.", "Nta I wouldn't even give your daughter the choice. Wisdom here, you caved she might you learned don't let her make the same mistake", "> that said, I fully support your decision to not let your Mom come to your kids wedding. \n\nShouldn't that be the kids choice though? I'm not saying that OPs mom should go, just that this is a decision for the bride and groom, not their parents", "This is a good comment. I would also add that OP should make it clear that there is a possibility that his mother will show up at the wedding and let it be up to the bride and groom as to whether or not they want to take that risk.", "My grandma is a racist asshole, my husband is black. I chose not to send her a wedding invite due to comments she had said to me (such as she felt it was okay if we got married but forbid us from having kids so that we didnt taint the family blood line), etc. My Mom told her and other family members that their invites just got lost in the mail. \n\nThey came, and they as expected were assholes. Grandma told me to my face I was the ugliest bride she had ever seen and made constant comments throughout the wedding that his family must have chosen this or that because it was so tacky, etc. \n\nI agree that having a relationship with OPs Mom should be up to the kid. But there's tons of times that she can have a 2nd chance that doesn't involve a special day like a wedding. Comments like what my Grandma made have a huge impact on a special day like a wedding. But on any other day would have been much easier to just brush off. Itd make for a bad day instead of a bad memory. \n\nI applaud OP for actively trying to protect his kid from that kind of hurt.", "I get what you are saying but\n\n>chose not to send her a wedding invite due to comments she had said to me (\n\n>My Mom told her and other family members that their invites just got lost in the mail. \n\nYou made a choice, your mom thought she could make a different one, and the day was ruined.\n\nI understand what you are talking about but making decisions on your child's wedding without their input is always a bad idea", "I 100% agree that flowers, venue, food, colors, etc should be up to his daughter. I also agree that having his Dad invited or not invited should also be up to the daughter. \n\nHOWEVER, his Mom has proven in the past to be a mean person who causes drama at public events. I think hes well within his rights as a parent to try and protect his kid from that kind of evil. \n\nIf his daughter pushes for her to come, I think he should sit her down and explain his reasoning for why he doesn't think she shouldnt come and ultimatelyleave it up to her. Honestly I wish my Dad would have placed boundaries like what OP is doing. As someone who lived thru the exact thing OP is trying to avoid I adamantly think hes making the right call when it comes to his Mom. \n\nI think that inviting or not inviting his Dad should be up to his kid. But boundaries should be put in place to protect her on her special day. Like having security or whatnot to ensure his Mom doesn't try to randomly show up uninvited. \n\nIf she wants a relationship, great. Start small like coffee or whatnot. Dont go from no contact to having what is ultimately a stranger come to your wedding.", "A wedding is not the time or the place for a reconciliation. A neutral public place would probably be a better option. She lost that chance when she ruined your wedding. If she was truly resourceful, she would realize that. NTA. You all deserve to enjoy this wonderful wedding without having to worry about that BS. Congratulations to your daughter!!!  Feel free to kick out the parents if they show up.", "Wait, your daughter is getting \"engaged soon\" but you invited your dad to the wedding but not your mom?\nThere isn't a wedding date yet and the person sending invitations and deciding the guest list is your daughter and fiancee.", "NTA, so NTA. Your mom and dad sound like my parents who I am now NC for almost 3 years with (mom for 3 years and dad for 2). My mom is a liar and gaslighter. She had been my whole life, but my dad was always there for me. He would reinforce that he knew the truth and that he “could tell when she was lying.” For 22 years I thought his support for me meant that he loved me and I was grateful to have 1 parent who really cared. So, I cut off my mom after realizing she would never change. \n\nBecause I loved my dad so much it took me another 1 of low contact with him to realize that he never truly loved me the way he should have. He knew she was a liar and emotionally abusive (on top of the physical abuse that went beyond corporal punishment but was still excused as “parenting.) He knew all of this but still defended her, saying that I need to let it go because she “loves” me. They’ve been together 35 years, and for 25+ (youngest child here) he knew how she treated me. He excuses it, making him just as complicit. He did exactly what your dad did and shared information I asked him to keep private and would sneak her on speaker phone when I called. \n\nDo not let your dad get away with this. He may not have said the words your mom did, but he excused them by remaining married to her and sharing your private information. You need to protect your family. That means preventing all harm. Your dad was/is harming you and your family by allowing her in his life and asking you to reconnect with a truly evil person. \n\nOP, you and your family deserve so much more love than you have been given. It’s heartbreaking to cut someone out who was supposed to be your biggest supporter. Ultimately, you need to step up for your daughter and soon to be son in law and be their biggest supporter by not allowing your mom and dad to further cause harm.", "INFO: If this is your daughter's wedding, how come you're inviting and uninviting people?", "YTA it’s not up to you if your daughter still wants her grandfather there. Go made you the sole arbiter of invitations", "NTA. I was forced to invite my grandmother that I despise and I regret not telling my dad not no, but hell no.\n\nThis woman just wants to go around telling sob stories about how she misses her granddaughter. I'd bet money on that.\n\nDon't let her do this to you or your daughter.", "NTA, but it should be your daughter's decision. Tell her everything and let her decide.", "Info: why are you inviting a friend uninviting people to your daughter's wedding? It's not your wedding so why do you get the last say?", "NTA. Technically, yes, it is your daughter's choice to dis-invite your dad, but your dad has now done a big betrayal twice and this time included your daughter in the betrayal. \n\nHe did nothing when your mom went on her original racist rant and allowed her to ruin your wedding instead of getting her out of there. He now let her know where you live and is going against everyone's desire to not have her at your daughter's wedding. You drew clear boundries for him remaining close to your family, and he blew through them. So, although you may have overstepped your role here, you did it after a pretty big betrayal, and your frustration and anger at your father isn completely justified. \n\nA wedding is not a therapy session or a test run to see if someone has changed. Your mother had years to apologize and make amends, but she never did. She doesn't just get to show up now and say she has changed and so everone should act like  nothing happened and cross their fingers that she won't ruin her granddaughter's wedding (and if she does, hope that pops doesn't idly sit by, like he did the last time.\n\nUltimately, your dad has been playing both sides this whole time. He can't believe that your mom's racism and racist actions were THAT bad, b/c if he did, he never would have done this. There were much better ways to approach this if he felt his wife had true remorse. He chose the path where he could both appease his wife (give her your address) but appear to not get dirty (he didn't bring up the subject and there was a chance you wouldn't assume he gave her your location or that he knew about her actions) - which is why I think he has been playing both sides since day one.\n\nDiscuss w/ your daughter what she wants to do about your father's invite. If she decides he is still invited, pay for security for the wedding to make sure your mother is escorted out if she shows. Then apologize to your father for un-inviting him, since you overstepped with making that decision, but that he is no longer welcome in your life b/c he betrayed you, your wife and although your daughter can't see it, he betrayed her as well. Also, let him know that his wife will be removed by security if she shows.", "NTA. Definitely in no world are you, your wife, your daughter or future SIL the AH here. Keeping her at bay is what you need, and you should keep doing so. Her behavior was inexcusable.\n\nHowever . . . speaking as one who was once estranged and made a kind of detente with my birth mother, I will suggest that maybe she has changed. Maybe facing the consequences of a lifetime of estrangement from her son and his family has made her rethink her horrid behavior and beliefs. Maybe.\n\nA wedding is simply too big of a chance to take, though. If - and this IF is totally up to you and the family as you go about keeping yourselves safe - if you wanted to give her a second chance, you could do it at a family dinner at a restaurant where you could leave if she gets out of hand, and then smaller encounters where you could confirm her good behavior. No promises about getting to the wedding, that's not negotiable, but a relationship with her grandchild could result, and if she thought that was important, and y'all felt like it was worthwhile, well great.\n\nTLDR: NTA, you do what you need to do to be safe, and if you want to give her another chance, don't do it at or in preparation for the wedding.", "YTA, but not to your parents - to your daughter. I understand where you are coming from but it isn't your choice to uninvite people from the wedding, it is your daughter's.", "NTA. You are just trying to protect your daughters wedding from being ruined like yours was ruined. Yes, you may have been too harsh on dad. She may have made his life miserable until he told her where you live. I'd say reinstate his invitation with the express understanding that Mom is NOT to come and if she shows up l, she will not be allowed to enter. Then ask a friend (a particularly large friend) to act as bouncer and toss mom out if she shows.", "Exactly. Not sure who OP thinks they are, but bride and groom make guest decisions for their own weddit. OP doesn't have to reconcile with mom, but the bride should get to decide if she wants her estranged grandmother in attendance or not. And pulling grandpa's invite is way overstepping imo. Talk to the bride and offer advice or ask the favor, but don't just unilaterally make the decision for them.", "If it was me and my daughter decided to invite someone who was that awful, I might reconsider attending.", "YTA....for taking away your Father's invite. Based on what you have said his weakness maybe standing up to your Mom.\n\nThere are many ways your Mom could have researched and found your address on her own. Your Father can't control anyone. No one can control another person at the end of the day we are all accountable for our own actions. \n\nI can understand your being upset with your Mom but your Dad has been there for you. Don't ruin that over one mistake that he did not have control over.\n\nIf your daughter wants your Dad there then that is really what matters.\n\nI hope that perhaps someday you can sit down and talk with your Mom and work this out. People are not perfect, people can change, people situations are grey not black and white. Holding on to these negative emotions are draining. Good Luck!", "Exactly. If \"Mom\" wants to reconcile, then she has to do it at OPs pace. NOT at OPs daughter's wedding. Absolutely not, especially since that's what she's demanding. \n\nIt's on mom to prove she's changed, and she's had years to do this, and has not. She wants to be seen at the wedding, because it's a big, public event, and she wants the prestige.  Nope, she does not get to start there.", "Being a racist isn't \"one mistake\". If OPs father can't stand up to his racist wife then he has no right to be upset at being excluded from family events.  And yeah he told his wife, it was no coincidence she found out immediately after her husband was told. Ultimately it's up to the bride and groom but OPs actions are perfectly justified.", "Im not convinced he told his wife, but I dont think thats overly relevant\n\n>My dad called me afterwards and said that I was too harsh and that I should give her a second chance. He said this could be a good opportunity for my wife and I to “reconnect” with my mom\n\nThe point for me is that he took her side. \"Its ok now - she is slightly less racist!\"\n\nThats not a very good argument lol\n\nSo I agree. Perfectly justified.", "NTA regarding your mother. She can't expect to become part of your life again without some kind of ownership to why she was excluded from it for almost 30 years. She needs to verbalize what she has learned and why history won't repeat itself.\n\nIt's a tougher call regarding your father. It's understandable that he would want to reunite the family, but he's gone about it in a totally unacceptable way. It would be harsh to exclude him from his granddaughter's wedding, but it would not be acceptable for him to unilaterally bring your mother without approval on your end. I would say N A H if I could give a split verdict.\n\nUltimately, it should be your daughter's decision as she is old enough to understand the situation.", "It's not your wedding. As such, the only person who's attendance you have any right to influence is you. Your daughter and her husband invite the people they want to be there, not you. If you think that any individual who will be attending will make you uncomfortable then you have the option to not attend. NAH", "YTA. Since when are parents in control of wedding invitations. This should be your daughters choice not yours", "YTA Its not your wedding. You have no rights whatsoever to just uninvite people.", "NTA. Can't believe you allowed them to come to your wedding...", "Racism is disgusting. Nta. Please continue to protect your daughter", "NOPE, absolutely NTA. You are doing right by your family by not allowing your mother to be around them. Your dad is sadly enabling her crappy behavior. She's a racist and a bigot and there are consequences to being that way. She's going to have to suck it up and decide that if she has that kind of hatred inside of her, she's going to have to deal with being treated a certain way for it. Too bad.\n\nCongrats to your daughter on the upcoming wedding! I wouldn't want to take any chances by it being spoiled either.\n\nETA: Is it possible to discuss the reason why you don't want Grandpa at the wedding to your daughter? Does she know the possibility that he may bring your mom along? I totally get why you wouldn't want either of them there, but I'd have a conversation with her and let her make up her mind if it's worth the risk or not. Still NTA though. You sound like a loving dad.", "NTA\n\nThis said you could offer to pick your dad up and take him.\n\nIf your mum wants to mend bridges she can try to do that outside of the big day.", "NTA", "NTA but what's your daughter's opinion about your mother coming or not coming? It's her and her fiancé's wedding, and I think they should have final say (assuming they know the long history here) about if your parents are invited or not (or to only invite your dad)", "NTA.  A wedding isn't the place to reconnect with an estranged family member.  I'd re-invite your dad and tell him that if he brings your mother, *she* will be asked to leave by the security you've hired.  Tell him that if she wants to reconnect with you and your family that she needs to start *now* and not wait for the wedding.  The first thing she needs to do is apologize to your wife and it must be genuine:\n\n\"Dad, mom must admit that she was racist towards my wife and her family and that she ruined our wedding with her behavior.  She should then apologize to my wife and promise to never make those types of comments again even if she's \"just joking\".  If she fails to own up to her behavior, then we won't accept her apology.  After that she must understand that she is on a *very short leash* and the next racist/rude incident she causes will cause her to be cut off.  If she does all of this and manages to prove to us that she has truly changed then we may allow her to come to the wedding but that will be up to her granddaughter that she has never acknowledged until now.\"", "Info: why isn’t this up to your daughter? Also, I assume your mom and dad are still married reading your post? Your dad has remained a very active part of your life but you haven’t spoken to or seen your mom in 30 years? This post is suspect to me.", "\"I'm sorry for acting very abruptly in my decision. I've decided that since - daughters name- is asking for you, I would like to reinstate your invitation; HOWEVER i need to make it perfectly clear. The invitation is for you and you alone. No date, no plus one, and no spouse. If you chose to bring mom anyways she will be escorted out immediately. I'm asking you to consider your granddaughter in your decision as to whether or not you come. The choice is yours but mom is not part of the package. It's not up for discussion.", "And the fiancé’s too, of course, because he’s probably also going to end up facing some microaggressions at the very least. NTA, because grandpa’s continuing marriage to the mom means he clearly doesn’t think racism is a big deal and I wouldn’t want someone like that around either, but this isn’t OP’s wheelhouse."]}