{"id": 8004, "submission_id": "10ir9ar", "title": "AITA for telling a co-worker to get her shitty dog out of my cube after she called me a weirdo", "selftext": " Yesterday afternoon a coworker brought her (35F) new dog to the office to show it off to everyone.  She made the rounds going to everyone's cube and office.  Seemed like everyone was excited to meet it and pet it and all that.   \n\nTo preface the situation with this coworker, I (28M) can't stand dogs.  There is just about nothing about them I like.  I find them obnoxious and gross and people take them places far too much.  I don't understand why you need your dog to run errands or to go out to eat, especially when odds are the place is not dog friendly.   My opinion about dogs, I usually keep to myself and quietly remove myself from situations  \nShe gets to my cube, and says hey this is my new dog, I named him fido.  I just say cool and continue working.  Well my lack of enthusiasm at having a dog in my space was not apparent to her.  She asks me to pet him citing trying to socialize him.  I say no, I'd rather not do that.  I'm sure someone else will pet him.  Its clear that me refusing baffles her.  She asks if I don't like dogs and I respond with i'm not the biggest fan.  She says only weirdos don't like dogs.  I respond with loudly, okay get your shitty dog out of my cube now.  She leaves but calls me an asshole as she moves on.  She's now going around telling the whole office about our interaction.  So was I the asshole?", "created_utc": 1674414156, "permalink": "/r/AmItheAsshole/comments/10ir9ar/aita_for_telling_a_coworker_to_get_her_shitty_dog/", "score": 816, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for refusing to pet my coworkers new dog.  This might make me the asshole because my refusal eventually led me to loudly tell her to leave and I insulted her dog and possibly ruined the relationship with this person. \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. I like dogs and have one myself but I don’t understand why some dog people can’t fathom that not everyone likes them. Even if you love them, you have to admit they can be smelly, obnoxious, and even occasionally dangerous. \n\nYou did what was required of you for politeness and she is an AH for demanding that everyone not only tolerate, but love her dog.", "Nope NTA. Not everyone likes dogs & there’s nothing wrong with that. She started it by calling you an weirdo.", "NTA.  Dog owners who bring their dogs where they don’t belong and insist on others interacting with them are the worst. She was 100% in the wrong for bringing her dog to your cube without asking, demanding you pet the dog, and calling you a weirdo. \n\nIf someone wants to bring their dog around at work, they need to *ask* each person before bringing the animal into their space (“hey, can I bring my dog over to say hello?”) and respect anyone who says no or isn’t interested. It’s pretty basic manners.", "NTA, you said many times you didn't want the dog in your cube, and she kept forcing it on you. And the weirdo comment was rude and unnecessary, so your reaction was perfectly justified.", "NTA.  She asked you to pet him, you said no.  She pressed further and you answered. That should have been the end of it.  She needs to respect others boundaries.", "NTA. People that parade their pet around demanding everyone pet it are weirdos.\n\nIf she's going to go around insulting you she can expect to be told to get lost.", "NTA. Go straight to HR. Tell them that she was in your cubicle, bothering you with her dog, did not leave, and insulted you when you refused to stop your work and pet her dog. And that now she's causing problems and creating a hostile work area. As soon as you said you don't like dogs, the response should have been, \"Sorry, I didn't know. I'll keep him away from you.\" not \"Weirdo!\"", "NTA. She made a jab at you first by calling you a weirdo. You get what you give.", "NTA. I love my dogs, and my dogs love people, but I am fully aware that not everyone is a fan of dogs. It would never occur to me to push my dogs on someone that’s made it plainly obvious they don’t want to pet my dogs. Then she seemed to take it personally and doubled down by saying what she did. Maybe she was trying to be cute, but it doesn’t excuse her ignoring pet owner 101.", "NTA\n\nIf bringing a dog into the office is considered acceptable behavior in your workplace, I’d find another place to work", "NTA. Unless you work for a veterinarian, at an animal shelter or pet store, or other workplace where dogs are normally present, you shouldn't have to participate in your coworker's doggie show-and-tell. It's surprising your employer allowed this, since it was disruptive to people who actually wanted to do their work. If your coworker wanted to show off the dog, she could have held a party at her home where everyone could come and meet the dog.", "NTA. She called you a weirdo! \n\nI like all animals, but I got very tired of coworkers bringing their stinky dogs in my office. At least bathe them first!", "NTA. \nDogs are obnoxious and gross. I love them, but I’m fully aware of their character flaws. \nI don’t even feel sorry for people who dislike dogs, I feel a kind of envy. Imagine not having to live with the manipulative little bar-angels. Or rather, imagine being able to live without them! The money saved, all that duvet to yourself, being able to go out for hours without- never mind, just remembered I’m an introvert.", "NTA. Why would someone take their dog to the office. Strange people.", "NTA. I find most people less pushy with their human children than this one was with her animal \"child\". She should have taken the hint and kept it moving", "NTA. This lady sounds crazy. If I knew someone didn’t like dogs, I would keep my dog far away from them. I definitely wouldn’t call them names", "NTA. I LOVE dogs.  Not everybody does. It's all good.", "NTA", "NTA, but conttact HR to get ahead of the impending talk from a boss.", "NTA, You made it clear that you weren't interested.\ni like dogs but i know not everyone likes dogs.\nWhy would anyone bring their dog to work? I wouldn't appreciate that. Besides being allergic to many breeds, that's anything but professional.", "NTA. What's HR policy on bringing pets to work?", "NTA you're there to work not help train someone's dog.", "NTA\n\n&#x200B;\n\nReport her harassing you with her dog and insulting you over it to HR.", "NTA.  \n\nI am a dog person.  Never met a person I like remotely as much as even a mediocre dog.  I am sure OP’s co-worker’s new dog is a much better person than OP’s co-worker, and probably than OP.\n\n HOWEVER lots of people don’t like dogs.  I don’t agree, but I get it.  Cultural reasons, traumatic histories, allergies, phobias - there all sorts of real reasons people don’t like dogs. \n\nNow, if they come to the dog park or my yard, or the woodland trail system where I walk my dog, to complain, then they can fuck right off.  But in a workplace?  With the dog being literally thrust into their personal space?  Fuck, no.  Co-worker’s  fault 100%.  She should have left OP’s space as soon as she realized they weren’t into it.", "You are going to get plenty of N T A responses from the eye for an eye crowd, but the correct judgment is ESH. \n\nShe was worse but the proper response would be something like “Calling me weird is offensive and hurtful. Please leave me alone.”", "INFO: Where the hell do you work that allows pets?", "NTA\n\nShe's the asshole for calling you weird for not liking dogs, insisting on you petting the dog, and then gossiping about you to your co-workers. \n\nSounds like a hostile environment.", "I'm also going with ESH. You are not required to like dogs and she should respect that its a workplace- no need to force her precious pup on coworkers or shame them. \n\nYour response was harsh though, it sounds like you are aware of that. Instead of the passive aggressive route followed by an explosion, you could've looked her in the eye and stated what you wanted right off the bat. You didn't have to raise your voice or call her dog shitty, so that makes you an AH too.", "NTA, file a  complaint with HR while you're at it.", "NTA\nPart of ‘socializing’ (which she’s using that wrong) is learning how to deal with people that don’t like dogs. Maybe next time she’ll teach her dog to take rejection with a little more grace.", "NTA\n\nI absolutely love dogs but I hate entitled dog owners who think their dogs should go everywhere and everyone should love them unconditionally. There are many people that don't want to constantly be around or are allergic. Your coworker is TA not you", "NTA. You made yourself very clear that you did not want to interact with the dog and she reacted like a child. Might soon be time to get HR on board if she doesn’t let it go.", "NTA. I am a dog person. I absolutely love dogs. But you’re right about people finding the need to take their dogs everywhere with them. It’s ridiculous. Also this coworker of yours sounds annoying. If someone doesn’t like dogs, leave them alone. It’s simple enough", "ESH. She may have called you a weirdo, but you also could have handled it better. Her going around telling people is immature, but likely is happening because of how you handled it.", "Esh. Are you both in grade school?", "ESH: Your coworker for trying to force you to pet her dog, and you for calling her dog \"shitty\".  You should have just said calmly, when she approached your cube, \"I would appreciate it if you didn't bring your dog in my cube.\"  If she pressed, say you can't be around dogs.", "[deleted]", "ESH, but her more than you. Yes, you were rude and should have been more polite in asking her to leave. \"If you speak to me like that, I will ask you to leave.\"\n\nHowever, she was rude in bringing a dog at work and even more so in harassing you. Work isn't a place for pets. Yes, even if socializing a dog is a good thing. \n\n(note: sorry if the word harassing is too strong, I'm French and can't find words sometimes).", "YTA. Sometimes you can be completely right and justified and still be an AH with how you choose to respond.", "Esh. A 35 year calling someone a weirdo? Too funny.", "ESH work is no place for a dog and name calling is just childish but you could have found a more tactful way to ask her to leave", "ESH - she should not have pushed it when you weren’t interested, plenty of people don’t like, are scared of or are allergic to dogs. She was definitely rude and pushy. That said, your response was also rude.", "ESH\nYour final reaction is where you're at fault. \nBut she should have picked up on your first reaction and moved on. Not everyone likes dogs and some people are fearful of them. \nShe had no right to continue pushing or to throw out an insult.", "She’s a weirdo for calling you a weirdo but you took it too far. ESH", "Nta but the shitty one was her not the poor puppy.", "NTA I love dogs, but they aren't everyone's cup of tea, and that's fine she should have taken the first no thanks and moved along", "INFO: What exactly did you say to her? Because you represent your interaction as very polite in the post but in your title, you called the dog a shitty dog. You would be an AH if that's what you said.", "ESH. She is being annoying but you just sound like a grumpy asshole.", "ESH", "YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n Yesterday afternoon a coworker brought her (35F) new dog to the office to show it off to everyone.  She made the rounds going to everyone's cube and office.  Seemed like everyone was excited to meet it and pet it and all that.   \n\nTo preface the situation with this coworker, I (28M) can't stand dogs.  There is just about nothing about them I like.  I find them obnoxious and gross and people take them places far too much.  I don't understand why you need your dog to run errands or to go out to eat, especially when odds are the place is not dog friendly.   My opinion about dogs, I usually keep to myself and quietly remove myself from situations  \nShe gets to my cube, and says hey this is my new dog, I named him fido.  I just say cool and continue working.  Well my lack of enthusiasm at having a dog in my space was not apparent to her.  She asks me to pet him citing trying to socialize him.  I say no, I'd rather not do that.  I'm sure someone else will pet him.  Its clear that me refusing baffles her.  She asks if I don't like dogs and I respond with i'm not the biggest fan.  She says only weirdos don't like dogs.  I respond with loudly, okay get your shitty dog out of my cube now.  She leaves but calls me an asshole as she moves on.  She's now going around telling the whole office about our interaction.  So was I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Why is she bringing animals to her job? What if she get an aggressive pit pull or a snake? Are people supposed to pet them too", "NTA because she simply couldn’t take no for an answer. Sure you could’ve used nicer language, but I don’t think anything less would’ve gotten through to her. Also, she can’t possibly be allowed to bring a dog to work unless it’s an emotional support/service animal. What if she paraded her dog past someone with a serious allergy? Then the company could be liable for allowing their employee to bring a dog into the workplace.", "No.", "NTA\n\nBut everyone at your office definitely thinks you're a weirdo now.", "[deleted]", "ESH \n\nWhy start with a passive aggressive \"cool\" rather than say \"I dont like dogs, sorry\" and therby avoid the whole situation? Her comments were rude and unnecessary as well.", "I mean I kind of agree with her it’s kinda weird that you seem to highly despise dogs… sry I’ll get downvoted idc", "ESH Firstly, hello fellow weirdo. \n\nShe should have taken a hint and left when you confirmed you didn't like dogs. Actually, she shouldn't have brought it into the office at all because it's inappropriate but that's a different bugbear.\n\nYou went from 0 to 100 far too quickly in the rudeness levels. The interaction hadn't escalated to calling her dog shitty at work. You should have just forcefully asked her to leave or turned around and called her out for speaking that way to you.", "ESH! She shouldn't have forced her dog on you and call you weird, but you shouldn't have responded like an AH. If you wanted to show your coworkers something cool that you were really happy about and they just told you that it sucked, I bet you'd be pissed too! And btw being called weird is not the same as being told something you love is shitty, so ESH, but you're a bit of an AH.", "You should have just said your allergic", "Yeah he politely declined interacting with the dog, but she kept pushing. Her behavior was rude and unprofessional.", "FYI the term \"Hostile Work Environment\" is a legal term for someone harassing you based on a protected class (race, gender, sexual orientation, etc.) It's not just someone being hostile to you at work.", "The issue is he said loudly “ get your shitty dog out of my cubicle”. Depending on the hr working, he might also get in trouble. Which is bullshit but wouldn’t surprise me. It’s also not going her fired and would just create more of a hostile environment. So I think it’s got a better chance of backfiring in this situation", "This!", "[deleted]", "Being rude to people who don't respect your boundaries is completely justified. NTA", "The proper response was not to take your dog to work just to show off and get it in every cubicle demanding pets. Also leave as soon as someone tell you \"No\".", "We aren't a dog friendly office.  She brought the new dog for like an hour to meet people.  Apparently some at the office expressed wanting to see it.", "[deleted]", "> Sounds like a hostile environment.\n\nIn the ordinary sense, perhaps, but not the legal sense. \"People who don't like dogs\" isn't a protected class.", "[deleted]", "OP stayed on their cube, didn’t engage with coworker. Then coworker ignored OP politely redirecting them and saying she did not want to pet the dog. What could’ve OP done better? Coworker should’ve respected OP space and not said weird people don’t like dogs.", "Should he be more tactful to avoid offending the dog?  Coworker was being very rude and insulting.  There is no requirement to meet rude behaviour and insults with tact.  OP isn’t a kindergarten teacher.", "Meh, dogs can go to work if allowed. Mine literally chills in my office and sleeps. I bring her a few times a month.  If people want to see her, they are welcome to, and she loves visitors. My boss, in particular, loves to come sit down and scratch her head every time I bring her in, and meetings are conducted in my office when she's there.  If they don't like dogs,   we go meet in a conference room or at their desk.  I also made sure the people in my surrounding workspace were good with it. Also my dog doesn't bark,  so that makes it work.  If she was a barker,  it would not be appropriate at all.", "So she is the aggressor and when his refusal is ignored she insults him and he’s still at fault??????  Are you out of your mind????  NTA at all.", "I represented the interaction in the post correctly.  I did call the dog shitty.  I just wanted her to leave my space.", "Didn't notice OP saying anything about bringing his kids around to his co-workers asking to be petted.", "that's why I didn't capitalize it and called it area not environment. It's definitely hostile to OP and she's making it that way, and HR will want to step in before they have to interview and train a whole new employee because this one is sick of the shit ;) And shitty dogs ;)", "Depends on HR. She may be told to not bother working coworkers, that insults when she does not get her way are not appropriate, and that continuing to exacerbate a situation isn't allowed. Chances are very high she's pulled this before and will pull it again. And yes, OP will probably get chastised too, but the instigator will now have a record as a known trouble-maker. If/when she starts up again with someone else who doesn't like/is allergic to perfume and refuses to smell that wonderful new fragrance, or eat one of her cookies, or whatever, they'll take that second complaint much more seriously. If it's a one-off, no harm to either but she shuts up.", "OP just said cool. He didn’t start off with anything hostile until coworker didn’t respect his boundaries and then insulted him for not liking dogs. Then OP responded with something hostile. Coworker was disrespectful first.", "Boundaries are only valid when they have been clearly established.\n\nBut you're not an asshole for defending your boundaries after someone ridicules them. NTA.\n\nEdit: changed judgement after further consideration. OP did attempt to identify her boundaries directly.", "That's why we have photographs.", "That's not cool. People have allergies. I'm all for dogs in other public spaces, but not a workplace where people can't leave.", "Hostile environment does not require the aggrieved person to be a protected class - it’s not necessarily based on ‘discrimination’.", "[deleted]", "\"Two wrongs don't make a right\". Yes she called him weird, but saying the \"shitty dog\" comment is likely what triggered her to go out and say things to their coworkers. A mature response would have made this solely the coworker being an AH. You don't have to like dogs, but to aim any hostility at the animal because of the human is sucky.", "I think some people are taking OP’s dislike of dogs personally and this is causing them to ignore that the coworker invaded his workspace and wouldn’t take no for an answer.  N the AH, in my opinion.", "Just because you disagree with what did_nah_do_nuffin said, it doesn't make them out of their mind. \n\nGet a grip on yourself.", "ESH means they were both behaving poorly, not just OP.", "Well you seem lovely. \n\nI've gone with ESH simply because both sides have a fault here. \nMainly the woman with the dog.", "[deleted]", "Actually it is based on protected class--\n\n[https://www.ivancielaw.com/federal-employment-law/what-is-a-hostile-work-environment/](https://www.ivancielaw.com/federal-employment-law/what-is-a-hostile-work-environment/)\n\n\"Essentially, harassment occurs when a person suffers consistent and unwanted, and objectively offensive, conduct at work as a result of their membership in a protected class.\"", "\"Hostile work environment\" does in fact require harassment based on actual or perceived membership in a protected class. E.g. sex, race, religion, disability status, etc.\n\nNo amount of shitty behavior will lead to a successful hostile work environment claim unless it meets that requirement. If you don't believe me, check out the many law firm blogs that explain that discrimination is an essential part of a HWE claim, such as:\n\nhttps://swartz-legal.com/how-does-the-eeoc-identify-a-hostile-work-environment/\n\nhttps://eclaw.com/blog/what-is-the-difference-between-a-hostile-work-environment-and-workplace-harassment/#:~:text=Harassment%20is%20what%20creates%20a,supervisors%2C%20coworkers%2C%20or%20clients.\n\nhttps://www.hg.org/legal-articles/am-i-being-subjected-to-a-hostile-work-environment-35920", "Why the fuck does he have to be nice to the dog. He wasn’t harming the dog or being mean to it. He just didn’t want to engage with the dog and that’s his choice.", "I think that mischaracterizes the issue. Her calling him a weirdo was the least of the issues. She invaded his space her dog without asking. He didn’t want the dog in his space and wasn’t comfortable with it. He made that clear politely multiple times and she ignored that, and instead escalated her aggression. Responding harshly was justified at that point.", "Are you concerned the dog would be offended?  OP had his personal space invaded in a manner they found uncomfortable, and the invader insulted them for politely telling them they weren’t into it.", "No, they are very real. Some theories as to why include our obsession with antibiotics and how much time we spend inside (not enough vitamin D). We also went through a period when the medical recommendation was to avoid common allergens with babies, but now we know that small, early exposure is better. Wanna hear a crazy one? My body can't handle birch tree pollen, so every time I eat an apple, my lips itch.", "My mistake!  Thank you for clarifying!", "[deleted]", "I literally explained to you why. I think you just want to feel superior.", "HARD NTA! She fucking Called you a weirdo after she tried to force you to pet her dog. She shluld stop harassing coworkers and go do her job instead of brinfing he rpet to her workplace. Thats weird and inappropriate. Just bcs you dont like what other ppl like doesn't make you strange. Like i absolutely love cats, i could cuddle thrm to death, while my sister absolutely doesn't understand what i lile about them and doesn't r3ally wnant to touch them or doesnt find them so adorable. Doesn't make any of us weidos, we ar ejust different.", "NTA.\n\nI'm not a fan of dogs either. Not everyone is. A lot of dog lovers don't seem to understand this. \n\nYou stated and made it readily apparent to your coworker that you didn't want an interaction with her dog. She pushed it and insulted you, then you responded verbally forceful, to extract yourself from the situation.\n\nFor those talking about HR issues, the company is partly to blame, because, why are they allowing people to brings dogs into the office? If you'd been bitten, they'd have been liable. \n\nHarmless dog? With a permissive dog policy, maybe people will start bringing in their pet pit bulls, mastiffs or rottweilers. One dog that snaps at the wrong time and things will go south fast.\n\nAside from all of that, it doesn't matter if your reason for not liking dogs is a general dislike, an allergy or a fear, you made it clear that you didn't want to interact with the dog and she pushed it.", "Hey I am a dog lover and this fool just didn’t “read the room” and listen to you on the first attempt. I feel bad for the dog; it’s owner is pretty obtuse; NTA.", "NTA", "NTA. I have 2 dogs that like pats from strangers but i don't force it on anyone.\n\nWhen out walking I keep them out of people's way but if I come across someone (usually kids!) Who seem extra interested, or excited, I'll ask them if they want to pat the dogs. If they say yes then I have a command for my dogs that says to approach this person. \n\nThere are days that even I don't like my dogs!! Usually after they do something gross, because dogs are gross. So I don't expect every person we meet to like them either.", "Nta she was out of line.", "NTA your coworker was harassing you with her dog.", "NTA I love dogs. I love all animals. I would never impose an animal on someone that had a clear disinterest in them. I wouldn't go up to anyone with a dog or any animal in fact. I don't know if someone is or isn't afraid of them, or if someone does or doesn't like dogs. I would let people come to me since that means they actively want to see/pet/socialize. Going to everyone's cubes is weird and puts people in a weird position especially if they feel obligated to touch a dog or obligated to be nice or whatever. You were calm and approached it in a calm manner. You did right and she pushed your boundaries. She also unjustly insulted you and then bashed you to coworkers. I'd call that harassment, slander, and defamation of character, but I'm petty. To reiterate, you're fine and I'm sorry you were put in that situation.", "NTA but maybe respond only weirdos think it isn't weird to bring your dog to work? I love dogs but what if someone has an allergy or is afraid of dogs. It seems silly to take the risk of making someone's work-life untenable for your pet.", "NTA. She pushed you to interact with her dog when you made it clear you didn’t want to.", "I'm mad about dogs. Love them! Adore them!\n\nBut I know not everyone loves dogs. Therefore I keep my dog in check around people in case they, like you, don't like dogs. We all have our likes and dislikes. To call you a weirdo for not liking dogs was rude and uncalled for. \n\nYou, sir, are NTA.", "NTA. I like dogs but they shouldn't be in the office.", "ESH.\n\nShe sucks by pushing a dog on you when you're not interested. You suck for calling her dog shitty when clearly she's a dog person.\n\nYou could have clearly explained \"I don't like dogs\" to her. When she said only weirdos don't like dogs, you could have told her you don't appreciate that, or said \"Be that as it may, I don't want to interact with your dog\". Instead you called it shitty, as if that would somehow make things better?\n\nYou both suck here. People can debate who sucks more, but neither of you handled this interaction like mature adults.", "Nta. I’m a huge dog lover but I understand not everyone feels the same. You were under no obligation to pet her dog regardless if she was trying to socialize it or not. Socializing it is her responsibility as the owner, not yours.", "NTA she should’ve got the ham from the very start and it’s completely inappropriate for her to bring the dog to work and force it down other people’s throats not knowing if someone’s allergic or not", "NTA. I love dogs but I don't expect everyone else to. She called you a name which is inappropriate now she's gossiping about you. Speak to HR if it continues. Your lack of enthusiasm could be due to allergies for all she knows.", "NTA, and I love dogs!  I didn't used to, and I have to be in the right mood, which is why I don't own any.  They're generally dumb enough that you have to watch or contain them (they'll eat anything that will kill them), kinda messy (I've seen what else they lick), and usually have at least *some* kind of odor.\n\nYour coworker was bad at picking up on social cues and responded terribly after realizing her mistake.  If she is telling coworkers, feel free to also tell them your side of the story about how she held you verbally hostage (I love this phrase for someone who won't end a conversation that needs to stop) then called you an asshole for having an opinion that she asked you about.", "NTA. A dog I grew up with killed my cat that I had for way longer, I'll pet them occasionally, but I don't like dogs either. She was trapping you in a shitty situation and was a dick about it too", "NTA - I love dogs (don't have one right now) but I would never do that. Anyone can be allergic, or scared of them. If you have an HR dept ; put in a complaint.", "You aren’t the A - hole, she gave you a rude compliment when you did nothing to her and you retaliated.", "NTA I actually like dogs but won't interact with every dog I encounter especially if I'm busy.", "NtA. She should have said OK, and left your cube. She's the AH.", "NTA in the grander situation, but I do think the response itself was over the top, though in situations where something you don’t like is in your personal space I get it. But she was wrong first by trying to force you to like her dog. Also, her getting under your skin totally probably startled the dog. It’s best to socialize them with people who are friendly to them anyway.", "NTA, I'm a dog person, but I would never bring my dog to work or make others interact with him.\n\nHe is a pet and has no place at work.", "ESH, but the colleague sucks more. You really shouldn’t have lost your temper like that.", "NTA. I'm a veterinarian and not a huge fan of dogs in offices. At my last job my coworkers would bring in their hyperactive, hypersocial dogs and let them run around free. They would try to eat my lunch out of my bag and would nudge me incessantly when I was trying to write up records on my computer. The cherry on top was my coworker having a screaming meltdown because her dog ate a wrapper out of my TRASH CAN like I was some sort of monster for using it as a waste receptacle.", "If you don't think you were TA , why are you worried about her telling people about your interaction? Normally people only worry about this if they've behaved in a way they're ashamed of.", "ESH. I am a dog owner who loves dogs, and am super interested in socializing them. That said, if someone's body language is hesitant, I'll *use my words* and ask if they want to say hi. If the answer is no, I say brightly 'nevermind then! Have a nice day!' and move. the fuck. on.\n\nThat said, OP was super rude about it for no reason. Yes, being called a weirdo and made uncomfortable at work isn't okay. But respond to it professionally, goddamn. I have been in pretty much this situation many times with human babies, because people expect me to want to coo over a baby and I... don't like babies. ¯\\_(ツ)_/¯ I have *never* told someone to get their shitty baby away from me.", "ESH.\nI don't like dogs either, and lots of people can't understand that.  Insulting people is not necessary to stand your ground, though.  A simple,  \"No, honestly, I don't want to, please could you take him out\" would have done it eventually.", "Calling a dog shitty is rude but you’re NTA, people need to learn boundaries.", "I’m going to say ESH. It seems like you were pretty rude just ignoring her and continuing to work. You could’ve just phrased it in a more friendly way like, “hey cool dog, I’m not real comfortable around dogs but thanks for bringing him by.” Instead everyone escalated. I agree with her that weirdos don’t like dogs (sorry OP) but she shouldn’t have said it! And you shouldn’t have yelled.", "You're not an asshole but maybe manage your temper a lil at work.", "NTA but you didn’t handle it very politically. Your very understandable annoyance got the better of you.\n\nIf anyone asks you about it tell them Janet refused to take no for an answer and than insulted you.\n\nEveryone fully gets those two things. Don’t litigate this over the dog.", "I love animals in general. Dogs being at the top of the list.\n\nI have the common sense though of not hoisting a dog at people randomly. You always check if people are okay with the animal first and if the animal is okay with the person. People might have trauma, fears or allergies.\n\nI like cake, but I'm not going to try to force feed someone cake and then be all \n\"Only weirdos don't like cake!\",\n\"eat my cake!\", \n\" OP is a AH, because OP told me to take my cake elsewhere!\"\n\nSimilarly I wouldn't bring a snake into the office and expect everyone to pet it....then again I'm in Aus so maybe more co-workers would be open to petting a non-deadly snake. Still wouldn't force it or exoect them too.", "Completely agree, you acted polite and she was asking for to much love", "exactly", "> Your response was harsh though\n\nYeah, so is calling someone a weirdo for not wanting to engage with you.  100% justified.\n\n>Instead of the passive aggressive route followed by an explosion\n\nCan you quote anything OP typed that was passive aggressive?  It sounds like the coworker with the dog was overbearing like a drunk jock at a bar who can't tell the woman he has cornered is clearly uncomfortable and looking for an exit.\n\n>You didn't have to raise your voice or call her dog shitty, so that makes you an AH too.\n\nBut it was justified, since the coworker wanted to throw insults first, NTA.", ">She gets to my cube, and says hey this is my new dog, I named him fido. **I just say cool and continue working.** Well my lack of enthusiasm at having a dog in my space was not apparent to her. She asks me to pet him citing trying to socialize him. **I say no, I'd rather not do that.** I'm sure someone else will pet him. Its clear that me refusing baffles her. She asks if I don't like dogs and **I respond with i'm not the biggest fan.**\n\nOP was \"harsh\" only after the co-worker started with the name calling, after she was told three times to leave. That wasn't \"passive aggressive\". That was an upfront \"not interested, leave\".", ">That said, your response was also rude.\n\nThat's exactly the response someone who is rude and pushy deserves to get.", "> a more tactful way to ask her to leave\n\n> I just say cool and continue working.\n\nThat social cue could not have been more obvious.  If you hit on someone and they tell you \"cool\" then turn around and go back to what they were doing, do you persist, or leave them alone?\n\n>She asks me to pet him citing trying to socialize him. I say **no, I'd rather not do that.**\n\nWhat do you think OP meant by this, or do you mean this wasn't tactful either?\n\n>She asks if I don't like dogs and I respond with **i'm not the biggest fan.** She says only weirdos don't like dogs.\n\nAnd the **THIRD** time OP made it clear they weren't interested, the coworker resorted to personal insults.  OP was nice enough to insult the dog and not say something hurtful back to the coworker.  Coworker should have taken the L, not tried to rile up the office to defend her being an overbearing asshole that can't read social cues.", "OP was very clear about their interest in the dog, and has no obligation to make up an allergy to avoid a personal pet brought into the office.  That would honestly make OP the asshole if they were to claim an allergy or other reason they can't be around them, as that would surely mean the coworker can't bring the dog in the future.\n\nIf you verbally insult somebody over nothing, it's 100% expected to get it back.", "[removed]", ">You always check if people are okay with the animal first and if the animal is okay with the person. People might have trauma, fears or allergies.\n\nI don't even really understand how dog-friendly offices are a thing considering allergies (my brother's allergic to dogs) and the liability from both that and if a dog ever became aggressive and bit someone. It just sounds like something that could really get a company in trouble, therefore, not worth the risk.", "I would pet a non- venomous snake, but it just occurred to me,  it might  try to bite me ?", "Pretty sure insulting a coworker is worse than insulting a coworker's dog after they can't take a hint then insult you first.  If HR comes after OP also, it's just a good sign it's time to find a better place to work.", "Being justified and being an AH are two different things.  \n\nAnd truthfully, I think being rude is rarely justified.  Even if I agree it feels great sometimes.\n\nOP could have told coworker to leave firmly, professionally, and politely.  But chose not to. OP forfeited any high ground they had in that moment.\n\nDo I blame OP for being an AH?  Not a bit.  But that doesn't make them somehow not an AH.\n\nESH (but cheering OP on anyways).", "Not necessarily while at work. I agree with NTA, but \"shitty dog\" could be interpreted by HR or management as \"used profanity at another employee\", which may be an actionable offense.\n\nDon't roast me over it, people! If I was OP's manager, I'd be on his side and actively defending him. But it was still a mistake that hurts his case.", "I don’t disagree. It just may come back to bite OP in the butt. Office politics are rarely fair or unbiased.", "[removed]", "No, she was the one who called HIM a weirdo.", "He didn't call her weird. She called HIM weird. He just said for her to get her shitty dog out of his cubicle. I don't know where you got dirty from.", "She called him weird", "I can understand dog friendly offices, if everyone that works there knows it's dog friendly or part of the office \"culture\".\n\nI don't have much experience with it, but I'd expect it being something you told or know before you take the job. \n\nI do feel like every place I've been that's dog friendly, people know to only bring well trained/behaved dogs to the office. You still responsible for your own dogs behaviour, and there are waivers to sign if you want to bring your dog in. Etc", "My office is dog friendly. We actually have a huge fenced in area behind the office so that people can let their dogs run around on their breaks. But there are rules, mainly that you have to ask first before bringing your pooch in and it has to be leashed at all times when moving through the office (there is one person who is a bit scared of dogs and would not appreciate even a puppy running up to her). And of course, there's essentially a one strike policy that if the dog in any way shows aggression or is out of control, it's not coming back in again. \n\nBut it's also well known who in the office is not a fan of dogs, so people don't just wander around with their dogs, and their is only one person in the office whoi is allergic, but as long as she doesn't actually touch the dog, she is fine.", "Depends on the snake and the situation. A snake that is handled a lot and is treated well isn't likely to bite. I used to have a boa and I handled it all the time, and he was a peaceful guy. A snake that spends all it's time in it's enclosure and is only rarely brought out definitely might bite when it gets nervous.\n\nAlso, if you're dumb enough to handle raw chicken and then put your hand in your snake's enclosure, yeah, you're probably going to get bit (source: me doing the dumbest thing possible about 30 years ago)", "If you're telling HR you're best avoiding terminology such as \"Hostile\" all together as it will likely not go down well. You can say your coworker was innapropriate and boundary crossing, but misusing legal terms will likely cause them to not take you seriously.", "> Being justified and being an AH are two different things. \n\nI couldn't agree more, OP was justified, not an asshole.\n\n>And truthfully, I think being rude is rarely justified. Even if I agree it feels great sometimes.\n\nOP and I seem to be the same way, but when someone is over the top rude, it often slips out.\n\n>OP could have told coworker to leave firmly, professionally, and politely. \n\n> **She asks me to pet** him citing trying to socialize him. *I say no, I'd rather not do that.* I'm sure someone else will pet him. Its clear that me refusing baffles her. She **asks if I don't like dogs** and *I respond with i'm not the biggest fan.*\n\nIf nothing here tells you, \"I should go,\" you are absolutely dogshit at picking up on social cues.  OP made it very clear, very professionally, that they weren't interested in the dog, nor the interaction as a whole.\n\n>But chose not to. OP forfeited any high ground they had in that moment.\n\nJust because you're bad with people doesn't give you the right to insult them, OP doesn't lose shit for trying to be polite.\n\n>Do I blame OP for being an AH? Not a bit. But that doesn't make them somehow not an AH.\n\nYes it does.  NTA 100% OP, fuck this snowflake and the one you work with.", "> She asks me to pet him citing trying to socialize him. I say no, I'd rather not do that. I'm sure someone else will pet him. Its clear that me refusing baffles her. She asks if I don't like dogs and I respond with i'm not the biggest fan.\n\nSounds like OP tried, very respectfully, to set boundaries, and got called a weirdo for it.", "He tried to set boundaries. She didn't listen. Go back and read it again, sunshine.", "People on this sub are very volatile. I'm fine with the downvotes. Reasonable heads are not common here.", "Yeah, rationality goes out the window for some people when dogs are involved.", "Sounds discriminatory to me. If I’m allergic to dogs I can’t work there? Maybe even just have asthma or a phobia?", "You're right, she did. My point was that bringing the dog around initially wasn't a breach of any boundary because the boundary hadn't been put in place yet.\n\nEven so, you do have me considering this a bit more. While the coworker didn't breach an existing boundary, she judged and belittled when OP tried to put the boundary in place, and that's why she sucks. Coworker is an asshole for pushing back against another's boundaries.\n\nOP's response seems a bit dramatic in my mind, which is what earned the initial ESH. I'm generally in favor of de-escalating when possible. That said, I also believe it's important to stand firm in ones boundaries. OP was rather direct, she was dismissed and her preference turned back against her. What was she to do but to enforce her boundary more emphatically?\n\nOP, sorry for the snap decision on my part. My judgment is amended: NTA.", "Agreed. You'll see that my comment has been edited and I've left further thoughts [here](https://www.reddit.com/r/AmItheAsshole/comments/10ir9ar/aita_for_telling_a_coworker_to_get_her_shitty_dog/j5gvrkz/).", "No, but perhaps you should re-read the OP's message... when she arrived at his cubicle all he said in response was \"cool\". Not anything about being uninterested until she specifically questioned him. Again, why not immediately head her off and say something like, \"That's great, I'm glad you're happy. I'd rather the dog not be in my cubicle though but I'm sure everyone else would be happy to pet him.\" Same message, but actually polite instead of dismissive. Most people with dogs are not used to others not liking dogs because it isn't a common thing. So then yes, her calling him weird was uncalled for, but the lack of owning his own space in a polite way and then calling the dog shitty and being rude too still makes him suck. \n\nYou can disagree, but I stand by my thoughts on this.", "You seem pleasant. This does t appear to affect you, so why are you crying discrimination? I work at a dog-friendly office and I’m sure they have made accommodations for those who don’t want to or can’t be around dogs.", "Would you apply to work at a vet's office?", "Perhaps it's discrimination, what I'm about to say isn't what I believe to be ethical or my moral values.  It's more of a harsh  and honest  talking from experience and reality.\n\nI don't think they would can actually say you can't work there, because of your allergy or fears or phobias. \n\nI think they try to frame it more like, this is the enviroment and and if you want to work here it's YOUR choice, or they might push you back and just say you weren't the best candidate.\n\nJust like they wouldn't actually say, \"We don't want to hire women, older people, or people with a disability.  Unless you like some stand-out applicant, it would be hard to prove discrimination.  if theres another candidate thats the same qualifications as you but likes that enviroment, they can just say the other candidate fit into the role better.\n\nI mean if 99% of the office came to work and enjoyed that they could have dogs around, would you hire a person that would force the entire office culture to change to take into account your allergies. iit's not exactly a great way to make a first impression. \n\nAgain, I'm not excusing it or justifying discrimination. I'm just going by what I have seen from my limited experiences in dog or animal friendly office spaces.", "> \"That's great, I'm glad you're happy. I'd rather the dog not be in my cubicle though but I'm sure everyone else would be happy to pet him.\" Same message, but actually polite instead of dismissive.\n\nBecause that's a whole fucking conversation on \"oh my gosh why don't you love dogs they're so cute?!\"  OP doesn't owe them any explination, and made their level of interest very clear by being nice and giving a \"cool\" then going back to work to signify, \"I'm going back to work now.\"\n\n>Most people with dogs are not used to others not liking dogs because it isn't a common thing.\n\nMost people with dogs understand personal boundaries though, right?  Right?", "NTA. I love dogs but it doesn't matter how I feel about dogs, it matters how you feel about dogs.\n\nYour reaction was pretty strong but TBH I don't blame you for being insulted. Some people will probably paint you as the bad guy for that but, honestly, I wish more people would react strongly to being treated poorly so fewer people would do it to begin with.", "NTA. File a complaint with HR, what she is doing is considered creating a hostile work environment.", "I like dogs, but you NTA\n\nYou're allowed to not like dogs, and frankly to bring a pet (not a service animal, just a pet) to work is not the best idea, especially without forwarning the office manager. There are people who may hae innate fears, or allergies.\n\nIf she indeed called you a wierdo, and is now dredging your name, I would report it to the office manage.", "I mean, you were kind of insensitive to the dogs feelings by calling it shitty.", "NTA\n\nI own dogs but dog owners have a duty to make sure their dogs don't harass other people, especially those who don't like dogs or are scared of them.\n\nIt's ridiculous for someone not to simply move on when one of their co-workers is not interested in their dog, especially if their dog is in that co-worker's office space.  To start calling someone names and keeping their dog in that person's space, after they have expressed a dislike or unease with dogs is harassment.", "NTA\n\nPeople have commented repeatedly, not everyone loves dogs & will fawn over them. Reasons why someone may not want to interact is no one's business nor hers.\n\nShe doesn't have any control of what you do privately & don't like in an office environment. \n\nI had both cats & dogs. One of my coworkers was very leery about getting a ride from me. She has a severe allergy to cats. I wasn't offended because no matter how hard I try, they'll still be hair somewhere. I also have a severe allergy to perfume. I pray no one tries to spray me with what they think is a nice perfume. It could put me in the hospital. \n\nPeople can be stupid & ignorant not thinking or caring. I had invisible disabilities, then had a car accident so now see a limp but didn't understand before. I could have seizures & get ill suddenly. It's not funny, but many clueless people actually demand to know why I needed to park in a handicapped space or get priority seating on airplanes. Why? \n\nI even had an airline attendant demand to know why I had an emotional support dog. I refused to tell her & stated to her didn't have to tell her as gotten approval the day before & was allowed. (My dog was an angel throughout the flight & majority didn't know was on the plane.)\n\nI don't know these people's lives why must they know mine & approve my disabilities? Exact issue here. Why must you justify to this coworker why you don't want to pet or be near the animal? It's not yours! Simply put.\n\nAdd, I have a rescue German Shepherd. It acts funny near 'new' people. My aunt and I are fine, but it doesn't like men. Why would I knowing this, bring it into a workplace? I wouldn't. \n\nA puppy being petted just once isn't going to get that familiarity/sociability with strangers. Assuming it will be friendly later on is reckless. This is a one & done. It takes more than a visit being around strangers is a poor excuse. She needs to appreciate whether large or small many don't like dogs for majority of reasons & can't just change some one's opinion like that.", "NTA. You don't like dogs your choice. Dog lover here. The second you decline. Time for me and my kid to move on. I'm not forcing my guy to deal with you. Or reverting to name calling. Pet policy for your company. I'd say HR but that cuts both ways.", "I think it's as inappropriate to bring animals to a place of business as it is to bring your child. I love dogs and I probably would have had the same response as you did because that only encourages management to allow it to continue.", "Like where do you work that people just bring animals into the office?", "NTA. Co-worker is the kind of person who gives dog owners a bad name.", "NTA. I didn’t bring my baby to work to show her around when she was just born. It’s weird someone would do that with a dog. And I love dogs and own two.", "NTA dogs don't belong in the office unless it's dog friendly space. BUT you messed up calling her dog shitty. That's the only part most people are going to listen too. You got pretty aggrssive pretty fast for a work setting. \n\n\"Can you please remove Fido from my space.\"", "NTA while you weren't the most polite, she was TA for trying to force the dog on you instead of seeing that you clearly didn't want to interact with him and walking away.", "YTA. I understand you’re perspective but\nYou over reacted. When she says “do you like dogs” just say “no” and move on.", "Nta seek upper management tell them.", "Lol this had me giggling for a sec. NTA", "**NTA** \\- Let's play the \"what if\" game...What if you had a intense fear of dogs? What if you had a mega allergy? \n\nNow, she made assumptions that everyone would be cool with her bringing her pet to work and it doesn't sound like she really gave a lot of thought to why this wouldn't be ok. It doesn't matter if you have a fear of dogs vs an animal allergy vs just not being a fan. She should have checked with everyone before considering whether bringing her dog to work was ok. \n\nI'm a dog person. Love them and am crazy for them. But that doesn't mean everyone in the world wants to lavish their affections on my dogs (I'm sure my dogs would love that). Some folks are cat people, some are fish people, some are don't-bring-animals-near-me people...only cat people are weird! (Just kidding cat people...you crazy and we know it!)", "NTA but you could have handle the situation better  I also don't like dogs. But because I am in my working place, I wouldn't have escalated the situation as you did.", "Soo NTA I love dogs and cats but I dislike owners who feel that everyone else should love their animal too.. You told her and showed her by you actions you weren’t interested in her dog. She’s the ah for not taking the hint and moving the hell on..", " NTA - I don’t understand this kind of dog owner. (Also not much of a dog person, I’ve been bitten 20+ times in my life)", "NTA. I LOVE dogs and would adore a dog friendly office. But the correct way to balance that with a coworker who doesn’t like them is to prioritize that coworker’s comfort. Definitely not insult them! Dogs are annoying tbh!", "NTA! You should not be forced to interact with someone’s pet.", "NTA. I work at a national dog organization and we allow dogs in the office. All dogs have to pass a test to be allowed in someone’s cube and if a cubemate doesn’t like dogs/is allergic/is scared of dogs, we accommodate them. We don’t call them “weirdos.” \n\nYour coworker is weird and an AH for assuming that everyone thinks just like her.", "ESH. She was pushy and rude, but you should behave professionally at work and did not do so.", "NTA everything was ok until she called you a weirdo. At that point she should have left you alone not called you names.", "NTA.\n\nWhat if you had attack related trauma? Or a severe allergy? Or a minor allergy? Or...you know...just didn't want to?\n\nYou don't need a reason to justify not touching her dog. No means no.\n\nOnly weirdos try to force what they love on others.", "NTA.", "NTA. I adore animals, but I'm partial to snakes and cats. I recognize that they aren't well loved, so I don't force them on anyone. I also dislike interacting with animals I don't know, and thoroughly dislike it when someone expects me to interact with their dog. Furthermore, I think you telling her to get her shitty dog out of your space is justified. If someone called me a weirdo, I'd have called them worse and told them to gtfo. \nSeriously, some pet owners need to learn boundaries.", "NTA.\n\nShe shouldn't have shamed you or insulted you for not liking dogs. It's as normal to not like dogs as it is normal to like dogs.\n\nBut in saying that, you shouldn't have swore at her in the workplace if only because that is something that can come back to hurt you. My suggestion would be to go to HR and let them know she is attempting to weaponise your totally valid feelings about her pet to spread gossip about you and influence negative opinion of you.", "NTA. What's so hard about respecting people's boundaries? Im a bona-fide crazy dog lady and I always ask before any interaction involving my dog and/or another dog or person.", "NTA. I love dogs and I think SHE is the one who was acting weird by not accepting “no” for an answer. Like you said, plenty of others were more than happy to pet it, you not petting it was not going to send the dog into a depressive spiral.", "NTA! Dog people can be so entitled. Lots of people don’t pet dogs or interact with them for allergies and cultural reasons. But you don’t need to give a reason at all. Your coworker is being awful and now is creating a hostile environment for you. I’d report them to HR.", "NTA. And no is a full sentence!", "NTA. I, personally, love dogs, but I do understand that not everyone does. You refused politely several times, and she insisted on being pushy and rude.", "Lol. NTA", "NTA. I don’t like dogs, I don’t hate them but they do nothing for me. She didn’t respect your space and your preferences. She’s the AH.", "NTA. This isn't about dogs, it's about boundaries. She  was disrespecting a clearly laid reasonable boundary and insulting you to boot. Not ok. \n\nAnd I'm like the biggest dog lover ever fyi.", "NTA - I have 2 adorable dogs and get a lot of \"Can I pet your dogs\" requests. If I'm walking by a long line for an event, I offer \"Free pets for people waiting in line.\" But, I always watch people's faces and keep them away from those who show any ambivalance or dislke. It doesn't matter what their reasons are. I respect and appreciate their choices.\n\nThis \"only weirdos don't like dogs\" is so untrue. I love companion animals, so I just accept that there's dog hair on my clothes. I accept that they walk in / roll in / lick gross things and then want to lick my face and hang out on my furniture. It's possible us dog lovers are the weird ones and our basic hygience is questionable at best. (shrug) It takes all kinds.\n\nGo to HR. She's the worst.", "NTA she insulted you first and was annoying you with her dog. I love dogs but you’re in a workplace and animals shouldn’t be forced on someone. If someone brought there kid into the office I might have reacted the same.", "Nta", "NTA\n\nWhat I want to know is who is going to clean up after that animal when it pees or poops in the office?  Why on earth would she bring it in, this is not a place for show and tell, that is what a child does in kindergarten, not in an office place.  \n\nYou may want to talk to your boss and get ahead of the situation if she decides to escalate and go to HR.", "NTA (and I’m a dog lover)", "NTA. I absolutely love dogs. I have a roommate who has a service dog and thus we bring her literally everywhere. I feel like my life is greatly enhanced by having a dog around constantly. HOWEVER. I would never ever force interaction with any dog on anyone. You tried to decline and she should have accepted that at first denial.", "NTA, she should not have tried to force her dog on you. You don't care for dogs and that call is yours and only yours to make. Then telling someone who can't be arsed to show any manners to leave is only normal.", "Definitely ESH. She should have taken a hint, but cussing at her was probably a step too far for a professional environment.", "NTA. I’m personally indifferent to dogs and don’t enjoy their company much. If a co-worker brought a dog into my office or cube I’d react pretty much the way you did. And your co-worker was the first person to throw insults — not you.", "YTA: “get your shitty dog out of my cubicle”. Yo. That‘s just what a weirdo WOULD say.", "YTA for being mean to your coworker and escalating the situation unnecessarily. You could have just smiled and been like yeah I just don’t like dogs. Or lie, say you’re allergic. Jeez.", "YTA, simply bc who doesn’t like dogs? 🤢", "ESH\n\nI don’t like you OP. Like, at all. I don’t trust people who have this kind of attitude toward dogs. You’re also impolite. Your final response was over-the-top and unnecessary. \n\nBUT, you have the right to not like dogs and not be around them. It sounds to me like the woman missed some of your social cues because she was expecting a positive interaction. She was wrong there. Then she just blurted out something she definitely should not have said (which I also would have been thinking but would not have said to your face).", "ESH. \n\nYou had the chance to do the bare minimum and just reassert your boundary, but instead you chose to become juvenile and combative.", "YTA", "ESH\n\nyour reply was rude and unnecessary. You should have simply replied that her comment was very rude and you were offended. That would have (hopefully) shamed her into making an apology, even if she didn’t, you would have come out as the better person and could have even complained to HR", "Some owners live vicariously through their pets. Petting fido is like striking their owner. It's like a fetish.", "Especially if you like dogs, you shouldn't hand it around stranger to pet it. The poor dog. As if she used the dog for attention. \n\nI also don't like dogs. Some i like but this are because of the dog itself, not of the breed. Anyway... I think you don't need to like everything. Like i'm a crazy bird person. That’s not for everyone. I don’t push my birds on people. \n\nYou can be excited of your pet, but don't expect that everybody share this. And to show of your pet at your workplace?! Does this lady has no friends or family who she can show the dog? I never experienced a get-to-know with the new pet of your co-worker...\n\nNTA", "It's like calling their baby ugly.\n\n(I have one, BTW. Pitchforks down.)\n\nESH for losing your cool.", "This is absolutely not worth going to HR and that would only make OP's reputation around the office worse.  HR is there to legally protect the company from lawsuits and fines, not to make a federal case when two employees have a mildly rude interaction.  OP is already \"that guy\" who hates dogs and loudly cursed at a coworker, and now you want him to be that guy who runs crying to HR because someone indirectly called him weird?\n\nYes the coworker was rude and should've just apologized and left the second OP said he doesn't like dogs, but there is where reddit and real life experience are going to differ.  In real life no one wants to be the person in the office who runs to HR every time there's a minor conflict.", "I like dogs, I don't like distractions when I'm trying to work.", "Not OP,  but off the top of my head, I can think of four employers in my town that are dog-friendly. Two are solar energy tech companies, one is an educational tech company, and one is a publisher.", "This is where I stand. You can kill three birds with one stone by saying you're allergic. 1) reason not to pet the dog 2) nobody brings a dog in again 3) de-escalate the situation. \n\nSome dog lovers really are clueless and can't imagine anyone not loving dogs. Can it be rude and annoying? Yes. Is it coming from a malicious place? No. \n\nCalling the dog shitty was uncalled for.", "LoL this is real life not sesame street", "He said no, it wasn't respected. He had to call her out. \n\nNTA", "Lol no op is not the asshole here\n\nCrazy dog lady is", "Too far? 3 no's is too far?", "Because he has boundaries? YTA too", "She went from 0 to 100. Not op", "Do dogs comprehend insults?\n\nHe said no 3 different times in different ways. She's a total AH", "Because he doesn't like dogs? Wow... Shallow", "Because he doesn't owe her anything 😂 \n\nShe's an ah", "He was insulted in the office. \n\nShe's a huge ah", "I think it was rude and unprofessional to bring the dog into an office to \"socialize\" it to begin with.", "Probably depends on area but here you can definitely create a hostile work environment not based on protected class. Our HR guideline just says repeated unwelcome conduct. Ones that are based on protected classes would be human rights violations on top", "Yes because screaming at your coworkers is a normal healthy thing to do.", "Don't be willfully obtuse, clearly im not saying the dog was offended. Nice try being clever though. Dog owners would absolutely take offense to how he spoke about that dog. And like I said, they both suck. An argument can easily be made the dog owner sucks more, and that would be my argument. But OP is no innocent in this, they're just not as big an asshole.", "Shes his co-worker, you do owe it to your coworkers to be polite. You can be polite and firm if they dont take that as an answer and escalate as needed. \n\n\nI literally said shes an asshole.\n\nHe just set this up. He could have avoided the whole thing by starting with \"no thank you\"\n\nIt would have cost him nothing but he was pissy insteadm", "Because dog-lovers think allergies are just weirdos' who don't like dogs excuses not to hang out with them.  Or my personal favorite: \"you can't be allergic to MY dog; he's a sweetie.\". We don't exist in dog people's world.", "All that on top of the mess dogs make, like what if one goes to the bathroom on the carpet, which is esp unsanitary in a breakroom or kitchen, or chews on something, hell, what if one chewed a cable and either got electrocuted or broke expensive equipment? Yeah, I don't understand how offices can be dog friendly either.", "OP showed professionalism in a firm manner and this got her nowhere. \n\n>She asks me to pet him citing trying to socialize him. **I say no, I'd rather not do that. I'm sure someone else will pet him.** Its clear that me refusing baffles her. She asks if I don't like dogs and I respond with **i'm not the biggest fan.**\n\n&#x200B;\n\nIf OP immediately was rude, I would agree, but being polite to people who can't take no for an answer will get you nowhere. Being rude was necessary here.", "Yeah it’s an unpopular opinion around here, but I have to agree. The coworker was worse without question, but raising your voice and saying “get your shitty dog out of my cubicle” Is still an asshole thing to do", "\"loudly\" doesn't equal screaming buckaroo", "Op expressed boundaries, said no, called her out after he was insulted. He can't be an asshole. \n\nThe only asshole assumed he would like her dog", "Yeah, she fumbled already. Assumed everyone liked her pet, entered his cube without permission, insulted him \n\nHe said no 3 different times in different ways", "I have experience with it, I LOVE dogs … and it sucks \n\nTo start with you’ll have well trained/behaved dogs, it’s great!\n\nbut then the company starts to grow or even just with staff turn around. Inevitably then come the people who feel entitled to bring their dog … even if it’s not the best suited to the office environment", "Gordon Ramsey has entered the chat.", "Thank you was going to reply the same thing. To me I feel it's similar with most animals really.\n\nThe animal needs be used to being handled and the person approaching the animal needs to know how to handle the animal correctly.\n\nUsually things go wrong, when the animal is scared or startled, the handler does something incorrectly, or becomes complacent when handling the snake\n\nSome snake handlers  I spoke to said they like to handle their snakes atleast every 2 days. (these aren't for petting). The petting snakes they try to handle daily, because they go to schools as an awareness program, and they need the snaeks to be okay around kids.", "Is it weird that I read that in Sam Elliott's voice?", "No?  The thing is, OP never asked the coworker to leave. \n\nAnd that is the part that I meant needed a professional and firm response to.\n\nPeople keep saying OP was setting boundaries, but the only real boundary OP set is that there would be no dog petting.  \n\nAs I see it, up until the insults started, it was just a rather benign conversation.\n\nIf OP had told coworker to leave, (before or after the insult) and coworker didn't?  That would be a different story.\n\nEdit:\n\nI think the big disconnect is the definition of what makes someone an AH.\n\nSome people think that if the AH behavior is justified/understandable, it stops being AH behavior.\n\nI don't.  I think the behavior is still AH behavior, I just understand why it came about like it did.\n\nKind of like justifiable homicide.  You still killed someone.  Thats a fact.  You just don't get in trouble for it.\n\nSo justifiable assholery:  you were an asshole.  Thats a fact.  I just don't hold it against you.\n\nOP raised their voice and cussed at a coworker.  Thats not ok.  But I don't blame them for it.", "Yeah, no.\n\nOP raised their voice and cussed at a coworker.\n\nThats not considered acceptable behavior.  That makes the OP an AH in this situation.\n\nCoworker just also happens to be an AH.\n\nDo you think HR is gonna be like \"wow, coworker was in your cubical and called you a weirdo.  She totally deserved to be cussed at!\"  No, they aren't.\n\nI understand why OP reacted this way, I am sympathetic, and I probably wouldn't have handled it better.\n\nBut that doesn't mean it was handled correctly.", "Sorry champ.", "Can you read? How had she insulted him when he responded with a passive aggressive \"cool\" rather than an answer of any kind? You cant say \"but he said no three times\" when the thing im criticizing is his passive aggressive intial response?\n\n\nIt would be like saying \"yeah, he deserved to get hit\" and I ask \"why\" and you respond \"well, after he got hot he stabbed the guy\" \n\nLike, how does that make the intial thing okay?", "My friend works in a dog friendly office. There's a rota. There are emails. People are also welcome to (and regularly do) work from home.\n\nIt's not a free for all everyone brings their dog in with no warning scenario (on a most basic level imagine the carnage if the dogs didn't get along and there was no set schedule for who was in when)", "If you choose to apply for a job in a dog-friendly office while having any of those issues, then that's on you. I work in an office that is dog-friendly because one of the subsidiaries of my employer is a Seeing Eye Dog facility. We regularly have both working dogs visiting with clients, as well as dogs in training at the office - I raised a SED puppy myself, she came into the office 40 hours a week pre-covid.  Because of this, we also have a \"dogs at work\" policy so people can bring their own well-behaved dogs in. Mine comes in on one of the two days a week I'm in the office.\n\nThese policies are made very clear to anyone who applies to work here. Got a severe allergy or phobia? If you're not able to manage it, then, with respect, this may not be the workplace for you.", "You don't know what a fact is, it seems. AH is a judgment. Judgements aren't facts. Having killed someone is a fact. Facts are things you can't properly argue over, like the sun being too hot to touch for a human being. You can't judge something and claim it a fact, especially if MANY people disagree with you.", "When you work in an office, it's a well known fact your cube is yours and you don't enter someone else's without permission", "You're sorry you don't understand that loud doesn't mean yelling?\n\nYou should be sorry buckaroo", "She said \"only weirdos don't like dogs\" before op got louder with his disdain \n\nShe's the only ah", "Your business deals with dogs as part of its regular course of business. That is not a good faith argument", "Any asshole could simply not tell them they have an allergy or phobia, start the job, and apply for a reasonable accommodation\n\nWhich would simply be “no dogs in the office”. Then everyone would hate them and they would be on track for a hostile work environment lawsuit \n\nThe entire concept is just asking for trouble", "It's no different to any other type of restriction.  \"Must have a drivers licence\".  It's not discrimination not to hire someone without a driver's licence, even if their reason for not having a licence is due to a disability.  If it's a job requirement, then it's acceptable.  If you had a nut allergy, you wouldn't apply to work in a peanut factory.  Saying to a potential employee 'this is a dog friendly office and you need to be comfortable with dogs around all day' is not disciminating against someone.", "Please forgive me daddy.", "So you cant read?\n\n>She gets to my cube, and says hey this is my new dog, I named him fido. I just say cool and continue working.\n\n\nThis was the way the interaction started. \n\nOP k ew she was coming around with the dog, knows they dont like dogs, and when she gets there insteas od a very simple \"no thanks\" OP is already pissy and goes with \"cool\" \n\nIf instead they had simply \"sorry, i dont like dogs\" they would have done nothing at all.wrong but instead they acted like a ass. After that, regardless, the coworker was an asshole but once again, you seem to not understand the order of events.", "Yes, I am aware that my employer is an outlier in that regard. My point is that if people are made aware of a business being dog friendly before they take a job there, then they have no right to complain about it or claim discrimination afterwards.", "Op answered a question with a \"passive aggressive\" answer \n\nOp was pressed and said no\n\nOp was continually pressed and said no yet again \n\nOp was insulted \n\nOp made his voice firm and loud\n\nAre you okay?", "Do you have a cognitive or learning disability? \n\nNormal people dont respond to attempts at friendly conversations with \"cool\" and ignoring the person\n\n\n\nThe actions that follow do not justify this initial response.\n\nNothing she does after that point justifies him acting like an asshole initially. \n\n\nIf i hit you and then you kill me that doesnt make me hitting you retroactively okay.", "Normal people don't bring their dog into a place of business and socialize it without the consent of everyone there... And don't get annoyed when someone doesn't like it \n\nCool is a completely fine word, nothing wrong. Ignoring the person trying to invade their cube? Super cool \n\nWhy are you mad at someone saying \"cool\" with no enthusiasm for a thing he hates?\n\nWhy bring such a stupid hypothetical into this?"]}