{"id": 8005, "submission_id": "10iomnx", "title": "AITA for calling 911 after a medical emergency without telling my parents?", "selftext": "I live with my parents. Last night I had a medical emergency and called 911. My parents got mad at me for not telling them that I felt that I needed to go to the hospital. I knew that my insurance would completely cover the ambulance trip and I did not want to have to explain my situation to my parents first before getting looked at. I am 27, and I am a grown adult old enough to make my own decisions. I wanted to know for sure that I was getting help; what if we had a problem and couldn't drive to the hospital on our own? Why should I consult them to control my own health? I suppose that it scared them more to see the ambulance arriving at our driveway. I did not want them to worry, but maybe that made it worse.", "created_utc": 1674407618, "permalink": "/r/AmItheAsshole/comments/10iomnx/aita_for_calling_911_after_a_medical_emergency/", "score": 189, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for calling 911 after a medical emergency without telling my parents?\n\nI live with my parents. Last night I had a medical emergency and called 911. My parents got mad at me for not telling them that I felt that I needed to go to the hospital. I knew that my insurance would completely cover the ambulance trip and I did not want to have to explain my situation to my parents first before getting looked at. I am 27, and I am a grown adult old enough to make my own decisions. I wanted to know for sure that I was getting help; what if we had a problem and couldn't drive to the hospital on our own? Why should I consult them to control my own health? I suppose that it scared them more to see the ambulance arriving at our driveway. I did not want them to worry, but maybe that made it worse.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO\n\nWhat are you not telling us here?\n\nI mean, this is a **_weird_** question to begin with, because: of fucking course adults have autonomy over their medical decisions?\n\nAnd what is with this phrasing?\n\n>  what if we had a problem and couldn't drive to the hospital on our own\n\n*What if?* This is not *theoretical*, right? You're talking about an **actual emergency** that happened. **Was** there a problem with the car? **Could** you guys have gotten there on your own?\n\nBecause like I started with: what aren't you telling us? What is going on with your relationship with your parents in the first place?", "YTA. Not for calling 911 if you felt you really needed it. Going to the hospital can end up with hours of waiting in pain. \n\n>I suppose that it scared them more to see the ambulance arriving at our driveway.\n\nThis is why you are an ass. You should have told them you called 911, and an ambulance was on the way.", "Kind of YTA. I'd freak out if there was suddenly an ambulance and cops at my door. And, if I didn't know any better, I'd probably tell them they have the wrong house.", "Can you imagine just chilling out at home and having an ambulance show up asking where the medical emergency is and trying to have to argue with a paramedic that nobody called?\n\nYTA. They shouldn't be making your health decisions for you but you shouldn't be doing what appears to be a completely weird power move by having emergency services show up at your place.", "YTA\n\nYou don't need their approval to call an ambulance or go to the hospital. At all.\n\nBut you live in the same house with them and they were home so you should have informed them that you called an ambulance (edit: unless you were unable to due to the nature of the emergency but that doesn't sound like the case here). This would be true even if they were any other roommates rather than your parents.", "YTA.  And not just because what you did was disrespectful and scary to your parents.\n\nAs a first responder, I would have chewed you out.  This could have gone very badly for your parents or the first responders or for you.\n\n1. If the first responders didn't know your parents were in the house and just barged in, your parents might have thought it a home invasion and someone could have died.  I lost two friends who were paramedics that way.  I also knew a homeowner that was in the kitchen when police and ems walked in.  They stepped out holding a knife and was shot by a cop.\n2. What if your parents thought it was a prank call and told the cops there was no medical emergency?  Depending on the severity of the situation at best you would have delayed treatment, at worst if you had something very serious you might have died.\n3. Depending on the situation, your parents might have been able to do things to help stabilize you until the ems arrived.\n\nSo yeah, as a first responder, I'm pissed you would think this sort of game was okay.", "YTA.  If you're calling 911 then you should be telling people in the same house.  What the hell.\n\nIt's not about \"consulting\" anyone.", "INFO: what happened to you that made you call 911? Do you think your parents would have dismissed your symptoms if you’ve asked them to call an ambulance? Is that why you didn’t let them know? I can’t give a verdict without this information. Because on one hand yeah, you’re a grown ass adult. On the other, you’re 27 and still live with your parents.", "YTA - I find it out you were in such dire health crisis you called 911 but did not tell the people in the house with you. You definitely should get the medical help you need but maybe tell them that ambulances are coming - that can be super scary if unexpected", "INFO: what did you have up your butt?", "YTA. What if your medical emergency made you not be able to respond to paramedics when they arrived? Your parents wouldn’t know what was going on or how to advocate for you. Even when I had an emergency at home, I told me neighbors what was going on so that they wouldn’t worry when fire trucks arrived. If your parents are so awful and you’re a “27 year old grown adult” and you want to live completely independently from them, then why are you still living there? Move out. When I was 27 I had my own apartment.  Just the way you said that makes YTA.", "That’s a super complex question. I think it’s fine you called an ambulance if you felt it was necessary but yes, you absolutely should have alerted everyone else in your home that an ambulance was coming *if you were physically capable of doing so*. This is true regardless if this was your parents house or an apartment with roommates.  Even if you were at a hotel, I’d still say call the front desk and tell them an ambulance is about to arrive for you. \n\nSo yeah, YTA for not telling them but NTA for calling the ambulance in the first place.", "YTA - unless you were incapacitated to the point where you couldn't tell them. But you should have told them an ambulance was on its way and ideally shared your symptoms so they could communicate with EMTs if you were unable to.", "YTA\n\nThey needed to be aware that an ambulance was coming to their house so that when they answered the door, they didn’t turn them away. Also, if your health is so dire that an ambulance is necessary, notifying someone else that you are that sick is always a good idea in case you get worse. If the paramedics arrive and you are passed out, it is important to know how long you have been unconscious for and what you were feeling before you lost consciousness. \n\nAmbulances are not just free rides to the hospital. If there is someone available to drive you to the ER, you should be using that instead of tying up a resource that is supposed to be for emergencies. Also, an ambulance ride doesn’t get you to the front of the line at the ER—they still triage you like if you walked in yourself. \n\nIf you want to be treated as an adult, you need to act like one.", "Always use a toy with a sufficient glared based that is intended for anal play. You don’t just wait until paramedics are knocking on the door to tell other residents in the home that they’re coming. Of course YTA. You needed to give them a heads up and tell them the age old lie told in ERs round the world. You slipped in the shower and now need emergent medical care.", "YTA. You couldn't literally just shout downstairs \"Hey, I feel really unwell. I've called an ambulance\"?\n\n It's not that an ambulance appearing will have freaked them out, it's that you were somewhere in the house, sick enough to call an ambulance, and you didn't even let them know. They would have looked after you until the ambulance got there. They're probably upset that you didn't trust them enough to inform them you were seriously ill\n\nInfo: do you have some sort of issue with your family? Because the only way your NTA is if they've refused to acknowledge medical issues previously or if you know they'd have kicked off about the cost (though you said that was covered)", "I don't think they're controling your health I just think they were worried, I mean, any decent parent would want to know if their son is feeling sick or needs to go to the hospital at any age one does not stop worrying about their son just bc they get to certain age, also receiving an ambulance in your house without further notice it's kind of scary", "you dont have to ask permission or consult but you should deff have told them u feel sick and an ambulance its on its way since u live in the same house. you are a bit of  A for that alone...", "INFO. What could have been your parents reaction if you requested help instead", "I can see why they'd be freaked out having an Ambulance they know nothing about appearing at the house. A very soft YTA.", "YTA. They could’ve had a heart attack themselves. 27 years old and doesnt know any common courtesy", "Yeah “not wanting to make them worry” by calling an ambulance makes no sense. If your medical condition doesn’t impair your judgement, low key  YTA", "if you want your life to be separate from your parents, you need to move out. YTA, people deserve to know when someone living in the same house as them has been hospitalized, tenfold if its their own child.", "Did you have a true medical emergency or just need non emergent transport to the hospital? I would think a true emergency would have you alerting everyone around you.  This makes no sense. YTA.  If you don't want to involve the people you live with to a real emergency, you need to live by yourself.", "YTA for not telling them (no one is ever the a h for calling an ambulance if they need one). Seeing an ambulance pull up to the house without having been made aware is needlessly jarring and scary.", "It's your right to call the abulance, but you should also inform the people living in the same housr that an ambulance is coming. What did you expect? That your parents will see the abulance but won't ask you about it or worry? YTA", "YTA I don't know why you think an ambulance could show up at their house without them being concerned about what was going on. If you want to be a full adult who doesn't tell your parents anything, then move out.", "\"Why should I consult them to control my own health?\"\n\nThis was a weird statement, which leads me to believe a big chunk of a backstory is missing here, like they've controlled your health in the past, and you wanted to prove to them that you're a big girl in control of your own health. Sure, you can call the ambulance, but common courtesy dictates that you alert others in the household, whether they are your parents or roommates or whomever, that an ambulance is on its way. YTA.", "Nah - it was probably scary for your parents, and a heads up would have been a good thing. But you were concerned for your well-being and focused on that, rightfully. I hope you're doing alright now.", "NTA in a medical emergency, ambulance workers begin treatment before you even arrive at the emergency room. I don't understand why your parents are this controlling over another adult. I'm guessing you didn't tell them because they would have told you not to call or some other interference.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI live with my parents. Last night I had a medical emergency and called 911. My parents got mad at me for not telling them that I felt that I needed to go to the hospital. I knew that my insurance would completely cover the ambulance trip and I did not want to have to explain my situation to my parents first before getting looked at. I am 27, and I am a grown adult old enough to make my own decisions. I wanted to know for sure that I was getting help; what if we had a problem and couldn't drive to the hospital on our own? Why should I consult them to control my own health? I suppose that it scared them more to see the ambulance arriving at our driveway. I did not want them to worry, but maybe that made it worse.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA, so they didn't even know an ambulance was coming. No wonder they were worried\n\nEdit typo", "YTA. if you live with your parents then yeah you should tell them theres going to be an ambulance in their driveway", "YTA.\n\nIn the future, you need to step back, breathe, and think about the consequences of your imminent decision. Is your situation dire enough to need an ambulance and travel to the emergency room, or can you hold on until your parents get you to a local urgent care center? Will it scare your parents more if you tell them that you are suffering, or if you sic an ambulance on them with no warning? What if you were on the opposite end of this situation?", "Your not an a$$hole for calling an ambulance for a medical emergency, but why couldn't you have given your parents a \"heads-up\" after you knew that the ambulance was on the way?  Yes it would be distressing to see an ambulance pull up to your house and have no idea why they are there.  So for not telling them after you knew the ambulance was on the way, YTA.", "If you live together and are capable of informing them that you have called and ambulance then you should. YTA", "YTA.  This is so weird.  How would you feel if an ambulance showed up to your house and you had no idea that one of your parents needed medical help?  You'd probably be pretty caught off guard and upset.  I don't get why didn't tell them if you were able.  Would they not have let you call the ambulance?  Would they have stopped you from going to the hospital?  This poor judgment at 27 years old is not a good look.", "NTA\n\nYou're 27, this is entirely your choice and responsibility.\n\nIf your parents are this controlling, you may want to work on moving out on your own.  Could you trust them, medically, if you were incapacitated.", "I kinda agree here. It feels like half the story is being deliberately hidden. Is this a hypochondriac that has a history or overreacting and the parents know this? Who knows, they aren’t saying but it’s definitely worded oddly.", "I’d bet $100 that OP didn’t want to explain the vegetable/shampoo bottle/ etc up their ass.", "This.  I get you didn't want to worry them, but this would freak me out a lot more than a gentle heads up.", "This! They're likely not trying to be controlling. They are concerned and it's actually advised that if you have to call 911 and have someone else with you, that they be aware of the ambulance so they're able to direct emts to the patient. OP YTA here.", "This was my exact thought and I’m surprised I had to scroll this far for the question to be asked.", "They wouldn’t even know the ambulance was supposed to be there. They would say “Nah, we are all fine. Must be a mistake.”", "I'm not arguing with you, just pointing out if home slice can call an ambulance, he probably could have dropped a line to the folks?", "Well they live together so I don't think that them wanting to know about what's happening with him it's controlling I mean he's a member of the household and he had to be taken in an ambulance, telling them wasn't going to make things different when it comes to him getting taken to the hospital, worrying about your son's health isn't controlling.", "I typed it fast, so not the best phrasing, but it's all there.", "If I can defend myself for a second, I thought that I was having a seizure.", "The parents wanted to be told *before* the ambulance was called - that OP \"felt the need\" to go to the hospital.\n\nWhich I read as them expecting, not that OP would call the ambulance, but keep them informed, but that OP would say they wanted an ambulance, but the parents would decide.\n\nIf OP needs an ambulance, OP has the right to call, immediately, without asking permission or clearing it with the parents first.  Informing the parents an ambulance is on the way is a courtesy, to be managed if OP feels up to it, not a mandate or condition for getting an ambulance and going to the hospital.", "The question that you haven't answered is \"why did you need to do this instead of telling your parents, driving yourself, or having someone else drive you\"", "If you were having a seizure who do you think should have opened the door for the ambulance when they arrived?\n\nYTA.", "I think you're reading a bit too much into it, also, if they all live in the same house he should've told them just so they don't get freaked out when they see their son being taken by an ambulance without knowing what's happening, again, worrying about your son's wellbeing it's not controlling.", "When I read the justification that he a grown man and didn't want people to know he needed 911, my immediate conclusion is that he shoved something UP THERE.", "They had taken something they didn't want their parents to know about. Hope you flushed it before you went to the ER, OP or your parents aren't the type to snoop.", "Forgot the ol' flared-base rule", "Yup that or too many little blue pills.", "maybe he had something stuck to a certain cylinder?", "Why not both?", "Maybe. The options are endless.", "He wouldn’t be the first.", "INFO: what recreational drugs were you taking that you're trying to hide from your parents??", "YTA\n\nReading between the lines of the comments (you THOUGHT you were having a seizure), it sounds like either you were partaking of illegal substances in your parents' home and had a bad time of it. You didn't want them to know you were doing that (because that's not a very grown up thing to do, and YOU are a grown up), so instead you scared them to death with an ambulance screaming up to the house.\n\nOr you're hiding epilepsy or another seizure disorder from them, which is only plausible if you can control your seizures to happen only when your parents can't see.", "YTA. You’re 27, if you don’t want to have to consider how your choices affect the people around you move out and live on your own. It’s extremely weird and stupid to call 911 and not say anything to the other people isn’t the house.", "YTA. You didn't want to worry them....so, an ambulance blaring up to their door unexpectedly \n*wouldn't * worry them???\n\nWhat is wrong with you??", "Former 911 dispatcher here. \n\nFirst of all, your medical emergency is your own business, and you should not have to consult with someone before calling. You are not the AH for that. But in not letting your parents know you were calling, you did two things: scared the shit out of them by not giving them a head’s up, and potentially put your own life in danger. That makes YTA. \n\nWe don’t know what the nature of your medical emergency was, and don’t need to. But if it was severe enough that you needed an ambulance, you need to be aware that it’s severe enough that you might lose consciousness before they get there. \n\nOne night, I dispatched EMS for a man with a possible heart attack. He never told other people in the house that something was wrong. He was having trouble speaking, and the house number was not visible, so we weren’t sure if the ambulance had gone to the right house. It was all dark, no lights on. \n\nI called him back and he had just enough strength left to answer the phone, but couldn’t get to the door or turn on a light. He could no longer speak to let me know we had the right house or get someone to help.\n\nI had the ambulance drive up and down the street with all lights and sirens blaring at 4 AM, until I could hear it in the background on the phone. After what seemed like an eternity, I heard someone come into the room complaining about the noise outside. I was screaming into the phone, trying to get their attention to have them open the door for the ambulance. \n\nThankfully, the other person picked up the phone and immediately went to the door to let EMS in. The man who originally called had gone into cardiac arrest. I’m not sure if they were able to resuscitate him. \n\nSo while you may be not entirely the AH it’s a pretty stupid idea to not at least let someone else in the house know they need to open the door for EMS.\n\nEdit: I saw the rest of your responses. Yeah… you can’t secret squirrel a 911 call for a possible seizure.", "Gently….yes, YTA. As soon as you called the ambulance you should have let them know.", "YTA  you absolutely should have told your parents you were calling 911--smh.", "OP  My dil is an ER nurse. She would tell you there's nothing you've done or experienced that emts and er staff haven't seen many times before.  You didn't think this through.  Get yourself well.  Yta", "Yta. You call an ambulance to the home, you let people in the home know there is an ambulance coming. Your feelings of insecurity for living with your parents and not being an independent / self reliant adult are making you irrationally express your independence in ways that don’t make sense. Get some therapy", "YTA-I was with you until I got to the part about you living with them. As an adult, you don’t owe anyone, including your parents, an explanation, but anyone in the house should be given a heads up-whether it be parents or simply roommates. They aren’t owed details, but a factual “Im having an emergency, ambulance on its way, don’t ask questions” was warranted. Would they have asked? Of course, but they were going to have those questions in a few minutes when the ambulance showed up anyway.", "YTA.\n\nIf you think you’re having a medical emergency that required 911, you should let other adults in the property know, any adults. Not because they are your parents/family. but because you think you are having a medical emergency and they should be aware.\n\nWhat if you passed out and they turned the ambulance away thinking they must have gotten the wrong address / prank call?", "YTA - Soo much wrong with this. \n\n1) First and foremost, this does not seem like a medical emergency.\n\n>what if we had a problem and couldn't drive to the hospital on our own?\n\nThis tells us that you had people who could drive you and the trip would not have killed you/it didn't need to be looked at urgently since you could have contemplated asking for a ride. If you didn't want your parents to drive you then you should have called for a taxi.\n\n2) Not telling the homeowners about emergency services appearing is stupid. If you parent's say no one called and that it was a prank, ES might see it as a potential kidnapping and someone inside called for help which would lead to arrests. The homeowners might shoot the ES since they have no idea they were coming or the ES might shoot the homeowners if they had a knife.\n\n3) Not informing them can lead to problems when it does prove to be an emergency and they don't know what's wrong. Reading comments it seems like you OD'd on some drugs in which case tell your fucking parents you OD'd on X drugs and you think you might have a seizure so they can tell EMS which drug it was to get you help ASAP. If you don't say which drug specifically they'll need to figure out the drug which can cause you to fucking die from heart failure or something while they frantically search for whatever the fuck it was you took.", "YTA. It's there house too. They absolutely deserve a heads up before ambulances and emergency personnel show up in the middle of the night out of nowhere.", "Ok, just edited to YTA. I missed the part where you didn't tell them that you called 911 when you live in the same house with them. As an adult you let other members of the house you are in know if there is an emergency going on. At 27, you should know this.", "YTA. I experienced exactly this from your parents point of view and it is startling. I woke up from a nap to a living room full of firefighters and EMTs because my MIL called them but was worried to wake me up due to my long hours at work. I would have rather been woken up and given a heads up (she was awake and could have called me btw). If you are able to give someone within the same space as you a heads up you should. I don’t understand why you didn’t want to tell them though. You don’t really give a reason besides what if. Has your family not been supportive of your medical problems in the past or something?", "As far as I know, calling for ambulance is for situation where the case is to severe and/or time sensitive, to the point you can be driven to the hospital in a car, or you have immediate concern but have no way to get a proper medical attention or to a location where you can get one. \n\nIn both cases, the parents could have helped you: if you're bleeding out, then they could given first aid or follow the 911 instructions. \nIf you needed a ride they could've driven you to the hospital. \n\nIf they refuse to do those things, then you can still call 911, Regardless if what they think. \nAnd if you're unable to call, then you didn't have a choice to being with, which a different problem. \n\nSo unless I'm missing something (which I actually I do), YTA. \n\n\nOn a sidenote - if you don't trust them to the point that you don't want their assistance in an actual medical emergency - MOVE OUT", "INFO \n\nWhy couldn’t you drive yourself to the hospital? (Or uber or ask a friend for a ride)", "INFO You are closer to thirty than twenty years old.  Why do you live with your parents if you want to be making your own adult decisions?", "YTA. Parents or even roommates, doesn't matter!  You had an ambulance show up outside of their house and didn't bother to tell anyone because you don't want to be controlled?  Wow.  Life tip: People besides you do exist.", "When I started reading it sounded like a case of “my parents won’t take this seriously and i *really* need help.”", "This really sums it up right here - so stupid and bizarre not to tell people who were in the house with you?!", "As the parent of a first responder I agree.", "Exactly! Especially if it's a parent or \"family\" member. My adult kids still live with me, and I'd be hysterical if an ambulance just showed up to my house looking for one of them. Do parents need all the details? No. But at least a heads up that something is going on is definitely in order if you are still living at home. If you called an ambulance to your own apartment, then no one would know until you told them.", "He made a vague comment earlier that he \"thought\" he was having a seizure. He didn't want his parents to know about it, so I assume he was basically doing drugs and OD'd to some extent or had a bad trip or something. You know, things that people who go around banging on about being a \"grown adult man\" do in their parents' house.", "Sound advice. Also, never stick your dick in something unless you are 100% sure you can get it out again.", "Added: Weak YTA because depending on the emergency you may not have been thinking through this clearly, but I would consider it now in terms of the ongoing discussion. Parting thought: I think you needed to inform them, not consult them.", "Gerbil.", "\"I didn't want to worry them, so I just let them be supprised by a freaking ambulance\"", "That poor gerbil.", "YTA. As someone that had seizures before my epilepsy was under control, you should make sure as soon as you feel like you are having a seizure to notify someone. If you were to have a grand mal seizure before the ambulance arrived and there was no one there to help you, it could have been a lot worse. I’ve broken nose and had stitches in my forehead from whacking my head when I’ve collapsed. If someone is around you, at least they can make sure that you don’t injure yourself and make sure you’re still breathing. My friend once had to help get blood out of my mouth because I bit my tongue while having a seizure so I starting choking on my own blood and my lips started to go blue.", "Why did you think you were having a seizure? Wtf was really going on???", "If you could call 911 and open the door to the paramedics you weren't likely to be having a seizure. I can't see anything wrong with calling an ambulance to get you to hospital if that's where you needed to go, but not mentioning to anyone else in the house that you were unwell enough to need emergency medical attention is unfathomable and, along with a lot of other people here, makes me certain that you're leaving some very significant information out here. YTA", "That only makes you more an asshole. You could have become unable to open the door or been in serious danger. You weren’t trying to avoid embarrassment, you hid something potentially very dangerous.", "You don’t “think” you’re having a seizure so it’s hypochondriac ppl", "…and fell on something?", "Wow, YTA my husband had a seizure and it was the scariest thing I have lived through (he doesn't really remember it, just being in the hospital later). If he had the presence of mind to call 911 because he thought he was having a seizure and didn't tell me, that would cause me to rethink our marriage.\n\nThese were your parents in their home, you have no defense.", "I mean were you having a seizure…?", "So why didn't you go to your parents and say \"Mom, Dad, I think I'm having a seizure?\" If your parents were actually able to drive you to the hospital, if you'd actually informed them, then you're automatically YTA for calling an ambulance when you had another way of getting to the hospital.\n\nBecause that ambulance could have been used for someone that was actually dying.", "If you were having a seizure, it would have been good to have someone with you until the ambulance arrived, to help keep you from injury. YTA", "I've had seizures,  I only know because I either wake up in hospital and/or someone has told me I've had one.. I don't think if OP was having a seizures, she would be able to call 911. I have found that some people think they're having seizures, but then go to describe orthostatic hypotension. (And in one case, that they liked the feeling).", "\"I fell awkwardly\"", "Do you know if OP is male?", "When I had seizures, I typically got a couple of minutes warning that I knew I was going to have a grand mal. I called it a “head funk” because I knew what was going on around me but my brain couldn’t process it, when I got that feeling if there was someone around, I always made sure to inform them the best I could, because sometimes I’d try to tell them but the words that came out wasn’t quite right or the sentences were jumbled up. I’ve only gone to the hospital like 3 times for seizures (the first one and the other two were injuries from the seizures), I had a seizure in public once with my friends, and a stranger walked past, and my friends told her they don’t need to call 999 because they can handle it, the stranger still called them, ambulance arrived and the paramedics also told the stranger that she didn’t need to call 999 either. When I came round from a seizure, everything was fuzzy for bit, then I’d just go sleep in my bed for a day. Everyone experiences seizures differently.", "or the better excuse, and one my friend has legit heard, \"I don't know how it got there\"", "The macaroni man on Seinfeld?", "Omg...this!", "Oh shoot. Thanks for pointing that out. Thought I read 27m.", "I had a warning before my grand mal - I didn’t KNOW it was a warning at the time, as it was my first (and only, knock on wood) seizure. Felt like my brain was a skipping CD, kept thinking the same inane thought over and over, with a rising sense of panic that something was very very wrong. I was pulling out my my mobile to call my husband and tell him I needed help when I went down. (Unfortunately smashed my head in which made the recovery harder, but very grateful for the members of the public who came to my aid!)", "It was a million to one shot!", "Hey, you could still be right!  The whole situation is weird!"]}