{"id": 8019, "submission_id": "10iwdcx", "title": "AITA for getting into a dispute with the daycare staff over my child's nap schedule?", "selftext": "Background info: I'm a working parent who values the importance of a consistent sleep schedule for my child. I've always been specific with the daycare staff about my child's nap schedule and needs and it's important for her health and happiness to have a consistent routine.\n\nMy child (let's call her Emma) has been attending the same daycare for a few months now. I noticed that her nap schedule was being disrupted and I couldn't figure out why. I suspected the daycare staff were not following my instructions properly. I decided to set up a meeting with the daycare director to discuss my concerns. During the meeting, I found out that the staff were not adhering to Emma's nap schedule and were instead trying to make all the children nap at the same time, regardless of their individual needs. I was furious and expressed my disappointment in the staff's lack of attention to my child's needs.\n\nNow, the daycare staff are mad at me and the director thinks I am overreacting. I feel that my child's well-being and development are being compromised and I am not being heard.\n\nNow the daycare staff are expecting an apology. Did I go too far here?", "created_utc": 1674426840, "permalink": "/r/AmItheAsshole/comments/10iwdcx/aita_for_getting_into_a_dispute_with_the_daycare/", "score": 4075, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be an asshole for expecting the daycare to attend to my child's individual needs\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "If your expectations are that rigid then hire a nanny or stay home. No daycare service is providing individual naptimes set to the parents schedule for multiple children, it’s kinda nuts that you ever thought that would happen.\n\nYTA", "YTA, do you really expect them to follow EVERY child sleeping schedule? \n\nAnd yes, you should apologise.", "YTA.\n\nIf you have a very strict nap schedule, then hire a private nanny who will follow it. The daycare staff and all the children they watch are already used to a set schedule. You can't come in and expect everyone to change things around and adapt to a schedule you came up with for your child.", "YTA\n\nI'm about to die laughing. Over the years,  I've worked at a variety of schools and day cares and parents kill me. \n\nYou are reminding me of a parent whose son had celiacs and was lactose intolerant and therefore needed a specific meal plan. No problem,  we were more than happy to provide him with gluten free food and oat milk, as well as take the playdough out of the room since playdough has a wheat base and had caused a reaction in the past. No playdough in a prek classroom is sad,  but we did it to keep that kid safe. (Seriously,  look up the ingredients.)\n\nWell, the food provided by the program was not good enough for this parent, so you know what she wanted the teachers to do? The same minimum wage teachers whose kids qualified for the low-income pre-k their parents worked at?  \n\nShe wanted us - the teachers - to buy the food he liked instead. For the record,  we fed them breakfast,  lunch and a snack everyday,  five days a week. And she wanted the teachers to provide that food out of our own pockets. Thankfully our center supervisor laughed in her face.\n\nI hope the center director laughed in your face too. Do you really expect them to adhere to your schedule instead of the other way around? Depending on the size,  they could have 15 or more kids,  no way are they going to follow 15 schedules. They have one schedule that includes meals,  lessons,  breaks and naps, and all the kids will follow that schedule,  including your kid.", "LMAO. I can’t believe this is real. \n\nWhy in the world would you think a daycare would do that? Wait til you find out that they make everyone eat lunch at the same time in school too. YTA.", "Former childcare worker. Toddler rooms cannot have multiple nap times. Your expectations are not reasonable. If you want a specific schedule you need to have a private nanny. YTA.", "YTA. Surely you were given information about the nap schedule when you enrolled. Most daycares do not cater to each child's personal nap routine. They do one nap time for all and families have to just accept and adjust to that if they want to stay with that facility.", "YTA. How do you think this is actually going to work? Your kid is going to sleep soundly while other kids play? Kid's are noisy, interested in whatever the other kids are doing, and way more flexible than you give them credit for.\n\nLike day care workers don't have a hard enough job.", "YTA. The daycare has their own schedule, which you have no right to dictate. They can't put just one child down. What you're wanting is a personal nanny.", "YTA\n\nYour child is going to be on the same schedule as everyone else at the daycare. If you want a nanny who will adhere to your wants, shell out the cash for a nanny - and pay them a proper wage. Otherwise apologize and deal with it. Your child's future isn't going to be ruined because of a different nap schedule. As long as they *get* the proper amount of sleep, they'll be fine.", "YTA, i work in a daycare.  We hate parents like you. Do you know how much we get paid?? Not  enough for this. Your child is not the only child there, and nap time is a group activity, so we can do our lunches and whatnot.", "YTA and yes you went too far. If you want someone to stick to your specific schedule, hire a nanny, the daycare cannot be expected to adhere to every different sleep schedule for  one individual child.", "My daycare director would be like…whelp, find another daycare then, good luck! \n\n\nYTA", "YTA.  The daycare has multiple kids to watch over.  You think they can adhere to every parents sleep schedule?  You build their nap schedule into your schedule.  If you can't or won't do this, then get a personal nanny or childcare worker.", "YTA. If the sleep schedule is THAT important to you, hire a nanny.", "I invite you to work at a daycare for a week and then let us know if you still think it's a realistic proposition for every child to get to nap on their own individualized schedule. YTA", "How old is the child?\n\nEdit: YTA she’s 18 months, old enough to follow the class schedule.", "YTA\n\nThe daycare will have its own schedule for naps and you will need to work around this.\n\nThe teachers have lots of kids to look after and they're unable to tailor every child's day to suit, however they assess the child's needs at the time. My youngest used to have a huge afternoon sleep then was up to all hours at night so they used to let her have a short rest with the others then got her up before she fell properly asleep. \n\nTalking with the childcare experts and asking their advice is a much better tack to take here. If you are having issues then have a look at other childcare centres who may be able to accommodate your needs, or employ a nanny.", "YTA- the reality of communal child care prevents them from an individual sleep schedules for everyone… seriously how would they ever balance that with diaper changes, feeding, play time and outdoor play while also keeping proper supervision levels.\n\nYour expectations are unrealistic. When my child was in daycare, I adjust weekend meal and nap times to the daycare schedule this made it easier for my child to adjust.", "YTA - They got other kids to nap who may / will be on different sleep times to your kids. You can not expect them to follow every kids nap times. Going to throw in a large helping of /r/entitledparents", "YTA. What you’re looking for is one-on-one attention and attendance to your child’s specific “needs”. That’s not daycare. That’s a nanny.", "YTA. Every afternoon when I pick my 20 month old twins up, I’m amazed at the patience and love these teachers manage to give each child (often for little pay). You want an individualized schedule, pay for it by getting a nanny.", "YTA. If your child is so special, hire a nanny.", "YTA- How is your child meant to take a nap when other students are awake? The daycare has a schedule that THEY adhere to. If you want an individualized sleep schedule, hire a nanny or get a babysitter.", "yta\n\nthe staff has work to do, lunches to prep, etc. all kids sleep at the same time for that. Also if one stays awake, the rest might want the same, resulting in grumpy, tired children. nvm the amount off noice when it would be your childs turn to sleep and everyone else is awake.", "YTA\n\nIt seems like you do not understand how daycare/pre-school works. i understand why the Director and Teachers are mad at you. If you really wanted one catered to your needs, you should have homeschooled her or hire a babysitter for your child. \n\nAs a Pre-school Teacher working in one, the schedules we have are fixed. For example, in my school/daycare, our sleep schedule is from 1pm-3pm. ALL children regardless of age has to nap. It is a nice time for the children to take a break and rest halfway through their routines and learning activities  which the timings are also fixed. We cannot accomodate to a parent's selfish request unless it is regarding the child's dietary needs due to religion/allergies, or when a child is sick and we have to administer medicine according to the doctor's instructions.\n\nHope this opens up your narrow mindset. If you still can't understand that (which I think you still don't, since you're posting here trying to get sympathy points) then I'm sorry, daycare isnt for you.", "Yta they have more than one child to look after. A schedule were most or all kids nap at the same time is more manageable for them. Go apologize!", "YTA. You are overreacting", "YTA, your kid isn’t the only one there. If you want a specific sleep schedule you should look into a private home set up.", "YTA you want her to sleep when you want hire a nanny instead of screaming at daycare staff with 8+ kids", "YTA, I've never heard of a daycare having kids nap at different times. They always all have one nap at the same time, usually after lunch. That's completely normal. Did you think they would take each child away from the group to go have a nap in a separate room at various times throughout the day? That's ridiculous.\n\nI can assure you your child's development is not going to be affected by this change in the nap routine. She will be fine. My son was 16mo when he first started daycare and all the other kids were older than him and sleeping on mats while he was used to sleeping in a crib. It took a few weeks but in time he was napping with the other kids and everything was good. \n\nYour child isn't more important than any of the other children and the staff in charge of her care are presumably competent, educated individuals who are doing absolutely nothing wrong. They don't deserve the kind of attitude you gave them. You should apologize.", "YTA. You hired a place which like pretty much every similar place does things by the numbers without too much customization. I'm sure you know the old saying about what you need to do if you want something done \"right.\"", "YTA\n\nYou're not entitled to demand a specific nap schedule. The staff have more than one child to attend. Get a nanny.", "YTA. Your expectations are wildly unrealistic for a group childcare setting.", "Sounds like you should get a nanny if you want such individualized attention for your child. YTA", "YTA. If you want your child on a specific nap schedule then hire in home care. At daycare nap time is the same for all children. You really sound entitled.", "YTA. If you want such a personalized treat PAY for it. If not you should adhere to the center’s methods.", "YTA. Daycares run on their schedule not yours. All children nap at the same time unless they’re in the infant room and happen to fall asleep. If you don’t want your kids routine interrupted get a nanny.", "Do you know how daycare works?\n\nA teacher and one or two UNDERPAID assistants make *A* schedule to accommodate *A* class within the needs of the entire school.  \n\nLunch times and playground times have to be set and adhered to according to the number of staff, classes and students attending that day.  A pure miracle on a good day.\n\nThe goal is to socialize the kids into *THEIR* routine.  If you need your instructions followed, hire a nanny.\nAnd for the love of all that is holy, don't become known as a \"problem\" to the people who care for your child. That's insanity. You are supposed to be working with them to make things they best they can be FOR YOUR KID.\n\n\nYTA", "YTA- pay for a nanny that can give your child a schedule you want. A daycare can not give each child their own schedule. They follow a schedule that’s consistent to a group of kids. Not one individual.", "YTA.  Delusional AND entitled.  Ok, all children quiet now.  Yes stop playing. It's little Emma's nap time.  Her mom is super anal so if she doesn't sleep at exactly this time for precisely 100 minutes, she'll turn out like her mom, and  Nobody wants that.", "INFO: \n\nHow far off the schedule you've established is the schedule that the daycare want to operate? \n\nWhy can't you try to adjust to their schedule?\n\nI mean, I can completely understand why the daycare can't readily operate multiple nap schedules to suit the parents, because awake children will be disturbing napping children.", "I lean towards YTA. Do you know the staff ratios ? It would be near impossible to accommodate a different nap schedule for every child. Especially if Emma is a toddler (one nap\na day) as they generally all nap in the room they also play in. \n\nIf she is in the baby room & they have a separate sleep space maybe they can be more accommodating but it depends on what you expect. Pop her in a cot & she puts herself to sleep, easy. Requires 17 exact steps to get her ready & then being patted to sleep I can see how they can’t do this.", "YTA. What you need is a nanny to cater to your child and your child only. The daycare has a set nap time for all of the children. If your child’s health and wellness is at risk because she can’t adapt to their predetermined schedule then you need to find another daycare center.", "You need to hire a nanny.\nYTA", "Yta. If you want someone to personally babysit your kid hire a babysitter or nanny.", "YTA get a nanny", "YTA\nThat's how day care centers operate- snacks, naps and specific activities are scheduled for *groups*, not individual children. \n\nIf you want to set your own schedule for your child,  you need to arrange for a nanny or sitter in your home.", "Oh my good gracious, isn't this precious. YTA. Your kid isn't special to anyone but you. Perhaps consider helping them adapt to the change rather than making asinine demands.", "YTA. Good luck finding a new daycare.", "YTA I used to work in a nursery, all the children slept at the same time. How the hell are nursery staff supposed to keep up with different sleep schedules for 30 children? It's impossible.", "YTA. I work with young kids who need to nap. They all nap at the same time because that's the only way that can work. If you want an individualized schedule, get a nanny. Parents like you are the fucking worst", "YTA - I worked in a day care for years. All the kids nap at the same time. You can't put one kid down and expect them to sleep while the rest of the children are awake and playing til a different nap time. It's not like your daughter isn't getting a nap, it's just on a different schedule. She's only been there a few months and she will adjust to the changes. Day Care workers don't get paid enough as it is, don't make them deal with your unreasonable demands. When you have a class full of kids, there MUST be structure that works, they should all nap at the same time so that everyone's nap is peaceful and restful.", "YTA. We always adjusted our home schedule to the daycare schedule. Also, do you want to be that parent? They can boot you out, daycares can afford to be picky right now.", "YTA.  If you are expecting individualized nap times, you need a nanny, not a daycare.", "YTA - Do you actually know what care type most daycares provides, this seems like a pretty basic error of expectation on your side", "YTA for sure. Sounds like the staff is trying to get everyone on a sleep schedule so the days go smoothly, and you’re the one disrupting it with your own expectations.  I also think you’d be better off with a nanny or being a stay at home parent if you only want things done your own way. Otherwise, you need to try and maintain the same sleep schedule as the center at home.", "YTA - How far could this go.... When she starts school, you expect the teacher to let her eat an hour before the other children?!", "YTA. daycares look after multiple children. I get all kids have different needs, but to have them all nap at different times seems pretty impossible. If you need something so strict, maybe look into finding someone to come into your home", "YTA. If her day being planned to the minute is so important get a nanny.", "YTA. I’d you want personalized care, hire a nanny. Daycares have a schedule to best meet the needs all all students…you do not get individualized care in this setting. \nUnless they are not allowing for any naps, your child has to adjust to their defined schedule.", "YTA. It is normal for all children to sleep at the same time at daycare. How could you expect them to sleep at different times? What should do awake children do while others are sleeping? If you want a personal schedule you should hire a nanny.", "YTA\n\nI run an at  home daycare. I try to follow the parent's wishes as much as possible, but it has to work for me AND the other kids in my group. I won't let the other kid's naps be disrupted because one child is on a different sleep schedule (they all sleep in the same room in their own crib).\n\nYour kid is not the only one they're looking after and is certainly not more imortant than the other kids.", "Why do you keep saying that her personal needs aren’t being met and this will effect her development? Why would adjusting nap times cause this? \n\nYTA. Good luck dude. Adjust your expectations or be prepared to hire a nanny and homeschool your child,", "YTA. Sounds like you need a nanny or au pair with how you want things done. Other kids are at the daycare too…", "Omg, YES YTA. Your kid is 18 months? Your child's class most likely has between 6 and 12 kids with either 1 or 2 teachers. Even if they wanted to, they couldn't follow each individual kids schedule. That's absolutely ridiculous for you to ask. As a daycare teacher of toddlers, I can't stress enough how much those teachers hate you because I can almost guarantee that this isn't the only time you've done this. And did you go straight to the director without even trying to discuss with their teachers first? Maybe I'm being sensitive because this is similar to something I've dealt with a million times in my career, but come on man!", "YTA\n\nI'm a former preschool teacher I've never once had a parent insist on a separate nap schedule. It's your responsibility as the parent to ask about the schools schedule. If it doesn't work for you, go somewhere else or pay a nanny. \n\n(If you think it's hard with one kid, imagine 30...)", "Info: how do you think working around each child’s specific napping time would work? Like in the real world.", "That’s literally how daycares work, they put the kids down to all sleep at the same time lmfaooo\n\nHow do you expect Emma to sleep when kids are up playing? Vice verse?\n\nYTA", "YTA all the kids nap at the same time and share the same routine. It would be chaos if they had different schedules!!! If you want that kind of care get a nanny.", "I'm pretty sure that ALL daycares have a standard nap time.  Can you imagine them trying to get Emma to nap when all the other kids were having a good time and playing and vice-versa?", "YTA - they have multiple kids they are caring for. They can’t cater to each child’s specific nap time. If you want that kind of attention, get a nanny \nMy daughter was in daycare. She adjusted to the new nap schedule", "YTA get a nanny if you want individualized routines", "YTA.\n\nMy mother ran a daycare for 16 years. Everyone naps at the same time. There's no way for children to have individual nap times. That's absolute lunacy. You are the type of parent we dreaded. Go apologize to the staff.", "Get off that high horse b4 someone knock yo ass down bc wtf😂", "The world does not revolve around you and your child. She will adjust and be fine, assuming you don't get her kicked out before that. YTA.", "YTA. All daycares keep kids on the same schedule. If you want it individualized you will have to fork over the extra money for a nanny or something.", "YTA. If you want individualized care, then get a nanny. If you can't or won't, then leave it be. The caretakers have several children to care for, not just yours. So there are times when they have to do what's best for the group, including naptimes.", "YTA. OP failed to mention in her post that her daughter is 18 months. At the daycare I work at, nap time for that age group is from 12:30ish-3. Some kids nap the whole time, some don’t, but they’re still expected to sit on their cots with a silent toy/book. This is all told to parents when they tour the center. All daycares have a similar system because they’re not about to cater to 14 different kids’ nap schedules. Get a nanny if you are that picky about a nap. Don’t make like harder for the poor employees", "YTA, your child is 18 months old and will need to adhere to the class schedule just like every other toddler in that class. If you want your child to have their own nap schedule get a nanny, not a daycare center where teachers will be adhering to the schedule they already have/focusing on the other children in their care. \n\nAlso, when looking for daycares why didn't you ask them about this issue?", "YTA. Your child’s needs are on the same level as everyone else’s. You’ll want to find a nanny", "YTA and I can tell by your comments that the ruling won't change your mind.\n\nDaycares simply DO NOT have the capacity to do what you are demanding. Get a nanny, or adjust at home.", "OMG. If OP expects her child's sleep schedule to be followed, she should pay for individual care. If she can't afford it, she should adapt. This sounds like extreme entitlement.", "Yeah, you want something so specific that a normal daycare can't give and doesn't have the resources to give. Best to put your money into a one-on-one nanny. You set the schedule and you pay a premium price for your specific needs.", "YTA. The staff should take your child from playing with their friends at your allocated nap times, and be sure to say \"Sorry Emma, your mother insists you have a nap at this time, I'd love to let you keep playing but your mother gets angry when we don't force you to have a nap when she says you should.\"", "A daycare is not a nanny service, if you want extremely specific care for your child you need to hire an individual caregiver. Daycares don’t have time to deal with your “schedule”.", "YTA. Your child is not the only child that needs care and supervision. I used to work in a daycare and we always put the kids down for naps at the same time so everyone was quiet and lying down at once. It was quieter for everyone, and it was a set schedule.\n\nIf you want a specific schedule for your kid then you need to hire an in-home nanny and not send her to a daycare.", "YTA. I only spent two weeks work experience in a nursery and that was more than enough to learn that it was bad enough trying to keep the couple of kids who didn’t nap quiet during nap time. You haven’t given times but if you expect a preschool to be able to accommodate specific nap times then you need a reality check. Even if they did follow it your kids is not likely to be able to sleep through 20 other kids playing, or having lunch or whatever.\n\nIf you want that sort of exact schedule hire a nanny.", "YTA That’s NOT how daycare works", "YTA. It's completely normal for daycare centers to have standard nap times. If you want individualized care for her, get a nanny.", "YTA hire a nanny if you’re so adamant on them following the nap schedule. That’s more of a one on one thing, in daycare they’ve got many kids not just yours and they can’t cater to every single kid like that.", "YTA- this isn’t how daycare works it’s not individualized. You want that hire someone for your child only", "Yta as a former daycare teacher , your child is no more important than any other child in their care how do you except them to put your child to sleep while taking care of the other ones that are still awake ?", "You sound like a privileged nightmare and your child is going to end up the same way if you keep this up. YTA", "YTA, I work at a daycare and there is no way we can accommodate the schedule of every single child! Your kid will get used to daycare nap times and they'll be just fine", "You want Nanny services on a daycare budget. What you’re asking is likely impossible based on staffing levels, also it’s obnoxious to call the staff in to chastise them because your schedule isn’t being followed, sleep schedules change constantly and according to need, you bend to your baby, not the whole school to you. YTA", "YTA. You’re either horribly naive about how daycares operate, or you’re entitled af. If you want your child to receive that kind of detailed, individualized care, you need a nanny, not a center where there are a dozen or more kids that need attention as well.", "Question how old is your child? As a daycare worker in the infant rooms, babies are allowed to sleep when they need it however once they move up to older age groups they have a set naptime that the whole classroom adheres to. There are reasons for this, usually for safety reasons. If your child is not an infant than YTA. If you want a specific sleep schedule that you set than you need to hire a nanny to do that.", "YTA. My daycare has all the kids nap together, at the same time, including babies. Know what I did? I adjusted the nap schedule at home. Also, kids don’t die if they don’t sleep at exactly the same time.", "You are only concerned with your child vs a staff who is concerned with every child. Maybe your child would do better with a nanny and a little less rigidity on your part. YTA", "YTA. The daycare is adhering to a schedule. Their schedule. Which based around their day, and I mean like your daughters day as well. Maybe you should get her on that schedule for the what two days you have her at home?", "YTA. Daycares have schedules and you adapt the kids’ nap schedules around them, not the other way around.", "YTA. What you are describing is a 1:1 caregiver situation. Nanny time, or apologize and accept that you want a nanny but you’re not paying for one.", "YTA - things are different at daycare than at home\nIncluding schedules. Get a nanny if you want one on one attention and a strict schedule", "Hire a nanny if you want special attention only in your kid. \nYTA", "YTA but that isn't too helpful.  Your ask for obvious reasons is out of the ordinary and practically not possible at this (probably most) daycares.\n\nGiven you have this specific ask and the daycare is unwilling to accommodate this ask.  The only solution is to find a daycare that does.\n\nIt's not crazy there may be a daycare that is small enough per class to provide this (with commensurate price).  \n\nOr a nanny.", "YTA. It sounds like you want them to follow your needs and not the needs of your child. You didn't offer any information as to what specifically they're doing that you don't agree with. How many naps is she taking? What times? What schedule do you want them to follow, and how does that compare to what they're giving her?", "YTA. Kids need naps, they don’t need to be strictly regimented. The important thing is that they nap.\n\nRarely will a child cock it’s head to the side a proffer a “golly-gee mummy, it’s the arbitrarily designated time, I wouldst perchance partake of my precise 33 minute nap lest I display rambunctiousness after our midday tea”\n\nBack off the daycare folk and apologize.", "YTA. Yes you overstepped. It’s impossible to have each kid on a separate schedule. YOU need to change your schedule to daycares schedule. If you want your child treated differently hire a private nanny or sitter.", "YTA lol. Daycare/preschool teacher here. We do our best to accommodate, but I'm one woman taking care of ten+ different kids with different needs, and the status quo is for all the kids to nap/rest at one time. I can promise you no one wants to see your child disregulated, but we cannot have children napping at different times/on a different schedule. It's just not how daycares work. \n\nIf you're looking for more individualized attention for your kid, you'll need to consult a nanny. Childcare is *incredibly* taxing work, and you owe the daycare workers an apology. If you're not being heard, go somewhere else, don't shed your frustrations on (often) underpaid daycare workers who are doing their best to accommodate the needs of all children.", "Daycare worker here. YTA, here's why... if Emma is an infant naps are on demand based on what the child is indicating they need. Infant care (up to 18 months approx) is pretty much all on demand. We get a schedule for feeding and sleeping and follow it to get an idea of when to expect a tired or hungry baby but ultimately it is the baby who tells us when they are tired or hungry. \n\nIf Emma is older than 18 months. Naps and feeding are no longer on demand... mostly.  We follow a classroom schedule based around when meals are. Naps typically occur after lunch.  It is not realistic to expect a class of 10 to 16 children (ratios dependent on state and age) to work around your child's nap schedule. If it's too early she isn't going to nap and you're going to be upset. And the other kids are (more than likely) will get woken up by her. She would potentially also miss a meal time. If it's too late she's either going to keep other kids up, get woken up too early, miss a meal, or (potentially, theres always 1) cause the other children to avoid napping because she isn't. \n\nDaycare might not be for you. I will say that most children, I feel, are much better off having the opportunities Daycare provides such as socialization, head start with independence, assistance with potty training, and general skills needed for when she starts school. Really think about whether this is a hill to die on. And to your credit, consistency is important for children, however so is flexibility and resilience. No days are ever the same or perfect as hard as you can try as a mom. Keep advocating for your child, but rethink this one.", "Daycare staff don’t have the time to adhere to dozens of different schedules, kids sleep at the same time. That’s common practice around the world. If you demand a personalized schedule, get Emma her own nanny. Otherwise, be thankful they’re doing what they can. YTA. The nerve", "YTA you can’t expect a room full of toddlers to all adhere to Emma’s sleep schedule. If you want her sleep schedule so perfect and to the minute you should hire a nanny or a babysitter not expect a daycare taking care of a GROUP of children to do it.", "YTA. If you want individualized care for your child then hiring a nanny would be the appropriate option for your needs. Keep in mind though that this will be much more expensive than a daycare (most likely). While a consistent sleep schedule may be something you believe is essential, surely you must realize that it’s simply not realistic with multiple children being cared for?", "YTA!! Your child is almost 2 and a toddler, not an infant who needs to nap on a routine schedule. Your baby is following the routine of the class and with how many babies there are to 1-3 teachers how can you expect that to be realistic? The schedule is important for your own happiness and not the child. Communicate with the staff and get involved in the class to see what her day is like and adjust YOUR schedule to her on weekends", "LMAO.  You are entitled and unrealistic.   No daycare in the UK would do this.   The children nap when nursery (daycare) says and you as the parent put up with the routine they set.   They eat when nursery says and potty when nursery says.   If that doesn't suit you tough!  Get real honey! YTA", "Sigh YTA another entitled parent who thinks they're the only people in the room", "YTA. I used to work in a daycare and parents like you made my life so much harder, and were the reason I quit. \n\nIt is nearly impossible to keep up with every parents specific demands for their kids. If you need a specific routine, hire a nanny or stay home. When there is one-two adults in a room with multiple kids, there needs to be flexibility. Especially when the kids are at napping age. They also often cannot abide by what you need because of the laws regarding daycares. When I worked in one there had to be an adult looking at the sleeping room, which means if one kid was sleeping that left the other adult to manage 7 kids at once. That’s never going to happen. They have the kids sleeping on a schedule for a reason. \n \nYour kid is not going to grow up to be a failure or a bad person because they didn’t have the consistent sleeping schedule YOU want.", "YTA. I don’t know of any daycare that doesn’t have all the kids sleep at the same time. You can’t have one sleeping and several awake and so on. This is how daycare works. You either spend more money for a nanny or adjust your nap schedule to match the daycare.", "YTA\n\nThat’s not how it works.  \nA daycare cannot possibly facilitate 10 different schedules for 10 different kids.  You are delusional to think you are making a reasonable request.  If your child requires a specific schedule or care you need to find a nanny to come to your home.  \n\nIf you want to continue at this or another center you need to adjust your expectations.\n\nEdit:a word", "Yta get a nanny if you want an individualized nap schedule", "YTA. They don’t follow your child’s schedule, your child follows theirs. And why would you F with the people watching your child??\n\nEdit: spelling", "INFO: Is her nap routine so strict because you want her to be asleep soon after you pick her up so your evenings are free?", "YTA - every kid has the same nap-time in daycare. Hire a nanny.", "Lol. Where do you think they could put individually napping children? In the same room as children playing? \n\nYou're asking for 1:1 with your child, you'd have to up your fees to at least £200 a day if you wanted that.", "I feel like this is a soft YTA. I get wanting your child to have a consistent sleep schedule, but you're acting a little entitled demanding that the daycare disrupt how they run their business just to cater to you, despite having other kids to look after, and it making perfect sense in every way to have all the children nap at once.\n\nYour kid will be fine. Relax.", "YTA you have impossible expectations it seems.\n\nYou should apologize 100%.\n\nThey have probably a waiting list and wouldn’t mind kicking you out of the daycare if you continue to cause issues like this.", "You're expecting a daycare to function the same way as a one-on-one nanny specifically for your child, and that is not a reasonable expectation. The director was right, you are overreacting and you do owe the daycare staff an apology. YTA.", "YTA. I used to work for a daycare, and nap time is at the same time for all the kids everyday. Your child isn’t the only one they are looking after, and having a set nap time for all the kids as opposed for individuals just makes sense. \n\nAlso, how do you expect your daughter to sleep during activities? Or recess times? Who is going to stay behind and watch her while the teacher takes the other kids outside?", "YTA. The daycare has schedules aligned to the needs of every stakeholder in the daycare. It would be impossible to accommodate every parents want (not need), despite your insistence that it's detrimental. It actually isn't. It would be better for you to modify her sleep schedule to mirror what the school does. This way, there's consistency. Otherwise, hire a nanny. Then you'll have total control. Until then, be considerate of the staff. Parents like you make it very difficult in what is already a high stress, low-pay environment", "YTA. \nGet your kid a nanny if you want her to have an individual schedule.", "YTA- my son is in daycare, has been since 11 weeks. We try and stick to daycare’s nap schedule since he’s there 5 days a week. \n\nIt’s better to have them all napping at the same time.", "YTA. They run a carefully planned day that provide routine for all of the kids. Your kid will get used to it.", "Info: How old is your child? \n\nEvery daycare parent I've talked to, and my experience with my son is after they are infants, children are on group nap schedules. You can hire a nanny if you want to have a regimented schedule for your child. One on one care would be able to adhere to what you're requesting.", "Yta. I've found that daycares do their best to accommodate individual preferences within the structure of their routines. If you want a struct routine, which is your right, you need to find a care provider who can accommodate that.", "YTA you sound like you need a personal nanny and you should do that. Your child’s needs aren’t special and she is in a day care with the other children. The staff cannot accommodate her sleep schedule. If you cannot afford the special individual treatment and care you want, may I suggest making more money.", "YTA. This is a joke, right? Hire a nanny if you want your child to follow her own separate schedule. You clearly don't understand how daycare works. Or how staffing works.", "YTA. You owe them an apology, but you will be better served finding a new day care, or hiring a nanny so your precious schedule can be maintained. My sister burned out of ECE because of parents like you.", "YTA. Your expectation that your daughter is going to sleep at daycare when all the other kids are up and running around is insane. Why not adapt your home routine to match the one that she used at at day care if it's so important to you.", "My daughter keeps the daycare schedule  for nap time. So much easier for everyone.", "YTA\n\nPay for a one on one babysitter if you want your child catered to otherwise these people seem to be doing their best and it’s unreasonable to think everyone else will or should follow your specific sleep schedule.", "YTA- \n\nIf you want a specific schedule for your child, then you need to invest in a nanny. Otherwise, you need to make some concessions, here. Of course you don’t feel heard, you’re being obnoxious. Emma might do well to have YOU change her schedule to more align with the daycare hours than the other way around. Is your toddler really going to nap with how many other children running about and playing? It’s very unlikely. \n\nYou are overreacting. You need to make the changes, or get a nanny. Those are really the only options you have. Best of luck.", "YTA.  Expecting a daycare to adhere to each child's individual schedule is insane.", "YTA. It's a daycare. Yes they're all going to be on the same schedule.", "YTA. It's a daycare, not a nanny. Deal with reality.", "YTA. And as a mom I get it. But when there are 1-2 staff members with 4-8 kids, they have to follow a consistent schedule for *everyone*.\n\nIs your daughter treated well? Getting fed consistent, nutritious meals? Getting the opportunity to take an adequate amount of/length of naps? If so, you have to accept that some of the finer details are going to be out of your hands. The curse of a working parent is that you won’t always have 100% control.\n\nIf you are absolutely unwilling to compromise on a nap schedule, you need to consider alternative childcare (like a 1:1 nanny).", "My son has gone back and forth between  having the same schedule at daycare and home and having two different nap schedules. He has done just fine and both situations. We’ve only ever had a difference of schedules whenever we were transitioning and losing naps. Before my sons are daycare I made sure to put him on the daycare nap schedule at the end of my maternity leave. Their needs outweigh your wants.\n\nCome join any of the parenting separates and we can give you advice, but I believe all will concur but unless you have a nanny, you’re not gonna get an individual sleep schedule.", "YTA. Get your kid on the daycare’s nap schedule at home for consistency.", "YTA. Daycare has a set nap time for all the kids. It’s impossible to keep the all the kids quiet all day long so each kid can have their own specific nap time. You’re wanting a nanny who provides individual care, not daycare which is a group care setting.", "YTA, do you know how most daycare operate?", "YTA. Change your schedule to match the daycare schedule. Problem solved.", "INFO: how do you expect your child to sleep while the others are running around, etc.? vice versa?", "YTA. Kinda sounds like you need a nap.", "Have you been screened thoroughly for postpartum anxiety and depression? At 18 months, your child is fine getting on the daycare’s schedule. Your distress over this is a bit of a red flag that something bigger may be going on.", "YTA, your child is not the only child under their charge. Why would you expect your child to get a different nap schedule than all the other kids at the day care? If you want individualized, one to one care get a nanny and leave these people alone.", "I honestly can’t wrap my head around the fact you thought that was logistically possible at a daycare. \n\nYTA", "YTA. Your child isn’t The only one with needs. If you want YOUR specific schedule followed then hire someone private. Otherwise once they get all the kids on the same schedule, she will have a consistent schedule", "Huge YTA. You sound very entitled. There are a group of students with your child in the classroom who follow a schedule that not only works for the kids in that specific classroom, but for the entire school building. If you are that ridged with schedule, hire at home care for your kid. \n\nYou definitely owe the staff an apology.", "YTA. I get it nap time is important but your kid isn’t the only child there. Imagine if they tried to get all the kids down for a nap at different times? Nightmare. You want more focus on your child? Hire a nanny.", "Yta You just don’t understand daycare. My sons daycare nap time is 11-2 your asking low paid workers who are overworked to give your daughter special privileges. She’s not special to them. She naps when the other kids do. Like those broke people that get offended when someone donated them off brand stuff. Like Nah your broke you don’t get to be picky about getting Nike or Gucci or whatever other brands people hold up.", "YTA....get a nanny at home if you want that strict schedule", "YTA. As a former daycare worker who had a classroom of 10 toddlers, it is simply impossible to have children nap at different times. Most daycares have children nap at the same exact time so there are no disruptions. Your child is still getting their nap, but it is going to have to be adjusted to fit the classroom’s schedule.", " \"and were instead trying to make all the children nap at the same time, regardless of their individual needs.\"\n\nYeah, it's a daycare center. YTA", "YTA donyou really think 30 kids can nap at all different times?  That's not a thing.", "YTA\n\nDaycares run on a schedule. If you want your child to adhere to a different schedule you need to keep them home so you can put them down for a nap at whatever time you want. \n\nAs a former daycare worker, you’re the worst kind of parent. I can guarantee all the teachers at this centre have heard about you and your little temper tantrum\n\nAlso, you would 100% be told the schedule when you toured the school/enrolled. So you knew the schedule and somehow just thought that the teachers would put your one child on an entirely different schedule than the rest of the class. How selfish.", "YTA. Unless they promised you that they would adhere to your schedule, YTA. \n\nAs someone who works in education, I suggest you hire a nanny for now and then homeschool later. If you don't like your child being treated as one of the crowd in daycare, you are REALLY going to hate what happens when they get to school.", "I’m someone who’s very anal about my kids sleep schedule so I get your frustration. But you have no control over how your kid sleeps at daycare. Most teachers have the kids on the same schedule because it’s easier trying to get them to nap at the same time then having various schedules. It maybe rough at first but your kid will adjust. Instead of attacking babes teachers you should ask what can you do to make this a smoother transition. Maybe you need to adjust your schedule at home. When I had this issue, my kid had his daycare schedule and at home I did what worked for me. Days my kid didn’t nap well, early bedtime. Moving up bedtime will help babe not get overtired. So adjust your expectations and apologize. Keep pushing them and don’t be surprised when you’re kicked out. Waiting lists are full in a lot of places so they can easily fill your kids spot.", "YTA\n\nIf it’s important enough, find a different child care provider.", "YTA. You expecting a daycare to singularly adhere around your child’s schedule is unreasonable and entitled. If you want individual attention on that level, then hire a nanny, au pair, or regular babysitter.", "YTA. Daycare is not an Au Pair.", "YTA \n\nIf you can’t afford a nanny (which most families can’t) your best bet is to adjust your child’s nap schedule to the centers", "YTA. Can you ask for the schedule so you can change your child’s sleep schedule at home instead? Since the daycare can’t change theirs.", "YTA daycares have their own schedule that we as parents need to adjust to ourselves because they have too many kids to cater to each one. \n\nIf their schedule is so far from yours then find another daycare but don't be an AH to them.", "You seem confused. The daycare sets the rules and the schedule. You hope that you get a spot in the one you want.  You’re super nice to the underpaid overworked staff who is caring for your child in your absence. Hopefully this clears it up for you. \nYTA Apologize", "Huge YTA. If you want a specific schedule for your child, pay a nanny. A daycare does not need to follow your demands unless it is medically necessary.", "OP, since you’re so fancy that you think a whole daycare needs to revolve around your snowflake’s nap schedule, get her out of the and pay instead for a nanny to do what you want at home. And don’t forget the nanny cam do you can check the nanny is doing their job up to your standards.", "YTA.  When you send your kid to daycare, you implicitly agree to their handling of nap time, snack time and any other group activities.  \n\nHire a live in nanny if everything must revolve around your child.", "YTA . While reading your text the only thing I could think about was the mom that threw a tantrum in elementary school because she was taking her son on a week long vacation and the teacher wouldn’t “hold off” on teaching anything new for the week. Everyone I know that work in education always say the kids are not the problem, parents are… the entitlement in your post is incredible", "Former daycare worker here.  If you want to be **that** specific you need to hire a nanny or a babysitter for your child to be one on one with.  There's no way with all the other children that the daycare can tailor the day to each of them\nYta.", "YTA. It is typical in a daycare situation for the children to have a scheduled nap time at the same time. If you want consistency hire a nanny. You can't demand that your child have a specific nap time. That doesn't work in the daycare setting. You sound exhausting", "YTA! Can we say helicopter Mom.....", "YTA - let the professionals do their job\n\n\nHow would you feel if the day care people rolled up to your workplace and told you that you were doing everything wrong.", "This must be your first child poor dear YTA YTA you’re insane to think your kid would be able to nap while all the other kids aren’t napping also if you don’t apologize I hope they drop you as a client so you can try another daycare and learn some hard lessons the world don’t revolve around you or your child", "Yta I keep my kid on his daycare schedule at home rather than vice versa, as he’s only home 2 days a week and there 5 days. The routine is good for them.", "I am also a working parent that wants my child to have a consistent nap schedule. It makes it easier for me and my child is more well balanced through the day. However, you have to recognize that there are many kids and limited number of staff. If you want an individualized schedule then get a nanny. Either that or start transitioning your child’s schedule to match the daycare. YTA.", "Larger facilities by and large will only operate on their own set schedule for naps, eating, playtime etc. They simply would not be able to cater to all the kids individual schedules. Sounds like an in home caregiver situation would be suited more to your needs.", "More info, how old is your child and what room are they in? At both centers my children have attended the only room that's followed a routine is nursery. Once they move up rooms it's communal naps all at the same time", "YTA. Look I have 2 kids myself and I get it. But those staff are dealing with a lot of children at once. They can’t just set one down for a nap separately from the rest, it just won’t work. Either the child napping separately won’t nap or the other children won’t because there is too much noise. Get over yourself and adjust your schedule as best you can to work with the daycare instead of demanding special treatment for your child. She may be the centre of your world but she isn’t the centre of the whole world.", "INFO: Was this something that you discussed in advance to signing up? We have been touring daycares and they have been upfront in saying if they will follow our schedule (to the best of their abilities of course) or if they have a standard schedule for all of the kids.\n\nNote: this has been my experience for infant daycare. Not sure if it’s an offered option as they get older.", "YTA. The daycare DOES have a consistent schedule, it just doesn't happen to be exactly yours. Get over it or do yourself and the daycare a favor and find a nanny.", "YTA. You need in-home care or to stay home with your toddler.", "OMG YTA, you need to adapt her home schedule to the daycare schedule, not the other way around. You're lucky they don't fire you.  You would have a much harder time finding a new daycare then they will finding a new kid.", "the daycare isn't messing up your child's health by having them nap at a different time.\n\nthey're messing up the downtime that you used to have when your child napped at a different time with you, aren't they? \n\nit's absolutely dense and absurd to think that you can have one child out of an entire daycare group to nap while all the others do activities.\n\nif you can't accept that then it's time to start looking for a nanny that you can lord over in your own home.\n\nYTA", "YTA a daycare isn’t going to change an entire schedule for your snowflake", "INFO: Age of your child? In young infant rooms children allowed to remain on their own schedule but 12 months is usually when daycares begin to start having children nap at the same time.", "YTA-but daycare shouldn’t affect your baby’s home sleep schedule. My daughter never napped well at daycare, but she followed her consistent sleep routine at home until 3. (Don’t ask me now age 3 is killing me). But yes even 4 month old babies can still pick up habits, so if you’re consistent at home, a wonky daycare nap schedule won’t matter.", "You are being unrealistic", "INFO:  what is the difference between what you think she needs and what she is getting", "At my daycare there were different rooms based on age. So the babies were in one room and could be laid down at different intervals. When they were older they moved in rooms where there was a set nap/rest time. The ratio of staff to kids was different in the different rooms. The rest of the day was scheduled around activities, learning, play and meals. If they tried to have different schedules for all the different kids, it would be chaos. I’m guessing your daycare might be similar and it’s probably something you should have discussed when you signed your kid up. This daycare might not be the right fit for your family.", "Your child is a lot more resilient than you think. Yes, a schedule is important but you're acting like Emma can't adapt at all... Her \"total health\" will not be negatively affected by the staff using their sleep schedule as long as she's getting enough sleep each 24 hour period...\n\nI'm sorry but you're overbearing and way to self-important... lighten up. \n\nWe've got three Littles and do NOT arrange everything we do around naps... If we're at the lake or something, we just do our thing. When they're tired, they'll sleep. We don't have to make some big thing of it... kids adapt and it's only a big deal for you because you make it a big deal...\n\nYTA", "YTA. I used to work in daycare and my wife did as well, for many years. \n\nYour child is one kid they’re watching out of many. You’re worried about the consistency at home? They’re worried about keeping things consistent and manageable for a room full of children, all of which are just as important as yours.\n\nYou want to simplify this even more? You gave up control of what happens during your child’s day when you left them in someone else’s care. If you really want your instructions followed to a tee, you need to stay home or hire a nanny. If that isn’t feasible then: 🤷‍♂️.\n\nParents like you were always the worst to deal with and I guarantee those daycare workers aren’t being paid enough to put up with you.", "As someone who works in day care, you may find your child is transitioning to one sleep a day, they may have tried to follow your routine also, but a LOT of children struggle with sleep time as other children are still awake and they want to keep playing. Rather than distressing your child, they are meeting her needs by giving her one sleep when the other children sleep so as she can have proper rest and sleep. Multiple routines are difficult in that age group but most children are or have transitioned to one sleep around this time. Do they get tied and grumpy in the afternoon? Yep, but this is their bodies way of getting used to one sleep. You are going to have to ride out the witching hour in the evenings until her body gets into the routine of one sleep. YTA for not discussing with the Educators why she is only having one sleep and working on a compromise. We are doing what is best for the child. Not what is best for you.", "YTA-I'm no expert but I assume that daycares can't adhere to separate nap schedules for all the kids because it might make it harder to watch all the kids and account for all of them and might make it harder for specific kids to have naps while everyone else is awake. and nap times are times for the staff to get things done or set things up, they can't do that when some kids are consistently awake.\n\nif you want specific nap schedules, get yourself a babysitter or adhere to the daycare's schedule of naps in your usual out-of-daycare routine.", "YTA. It's a daycare, not a nanny service with a one-to-one child to caretaker ratio. If you need this much control over your kids schedule, hire a nanny", "YTA- your expectations are unreasonable. If you want a nanny then pay for one", "Oh no someone call Galileo cause apparently the earth doesn't recover around the sun but around this lady and their child. YTA", "If you want your special snowflake to be treated differently - hire a nanny in your home. YTA", "I wonder how these AH feel when the internet tells them that they’re the AH. But yes, YTA", "INFO: What about your daughter's nap time is so special that you couldn't possibly change her naptime on the weekends so it fits her routine at school?", "INFO: Did you explain your child needed to adhere to a certain schedule up front and if yes,  did they say they could definitely accommodate that?", "INFO\n\nare you taking your child to a daycare where setting individual nap times is oart of the service? As in, is that something that when you asked they went \"absolutely\" and took times or are you expecting any random daycare to get each child to sleep to the parents liking?", "YTA", "No, you’re not the AH for wanting your nap schedule followed but you’re also not being realistic and are being an AH for how you handled it and lack of even thinking about the logistics of that….\n\nThey have many children and to follow each ones nap schedule specifically is impossible. It’s a joint room, with lined up cribs. Maybe your child is not able to sleep while others play? \n\nYou’re definitely overreacting and they do not owe you an apology. If you want your exact nap schedule followed than you need to hire a nanny for just your child.  Otherwise you need to move your weekend nap schedule to follow the daycare schedule if you want everything to line up.", "How old is your child?", "YTA. It is not fair or feasible to the daycare staff to insist your child be treated differently. If you care that much about your child staying to an individualized schedule hire a nanny.", "As someone who worked for years at a daycare and was also a nanny. You have to realize that all the kids at a daycare are on the same sleep schedule, we do it because it’s not possible for the kids to get restful sleep in a room where other kids are awake and making noise. During the time the kids are napping the teachers are cleaning, preparing food/bottles and making sure they have everything reset for when the kids wake up. If you put your children in a daycare environment you need to be flexible with your children’s schedule. \nIf you aren’t willing or able to do that, you need to hire a nanny or do a nanny share. \nBut you definitely need to apologize to the daycare workers, they are doing their job.", "Lol YTA. So you think daycares have the bandwidth to implement *individualized* nap schedules for each kid? \n\nSweetie, what you are looking for is called a nanny. And that’s gonna cost you.", "YTA. Trying to make a daycare bend to your specific needs is not what they cares for. Hire a nanny and if you can't afford it, then just deal with it", "YTA.  I think this is one of those situations where you only have your view point, and it is hard to understand the reasons for why things are the way they are.  Like how everyone should work retail and food service at least once, because if you don't you truly don't understand what goes into it and what people deal with.  So then you have the \"how hard is it to do a food order?\" Mentality.  \n\nSo here's the thing.  A daycare has multiple children, and the staff to child ratio is not 2:1 or 1:1.  It takes time to get everyone changed, fed, laid down, and actually to sleep.  No one individual is assigned to Emma to meet her direct needs.  It's just not possible to do in a group when you also have to adhere to state/federal (if in the U.S.) regulations.  There is often a time span that is required for \"Naptime\" even if the kids don't all nap every day, and trust me they don't.  Some are over stimulated, some are losing their need for a nap, and some are just stubborn lol.  \n\nYou as the parent DO have the right to decide how and when your child is scheduled to do pretty much anything. By choosing a daycare you decided that, that was the environment you wanted and would follow their ways when Emma was with them.  Their procedures are the same for everyone, it would not be fair to other families to prioritize one.\n\nIf you want that control, you're looking for a nanny or family member.  They do not have multiple children and are not bound to the same laws and restrictions as a center (even at home centers) are.  They can follow all of your rules and you can decide how to handle them if they choose not to.  \n\nThe staff is frustrated because you're treating them like individual sitters for Emma, instead of daily providers and care givers for a classroom full of other Emmas.  Each with their own schedule at home that they've now adapted to at daycare.  \n\nYou absolutely do not have to keep Emma there if you feel it is hurting her so much, but if you like the arrangement otherwise, I'd suggest getting a copy of their daily schedule and moving your home schedule closer to it.  Is she home during Naptime more or there?  Which would be easier for her?  \n\nAlso kindness gets a lot more done than aggression.  These are the people caring for her for hours each day.  They're not your enemies.  They aren't your employees.  They provide a service and you want that service.  If you leave there are others in need of daycare that will fill your spot.  They do not need you the same way you need them.  There's always more kids.", "YTA. Get a nanny if you’re going to be that strict.", "YTA\n\nI worked in a daycare for a while, there are set times for a reason. There is no way in hell you can have one kid napping while everyone else is playing and there is no \"shh play quietly OP's kid is sleeping.\"\n\nAny daycare is going to have scheduled time for everything. Breakfast, indoor play, outdoor play, learning, lunch, nap, bathroom(to an extent) you name it. If you don't like it, sounds like you need to stay home or get a family member to watch your kid.", "Wow. If your child is so much more important than the other 30 kids the overworked and underpaid teachers have to care for, either hire a nanny or stay home. \n\nYes, YTA. Apologize immediately and hope they don't give your daughter's spot to someone else.", "YTA, get a nanny if you want to dictate the schedule of your child. At a daycare, the schedule is determined by what is appropriate for the majority.", "YTA. If your child has such specific medical needs that she really has to keep a strict individualized schedule, then she is not a good fit for daycare and would do better with a qualified nanny. Finding another daycare won’t resolve the problem because even if you could find a one with a nap schedule compatible with hers, it’s still no guarantee they could make her keep it what with all the other disruptive and chaotic preschoolers afoot.\n\nPreschool is full of preschoolers. Flexibility and adaptability are key to dealing with this population. If that’s in conflict with your child’s needs, then preschool is not going to meet her needs.", "I’ve worked in a daycare and that’s not how that works. The kids take naps at the same time. If that’s not what you want, then you need to just hire a nanny to take care of your kid.\n\nEdited to say YTA", "YTA You’re asking them to do extra work that, with all things considered, is not productive for the center staff or the other children. If you want that kind of specialized care from a daycare center, you need to find a provider that offers those services and be prepared to pay significantly more for it, lol or get an in home child care provider. Either way, it’s your responsibility to adjust your kids sleep schedule by factoring in everything else that’s going on during the day and working around it. Since you’re not going to be caring for your kid during the time that your desired nap time falls in, you have to adjust to the the daycare’s nap schedule, not the other way around. And you most certainly do owe them an apology.", "YTA. She's still napping, and being taken care of, her health and well-being aren't at risk! Is not like she's off driving a motorcycle through a ring of fire drenched in gasoline herself. People who have studied for this and are also in charge of other children, are taking care of her. Perhaps you should learn not to try to control everything and benefit from therapy and buy something nice for the day care.\nUnless of course you are capable of hiring a nanny who'd be desperate enough to not quit when you call her for the hundredth time in the hour because your kid is not in the exact position you want them to be?\n\nPlease breathe, learn to trust the professionals who have NOT mistreated your child in any way and are actually taking good care of her. And have a deep sincere apology for them. Remember, day cares can also refuse service", "This totally reads like 'keep my child awake so she is exhausted and will go to sleep the moment I get her home.'", "YTA", "YTA", "Is it a rule at that daycare that all children nap at the same time? How did you know her nap was on a different schedule? Was it causing issues?", "You do not say how old your daughter is. Many daycares will try to keep to individual schedules for very young babies, but as the children get older, they try to get all of them onto the same schedule. I cannot really judge this without this info but since they should have told you the schedule they were going to follow and why when you told them your daughters schedule I will go with NTA for now. However, if you try to force them to do this and your child is over 12-18 months you may be the AH. This is the give and take of group child care.", "INFO: What is Emma’s nap schedule? What is the daycare’s?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackground info: I'm a working parent who values the importance of a consistent sleep schedule for my child. I've always been specific with the daycare staff about my child's nap schedule and needs and it's important for her health and happiness to have a consistent routine.\n\nMy child (let's call her Emma) has been attending the same daycare for a few months now. I noticed that her nap schedule was being disrupted and I couldn't figure out why. I suspected the daycare staff were not following my instructions properly. I decided to set up a meeting with the daycare director to discuss my concerns. During the meeting, I found out that the staff were not adhering to Emma's nap schedule and were instead trying to make all the children nap at the same time, regardless of their individual needs. I was furious and expressed my disappointment in the staff's lack of attention to my child's needs.\n\nNow, the daycare staff are mad at me and the director thinks I am overreacting. I feel that my child's well-being and development are being compromised and I am not being heard.\n\nNow the daycare staff are expecting an apology. Did I go too far here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA", "INFO, how much are you paying for the daycare?", "As an ECE I always try to stick to a child's schedule. The Infant room we do exactly that in toodlers and preschool we just aren't able to do so. I would say NTA because the daycare should have told you that nap time is a specific time when you stated her naps.", "YTA.\n\nIts a system, systems work best when things are consistent, not the best for accomodating to individual needs. Imagine a school that has different break times to suit all the different times the students may be used to eating or resting....not gunna work is it?\n\nMaybe this daycare centre isn't the best for your child, maybe try find something smaller and more likely to care to individual needs.", "I’m kinda getting the vibe that ‘Emma’s’ nap schedule is an early one so you can pack her off to bed without doing much parenting on an evening… otherwise I can understand why you’d be so weirdly put out by this unless it was disturbing the selfishness you so clearly revel in. YTA.", "YTA duh this is normal for a daycare. She ain’t special.", "YTA\n\nSince the school has your kid more often during naps than you do, maybe you should alter the nap time to fit their schedule?", "YTA.\n\nYou really expect a daycare to only accomodate one kid? If you want your kid to have a consistent nap schedule, daycare is not the best choice for that. \n\nKeep in mind OP, your kid is not the only kid they daycare staff have to take care of", "YTA\n\nIf you want such personalized attention, get a Nanny. Yours is not the only child they care for.", "YTA, the daycare is not set up to cater to every childs individual schedules or routines unless it has to do with medical issue like diabetes, asthma, or a severe allergy. If you want individualized care for your daughter I would suggest hiring a nanny. You most definitely owe the daycare and staff an apology for your sense of entitlement when they are providing a safe nurturing atmosphere that allows your child to learn social skills.", "Did they tell you that they would specifically follow the nap schedule and then not do it?", "ahh you’re one of those parents. i work at a daycare and i can tell you that’s not how this works. we take care of a lot of kids. we can’t do everything you want us to do for one specific child. i had a parent who when she first brought her son wanted him to have 4 naps. her son would refuse to nap and he barely had time to actually be a baby cause we tried to accommodate the needs. obviously it didn’t work and she was not happy. she had to get over it though cause we can’t force him to sleep (or eat - but that was another issue for a different day)\n\nverdict; YTA", "YTA.  As someone who worked in this setting, individualized nap schedules for multiple children in this setting is not possible.  You opted to enroll in daycare.  This is a group classroom setting at this age, much like enrolling your child in school.  Their schedule is your new schedule.  Adjust your daughter's home routine and schedule accordingly.  If you want to micromanage your child's sleep during the daytime, then be a stay at home parent or shell out the extra money for a nanny or au pair.", "YTA. The daycare is a center and take all kids needs collectively when looking at things like nap schedules. I’d you want to demand a specific schedule then you need to get a nanny.", "YTA and if you keep doing this, expect to be booted. Find a nanny.", "YTA.\nYou need a nanny. I'm a former daycare worker and unfortunately every child cannot be catered to. Most centers I worked in every child napped at the same time to help avoid disruptions and give staff their breaks.", "YTA. Daycares cannot accommodate each child falling asleep at different times. How would that work, exactly? 2 kids trying to fall asleep while 20 others are playing loudly in the same room? Who is going to watch the kids that are awake while the staff is trying to get other kids asleep at different intervals? What you're asking isn't possible. Given that your child is presumably there 5 days a week, why can't you adjust her naps on the weekends if you're THAT concerned about her falling asleep at different times? If you just can't handle any changes, you need to hire a nanny. If you can't afford a nanny, you need to adjust your own expectations.", "YTA because of reasons others have already specified. i just want to throw out there that if you make it a habit of picking fights with any daycare, school or activity your kid goes to you will make your kid’s life absolutely miserable. i know from experience - my mom rocked the boat literally everywhere and i got it in the neck for it from everyone because i was her kid. people will take out their frustrations about the parent on the child - it’s not right but it’s how it is. so think very carefully before you make your kid the “problem parent kid”.", "YTA\n\nAs a parent with 2 children both in daycare, you're being completely unreasonable.", "YTA - it's unreasonable to expect daycares to cater to individual sleep schedules. If you want something like that, you'd need to hire a babysitter/nanny", "YTA. Hire a nanny. Daycare staff aren’t paid enough to adhere to your customized schedule.", "YTA Daycare centres aren't nannies. You get what you pay for. What you're paying for is a daycare centre. If you want someone that works for you only and follows your schedule, you're going to need a nanny.", "YTA Absolutely unacceptable expectations get your own personal nanny and pay them accordingly. You pay the daycare to take care of your child, not cater to your controlling demands.", "YTA. You got the schedule for your child's classroom when you went to tour the school & sign up. You probably even asked about your special naptime for her then & were told, \"No,\" but figured you could bully the teacher into doing what you wanted - it's a health hazard & potentially illegal to have the sleep mats down during the middle of the day while the other children are playing (providing a trip hazard). Your child would also miss out on learning.", "YTA.  That’s how daycare works. Everyone is on a schedule. In that event your child goes onto elementary school, it also works like that there too.", "INFO: Why do you think your child’s needs have to be met when it will decrease the ability to care for other children in the center? \n\nYTA. Hire a nanny or get over yourself/sense of self importance and adjust your child’s sleep schedule to the daycare.", "YTA you want a strict separate schedule in daycare with a dozen or so other children. That's not how it works. You want a set schedule get a private nanny. You can't expect a daycare to force all of the other kids to be quiet  just so your child can keep to your schedule.", "YTA. Your kid is not a special snowflake; they are not equipped to allow one child to be off-schedule when the rest of them adapt to a developmentally appropriate one.", "YTA, 100%. This is not how daycares work. The world doesn’t revolve around your kid. You don’t get to roll in with your own schedule for anything.  Imagine trying to get one kid down while the others were still up making noise?!", "Yes, YTA. If you want precious Emma to have a specific nap time then pay for a private nanny. Daycare cannot possibly provide individualized custom experiences for every kid in their care. They provide the basics of what’s required (supervision, nappy changes, snack/meal, nap) in a bulk care environment. Come on now.", "Yta, as a former daycare teacher. You're also probably a nightmare to deal with. You're expecting a whole classroom schedule to stop and adhere to your child, for what? Your child is going to develop no matter what time she takes her nap. Parents like you made my job so much harder, and it's the top reason I left daycare work. I'm not saying any of this to be mean, I think you just need a reality check.", "YTA. \n\nYou need to make the daycares nap schedule fit into your routine. It’s completely unreasonable to think they are going to be able to have a different schedule for each kid. \n\nYou are not paying for a nanny, where you could reasonably have these expectations.", "YTA: unless you can explain how one can run a day care where each child has an individual nap schedule.\n\nIf you want that level of individual care, you need to look at hiring a nanny.", "You said in comments your child is now 18 months, this is completely NORMAL for daycare centers to do as she is about to or has transitioned to a toddler classroom. Toddler classrooms follow a group schedule, you are used to an infant schedule which is individualized. However your child is growing and if you wish to keep her in group care she needs to follow the group schedule. \n\nYTA if you continue to push this issue.", "YTA.  I bet everyone there thinks you are a treat.", "Of course YTA. Daycare workers are not paid nearly enough to put up with this degree of entitlement. Quite frankly it is highly unlikely that you will find any daycare that will allow your child to have their own personal nap schedule. How exactly did you imagine that happening in the daycare? There are massive shortages of daycare workers in the US. Either hire a private nanny that will cater to your individual schedule OR go back and apologize sincerely for being a total cow and prey they don’t fire YOU.", "YTA. I am also a working parent, and I very much value having a consistent nap schedule for my child as well. As soon as my child started to have certain times they were sleepy, we set a nap schedule. \n\nThat being said, daycares manage far more children than I do. One kid who is not napping at the set nap time is going to be disruptive for all the other children. \n\nMy daughter went into daycare with our set nap schedule and came out with a modified nap schedule based on the daycare routine. What did we do at home? Modified to fit her new nap schedule that she adheres to 5 days a week vs. the weekends spent at home. \n\nIf the schedule is disruptive for the time your child is at home, get familiar with the daycare nap schedule. Adjust accordingly. \n\nKid nap schedules aren’t meant to be set in stone anyway. Their nap schedules evolve naturally as they get older regardless of daycare. In this area, it’s easier to be more flexible than rigid.", "YTA! So what makes your daughter so special that she gets a sleep schedule different then anyone else? Do you know how many workers would be required if they did all the kids sleep schedules separately? Do you realized how entitled your acting? 🤦🏽‍♀️", "YTA. Hire a nanny if you have that strict of a schedule, otherwise adapt.", "YTA. Majorly. You chose to put your child in a group setting. The center's job is to do what's best for the group as a whole. You can not have a class room full of toddlers and keep some awake and get others to sleep. Also, the center legally has to give the teachers breaks. They are human and they need to eat. They also need  time to clean and plan. For an ECE classroom to remain functional, it needs to remain very structured and  all the children need to be  on the same routine. They teachers  cannot  and will not create chaos because of one entitled mothers feelings and inability to relinquish control.", "Unless the daycare originally said they could accommodate your specific nap times, YTA. Typically, when your kid goes to daycare you adapt their weekend schedule to meet what the daycare follows during the week to keep things consistent. Majority of the time, it’s not realistic for the daycare to be able to accommodate the demands you’re describing.", "YTA hire a nanny, Daycare workers don't have the manpower or time to put every child on a custom sleep schedule. Unless your daycare that has a worker for every 3 children (highly unlikely) your request is unreasonable", "YTA..if you want that strict of a schedule followed for YOUR child then get a nanny to keep your child at your home. The daycare schedule does not revolve around your child.", "I need info, please:\n\n• How old is Emma?\n\n• What age group is she in?\n\nI worked in a daycare's infant room (4wks to 15mos) and they slept on the schedule provided by their parents. \n\nChildren in the Toddler Rooms and above had a schedule nap time after lunch - children slept at those hours or not at all, outside of extenuating circumstances.", "YTA. You want nanny care on a daycare budget. Just like my momma always says you have that champagne taste on a beer budget. 5 different kids on 5 different schedules lol", "YTA. It's a daycare not a nanny. You and your child are not special snowflakes and need to learn to fit in with the schedule. It is not possible to have individual nap-times for every kid. \n\nGet a clue and stop acting like the world revolves around you and your kid", "YTA\n\nBoy, are you in for a surprise when kiddo starts school!", "YTA. If your kid needs such individualized care then daycare isn't for you.", "YTA. You need to realize that these people are taking care of many kids at once and can not work their schedules around each kid’s individual schedules. If you want your kid to follow a specific schedule, hire a nanny.", "YTA, you are the assholest of assholes", " YTA this is how every daycare works. Your kids adapt to their schedule and they will all nap together. How do you expect you kid to nap while other kids are playing and vice versa? It won’t work if they’re all in the same room. You need to apologize.", "YTA - I was a daycare teacher. I’m imaging the disruption it would cause to cater to one kid’s sleep schedule. And then the word gets out and now every parent has a sleep schedule for their kid. Utter chaos. There’s a reason the schedule is set. Get a nanny.", "YTA\n\nWe have a young child and we keep a strict schedule for naps as well. But when our child started childcare, we adjusted OUR nap schedule to be the same as the childcare. We would never have expected the childcare to adjust to our preferences.", "YTA. Daycare's do their best, but the accommodation you're looking for is not going to work. They're not able to, and it's just super unrealistic. Often, they're able to accommodate HOW you put your child to bed, but not necessarily when. I always found it easiest to move our home schedule to that of the daycare because, yes, my kids do better when they're consistently napping. But you need to be the flexible one here, not them.", "First kid, eh? \n\nYTA\n\nYou really expect a day care to nap a roomful of kids at different times??", "I’m confused - why did you expect the day care to be adhering to each child’s “nap schedule”? You do know the very basic care of these facilities right? It’s one schedule for all kids. It’s pretty common knowledge. How are you having such expectations? Hire a private nanny. YTA", "This belongs in r/entitledparents", "YTA.. find a nanny bc no daycare can constantly change schedules for individual kids. It’s jusg not possible.", "YTA. All the kids nap at the same time at daycare. For you to assume otherwise is truly ridiculous", "YTA.\n\n“I feel that my child’s well-being and development are being compromised.” You’re a nightmare. It’s not like your child is being neglected or denied a nap. If you have such a strict napping schedule, hire a nanny or au pair.\n\nETA - Apologize and bring the staff donuts.", "YTA if you want individualized care (nap, meals)   you will be better off with a nanny  at home. Daycare relies on all children following the same schedule.", "Imagine thinking that they should do that in the first place 😅 entitled much . YTA", "YTA. A daycare center can’t adhere to 15 different sleep schedules. This is how daycare works. Your kid will adjust.", "YTA \n\nAnd I say that as a former daycare worker loo you need a nanny. Those people make barely 10 an hr and you have unrealistic expectations.", "YTA. \n\nThere is not enough staff working in Childcare Facilities, due to the lack of respect and pay that we receive, to do one on one care with your child. It’s unfortunate but the ratios don’t allow for that.", "YTA \n\nAnd I say that as a former daycare worker loo you need a nanny. Those people make barely 10 an hr and you have unrealistic expectations.", "YTA. They can’t cater to every individual kid’s nap schedule. They need to be able to plan activities and the ratio for nap time is lower so that’s normally when teachers have bathroom breaks or switch shifts. If you want him to stay on a consistent schedule so badly than just find out what time is regular nap time at daycare and make it the nap time on weekends.\n\n-Also do you really think your kid is going to want to nap when all of their other friends are playing? It makes most sense for them all to nap at the same time.", "You not really an asshole you are an idiot. You need a nanny not a daycare center. I cant believe you would get on the wrong side of the people who care for your child on a daily basis.", "YTA.\n\nI'm sorry but surely you can't expect a daycare to adhere to each and every child's own individual  time. It just wouldn't work.", "YTA\n\nYou want childcare that strictly adheres to Emma's needs? Hire a nanny. That's how you get childcare tailored specifically to your child.\n\nDaycares have schedules for a reason and it's very unrealistic to expect them to follow a completely different schedule for one child. Imagine if they followed every parents schedule? Absolute chaos.\n\nI understand you are worried about her well-being and development but I guarantee you she will be just fine. She'll adjust to the daycare schedule and you can adjust her schedule outside daycare. \n\nWhen you send your child to daycare, uou have to relinquish some control and put your trust in the professionals. Developing a good relationship with the peoplethat care for your child is infinitely important.", "YTA I now need to apologize to my friend for thinking she was being dramatic when she told me a parent expected her to drop everything and ignore every other child to put a 6 month old on the toilet to potty train every hour. Clearly people really do think everything revolves around one child.", "With daycare set up with all the cribs/cots against the wall of the main room (usually) I don’t see how your child could get any sleep with the other kids up and screaming/playing. Your child will need to adhere to the schedule of the entire daycare. YTA.", "Lmaooo what an asshole. Yta😂", "YTA, from a former daycare teacher. Unless the daycare has stated that they will give each child specialized nap times it’s entirely unrealistic to expect that. You also don’t mention your child’s age. If your kid is in the under 12 mos room, ok it’s slightly more doable. But any other aged room I couldn’t even picture the logistics of making that possible.\n\nGet a nanny.", "YTA.  Are you for real?  You really expect them to give your child a separate nap schedule from all the other kids?  Unless she is an infant, that's really unreasonable.  Daycare keeps a similar schedule to schools.  A regular school isn't going to cater to your child's specific schedule, either.  It's arranged in a way that is beneficial to the group as a whole, because it's near impossible to do it otherwise without chaos breaking out.  They have to take care of the children as a group on the same schedule.  It is really insane to expect them to use a completely different schedule for your child, and it creates more work for the already overworked teachers.", "YTA", "Coming from someone who worked in a daycare for a long time, YTA 100%. Expecting one to two people who have anywhere from 7-14 toddlers to not only follow each child's individual schedule, but to also try to get the other children to accommodate their schedule is pure insanity. You're an entitled AH who obviously has no grasp on reality.", "In my head it depends on how they responded to the original request... it is a lot to ask a daycare, but if they acknowledged your specific instruction and responded with affirmative reaction, then you have every right to be concerned that they obscured or even hid the truth from you.  So, INFO.\n\nI'm five years into parenthood now, but had no experience with any of this at the start... a lot of the commenters here expect you to have known better to ask.  As the licensed professionals in the matter, they should not agree to requests that they have no intention of delivering.", "And situations like these are  why I’d like to quit my educator job.  Everything is so stressful.", "YTA. Your expectations are incredibly unreasonable. If you want an individualized schedule for your child, you need a nanny or other in home childcare. Not a daycare.", "Yta", "YTA. Daycares have to keep everyone on the same schedule, not yours", "YTA even if it wasn’t your intent, part of daycare is having to adapt to a group schedule, being able to go with the flow. It’s understandable that you want her to nap for her well-being, but to dictate when and how she naps seems like overkill. As difficult as it is, it’s the first of many compromises you will have to make for your child as she grows.", "YTA. \n\nHowever, I have a suggestion. Since they likely have her more often than you do for nap time, adjust your nap schedule to theirs. This is coming from a single parent that has had to put my child in daycare for a while.", "YTA.  Good luck finding a new daycare when they tell you they are unable to adhere to your (ridiculous) requirements.", "Either y’all are running out of creativity to write something interesting, or this is a scarier world full of entitlement than I though", "LOL. Welcome to daycare. YTA. This is completely normal and will actually be good for your daughter.", "YTA.  Your kid goes by the schools schedule.  They don’t give AF about yours.", "YTA - if you want a specific nap schedule, hire a private nanny. You cannot expect a daycare to adhere to each child’s different nap schedule. It would be nigh impossible to have some kids sleeping while others were up in the same room.", "What a load of crap. Not true at all.", "YTA. Hello my name is Entitled and I am entitled to everything. People need to follow my instructions to the letter because I am Entitled.", "TBH, if I ran that day care, I'd prorate a refund and tell you not to bring your kid back. You sound entitled and exhausting.\n\nEdit: punctuation", "YTA and if you want that much individualized care then hire a nanny and don't send her to daycare. They have a naptime for all the kids and is one way to keep down costs and maintain staffing.", "YTA. This post screams entitlement.", "YTA If you want your child to have a personalized nap schedule then hire a nanny.", "YTA - get a nanny", "YTA.  Hire a nanny who only watches one child.", "YTA - you can’t have actually expected a daycare setting to give individual nap schedules. That isn’t a thing.", "YTA - kids are smart they will figure out the home schedule and the school schedule. Expecting the daycare to comply with your schedule is insane. Want it your way find a nanny", "YTA\n\nSorry but your child is not the only child they take care of. They have to work in a way that benefits all the children's needs not just yours. It's clear you've never worked in childcare but I have. Nap time is for everyone at the same time so that no child is being disrupted during their sleep. Also during nap time is one of the few times a day where daycare workers can work on tasks like lesson plans, cleaning, and setting up for snack.\nIf you don't like that your child is not getting special attention then maybe you should pay the extra money to get a nanny.", "YTA, you should follow their nap schedule at home as well., it will make your kiddo’s life better as well as their teacher’s.", "Yes hahaha, they take care of a bunch of kids not only yours.", "I am actually the director of a nonprofit childcare center/preschool. Big question- how old is Emma? \nIn Wisconsin, if she’s under 2, what they’re doing is illegal. They have to go by the under 2 intake form", "Babes how many staff do you think there is that every one of them can adhere to each individual parents sleep schedule for each child? Surely you realise that's not doable. I know each child is the apple of their parents eye but don't act so entitled! Look, your child is getting a nap, you want it at a certain time or in a certain way? Hire a nanny or quit your job and do it yourself. YTA", "From one toddler parent to another, YTA. My LO has attended a super high-end Montessori daycare since he was 1YO and it would never occur to me to fly off the handle about a common sleep schedule. Kids need to adapt (within reason, and this is certainly the case here) to the rhythm of their caregivers and the other kids around them.", "YTA. The school has its scheduling and you should adapt. This is so tone deaf that I have a hard time imagining it's real.", "YTA. When we enrolled out son in day care, their nap time was different than we had set up until that point. Do you what we did? We adapted. \n\nNo day care will cater to one child’s nap time.", "YTA and a ridiculously controlling one at that.", "YTA.If your expectation is that the world should revolve around you and your child, hire a Nanny.", "YTA and an entitled one at that. Do you know how many kids are at daycare? You expect the entire staff to change every rule just for one kid? That's ridiculous. There is no way the staff would be able to have a different schedule for every child.", "YTA - it’s a daycare for multiple children; they aren’t going to cater to one child. If your daughter’s needs are so specific, you need to hire a full time nanny.", "YTA.  Daycare isn't going to cater to you.  It's easier for them when all kids nap at same time. This gives them time to clean up, have a breather, etc", "100% YTA. Get a nanny or stay at home.", "It's impossible to coordinate the naps for different time. How do you expect them to do this?\n\nYTA, get a nanny if you need her schedule to be so specific.", "YTA. \n\nDaycare isn't an individual babysitter and schedule for each child. They structure activity, meal, and rest times to fit a group schedule. If that's not what you want, you should consider hiring a nanny to give in-home care on your schedule.", "YTA. Are you seriously trying to say that somehow in a group setting you thought your child was going to have their own schedule? That's completely unreasonable unless you are at some fancy expensive place that staffs for that. And has the facilities.\n\nDid you think they'd keep all the kids quiet? Or that someone would just go to another room?\n\nYou are wound far too tight as a mom and if you don't learn to be flexible now your next 18 years will be a misery until your kid leaves and never comes back.", "YTA. How do you expect them to get your child to sleep and stay asleep while all of the other kids are up and running around?", "i get where you're coming from. genuinely, you just want the best for your kid, and i dont think there can be any fault found in that. but, as a daycare staff, oh. my. god. its incredibly selfish to put your kid above the others, and expect special treatment. YTA for that. we dont make any child nap, we just provide a quiet time and place. if your child has acclimated to this schedule, maybe carry this schedule over into the home?", "I don't even need to jump in here but as former daycare staff,  major YTA. Can you imagine what it would take to have all the kids napping on different schedules? Utter insanity. When your kid goes to daycare, you adjust your kid to the daycare schedule so everyone, including yourself and your child, can have peace and routine. If you want individualized care, hire a nanny.", "YTA and if you want to keep the resentment from bleeding over into their care of your child (not intentionally, but people are human), you should apologize immediately and chalk it up to first time parent daycare anxiety.", "From a former child care worker - YTA. You cannot expect a daycare to cater to each individual child’s nap schedule. How would that work? Where would they put the sleeping children? \n\nApologize, and be grateful you even have a child care slot for you kid. There are months-long waiting lists for slots in my city.", "World doesn’t revolve around you or “Emma” YTA", "In what sort of language did you “express your disappointment?”\n\nIf you want the day to revolve around your snowflake, you need a nanny rather than a daycare. \n\nYTA", "Whoa whoa whoa so you expect the daycare to cater to each individual child’s needs for napping? You’re stupid and delusional. YTA. \n\nThis isn’t about the kid it’s about some weird power trip you think you get to have. My mother ran a daycare for years and I can tell you it’s hard enough to get all the kids down at the same time now imagine trying to put a single child down while all the noise and racket is still going on.", "YTA, OP. You need a nanny or a Valium.", "Hope you feel like an AH cuz YTA. Like some has stated, if you’re that CONTROLLING over an 18 month old’s sleep schedule, hire a private nanny and write it down in a contract that she must abide by YOUR demands or get fired and apologize to you.", "You were furious, were you??  Good grief, you sound insufferable and yes YTA.  If you demand individualized care, nap schedule, etc. then daycare isn’t for you.  You definitely owe them an apology.", "YTA. You need to adjust her weekend nap schedule to the daycare nap schedule. They can’t force all the other children to adjust to your child’s schedule and unless each child has a separate bedroom, they can’t sleep individually. If you want your child to have 1:1 care, you’ll need a SAHP or a nanny.", "as someone who has worked in multiple daycares i’m pretty sure there are regulations they have to follow… only the nursery had leeway on nap times since babies take multiple naps a day. yta hire a nanny if you need her on a specific schedule. they have more then your child to deal with and having separate schedules for everyone is impossible", "Hire a nanny if you want an individualized schedule. YTA", "YTA The staff at the daycare are not your personal nannies. To expect your child to nap at a time different from the other children. Is there a reason you don’t see that?\n\nYou’re definitely going to be kicked out of this daycare. And every daycare until you realize you have to get along with others. \n\nYour level of entitlement is honestly shocking. Another person who writes a lengthy AITA who somehow doesn’t see the problem.", "YTA- as a former daycare worker, you are absolutely TA. If you want your child to have a personalized nap schedule where her needs are catered to, hire a nanny. I've worked both with infants (ages 3m-24m) and ages 3yrs to 12yrs. When I worked with infants I had *SIX* babies by myself for 8 hours a day. I had to feed babies *by myself!* Many times holding one to feed them a bottle, while having to sit next to one or two of them in a car-seat while proping their bottles.. Not my ideal situation, but shit happens. (It was a very shitty run daycare and I got out of there as soon as I could!)\n\nWith the older ones, there were 12 in a class to me. They all took a nap at the same time. Nap time was scheduled at the same time for every class throughout the entire facility. Nap time procedures were noted in the parent hand-book that was given to all parents upon enrollment in daycare.", "YTA seriously", "YTA. If you want care that is so personalized, you pay for a private in-home nanny. Daycares aren't set up to accommodate 20 different nap schedules for 20 different kids.", "Our daycare will follow the nap schedule of the child in the infant rooms only.  Once they move to toddler rooms they adjust to the classroom schedule.  It seems this may just not be the right fit for your family and a nanny would be a better fit.  YTA for how you treated the teachers and the director.", "INFO: Did you offer to pay extra for the daycare to specifically cater to your child?", "As someone who worked as Y.T teacher for a PRIVATE school- YTA.\n\nYou want you child sleeping while the lights are on, other children are running around screaming instead of when her classmates are sleeping? What extra staff and room are they supposed to supply her with? \n\nDo you think of how anything works? Or just yourself? What youre asking is literally impossible dear. \n\nIt sounds like you need a one on one care if its that important.", "YTA. Holy outlandish expectations, Batman.\n\nChildcare centers do not have different schedules for different children. ALL children in the center sleep during the designated nap time. \n\nI mean think about it: \nIf there are 20 kids in the room and 5 nap between 10&12, 5 between 11&1, and 10 between 12&2 what will group 3 be doing while group 1 is sleeping? Quietly sitting?\n\nBwahahahaha!\n\nNo, of course not. All children sleep at the same time so that ALL CHILDREN CAN SLEEP!\n\nNot only that, but it also keeps the routine (activities and meals) on track. \n\nIf your child needs a very specific nap schedule I say: Why? Short of a medical condition, they will adjust in about a week (I can attest as a mom of two). If there is a medical need, then maybe you need to research other care options such as a personal nanny.", "YTA - believe me, I am all for a consistent schedule, to the point where it probably bugs other people. But, at daycare, your child is not the only child. And yes, it makes sense for all the kids to be on a similar schedule so the teachers can clean and whatnot while the babies sleep. You can only control what happens in your home. If it matters that much to you, hire a nanny. But when you are paying a daycare, you will have to understand that they need to balance the needs of all the children in their care.", "Every time I hear the words \"child's nap schedule\" the answer is obvious: YTA", "YTA. Unless she is an infant, daycares have kids nap at the same time", "This has to be fake and yes, YTA.", "How in the world would a daycare accommodate each individual child’s nap schedule? You’re absolutely ridiculous if this is your expectation. They have one nap time, which I’m sure you were made aware of at some point. YTA for sure.", "I can't stop laughing omg!!! 😂😭\n\nYTA. If you want individualized care, get a nanny.", "INFO: you have to be leaving some things out here. For one thing, you don’t even say how old Emma is which makes a *huge* difference in what one expects from child care. \n\nSo what other things are you omitting that would make the staff feel that you’re an AH?", "YTA and you need to apologise for wasting their time - how do you think an individual nap time is even feasible for the staff?", "YTA. Chill.  \nYour child's \"well-being and development\" are not being compromised because they have to sleep at a different time slot than you have decided works at home.   \nHere is an idea: How about matching your at home weekend nap time to the day care nap time?   \n\n\nIn a daycare they simply don't have the ressources to make special schedules for each child's individual wants (or rather the parents' wants and ideas). If you want that, I suggest an in home nanny.  \n\n\nIt is much more practical and good for their social development that they eat, play outside, play inside, and sleep at the same time.", "Get a private nanny. That's the only way you'll be happy with the nap schedule. YTA", "YTA. You’re acting like your child is the only one there. If each child had a specific nap schedule it would be chaos for the daycare workers. Hire a nanny if you need her to have a specific schedule.", "YTA - day cares have to consider the needs of all the children as a group which means that they stick to their own school schedule. If you value consistency, either adjust your kids at home nap schedule to match the schools schedule or pull your kid out and hire a nanny who will stick to whatever schedule you want.", "YTA. What you want is a private  nanny not daycare. I did childcare for years and one thing I've learned is everyone does the same thing at the same time. No variations or you have a bunch of pissed off toddlers and a frustrated carer.", "What. 😂 Yes, YTA. If you want individual care hire a nanny you nightmare.", "I worked for years in daycare in an area with some pretty entitled parents, but I never had a parent demand an individual nap schedule for their kid. Unreal. YTA. If the communal nap schedule doesn’t work for your kiddo, you need to look for a nanny.", "I needed a laugh today. \n\nThere isn't a seperate room for children to go a nap in, you know? They nap in the same room together.\nI'd absolutely love to see you trying to get ONE child to nap in a room full 15 or so wide awake kids that are running round, playing, and being loud.\n\nOn to the point, get a nanny or stay home. YTA.", "YTA, set the weekend nap schedule to the daycare's so it's still consistent for your kid. They can't have all the kids sleeping at different times while others are up playing and making noise.", "YTA the teachers have to care for many other kids besides your child. It's literally impossible to keep to all their nap schedules while all so doing things like go outside, food times, circle time etc. Because they are already working around diaper/potty times. Which duapers have to be done every hour. I used to work at a daycare. It was crucial to get all kids down. So we could actually clean the toys. If you want a individualized schedule get a nanny.", "Yta. They can't possibly accommodate 30 naps\n schedules, you follow the routine the daycare does", "This is the equivalent of taking a group fitness class and complaining the exercise isn’t tailored to you vs hiring a personal trainer.  YTA.", "Yta. Do you think all these kids are going to nap at different times? Wild. Apologize.", "Right? Everyone moves together in daycare. Unless your child is in the infants room where the children stay most of the day, your expectations are inappropriate OP. You were, “furious?” That seems like a lot of emotion for the situation. YTA give your childcare workers a break.", "Yup you can't have one child napping in a room while others are playing. What on earth is OP expecting", "Exactly, i work in a creche, nap times are for a specific two hour block in the day, during that time the children need to be constantly monitored by a member of staff, every 10 minutes once the child falls asleep you log in each time the child slept, there breathing patterns and the position they’re asleep in (for medical purposes). While two more staff are in a separate room with children who don’t nap or only get a specific amount of nap time and are then woken. This is for the purpose of changing nappies/ratios. The rest of the staff will go on lunch and then the shift swaps over.\n\nI don’t know what kind of creche would ever say they would cater to a specific nap schedule, maybe one in her dreams ?", "This guy will be a real gem when he’s forced to comply with kindergarten’s basic rules/routines.  God bless that teacher.", "This is the answer. There's no way that a daycare can accommodate different schedules for each and every kid, that would be a logistical nightmare. If you want that kind of individual attention then you're going to have to pay for it by hiring a nanny. Don't treat the people who are caring for your kid like shit because you don't understand how things work. YTA.", "Worse than that. She didn't expect every other child to change, she expected each kid to be on an individual schedule.", "As someone who has an in home daycare this sounds about right. Parents are usually the worst part of my job", "Thank you for being an instructor for youth! It is a thankless job, and I just wanted you to know that what you do is appreciated", "I am both a preschool teacher and a mother to a kiddo with celiacs and I would NEVER think of asking them to provide for my son. My school provides 2 snacks and lunch, but I pack lunch for my son every day and have extra snacks in his class he can eat in the case that their snacks for the day have gluten. \n\nThis is ridiculous. \nYTA OP, your daughter will need to adjust!! Or find private care.", "These parents who are this demanding need to just give up their career and take care of their kids themselves. \n\nJust ridiculous", "at the same time and the same thing", "I had to reread the title to see if I was on r/entitledparents", "*gasp* But her precious little snowflake will require a dedicated Michelin rated chef for all her needs!", "And learn the same subject at the same time.", "And the early lunch at like 10:35am!", "That’s the first thing I thought: is this for real? Op needs to volunteer at the daycare to see what they do all day, because one of them sure ain’t catering to individual nap times, lol!", "But they spoke to the director. Directly. \n\n/s", "Wait until OP finds out her child is not getting a five star meal in school", "THIS! I'm having flashbacks to trying to get 10 one-year-olds to sleep and having to gently rock two cribs at a time for the ones who needed \"movement\" to fall asleep while others needed a teacher to rub their backs . . . and thinking of the assembly-line diaper changes, and the carefully coordinated feeding times, and trying even IMAGINE what it would look like putting them down for naps at different times, and honestly, I haven't laughed this hard in a while.", "I don't know anything about kids, and even I was sitting here wondering how on Earth you're supposed to get a kid *to sit out and nap by themselves* while the rest of their peers are off playing.", "Absolutely this. OP, You have to adjust to their schedule and make it the new routine for your daughter. It is impossible to enforce separate nap times in that kind of environment. It just doesn’t work that way. It sounds like you need a nanny.", "I don’t understand what she thinks would happen? Like put this one child down for a nap in the corner while the rest have snack? Lights off in just one corner of the room? What if a kid starts crying and it wakes her kid up? Is that also not adhering to the schedule? \n\nSounds like she needs to get used to the daycare’s nap schedule and keep it up at home so that her daughter has a consistent schedule.", "Like do you know how nap time works in a day care? Usually it's in the main room... How exactly are they supposed to let each child nap at their parents preferred time. There's this thing called a schedule that they follow. Change your 2x/week schedule to match her 5x/week one. YTA.", "If you, OP care so much about your child's sleep schedule, please either hire a personal nanny or work from home or quit your job. \n\nPlease don't make their jobs harder than it already is.", ">trying to make all the children nap at the same time\n\nHow else could daycare possibly work?\n\n\"Everybody play quietly now. Precious Emma needs her special nap now.\"\n\nYTA", "If you want personalized attention like that you need to pay for a nanny or babysitter.", "Absolutely. \n\nThe daycare can't possibly keep every kid on their own individual nap cycle,\n\nBut beyond that, OP WTA for being \"furious\", and worse for being \"furious\" at a bunch of people who are almost certainly underpaid and have little to no ability to set policy.\n\nAnd even beyond that, it's just fucking stupid to be an alienate people who are taking care of something of yours.", "Depends on the daycare, many will group the kids for a couple of different time slots.\n\nRidiculous to think that the daycare would have a personal schedule for each kid though... would like to understand more here  why did OP think this?", "this.  did op even think about how her child could even nap while others are playing ?  it absolutely makes no sense… unless she expected every other child to now adhere to her schedule, which is another level of entitlement", "Seriously! Also, if they did special individual nap time for OP’s kid, they’d end up having to do it for the whole school. It’s completely unworkable to have kids all on different nap schedules.", "Be prepared to spend at least $18/ hour for a nanny. That’s a “bargain” these days. Many charge $25/ hour. If you’re using a daycare, you have to be flexible. You get what you pay for man.", ">shell out the cash for a nanny - and pay them a proper wage\n\nBeautifully said and spot on! \n\nI would do it for 12-15$/hour and some gas money for one child and yes, I know that's not much compared to others, but way above 100$/week 😂", "I work at my kids’ preschool for the discount. My YEARLY salary there is less than my monthly wage in my regular job by 1/3. I have a child with autism so I’m limited in what hours I’m available for work. I finally found a nanny that can handle my kids and she’s only available 2 days per week. They’re in school, so I usually only have to pay her for 10 hours per week, but I’m shelling out about half of my wage before taxes for the hours she works, so be prepared to pay for your inflexibility.", "Yep but I cringe to think how OP would treat the nanny", "I think they are to entitled for that sub group lol 😂 \n\nYou know, I read this and in my head the voice of op came out very pompous and entitled lol 😂", "The teachers are supposed to keep the rest of the class quiet for special Emma’s nap time since little dear is Mommy’s special angel and the sooner the others kids learn that the better. /s", "Other daycare professional here, Just curious where you are. Our nap regulations are different", "Exactly. She wants a nanny at a daycare rate.", "Also, let’s talk about what “needs” mean. Vital\nmedicines to treat major illnesses or disease is a clear need. A nap at some time in the day is probably a need. But a nap at a super specific time is not a need. The kid will adapt. It’s disruptive for mom, but it’s not harmful to the kid. It’s not a need.", "Even worse, say the nap is 2hours, so she isn't allowed to play with the other children, who she can hear playing in the other room (or same room, depending on the set up) for 2 hours, and then when she CAN play, the other children are napping and can't play with her. OP wants to completely isolate her child from the social aspect of preschool, which is the most important part of preschool.", "I’m curious about this too- I have a baby and she doesn’t nap according to schedules but the toddlers do. Although we just told the teachers to put her down when she starts looking sleepy (eye rubbing/etc) and that seems to be working well enough.", "OP said 18 months", "This is it. Apologize or get a nanny.\n\nYTA", "I second this question, my son doesn’t have a specific nap schedule I just make sure he’s awake by 5pm so his night time routine isn’t too off. Do you want her to be worn out and go to bed as soon as you get home so you can do what you want? Right now though OP, YTA", "11 weeks old? As in, your son, who was less than 3 months old, went to daycare? Or do you mean your son of an undisclosed age, has been at a daycare for 11 weeks in total?", "I'm getting burnt out on ECE after not even a year because of the rules we have to follow because of parents like this.", "Same experience here. Depends on age.", "No reason to insult the child, OP is the AH. 😊", "Sneuflaykhe", "Child is 18 months old.", "This is important. The daycare my son goes to provides an individualised care for the children in his class (he is 14months). We fill out a day sheet every morning with his nap schedule and bottle schedule, they then also feed him breakfast, morning tea etc right through to dinner (if needed). Perhaps OP may need to find a daycare more tailored to her needs. \n\nI will just clarify I am in Australia, not sure on OP country and it may differ there.", "Op has stated the kid is 18 months. Kids in the toddler room at this point. Definitely in the unreasonable request by a parent realm.", "OP commented that her child is 18 months.", "This is the reply I was looking for. For very young children I would expect the centre to have a seperate sleeping area so babies can nap on their own schedule. For older toddlers I would expect the centre to facilitate a “quiet time” so those who still require a nap can have one. I also wonder how many days per week OP works, if the child is older and in care 3+ days I would change my home routine to match the centre routine if they value consistency.", "No daycare is going to have individual sleep schedule for children. It's completely unreasonable.", "It doesn’t matter. Daycares don’t make a profit bc the overhead is so expensive. There is a shortage of daycare teachers in this country bc they are not paid well, but without gov subsidies, that cost goes on the parents. OP should hire a nanny if she wants this specialized treatment", "And an apology.", "Even in the infant room (at least at mine), there was a scheduled nap time. But the littlest kiddos will pretty much fall asleep whenever, and of course staff doesn’t stop them.", "Yeah, this sounds like a situation where OP heard what they wanted to hear when they said they offered \"personalized\" care. Like...that needed a big ol' asterisk with \"adaptations within reason, like your kid only needing a twenty minute nap instead of a thirty minute one, will be catered to, otherwise we expect you to work to adapt to us\".", "Our daycare is crazy. So many allergies so they never all eat the same thing", "OP is reaching out to all Iron Chefs as we speak lol", "i worked at a daycare over the summer and i still have flashbacks of having ten kids demand i rub their backs *right now this very second* during nap time 😭", "I decided this has to be a joke lol. Unless this daycare has a 1:1 ratio for every room AND has a separate room for each child there is zero chance of this happening lmao.", "But then OP wouldn't have anything to complain about...", "Didn’t you know the world revolves around Emma", "I totally agree with you, but where in the world childcare is only $100/week?! Please tell me I need to move asap!", "Something tells me I wouldn't work for OP for $100/hr...", "You’re really underselling yourself here.", "Absolutely not. That is way too low lol. That is not a proper wage for a nanny. Nope.", "She'd likely be the kind of parent that went through nannies like water because no one would want to work for her.", "I'm from Singapore. Most daycares/pre-schools operated differently too over here. Depending if it is a Government supported school or a private one.", "At 18 months children in daycare nap together. YTA", "In the US many babies go into daycare before they are 3 months old, as there is no guaranteed parental leave and even when parental leave is offered voluntarily by an employer, it is typically 12 weeks (or less).", "As in he’s been going since 11 weeks. He’s almost 18 months now.", "I don’t think anyone was insulting the child. That comment would be more insulting to the mother, if anyone.", "Lololol.", "You can find daycares like that here in the US, but most cheaper options arnt like that and expecting them to is absurd, but many more expensive places offer such service.", "There's a shortage in just about every industry. What I was getting at with the question, was that she is expecting people to pretty much bend over backwards when the amount paid doesn't meet the level of request. If OP was paying 10k a month for example ( making the number up) sure I could see where what she says has merit, bur she most likely doesn't. \n\n>Daycares don’t make a profit bc the overhead is so expensive.\n\n\nThat's sad, especially considering I have a coworker who pays 1k a month on  daycare for his daughter. He makes a good amount and so does his wife, so it doesn't hurt him, but I jusr wonder about everyone else.", "That’s how my daycare’s infant room was. There was a scheduled quiet time in the morning and afternoon for them to get the fussy sleepers to try and nap. But if any baby is ever tired, they got a nap. \n\nOutside of the infant rooms, nap time is after lunch. Length of nap time is dependent on age of the classroom.", "I feel like she went in,  said that her daughter naps at say 10:37 and 1:12 and  they told her \"oh,  don't worry,  we do 2 naps a day,  we'll make sure she naps\" and OP assumed for no good reason that they'd be following her nap schedule.", "My friend that works in chilcare said they have to get a dr's note and proof of allergies and allergy plans from DR's\n\nWhy?\n\nSome parents were faking their kids allergies! It blew my mind! \n\nSomething about everything being a competition between some mom groups...even allergies.", "I might be lucky because I think I only had one kid with an allergy when I did my time and it was something that we didn’t serve a lot anyway so it was just substituted", "And offering minimum wage as compensation", "Finland caps it at 295€/month, rest is paid from taxes even in private daycares.", "Said the child was a snowflake...", "Oh, that’s interesting. Is there any type of subsidy available for parents? Daycare is expensive in Australia although we get can get Government subsidies (50-80% depending on annual household income and eligibility) which does help lower the price.", "Our daycare doesn't require that, idk if thats a good thing or bad thing lol", "My son and daughter can both have peanut butter. It’s getting wild!", "Cry in US", "Basically no. Some places you can get ssome help, but broadly speaking its a \"bootstraps\" type thing. \n\nMost low income people cantt afford child care at all and rely on family", "On my experience in healthcare with parents, a very bad thing. Almost all parents will lie about their kids health/allergies/diseases etc. the second they think it'll get the child special treatment.\n\nRequiring doctors notes is a very necessary step when dealing with parents of a child and especially below the age of 5/6.", "That would be tough on parents, that sucks.", "#[Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). \r\n\r\n###Please review our [FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq) if you're unsure what that means. *Pay particular attention to the section titled \"My comment was just a meme/colloquialism. Why was it removed?\" and what it says about \"Karen\".*\r\n\r\n#Rulebreaking comments made after this sticky will result in a ban.", "YTA and pretty entitled. Not sure how you expect your daughter to sleep with an entire daycare of kids running around anyway. Managing her sleep schedule is on you, not everyone else.", "You think they have time to worry about that nonsense?", "YTA. This is how daycare works. They can't function if every child is on a different schedule. Either adapt your schedule to match the daycare schedule or hire a private, in-home nanny.", "News flash. Ya ain’t rich enough to be this demanding. And if you are - fork over the cash for a nanny. Otherwise - get in line with all us other plebes and quit complaining. YTA.", "As a mom whose two daughters went to daycare/preschool from 11 weeks old to 5 years old…YTA. There are state regulations the daycare is required to follow. In my state it was a mandatory 2 hour nap (for the whole class) that they did after lunch. This started when both girls were 1 year old. The teachers are responsible for 10+ kids in the room. They cannot possibly do individual schedules for each of them. You know what we did? We changed OUR nap schedule at home to be consistent with the daycare’s to make THEIR lives easier.", "YTA.  Every parent wants to believe their child is special and therefore deserves special treatment,  even when they are at daycare.\n\nWhile your child may be special to you, as they should be, daycare staff have to be able to keep an eye on more than just your child, and to help with this, they have a set structure to their days to help not only entertain and educate, but to have the kids nap and recharge so that they are not having to deal with a bunch of kids who are cranky because they are tired.  This also allows staff to rest s bit and recharge as well.\n\nIf you want your child on a schedule that better suits YOUR needs, get a nanny, THEN you can dictate schedules.", "YTA, the staff doesn’t adhere to YOUR schedule. All the kids nap together on the daycare schedule. If you want individual preferences then hire a nanny. Way to make people not like your kid.", "I'm a former kindergarten teacher who had to oversee daily schedules, including nap schedules and yeah - you've gone way, way overboard.\n\nIt is extremely difficult, going on nigh on impossible, to have each and every child have a different schedule, particularly in a day care setting that may have different age groups. The reasons for this are:\n\n1. mealtimes. The entire location has to eat at the same time. That's the only way it can work. Usually the meals will be delivered from the youngest to the oldest children.\n2. Naptimes usually occur after lunch and the length of these naptimes vary by age group. Believe it or not, these are vital times for staff to prepare for afternoon activities. All the children in a class usually go down at the same time. Imagine if you have 15 kids in a class - sometimes more if there is sufficient staffing - and each one has his/her/their own naptime. It would be virtually impossible - the mats would take up space that active children need. Children would be moving around the child trying to sleep. The room would be bright and often loud.\n3. After lunch and nap, outside times usually occur. And those have to be done by age group. 2-3s should not be in same time as 4-5s. Imagine if you have school age kids coming in for their afternoon care! You can't have 2-3s out there with kids over 6. It is dangerous.\n\nWhat you are asking for is beyond difficult. If you need to have this time exactly, I would suggest you look into a nanny share with other parents because in a classroom setting with more than 5 kinds, it's not going to work. \n\nYTA in this.", "YTA, You do know that daycares caters to a bunch of kids right? Not just your own. Get a babysitter if you want a person to solely cater to your kid alone.", "YTA. How on earth could they do different individualized nap times for each child? The kids who were not napping then would be playing, making it impossible for the napping kids to sleep. If you want a special nap schedule, hire a nanny.", "YTA \n\nThe children all need to be on the same schedule in order for the daycare to operate appropriately. \nIt appears you would be better served with a personal nanny if their schedule doesn't work for you", "YTA. No daycare has the time or personnel to make sure each child has their own individual nap time. They take meals as a group, playtime as a group and naptime as a group. It was that way when my siblings and I were in daycare over 3 decades ago and it's that way now.", "YTA. Daycare nap schedules have been around for  a lot longer than you’ve had a kid. They don’t just arbitrarily put kids to sleep to mess with their health/well-being. Change your kid’s schedule to match daycare’s and you’ll all be much happier.", "Dude my best friend was having issues with her daycare because her baby got a yeast infection all over their bottom and neck because the teacher wasn't changing the baby out of their wet clothes and diapers until shortly before pickup. \n\nTHAT'S a real problem. \n\nYTA.", "YTA. If she's going full time, that *is* her nap schedule now. 5 days is more than 2 days, fyi. \n\nIf she's a baby, yeah it's easier to get them to nap at different times because they often have a separate sleeping room. Anything over like 12 months though, no chance. \n\nPlus, Emma probably wouldn't want to sleep at a different time - you think she's going to be happy about being taken away from her friends to sleep when they're all still having fun? No one has FOMO more than a toddler being told to nap.", "Hire a nanny.  Group nap time is normal. The school does not revolve around your  (* or any on else's child's) nap time.\n\nYour behavior is unrealistic and extremely entitled. You are setting a very poor example for your child. STOP. \nYou just want taylored/modified services while paying group/discounted rates.\n\nAlso....  YTA", "You had a particular idea of how Emma's schedule should look, and the daycare couldn't uphold it. In that case, it's understandable to be upset.\n\nBut I'm sure they tried to tell you at some point that they could not disrupt literally every other child in that daycare in order to cater specifically to your child. You either ignored them, or ignored the daycare's original schedule, thinking that would be acceptable because you're a concerned single parent paying them to care for your child.\n\nIf you wanted personalized, specific care on your exact schedule, what you needed was a nanny, not a daycare. It feels pretty obvious to me that you went into that meeting to scold them and force them to do what you wanted, not to work on what would be best for your child going forward.\n\nYTA for blowing things out of proportion and expecting the daycare to do exactly what you're currently mad at them for - change the care schedule of some children in order to accommodate others. Just go to a new daycare that can actually accommodate your desired schedule or get a nanny.", "YTA. Wowza. \n\nI’ve been an Early Childhood Educator for the better part of 16 years now and though I’m a preschool teacher now, I do have experience with toddlers (as well  as being a mom to 3 young children) and let me tell you… it is unfathomable to me that you think that the educators there can put all of those babies down at their “preferred” nap time. It’s impossible. They go down at the same time, all of them. Though there is an adjustment period, most children adjust fine. They oftentimes have to adjust to a 1 nap a day schedule instead of 2 like a lot of them are used to. Getting a room full of babies to sleep at the same time once a day is gods work, let alone twice a day.\n\nAdjust your expectations for this. Dare I tell you that sometimes, they don’t nap at all because of disturbances from other kids, etc? They’ll develop fine. They might just be a bit grumpy.\n\nPlease please stop giving the educators such a hard time.", "Let me ask you this: \n\nIf you were care provider for 20 children at a time, how would you manage individual nap times when it's just you and maybe a colleague? When 20 different parents give you 20 different schedules each saying it CAN NOT changed. How would you manage your time and those schedules?\n\nYTA", "YTA. Stay at home or hire a nanny if you want your child to receive attentive one-to-one care. Of course there is a sleeping schedule. I couldn’t even imagine trying to have a group of 20 kids all napping to their own specified sleeping schedule. That’s unrealistic.", "You’re beyond an asshole. You’re an entitled miserable excuse of a parent if that is how you honestly acted. Be better for yourself but more importantly you’re child who you are showing how to be an adult and how to properly approach these situations. The world does not revolve around you or your kid. Get over yourself.", "You’re not the main character, but YTA. stop expecting to be catered to. With multiple kids it’s impossible they all nap separately at daycare", "YTA. Apologize immediately and hire a nanny at this point if you can't handle that daycare will follow a schedule of their own. They need to keep the ship moving. \n\nI too am a working mom with a 20 month old in daycare. I thank those women every day I pick my little one up. My child is thriving even more than I could imagine because of them. But! There's a mom exactly like you at my daughters daycare that I hear all about from her caretakers. It's been discussed that the child may not be asked back because of the mothers behavior. I'd suggest you change the 'tude if you want your child to keep going.  Being nice and appreciative of the ones that take care of your child goes an extremely long way.", "YTA - stay home with your kid or hire a full time nanny if you want set your own sleep schedule. How in the world do you imagine the daycare functioning if every kid is napping at a different time. You are kind of lucky they haven’t kicked you yet.", "Hello, worked at a daycare.\n\nYTA. Almost every single daycare makes the kids nap together. It's easier for the staff and the kids(depending on the age) at least two hours of solid sleep. This gives the teachers a break too. Much needed breaks.\n\nIf you want your kid to nap on *your* schedule, hire a baby sitter.", "YTA, a daycare has to accomodate to all the kids in the group, which makes a) supervision with \"individual\" nap times impossible and b) its just unrealistic to create the needed environment for individual nap times. \nIf it's so important for you, grab your money and throw it at a personal nanny or remodel your life. \n+ Nap times aren't set in stone, as the whole daycare system proves.", "YTA. If you want everything done to your precise schedule, get a nanny. You cannot expect daycare workers to mess with every other kid for your special snowflake.", "YTA\n\nIf you’re sending her to daycare, she sleeps when the daycare says it’s time. It’s easier to care for the children if they all sleep at the same time. \n\nIf you want your child to sleep when you want them to, be a SAHP.", "YTA.. if you want your kid on a specific nap schedule then get a nanny. Your kid is not more important than the kids. You all pay the same thing! Quit being a narcissist and thinking your kid is more special than everyone else. They are all put on the same nap schedule and all day schedule. When my oldest daughter hit 18 months, she did not need a nap but I told her she had to lay down when the time came and respect the other kid's naptime and she continued to do that till she went to kindergarten.", "YTA daycares don't adjust nap schedules for an individual child, even I remember taking naps with everyone else when I was a toddler regardless if I was tired or not.", "YTA.  How many kids are in this room at daycare,,, 10?  15??  20???   And YOU want the daycare to coordinate 20 nap times???  They have a schedule!!!!  Drop/off, snack, activity, lunch, nap, activity, snack, activity/pickup\n\nIf each kid had a different schedule, coordinating all this would be a disaster!!!!   Why don’t YOU ask for a copy of the schedule and then put your kid in THEIR schedule", "YTA daycare’s generally put kids down for a nap at the same time. This is something you should have discussed before booking. There’s no way she’s going to sleep if everyone else is playing because she won’t want to be the only one napping and they won’t be quiet glide one kid", "Yta. Unless your child is an infant. Otherwise they informed you of the daily schedule and you enrolled.", "YTA sounds like you are looking for nanny services", "YTA. As someone who has worked in daycares and still actively works with young children, most places have a specific nap time for all children. It’s hard to keep an eye on every single child in general, so I couldn’t imagine having to monitor one child’s sleep while the others are doing other things. Not to mention a lot of daycares are understaffed, so catering to individual nap times may not even be possible as there are regulations about how many staff have to be present during nap times vs awake times. Yes children should have consistency, but they also need to learn to be flexible. And part of the consistency is having the children all on the same schedule.", "YTA.", "YTA.  Daycares take care of groups of children.  Your child is one of the group, and adheres to the same schedule as the group.  If you’re going to be fanatical about your child’s individual schedule and want it tailored to them, hire a nanny.\n\nDaycares operate on a group schedule for a reason.  Having a specific alternate schedule for one child would mean keeping all the other children quiet and away from them while napping.  It would also likely mean your child is up while others are napping, preventing the workers from getting other things done.  If you don’t like group scheduling, don’t put your child in a day care.  You can either deal with it or pay the premium for personal one-on-one childcare.", "YTA. That’s how nap times work at daycare. If you want your child to keep to your specific routine, get a nanny.", "YTA Jesus it’s a daycare, of course they’re not operating on your child’s specific schedule. If you want individual scheduling like that, hire a nanny. It’s completely crazy to think a daycare would adhere to a schedule you give them.", "YTA. If you want the carer of your precious individual to follow your schedule, then keep her home with you or hire a nanny. The world does not revolve around you or your child.", "This… this just isn’t how nap time works in a daycare environment. I get that it’s frustrating. Our daughter dropped naps early, at 2, but our state requires an hour ‘nap time’ in a daycare facility. Most days she didn’t nap but was just miserable waiting for the mandatory hour to pass. Occasionally she would doze off and then her bedtime and morning routine would go to shit but that’s life. \n\nYour options are to either adjust accordingly to your schools nap schedule so it doesn’t become a regular conflict to her sleep schedule, hire a nanny to provide care to your specific schedule and preferences or find a home care provider who isn’t managing more than one or two children and can accommodate your preferred nap times. \n\nMildly YTA, as it seems you just aren’t aware that accommodating individual nap schedules isn’t a thing that daycares do.", "I'm going to be a little sympathetic towards you OP. The daycare center is partially at fault because they should have laughed in your face when you first mentioned Emma's nap requirements.", "YTA and you do realize daycares can fire you as a client, right?", "YTA. You’re lucky they haven’t kicked your kid out yet. There’s almost certainly a waiting list of less needy folks ready to take your kid’s spot.", "I would not generally call someone TA for advocating for their child's needs, but YTA in this case, and you need a reality check.\n\nI worked in a daycare, and aside from the impossibility of having 20 kids all napping at their own scheduled time (i mean, come ON!), staff usually have other tasks during naptime - snack prep, cleaning, craft prep, whatever - or it may be their only time for a break. \n\nI'm assuming your child is in daycare for the majority of the week - why don't you adjust naptime at home to match the daycare? Voila! Consistency.", "YTA\n\nFun fact! Your spawn is not the center of the universe. You want to micromanage every second of their life? Home school them. The daycare has to take care of ALL the kids not just yours. It's not that special. It's not that unique. It and you don't deserve special treatment. Don't like it? Remove your child from daycare. I can assure you they won't be sad to see you go", "YTA. I’ve worked in daycare before while in school. Do you honestly think they’re going to have all the kids napping at different times? \n\n\nWhat do you think will happen if your kid is made to nap with all the lights on and all the other kids are up playing or doing crafts or having a snack? \n\n\nThe world does not revolve around you. You can adjust your schedule at home to suit these changes. Daycare staff are underpaid and overworked. Don’t make it worse.", "YTA, obviously. When your child naps 5/7 days at daycare, you adjust your two days to the schedule daycare follows. They have the same schedule for all the children because there’s multiple children with only one or two teachers per classroom. If you want individualized care, pay for it. Hire a nanny that will do exactly what you want, exactly when you want it, but don’t complain when it costs you 5x as much.", "It’s not realistic to expect a daycare with a few adults to give your child the same level of care you would give your child.", "YTA. Are you kidding? You really think they're going to customize every child's nap time? How would they go about doing that they don't have like separate bedrooms for kids to nap in. they probably have a playroom and a nap room but they can't have your kid in there napping from 1:00 to 3:00 and everyone else naps from 12:00 to 2:00 or something like that. So your kids going to nap when it's nap time there it's a schedule that they have set for the kids one to keep the kids from being too overtired and also for their own sanity. They need and deserve a half hour to eat a lunch at some point without worrying about 10 kids that are still awake. They need a little bit of downtime themselves. So if you want a specific schedule then get yourself a nanny and have your kid watched in your own home.", "\nNot an Asshole , but you are expecting far too much \n\nthey are a daycare , they have a duty to look after all of the children there , not just your kid . They don’t have enough staff or ways to arrange activities to allow all of the kids to have the exact same schedule to what they have at home . \n\nI’m pregnant with my first and while I can understand that as a parent you want your child to have a schedule that they can rely on without any changes , that’s not something a daycare can provide . If you want such specific instructions to be met your better off hiring a nanny or baby sitter as that will offer the time and focus from the caregiver to ensure the schedule is met .", "And OP was undoubtedly told they can't accommodate this multiple times.", "Preschool teacher for 25 years. I assure you, this only registered as mid-level outrageous parent interaction to me.", "Lmao. Nah this has to be real because this is a new one on AITA. The ones that follow it is when I’ll start questioning if it is real 😂", "Did OP ever consider changing the at-home nap schedule to match that of the daycare?", "yeah it’s the other way around you’re supposed to adapt to the daycares schedule", "Yes! That’s what I said, get a nanny if the schedule for a nap is so important for the child lol.", "I work at a childcare center. There are some families who expect us to act like Nannies and we just can’t. \n\nYTA", "It's actually impossible in Canada and I imagine in most licensed daycare centres due to ratio. Children also require a specified amount of time outside as well and OP's schedule might interfere with the adult-to-child ratio. Also, other children cannot expect to be quiet during a different time for the nap schedule, and a child can never be out of a staff member's sight except for in a stall inside a washroom.\n\nThese are not just standard, they're considered best practices. OP even though YTA on this, if you're this passionate about your daughter getting her needs met I would consider an individual caregiver or even a licensed Dayhome. They may actually have the facilities to accommodate.", "Right? I have a toddler in daycare and the thought of asking them to cater to his nap schedule is absurd. They start naps around 12pm. Guess when my kid now takes a nap when he's home?", "Yeah YTA. I can't imagine trying to force the daycare to have just one child nap while the others are awake, then have that child awake while all the others are having quiet time, which is most likely when the staff gets their lunch. You know what I did? Found out when the daycares Naptime was, and now that's when naptime is on the weekends.", "As a childcare provider this is exactly right! We have the same nap schedule every day and I am very upfront with my parents on what that schedule is. If they don't like my schedule they are welcome to take their child elsewhere. The ONLY exception is for an infant who has different nap needs. However, I work with the infant to get them on our schedule. If the infant needs two naps a day they get it, but the second nap is always the same as the rest of the daycare. \n\nOP - YTA", "Literally how tf are daycares supposed to do this?", "Also, so many kids are FOMO that even if staff do try to cater, it won't be successful.  One nap time helps eliminate FOMO related nap refusal.", "In a few years, mom is going to came back with \"AITA for being mad at the school for not having lunch when I told them to, Emma needs to eat at a specific time. Not when the rest of the school is having lunch time.\" The entitlement is strong here.", "Yep or get a nanny.", "major YTA to her, if you want such a specific schedule, that's for a nanny or au pair", "This. I may not like that they enforce naps with both my kids there (2 & 4) as they don't nap at home unless sick, and it makes for some crappy nights but the collective nap time for all kids is when most of the staff gets their break. And it's also unrealistic to expect 1 child to take naps at a certain time when you have multiple other kids who may have completely different schedules or don't nap at all.", "This. I can't believe someone would think it's reasonable to have each child on a different nap schedule. Heck, I can't imagine it's even _possible_ to do that; even with a small number of children.\n\nYTA", "Reminds me the babysitter I had to to deal with when I worked as a driver dropping off kids from a program. The babysitter wanted me to drop the other kids I was taking to their homes off first and then come back to her house because I was dropping this kid off a half hour before the ones she watched there woke up from their afternoon nap and she didn't want to cut her down time short because of my drop off time. Now had I done what she asked it would have added over 20 minutes to my afternoon route which was already pretty long(90+ minutes). I told her no I couldn't do that. She proceeded to contact my boss. he practically laughed in her face and told her no, that I wouldn't be doing that.  It is truly amazing how entitled to some of the parents I've dealt with have been. This was the first time a babysitter though acted like this with me.", "That’s nuts. I have celiac so I understand the seriousness of his disease, but expecting the daycare workers to pay for special snacks? I can’t even fathom. My daycare doesn’t provide food so I’m used to packing lunch and snacks for the day, but if my kid had an allergy, I would be packing lunch even if they did provide food, just to be on the safe side. Feeding your kid is a part of parenting, JFC. Daycare workers are already so underpaid, screw that lady.\n\nAlso she should have just bought gluten free play doh for the class. Or bought ingredients do the class could make it themselves, that would be a fun project.", "I’m a PreK teacher and I took the play doh out of our room because it just ended up on floors and shoes, lol. Now the kids can only use it with complete supervision.", "you went above and beyond with the play-doh. The parents could have provided a homemade gf version or the kid could just be taught the play doh was not safe for him and provided another fun alternative.", ">My daycare director would be like…whelp, find another daycare then, good luck!\n\n\"Here is your invoice through today. You're out. Have a nice life.\"", "This is the kind of parent who hasn't yet realized the world doesn't revolve around their child's rigid schedule.  Imagine if they had a 2nd child lol.", "Then hire a private nanny. There's no way a daycare can function like that.", "If OP cares so much about a consistent sleep schedule, why don’t they just align their home napping schedule to the daycare’s?!", "Another ECE chiming in. OP says the daughter is 18 months, so just moving into the toddler room. I'm betting they do have individual naps in the infant room, and told OP that at the start, and are trying to get Emma onto the new schedule now.", "Not necessarily, my son always had his own lunch from home. Which is the norm in my region, schools and childcare facilities rarely provide that. They usually have something to offer if you forget to send their lunch but there’s no group meal for everyone.", "If they want. Buying lunch isn't mandatory at school lol", "Everybody knows that Wednesday is escargot day.\n\nI'm furious! why is the school ignoring my child's needs??", "In our daycare , we try our best to get a child to sleep at the time indicated . If their routine is intact enough , they will . other times , child will fall asleep as and when they want , if they don’t , we can’t force that on them . They get up, play and we move on .  And if they do go to sleep , the other kids are too young to be able to be quiet through it . The amazing thing about babies and toddlers is they’ll adapt to this\nYou have one child to cater for OP. An individual staff member will have 3(basing on my countries ratios) . Consider that before you argue . And maybe hire a nanny if this is a hill you’re willing to not fall asleep on . I’d judge YTA", "In Ontario the law requires us to allow for individual sleep schedules in the infant room.  Our youngest infant was 3 weeks old.  How can you not meet their individual needs?", "“How dare you let the other children loudly play in the room next to where my Emma is resting her little head”", "Same! I also get flashbacks whenever I’m on hold and the hold music sounds exactly like the naptime music we’d put on.", "OP is the type of mother who sends her kid to daycare to “socialize with other kids” but expects them to have 1 on 1 with the teacher and special privileges all day.", "Exactly. If you want that kind of service hire a nanny who will be able to do that. It would be chaos if they tried to get kids to nap at different times while others are awake.", "My exact thoughts!", "I agree with personal nanny or quit your job, I do not agree with work from home. You absolutely cannot work from home and properly care for a child who is still of napping age. You would be neglecting your job, putting undue stress on your coworkers having to,cover for you all the time and no one wants to hear your screaming kid (happy squeals or not) on the conference calls. Do everyone a favor and PLEASE do not think you can care for a child under 10-12 while working from home.", "This, like daaayum you snowflake need more support than a normal daycare can give.", "If OP wants her daughter to have a consistent sleep schedule then she needs to change the home nap times to match what daycare does. We did that with my son. Daycare naps at noon so, okay, my child naps around noon on Saturdays and Sundays. I have a hard enough time with my toddler and know that the daycare staff are dealing with soooo much with a room full of toddlers. I’ll do whatever to make their lives easier.", "Exactly! And happy cake day!", "keyword **pay** lol", "I should show this post to my sister who runs a daycare; she needs a good laugh!\n\nBut seriously - did OP put ANY thought into exactly how this would happen logistically? The day care would need to hire dozens more people to watch the individual kids as they slept. Not to mention, my sister will do paperwork and clean up in the room while her kids are down for their nap. So having one kid NOT nap causes all sorts of disruptions.", "I'm picturing the already-overworked daycare workers trying to put a dozen kids down at specific times over the course of an hour or so and then trying to wake them up gently enough to not wake the other kids in the room.  Sweet shit, OP, recognize what you're asking for and compare it to what's possible.", "Our daycares only rule is that they won’t wake up the kids. Once I showed up earlier then normal and they said I can wake him up or he will keep sleeping. My kid is a deep sleeper so the other kids would be bouncing around him and he would still nap. He was consistently the kid that sleeps later and wakes up later.", "It's impossible to get a group of kids to nap at the same time, let alone adhere to one child's nap schedule. It sounds like this might be OP's first child. They will eventually learn.", "Also there are *state regulations* \n\nWhen I taught toddlers (2) we were required to have naps all at the same time because you aren't allowed to have the nap mats out at the same time as any toys for safety and one kid can't nap while others play. \n\nAlso, not being on a specific nap schedule is *not* going to hurt your kid developmentally.....oof", "The daycare i worked at had bedrooms for the smaller ones and some for the 2-4 crowd.\n\nThey all napped at the same time. Literally one child didn't because he was special needs. If your daughter isn't special needs then YTA op.", "I still vividly remember my daycare (3 years old, I have a good long term memory, short-term not so much lol) and all the kids just laid in one main room on mats and they turned the lights off when it was 'nap time'. \n\nI figured that's how it works at all daycares? Unless your child goes to some super fancy/specialized one, maybe?", "I had to pull my kid from daycare when he stopped napping", "When OP started about their nap time schedule and day care, I was like \"but yo, don't they all nap at the same time?\"  \n\n\nAnd I'm not even a parent and I knew this!", "Even if they tried, it would be a shit show lol like one kid is going to nap while everyone else is jumping around playing. Sure, there's always that kid that can sleep anywhere no matter what but most toddlers will not go to sleep with any sort of distraction. When I worked in a daycare, the toddlers were usually the hardest to get to nap because their little heads pop up at the slightest sound. We spent a good 15-20 minutes of nap time kneeled between sleep mats patting and rubbing backs, occasionally rocking the younger toddlers.", "Trying to coordinate naptime where every child naps at a different time sounds like a fucking nightmare.\n\nYTA, OP. The world doesn't revolve around you and your child.", "Exactly. Most daycares will hand you a schedule with the estimated times as when everything happens. Including naps.", "Same my daughter on her days off from daycare goes down for nap at the same time she does on her daycare days!", "That wouldn't have worked, unfortunately. With Celiac disease you can't even have the smallest crumb of gluten. Playdoh would have gotten on the table, on the other kids hands, and the possibility of the child getting glutened is too high. When a person is glutened they can get very very sick.", "Yeah it doesn’t work like that. Think more like peanuts. Most daycares don’t allow peanuts at all for the same reason this class can’t use play-doh.", "Yeah, nannies do enjoy living wages, too.", "And a belated cash holiday gift.", "Ours also does this. In the babies' room they basically nap whenever, but by the time they move up to the next room they're typically down to two naps (sometimes three if they move up quicker due to milestone hits). The next class up is one nap, and while we're struggling a bit coming to terms with what that will look like for our daughter (she wakes early, so she'd have a six hour wake window before nap), we also accept that that's the timing for daycare and are doing our best to mimic the timings at home as well.", "My kid's daycare offers personalized care.  It means that the kindergartners who still need naps have naps in the afternoon while the ones who do not have quiet time instead.\n\nThey also have a space by the office for private tutors, occupational or physical therapy, etc. if needed, but the parents must arrange, pay for, and schedule around the daycare's schedule.\n\nIt does not mean \"nanny level of customization on daycare budget.\"", "In the baby room which is 0-1 year the ratios are different with more staff to mind the children. At wobbler stage they will be settling into the regular schedule for children their age, with accommodations regarding getting used to that time change. Her child is 18 months and should be if not have already transitioned into sleeping less during the day (one nap) to accommodate for night sleeping at home. \n\nWhereas actual babies, not wobbler/toddler, should be getting multiple naps a day being constantly monitored, and slowly weaned like you would be doing at home in anyway as they grow", "My mom used to work in daycares and preschools, and has a story of this kid who would only fall asleep if someone had their hand on his back. My mom eventually found a stuffed toy that was roughly the correct weight and would do the Indiana Jones bag of sand swap to free herself once the kid started nodding off lol", "Or sends them to kindergarten and expects teacher to make sure they wipe well. (Yes, it has happened more than once).", "Also, naptime is usually the only break they get to eat, pee, and plan for the rest of the day.", "> I was furious and expressed my disappointment in the staff's lack of attention to my child's needs.\n\n> Now the daycare staff are expecting an apology. Did I go too far here?\n\nAnd how much of a shitshow did op throw such that the staff is expecting an apology?!? \n\nWhy not demand her toddler start at qb1 while she's at it?", "Oh I suspect she's never without something to complain about. She's always got to work so hard to get people to do it RIGHT.", "Ooooooooh burrrrn!", "Daycare centers do that to protect themselves. They will not take a sleeping child b/c the child might not actually be 'Sleeping'.  We've all heard the nightmare stories about parents bringing their child in asleep  (doped up on Bendryl?... yes.  That really happens.", "I think my friend said her child care is $5 or $8AUD a day for a home day care after the government pays subsidies of 80% or 95% (Perth, WA) \n\nDisclaimer: I could be wrong, but I'm pretty sure it was that much. I don't use childcare so I'm not across the whole debate - a lot of parents are still struggling to afford childcare Vs working and are lobbying for an increase in the subsidy so I think in different circumstances the rate is different. I have heard people say it's $200/a day. Someone will correct me or provide further information, I am sure 😅", "Good to know- thanks. Art teacher who uses a lot of play doh here, I may need this info one day.", "Yeah I’m sorry I knew the point of your question, but it’s good to know how daycares in the US are insanely expensive. 1k a month is the average-and actually cheap for a child under the age of 2. I paid $305 for 3 days a week for my daughter when she was 6 months & I don’t live in a HCOL area.", "And my axe!", "When is nap time if you’re in your late 30s?", "No, she absolutely said she naps at 10:42 and 1:18. The nerve of these people 😂", "Same. It also means that I asked for my 2.5 year old to be woken after a 1.5 hr nap (because he wasn't going to bed) and they do so. They take him to another room to play while his classmates continue to sleep. \n\nIt also means the kids who sleeps for 3 hrs, regardless of the noise level, still get snack when he wakes up (though they have him nap in the baby room because it works logistically).", "And cleannnnn!", "I didn't think about that. How big a tantrum do you have to throw, that people who spend all day around screaming toddlers want an apology for your behavior?", "If OP doesn’t wisen up the child won’t have a daycare at all. OP, YTA. Daycare/preschool/nursery school will have a single naptime built into the day’s schedule. All the kids will be asked to nap at that time, or at least lie down and be quiet and rest. \n\nChange your weekend schedule to match the daycare if you’re really that rigid about sleeping schedule.", "Having taught preschool for nearly 10 years she would have had to throw an epic tantrum for me to make it known to her that I accepted an apology", "Exactly. This wasn’t a “meeting” where they didn’t come to agreement on the best path forward. This was a full on meltdown.", "That was my thought, too. Maybe OP is a first time parent and needs to learn about realistic expectations of day care, but wow, what did she do in that meeting?!", "You're misreading. They mean that the daycare will not wake a child from their nap. The commenter showed up at daycare earlierthan the end of the day and the staff would not wake their son, saying the comment could if desired.\n\n(Sidenote, in some places they legally can't wake a child from a nap.)", "😭 I pay more than that a week for two kids!", "You're right but it depends on income.\n\nSo if you're on only a Centrelink payment or pension and the subsidy is 85% (iirc) and then as your income goes up it lessens. I believe it caps at something crazy like $350,000 combined income for families, but the subsidy at the high end of income is obviously in the low percentages.\n\nWhen I was studying, my one day of full-time daycare for 2 kids was $7 a day per child (years ago, could be a smidge higher now).", "bad thing. i work in childcare and afaik we are required by law/state to have documentation. we can't even have alternative types of milk without documentation.", "The biggest lie the devil ever pulled was convincing small children that naps are punishment.", "Also after lunch. Or whenever you can fit it in.", "I hope they kick her out and miss tighta$$ has to  take care of her own child.", "Co-signed. Did long daycare for 15 years.\nETA - you mean expected an apology, right?", "really? why? i’ve never heard of that before 😳", "I could be a person again..... cries again in USA", "Oh you want champagne daycare on a beer budget huh?", "What a drama queen (I don't care if you're a guy), your kids \"development\" is going to be fine, get over yourself. YTA here", "YTA. Daycare is generally required to have one set nap schedule; the only exception to this could be infants. It's done for a couple of reasons; staffing (naps have different ratios so staff can eat/take breaks), safety and routine. Your child is probably perfectly fine on her nap schedule at the centre and you break it on the weekends to suit YOUR needs. Also as a former RECE, you must have been absolutely awful for staff to ask for an apology cause trust me, staff deal with a lot and that is rare. Thanks for the reminder as to why I left child care after numerous years as a director.", "Also an absolutely absurd suggestion that her 18mo is being developmentally compromised by sleeping at the same time as her peers. \n\nClinical Nurse Specialist in Child and Family Health btw", "A proper wage plus PTO, sick days, overtime, healthcare, and…never mind. None of us Nannies would want to work for this lady.", ">Your child's future isn't going to be ruined because of a different nap schedule.\n\nProbably won't, but mommys evening glass of wine time will be ruined or something like that. Entitled parents smh...", "Yeah at the daycare I worked at 18 months means a child is getting ready to or has already moved on to the 2nd toddler room. So they should have already been able to transition from an infant schedule.", "My family owns a few daycares that serve young children. In my state there are laws about what time the children are supposed to nap, for how long, and the conditions under which they are to nap. Idk what OP requested, but its very possible that her demands could conflict with DCFS/State requirements.\n\nDCFS is the licensing agency and you must follow their rules in order to be compliant and therefore operational.", "Exactly. The first nursery school we had my kiddo in did like 2.5-3 hours of nap time every day, so that when I picked him up he was bouncing off the walls and awake to 11pm or midnight every night. I loved the school and the teachers, but they couldn’t make an exception, so we found a different preschool with no nap time. Now he sleeps at 8:30 or 9pm and I’m not tearing my hair out. 😊", "See now I think this should be an INFO on where OP lives and how old the child is because here where I am that is a big no no. Like the norm is to follow your child’s sleep routine until junior kindy", "This. OP, unfortunately, if you want someone to cater to your child, you need a nanny. If they go to daycare, they follow the daycare's schedule. They're not going to sit your kid in a corner while the other kids are screaming and running around and tell them to nap.", "Daycare staff deal with tons of ridiculous parents all the time. If they are asking you for an apology, it’s because you likely caused a scene over something that IMO should have been common sense. I don’t have kids and wouldn’t expect the staff to execute 30 different nap times.", "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "I’m wondering where OP is located and how old her baby is. I’m in Ontario and of all the daycares I’ve toured keeps the preferred nap schedules for the infant room (0-18 months) and has one set nap time for those 18 months +. I still think it’s a bit ridiculous to expect them to stick to a strict routine… the goal is definitely to eventually transition them all to a consistent nap time, and with the ratios in daycare they can only do so much. But just find it interesting that it sounds like many people are only familiar with a set nap time in daycare!", "And where would they even put her for an individual nap time? In a fucking closet?", "she'll turn out like her mom, and Nobody wants that.\n\nI just spit out my drink! This is absolutely correct!!", "Exactly.  Emma is still getting her nap, it's just not precisely on her parent's desired schedule.  It's utterly laughable to claim that having Emma adjust to the daycare's nap schedule will somehow negatively impact her health and development.", "The infant room is about the only one where you want everyone on different schedules, especially if they aren't to table food of any kind. The chaos of 5 infants needing a bottle at the same time is not fun lol", "My daughter is almost 5 months old. She's in the infant room. They all nap at the same time. When she started they said \"the kids tend to nap from 9 to 11, and 1 to 3. Is that alright?\" And I said \"absolutely!\" And then adjusted her weekend naps to those times.", "Did you READ OPs post? I'd be charging double just for 'rudeness tax' because I'm sure OP would treat you like the 'staff'.\n\nI'm in western Australia and a nanny is around $20/he minimum. Even my au pair was paid $15/hr on top of food and board.", "Happy cake day! 🎂", "Or put Emma on the daycare schedule at home zzz But seriously how different could the schedule really be?", "My daycare has a nap room off of the main classroom and each kid has their own crib/bed", "Right? I’m in awe that OP thought they would just take her kid to the side and have him nap while everyone is just running around. Like, this is unfathomable that any adult couldn’t understand this.", "OP needs a nanny, not a daycare.", "Not to mention, if they had various children sleeping while the rest were awake they could not properly supervise all of the children; provide enriched activities for those awake; and maintain licensing requirements. They would need to higher more staff to accomplish this, which sends your already high tuition through the roof!\n\nIf you want your child to have an individualized schedule- HIRE A NANNY!", "I was so confused reading this. Never heard of any daycare adjusting nap times to needs of individual parents. Parents have to adjust the naps on their time according to the daycare’s schedule. Thought there was no question about that, but apparently OP didn’t get the memo.", "right like does she expect them to just keep all the other kids quiet while her kid sleeps?", "This was my first thought too. Why not adjust her nap schedule so she’s not being “disrupted” anymore? At this point OP is the one causing the disruption.", "literally. most of the time daycares are understaffed and nap time is used for lunch breaks!", "Exactly, they might take it out on Emma, even if it's not her fault", "Yes!  I was thrilled when the daycare said my daughter was napping.  Give me your schedule and I will follow it at home since my current method wasn't producing naps.", "Which province allows different nap times at a licensed childcare? I am only familiar with my own province because my daughter is an ECE with I/T", "For infants this is best practice- each child is on their own sleeping and eating schedule", "That's called having a nanny and arranging playdates. If you can't afford a nanny, then do like everyone else and accept that your kid will have to nap at the same time with the other kids.", "Op is the type of parent who will wonder why everyone else thinks her child is such a nightmare as a teenager and why her child has no fundamental skills as an adult.  “Susie didn’t know that she was supposed to pay taxes. She shouldn’t be held responsible. She’s only 27.”", "As someone who worked at a daycare for a few years, ages 0-4, OP's demands are laughable, but also anxiety inducing! It is impractical, if not impossible to do what she is asking and ridiculous that she would think people can accommodate that. I would think/hope someone was upfront with her when she was giving her Nap Time Demands and told her they couldn't cater. Even if they didn't though, she is way outta line. I hope those workers get a raise for having to deal with her.", "Also, every daycare in the country is perpetually understaffed. You expect this daycare to have a staff member just for your ONE kid in a quiet room when they're just trying to meet their ratios of 10-12 kids per one adult?? Such entitlement.", "Correct!", "Were they all in one room?", "Not to mention that naptime is usually when employees take their breaks, because ratio rules are different when the kids are asleep! (Source: daycare teacher)", "But then OP would have to admit their special snowflake is just a REGULAR child.", "she probably won't, after they kid her kid out.\n\nYTA", "OP can get a nanny. Super entitled.", "I'm sure she'd have no problem finding something.", "Right. Exactly. There’s an infant room for babies who are on more than one nap but they usually line up one nap with the bigger kids regardless. I assume OP thinks her baby should be on two naps when they are old enough for one. Take the W that daycare has handed you and transition to one nap.", "I remember finding a staple on the floor and shoving it under my thumbnail.  I wonder if any of the kids actually ever slept in those 3-4 year old classes?", "That's how it worked at the ones I worked at. \n\nNot all of the kids slept. But as long as they were being quiet we didn't expect them all to.", "ugh me too, I never napped but I wasn't allowed to do anything else. I would just lie on the mat and stare at the ceiling. I HATED it and I did not succumb to sleep out of fatigue. Rest of my life, the same. If I nap during the day, I'm either sick or didn't sleep more than 5 hours.", "Oh, yes, the first child is always the one the parent will use to prove they are the perfect parent with perfect knowledge of what to do. :D \n\nLuckily (?) for me, my first was a little hellion, sensory seeking (aka screaming and yelling because it feels good), autistic and ADHD.  My brother was a bit like the OP and side eyed me with my perfect niece and nephew at his side (they really are all great kids in that family though) ...until his third was born.  Guess the genes come from our parents...", "DEFINITELY the first. Possibly the first of a first child themselves.   \n\n\nI say that as the first child who had a first child...and then a second. But this My Spawn Is Special! I Have Procreated! behavior had already annoyed me so my kid NEVER got special treatment. Might've gone overboard on that.....", "I wrote directly to one of her comments and said the money they make off her child's spot cannot cover an extra staff member.\n\nI worked preschool and daycare for 17 years. These people are not paid enough for that level of expectation.\n\n-- what if it's outdoor time?\n-- what if it's during snack?", "This just struck me with the sudden and very clear memory that, when I was a school age kid, a bunch of us girls used to ask for permission to go to the preschool and toddler rooms for nap time during the summer to help read stories and rub backs. I’m guessing we liked it because it made us feel very grown up at like 8 or 9.\n\nEdit: type-o", "Yup, we had latex gloves with rice or beans in them. We would pat the back for a few minutes, place the glove and move on to the next kid. Worked great.", "And oh are you required to plan! If not done during lunch, better get done at home when you are exhausted and probably were expected to work overtime already", "Yes. We had rooms by age and if you mixed ages, you had to meet ratio for the youngest in the room, so we didn't really have an option or space to do anything else. And in order for staff to get lunch, needed the sleeping ratio to be met so half could go eat and then swap 🙃 \n\nNone of it is ideal but there aren't good solutions either when we underpay and don't fund early childcare.", "For real. Former daycare worker here and it would take a LOT for it to escalate to the point they’re asking for an apology. And I’ve seen some parents behave horribly. Parents like OP are the reason I quit a lifelong career in daycares. If you want your daycare to cater your whims, hire a nanny.", "Honestly, if it was big enough for them to expect an apology, I wouldn’t be surprised if they don’t have room for your child next year.", "That sounds painful and made me shudder, haha. Sounds like something a toddler would do!\n\nI have another story or two.\n\nWhen I was 4, my parents moved us from our home in the US South back to Colombia (5 kids, missionary parents). I remember one day walking around my neighborhood/cul-de-sac and ended up wandering up to the security hut and walked in. I was talking to the guard (this was all in Spanish) and he told me to stay there and left for a moment. I noticed he had a cup of iced tea with a slice of lime sitting on his desk in the hut.\n\nBeing a curious 4yo and never seen a lime before, I reached in and grabbed the lime, and walked out of the hut. I started walking back to my house (no idea where my parents were, or why I was able to walk around a dangerous neighborhood) and I put the lime in my mouth. Super sour, I was wincing. Then I squeezed it and it sprayed into my eye, and I dropped the lime and ran home in tears, lol.\n\nYears later I realized how dangerous that was, because missionary kids were being kidnapped daily and I think that my curiosity of that lime may have saved my life. I think he was getting in touch with some sketchy people to let them know I was alone.\n\n---------\n\nIn that same house, one day I was in the TV room alone while my siblings were at the academy, and I was watching Fantasia (this all happened in the early 90s) on the VCR. \n\nThe movie came to the scene when all of the volcanoes and lava start exploding, and all of a sudden, the whole house shook violently.\n\nI thought it was part of the movie, and my 4yo brain was convinced, but terrified, because we didn't have a fancy sound system. I called out and looked for my parents and couldn't find them anywhere in the house, so I went out the front door and found my mom and the neighbors all standing in a group talking, they seemed concerned.\n\nIt was an earthquake. I still remember that to this day, Fantasia and earthquake volcano timing was one-in-a-million. Terrifying as a child, though.\n\n\nAnyways, that was long, but I haven't really shared any of these stories before.", "I broke the rules a little and put the one kid who couldn't sleep next to me so I could at least read to her from the work I was working on and hand her paper or something harmless and quiet to hold. As a kid who didn't nap, I imagined it was torture for her.", "My first has been a godsend for 13 yrs… my toddler and elementary school boys are testing every nerve I never knew I had.", "Before 3pm or it becomes a danger nap.", "True. They have two scheduled naps in the baby room, and toddlers who still need a morning nap are shuffled over to the baby room for that as well, but.... It's either on schedule or skipped.  There's no \"special schedule for just one kid for the parents' preference absent of medical need.\"", "And clean! In a covid world in a bad RSV reason!", "Same here. I worked for a church preschool. When we lost enrollment and staff we had nap time in the social hall separated by ages. It was the only way to cover our lunches.", "I remember my day care 42 years ago and we all laid down at the same time. Sometimes I slept and sometimes not. At home I very rarely actually slept. She definitely needs to adjust her home schedule to fit the daycare schedule!", "The kids are always better than the parents", "Solid point", "I have no award to give you, but here, have this: 🏆", "I promise, I would always rather deal with a tantrum from an 18mo than an adult. At least the 18mo tantrum is developmentally normal.", "I concur having taught preschool for a numbet of years, she must have really caused a full scene of epic proportions. I never had an incident in which I felt I needed a full blown apology.", "Sorry, I wasn't disagreeing. My daycare does the best to meet individual needs, yet it's still group based.", "Kids usually have a reason behind the screaming. It could be out of joy and they're running around and playing. Or anger over another kid taking the toy they want. Or it could be something we cant quite understand, like the lady bug landed on the wrong rock (true story). But there's a legit reason.", "Former RECE. Can confirm.", "True. In a 18 month old, a screaming fit because of a missed nap is unfortunate, but understandable. In their mother, not so much.", "We figured out the daycare nap schedule and months before beginning we implemented that at home so our son would transition well. Same for preschool. We REALLY care about sleep too, so we acted proactively and worked as a team with the school.", "Exactly. Our breaks sometimes aren’t even really breaks if the kids aren’t asleep. You want us to do that all day? No thanks.", "Wondering the child’s age was also the first question I had. If the child was 3 months, I’d be very concerned for OP. But at 18 months (my youngest is 16 months btw!!), being down to one nap in the toddler room is very typical and expected. If OP wants a more personalized approach, private nanny is the way to go.", "Super random, but you can make homemade play-doh out of cornstarch and hair conditioner.", "While I agree that all the children will have to sleep at the same time, it's the day care center's fault for not recognizing OP as THE MOST IMPORTANT PERSON IN THE WORLD (tm)!!!\n\nThey should make the entire center's nap time be whenever THE MOST IMPORTANT PERSON IN THE WORLD (tm) wants it to be.\n\nThey are very lucky to have the child of THE MOST IMPORTANT PERSON IN THE WORLD (tm) and should do anything they can to meet her requirements. /s\n\nIf you want privatized child care, hire a nanny. YTA. Also, try posting in r/ImTheMainCharacter.", "Because it affects HER schedule. I did daycare in my home for a few years, giving little ones 2 naps a day. One mom wanted only one nap because she wanted her child (the one she hasn’t seen all day, mind you) to nap when she got her home.", "Hold it. The policy at our daycare was they put them down at one. If they wake up, they can play quietly, but they don't wake anyone up. My son was taking three hour naps and then was wide awake until 2 am.   Napping kids and \"play quietly\" kids are much easier for staff to deal with.  Much less work.", "Theoretically you couldn't even do that because you can't leave the kids alone, so you need to have a teacher in the room with her (or closet) and then suddenly the rest of the room is out of ratio.", "OP wants the individual care of a nanny at daycare prices.\n\nYTA", "Yeah, the specific schedule doesn’t have anything to do with the kid’s development, that’s total bs, it has everything to do with the OP’s wants for a specific routine to cater to themself. Saying it’s anything else is disingenuous.\n\nOP - You want your specific special way, open up that wallet really wide and hire a nanny.😆", "That's bonkers. I have 2 kids and thankfully no allergies. It's hard enough with how picky they are to eat things. I can't imagine even trying to impose fake allergies on top of that. \n\nAnd picky like... one day they'll hate lasagna. The next it's the only thing they eat. If i were to pretend a dairy allergy, that takes away the lasagna on the wanting days. That's just... I can't. What the actual fuck", "$335 a month in USD. WOAH. \n\nI'm already looking forward to next year when the Pre-K kiddo goes to Kinder and does before and after care for $400 a month. Currently paying $1300 a month. 😭😭", "Jesus! Now I’m crying in the US!!! I paid more than that 20 years ago when I left the daycare I worked at with my MIL and went back to work! (She was full at the time without me there and couldn’t take my daughter until a spot opened up! Which wasn’t long thankfully!) then I paid $150 a week- at a discount of 50%!!! Now I’m crying harder in the US just remembering it!!! lol", "Then that staff member has to keep an eye on Emma. While the other kids are having their nap time and Emma is wide awake. \n\nYTA", "Sounds like OP is disrupting the nap schedule.\nIf this kid is ~5x a week in daycare would it be easier to use their schedule at home.", "YTA\n\nOMG, you are looking for a personal nanny, not a daycare.", "My Mom would call for naptime when I was home with her. I never wanted to nap! She was the one who both wanted and needed a nap, so I was to stay in my bedroom quietly and I could nap or read/play (I was a super early reader).", "Right! That's what I thought. I remember not sleeping during my nap time because we didn't do that at home, and I was just like, okay. Time to lay down in the dark I guess haha.", "Totally correct. I’m guessing there are 5 or more kids on a wait list for OP’s child’s spot just waiting to get in.", "Yeah my son never napped in preschool. Like not even once according to his teacher. But he had to lay there quietly like all the other kids and have quiet time. \n\nI can’t even imagine demanding this of a daycare. Surely they must have laughed this woman out of the building", "How dare you scarf down a necessary meal instead of adhering to Timmy's nap at 11 while the others play, then Melanie's nap 1145, Hendrixxxxxxx's nap at 1215, and Barleigh and Kendraleigh Lee's napleigh nap at 1, etc, etc?", "When you're little, your emotions are huge. Gotta grow into your emotions.", "It could be out of fury that they are forced to take a nap while all their friends are playing outdoors or enjoying a story, but \"sorry sweetie, your mother wants you on a different schedule.\"", "And sadly some (like OP) never do."]}