{"id": 8061, "submission_id": "10j9xa2", "title": "AITA for telling my Mom she wont be allowed to attend my graduation and my mayor life events in the future", "selftext": "AITA for telling my mom she won’t be invited to my graduation ceremony and every other big life event in the future?\n\nI (F/23) will be graduating university this year and my whole family is just really excited about it (and they have always been a huge support for me, especially my mom). Therefore I really want most of them to be there. \n\nThe issue is mainly with my stepdad. \nMy parents divorced when I was about five years old and my mom remarried two years later (my dad‘s childhood best friend). So my parents were not always on best terms.\n\nMy childhood was kinda bad due to their whole dispute and my stepdad and I always had a strained relationship. The older I got the worse it got. It really took a toll on my mental health and whenever my therapist suggested something to improve my mental health he straight up refused to do it or to even change his ways in the slightest. My mom fought a lot with him due to that for some time but she gave up trying and stayed with him (sometimes just for the sake of my younger half-brother, whom I dearly love and cherish). \nBut having my mom disregard my health for my brother’s was still hard to deal with in my early teenage years.\n\nA few examples: \n\n- stepdad told me (when I was about 10/11) that no one would care about my day and that I should simply stop talking about it cause it was simply annoying to him. \n\n- when I was on the verge of mentally breaking completely my therapist suggested a pet as an emotional support. My stepdad hates pets so he just refused even though he was told that I would only get worse without a living being to emotionally support me\n\n- when I misbehaved as a child he didn’t communicate with me but showed me index cards with his rules. When I still didn’t follow through with them I was not allowed to eat and had to sit on the stairs without talking or anything \nmy younger brother (his son) never had or has to follow through with any rules and misbehaves a lot (no consequences tho)\n\n- overall he didn’t and still does not communicate with me. He did not talk to me for the 12 years I lived with them. He did not treat me like a family member or even a family friend \n\nThere were a few smaller things, too, but he’s overall not the nicest person.\n\nDue to my mom always demanding for him to come to all my mayor life events my dad missed out on a lot of them (even though I want him to be there every step of the way). \nShe straight up refuses to go without him because my dad is allowed to bring his wife and she doesn’t want to show up alone. I kinda get where she is coming from but I don’t want to deal with my unresolved feelings and issues on my special occasions. Therefore I told her that if she doesn’t want to attend without him she can simply stay away and if she shows up with him she will be uninvited from every single future event.\n\nA few of my family members (mainly my mom’s/stepdad’s side) told me that I am overreacting and being a brat and I should just let him come. This makes me feel insecure about my decision. So AITA?", "created_utc": 1674471897, "permalink": "/r/AmItheAsshole/comments/10j9xa2/aita_for_telling_my_mom_she_wont_be_allowed_to/", "score": 116, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) told my mom she will be excluded from my mayor life events (2) my family told me I’m overreacting and being a brat and asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "What you outlined is really screwed up behavior. You totally get to decide you want nothing to do with him. \n\nBut if it was me, I would say to my mom: here’s an index card if all the fucked up ways he treated me that had a negative impact on my mental health. I no longer want him in my life. I love you- but I won’t have a relationship with him. If you choose not to keep in contact with me because I do not consider him my family- I will be heartbroken, and I will miss you- but it will also be your choice.\n\nYou are just launching into adulthood. You get to create a chosen family now. It never really replaces the old one- but it helps. You will get through this. I am so sorry you have to.", "NTA. Emotional abuse is still abuse. End of. The fact your mother enables it is disgusting. Don't invite them, invite your dad who you say has missed nearly everything else. It's his turn.", "I'm sorry your mum hasn't stepped up to look out for you properly since she married your stepdad. NTA, she can't try to exclude your dad from everything.", "NTA.\n\nYour mom enabled your stepdad to mentally abuse you. It is unforgivable.\n\nI get that you love her and hold her in high regard, but for her to allow your stepdad's behavior is just so horrible and makes her complicit.\n\nYou are completely in the right to decide to exclude her. I hope it's the wake up call she needs to dump him.\n\nI hope things work out for you, and congratulations on your degree!\n\nBest regards Uffe", "NTA.  It is time to prioritize your mental health.  To date, there have been no consequences for your mom to consistently put her husband over you.  Don’t let her come to the graduation, have your dad and his wife attend.", "NTA. It is your event, therefore you get to choose who is there. You want people who supported you and that isn’t your stepfather. If your mom chooses not to come without him, that is on her. She can bring your brother so she isn’t alone. I don’t understand why your stepfather would even want to come. Do you think he was mean to you in order to hurt your father? Was he jealous of your father? So many questions about that dynamic and the possibilities that could have shaped how he treated you.", "NTA\n\nHonestly, it's past time both of your parents put on their big girl panties & showed up to your events. At this point the only one I respect is your stepmother.  \n\nYou're not bad, selfish, a brat for not wanting someone who doesn't like you to attend your life events.  Stepfather can just stay home and watch his navel lint.  I hope graduation is wonderful.  I hope your future is great, that you get a pet, that you open your wings & become the beautiful butterfly you were created to be.  Baby shake that cocoon of your stepfather off like dirt off a flower & FLY!", "NTA - You get to decide who you want to include in your major life events. You set a boundary that you don't want your abuser to be present, if your mom and other family can't see that then it's for the best that they aren't in your life.", "NTA your events are your highlights of your hard work and you should be allowed to only invite those who you care about. You care about your mother, but her priority is more to \"not show up alone\" and rather take her new partner who has again and again proven to be a terrible influence on your life, rather than support her child.\n\nShe's not acting like a parent, more like a moody teen who doesn't want to be seen single at the dance.\n\nEnjoy your graduation OP", "NTA. She failed horribly as a parent, allowing you to be treated like this. You are fully allowed to set your boundaries. And if he doesn't make any effort (tbh he sounds horrible) then you don't have to put up with him. And your mom should grow a spine and choose you for once.", "I’m so sorry for your childhood, your mother chose him over you, it is not your fault at all. NTA", "NTA\n\nThese people straight up abused you and you're standing your ground. Your mother is lucky that you even speak to her. I would've begged a judge to give me to my Dad and go no contact with her.", "NTA...it's your life. Surround yourself with those who add something positive. Feel no guilt or regret.", "NTA, they aren't entitled to your life events, you get to quite literally pick and choose who you invite to things, and choosing to not invite your mom because she brings along your emotionally abusive step dad is not exactly an unrealistic boundary. Hold your ground, your mom made her choice when she decided to stop sticking up for you, so now she can reap the reward.", "NTA\n\nYour step dad doesn’t appear to care about who you are, what you’re interested in or including you in his life. It really hit home for me when you said, when you were a child, that he told you to stop talking about your day because he found it annoying.\n\nYou’re an adult now. You no longer have to pander to stepdads BS. If your mom won’t attend your events without stepdad, then she’s choosing not to attend.", "NTA, I’m a Mom with a daughter your age whose also graduating this year. First of all, I’m so sorry your Mom made the wrong choice (so many different times by the sound of it) she hasn’t earned the privilege of being there. Of course she pressures you because she doesn’t want to admit what a terrible parent she was to you. She choose your step dad, and left you vulnerable and hurt.\n\nHave a wonderful day and I hope you feel properly supported by the rest of your family!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAITA for telling my mom she won’t be invited to my graduation ceremony and every other big life event in the future?\n\nI (F/23) will be graduating university this year and my whole family is just really excited about it (and they have always been a huge support for me, especially my mom). Therefore I really want most of them to be there. \n\nThe issue is mainly with my stepdad. \nMy parents divorced when I was about five years old and my mom remarried two years later (my dad‘s childhood best friend). So my parents were not always on best terms.\n\nMy childhood was kinda bad due to their whole dispute and my stepdad and I always had a strained relationship. The older I got the worse it got. It really took a toll on my mental health and whenever my therapist suggested something to improve my mental health he straight up refused to do it or to even change his ways in the slightest. My mom fought a lot with him due to that for some time but she gave up trying and stayed with him (sometimes just for the sake of my younger half-brother, whom I dearly love and cherish). \nBut having my mom disregard my health for my brother’s was still hard to deal with in my early teenage years.\n\nA few examples: \n\n- stepdad told me (when I was about 10/11) that no one would care about my day and that I should simply stop talking about it cause it was simply annoying to him. \n\n- when I was on the verge of mentally breaking completely my therapist suggested a pet as an emotional support. My stepdad hates pets so he just refused even though he was told that I would only get worse without a living being to emotionally support me\n\n- when I misbehaved as a child he didn’t communicate with me but showed me index cards with his rules. When I still didn’t follow through with them I was not allowed to eat and had to sit on the stairs without talking or anything \nmy younger brother (his son) never had or has to follow through with any rules and misbehaves a lot (no consequences tho)\n\n- overall he didn’t and still does not communicate with me. He did not talk to me for the 12 years I lived with them. He did not treat me like a family member or even a family friend \n\nThere were a few smaller things, too, but he’s overall not the nicest person.\n\nDue to my mom always demanding for him to come to all my mayor life events my dad missed out on a lot of them (even though I want him to be there every step of the way). \nShe straight up refuses to go without him because my dad is allowed to bring his wife and she doesn’t want to show up alone. I kinda get where she is coming from but I don’t want to deal with my unresolved feelings and issues on my special occasions. Therefore I told her that if she doesn’t want to attend without him she can simply stay away and if she shows up with him she will be uninvited from every single future event.\n\nA few of my family members (mainly my mom’s/stepdad’s side) told me that I am overreacting and being a brat and I should just let him come. This makes me feel insecure about my decision. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Your reason is valid. I'm sorry you've been through all of it during your early life.", "NTA, In the end you're giving her a final warning and if she really wants to attend your graduation, then she'll show up without him. If she doesn't then you'll know where her priorities lie. She allowed her husband to mentally abuse you for years, so you giving her this chance after all this time is really generous of you! And if she won't show up start prioritizing your father's side of the family! You're not alone.", "NTA.  She should count herself lucky you want a relationship with her at all at this point - the behaviours you're describing from your stepfather growing up are abusive.", "NTA.\n\nYour mother is literally choosing \\*dick\\* over her child.\n\nSo she doesn't deserve any compassionate consideration from you.", "Nta", "Nta. This is digusting.", "NTA.. your mother allowed for his emotional abuse. You want your dad there and he deserves to be there more than your stepdad. You gave your mom a choice. If she doesn’t come, it’s bc she made that choice.", "NTA\n\nYou need to place way more responsibility on your mom. She enabled all this abuse at the cost of your childhood and your well-being. Her husband is an awful and disgusting person, but it was her job to protect you.\n\nI'm surprised you'd even consider letting her go at all. \n\nDon't feel bad because she won't attend without your abuser. At some point in life, you have to choose your own well-being.", "NTA Your day, your rules. Your mom is old enough to attend alone. She sounds manipulative. Perhaps you can that you are inviting 3 persons on either side: your dad and his wife and your mom and your half-brother. No substitute allowed.", "NTA. Your mom and stepdad are. Purge them both from your life.", "NTA, It is your day and your step dad sounds like a prick, if you don't want him there then that is up to you, your mum can take it or leave it.", "NTA. And shame on your mother for not defending you. There is no excuse to allow that abuse.\n\nShe has earned her place on the sidelines of your life.", "NTA. Protecting yourself from abusive people is not overreacting. Abusers just say that to make you doubt yourself.", "NTA. He abused you in so many ways. Your mother knows this and chooses to keep forcing him in your life. I woukd straight up uninvite her right now.", " NTA just because your family have normalized his abuse doesn't mean you have to accept it", "NTA, good on you!", "NTA.", "Did your step mum mistreat you the c way he did? No? There's the reason she's allowed to come while he isn't. NTA. Your mum is banning herself.\nCongratulations on graduating.", "Both your stepdad and your mom are the AH's. She should have never allowed his behaviour to go on.", "NTA - you aren't banning your mom, she is welcome any time.  You are banning her husband and by the sounds of it he will be grateful since \"hearing about your accomplishments is annoying\". \n\nStick to your guns.  It may take a few events but I bet your mom will come around eventually.  If not though, you are definitely better off without him there.", "NTA, your mom has repeatedly chosen your abuser over you. She's a bad mother. Tell her you hope his dick was worth it.", "NTA - tell her he’s invited, so long as he sits on the stairs outside of graduation- and he doesn’t get to eat with y’all, say you’re just punishing him for bad behavior like he did to you.", "NTA.   \nTell her something like this: \"*Look, I get that you love him, and that's your prerogative, but you cannot be included if he is there. It's that simple. Wedding, kids, promotions, and so on. Nothing of that. If he's there, I'm out. And yes, I'm asking you to choose between him and me. It's up to you!*\"", "NTA you set your boundary.: your stepfather isn’t welcome. She is free to attend by herself or not attend at all. Her choice", "Oh God, please don't get involved.\n\nWhat you are talking about is an average growing up for most people! You're lucky you have therapist - I couldn't even afford one!\n\nBe grateful your Mum and Dad actually want to be at YOUR graduation.  Don't punish your mother now that you're 23. Just keep family near and if they're toxic - keep them far. But as a daughter - don't punish your mother. You'll regret it and you'll open a pandora's box.\n\nPlease remember you can't see all the people giving comments. And most of them never had a graduation day.", "\"whenever my therapist suggested something to improve my mental health he straight up refused to do it or to even change his ways in the slightest.\"\n\nINFO - Did your therapist really suggest that you make someone else change their ways? Did your therapist really cast your mental heath as being dependent on the actions of others? Were you in a group therapy setting?", "This isn’t even just emotional abuse.  This turned physical.  NTA.  She picked her side.", "OP should give him an index card explaining why he can't come", "Are you seriously telling her to to be grateful that her mother let her step father emotional abuse her? \n\nAbsolutely not. Mom can come, just without the step dad. It’s a simple request.", "What a disgusting take on everything. You remind me of people saying: \"my parents beat me, and I turned out fine. Why can't I beat my kid then?\"\nYou literally didn't turn out \"fine\", since now you think it's ok to beat children.\n\nFor you it's the same. \"I had it worse, and I turned out fine\".\nNo you didn't! You're so emotionally stunted, that you see nothing wrong with stepdad's abuse.\n\nGet help. I wish it for you.\n\nBest regards Uffe", "Are you fucking kidding me? She should be grateful her step-dad denied her food as punishment and that her mother allowed her to be emotionally, mentally, and physically abused?\n\nHard no.  Her mother deserves to be punished or shunned for allowing OP to be repeatedly abused.  \n\nFrankly her mother abused her as well by choosing op's abuser over and over and the fact that you are on here telling op to just accept it sickens me", "Just shut it. Be grateful for abuse...that's what you are saying. She doesn't deserve to be on graduation day if she shows up with OP'S abuser. \nThis is not suffering Olympics just cause you got worse you can throw that at OP.", ">Did your therapist really cast your mental heath as being dependent on the actions of others? \n\nI think denying a child fucking food as a punishment would qualify.", ">Are you seriously telling her to to be grateful that her mother let her step father emotional abuse her?\n\nI'm sorry but my comment is very clear. Please read it again. Slowly. I am saying OP should be grateful that Mum and Dad and the whole world and his wife want to be at OP's graduation.", "You don't understand the clinical term for 'abuse' of a child. You use the term too lightly. You're not a psychologist.\n\nYou condone embarrassing OP's mother because you don't know OP or her mother. And that's because you don't *care* for either of them. \n\nOP is stronger than you think. She's doing ok. For example - you got a college degree? Exactly.", "You talk of abuse - but your *tone* is abusive. \n\nYou do not know OP. You do not know her mother. So you are not qualified to make judgements about what OP's mother *deserves*. \n\nStep back a little. You are supporting OP's mother to be humiliated - with all the family knowing. I am proposing OP dos not beak down her relationship with her own mother. You're the bad guy. You're not thinking about OP's long-term welfare. \n\nYou just need people to be bad with each other to feel better about your own problems and inadequacies.", "And mom and dad can both be there.. step dad doesn’t need to be there. \n\nShe isn’t punishing her mom. She is only asking that the step dad that has treated her horribly, to stay away. He does not need to be there.. if mom can’t be there without step dad, then that is her choice. But OP should not have to let her step dad anywhere near her special day to appease her mother who allowed OP’s step dad to treat her like trash.", "You are absolutely hilarious to be telling people on the internet, particularly victims of abuse themselves, that they don't know what abuse is.  Op has every right to cut her mother out of her life.\n\nYou are literally telling OP she should be grateful to a person who allowed her to be abused when that person should have been protecting her.\n\nHer mother won't come to op's graduation without Op's abuser and OP doesn't want her abuser there.  So op has every right to tell her mom she can't come to her graduation. \n\nYou sit here and you tell op to be grateful.  You tell op and other abuse victims they don't know what abuse is.  You are wrong.", " You saw OP's post, you saw the horrible things their stepdad has done. Their mother did nothing, actually worse then nothing. They prevented OP from having their dad at special events because the mom hates his wife. Relationships are a two way street. Since the mom has failed to give OP the love and support they needed and stayed with an abuser, they shouldn't expect OP to maintain a relationship with them. Plus OP should finally be allowed to have their dad at their event. What the mom did was basically parental alienation.", "Op’s mom allowed op to be abused.  She could have stopped it and didn’t.  As a mom, that makes me really, really judgmental towards her in a really negative way.  Op should not be forced to have stepdad there, even if that means mom won’t come.  When you allow your children to be abused, don’t be surprised when they don’t want you around.", "OP’s mom allowed her husband to treat OP terribly. Moms are suppose to protect their children and she didn’t. So if she can’t come to graduation solo, she doesn’t need to be there at all.", "Are you okay?\n\nBeing a doormat is not OP's long-term welfare.\n\nThe mother chose her husband not her daughter which is clear by OP's own words. \n\nShe is not being humiliated, she is facing the consequences of her own actions.", ">She is only asking that the step dad that has treated her horribly to stay away.\n\nI'm sorry that is not what OP is saying. Please read the post title again. Just the title. Slowly.", "And it’s because her mom insists that the step dad come to events with her!! \n\nAre you seriously not understanding the issue here?! \nMom made the choice to marry an AH.. those choices have consequences\n\nI’m starting to wonder if you read anything anything after the title."]}