{"id": 8089, "submission_id": "10jhfjr", "title": "AITA for not helping my ex even though we share a child?", "selftext": "Back in July I(F27) broke up with my fiancé(M32) of 8 years. He was extremely disrespectful to me and my parenting and childish to boot. He blamed his ADD and anxiety for his inability to clean, and his inability to keep a steady job. I paid all of the bills whether they were in my name or his. \n\nWe have a 5 year old daughter. I think he babies her, he never wanted to let her do things for herself and overall was raising her to be very entitled. I was working full time, usually 50 hour weeks, and he was staying home with her because ‘his entire paycheck would just go to daycare’ (his words). She started school last year with preschool and he finally started working again. However I was still paying all of the bills, including 960 for rent every month. We eventually co-signed on a car but he insisted on putting the title in his name and leaving me off insurance because I’d had some accidents in the past. I agreed at the time to avoid a fight, but it wasn’t long til I was responsible for that bill as well. \n\nDue to a series of events while he was living with me after we broke up, my daughter and I now have a restraining order against him. \nI have gone out of my way to make sure he has all the login information he needs for the bills in his name, but apparently that wasn’t enough as he’s been calling my mom complaining about me not helping him. He ‘accidentally’ paid his car insurance out of my account this month and is apparently unable to login to the car payment account. He called her on Sunday repeatedly complaining about being unable to login, I never received a verification email so I’m not sure that he even tried, and my mom called me screaming that I need to ‘put my big girl panties on and figure this out because you chose to have a child with him’.  There was probably more but at that point I hung up on her. \n\nAfter everything that happened, I don’t believe I’m obligated to do more than the minimum (or even the minimum for that matter but I’m too nice) when it comes to him. At no point did I ask my mom to communicate with him, she made that decision herself. Now she’s made he’s stressing her out over this. So am I the asshole for not helping him?\n\nEdit; everyone has mentioned getting my accounts off his bills, I closed the account in question the same day he paid his bill out of it. Every other account I have has been changed or opened after the RO was put in place. I’m well aware that probably wasn’t an accident, he’s always been very manipulative and tried to hide it under stupidity and forgetfulness.", "created_utc": 1674493438, "permalink": "/r/AmItheAsshole/comments/10jhfjr/aita_for_not_helping_my_ex_even_though_we_share_a/", "score": 405, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I won’t help my ex with paying his bills and my mom thinks I should.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\n>He ‘accidentally’ paid his car insurance out of my account this month\n\nWHY does he have access to your money? Change all of your passwords. And if he has the title of the car in only his name, how are you responsible for the note?", "NTA- And I would take this back to court, he should NOT have access to your money", "Stop paying for ANYTHING for this guy immediately. Right now. Change all of the credentials and stop payment on literally everything. Put that money towards a lawyer and try to get as much custody as you can. This is pure financial abuse. You owe him nothing.\n\nGo NC with your mom. She is also abusing you.\n\nNTA", "(1) Remove your payment information from his insurance plan. If you already did that and he “accidentally” added it back, report the fraud to the police and then submit the police report to your bank to dispute the transaction.\n\n(2) Use the same lawyer you did for the restraining order to get the car loan issue resolved. He needs to refinance in his name only. Also ask the lawyer about having the restraining order expanded to not harass your family. \n\nNTA. Your ex’s financial problems are not yours. Your mom implying that it’s immature of you to let an able bodied adult handle his own finances after he committed crimes against you and your daughter is emotional abuse. I’d invite her to get back in touch when the safety of her daughter is higher on her priority list and to block her in any channel she poisons with your ex’s proxy harassment.", "NTA. Show your mom how to block his number and tell him that part of being an adult is figuring out how to pay your own damn bills.", "NTA...Break all financial ties with this person and do the best you can for you and your daughter. He's an adult, so let him figure his own life out. You're no longer responsible.", "NTA and I would go to court to get a custody and child support arrangement. You can file yourself and at least get something on paper. \n\nNext, take your name off everything. Transfer accounts to him. Remove his access to important things like utilities. Don’t let him have the ability to mess up your credit rating or accounts because that lasts for a long time.", "NTA.  You have a restraining order against him for a reason.  Get your finances separated from his as quickly as possible.  Call your bank and explain your abusive ex is accessing your accounts so you need to close those and create new ones, they should do this for free especially given the restraining order.  I would speak directly to the loan holder for the car and ask for options given your extenuating circumstances.  It may be worth the credit hit to allow the car to be repossessed rather than pay it or deal with his shit.  There are specific resources for DV survivors to help with financial management and please research what is available in your area  If your Mom csall again tell her you are \"putting your big girl panties on\" by taking care of you and your daughters financial, emotional, and physical health above all else.", "NTA- the only joint responsibility you have now it for the well being of your child. His finances are nothing to do with you now.", "NTA - I would do everything legal I could to separate things from him. Like figure out the car thing through court. He’s able to adult. He’s 32.\n\nThe fact that a. 24yr old was dating on a 19yr old says some things too. He just seems like a shitty person all around.", "NTA, and lock down all of your accounts (change passwords, etc.) to make sure he can't get it. If he has enough personal information on you to open a credit card or take a loan, freeze your credit.\n\nYou have a big liability for co-signing on the loan, hopefully that's the only financial tie.\n\nAs to whether you should \"help\" him? Well, you already know the answer to that - no. It's a waste to try and help someone who will not help himself.\n\nYour mom is out of line, you could use support, not screaming/nagging.", "NTA. I'd cancel all my old accounts and start new ones. You know dang well he didn't accidentally pay his insurance with your info. You made the mistake of co-signing on a car with him and he's using your mom to badger you about a bill he has no intention of paying. Unfortunately, you may take a financial hit and knock to your credit score on this one. I'd tell your mom to block him. If she doesn't, you block her.", "NTA. You’re not in a relationship why would you still have any obligation to pay for anything?! He needs to sort his shit out and learn to live like an adult.", "NTA - You're already doing too much. Cut him off of everything.", "NTA & do not initiate contact as that can sometimes void the restraining order. He needs to put his big boy panties on & figure out how to pay his bills; if he pays out of your account again then dispute the charges through your bank.", "NTA but you have to remove your account information from anything that is in his name.  Tell your mother to block him if he's stressing her out.", "NTA\n\n&#x200B;\n\nYOur mom is the AH here.\n\n&#x200B;\n\nBut yo are an AH to yourself and crazy to make payments from HIS account. You fault him for doing the same from your account. You are giving him a lot of ammunition for court there.  ... DON'T touch the accounts of that person. Let HIM handle his own stuff.", "Your mom is right, you need to get things dealt with, how the heck is he able to accidently pay his bill from your account?\n\nHe shouldn't have access to your account or be able to pay bills from your account. This needs to be dealt with quickly.\n\nAs for not wanting to communicate with him outside of child related things, that is fair and nta.", "I mean, your mom is not wrong, you did choose to have a child with him.. but I fail to see how that would make you financially responsible for him.for all eternity.. That's a logical jump I just can't make.\nIf he has all the info he needs to do his things, then that's that. I don't see why he can pay using your money though, that seems very wrong to me, but maybe I have missed something.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBack in July I(F27) broke up with my fiancé(M32) of 8 years. He was extremely disrespectful to me and my parenting and childish to boot. He blamed his ADD and anxiety for his inability to clean, and his inability to keep a steady job. I paid all of the bills whether they were in my name or his. \n\nWe have a 5 year old daughter. I think he babies her, he never wanted to let her do things for herself and overall was raising her to be very entitled. I was working full time, usually 50 hour weeks, and he was staying home with her because ‘his entire paycheck would just go to daycare’ (his words). She started school last year with preschool and he finally started working again. However I was still paying all of the bills, including 960 for rent every month. We eventually co-signed on a car but he insisted on putting the title in his name and leaving me off insurance because I’d had some accidents in the past. I agreed at the time to avoid a fight, but it wasn’t long til I was responsible for that bill as well. \n\nDue to a series of events while he was living with me after we broke up, my daughter and I now have a restraining order against him. \nI have gone out of my way to make sure he has all the login information he needs for the bills in his name, but apparently that wasn’t enough as he’s been calling my mom complaining about me not helping him. He ‘accidentally’ paid his car insurance out of my account this month and is apparently unable to login to the car payment account. He called her on Sunday repeatedly complaining about being unable to login, I never received a verification email so I’m not sure that he even tried, and my mom called me screaming that I need to ‘put my big girl panties on and figure this out because you chose to have a child with him’.  There was probably more but at that point I hung up on her. \n\nAfter everything that happened, I don’t believe I’m obligated to do more than the minimum (or even the minimum for that matter but I’m too nice) when it comes to him. At no point did I ask my mom to communicate with him, she made that decision herself. Now she’s made he’s stressing her out over this. So am I the asshole for not helping him?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I’m on the loan for the car. He’s apparently refinancing to have me removed tomorrow. I took my account information off of the insurance and car bill last month and switched it to his, but apparently the insurance didn’t save. The car bill did. I’ve already closed out that account and opened a completely new one and have been changing all my passwords", "We have family court coming up Thursday, it’s the first meeting but it’s definitely something I plan to bring up when given the chance. That account has been closed, I opened a new one the same day this happened.", "Most restraining orders have a clause of no contact through 3rd parties. Him contacting her mom could be a violation of that order.", "This isn’t even the first time she’s nagged me instead of supporting me in regards to this situation. When I first ended it (due to his disrespect, emotional and verbal abuse, and violent tendencies) she told me to ‘fix my family’", "I’ve already closed the account and payed the bill out of his account (my mom actually told me to do that initially, that’s apparently why he called, I did to shut her up). I told her to block him too. She didn’t really answer that. I’ve gone no contact before and I will again if needed. He’s apparently going to be refinancing tomorrow, we’ll see what happens there. If he doesn’t, I have plans to contact the loan officers and see what my options are due to the circumstances.", "Only contact I’ve initiated has been to arrange him getting his shit out of my house. I had that thought, so I looked into the laws in my state regarding restraining orders and, while it’s not recommended, initiating contact has no penalty to me. Trust me, I don’t want to talk to him or a third party about him lol. He’s got two fish tanks, a bed frame, and a grow tent he has to get then I won’t be talking to him again for any reason.(and if he doesn’t get those, I’m selling the shit. It’s been more than a month 🙄) I closed the bank account in question too, on the off chance other accounts of his had it saved.", "I closed that account, seemed like an easier option. I did tell her to, but she likes to claim he’s still family. Honestly think my mom liked him more than me.", "He’s the one that asked my mom to have me make that payment. Otherwise I would have left it for him to figure out. If he brings it up in court, I’ll be sure to mention him breaking the RO to ask me to do that.", "Account is already closed, I had switched the information to his account already but apparently insurance had other ideas.", "When we were still together the payments came out of my account, and despite already switching that information to his account and deleting my account off the insurance, it was still there. I have since closed that account.", "Excellent! I hope he actually refinances.", "He’s already violated it this way numerous times. I’ve reported it once and basically got no where, I’ll be bringing it up in family court as well.", "Well done, you got this! I hope everything works out for you in the end!", "If he doesn’t, I’ll be contacting the loan officers myself and let them know about the circumstances and see if I can be removed. I still have access to the account so I’ll be able to see no problem.", "Back in the day my ex was awarded the car that had payments and I got the vehicle I brought in that was paid for. I went to the bank and showed them and told them he wouldn’t pay it. I worked with the bank so they could “repossess” the car. I dropped it off at the bank on a Friday. I was back in Monday and refinanced what was left. That got his name off everything. On the weekend the car was at the bank I went and got my vehicle (that was in his possession). He asked where the car was I told him he knew where it was. When he came for visitation the next time he saw the car but didn’t say anything or ask about it.", "NTA But I just want to say him using your mom to contact you likely violates the restraining order. Your lawyer will be able to confirm whether that's correct in your area but it likely is. (Cuz obviously no one wants people to have easy work arounds on restraining orders.)", "NTA. I hope you lock down your credit. And I'd create some distance with your mom. She shouldn't be involved, and if she can't support you, then the least she can do is not add more problems to your plate.", "NTA, you and your daughter are better off without him and your mother.", "ESH but your mom.  You did choose to have a child with this guy so yeah you need to deal with him instead of letting him backdoor your mom.  \n\nI know it sucks, but who you let be your child's parent is one of the most important decisions you will ever make.", "NTA. OP, text your mom, \"If you don't like hearing from BLANK, block him. I will not be contacting him in any way, since we have a restraining order. If you choose not to block him, that's your choice, but don't ever contact me again telling me to communicate with our abuser.\" And, OP, if she contacts you again about it, block her. You don't need that in your life. \n\nAdditionally, check your restraining order about him using your account. I'd be mentioning it to the police to create a paper trail.", "I really like the way you've spelled it all out and the way you phrased the issues with the mom!", "I’m aware it does, no third party contact is specified in the RO. My mom doesn’t seem to care even though I’ve already reported him for it. Nothing I’ve said has stopped it and reporting it got me nowhere since she’s willingly talking to him. Since bringing it up to police did nothing, I’ll be bringing it up again in family court", "Did you miss the restraining order part? Or the part where my mom is choosing to continue talking to him despite me never asking her to? I’ve also told her to go ahead and block him if she’s bothered. I understand I have to deal with him in regards to my child but his financial responsibilities are not mine.", "Seriously. She has the nerve to tell OP to \"put her big girl panties on and figure this out\"... sounds like OP is the only one in this story who is actually doing so!!!", "NTA\n\nTell mama you put your big girl panties on. That's why he doesn't call you.", "NTA. Tell your mom to change her phone number. And you’re doing the right thing by staying away from your ex for yours and your daughter’s safety.", "NTA but you don't 'share' a child. It doesn't sound like he's contributing anything financially and if there's a restraining order, he isn't helping out with childcare. Don't help him.", "NTA. Do nothing for him, and contact the folks about the car loan to find out your options.", "NTA. But you may need to have the car bought back. If he doesn't have it refinanced. Might be what he needs to get the point you're not playing his games. Not your job to pay his bills. If your mom thinks it, is she can do it. Good Luck.", "NTA I have nothing to add that others haven’t said other than stay strong. Maybe go NC with your mother if she chooses to stay in contact with someone you and your daughter have a restraining order on.", "Oh that’s a good one lmao. I might use that if I talk to her again anytime soon", "He’s never contributed financially. He also likes to say I owe him somewhere around $5000 for the shit he did buy when he lived here. Mainly weed and alcohol, which I’ve quit weed since I don’t feel like I need to be high to get through the day anymore now that he’s gone. I calculated the damage he did to my apartment last night (my lease has an itemized list of what different damages cost) and I’m out at least $930 for what I know needs to be replaced. Every single thing was done by him. 3 doors with holes, nails in the walls, cracks in the walls, broken outlet covers. There’s more but I don’t have it in front of me", "I didn’t even think about reporting it. Glad I posted this, I’m getting a lot of great advice", "It sounds like time to cut your mom off.", "Keep reporting it - you want the paper trail.", "They didn’t actually fill out a report as far as I know. An officer came and talked to me about it and basically said unless my mom says he’s harassing her there’s nothing they can do", "If they came out to a call, there's a record, trust me. It may not be a formal report, but they logged it. \n\nYou should do the same - log all contacts, attempts at contacts, and third party contacts. And continue reporting to the police whenever needed so your logs are verified.", "He’s likely violating the RO by calling your mom. NTA but act accordingly.", "NTA. Everyone else sucks tho.", "NTA, you already have a RO against him, you need to completely cut him off of your life and move on, otherwise he's a leech you'll never get rid off.", "NTA but your ex and mother are", "NTA\n\nIf you're forced to pay the carnote because it's in your name, take possession of the vehicle. \nDo not allow him to drive your car. \n\nThat mofo will sit in the driveway collecting dust.....or....I'd work a deal with someone else that needs a car.  \n\nAirbnb that car b4 I'd let that loser drive it.", "NTA I would give him one last phone call to tell him that he is no longer your responsibility and he needs to figure out the fuck out and basically telling him if he can’t pay the car you’re gonna get it repaired because it’s no longer a problem and he is no longer a problem I wouldn’t even give him another second of ur life since you’re able to get the restraining order he really is no longer your problem and he’s out of your life and your daughters", "While I like the idea my apartment only allows 2 cars and my boyfriend is moving in in a couple months. Trying to make rent payments easier 😬 he’s a huge upgrade compared to this nut job 👀 I could probably sell it back to the dealership though", "He will absolutely not refinance. You need to start taking steps to get the car returned. You will probably take a huge hit to your credit score for the repossession. Make better choices in the future.", "Just want to jump in on \"*it’s definitely something I plan to bring up when given the chance*\".\n\nDo NOT wait on a \"chance\" to bring it up.\n\nMake a list of EVERYTHING you want to discuss, **EVERYTHING**, no matter how \"small\".\n\nHave that list ready and tick things off once they are discussed.\n\nDo not end the meeting unless you've gone over EVERYTHING.\n\nGood luck!!\n\nAnd NTA.", "And about him harassing you through other people or getting them to harass you.\n\nAlso volunteer to surrender the car to the bank if he doesn't pay", "They won’t remove you as you’re the best chance of them getting paid if Ex fails to pay.", "And put an app on your phone to record all calls.", "i'd be interested to see the responses, here, if OP was a male and refusing to pay the bills for his ex who was a former \"SAHM\". something tells me they'd be vastly different.\n\nyour mother is correct, when she says you chose to have a baby with this person. 100%. you also chose to stay with him and allow him to become accustomed to you taking financial responsibility for everything that he should have, that was his, on his own. but, hindsight is 20/20.\n\nas many others have said, good on you for closing the account he took the payment out of \"accidentally\", and definitely remove all of your personal info from the online accounts tied to his bills and debts.", "NTA", "Have you never watched Judge Judy? He will never refinance that car and the bank likely won’t let him refinance the car. Then when he doesn’t pay the bill and it gets repossessed, they will come after you! \n\nInsanity!", "NTA\n\nTell your mom to block him. You don't owe him anything. He needs to pay for his own bills. Get your name off of the car loan since he didn't put your name on the title. Financial rule 101 - Don't have your name on the loan if it's not on the title. Don't have your name on a loan with a dead beat. If you want a car, get the loan yourself, have the car titled in your name only. Don't think you are responsible for him ever again. Tell your mom you have your big girl panties on and you will block her if she doesn't take your side in all of this. Tell her to block him if he is stressing her out. It's not your fault HE is stressing her out. SHE is letting him.", " NTA", "Get your lawyer to demand they remove you \n\nNTA good luck"]}