{"id": 8091, "submission_id": "10jm156", "title": "AITA for calling my sister a b*tch and heartless?", "selftext": "I(22) am the youngest child of 3. My eldest sister is 27 and my other sister is 25. My eldest sister is the golden child in our family. Always did the best in school, smart, beautiful and very conformist. Did everything by the book, best college, biomedical engineering degree, now does R&D for drugs. \n\nMy middle sister is kind of the black sheep. When she was 17 she got involved with some shitty friends who introduced her to an older guy. He was 12 years her senior and my parents learned about it freaked out and put a restraining order and put up security cameras and did everything to prevent them from meeting. Then she ran away from home at 19 to be with him. My parents tried to get her to come back but she moved in with him and they got engaged.\n\nAt 22 she tried to run away. He was abusive (I won’t get into detail as not to get banned) and she tried to get away. My eldest sister lived 2h away at the time and agreed to take her in. My eldest sister let her stay with her bf and her in their apartment. She stayed for 2 months and then contacted her ex again and “tried to make things work”. He came over and a fight between eldest sister’s bf and her ex started. I’m not sure exactly why she said her sister’s bf started it but my eldest sister said her ex tried to break in. \n\nIt involved the police and my eldest sister was pissed at my middle sister and cut her out of her life after she went back to her ex. Refused to speak to our sister and I was across the country studying at the time so I couldn’t help. \n\nNow my sister is trying to run away again and my parents and I want my eldest sister to help. Her and her now husband live in a gated community about 45 min from the city so my sister can still work and commute back and forward. My sister has a baby who is immune compromised and going to a shelter is not an option. She also doesn’t have money to put down for a place and her ex used her credit and ruined it. My parents want her to come to live with them but she lives 6h away and wouldn’t be able to work. \n\nMy eldest sister wouldn’t reply to her calls and just said sent her a text saying she wouldn’t put her family in danger over her shitty choices and she was going to run back to her red neck ex even if she did help. It was extremely shitty to say when she finally made the decision to leave and I called her to tell her what a bitch she was and how heartless she was being. She called me a little kid and told me I didn’t understand how the world worked and hung up. My parents have been trying to get my eldest sister to take her in in or for her to come live with them but it looks like she might stay because she doesn’t feel like she has other options.", "created_utc": 1674504430, "permalink": "/r/AmItheAsshole/comments/10jm156/aita_for_calling_my_sister_a_btch_and_heartless/", "score": 243, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for telling my eldest sister and was a bitch and heartless for being so rude when telling my sister she wouldn’t take her in?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA-- didn't you read your own post? Last time she helped her husband was attacked and the cops were called. Why should she expose herself and family to more trauma?\n\nYour sister should move in with your parents and find a new job in that state to get away from her abuser.", "YTA. Eldest sister is right to protect herself and her relationship.   It is NOT her problem.", "YTA. Your eldest sister has already given your middle sister a lot of chances. Sounds like the middle sister ruined those chances and took advantage of your eldest sister. Not to mention, the ex tried to break into your eldest sister's home?? So your middle sister showed that not only can she not be trusted, but she seems to have no problem putting her loved ones in danger.\n\nIf I was the eldest sister, I'd want middle sister out of my life too. It sounds to me like you actually *don't* understand how hard it was for her. If you're so much better of a person than your eldest sister, why don't you take your middle sister in?", "Info: why can’t your parents and/or you help?", "YTA. \n\nIt's not your place to tell your eldest sister how to live her life or use her resources. Your eldest sister has worked very hard to get where she's gotten in life, and the last time she attempted to help your ne'er-do-well middle sister, the police had to get involved. And it doesn't even seem like your middle sister has accepted responsibility for that incident—she's still blaming your eldest sister's boyfriend. \n\nGiven these circumstances, you really expect your eldest sister to put herself out there again? You expect her to risk everything for which she's worked? Both of those are (to use your words) heartless.", "YTA. Your sister tried to help once and it caused nothing but trouble. Now you want to put even _more_ on her by wanting her to take in her sister and a baby. Being \"family\" and only 45 minutes away does not mean _she_ is the only one obligated to help. Especially after your middle sister put her in danger last time.\n\nNot to mention, your middle sister wouldn't have gotten into this mess if she hadn't insisted on going against the safeguards put in place for her. \n\nYour oldest sister isn't being a bitch, or heartless. She just learned her lesson. Once bitten, twice shy. Maybe you/your parents should help out.\n\nEdit: your parents even offered to let your sister stay with them, and she said no. Your oldest sister is even less of a bitch now, if the middle sister is actively turning down help. YTA for trying to pin this on your oldest sister. Props to her. I hope she doesn't give in to you.", "YTA. Have you ever heard the expression \"fool me once, shame on you; fool me twice, shame on me\"?  \n\n\nThe best predictor of future behavior is past behavior. Your eldest sister doesn't trust that your other sister won't pull the same nonsense she did the first time. And maybe she's wrong. But she doesn't have to put her family at risk. You and your parents believe she's for real this time, so you guys need to finance and create a new life for her if that is what you want, not put all the responsibility onto your big sister.", "Yta\n\nIt is your eldest sisters right to have in her home who she wants, if she thinks it will endanger her  family then she has a right to say no. It sounds like your middle sister is not in the best place mentally and the ex sounds abusive so I can completely understand her saying no", "YTA. The eldest sister ***already*** tried to help your other sister who didn't appreciate the effort. She would have been fine if she didn't try to get in contact with her abuser again (and most likely give him the current adress so that her ex is now not only her problem ***but also*** that of her sister and her boyfriend).\n\nYour eldest sister doesn't have to suffer for the bad choices of her little sister. She doesn't have to risk her wellbeing and that of her boyfriend. Regarding her boyfriend ... this mess can  even sow discord among these two. In other words your sister also made the decision to show her boyfriend that she takes actions against people that try to make their life difficult.", "INFO  \nWhy aren't you or your parents taking her in?", "yta, your middle sister kept going back to this guy who started a fight and caused the older one trouble and you say she is heartless. I think she is just done with the chaos. Good on her.", "YTA for blaming your oldest sister. I mean, the way your oldest sister worded it wasn't the best, BUT, I do not blame her at all for not wanting to take this on again after what happened the first time.  Also, to be honest, there is a good liklihood that your sister WILL go back to her ex again.  Many, many, women do - several times - before they leave for good.  Unless your middle sister has an amazing job, with great benefits, she could most likely find another job closer to your parents, and move in with them.  I would also encourage your middle sister, you, and your parents, to look into Organizations that help women fleeing domestic violence.", "YTA-Middle sister is being entirely too choosy and your eldest sister did help the first time. She’s not heartless or a b••ch for refusing to put herself in a volatile situation again.", "YTA\n\nYour sister is allowed to have whatever boundaries she wants with your middle sister period since she has already shown her colors to her once before. She is allowed to protect her family for anyone and everyone she deems necessary. You are the AH for calling her a bitch. If your sister truly wants out there are women shelters that can help her get from one place to another if she is truly trying to leave. Oh if your parents really want they can drive there with a truck or uhaul pack her up and move her and you can help.", "YTA. Your oldest sister is absolutely entitled to protect herself and her home from the chaos your middle sister could bring. Your parents need to find a way to help without offering someone else’s home in the process. I hope you guys are able to figure something out.", "YTA - Your sister already tried to help once, and it put her and her now husband in danger. That's enough for anyone. I wouldn't help out either.", "YTA. Older sister helped last time. She has every right to say no now.\n\nLast time, middle sister moved 2 hours away to live with older sister. This time, she has the option to move 6 hours away to live with you parents. So it's not like she has no place to live. She just doesn't want to.\n\nMiddle sister and you are both AHs. Older sister is not.", "YTA\n\nHow many times does your eldest sister have to set herself on fire?Middle keeps making terrible decisions despite having an out\n\nShe made her bed, she can lay in it", "YTA- you expect your elder sister to step up after your middle sister shit on her once already? Fool me once……", "YTA - Your older sister already made the effort to help middle and all it got her was a brawl that put her family in danager while middle ran right back into the burning barn of her abusive relationship.  All of you are totally out of line and AHs to keep bugging your older sister to again put her family at risk and disrupt their lives.  Middle doesn't want to move out of state--tough cookies.  She has an option and if she cares about her immune-compromised child at all, she'll take it and go stay with your folks and get her life in order for the baby's sake.  Right now it sounds as if all she wants is somewhere to lie low for a bit before going back into the barn again.  That's her issue, not your older sister's.  Leave older alone--you've all harrassed her far too much already.  You calling her names and abusing her makes you just as big an AH as your middle sister.  Grow the F up and tell middle the same.", "YTA She does have options. Leave and live with her parents. Your oldest sister has suffered enough. You were an AH for calling her heartless. Your second sister needs to get her sh1t together for her kid.", "YTA. The middle sister already almost messed up eldest sister’s household one time and the returned to her ex without hearing anyone’s opinion . Eldest sister has every right to not take her again and probably is making the correct decision. She messed up once, she helped her. She messed up the same way again, so she now doesn’t. Life is about choices. Don’t make the same mistake twice", "It's a good thing to help your immediate family, but in this case your middle sister has used up all of her credits. She needs to face her own mistakes and learn to fix them herself rather than rely on you or your eldest sister. There is danger in that, but it can't be helped. She is an adult and has to act like it.", "YTA--- Your older sister already tried, and things got physical. Why dont you help? You're a 22 year old adult. Why doesnt your mother help? Father in the picture? There are other options.", "YTA and also what your sister said - you're a child with either zero thought or care for consequence to *all* parties involved right now.\n\nyour middle sister was an (probably unwitting) accomplice to her crazy ex BREAKING INTO YOUR ELDEST SISTER'S HOME AND ASSAULTING HER HUSBAND. at what point do you start giving a damn about *their* safety? where's your empathy and compassion for them? is it only going to kick in if your eldest or her husband get assaulted a second time? what about murdered? is that when it'll sink in for you??\n\nyour sister is in a terrible spot, it's true, and i feel for her...to an extent, as this is all a domino-effect snowball from her being a headstrong teenager who believed she found true love over the objections of literally EVERYONE ELSE. because then she became a headstrong adult who first (again) *endangered her family* through her shitty choices and now is causing conflict because the options she DOES have for getting out aren't exactly what she wants. she *can* go move in with your parents but she's CHOOSING to once again make a selfish, self-centered decision. because oh, it's too far. oh, she doesn't *want* that. her parents are willing to support her and house her, so she can find a new damn job and put real distance between herself and her abuser - but she's probably not actually ready to leave, so she wants that fallback of Maybe We Can Work Out Again.\n\nwhatever her logic, the facts are that eldest has already done more than you and put her actual skin in the game and been burned by it. you, by your own admission, are not and have not been in any position to offer anything but a scolding for her not being willing to do this *twice* when you haven't done it *once*. so sit down. be supportive of your middle sister AND your eldest. and most importantly? shut up.", "YTA\n\nYour older sister already tried and the middle kid contacted the ex and told him the address.  There was an altercation, a potential break in, and police involvement.  Your middle sister doesn't get a second chance with older sister.  That's done.", "~~NAH~~ YTA- You want to help the Sister, the other Sister lived through an extremely scary and traumatic experience after she helped last time.\n\nIt would be a good deed if she continued to help, not an asshole move to not.\n\nEdit: 2nd thoughts you were an asshole for calling her a bitch over it.", "YTA, your eldest sister already tried to help the first time middle sister ran from her abuser. Only to have middle sister contact abuser, who then tried to break into your eldest sisters home and physically assaulted eldests now husband. She is not required to do anymore, she is not wrong for putting the safety and security of herself and her family first. You had no business calling your eldest sister names and inserting yourself into the situation that you are really not equipped to handle or judge.", "YTA your whole family is. Your Older Sister did take the MS in and her boyfriend came over and started a fight. Yes he did. We know this man makes shitty choices (I mean he groomed your Middle Sister from high school on) so you’re not telling me he didn’t start this fight. \n\nI would do the same thing. My house isn’t a fighting arena and if there’s a possibly he’s going to track her down and start something (again, remember) then it’s a no from me. What your MS wants doesn’t matter here. She needs a place, your parents are offering one. She doesn’t get to demand space in somebody’s house because it’s convenient. And she has a child?? It’s beyond reasonable that somebody doesn’t want a screaming baby in their home, especially if it’s not theirs. \n\nIf you wanna help that bad, you go rent a place by your MS and take her in.", "YTA. \n\nYour eldest sister did take in your sister, and that resulted in the police getting involved and her boyfriend being involved in a physical altercation. \n\nWhat work has your middle sister done to show that this won't happen again? Now there is a child involved which makes the situation scarier, and a gate doesn't protect a home if the gate is opened to someone, and your older sister has no reason to believe that your middle sister won't let this guy in. Why is your sister responsible to help when no other help has worked?\n\nPut it a different way: you are worried about your middle sister getting away from this guy, but apparently do not think your older sister should get to be worried for the exact same reasons. Your sister has demonstrated she will go back to this guy, and she will endanger her family to get back with him. This time, she may invite him in and someone- likely the husband- could end up injured. Why are you so heartless that you would want to put your sister in danger?\n\nI get that you are scared and frustrated, but name calling and making your older sister feel bad for protecting herself- from the same stuff that worries you about your middle sister- isn't going to help. If you read anything about interventions/ways to deal with family who are addicts, one of the main themes is to establish boundaries, cut people off, and protect yourself. Your older sister is protecting her home and her family, and she has done nothing to put them in danger. \n\nYour middle sister just doesn't like her other options: she can move in with your parents, but it is far away from this man, that's a red flag that she isn't really ready to leave. There are shelters for domestic abuse victims, and they would keep the baby who is immune compromised just as safe as almost any other environment. You all have just decided that the eldest sister, with her \"gated community\" is the right choice, likely because it has the least impact on all of YOU, because now your middle sister is her problem. Focus your anger on where the problem actually is, and that is with your middle sister and her decisions.", "YTA.  YTA.  YTA.  Your eldest sister is trying to protect her family. If you want to help your middle sister, you take her in.", "I LOVE how you and your parents think it’s the eldest sister’s job to bail out your other sister AFTER she did so ONCE and put HERSELF AND HER LOVED ONES IN DANGER BECAUSE OF IT.  No, sir.  It’s YOUR job and YOUR PARENTS’ job now.  If your middle sister can’t move to your parents then your parents can pay for an apartment where she lives.  And YOU can chip in too.\n\nYTA", "You’re old enough to help. Go for it. Be her roommate and help her look after her child. Quit what you are doing and put your money where your mouth is. By the way, YTA.", "I like your eldest sister, she seems smart, learn from her", "YTA\n\nPeople who keep fucking up only get so many chances before people say fuck you get away from me.\n\nYour shitty sister told the cops her that her elder sister's bf started the fight to protect her abuser?  \n\nYeah, no.", "So your middle sister is a dipshit, and your oldest sister has to bail her out of trouble because she’s the only one out of the three of you with any common sense, is that where we’re at here?", "YTA your eldest sister is not responsible", "YTA. The audacity. She already helped her and in return got her house broken into, her bf attacked, the police called and lies told on her bf. She is absolutely right to cut contact and not put herself through that again. If you’re so concerned why don’t you take her in? Why doesn’t she go live with her parents and get a job where they live? I would cut contact with the whole lot of you.", "YTA\n\nYour oldest sister and her partner put themselves at risk for your other sister. They took her in only for her to get back together with the ex and for him to attempt a break in and fight with them. There is no guarantee that history won't repeat itself. Oldest sister is doing what she needs to do to protect herself and her family. \n\nAlso, your whole first paragraph adds nothing to the post. It just tells me you have some jealousy and resentment towards your oldest sister.", "I'm REAL sympathetic to the heartless oldest sister over the sister who continually makes terrible choices and endangers her siblings and their loved ones.\n\nMiddle sister needs to move in with parents and find a new job.   She's already burned her bridge with the oldest sister, and I don't blame her a bit.  YTA.", "Unfortunately sounds like your middle sister really isn't ready to leave him again or she would be willing to move into your parents home and get a different job.  If she keeps the same job then he can simply just follow to where ever she moves to next. \n\nYour older sister is protecting her family, when the victim finally leaves an abuser.  Him murdering her and the whole family risk really goes up. \n\nYou are putting this all on your older sister instead of you or the parent flying or driving to her and moving her out and as far away from the abuser as possible.  More distance between Her and the abuser the better.  \n\nBreaking the cycle is hard and your middle sister will need lots of help in therapy to keep from boing back to him or into another relationship with another abuser. \n\nYou are way underplaying the risk of him murdering her and everyone who helps her.", "YTA. Adults leaving an abusive situation are not \"running away,\" they are escaping or just leaving. Running away is for kids. The fact you use that wording shows your oldest sister is right, you are a child. Refusing to live with your parents shows your middle sister isn't ready to end things. It has nothing to do with a gated community, it had to do with being close enough to go back to him.", "YTA. As the older sister of a younger sis who has never managed to stabilize, you can't help someone who isn't ready to be helped. I have flown my own sister across the country, had her stay in my apartment, sent her money and food, and in the long run it didn't make any positive changes in her life. I was just enabling her in her bad decision-making. \n\nMost people take several attempts to leave abusive relationships. My sister was in one, and I tried to help her get out but I couldn't. She had to be ready herself. Your older sister learned the hard way that her own sister is in such a bad place mentally that she will threaten the safety of her own sister and her sister's family yo maintain her unhealthy attachment. It's really easy to judge from where you are, because you aren't the one your sister will put at risk. Has it occurred to you that your sister's abusive partner could show up and murder both of your sisters? \n\nIf your middle sister were serious about leaving, she would move away with your parents. Your older sister is smart enough to see she is being called upon as \"the stable one\" to put herself at risk to try to save your middle sister from herself, yet again. No sibling should have to light themselves on fire to keep another sibling warm.", "YTA \n\nA lot of big talk from you about how big sister should help - and she already did and it got dangerous for her - why don't YOU and your parents help middle sis this time?", "Your middle sister has the option of moving back with your parents (I assume rent free). Yes she would have to leave a job but she would be further away from her ex. Your eldest sister tried to help her once and it blew up in her face. YTA and your elder sister being the golden child has literally nothing to do with this story btw", "YTA, you and your parents want your sister to help but what are you doing to help? Your older sister is right, you don’t know how the world works. \n\nYour older sister has tried to help and that did not go well for her or her husband last time. She isn’t responsible for you, your parents or other sisters poor choices just because she has been successful. Sounds like older sister is actually the black sheep by the way you and parents seem to feel about her.", "YTA. Your sister has done more than enough, no wonder she doesn't want another round of drama.", "YTA.\n\nIf you want someone to support your middle sister **you** do it.\n\nYour oldest sister has every right, and some would say the obligation, to protect herself from a user.\n\nYour middle sister is an adult and making her own choices.", "YTA.  Why would eldest put her family in danger again.   Maybe this time ex shows up with a gun and things go tragically different", "YTA Eldest sister helped her once and it back fired, why should she do it again?", "YTA. Put up or shut up. If you want to help, move to that city and help your sister. You won’t do that because you don’t want to inconvenience yourself, but you are more than happy to call your older sister names and try to unconvinced her.", "Omg YTA, you're sister is an AH, your parents are also AH.  You're eldest sister has her own life and family to protect from your sisters mistakes.\n\nYour sister has already tried to help and you act like she hasn't! Honestly this type of crap behavior from you and your family warrants your sister to cut off all ties to this trauma filled family \n\nIf I was your sister I tell you how awful you and your parents are for even trying to put her in this position and making her out to be the bad guy\n\nWake tf up and see how absolutely disgusting this type of behavior is, you're all no better than your sisters abusive ex.", "YTA\n\nYour eldest sister already helped once, ehich ended up in your younger sister contacting after 2 months, the ex trying to break into your sister's house, her boyfriend getting physically attacked and the police getting called. \n\nHow about you step up, give your youngest sister money to get her own place and chip in. It's so easy for you and your parents to volunteer your older sister's help and do nothing yourselves, and when your older sister keeps her boundaries firm, you attack her over it.\n\nYou step up and help your sister.", "YTA! Your oldest sister already “paid the ultimate price” for helping the middle sister & doesn’t deserve your judgment.  Apologize.", "YTA. You lived on the other side of the country. Easy for you to say what to do and call names. She already tried and look at the mess she got as thanks. You're so worried about helping her give up what you have and move closer.", "YTA\n\nShe can move back into her parents. Stop expecting the sister to drop everything and take her in. That's not her responsibility.", "YTA. First off, your eldest sister supported your middle sister. It's not her mistake if your MS keeps making bad choices. ES has her life.\n\nSecondly, you make it sound like your ES had an easy life. I think she worked hard to be where she is now.", "YTA. Your sister already tried to help her once and it blew up in her face. Gated community or not she doesn’t want that happening again. Does your oldest sister have children? Your middle sister can move in with your parents. I don’t care that that’s not her first choice, it’s the option that’s available. She can find another job. Or you and your parents can give her money to find a place where she is. She isn’t her sister’s responsibility. She’s an adult who made poor choices repeatedly. She takes the help that’s offered or she does it on her own.", "Yes. YTA. It’s time for your sister to grow up and learn about the consequences of her actions and it’s time to stop enabling your sister by always rescuing her.", "YTA I get that you want to help your middle sister, and she's in a terrible position. Your middle sister has made some shitty choices, and she is in danger. The very best thing that could happen is that your middle sister jacks the job in, takes the bsby, and moves 6 hours away from her obviously dangerous bf. I'd hazard a guess that the dangerous bf will follow middle sister home from work, and try and break in again. Your eldest sister is probably sick of being expected to step in and rescue your middle sister when it gets thrown back in her face. The thing is that your middle sister *does* have other options. She has other, safer opitions. She just doesn't have the a particular option she wants, and your eldet sister is being made out to be the bad guy for not wanting to sit around until the dangerous bf turns up on her doorstep again.", "YTA. Why should your older sister risk her family again? Tell your other sister to move away from the abuser. That’s the smarter idea. Or your parents can go get her.", "YTA and honestly sound deluded.", "YTA. Big Sis already helped once, and she saw her generosity abused and her home and family were disrespected and she ended up in a dangerous situation. Middle Sis needs help, but she already burned a bridge and Big Sis is within her rights to set up boundaries to protect her family, herself, and her property. It’s easy for you to have this opinion when it was not your home/life that Middle Sis wrecked.", "YTA \n\nYour sister helped before and was attacked and her home violated.\n\nI hope your sister gets help, but it’s not on your older sister to provide it after what happened.", "YTA, she tried helping your middle sister before there was a child involved in and it turned into a violent incident where she went back to her abusive partner (and had a child with them). From your descriptions of your siblings it also sounds like you have issues with your eldest sister doing well and you’re shooting your middle sister bail for her poor choices. Your eldest sister has no responsibility to help your middle sister after what occurred and it’s an AH move to shame your eldest sister for not wanting to invite more chaos and drama into her life for someone who has continually made bad decisions.", "YTA. If your middle sister was serious about leaving the guy, she would move back home to put as much space as possible between them. Your older sister and her husband were assaulted last time. They have helped her enough at this point and it was thrown back in their faces. It is understandable that they are done. \n\nIf you or your parents want to help her, you should convince her to move back home. Your older sister shouldn’t have to bear this responsibility, and your family is being selfish trying to put this all on her. Go to your middle sister, and get her to pack her stuff if you have to, because it seems she still wants to be close to the guy which is why she won’t move. A clean break would be best for her.", "YTA, your oldest sister tried to help. I don’t blame her at all for protecting her family.", "YTA she already tried this once and has good reason to regret trying to help that first time.", "YTA, you should apologize to your older sister and ask her to contact your middle sister and let her know that the best solution is for her to move back in with your parents so that she is as far away from her abuser as possible. Your sister can show support even though she was burned without showing her to stay there.", "YTA - your sister has every right to protect her family. You take her in.", "YTA\n\nReread EVERYTHING you just wrote and you can easily tell why your eldest sister would not want the other sister to live with her. She tried to help but your other sister ruined it and lost your eldest sister’s trust.", "Yta she can move in with the parents and get a new job!\n\nLast time older sis helped, the ex tried to break jester her house and her husband was *assulted* and the cops were called!  Easy for you to say what she should be doing since you aren't doing anything yourself.", "YTA\nI played this game with my younger sister many times, picking her & her kids up only for her to go back 2-3 days later. Finally had to go no contact when my family & I started to feel unsafe having her in our home. My younger sister went through this for 7 years having one then two kids & then getting pregnant a third time. Well the abuse finally stopped when he shot her twice in the head while 8 months pregnant in front of their children. So why dont you go help her instead of expecting your elder sister to put her & her husbands lives in harms way. Your sister is never gonna leave him.", "YTA. Your eldest sister has tried to help your middle sister before and ended up having to call the police on a violent man in her home. She is under *no* obligation to put her family in that danger again. In fact, she would be TA to them if she did.\n\nIf you middle sister really wants to get out of her situation, and your parents really want to help, she needs to go live with them. She can find a new there and they can help her out until she does. Being 6 hours away from her abusive ex will hopefully make it harder for her to go back to him again.\n\nThe cycle of abuse sucks, and I know you just want to help your sister, but she’s proven herself to bring dangerous situations with her and your eldest sister is not required to put herself or her family in that danger.", "Why don't you step up and help your troubling sister? You talk a big game why don't you help out? I don't blame your sister for not getting involved. YTA big time! Clearly your sister is nothing but trouble due to her own choices and you are really advocating she brings that mess around a baby? The hell is wrong with you. The answer is clear your sister needs to go back home with her parents.", "I’m sorry, your sisters ex SHOWED UP AT YOUR ELDEST SISTER’S HOME AND TRIED TO BREAK IN AND CAUSED A FIGHT and she had to call the police and you’re mad at her because she doesn’t want to put herself in a position like that again??? Absolutely not. \n\nAlso, your sister doesn’t sound like the “golden child” she just sounds like she actually has her shit together. \n\nYTA", "the eldest sister really doesn't deserve to have such crappy siblings", "Why don't you take them in?", "YTA", "YTA\n\nYour sister nor anyone is responsible for your sisters shitty life choices. Not only did the first time she tried to help it had the police required to be involved, but she went BACK to him like it was all gonna be okay. \n\nIf she can’t learn her lesson she doesn’t deserve help. Sorry op, family is family, but that doesn’t give you a a free pass out of your problems, especially when you bring them on yourself", "YTA You and your parents should step up instead of blaming others", "YTA. You do sound like a little kid, she already went down that path once and she needs to protect her family. Also your sister should just move in with her parents. Who cares if it’s too far away from her work she can get a new one. If she really wanted to get away what’s better than a fresh start back home", "YTA. your parents need to step up if they think someone should.", "YTA your sister is the only one who has some sanity in this situation", "YTA. While I have huge empathy for your sister and she needs help, and I sincerely hope she gets it, this time it's not going to come from your eldest sister. Being attacked was not part of the deal and while it CAN take multiple tries to leave an abusive situation it is not your eldest sisters problem. She has to protect her family. Best thing for her is to move far away and move in with your parents.", "YTA - your older sister has a right to make her own boundaries. She’s obviously healthier than you, since you do not seem to recognize that.", " YTA Major\n\nYour eldest sister is right that you don’t get it. She took a risk in keeping your middle sister safe in her home and ended up having the ex come and assault her partner and have the cops being called there. Who knows how wrong things could’ve went during that whole ordeal and you weren’t there to experience anything. So she isn’t making any excuses, she has valid reasons. \nIf your middle sister really wanted to get away from her ex then she would have absolutely no problem putting a 6 hour long distance between the both of them. It’s that fucking easy. It’s clear she’ll just go running back over and over again. You can’t help someone that doesn’t actually want the help. \nDon’t give your eldest sister shit just because she’s keeping her life safe.", "YTA mind your business. She doesn't have to open up her home AGAIN and pit her family at risk. You are a little kid who has no idea how the world works. Why don't you get her a place to stay?", "What you should do is get CPS involved if your sister cares at all for that little baby then she is going to give up everything including her abuser to be there for that baby and if she doesn't care at all then the baby will go into the system or one of the family members will get it", "YTA and have the understanding of a child just like your sister said.", "Why don't YOU or your parents help instead of pushing the responsibility for her off to your other sister? \n\nYTA.", "It's always so easy to decide what others *should* do while not lifting a finger yourself.  YTA - massively.\n\nMiddle sis has made her bed.  Yea, it's great she wants to get away from her scummy ex - but she burned the bridge with oldest sis.  YOU have NO business telling your oldest sister anything.  It is not her responsibility to take in your other sister.  It is not her responsibility- repeat that until you understand what that means.\n\nYou sister makes bad choices and she has an option.  She can go live with your parents.  Is it ideal?  Probably not but it is safe, it's a roof and food.  IF she was thinking clearly, she would realize it's enough for now.  She should go to mom and dad's and get herself settled THEN she can start figuring out the next step.  \n\nThis is coming from an empty-nester who opened her home to a daughter and 3 grandkids who had nowhere else to go.  Daughter tried to find a housing in her little town and a job for nearly a year, while her hubby was sleeping with anything in a skirt and heels. By the time he threw them out, she figured out there were no other options.  Now a year and a half later, she has a job she really loves and her kids are thriving and happy.  She convinced herself they would hate living in out town but they love it.  Sometimes you can't see the forest for the trees.\n\nNow back to you - it's easy for you to decide who should do what but your opinion counts for exactly nothing, nadda, zip, zilch, zero. If giving middle sis an easy out is so important to you, you need to quit school, move to where middle sis lives, find a job, rent an apartment and have her move it.  Then you work to support her while she bleeds you dry.  You take the responsibility and stop trying to foist responsibility on your oldest sister.", "YTA. How is this your other sisters fault? She let the middle sister live with her for a couple months, she ran back to her boyfriend and also he got in a fight with the oldest sisters BF. Now your sister after having a baby with this man (I can’t lol enough) wants to run away again and wants your sister to raise her and her child pretty much. Why would the oldest sister put her family in danger again? Also so what if your sisters kid is immunocompromised, do you know how many people deal with shitty situations like that but they don’t get to pick and choose where they live. You sound like an AH too. She’s not your oldest sisters problem anymore", "YTA. You can't seriously expect your sister to put her own family at risk considering what happened the last time. She is not heartless. She's doing what she feels is right to protect her family. \n\nYour other sister can move in with your parents and find a new job. And she needs therapy desperately.", "YTA. The last time your eldest sister helped the middle sister, her husband was harmed. She’s protecting her family. Are you sure the oldest was the golden child because you’re sounding awfully spoiled and entitled here.", "“It was extremely shitty to say when she finally made the decision to leave”- except **this isn’t “finally,” this is “again.” **\n\nYou don’t sound like you have ever been in a violent, terrifying situation. Your older sister *already* helped your middle sister out, what have you done that is even comparable? When your oldest sister helped out your middle sister, provided her with a safe space to live, your middle sister then took advantage of that by **inviting a known abuser over** to **someone else’s house** and directly caused your BIL to be attacked!? How on earth do you not realize how much of an awful thing to do this is?! Your middle sister put two lives in danger because she makes terrible decisions and doesn’t learn from them. You want your eldest sister to **endanger her own family *again* ** when you haven’t even done that once? And all because your middle sister feels that your parents’ house is too far away? Middle sister has options, she just doesn’t want to use them because they are inconvenient for her. Aside from anything else, this indicates that she’s not actually leaving the guy.\n\nShame on you. Your oldest sister held back by calling you a kid, I’d have told you that you are wildly arrogant and cavalier with the lives of everyone except your middle sister. If you’re so convinced that she’s finally leaving her husband, **you** put your own safety on the line to help her out. Stop volunteering other people’s lives. \n\nYTA", "YTA\n\nYou really ought to go and study about the different sayings.  Here is one that fits:  Once bitten, twice shy.\n\nYour older sister did try to help and guess what she got burned badly, and hurt by the very person she tried to help.  What makes you think that it is going to be any different this time around?  How many times does your sister have to put her neck out to help out, before it is ok for her to say NO.  \n\nAnd your parents they are a real piece of work, they after all created this situation, between making your eldest sister the golden child and use her, to where they pushed their other children to the side.\n\nAnd you, your sister is right, you don't understand and instead of trying to, you just are going to add in your 2 cents?  How about your middle sister comes and stays with you?  After all you seem to think that your eldest is being heartless and cold, how about you step up and house your middle sister and her child.  How about YOU show everyone how you are right with actions, instead of making statements and trying to force others to do the dirty work.\n\nYour eldest sister has already gone NC with the middle sister, and based on what you posted, chances are you and your parents are going to be next.  She is already showing she is done with this and trying to force her will only result in her cutting all of you out of her life an forgetting any of you ever existed.  You ready to lose your sister?", "YTA. Your older sister ALREADY tried to help her & got taken advantage of & put at risk for violence. If you & your parents want to help her, then you take her in. Your older sister was absolutely right in what she said.", "INFO: if your sister is truly in harms way but won’t put 6 hrs distance between her and her abuser, why the hell would your eldest sister think the middle sister wasn’t going to bring a situation to her home where the abuser tried to break in and physically assault her boyfriend again? Hmm what’s more important: her and her child’s life or one job in one location??\n\nShe’s being smart and protecting her own family.", "YTA. That's not what golden child means. Your eldest sister did well for herself, she tried helping and for her help her husband got assaulted and she was probably made to feel unsafe in her own home. She has all the right in the world to set those boundaries and you've got no business judging her for it. \n\nHow about YOU uproot your life for your middle sister? Why should it matter you live across the country and going to college? Switch and move. It's so easy to demand other people to make sacrifices for others who have already abused the kindness. \n\nYour middle sister's excuse that she doesn't want to move is also very telling, all it means that chances of the same thing happening again are way too fucking high. \n\nAlso stop being so jealous of your oldest sister. Focus on your own life and doing well for yourself.", "YTA - 'golden child' sister sounds like she's the only one with any sense. I'm not putting my family at risk for someone who has proved they have zero concern about me.", "[removed]", "YTA. She already burnt that bridge. Your parents can help her if they want to deal with that. She can find a new job and your parents can support them while she gets on her feet.  She needs to be far away from that mess anyway. Your parents and you can deal with the drama this time, your sister already tried it once.", "YTA. And you sound jealous of your older sister.", "YTA. Google how often family is killed because they got between a family member and their abuser. Your older sister allowed her once and she got burned. Why would she ever do it again? If your younger sister was really serious about leaving her husband then she would move to another state with your parents. It sounds like she's still not sure and wants ties to the location her husband is. You can't help someone who won't help themselves. I definitely don't blame your older sister. She has her own family to protect.", "YTA. Definitely YTA. Bite me once shame on you bite me twice shame on me. That plus there is such a thing as compassion fatigue. \n\nEspecially since your family warned your middle sister about this man for years and not only did she not listen she ran off with him. She made her bed and now she has to lie in it. Especially since the older sister helped her once and by doing so put herself her home and her relationship in danger.\n\n If you and your parents believe that she is well and truly done this time, then one of you'll take her in. if not keep your mouth shut. and you need to apologize to your older sister. Or maybe you could let the middle sister in and when the abuser shows up and tries to attack you, maybe then you'll have a better understanding.", "Why don’t you drop out of college, move back home and live with your sister? Then when her abusive ex comes, you can figure out why your oldest sister doesn’t want to try again\n\nYTA", "YTA\n\nOlder sister already stuck her neck out for middle sister once, and it ended badly, due to middle sister inviting her ex over.\n\nIt's okay to have boundaries, it sounds like your older sister knows this. Your middle sister sounds like she's having a hard time learning that, but at the end of the day no one but her can make the decision to break things off with her ex.\n\nIt's not your oldest sister's job to play Jerry Springer and host your middle sister and her drama.", "YTA. Nothing that you have put in your post sounds like your eldest sister was the golden child. If anything she seems like the one who has her life together and her priorities in the right order.\n\nYour middle sister, though in a tough spot, has already burned any chance of receiving any help from your eldest sister. She is toxic for you eldest siblings family and your sister is right to keep a safe distance from this situation.", "YTA. Your middle sister can’t be helped if she won’t do the work to help herself. She had a chance.", "YTA it would create an unsafe situation for your oldest sister, and she doesn’t have to put herself in the same situation again. She can move in with your parents which would probably safer than living closer to her ex.", "and here i thought you would be talking about your older sister not to oldest. your oldest's husband was attacked and police got involved i cant blame her on that and neither can you YTA", "YTA.  You're 22, OP.  Why don't you get up off your ass and help your sister instead of throwing blame on a sister that already tried to help and got shit on for her efforts?  Split the rent, babysit for her, give her rides....?", "YTA. Your eldest sister (ES) DID try to help, but your middle sister (MS) brought her problems to ES’s door. MS made the conscious decision to leave and try to make things work with her abusive ex. The situation sucks for MS, but ES is just looking out for her family. Frankly, MS’s abusive ex is not ES’s problem.", "YTA. If your sister doesn’t want to move 6 hours away from her abuser, she’s not ready leave.", "I'm always blown away when others disparage others for not doing enough. If you want your sister to have support, you fucking do it. Your eldest sister already helped once, and it ended with her husband getting attacked and your middle sister going back to her abuser anyways, why the hell would she do it again?\n\nOh, I know the answer though \"but I can't help I'm too far away, wah. I can't help I don't have room, wah. Insert some other forgettable excuse here.\" If you want her to get help then go get her and her shit and move her on to your couch. Otherwise, don't you dare belittle your eldest sister when she's already done more than you or your parents.\n\nYeah YTA", "YTA\n\nThat intro about your older sister is irrelevant, but it does show your jealousy and resentment of your older sister.\n\nIt's so easy to tell other people to help others and not do a damn thing yourself. What are you doing? You're using the \"im in college and in a different state\" excuse. Why don't you change schools and move to where your middle sister is and rent together and pay for all her needs? If you care so much about your middle sister, you would do this, right?\n\nLet's be real, you are young, nieve, and have no idea what you are talking about. You think your older sister is using the previous event as an excuse?? The excuse where your middle sisters ex broke into her house, assaulted her partner and had to call the cops. You were not there. You have no right to dismiss other peoples tramaua or minimise it.\nYour middle sister still went back to her ex. Your middle sister needs to be held accountable. Also it's a huge slap in the face to your older sister that the other went back.\n\n\nIf your middle sister really wanted help and to keep her baby safe, she would go back to your parents. She only wants to live with the oldest sister so she can once again go back to the ex if she feels the need. She has options to leave, she is choosing not to use them.\n\nYou and your parents are the AH. Your oldest sister has every right to protect her own family and put them first. She already helped the other sister once and looked at what happened.\n\nYou can't force people to help others. Stay in your lane.\n\nYTA", "You are an AH - And a little child who doesn't understand how the world works.    Your older sister has a right to a peaceful life and nobody should be attacked in their own home because a family member wont do what is right.  If he kills your eldest sister's husband this time will finally sink in for you?  Grow up, if you're such an adult with everything sorted out set aside YOUR excuses and support her.", "YTA- your oldest sister learned her lesson the first time. What job does your middle sister have that she wouldn't be able to find a similar one where your parents live?\n\nIt's not on your oldest sister just because she lives the closest.", "So basically your eldest sister was responsible and smart and that's why you judge her as \"the golden child\"? Even though you didn't say nor imply that your parents treat her better than the rest? You middle sister made her choices and now she has to live with them. And you are YTA", "I'm going to go against the grain and saying NAH. At the very least, it's a difficult situation and I'm sorry you all are in this position. I would have said Y T A if you all were trying solely to pressure your eldest sister without being willing to take in your middle sister yourself. It sounds like your parents are but she is rejecting this option.\n\nHere's the thing. Your eldest sister is allowed to set boundaries. She's allowed to say no even though it's family. She is not an AH for doing so. But I can understand you and your parents' franticness in trying to help your sister leave a dangerous situation. \n\nI have gone through a domestic violence training (required for volunteering at a shelter and working with survivors), and I learned that it takes an average of 7 times for a survivor to leave an abuser for good. Those of us who haven't been in an abusive relationship might be quick to say \"why isn't this person leaving their abuser? At this point, they're a lost cause\" but if everyone around them says that, then they only get further isolated and are more likely indeed to stay. This isn't unusual behavior or signs she'll never leave eventually.\n\nI think the family would be AHs to continue to pressure your eldest sister though so I'd explore other options. Something the domestic violence shelter I volunteered at did for survivors during COVID was to offer hotel stays. If that's not an option where she is, could your parents be able to afford a hotel room to do something like this? Also, even if nearby shelters don't have the funding/ability to do so, they can help your sister safety plan and figure out how to leave safely. They also usually have staff or connections to people who can help file restraining orders, connect to resources, etc. I would still encourage her (if she isn't already) to contact a shelter for help.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(22) am the youngest child of 3. My eldest sister is 27 and my other sister is 25. My eldest sister is the golden child in our family. Always did the best in school, smart, beautiful and very conformist. Did everything by the book, best college, biomedical engineering degree, now does R&D for drugs. \n\nMy middle sister is kind of the black sheep. When she was 17 she got involved with some shitty friends who introduced her to an older guy. He was 12 years her senior and my parents learned about it freaked out and put a restraining order and put up security cameras and did everything to prevent them from meeting. Then she ran away from home at 19 to be with him. My parents tried to get her to come back but she moved in with him and they got engaged.\n\nAt 22 she tried to run away. He was abusive (I won’t get into detail as not to get banned) and she tried to get away. My eldest sister lives 2h away and agreed to take her in. My eldest sister let her stay with her bf and her in their apartment. She stayed for 2 months and then contacted her ex again and “tried to make things work”. He came over and a fight between eldest sister’s bf and her ex started. I’m not sure exactly why she said her sister’s bf started it but my eldest sister said her ex tried to break in. \n\nIt involved the police and my eldest sister was pissed at her and cut her out of her life. Refused to speak to our sister and I was across the country studying at the time so I couldn’t help. \n\nNow my sister is trying to run away again and my parents and I want my eldest sister to help. Her and her now husband live in a gated community about 45 min from the city so my sister can still work and commute back and forward. My sister has a baby who is immune compromised and going to a shelter is not an option. She also doesn’t have money to put down for a place and her ex used her credit and ruined it. My parents want her to come to live with them but she lives 6h away and wouldn’t be able to work. \n\nMy eldest sister wouldn’t reply to her calls and just said sent her a text saying she wouldn’t put her family in danger over her shitty choices and she was probably going to run back to her red neck ex even if she did help. It was extremely shitty to say when she finally made the decision to leave and I called her to tell her what a bitch she was and how heartless she was being. She called me a little kid and told me I didn’t understand how the world worked and hung up. My parents have been trying to get my eldest sister to take her in in or for her to come live with them but it looks like she might stay because she doesn’t feel like she has other options.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "She should move in with her parents. She can find a new job. She blew it with your older sister.", "YTA &  MYOB", "YTA - if sis wanted out, the best place would be the parents home IMHO as it is far away from the abuser.", "YTA", "INFO; does the oldest sibling have kids?", "I understand you are worried about your middle sister & want to help her. Your sister sounds like she is an ABUSED woman who has been groomed.\n\nSo even if she goes to your sister again, the chances of her returning to the husband are 80%. That puts your sister & her family in danger.\n\nSo YTA for calling your older sister names, when you did not have to live through that experience. \n\nYour middle sister needs help. She can get a job in the state your parents are in. I wonder if there is a reason she won't leave the state? Is she being threatened? Maybe she is not fully ready or feeling strong enough to leave.\n\nShe needs a restraining order. Cut her phone off to go no contact with the husband. A women's shelter or a support group for abused women will be very helpful in her circumstances. She & the child need counselling.\n\nPlease encourage her to make a planned escape with your parents. Take all important documents. With help she can get better and heal from the abuse.\n\nEveryone one makes mistakes..we are human. A child is involved & she deserves better environment to grow up in.", "YTA. Your sister has the option to move to your parents house but she’s actively choosing not too. If she really wanted out she would take any option she had.   \n\nA gate won’t stop the abusive ex from showing up if you sister gives him the code or tells the guards to let him in. She’s already proven she will give out your sisters address. That time caused her boyfriend, now husband, to be assaulted. What will it escalate to next? Why would she invite that back into her life?", "YTA. Your older sister set a boundary when she went no contact with her other sister. Then she set a boundary saying she would not take in your other sister. You ignored those boundaries and expect her not to have any because you and your parents don’t.", "i have sympathy for middle sister because i know trying to escape abusive situations can be hard and she's going to need years of therapy to undo the damage he's done to her confidence and self esteem\n\noldest sister shouldn't have been so harsh in refusing. but she also is not responsible for putting her and her family in literal physical danger again after her husband was attacked the first time\n\nYTA", "NTA but neither is your older sister. Your middle sister is not serious or she’d go live with your parents. Older sister tried once and the cops had to be called. I feel for you but just stay in college. You can’t solve this problem. If she wants help she’ll go home.", "YTA the oldest sister already did her bit and got burned already. The parents need to step up and go get their daughter. Or send an Uber and a plane ticket\n\nEdited because I can't English today", "YTA. \n\nYour middle sister should be willing to leave her job behind to find safety for her and her kid instead of expecting your eldest sister to do the work.\n\nAnd your sister is right. You're a kid if you think that despite her past, your middle sister should have access to the comfort and safety your eldest sister's work would provide her.\n\nAs one would say : fool me once, shame on you but fool me twice, shame on me. Your eldest sister isn't getting fooled a second time and good for her.", "Your eldest sister has no reason to think your other sister has left for good this time. Unfortunately this leaving, returning, leaving, returning thing is common among victims of dv.", "YTA. She tried once and it ended up horrible. I don't blame her at all for wanting to not help. Your parents can go get her and she can find a new job.", "YTA you can only help someone so much before you have to realize that they need to make the choice to help themselves. I’m speaking from how I’m currently watching a similar experience in my family where someone has been going through a rough time for 15 years and does nothing to help themselves get better. It’s sad to watch but after people have offered so much help to them for years and all they’ve done is spit in their faces, you have to come to a point where you’ve helped enough and that they need to make to decision to help themselves. It’s understandable that your older sister is untrusting of your middle sister seeing as how the last time she offered to help her, your middle sister’s ex beat up her now husband. She understandably wouldn’t feel safe knowing that, that could happen again. If she wants help, your parents should be the one to give it.", "YTA.", "YTA take a queue from your eldest sister. She's got strong boundaries. It probably hurts to have to say no to her sister but you calling her names makes it worse. She has a right to her boundaries.", "YTA. If 25 really needed to, she could escape to your parents and find a job out there. \n\nYour oldest sister is right. You're still in college, and you have no idea what you're talking about. It's easy to offer other people's resources and safety when you dont know their value, and when you have no real stake in the game. Mind your business.", "YTA. You guys eldest sister already tried to help her and yet she went against the grain and got back with the abusive ex especially when he came to their house unannounced. You guys parents offered for her to move in with them, but she wants to be stubborn and not want to move out of state to stay with them. Anybody with a good sense of mind would move when someone is offering them shelter no matter if its out of state. Your middle sister burned bridges with the eldest, and obviously doesn’t want help because if she did she would go stay with y’all parents.", "YTA.", "YTA. Easy for you to call yoyr sister heartless because it wasnt the safety and sanctity of your home that was violated. While I sympathise with anyone caught up in the cycle of abuse, your oldest sister is not heartless. She's setting a boundary and I dont blame her.", "Why don’t you get a job and pay for a place for your sister then if you want to help so bad. Like this entire post is about calling your sister a bitch because she won’t do something you and your parents won’t do after getting burned once already. YTA for sure.", "Mmm… why don’t you help your middle sister out?", "YTA.\n\nEldest sis tried to help. What she got for thanks was her family endangered and a sicko showing up at the door to fight. Your idea is she should be beholden to do it *again*? She’s a sister. Not a parent. If middle sis wants t run home to mom, then that is what she should do - go to mom’s, not sister’s. \n\nMy heart breaks as a parent. This isn’t what we want for our kids. But the people to step in and be there are the parents, not a sibling. And, well, (hate to say it only because it must sound like salt in a wound, but…) with a little maturity I hope you’ll realize that too.", "YTA. As the saying goes, you don’t have to set yourself on fire to keep others warm. What you and your middle sister want is for your elder sister to set herself- and her family- on fire, to keep your middle sister warm.\n\nYour elder sister tried to help once before and this resulted in her now, husband being assaulted, and police getting involved. The actions of your middle sister’s ex jeopardized your elder sister and her family’s safety and security. \n\nDo you understand that if your elder sister’s now husband was arrested, he could have lost his job? Do you understand that some communities evict residents if there’s a domestic incident that results in law-enforcement being called? \n\nYour elder sister is right, you are a kid who has no idea how the world works.   By allowing your middle sister into her home, your older sister will be putting her family’s safety, security, and livelihood for a second time. \n\nI’m not sure where you got it from but both you and your middle sister seem extremely entitled, and both of you seem to be under the delusional impression that your older sister owes you something, simply because she’s  been successful at life. \n\nBut it sounds like your sister worked hard for everything she got because they don’t just gift people biomedical engineering degrees. And if you’re so concerned about your middle sister, why don’t YOU rearrange your life to help her?\n\nYou’re not a fucking kid you’re 22 years old. You can transfer to a college closer to her. Maybe YOU can get a job, then you and your middle sister can get an apartment together near where she lives. If you care so much about your middle sister, why don’t YOU make the sacrifices here?", "ESH OTHER THAN the eldest sister and her partner.", "\"You don't know how the world works\" like she's twenty or thirty years older.  Sure thing, sis, because 1996 and 2001 is an incomprehensible gap.  NTA.", "NAH except the abusive bf. \n\nSheesh, people do know that it often takes more than one attempt to leave an abusive relationship, right? \n\nI do agree that a 6 hour difference would be beneficial and show how serious she is about moving though. \n\nI’m not saying your sister has to take the other one in but damn. She is trying to leave. Maybe the oldest can have some Compassion and encourage your other sister to make a fresh start with your parents. \n\nIt’s just so sad to hear all the people here just assume because she went back she’ll never leave for good.", "NTA. I'd do the exact same in your situation. Family takes care of one another. To let a sister be homeless or stay with a physically abusive partner... unfathomable. Hope she lands on her feet.", "Agreed. It's sounds like the middle sister hasn't even taken responsibility for her actions before and your eldest sister was severely burnt by her behaviour. I'm not saying your middle sister should be abandoned but she can move back home with your parents, get a new job and start completely fresh. Your eldest sister is protecting her family and life she worked hard for. YTA.", "Fool me once, shame on you. Fool me twice, shame on me.", "This. OP, I had a sister who had a child with a man who ended up to be a monster. The way he treated her and that baby was... awful. (He wanted the baby to love him and only him, so he'd give her a bottle before it was time to nurse. Then, when the baby wouldn't nurse, he'd tell his wife the baby just hated her, etc.) We all rallied around her and helped a ton. My mom was there for 60+ hours a week. We were all waiting for her to recover enough, and for the baby to be old enough, that she would leave. After a year, they went to therapy, and he swore up and down he'd do better \"next time\" and wanted to prove it to her. We all told her not to do it, so they decided to have another kid. After that kid, things were even worse, but we barely helped. She didn't know the first time, but she certainly knew the second time what she was getting into.\n\nYour sister stepped up the first time and got burned for it. Why would she step up another time? Maybe YOU and your family can get together to help her afford a place there. And then if she goes back to him, you guys will be screwed instead of your sister.", "She’s better off as far away as possible. A gated community is not as safe as she thinks it is", "Yeah, the sister literally put her family's safety at risk over her abusive ex, then went back to him. Sadly, chances are the sister will do the same thing again unless she gets the professional help she desperately needs. It's unreasonable and unfair to expect her to do this again.\n\nThe obvious solution is for her to go back to her parents, where she can easily get a new job. And they need to make sure she gets professional help to prevent this cycle from continuing (which it will if she doesn't get the help she clearly needs).\n\nYTA Your sister's right, OP. It is naive to think this is an easy solution to a complex problem, and your sister has a family to keep safe. Her sister should *not* be her responsibility.", "My parents live in another state and want her to come live with them but she doesn’t want to move. I live across the country and am going to college.", "Apparently OPs parents offered for her sister to move in with them, but she said no", "My parents offered, she doesn’t want to move", "You can vote that OP is the asshole but “already shown her colors”? Most abused women will go back to their abusers multiple times before finally breaking away from them. It’s a trauma response, not a “true colors” thing.", "Did", "This exactly! It will be easier for the middle to run back to her abuser if she is only 45 minutes away. If she is serious about getting out she would gladly jump at the chance of moving 6 hours away from him. OP wasn’t there to see all the BS her oldest sister had to put up with the first time around.", "But middle sister doesn’t wanna move back with her parents, don’t you see how hard that’d be for her? /S", "Yes.", "OP should have written that first paragraph in green to match the jealousy.", "Redditors tend to vote against the \"golden child\" in other AITA situations, so I think OP was trying to bias us from the very beginning. It didn't work.", "They do not even have to leave the gated community, sooner or later middle sister will let her ex in.", "> I'm going to go against the grain and saying NAH.\n\nThe question the OP is asking though, is she the AH for calling her a bitch and heartless for her decision not to help the middle sister.  To me that's not an N A H or even a E S H situation.  Just by calling the older sister and calling her a bitch and heartless is an AH move and trying to put pressure on the sister.", "Do you have any compassion for the oldest sister who probably lives in a gated community to feel safe after her shitty sister gave her address to a violent guy who then broke into her home and started a fight?", "What are you on about? Who has to be homeless? The sister can live with the parents but she does not want to because she wants to stay close to her abuser and put her older sister at risk again.", "She can go stay with her parents, they want to take her in. She just doesn't want to move, which just means repeat shit show from years past. Oldest sister is right to refuse.", "Family takes care of one another? No, nobody is entitled to anything from me just because they’re “family”. Very toxic line of thinking.", "Fool me.. you can't get fooled again.", "She had *another* kid with that man?! Wtf? Is she still with him?", "Def... better off states away.", "Abusive ex has already shown that he is ready and willing to react violently to anyone who stands between him and middle sister. Older sister had already done enough. Time for OP to put themselves in the cross fire or the parents.", "Yeah no, not wanting to move is a weak excuse.", "So instead of asking you older sister to sacrifice her safety AGAIN why don’t you drop of college to move and help her…", "So the real barrier to your middle sister safely getting away is… your middle sister. \n\nThe most dangerous time for an accused partner is when they leave. Moving to a different state is FAR safer for your sister than staying in the same city, working at the same place. \n\nYour elder sister is right, you are looking at this from a point of naïveté. \n\nFirst, your sister is just in plain danger staying in the same city. Not being willing to leave that city makes me wonder if she’s really looking to get away this time. \n\nSecond, if your middle sister’s credit has been destroyed by her husband: goes she eventually going to get her own housing? To rent the home I live in now we had to give our landlords a credit check and prove we make more than 3x or rent. It takes 1-2 years to truly rebuild your credit and chances are that’s how long your middle sister will need to be housed - especially if she doesn’t have a high paying job. \n\nThird, having to give up her job isn’t a great excuse of your parents are willing to help support her long enough for her to find another job. If your middle sister works an office job it’s even possible she could get WFH if she tells her employer the situation. If she works for a chain job she might be able to get a transfer. It’s possible your parents have friends who can help her get a job there. Either way, with basic costs covered by your parents she has time to find another job. \n\nYour sister is in a hard position, but your eldest sibling is correct that middle sister puts her family at risk and doesn’t sound prepared to take the steps really necessary to keep her and her child safe.", "then your parents can move", "Drop out? If protecting your sister is soooo important to you drop out and start again next year. Or tell your middle sister to quit her job. She can find a new one eventually. Your parents actively want to help and she's snubbing her nose at the best option.", "Your sister's other option is a women's shelter for abused women. They will help her, provide a secure and protected living environment, sign her up for any benefits she is qualified for, and help her transition to her own place- unless she decides to return to her abuser again.", "If you're sister were leaving her abuser for good, she'd jump at the chance to leave the state. Big sis is right to say no.", "Then she doesn't want to escape that badly does she?", "Your sister has been given the opportunity to move in with your parents while getting further away from her abuser. If she chooses not to take it that is on her and her only. Your other sister already put her family at risk to help once and it got thrown in her face. YTA for what you said to her, it’s quite interesting that you call her judgmental while judging her…", "You need to look at this rationally. Your sister's abusive ex attacked your elder sister's husband after both took her in the first time, and the reason your elder sister is being told to take middle sister in is because 'she doesn't want to move' (that's a weak excuse)...\n\nI understand you love middle sister, but your elder sister has every right to be furious after she already tried to help once and her husband was attacked and there is a very weak reason for her to take your sister in (her not wanting to move).", "\"Using last time as an excuse\"... Yeah funnily enough it's an extremely valid excuse given the dumpster fire that it turned into. YTA.", "Girl then mind your business", "If you care so much about middle sister, why don't you change schools closer to her and find a place together.....oh wait, that would mean you would actually have to get of your high horse and actually do something instead.", "How is she not the AH for not wanting to move in with your parents. She’s a single mother with no money,\nNo job, and an abusive ex. Doesn’t surprise me she wants to move into the oldests gated community.", "She is trying to escape her abusive ex. Moving away shouldn't be a reason not to go.", "This makes OP even more TA. Smh, people.", "If your middle sister was genuinely committed to getting out of there, having to move to another state would be no issue.", "Well shock me - another shitty choice by your sister.", "Beggars can’t be choosers", "So she has options, she’s just refusing to take any of them besides begging the one person she already screwed over and put in danger the last time this scenario played out. Your older sister is not the unreasonable one here, and you are certainly not in any position to be tossing out insults and being so rude to her.", "So the situation is so bad that everyone wants to inconvenience your oldest sister,  but your middle sister can't be bothered to move to get away? Your oldest sister is completely right in refusing to get involved.  If she was really committed to getting away from the boyfriend she'd do whatever she had to do.", "If your sister was a decent mother that is desperate to get her and her child away from an abusive man, she would be doing anything she can, even if it means moving in with her parents in a different state. \n\nWhy doesn’t she want to move that far away, is it because she might want to go back to her ex and being in a different state makes it difficult?", "Then she doesn't REALLY want help....", "Another crap desicion by your sister - Pikachu shock face", "Then that’s her fault. She burnt her bridges with your other sister.", "Tough shit then. This doesn’t give you or your parents the right to burden your older sister again. Who you seem very jealous of, by the way.", "I know it’s a trauma response my true colors statement was to the fact that sister invited the ex to her sisters home once already and it didn’t go well at all to the point that the police got involved and that she needs to protect her own family since the middle one didn’t think clearly on what she was doing. I could have used a different line", "I kinda agree but it’s understandable if she really is the golden child. My point is that regardless if she is the golden child or not she is not required to take the middle sister in, it’s a beside the point point.", "Lol doesn’t look like anyone fell for it 🤣", "Thanks for pointing that out. Because I think I lost that perspective too. Yes the youngest sister should not have called and bitched out the oldest one. But I do think the whole family needs help with this situation.", "yes I do. That’s why I said maybe she could encourage her sister to go move with her parents. I guess I should’ve specifically said instead of taking her in.", "That’s a deep cut to a more simpler time.", "Dubya!", "Is that you, George?", "Yeah, I certainly didn't mean it lightly when I said she put her family's safety at risk once already. And that didn't go over well. I have no faith in the abusive ex, but I also don't have any faith in the sister either. If she'd go back to him after the first incident, and all the abuse she already had suffered at that point, what would be different this time?\n\nEven if the sister was willing to take her back again, I also think it's a terrible idea. She should be with the parents, and they're far removed from the ex, so how is this not the obvious answer? Why on earth do the parents feel comfortable with their daughter being in such close proximity to this guy when she clearly can't be trusted not to keep both herself and her child safe from him? \n\nAnd a gated community is not going to prevent an unstable, violent guy like this from finding a way to get to the sister. It's absurd to think it would be enough to keep her safe.", "Also because she probably does not want to move so her abusive boyfriend is close by so she can go back to him because this time he really really changed...", "Moving would be the best thing to get away from the abusive ex.", "That sounds like a great idea. Maybe OP can be the live-in babysitter and the parents can pay for it.", "My eldest sister lives in a gated community that makes her living situation safer than anyone elses. She also has a guest bedroom (I know I use to visit) so she has the space. She’s just using the last time as an excuse. People make mistakes and she always judges them harshly for it.", "Right? It would be a bonus.", "Bingo!", "OP does not sound like a fair judge of her sister (or reality), so I will take that with a grain of salt.", "> But I do think the whole family needs help with this situation.\n\nYou're not wrong with that assessment.  Personally I'd like to think the older sister would probably help with almost anything - except opening her home again to the middle sister...", "Explain to her why she doesn’t want to take her in again. Instead of just ignoring her phone calls when she’s obviously in distress.", "It was actually a smart flub on his part.\n\n\nOtherwise the Press would have had a sound bite of the then-current president of the United States saying, \"shame on me\".", "Exactly!  Honestly, the best possible thing, even better than moving in with older sister, would be to cut ties with that area and move in with the parents in a different state.  Your middle sister is in a never ending abuse cycle, and breaking that with distance would be great.", "YTA she tried to help. Her partner was assaulted and the police were called. You sound jealous of your oldest sister. If your middle sister is that desperate then putting 6 hours between her and the ex is probably a good idea.", "I mean it’s not your eldest sisters’ cross to bear though. Your middle sister should just move back to your parents.", "You're a silly child and an AH to your. Wouldn't be surprised if she went NC with you because you're judgemental with the whole \"golden child\" spiel.", "Yeah and your sister probably felt safe in her old home until your other sisters ex ruined it", "So you are actually acknowledging that taking her sister in would put your oldest sister in danger (again..) and are still wondering why she does not want to do it again?", "You say your sister \"finally made the decision to leave\" but you're conveniently ignoring that she *did* try to do that once and went to your eldest sister only to call her abusor and give him your eldest sister's address. Why on earth should your older sister trust that this time is going to be different? \n\nDo you realize how terrifying it must have been for her to have an abusive man try to break into her home and live with the knowledge that he could try it again since he knew where she lived? I bet that's why she moved to a gated community. Which, just bc it is safer, doesn't mean the bf couldn't try something and succeed. \n\nWhat if your sister invited him in-gave him the gate code and everything? Where's the safety then? And it sounds like your oldest sister might have children of her own now, in which case she'd be a bad mother if she ever knowingly put her kids in a dangerous situation. And I'm sorry that you don't want to admit it, but your oldest sister has every reason not to trust her sister after the shit she put her through last time.", "She might have the space but she is not obligated to  give it an unstable sister and neither is she an ah for that. Middle sister can take responsibility for herself.", "Yeah, it’s safe until your other sister calls her abusive ex (you know, LIKE SHE DID LAST TIME) and then it’s not safe anymore.", ">My eldest sister lives in a gated community that makes her living situation safer than anyone elses. \n\nYeah, until your middle sister lets her ex in to the house. That's what happened last time, right?\n\n>It was extremely shitty to say \n\nNo, it was the truth. \n\nYTA and yes, you are a naive kid.\n\nYour middle sister doesn't want to move back to your parents because it's in a different state? Lol pathetic.", "Info:  other than you being in college, why aren’t you finding your sisters move?  You can fly out to help your sister move and fund her life until she gets in her feet. \n\nIf you are going to demand your older sister sacrifice, why exactly would you think you don’t need to make any sacrifices?  You could always drop out of school work a full time job to help your sister. \n\nOr could you at least list all of the things that you have personally done to help your sister get out of her situation?", "It’s not, though. The safest thing to do is create distance. Like… maybe six hours away??", "YTA! \n\nYour older sister has tried and got shot in the foot by the middle sister and it was the only chance the middle sister had and she blew it! If you and your parents really want to help then get the middle sister out yourselves by moving her into a different state.\n\nGated communities are safer but not if someone that you don’t want to come to the house decides to come to the house.", "It’s great that you want to help your sister, really it is! But statistically speaking, it takes women 7 attempts to leave an abusive partner. Your middle sister has already given her abusive ex your older sister address once. It’s incredibly sad, but she’s likely to do it again. And you cannot blame your older sister for not wanting an abusive man to potentially break into her home AGAIN. You should be focusing on trying to get middle sister to go back to your parents. Six hours separation from the dude would probably be good for her.", "Your middle sister is refusing to move out of state for her safety. She is choosing to stay in a bad situation. She screwed your older sister over before. Older sister owes her nothing.", "You're incredibly cruel and entitled here. Your eldest sister's partner was attacked by this abusive boyfriend, just maybe he doesn't want to risk his life and family's life again.", "Your eldest sister and her family have already been traumatized. Why should she expose her family to risk if you other sister will just go back? You already know she will. If she wasn't at least thinking about it, staying with your parents would be an option. She can get a new job. She just doesn't want to be 6 hours away from him. She is convinced if she moves out, he will change. Probably because he changed last time....for awhile. \n\nYou think living in a gated community means they will have protection. Do you hear yourself? You even think they will be at risk and you think the gated community will save them. It won't.\n\nYta", "You and your family are abusive, if I was your eldest sister I wouldn't ever talk to you again. People make mistakes yes but you're literally asking your sister to put her family at risk just because the problem sister doesn't want to fucking move", "The last time *isn't* an excuse. Your middle sister made poor decisions that negatively affected the eldest. Your sister is protecting herself from that happening again.\n\nIt's unfortunate, but it usually takes multiple times to finally escape from abusive relationships. Your older sister doesn't want to (and shouldn't have to) deal with the fallout when your middle sister goes back to her abuser. It's a slap in the face for all the help she's given her.", "Yeah her sister used and almost put her husband in the hospital, how dare she not want to go through something like that again\n\nBtw: just cause she put an effort doesn't mean she was the golden child, without any examples you just come across as jealous.", "HER FAMILY GOT ATTACKED AND THE POLICE WERE CALLED!\n\nWhy can't you get that through your head?", "Of course she’s using last time as a reason to say no. She isn’t obliged to expose her family to danger just because your sister makes bad decisions.", "Friend, when \"the last time\" involved cops it's not harsh to never set yourself up for \"next time\"\n\nYou suck, YTA", "Perfect example of no good deed goes unpunished.", "she helped once and it ended with not only her partner getting attacked and cops involved but also she went back to him.\n\nthere is no guarantee it wont end the same again if not worse. at whay point its justifiable by your standards that she protects herself and her partner?\n\nyour parents also offered her to come to them but she chose not to. if her priority is escaping then your parents should be a better choice due to distance.  or you can help her this time.", "You are a classic enabler. Your eldest sister owes your middle sister nothing- she has previously tried to help her and ended up with a violent situation in her own home. She is under zero obligation to take in a sister who has made shitty life choices, or you, or your parents. If you or your parents want to help so much then you should step up to the plate and help. Your middle sister does not want to move because she wants to be near to her abuser so she can return to him.", "It’s a safe/gated community until your middle sister gives the location and grants her abuser access. YTA for blaming all of this on your older sister. I feel terrible for your middle sister but if she isn’t ready to break the cycle of violence then sending her back to people who tried to help and had a physical altercation with the abuser is very dangerous.\nEdit: spelling", "So eldest sister should let middle sister move in, so that middle sister can give out the code to the gate to her ex?  Middle sister is going to relapse.  The fact that you aren’t supporting middle sister simply moving to your parents’ house is harmful to middle sister’s chances of getting away, because the temptation will be too close if she lives in eldest sister’s house.", "YTA. The worst kind. You're dumping the responsibility to your eldest sister when your middle sis have the option to move back with your parents.\n\n\nPutting 6 hours between her and her abuser should be the option she prioritizes if she truly wants out.\n\nMiddle sis burned eldest sis before.\n\n\nNot only are you dictating what your eldest sis should do, you're also disregarding her husband's say in his home.\n\n\nDo you expect him to just accept your middle sis again after what happened before? Cops were involved. You weren't there. Yet you're taking middle sis words over theirs, when middle sis went back to her abuser ex. How would you know she's just not making excuses for him because she's fooled herself to thinking he has changed?\n\n\n\nYour parents are offering help. Your middle sis should take it if she's serious about leaving. There's no reason for her to stay with her abuser when there's a home waiting for her and her kid.", "So what's the name of this cult you're in?", "Lol that’s not an excuse. When/if you have a family you will understand that their safety comes first. Listen me and my family are the closest you can really be. If any of them pulled this shit I would have cut contact with them.", "Do you hear yourself?", "What's to stop your fav sister from going back to this man? Her best shot is to move to a different state, which it looks like she doesn't want to do probably because she might want to go back. Why do you want your older sister to put her family in danger for the sake of someone like that? Why are you so heartless and incredibly jealous. If you really wanted to help, you'd convince your problem sister to move states.\n\n\nEdit forgot to add YTA", "She tried to help and it nearly got her BF hurt! Even if oldest sis does have the space, middle sis isn’t entitled to it. Also, being in a gated community doesn’t mean it’s safe. You’d be surprised what can go down in these.", "HUGE YTA after this response. So entitled and just plain out wrong", "Easy to say when YOU weren’t the one actually helping in that situation, and didn’t have to live through the trauma that your eldest sister and her boyfriend went through! It’s super easy to volunteer someone else for the hard stuff. Grow up, YTA.", "A gated community means nothing unless they never plan on leaving it. The boyfriend has shown he will come to wherever she is. All it takes is your sister wanting to make up with him to open the gate. Or for someone to go grocery shopping and he follows them. Has your sister even apologized for how things went the last time she was at her older sister's house? Why won't she move back home if she's serious about leaving?", "You don’t get to put other people’s lives and property at risk, you’ve got no skin in the game. You’re observing from a safe distance, making high and mighty judgements. How dare you minimize someone else’s trauma and the danger they’ll be in!\n\nYTA! Butt out!", "You’re the one who’s being judgmental here. Your middle sister consistently screws up and brings danger and drama to others. So respect your smart older sister’s correct decision and YOU take in the troublemaker. You don’t get to dictate anything to your older sister. YTA", "This is true lol", "She gave her violent ex her sisters address, violent ex broke in, the police came and then she lied and said her sister\\`s boyfriend started a fight. If she needs an explanation why her older sister does not want a repeat performance of that, then I am pretty sure she is not capable of understanding the explanation.", "That the sister would rather stay with the abuser than move away from him shows that this seperation attempt has failed before it even started.", "Yeah. The whole spiel about her being a golden child was completely irrelevant to the story and honestly it sounds like the eldest sister has worked incredibly hard to make a good life for herself. She helped before and got burnt!", "I agree. You'd think she would want to get as far away from the guy as possible.", "There is a reason that the eldest sister moved into a gated community. Safety & security is probably top of that list... I wonder why the eldest sister needs to live in a gated community to feel safe... There must have been something in the eldest sisters past that made her feel unsafe in her home.\n\n&#x200B;\n\nIt's a mystery we will never solve /s", "And it has zero additional safety if the sister gives the guy the address again and lets him in.", "You are entitled to your opinion. And I am entitled to mine. The good thing is that neither one of us are in this position. Have a nice day.", "Getting that whole toxic dependency vibe from\nOP and her family. Eldest sister peaced tf out of that environment and now her family is mad.", "Yep we now know who OP is jealous of", "Bruh what part of that rebuttal do you not get?"]}