{"id": 8099, "submission_id": "10jrd3h", "title": "AITA for my reaction to what my daughter did with her ferret?", "selftext": "I (29f) have a (7f) daughter who we will call Nina. I also have a (36m) bf who we will call Kyle.\n\nKyle and I have been dating for two months, and things have been going smoothly.\n\nNina loves animals. She wanted a kitten, but I thought it would be too much work for a girl her age, and we got her a ferret for her birthday instead. She was ecstatic and keeps him in a crate at night and takes him out to play through-out the day. She named him Peanut-Butter and it was so adorable (he was a white ferret with some caramel coloring so he really did look like he was dipped in peanutbuter!).\n\nOkay so here's the problem. Kyle hates ferrets and weasels and pretty much most small animals. When he first started coming over, he was hesitant to even go in Nina's room knowing Peanut-Butter was there. He still tried his best though, despite his phobia.\n\nI told Nina to stay in her room because Kyle was coming over and I wanted to spend time with him. She argued with me because she said she wanted to play with Kyle too. I told her no, it was getting late (it was already 6:30) and he was probably too tired to play and just wanted to relax. She agreed.\n\nI was in my room watching TV, when I hear screaming and then crying coming from the living room. I run to the living room, and Kyle is freaking out, and Nina is trying to run outside past him.\n\nI yell at her and ask what the actual hell is going on, and Kyle tells me he opened the door, and Nina answered, and put Peanut-Butter on him. He freaked out, grabbed Peanut-Butter, and threw him off of him, and he landed on the steps outside. Peanut-Butter supposedly started running away, and Nina wanted to chase after him.\n\nI was livid. She knew I had a hard day and wanted to spend time with Kyle, and she used his fears against him. He didn't even wanted stay over after that. So now she lost her pet. and I lost my night with him.\n\nI grounded Nina for not listening to me, and she cried. She's been in her room all day grieving her pet, but if she hadn't put Kyle and Peanut-Butter in an unsafe situation, this wouldn't have happened.\n\nWhen Nina went to her dad's house, Nina told him what happened and he yelled at me over the phone, saying she's heartbroken and told me to have a heart.\n\nI don't know what to say though. It was the consequences of her own actions imo. So AITA?", "created_utc": 1674517489, "permalink": "/r/AmItheAsshole/comments/10jrd3h/aita_for_my_reaction_to_what_my_daughter_did_with/", "score": 228, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I grounded my daughter because she hurt my bf 2. I might be ta because she's really hurting already\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Holy crap. You’re locking your 7yo daughter in her room so you can “have quality time” with your brand new boyfriend?? That’s way worse to me than your complete lack of common sense in getting your daughter a ferret. I hope your kid’s dad gets full-time custody because you’re going to do your daughter some real harm. Do you even like her?", "YTA, if you don't want a child let her stay at her fathers. \nSecondly, your BF has no business, knowing your daughter after two months. Third, you are not able to take care of a child or pet. \nGuess what, 7 year old children forgett things. And you should have been to open the door. Not your child.", "YTA in so many ways I am losing count! You daughter is 7 & shouldn’t be answering the door at all, she shouldn’t be expected to stay on her room while you have a date, she is your CHILD not your roommate. Her pet escaped & you didn’t even look for it?? WTF is wrong with you? You are more worried about not shacking up than the safe being of a live animal!", "Good job OP. You've managed to spin a story where you traumatized your daughter into a \"woe is me\" piece. \n\n**SHE'S 7!** She just lost her pet and is obviously distraught but you're more concerned that you couldn't spend time with your boyfriend?! \n\nYou try to blame her for putting the ferret on him but you've only known this guy or 2 months why the hell is your 7 year old daughter even the one answering the door when you knew he was coming over?! Not to mention if his phobia is that extreme why is he even coming to your house in the first place, when (once again) you've only been dating for 2 months?!\n\nOP there is absolutely no redeeming aspect to this, YTA here.", "YTA.  You seem to care more about Kyle than your daughter.  First, I'm side-eyeing the fact that you've only been dating 2 months, and you already introduced him to your kid?  Also, you thought a ferret would be less work than a cat?  Ferrets are a TON of work, if you taking good care of them.  Next, you banish your daughter to her room so that you can spend time with your boyfriend.  Then, you yell at her for acting like a typical 7 year old.  Kids that age aren't known for seeing their actions all the way through to the potential consequences.  And her losing her pet is way worse than you losing your night with your boyfriend.  So YTA for being a pretty bad parent.", "YTA.\nA cat is not more work than a ferret and maybe you should date someone who isn’t terrified of the one you got your daughter. \nAnd then to be more upset about your date than your daughters grief? Definitely YTA", "YTA, my GOD YTA.\n\nYou informed your daughter that she is no better than a bad smell and should hide away in her room, while making quite certain that she knows well and good that your boyfriend of two months takes priority over her. \n\nAnd now, she is also very painfully aware that your boyfriend's immature and irrational behavior of THROWING A LIVING THING - a beloved pet - outside and down some steps is a perfectly appropriate response to what in her mind was a small prank. Instead of helping her find her beloved pet, you blamed her for your boyfriend's response, and accused a SEVEN YEAR OLD of doing something vindictive and calculated against him. What the actual fuck, lady?", "YTA you're putting a 7 yo in bed at 630 for some dick. Get it together", "YTA. I can't figure out if there were any adults in the post, because it certainly didn't seem like it.\n\n I'll echo your lack of parenting skills as well. Locking up your kid at dinner time so you can hang out with your boyfriend of 2 months?!?! Most mature parents don't even consider bringing their significant other around the kids until the relationship is real and established.  I'd recommend you reassess your priorities, because as you showed us, they're a mess.  Plus, an innocent animal is likely dead because of your atrocious decision making abilities.", "YTA - please tell me where around where you live so myself or my other ferret loving people can go find that poor baby.", "so you decided to ignore your 7YO daughter to hang out with your boyfriend of 2 months? and getting her a ferret instead of a cat doesn’t make sense because ferrets require more care. YTA", "YTA.\n\nYou've been dating a guy 2 months and he's already around your house with your 7 year old daughter, who you tell to stay in her room so you can have quality time?\n\nHoly crap, lady.", "YTA - to literally everyone else in this story.\n\nYou're a shitty parent for locking your kid in her room so you could hang with your boyfriend AND for thinking a ferret was less work than a kitten.\n\nYou're a shitty SO for not getting a babysitter and having your date elsewhere.\n\nYou're a shitty pet owner for not immediately helping your kid look for the ferret. ETA that you're also a shitty person for thinking that a book for kids is adequate research for taking care of a pet for life. \n\nAlso, you're a shitty PERSON for how you wrote all of this story and tried to make yourself feel better.", "YTA. \n\nFor so many reasons.", "YTA. Way to make your daughter feel like she's not important. Way to go, Mom.", "Yta, you shouldn't even be letting a man you've been dating for 2 months around your daughter. From your comments you sound like a pretty crappy mum and your daughter would be better off living with her dad.", "You introduced your daughter after only dating for 2 months..? Please tell me you’ve known him longer than 2 months.", "YTA!!!! Woo big AH, for one your daughter is 7, she acted like a 7 year old. But more importantly you’re letting a man you barely started to date meet your daughter come into your house with her there and from the sounds of it would let him go into your daughters room alone with her if she wasn’t scared of the ferret. I hate to break it but that’s how SA happens", "YTA. Please let this be fake. That poor little animal and your poor daughter. All so you could get laid? Freaking gross", "YTA for acting like your daughter is a roommate… you told your own daughter to leave you alone and stay in her room so you could have bf time. Lady…. That’s wrong.", "YTA- you gave your SEVEN year old a FERRET when a CAT would be \"too much\"?! Play stupid games win stupid prizes I guess, it's just unfortunate an animal had to suffer because of your ignorance and poor handling of the situation. Your boyfriend is an adult and should have been more in control of himself, and you're an AH for putting quality time with your boyfriend of only two freaking months over your child and YOUR pet's safety (yes! It's your freaking pet! You are the adult who purchased it!!!)", "YTA. Your daughter is 7 and should not be shuffled off to another room for a new boyfriend. \n\nPlus, ferrets are way more work than a kitten. More research should be done before selecting your next pet. \n\nThink carefully before introducing your daughter to new boyfriends. It's probably best to wait until you are seriously comsidering marriage before introducing them, and reassure your daughter constantly of your love for her.", "YTA!\n\n1. Ferrets are definitely more work than kittens.\n2. Your bf of 2 months shouldn't be meeting your kid yet and definitely SHOULD be hesitant about going in her room!\n3. You can't just crate your 7 year old because you want to pretend to be a carefree college kid on date night.", "YTA for getting a 7 y/o a ferret. Like dude if she isn’t mature enough for a cat why on earth would you get a ferret?", "YTA just for the “and I lost my night with him” comment. Ferrets are far more difficult than cats btw.", "YTA for prioritising your bf over your daughter.\nFirstly you shut her in her room for the night so you could hang out with your bf.\nThen her pet got out, and instead of helping her go and find him you got angry and grounded her.\nSure it’s partially her fault that her pet got out but she’s 7.", "Yta you have been dating two months. He shouldn't be  meeting Nina if she is you priority", "YTA for so many reasons, you are angry because you didn’t get some action in your hard hard day??? She’s 7, you are the adult, also how is a ferret less work that a cat? You can’t even make some research beforehand????", "What the fuck is wrong with you?", "Congratulations. You have:\n\n1) traumatized your daughter by causing her to lose her pet whom she is very close to \n2) taught your daughter that she doesn't matter and your various boyfriends are more important than her \n3) left an innocent DOMESTICATED animal to be ripped apart by predators. It is DOMESTICATED. It will not be \"fine\" as you said in one comment. \n4) permanently damaged your relationship with her\n\nThere are MANY other ways to punish her than letting her pet be k*lled. Do your best to find the ferret, apologize to your daughter, and then have a conversation about respecting boundaries in an age-appropriate way.\n\nYTA YTA YTA", "YTA \n\nI feel so sorry for your daughter. It's very clear what your priorities are, it's a shame your daughter isn't one. You expected a seven year old to stay in her room all evening and night, so you could spend time with your boyfriend? Do you not see the problem with that? \n\n So now she lost her pet. and I lost my night with him\n\nDo you think these two things are somehow equivalent? Your daughter lost a pet she clearly loved and adored, you missed out on a single night with what could be a temporary partner anyway. Have some empathy. Your daughter might only be a child, but she is still a human being with FEELINGS. She's a little girl who made a mistake, I think the loss of her pet was enough. Do you expect your child to bend to your will her whole life?", "YTA. First your daughter is 7.  In her world the only people with fears are kids, adults are fearless.  So expecting a 7 year old to truly understand phobias is expecting too much.\n\nBut the real reasons YTA are you clearly didn't research ferrets. They are a lot more work than cats not less if properly cared for.  And the worst part is banishing your kid to her room because you wanted time alone with your bf?  It is her home and she hadn't done anything wrong at the time you banished her.  Wait until shes in bed or get a babysitter when you want time alone with him.  Why are you even introducing him to your kid after only a couple of months?\n\nEdit: sp", "YTA.  While it wasn’t her best move to put her ferret on your BF, him throwing it outside is not acceptable.  Did you help to look for her pet or just yell at her for upsetting your squeeze?  Your child should ALWAYS be your main priority and you put someone else before her.  Shame on you.", "YTA you're an awful person and mother.. feel terrible for your daughter ...sounds like she has a good dad tho!", " You are a selfish ass.", "You gave your 7 year old an exotic pet when you thought a CAT was too much?\n\nYou're definitely an asshole.", "YTA. Your daughter has lost her pet. The pet you decided on because you thought a kitten was too much for her. You lost one night with your boyfriend. Once again she’s 7, a little girl. You essentially punished her because of your boyfriend’s phobia. Did you know about his phobia before you bought the ferret? Does your daughter even understand his phobia?", "YTA\n\n“She knew I had a hard day and wanted to spend it with Kyle, and she used his fears against him.” \n\nYou’re overestimating the maturity of your 7 year old, and you sound more like an older sister than a mom. Grow up. \n\nShe didn’t want to be alone, clearly. You can’t hide her away when you don’t feel like being a parent. She is 7, not your room mate. She doesn’t understand “mommy had a rough day and wants to be with someone other than me.” That’s messed up.\n\nAnd she didn’t use Kyle’s fears against him, either. She probably just doesn’t understand how she can like Kyle and she can like peanut butter, so she thinks maybe he just needs to give peanut butter a chance. 7 year olds are NOT that smart. They make many bad decisions, but that shouldn’t turn into a snowball of pain because you’re selfish. \n\nYOU should have helped her look for the ferret. That’s a living being out there. This will traumatize her, and you just forced her to be stuck in her room alone AGAIN instead of allowing her to look for her pet. So she’s just sitting there wondering where peanut butter is… while you pout about Kyle. \n\nI feel sorry for your daughter. I hope her dad sees your post and the whole story about your selfishness and your own immaturity\n\nLastly, it is pretty gross to have a brand new partner around your kid in her home. Please consider how many relationships people go through in their lifetime, especially the short relationships that don’t last. Now imagine your daughter meeting them all because you thought this one was different, that one was different, this was me is the one, no THIS one is the one. Don’t do that to her. Take it slow, keep her separate from new people for a while. \n\n.", " YTA on many counts. \n\nFirst of all, a ferret is much higher maintenance than a cat. I’ve had both of them. And kids. \n\nSecond, you seriously asked your 7 years old daughter to spend the whole evening in her room so you could cuddle your boyfriend? WTF is wrong with you? \n\nThird: she is 7. She is 7. She likely can’t regulate her emotions well right now. \n\nYou have put way to much burden on your daughter, and made her feel like she is the burden.", "Tbh I feel like YTA just for the poor judgement that somehow a ferret is less work than a kitten. Cats are pretty famously very independent animals. Give them food, water, some cat toys, a litter tray and they’re basically fine (I’m not suggesting that there aren’t other factors to consider- I’m just giving the basics).\n\nI don’t think it’s fair to leave the safeguarding of an adults phobias in the hands of a 7 year old. I can’t tell if you were with Kyle before or after you got the ferret, but ultimately this is a situation YOU created and you need to take responsibility for that.", "Did you even look for the poor ferret? YTA YTA YTA.", "YTA\nA 6 year old isn't old enough for sole responsibility of a pet, silly. The dynamic with the boyfriend is weird af too.", "you’re a terrible mother. you want to be with that man SOOO BAD. you’re neglecting your child just to do it ? why’d you even have a kid ?", "YTA from the beginning. In what universe are ferrets less work than cats? You got your daughter a pet that you wanted. You also picked an animal your bf wasn't okay with. Then you got mad at a seven year old girl for acting like a seven year old girl. You need to do a lot of work on self awareness, and probably need professional help with that.", "YTA  so unfortunate you missed your night with your new boyfriend. (Sarcasm)", "YTA it’s your child’s home and you allowed her the pet. She’s 7. Kids can have empathy but do you really think she fully understands your hard day and your need to hang out with your boyfriend instead of her?", "Your child is 7. You’ve only been with this dude for 2 months. Why are you prioritizing him over her in her own home? YTA.", "YTA. Stop prioritizing a partner over your child.\nAlso 7 year olds do not have pets.\n\nAnd you now killed that animal.\nGrow up, and do the world a favor, never own another animal.", "YTA big time. Did you just abandon the ferret to the wild? How is it going to survive? Or did the fall kill it? I am horrified.", "YTA major major YTA\n\nFirst the obvious WTF - why would you get a 7-year old a ferret if they aren’t ready for a kitten. Let’s see, buy my daughter a half feral weasel or a domesticated cat? Hmmm 🤔 \n\nI just can’t… OMG. Caring for a ferret is far more difficult than  caring for a cat. And now you’ve illegally released a weasel into your local ecosystem. At least a cat probably knows enough to come home when it’s hungry and *isn’t illegal to let outside*\n\nNext - your kid is 7 and apparently you think she needs to be more responsible than your 36-year-old BF. If you want alone time with Kyle and he’s afraid of pets, spend it in your room. Or outside the house. Or tell him to man up and grow a pair already. \n\nNope, you decide to make your 7-year old the responsible adult. \n\nWell congratulations, this one broke my brain. I have just lost all hope in people being responsible parents.", "YTA - ferrets are harder work than dogs and cats WTF!!!! ALSO your daughter just lost her pet and you grounded her??? She's a kid, keep a better eye on your child", "YTA.\n\nShe's a 7 year old child who loves her pet dearly and likely doesn't truly understand why other people wouldn't also love her pet.\n\nYou're a 29 year old mother who has already introduced her 7 year old child to a boyfriend of only two months (hope you're saving up for those therapy bills after she has trouble forming healthy attachments) and having him stay overnight and are punishing your kid because you didn't get to bone your boyfriend.\n\nIt's not even a contest who is the TA in this situation.", "She's 7\nCan i say again She's 7!\nShe wasn't being spiteful. she was excited about a pet she loves and doesn’t understand that people can be scared of animals. \nAlso, you told she was to stay in her room while your boyfriend was over. She's not a toy you put away when you have other things to do\nYTA and this memory will NEVER go away", "YTA--your child is SEVEN YEARS OLD. That's old enough for rules and consequences, but it's definitely not old enough to always calibrate those correctly. You should have helped her find her pet, then given her a very long talk about how scaring people isn't funny. Instead you got angry that your date night was interrupted by your kid, who you previously intended to leave confined to her room all night. You also let down your responsibility to Peanut Butter; a seven year old cannot care for a pet alone, so that made his health and welfare your duty as well as hers. \n\nIf Kyle has any sense, his departure didn't have as much to do with the ferret as it had to do with your actions.", "YTA. You’re a terrible parent, and an animal may be dead because of your idiot boyfriend. Both of you are toxic jerks.", "YTA.  You have a 7 year old who acted like a 7 year old. Your actions are better suited to a teenager than an adult. Forcing a kid to stay in their room because you don't want them around isn't okay. You need to put your kid first, not some guy you've only known for a few months.", "YTA for putting two month old dick over your 7 year old, what in the actual fuck", "FFS. I don’t even know where to start. You are fucking horrible. For so many reasons. Just awful. \n\nYTA", "YTA, and honestly, kind of a terrible mother in this scenario.\n\nYour daughter is **seven years old.** Your boyfriend is presumably **a fully grown adult.** You told your incredibly young child to stay in her room so you could spend time with your boyfriend alone. Your child just wanted to have time with both you and your boyfriend, and you instead wanted her to lock herself up in a room so you could ignore her. That's shitty parenting decision #1 here.\n\nThen, when your fully-grown boyfriend threw your daughter's pet, which could have severely injured or even killed that pet, you scolded your daughter instead of helping her go look for her (likely severely injured) pet. Why? **Because she interrupted your fucking date night.** That's shitty parenting decision #2-100.\n\nWhat - and I cannot stress this enough - the fuck were you thinking?\n\nYour daughter deserves better. At least her father gives a shit about her, because you clearly don't.", "YTA—You’re prioritizing some dude that you’ve been banging for 2 months over your SEVEN YEAR OLD CHILD! \n\nMy heart is breaking for your precious daughter. Your child shouldn’t ever have to give one single thought to her mum getting some action. This is so disgusting. \n\nBTW, why would Kyle ever go into your child’s room? Why is that even an option?", "YTA and in my opinion, hugely  so. \n\n1. Ferrets are way more work than kittens. How could you not know this?\n\n2. You basically SHUT YOUR DAUGHTER IN HER ROOM so you could have a booty call with your boyfriend. Stellar parenting right there. \n\n3. At the advanced hour of 6:30, you left your seven year old to her own devices so you could rest up before said booty call. Kyle, after two months, apparently has a key to your place and came in. At which point the seven year old acted like a seven year old and showed him her pet. Kyle over reacted and screamed and THREW your daughter’s pet to the floor. Animal abuser much?\n\n4. Instead of giving a crap about a helpless animal, or your daughter, you, annoyed at the “ruin” of your booty call, punished your daughter for “putting Kyle in an unsafe situation.” What, bc the might have gotten ferret cooties?\n\nI’m just… sheesh, lady. Parent of the year you are not.", " YTA You knew your daughter wanted to spend time with you both. You knew Kyle was afraid of ferrets and you let a 7yr old open the front door unsupervised. Now a poor animal is probably dead, your daughter is heartbroken and your boyfriend is traumatized.", "YTA??? In what world is a ferret an easier pet than a cat?? Please do your research, before getting ANY animal, and ESPECIALLY before giving one as a responsibility to a young child that isn’t even over the age of 10 yet!!!\n\nNow a ferret is more than likely dead because of you!\n\nYour daughter did a very mean thing but this is absolutely not on her!\n\nAlso just a side note, you’ve been dating your boyfriend for two months and he’s already actively spending time around your child? There’s a bunch of red flags here, and they’re all from you.", "do you hate your daughter ?", "YTA, good job making sure she knows your boyfriend comes first. She’ll remember that.", "YTA… your 7 year old I feel may take more priority than a dude you’ve been dating for 2 months, and also, a ferret is way more work than a kitten. Also, you seem to be more upset that your grown ass man BF was upset about a pet your daughter has than, idk, your daughter or the defenseless animal that was cast out?!!!!!! Jeez", " YTA- you need to get your head on straight. Your daughter should be your number one priority not your sex thing of 2 months. And how dumb are you to think that a ferret is easier than a cat? Cats are independent unlike ferrets. Plus giving your 7 year old the cold shoulder is ridiculous! That’s emotional abuse because she doesn’t understand why. If you want alone time with your sex toy then do it when she’s not home. When she is home then you’re a mom first.", "YTA SHE’ S A CHILD !! You are a grown woman throwing a little hissyfit bc you couldn’t spend time  with your boyfriend??? Christ, spend some time with your kid and grow up", "INFO, if your daughter goes to her dad's house, why couldn't you spend time with your boyfriend when she wasn't there?", "So your boyfriend KILLED the ferret?  I’d dump him in a heartbeat. Some mom not looking out for your kid and her well being. \n\nYou are a complete and total AH. \n\nWhat to make bets that the kid decides to stay at dads permanently??", "Your daughter is great! That’s funny! YTA big time!", "YTA for prioritizing your night with your bf over your 7 yo daughter, and even though she shouldn’t have done what she did, SHE’S 7. Then instead of comforting her over the loss of her pet, you were just pissed because you missed a night with your bf.", "I’m not here to tell you how to raise your kid. A lot of these folks are right, it seems like you prioritized your bf over your daughter. If she goes and sees her dad on weekends or whatever y’all have set up, maybe wait until then to bring him in. You uninterrupted and can unwind anyway you choose. He can answer the door without a ferret being set on him. \n\nA grown man THREW a ferret? I could understand setting it down or even pushing it off, however, he was cognizant enough to grab it and throw it which means if he had a shred of emotional intelligence, he would have grabbed it and set it down and ran in the other direction if he was that scared. \n\nYour boyfriend is a dipshit for throwing the animal. \nYou need to put your priorities inline.\nYour daughter is going to resent you when she’s older if you don’t make some adjustments.", "Nina might have some jealousy issues if you’re making her stay in her room so you can spend time with your boyfriend instead.", "Sure as shit I’m not rearranging mine or my child’s home to accommodate a bf. “Just hide in your room everytime he comes over” uhhhhh what in the actual fuck? You know there is a ferret in the house sir.", "You prefer getting the D over taking care of your child. You’re a gross person. Your kid comes first always.", "YTA for prioritizing you bf of 2 months over your child and then taking away her pet. At the very least, you should have talked to her about it, maybe asked her why she did it and figure things out together. Did it occur to you that she was acting out because you made her go in her room so you could hang out with your boyfriend? Seriously, think about this. Perhaps if Kyle hates small animals, he's not the man for you since your daughter has a small animal? If you are dating this guy, she just has to stay locked in her room while he's there? What is wrong with you? She knew you had a hard day? Why is that burden on your seven year old daughter? Really think about this OP.", "this is one of those, you can’t be serious!! YTA", "YTA. Your comments... jesus, I hope you don't expect to have contact with your daughter in the future.", "YTA - I hope your ex sees this post and uses it to get full custody", "The way you are speaking about how your child “ruined your night” is concerning. Shutting her in her room so you can have a date night is also concerning. Resenting your kid because you have to be a parent and it interrupts your social life? That’s part of the deal. ESH", "Don’t have anyone stay over while your daughter is there. Especially after only two months. You sound very self centered.", "YTA\n\nFirst for thinking a ferret is going to be easier than a kitten. Also for getting her a pet that your bf is terrified of.\n\n2nd for thinking its ok to confine your child to her bedroom so your boyfriend can watch TV.\n\n3rd for having no idea she's sneaking outside. \n\n4th for punishing her for your incompetence.", "ESH. \n\nFirst of all, I've owned both and a ferret is NOT easier to take care of than a kitten (but they are both great animals).\n\nBut that aside, instead of grounding your daughter, you should be both out looking for the animal, especially if it's winter time there. Ferrets are not really fast runners, and on top of that they are smart, just as intelligent as cats and dogs. Chances are, Peanut-Butter is wandering around nearby, looking for someplace warm.\n\nPut up some flyers in the neighborhood too, it's likely someone else will see it and call.", "YTA.\n\n1st: you banish your kid in her room to spend time with a boyfriend. Who does that? That's nuts. And kinda gross. (said as a mother, here)  \n2nd: you punish the child by releasing an animal outdoors.   \n3rd: boning down your bf was still the missed opportunity for you here.  \nThis is gross, you're being gross.   \nStop it.", "YTA", "YTA and that's all I can say or I'll get banned..you are far worse than an AH", "...so you want to keep your daughter hidden in her room so you can get some dick.\n\nYou didn't even look for the ferret because you're so concerned about getting dick.\n\nYou're upset about not getting dick.\n\nDo you even like your daughter?\n \nWhat your daughter did wasn't great but she is 7. Sounds like you didn't even comfort her or try to find the ferret. Sounds like you were more concerned with getting the guy you've been seeing for 2 months to stay over so you can get some dick.\n\nShows where your prioties lie and its clear that it's not your daughter.\n\nYTA you're a prime example of why some people shouldn't be parents.", "YTA oh my goodness. Consequences of her own actions? She’s SEVEN. Your bf threw her beloved pet and you’re mad at your child? This is beyond the pale.", "YTA. \n\nYou lost me when you said “I told her to stay in her room because Kyle was coming over”. She’s 7. She needs attention and supervision at this age, I can’t blame her for what she did. Next time, don’t have him over when she’s around, or spend time together instead of putting her in her room. She’s a human, not an animal. \n\nAlso, Kyle is an AH to. Who throws a pet like that? Get rid of him, he’s not the one.", "YTA.  This is all on you.  Your 7 year old was playing, alone, while you were in your bedroom.  You knew your bf was coming over, and stayed in your bedroom instead of being up and present while your daughter played.  Great job parenting…. And lose Kyle.  He’s an AH too.", "INFO are you at least a little mad at Kyle for throwing a small living creature? Like I am sure he is afraid but violent outburst because of a 7 year old's ferret prank? Maybe he shouldn't be around kids.", "I feel like putting the ferret on the boyfriend was probably the kid's little 7yo logic way of trying to scare/chase him out of her life, because of how shitty her existence has probably become in the last 2 months with him shoehorning in. It's so bloody heartbreaking.\n\nConsider giving her dad full custody. And don't buy any more animals for crying out loud, you have no idea what you're doing with them.\n\nYTA", ">She knew I had a hard day and wanted to spend time with Kyle, and she used his fears against him. \n\n1. SHE IS SEVEN YEARS OLD stop projecting Machiavellian levels of evil onto your poor, crushed kid. \n2. A ferret is actually a lot more complex pet than a cat and needs stimulation AND they tend to get into things. Not really a pet for a 7 year old. A hamster or guinea pig, sure. \n3. They are also most active and dawn and dusk so it was likely wanting to play around the time you needed to get laid. \n\nYTA. Ooof. Poor kid & poor wild ferret.", "YTA.\n\nShe lost a beloved pet and you lost a single date night.....? How are those even comparable? You put those two things in the same sentence as if they even remotely the same level of loss?\n\nYou punished *her* because a guy you've known for two months abused her pet? And you refused to go look for said pet? You don't deserve children if you're grounding your daughter because you are salty you didn't get the hot date you planned on having. You need to get your priorities straight. You wanted her out of sight and out of mind like a Disney evil step mom. You are absolutely the AH.", "YTA YTA YTA YTA for all of the reasons everyone mentioned. She's heartbroken over her pet. Cut her some slack.", "INFO: what exactly is Nina's dad suggesting you do differently?", "YTA. A little girl acted like a little girl omg!!! Keep your thirst in check why is this man at your house with you child who you banished to her bedroom like the wicked step mother. You sound like the type to put a man over your child then 11 years from now wondering why she goes NC.", "I mean, your daughter is young but should have understood the situation with the ferret... On the other side you seem to be valuing someone you have been with for 2 months. It's a bit of both honestly but when you decide to have a kid that changes a lot... Your priorities have to change.", "YTA and honestly dad needs to move for custody. You put your needs over that of your child, do you think she was trying to spend time with you? My guess reading this, is there is always a boyfriend and that guy always gets the attention. I’d venture to also guess when the relationship goes south you blame her. \n\nYou had a child, guess what that’s a lot more care than any animal you can lock away. Stop being selfish and try to have a real relationship with your child. Then after you mastered that maybe then you will be ready for an adult relationship. Right now I wouldn’t even trust a kitten with you.", "INFO: is this for real lol?", "YTA.\n\nI knew when you said that you got her a ferret, but I kept reading anyway. Seriously if you want to ease your daughter into pets you start with a goldfish.\n\nSecond, did you ever actually try to explain to your daughter that he was scared of ferrets or did you tell her that he doesn’t like them, because kids will more than likely think that someone who doesn’t like something just needs to be around them more.", "YTA she’s a kid, she made a mistake and i don’t understand why you’re making your boyfriends feelings a priorities over hers? And she’s 7, she needs a parent and not being pushed aside in the name of “independence”", "You didn't even attempt to look for the animal?! What is wrong with you?!", "YTA. That’s your kid. You’ve been with him 2 months. Prioritizing a man over your child and telling her to stay in her room so you can have time with him? \n\nYou’re the same age as me, and I have a 3 year old. Grow tf up and learn how to be a parent. Disgusting.", ">She wanted a kitten, but I thought it would be too much work for a girl her age, and we got her a ferret for her birthday instead. \n\nI can't get over this line. Seriously did you do any research at all?", "You shouldn't have had a kid.", "ESH. She’s 7 and 7 yr olds do silly things. Losing a pet is harder than not getting to spend one night with your bf and consequence enough. Also, what was your plan? Are you planning on just dating this dude for a while and breaking up with him, because what would’ve happened to the ferret if y’all decided to move in together? Would Nina and her ferret have to stay in the room all of the time?? Also, a pet ferret is more work than a cat.", "Kyle should grow up. It's not a big deal. He's trying to win you over your own child.", "YTA and don’t get anymore pets if this is how you’re gonna treat them.", "YTA, a ferret as a pet for a 7 year old??? WTF where you thinking?? A hamster would have been more appropriate. And then taking your BF side who went into your 7yo room ( like what was he doing there in the first place knowing dam well there was a ferret there?) while her cherished pet runs away, all thanks to your beloved boyfriends phobia. Do you have any idea of the ANGUISH and needless SUFFERING you caused that poor little girl? Are you that insensitive to your child or just so incredibly desperate to have a man around?", "YTA- im with dad on this one", "YTA and I am just praying this isn’t real. I can’t even stand to read this. You’re a horrible mother to your daughter for this.", "YTA. Is this for real? She's 7! Have some compassion.", "When getting dick is more important than your own child.", "Oh my god, if she was older I am sure she would stay with her father from that point on. CHILDREN COME BEFORE BOYFRIENDS\nMy mum always did stuff like this and it was horrible growing up.\nPoor girl is only 7 and you have no compassion. INDEPENDENCE? What is wrong with you?\nSome people aren’t meant to be parents.", "1) cats are easier than ferrets. \n\n2) you banished your daughter to her room at 6:30 so you could see your boyfriend??\n\n\n3)why did you make her go to her room before he was even there?\n\n\n4) why didn’t you answer the door yourself?\n\n5) you let a living creature run away and probably die, in order to prove the point to your neglected daughter that she deserved to lose her one friend for having the audacity to want attention. \n\nI can’t believe how much of an AH you are, YTA.", "Yta... Holy hell... A ferret... Is less work than a kitten... I'm really trying to wrapy brain around this logic.\n\nFerrets are Hella smart. Take a lot of training to get them well-behaved. Lots of playing with them. Extra deligience with locking cages. They need special paper bedding etc. That wood shit is shit and is terrible for their lungs like I just... How is this less work than getting a kitten a scratcher with some cat nip and a box...\n\nAlso what do you mean she lost her pet bc you lost a night with him?! Did you kill the fucking ferret?! Like... How childish are you with that logic.\n\n\nYou're an awful human being. I really hope your kid goes with her dad permanently he seems the only sensible one around here. \n\nYou have no idea how big of a deal this was do you from your kids perspective and that of peanut butter a living intelligent animal with feelings. \n\nYou just care about dick. \nIohhhmyyyygodddd", "It’s “getting late” at 6:30?!? “Stay in your room”… I’m just waiting to read “No wire hangers!!” YTA, a humongous YTA! \nKyle is also an AH. FFS, seek therapy.", "YTA. \n\nMy goodness. \n\nLet me count the ways:\n\n1. You buy your child a ferret instead of a cat, with no research, because it's smaller so it must be easier (ferrets are \\*NOT\\* less work than cats) ([source](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m57sp/?utm_source=reddit&utm_medium=web2x&context=3))\n2. You take absolutely no responsibility for the living animal you purchased and brought into your home - deciding to abandon it to the wilderness and refuse to let ANYONE bring it back in to teach your daughter a lesson. ([source](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m5uwl/?utm_source=reddit&utm_medium=web2x&context=3))\n3. You think that Ferrets can survive in the wild because they're [related to weasels](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m8xpo/?utm_source=reddit&utm_medium=web2x&context=3), and [reiterate](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m9qd5/?utm_source=reddit&utm_medium=web2x&context=3) that there are [WILD](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5maqq7/?utm_source=reddit&utm_medium=web2x&context=3) Ferrets, so it will do just fine.  \nNote - dogs are related to wolves - so can you abandon your puppy on the side of the road to suffer because they \"can survive\"? It's OK to leave your de-clawed indoor housecat in the woods because, well, it's related to a bobcat, so it should be fine? Should you let a turtle get out and go where it pleases, because there are wild turtles? (Spoiler --> answer is \\*NO\\*)\n4. You don't want to take responsibility for parenting. \"[Parents shouldn't have to be with their kids 24/7](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m5oo4/?utm_source=reddit&utm_medium=web2x&context=3)\" - perhaps not - but you should take more ownership and responsibility for parenting!\n5. While it's ok to [teach independence](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m6o3y/?utm_source=reddit&utm_medium=web2x&context=3) \\- and allowing your daughter to make a microwave dinner might be okay now and then - your shutting your kid off in their room because you want sexy time with your new boy-toy of 2 months, really isn't OK.\n\nI'm sure there's more reasons that I've missed - and I apologize that I haven't clearly articulated all my thoughts... but yeah...\n\nYou are the AH OP. Massively", "Oh my god and you didn’t even try going after the ferret with her???", "Info: why did your bf go to your daughter’s room???", "YTA. Jesus woman, your priorities are so screwed up, I’m genuinely alarmed for your daughter.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (29f) have a (7f) daughter who we will call Nina. I also have a (36m) bf who we will call Kyle.\n\nKyle and I have been dating for two months, and things have been going smoothly.\n\nNina loves animals. She wanted a kitten, but I thought it would be too much work for a girl her age, and we got her a ferret for her birthday instead. She was ecstatic and keeps him in a crate at night and takes him out to play through-out the day. She named him Peanut-Butter and it was so adorable (he was a white ferret with some caramel coloring so he really did look like he was dipped in peanutbuter!).\n\nOkay so here's the problem. Kyle hates ferrets and weasels and pretty much most small animals. When he first started coming over, he was hesitant to even go in Nina's room knowing Peanut-Butter was there. He still tried his best though, despite his phobia.\n\nI told Nina to stay in her room because Kyle was coming over and I wanted to spend time with him. She argued with me because she said she wanted to play with Kyle too. I told her no, it was getting late (it was already 6:30) and he was probably too tired to play and just wanted to relax. She agreed.\n\nI was in my room watching TV, when I hear screaming and then crying coming from the living room. I run to the living room, and Kyle is freaking out, and Nina is trying to run outside past him.\n\nI yell at her and ask what the actual hell is going on, and Kyle tells me he opened the door, and Nina answered, and put Peanut-Butter on him. He freaked out, grabbed Peanut-Butter, and threw him off of him, and he landed on the steps outside. Peanut-Butter supposedly started running away, and Nina wanted to chase after him.\n\nI was livid. She knew I had a hard day and wanted to spend time with Kyle, and she used his fears against him. He didn't even wanted stay over after that. So now she lost her pet. and I lost my night with him.\n\nI grounded Nina for not listening to me, and she cried. She's been in her room all day grieving her pet, but if she hadn't put Kyle and Peanut-Butter in an unsafe situation, this wouldn't have happened.\n\nWhen Nina went to her dad's house, Nina told him what happened and he yelled at me over the phone, saying she's heartbroken and told me to have a heart.\n\nI don't know what to say though. It was the consequences of her own actions imo. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Info: when did this happen? Today? Yesterday?", "NTA.  Seven is on the young side for this lesson, but not \\*too\\* young.  She did something mean and lost her pet.  That's not on you or your bf.  If her father has a problem with this, he can buy her another ferret.", "[deleted]", "NTA don’t listen to the other AHs on here that probably don’t even have kids themselves and never grew up themselves and resent any parent that tries to teach discipline and respect (probably Bc they refused to learn it themselves and resent their own parents for trying) thankfully your daughter sounds sweet other than this tantrum and has a mother that is willing to put the work in and be the “AH” if it means teaching her child valuable lessons about respect and gratitude. Also, many on here clearly don’t understand the struggles of dating as a single parent, especially when ex hubby probably has 5/7 days to do what he wants whenever", "[removed]", "Anyone else kinda worried about him sneaking off to her bedroom - almost like she put the ferret on him to scare him away?", "YTA, be a mother for Christ’s sake you let any man into your home around her? \n\nYou’re immature, you’re selfish, and worst of all you resent her. \n\nShe is a child and you locked her in her room to go play with your boyfriend. No child wants that and you know what you’re a terrible mother for how you handled this situation and next time don’t get a child a ferret it’s way more work then a kitten is.\n\nDo your research next time but- oh wait that’s to much effort to put into your own child isn’t it? Shame on you, do better.", "YTA for pretending a ferret is easier than a cat, for forcing *your* choice of pet on your daughter, then when *your* man of the moment had a problem with it making it your *daughter’s* problem to solve. YTA for having no empathy for your own child’s loss and grief. YTA for putting yourself and your current flame before your own child.", "Glad to know the new boyfriend is more important than your daughter. \n\nYTA \n\nAlso, I’ve had ferrets, they take more effort and work than any cat I’ve ever had.", "YTA - an ferret is so much work. and they need to be with other ferret!! an 7 year old can’t take care of an animal properly! also the fact that hou two been together for two months and kyle know her isn’t safe for nina, also the fact he thrown the ferret,", "YTA- you can’t be real this post has to be fake. You didn’t even try to search for a loose pet, are telling people HERE that “there are plenty in the wild so it will be fine” , you have zero empathy for a CHILD losing her PET, you prioritized a TWO MONTH relationship over your OWN CHILD, you shunt her away whenever you need attention… I swear there no way this is real because no real person with an ounce of normal emotions would think all that is ok. Rage bait indeed.", "Making a 7 year old stay in their room alone  from 630 on so you can snuggle your boyfriend, and  somehow think your ruined plans are in the same league as that poor kid losing her pet ? Of course YTA.", "This was so mean. I can’t believe a mom would treat her daughter this way. Maybe just give her dad full custody if you want her out of the way so badly. YTA", "YTA. In Kyle’s defense, I couldn’t be held responsible for my behavior if someone threw a ferret at me either. My god. \nBUT telling your daughter she has to stay in her room while your boyfriend comes over?? SHES SEVEN. It was 6:30 PM She can’t hang with you guys for an hour and then you can have alone time when she goes to bed? Your pouty attitude about losing ONE NIGHT with some guy vs your very young daughter losing her pet is insane. Your ex was right to yell at you and you need to get your priorities in check. You’re allowed to date, you’re allowed to be your own person and have your own life but not at her expense and not via banishing her to her room. Get a babysitter if you want to be alone with him.", "YTA - You give a ferret to a 7 year old , its too much \nShe is a kid acting like a kid , she dont understand what a phobia are \nForce her to stay at the room to her not be around ? Put your kid first", "YTA -\n\nCan a 7 year old spend an hour or two alone in their room - sure. Can they learn to cook, absolutely - mine made a chorizo and pepper Spanish rice dish this evening with me helping. Are they old enough to start doing tasks to help with pets - certainly, it's a great way to learn empathy and responsibility. \n\nHowever, they should not - feel second best to a two month relationship, be banished to their room so their parent can prioritise that relationship, have a parent who can't be bothered to cook for them on the 4 (or maybe fewer) nights a week that they have them, have sole responsibility for a pet, fail to be supported and be grounded when all of this goes to pot (which really should have been predicted by any adult with common sense).", "[removed]", "YTA. Massive!! You asked your 7 year old to stay in her room because you had a hard day and wanted to spend time with your BF of 2 months?????", "YTA and should prepare for a no contact future with your daughter", "YTA. Not for grounding her(because her behavior wasn't okay) but because you're so invested in your new boyfie that you're putting blame on a kid for ruining the night with a dude you barely know. \nShe's 7 now but I know damn well that you're going to be one of those lousy mother's who think that their teenagers are trying to steal away their boyfriends. \nGo to therapy for god's sake. \nAlso YTA because you literally didn't care to go and try to find that poor animal. \nAwful.", "YTA.\n\nYou purchased a ferret, which requires so much more than raising a cat. Oh, and the ferret is probably dead. \n\nYour boyfriend of two months is scared to enter her room? Why is your boyfriend of two months entering her room? \n\nYou banish your daughter so that you can have your “alone time” with him? And daughter says she wants to “play with” him, too? What is this relationship?\n\nYou banish daughter because you want alone time and because of ferret. Why couldn’t she just put the ferret in its pen and be permitted beyond her room?\n\nAll of this seems to be the consequences of OP’s actions. OP is more invested in the new boy toy than she is her own daughter.", "Holy hell **YTA**\n\n>ferrets are smaller so I thought they'd be easier\n\nJFC lady, are you serious? Do you not know how to Google? Do you know anything about ferrets?\n\n>I told Nina to stay in her room because Kyle was coming over and I wanted to spend time with him.\n\nWow. Just wow. So it's like that. After two whole months of dating too. Mother of the Year. \n\n>She knew I had a hard day and wanted to spend time with Kyle, and she used his fears against him.\n\nShe's **seven years old.** She did not use his fears against him. Your willingness to cast her aside and vilify her for Kyle is just gross. Kids know when they're not wanted, don't be surprised if she just wants to stay with dad from now on.", "YTA", "Your poor daughter and that poor ferret.  YTA.", "[removed]", "YTA\n\nFirst of all, YTA for giving a 7 year old child a ferret in the first place. If a kitten is too much work, then so is a ferret. Did you do any research about them at all?\n\nYTA for prioritising time with a man you’ve known for two months and his feelings over your own child. \n\nYTA for not searching for Peanut-Butter. Domesticated ferrets can’t survive long outside on their own. You are the adult, you chose to bring him into your home, it is your responsibility to ensure he is safe and cared for. It’s disgusting you think it’s okay to let him die because ‘it’s the consequences of Nina’s own actions’", "Wow. Yes, you ATA. You're showing your daughter that your new boyfriend and your wants are more important than her and her feelings. Betting when she gets old enough to process and has access to reddit, she will be posting in all the narc groups.....about you.", "YTA\n\nSo, he enters HER space.\n\nShe shouldn’t have put the ferret on him, but she’s 7 and has known him for literally two months assuming you introduced them right away.\n\nHe chucked the ferret OUT OF THE HOUSE.\n\nAnd you punished your child??\n\nYou sounds vindictive and horrible", "YTA\n\nYou sound like an absolutely despicable selfish parent.", "I’m just gonna say it, why do parents come onto AITA for things like this knowing how everyone likes to judge (because that’s the whole point obv), when you could just go to the parenting subreddit and ask for advice? I think being deemed an asshole is too far in some situations. Like yeah, you goofed. Grounding is too far and there are better ways to handle this. But I hate saying YTA because it helps nobody including the kid with this. \n\nBut yeah, OP, I guess YTA. Your daughter is seven. She is going to have issues with emotional regulation still as well as still pushing boundaries and testing rules, and not thinking things through. It’s your job as her parent to guide and teach her through this. I’m not gonna judge on the boyfriend thing because I had rules regarding dating when my daughter was younger and they went out the window when I realised how difficult it made planning anything. I was a single parent with 100% custody and no reprieve though. Also, you could have used a light and gotten your kid to help you look for the ferret, and leave stuff out for them to find safety and be okay. You’ve basically killed the ferret by not at least trying. Go talk to your kid, apologise for your actions and discuss why you were upset and all of that. Be a better parent, make better choices.", "YTA. You’re daughter is 7, she’s a child. You’re so heartbroken over losing a night with your boyfriend of a whole whopping 2 months, imagine how heartbroken your daughter is losing her pet for most likely, forever? I’m guessing you also did literally NOTHING to try to find it??\n\nYes what your daughter did was stupid and irresponsible but again, she’s 7?! Kids do impulsive things and they don’t fully understand consequences and my guess is your daughter did not understand the severity of Kyle’s phobia. Sure this could be a teaching moment, but maybe AFTER you find her freaking pet, you’re heartless.", "YTA, let's see you prioritized you new relationship with BF over your daughter, preferring to confine her to her room after she made herself a kids cuisine meal for dinner. Then when she makes a terribly 7 year old mistake and her pet, that you did not research or ensure was in a proper enclosure gets thrown outside, you further traumatized her with blaming her, grounding her and giving her the cold shoulder because your booty call got messed up. And now you're trying to defend your sub par parenting to not only your ex but on two different subreddits where you are rightly getting called out for lacking empathy and maturity. There is no way anyone can make this make sense.", "YTA all the way.", "YTA and your parenting is lackluster at best. You’re mad your 7 YEAR OLD didn’t take into consideration that you had a bad day and acting like a normal 7 year old. Disgusting and heartless. Why don’t you give full custody to her better parent and run off into the sunset with Kevin or whoever the flavor of the month is, clearly you value this 2 month old dating relationship more than your daughter.", "YTA Why the heck is your bf of 2 months going into your daughters bedroom. Wtf!!!!!!!!", "YTA and so is Kyle!   Why wouldn’t he let Nina try to find her pet?   You should have went outside with Nina to try to find Peanut-Butter right after this happened.   Did you even try to find her pet?   No, all you care about is that you missed out on a night with your boyfriend.", "YTA. \nPoor kid,  poor ferret.  You aren't teaching your daughter good things,  you are teaching her punishment,  unforgiving and irresponsiblity in not even looking for her pet. \nWhich by the way you are responsible for as an adult.  Dont get anymore pets,  your selfish and lazy.  Shame on you also for putting your boyfriend before your daughter and wanting her locked away.", "YTA. For so many reasons. Why the f*ck are you bringing strange men into your home that you’ve known for 2 months, when you have a young daughter and even more disgusting: why is he going into her room? You got a 7 year old a ferret for her birthday. 7 year olds are not mature enough to handle every aspect of owning an exotic pet. Now there’s a poor animal lost because your daughter isn’t mature enough to understand that mom and Kyle want grown up time-which shouldn’t be a thing because you’re bringing strange men into your home so soon. If you knew he was coming over, you should have been on alert, not in your room watching tv.", "YTA - your daughter is *seven*. She’s a little kid, she’s still learning. She exercised poor judgment, but your reaction is inappropriate and focused solely on you. Hell, getting involved with Kyle when your daughter has an animal he can’t stand is stupid to start with. Where is that going to go? It never had a future other than you putting your wants above those of others (your daughter’s reasonable desire to keep her pet - jfc you told your daughter to stay in her room so you can have nookie time, Kyle’s desire to not be around said pet). So it went as badly as anyone could foresee, and your complaint is that you didn’t get laid.", "You really have to ask", "YTA for sending a seven year old to sit alone in her room all evening while you prioritise spending time with your boyfriend of two months. Everything else that followed made you an even bigger AH.", "YTA… your daughter is 7 fucking years old. She needs her MOTHER. She does not need to be sent to her room because you need a booty call. Wake up OP. Jesus.", "YTA- you been dating the guy for only 2 months & already he’s become a priority over your child.", "If you have to post a conflict between you and your SEVEN YEAR OLD on Reddit to find out if YTA, then YTA. Automatically. Grow the fuck up.", "YTA. \n1-A dog or a cat would’ve been easier than a ferret. \n2- You care more about your boyfriend of TWO months than your daughter \n3- Why is a guy you just met dictating what happens in your house?\n4- Why you introduced your child to a man you just met?\n\nI hope your ex gets full custody. Poor little girl", "NTA play stupid games when stupid prizes..she has to learn actions have consequences", "NTA.  At all.  She did that on purpose.", "I am a ferret parent and I am losing my mind at this post! Why are you posting on Reddit instead of looking for poor Peanut Butter?! Time is of the essence when a ferret is missing and it’s winter, you heartless harpy. Ferrets are EXOTIC pets. They are not easier than cats and dogs, they’re much harder and more expensive. Go find the ferret and surrender it to a reputable rescue because your family sucks. YTA. You’re all assholes.", "YTA. I had to double check that your daughter is actually 7 and not 17. Why are you treating her that harsh? She's a literal child.", "YTA. Child comes *FIRST* before dating....you should know this. Kyle doesn't get priority over your child. Your ex is right, have a heart. It's situations like this where the child is ignored in favour of the new partner that leads to strained relationships.", "Your gross!  Strange man in home with small child after 2 months! Ferret over cat. Dumb. You prioritize stranger over young daughter after traumatic experience. Ex should have sole custody and you can have SUPERVISED visitation. Please seek procedure for sterilization \n\n\nYTA", "YTA, big time, and for many reasons.  \n\n1.  Pets aren't lessons to teach children.  They are living, breathing beings and the fact that you abandoned a domesticated animal claiming it'll be fine in the wild because of instincts it barely has now is downright cruel.\n\n2.  You aren't teaching your child independence.  You're neglecting her.  She deserves an attentive parent but you're too busy caring about your boyfriend and \"not paying attention to your kid 24/7.\"\n\n3.  You obviously don't want to be a mother, so for your child's wellbeing, just give up full custody to her father.  JFC.  This is awful and I hope it's all just ragebait.", "YTA, I hope this thread finds its way to your ex so he can have the custody arrangement adjusted.", "YTA…and\n\nWhy is your BF of two months going into your daughters room?", "Yta. You sound more concerned about missing your dick appointment than your daughter losing her pet.", "Did she know how scared he was?  I think you shouldn't have had him around your kids this early, but if she knew he was scared and was trying to scare him then it's completely her fault.  But, she is a child so you kinda gotta parent her and not just yell..", "You need to rethink your priorities yta", "What in the world…who in their sane mind thinks that an easy first pet is …a ferret. Lol", "So your boyfriend (a grown man) abused an animal by throwing it out onto concrete, the ferret somehow survived and ran off but you refused to look for it?  A domesticated ferret?   You just decided to let it die on its own outdoors?  How are you and your boyfriend NOT the assholes in this situation?  \n\nYTA 10,000 times over and how dare you blame a 7 year old child?", "YTA. Why was your child answering the door and not you if you knew your bf was coming over? Was watching TV more important than letting your boyfriend in? And then you get mad at your daughter for being upset about her lost pet. Yeah you need to get your priorities straight.", "YTA\n\n2 months. That dude could be a predator and he is alredy around your 7 year old. You sent her to her room for the whole night to cuddle up with some dude? You have poor judgement and are really self centered.", "Interesting, when I figured out I didn’t like kids, I just didn’t have them. You went a completely different direction.", "YTA. Wow, reading your comments you are a crappy mother.  Are you trying to win a bingo card of how to traumatize your child?  Hope you can afford all the therapy she will need until she decides to cut you off for good.\n\nEdit: spelling", "YTA\n\nLike, what in the actual hell? Your kid is 7, and you chose to keep your kid stowed in her room cause you wanted to spend time with your boyfriend? It all boils down to you chose your boyfriend, over your kid.", "YTA. 7 year olds are generally not responsible enough to own pets, and ferrets are not easier than cats. This entire situation was a disaster to begin with. I do not blame your daughter at all. From the information given, I would assume that she felt like Kyle is taking up all of her time with you, and so she tried using the one thing she knew she could do to make him leave. 7 year olds do not have the foresight to know how adults react to fear, and I guarantee that she did not want to lose her pet (one that she probably shouldn’t have had in the first place).", "YTA. You sent your child to her room so that you could spend time w/ your boyfriend.", "yta and a shit mom. who puts a boyfriend of 2 months before their minor child?!", "Ferrets are easier then cats? Color me surprised", "YTA for assuming a ferret is less work than a cat, they require just as much if not more attention and care.", "Wooooooowwwww YTA. Your daughter is 7. You are supposed to be a grown ass woman and a mother - ACT like it. It’s clear you care more about Kyle than your daughter. It’s sad you care more about your missed time with Kyle and not about your upset daughter. Why are you even talking about her like a 7 year old manipulated a situation to get Kyle to leave?? She didn’t “use his fears against him” - she wanted to play with Kyle (which you said no to) and she probably wanted to share the joy she was having with her pet. You know, like a normal 7 year old. Judging from your comments, it’s clear you are not able to think of anyone other than yourself and I feel bad your daughter is with you.", "YTA, just for thinking a ferret is EASIER than a cat.", "That headline!! 😂", "Yta\n\nYour daughter lost her pet and that’s how you react. You choose your new man over your daughter. She’s seven years old. Trust me she will remember this for the rest of her life.", "Why did she think a ferret was easier to look after then a cat??", "Ooooo looks like not only are YTA, we also have a new candidate for r/AmITheDevil!", "I seriously don't get some of the people who post on here and I'd be inclined to think some of these are fake if I hadn't lived through something similar. \n\nYTA.\n\nCongrats on your daughter going NC in the future. Want to know how I know that? My mother constantly put her boyfriends our lives. Her needs in that department always won over us and it was always, \"Don't you want mommy to find love? Don't you want to me to be happy?\" When I was 5 one of her boyfriends stole from us and I still can clearly remember it over 30 years later. Eventually one of these situations caused a huge rift and I haven't spoken to her in 10 years. My siblings (half but whole in my heart) are a lot younger than me so they still have contact but they are not close with her by any means at this moment in time.\n\nYour daughter is NEVER going to forget this and even if she forgives you now she will look back some day and realized how messed up it was and might not forgive you then. You are teaching your child (who is watching and learning from you every day) some terrible lessons that are currently forming her core being.", "YTA\n1. You can spend time with your brand new BF when your child is at her father's house.\n2. You're punished a child who just lost her pet because YOU failed to provide adequate supervision for her\n3. You banish your daughter to her room at 630, but you're in your room watching TV and your BF is relaxing in the living room.... what's that about?\n4. You gave a 7 yo a ferret as a pet and failed miserably to give her the supervision that kind of pet requires\n5. You're holding your child to a higher standard of behavior than you hold yourself\n6. You expect your 7 yo old to know you had a hard day, you have unrealistic expectations for a child  \n\n\nThe whole story stinks more than ferret's litter box", "I dont necessarily believe that you're YTA, but you should have taught your daughter better animal care before buying her a pet. If she thinks it's okay to put her aninals in an unsafe situation where now it's literally lost in the neighborhood, I have no clue why you would even allow her to have that pet. You, however, are TA for making your daughter stay in her room.", "YTA. She 7!  And you have known your boyfriend for 2 months.  Start being a better mother.", "If your daughter was going to her dad’s house in a few days, that’s when you should have seen your bf. YTA in so many ways. But especially for prioritizing your bf over your child.", "YTA", "YTA\n\n\n>She wanted a kitten, but I thought it would be too much work for a girl her age, and we got her a ferret\n\nFerrets are generally MORE work than cats.  You bought a pet and did no research. You also bought a pet your BF has a phobia  why would you pick a pet  she was not  specifically asking for and you knew would cause problems?\n\n\n>I told Nina to stay in her room because Kyle was coming over and I wanted to spend time with him.\n\nShe is seven and your forcing her to her room so you can hang out with a guy, your actions have consiquances  you made her feel small and invaluable she acted up because you hurt her feelings.\n\n>I yell at her and ask what the actual hell is going on\n\nSeven she is seven yelling what the actual hell at her is never okay.\n\n>She knew I had a hard day and wanted to spend time with Kyle, and she used his fears against him. He didn't even wanted stay over after that. So now she lost her pet. and I lost my night with him.\n\nShe knew you had a hard day??? She is seven, your her mom your hard day and what you want is not HER problem she is a kid.\n\nThis whole paragraph is like she upset me so I'm fine with her losing her pet and friend cause F her basically like what?\n\n\nAlso you let the ferret die ( they don't do well in the wild after being pets)  didn't even try to save a pet you were responsible for cause you were mad your bf.\n\n\nHonestly check your priorities, get therapy. If I was your ex I would be fighting for full custody and this situation might be enough for a court to grant it.", "YTA -  A ferret is easier then a cat?  WTF?  No.  OP is exposing her kid to random men (2 mos?!) and prioritizing these booty calls.", "YTA. 6:30 isn’t late. Your boyfriend shouldn’t be in your daughters room ever. Kyle sounds like a loser anyway. Apologize to your daughter and get her a new pet.", "I'm sorry you think a ferret is easier than a cat? Are you delusional? Ferrets are a hard animal to care for. Fuck cats are very easy pets to care for compared to a ferret. I know, since I have four. However your complete lack of compassion to your child is awful. Yes she shouldn't have put her ferret on him but did you explain to her why? Probably not. Her father is right. Grow a damn heart and stop putting your boyfriend over your literal flesh and blood. She comes first before your boyfriend. She's 7 she can tell she isn't important enough to you and when she is able to don't be surprised if she starts to distance from you until she won't talk to you. The way you act hints that this is a regular occurrence. Ignoring her, prioritizing a dude over her(it's a 2 month relationship, your child's been alive for 7 years. Why does she not matter enough to you?). She's grieving the fact she lost her pet because your boyfriend threw him out the door. One, the landing could have hurt him, and he's vulnerable to predators. You could have let her go out and try to find him. Hell you should have gone out with her! But no you prioritized your date night instead of her beloved pet. Someone she considered a part of her family. \n\nYTA OP, Majorly TA unless this was the first time you've acted like this and are running on exhaustion fumes. Even then you acted awfully.", "A ferret less worn than a cat? What? Seems your more interested in your bf.. did you even look for her ferret? \nYTA", "Yta. Is this real?!!!! This reaction to your daughter losing her pet and especially over a guy you barely know", "HUGE YTA I really hope this is fake because the fact that you are choosing to a side with a boyfriend of two months over your 7 year old child is disgusting. “She used his fears against him” I’m sorry but I don’t think your child had any intention she just wanted to spend time with him and introduce her new pet which you’re boyfriend threw outside. I hope you grow the frick up and get a reality call. Nobody in here is not going to call you TA.", "YTA I'm going to say what we're all thinking and that is from the father's reaction to this and your \"parenting\" of your daughter she needs to be with her father.", "Yta and a clueless mother. Why are they even talking if you've been with him for 2 fucking months", "This can't be real and if it is, YTA for being a shit parent! I can't even with this post/OP.", "Honestly just say you care more for some random dude than your daughter and be done with it already. JFC you suck.", "Omfg poor Peanut Butter! YTA. You’re more concerned about missing your night with your new boyfriend than trying to find this poor animal who will probably die outside.", "You are NTA. Your child is old enough to understand right from wrong, and your request that she not play with her ferret past a certain hour is perfectly reasonable. As is your request to have her keep the pet away from boyfriend, due to his phobia. It's a respect thing. Unfortunately, her disrespect meant that someone with a phobia threw her terrifying pet out the door, and her carelessness means that she has lost her pet. \n\n&#x200B;\n\nWhat does your ex want you to do exactly? Allow her to disrespect people? Allow her to break reasonable rules that you have set for her? Allow her to force the people around her to pay for her reckless behavior? \n\n&#x200B;\n\nShe is 7, she is old enough to understand right from wrong, and she is old enough to respect other people, which she chose not to do. She has a proper punishment, ex can mind his own business or get her a ferret at his house if he really wants. Your house, your rules. Kid can follow them or she can get grounded. End of discussion. NTA, and don't let anyone guilt you into thinking you are. Kid isn't stupid. She should have listened. Unfortunate that the ferret paid the price.", "YTA, shes a young child, she doesnt really understand, she was probably really excited to see Kyle and completely forgot about his fear. She didnt \"use his fear against him\". Please. Thats such an insane over reaction.\n\nOn top of losing her pet she is now being grounded by her mum and told off. Let me ask you a question.\n\nWhy, why ,why did Kyle open her door? He knew she had her pet in there, that was the damn point no? Imo its as much his fault for what happened. \n\nOfcourse your daughter is upset and if you arent careful, she will remember kyle as the reason she lost her per and she will remember how you took his side.", "Poor ferret. \n\nYTA. \n\nYou are not an asshole for getting her a harder tk care pet (cats are pretty independent)... that was an honest mistake. But YTA to ask her to.go.to her room  so you can relax with your bf. I wonder how left out she felt...\n\nTo your BF: When you left your 7y kid in charge of an animal he has a phobia to, you muat knew something like this may happen. Not in this kntentional way, but a 7y can make mistakes or let loose a ferret without wanting to. \n\nTo the poor ferret. Poor creature.", "\"Every child deserves a parent but not every parent deserves a child.\"\n\n\nFrom this snippet on the internet you demonstrate how you prioritize your BF over your minor child. You lambasted her when she was already crying and emotionally distressed.  Yet you were concerned for your boyfriend's feelings first?\n\n\n\nYTA. Your poor kid. Also that ferret is probably dead, so you're the double AH for essentially condemning a domesticated animal to a horrible and scary death.", "NTA\n\nYour daughter knowingly put PB on a person with a phobia of rodents. Your ex should’ve been on your side. It could’ve been a parenting win and a life lesson, but instead is an example of two people struggling to parent together.", "NTA, this is a clear indicator that your daughter was not responsible or mature enough to have a pet. It sucks but actions have consequences and maybe she will remember that going forward.", "NTA. Your ex is absolutely TA. This is a good parenting choice- her actions were uncaring for her pet and the feelings of another person. Your ex should have given Nina a lecture on empathy, not undermine you as a parent.", ">why the hell is your 7 year old daughter even the one answering the door\n\nYuuuup. \n\nMy kids weren't allowed to open the door when I wasn't home until they were ... Uh, actually idk the ok age because my teens recognize the wisdom of just being quiet and waiting until they leave lol. Friends will text. Mom will holler, \"It's your mother can you open the door for me?\" And siblings will yell, \"FBI OPEN UP!\" because they all think they're hilarious\n\nBut yeah, a 7 year old should not be opening the door without an adult home", "This!! All of this!! 👆", "They probably wouldnt have even lost the ferret if OP had bothered to make some effort to look for him!! Ferrets can’t survive on their own, and I cannot express how fucking livid I am right now (without being permanently banned) on that ferret’s, and the child’s, behalf.", "It’s a goddam ferrot. For fks sake everyone’s acting like she puts out cigarettes on her daughters arms. yes… a single mother trying to move on with her life while providing for her child might be tired to look for a dam rodent in the night after ONE evening with her new chance at love was interrupting by her daughter being disrespectful and ungrateful", "2 months, and telling her 7 year old to stay in her bedroom so she can have time with the boyfriend. I'm getting a very particular vibe about this type of mother.", "I noticed that too. 2 months is way too soon to introduce the kids", "And letting him in her child’s room? Weird", "Oh my god, I just saw in a comment that OP also has the poor kid feed herself by microwaving her own frozen dinners. Apparently this is \"independence\".", "I agree about the ferret. I had to feed and clean the litter box for a couple that were brought into the animal shelter I used to volunteer at. I had a little difficulty because they wanted to get out of their cage. They were very fast. I was like in my late 20s and knew they wouldn't be a good pet for me. I can't imagine making a 7 year old responsible for one.", "Yeah I side eyed at that too.", "Came here to say this. Introducing a dude you've been seeing for 2 months to your kid and seemingly caring a hell of a lot more about him than your daughter. YTA and step up as a parent for the sake of your literal child.", "I don’t judge for introducing to your kid. They’ve been dating for 2 months but we don’t know the context of how long they’ve known each other. But as someone who was a solo parent for 7 years, I can’t imagine just keeping my kid in their room with the door shut so I could hang out with my guy friend. I guess I’m just an active person who actually enjoys spending time with my kid. If it were bedtime sure. But it’s weird to me.", "If kids can’t see the consequences of their actions all the way through, how are they supposed to learn to see them… if they never face consequences…? Also, when should a single mother trying to move on from a divorce from an obviously hostile ex husband introduce her new bf to her child? She can’t spend one night out of the week in her room watching tv or playing with toys or her pet so that her mom can, idk, have a social life and not be a single recluse while her ex husband has 5 days to do as he pleases? This sounds like judgemental misogyny", "Is there a North Dakota sub that we can post this on?", "Yeah but she had a really long day and her daughter knew she wanted to chill with Kyle! /s", "She grounded her daughter.", "Ferrets are smaller than cats so I thought it would be more suitable for  a girl her age", "This is the only comment I looked for", "Not only that, but bringing him into her home with a child!!", "Owning ferrets is a ton more work than cats like holy crap… not even legal to own in a bunch of states due to specialized veterinary care needed??", "Yeah I’m pretty creeped out about Kyle sneaking off to her bedroom in the first place", "Finally someone said the bedroom situation there’s no reason for him to go there", "2. the kid opened the door because mommy dearest was busy watching TV in her bedroom instead of letting her boyfriend in herself.", "1. Fair\n2. Irrelevant opinion\n3. Inaccurate description\n\nNTA", "Very much this. \n\nAnd why did a boyfriend of less than two months need to go into the bedroom if a 7 year old.\n\nAlso, at 7, she probably could not foresee a grown man throwing her pet to the ground - because she's only 7!\n\nYTA", "Her pet got out sounds like it got under a fence. You're ignoring a large part of the story. Also, shutting her in her room sounds much different than what it actually is called. You're twisting the story. Yes the focus she have been find the animal. So for that OP is an AH. The grounding? No, using the animal like that is asshole behavior.", "Totally agree and what 30 something old man has a phobia of ferrets?!?", "Why’d she get out again? Throwing her pet ferret at an adult that she already knows doesn’t like animals at all? It’s not prioritizing the bf, it’s teaching the daughter decency manners and respect not only for other people but for her own animals. Yes she’s 7, and 7 years olds are unreasonable and emotional. She sounds like a good kid, but even good kids need hard lessons. Life isn’t perfect, especially if you do stupid disrespectful things and 7 is a good age to learn that", "Here's the thing. I hate the notion that parents need to spend time with their kids 24/7. She fed herself already, and she had her pet to spend time with in case she got lonely", "Seven is also way too young to be capable of \"using his fears against him.\" That level of sophisticated manipulation likely wouldn't come on line, if it ever did, until much later.", "No comforting the poor boyfriend was more important. Letting her 7 yo child look alone for the ferret obviously would make her seem bad so she was grounded and not allowed to leave her room.\nOp is cruel.", "Or another child", "Right? This whole time I've been looking for anything that mentions what happened to the ferret! Even putting aside everything else, I'd still say op should get YTA if they didn't even try to find the ferret (assuming the fall didn't kill it). As the adult, the pet is legally their responsibility.", "ITS A RODENT. WHO TF CARES", "Agree with most of what you said, but the idea to \"man up and grow a pair\" regarding a phobia is a bad take. Phobia's aren't so easily gotten over. Take it from a 33yo woman with a phobia of vomit who hasn't thrown up in 25 years because of it. Someone burps wrong around me and the anxiety/fear response can have me 20 feet away from them in about 2 seconds.", "That’s what I was thinking, I’ve never owned one but my friends who have are like super pet owners because they take so much care. They have to be bathed constantly just to control the smell. There’s no way a ferret is an easier pet. OP is not firing on all cylinders, also YTA for blaming your 7 yr old.", "You missed that OP left the domesticated animal outside of the house to its own devices (likely death) to comfort her boyfriend while grounding her child and forbidding the child from [searching for her pet](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m5uwl/?utm_source=reddit&utm_medium=web2x&context=3).", ">\nBTW, why would Kyle ever go into your child’s room? Why is that even an option?\n\nKyle never went into her bed room. He knocked on the front door. Mom was too busy watching TV in her room so she let a 7 year old open the front door. The more I read, the more mad I get at mom. \n\nOp, YTA", "And why is Kyle meeting your child less than 2 months?  That is so not safe", "Probably not but clearly a booty call is more important /s", "[removed]", "Except this 7 year old girl doesn’t suck. She did a thing she shouldn’t have but she is only 7", "Agreed.", "I have no idea who you are.\n\n\nBUT YOUR A GODDAMN GENUIS", "[removed]", "I probably would have done something like that a year ago before I got over my fear of rats. We don't know the reason he doesn't like them. He could have a big reason for acting like he did", "I literally volunteer at a ferret rescue bc I’m so obsessed with them and even I understand he didn’t mean to hurt it. Murder is a pretty stupid way to describe an involuntary reaction to your literal phobia landing on your body unexpectedly. If he attacked it or something I’d understand but he just wanted it off. The real problem is OPs priorities.", "Fear can cause you to do crazy things. My ex-husband absolutely LAUNCHED his cat across the room into a wall once because our cats were fighting and jumped on him while he was asleep mid night terror. Thankfully the cat was okay. But if your phobia lands on you whether it's a ferret, or a spider, the usual reaction for most phobics would be to launch it or go crazy trying to make sure it's off of you.\n\nReally wouldn't take that reaction as a violent outburst and more of a panic/fear induced fight or flight reaction.", "Kyle did it on reflex. He was terrified Peanut-Butter would hurt him badly", "But I agree op is TA because who tf let's someone they're dating for TWO months meet their kid??", "A pet she THREW at someone she KNOWS has a fear of rodents. \n\nIt's the consequences of her own actions", "He thinks I should've helped her look for Peanut-Butter but it was already too late and he also thinks the cold shoulder and groundings were too harsh and she already learned her lesson by losing him", "I’m with you on this. What the actual f**k?", "What really gets me is that OP didn't even \\*TRY\\* to find that poor pet that \\*SHE\\* bought for her daughter - and just abandoned it to die outside. \n\nAt least that's how I read [this](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m5uwl/?utm_source=reddit&utm_medium=web2x&context=3) comment of hers.", "All of this. Nina is a child. OP is an adult and her parent. Yes, Nina did something wrong and there should be consequences to her actions but you still need to be there for her. Also I was so confused when OP said they got a ferret instead of a kitten because it was easier. What? It doesn't sound like OP researched the care of the ferret very much and every parent should be prepared to care for a child's pet or else not agree to adopt the animal. It's a living creature not a toy. ESH with OP being the biggest AH.", ">She did something mean and lost her pet.\n\nAnd the ferret deserves to die, and [no effort](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m5uwl/?utm_source=reddit&utm_medium=web2x&context=3) should be spent trying to RECOVER that living animal?", "You can’t just let a animal run lose. Also there is no way they should buy this child another animal. She has demonstrated she is not responsible enough. You know because she’s 7. It would be cruel to the next one and it was cruel to this one. \n\nAnimals are not learning tools for children. They are living creatures. It’s not like she lost a cell phone she lost an animal. Mom should have taken daughter to go look for it together and should be playing a more active roll in future animal care.", "I'm not sure a seven year old is capable of understanding a phobia. At that age people still tell them to get over their own fears or tell them they're being silly, they try to logic the kid out of the fear, or even just expose the kid to the fear to prove that the scary thing is actually harmless. \n\nCan't blame the kid for not getting it.", "She is SEVEN, she did something seven year olds do.  She doesn’t deserve to be neglected and lose her pet for that.  OP is the AH all the way.", "And I'm going to question your sanity because IN WHAT WORLD WAS THIS A REASONABLE PUNISHMENT? TO WHOM? \n\nTHAT ANIMAL MAY WELL DIE OUT THERE AND YOU SICK PERSON THINK NOT EVEN SEARCHING FOR IT A REASONABLE PUNISHMENT?! YOU'RE AS MUCH OF AN AH AS OP!\n\nAlso, ARE YOU SERIOUSLY EXPECTING A LITTLE KID TO UNDERSTAND WHAT A PHOBIA IS? She got excited and PUT (it's a QUOTE) the animal on him because SHE'S A KID! She needed a talk about it, but the \"punishment\" she was given instead is PLAIN CRUEL.", ">Nina answered, and put Peanut-Butter on him.  \n\nNot quite the same as throwing the pet on him.", "OP is giving her seven year old child the cold shoulder. That is not okay. OP also sounds like a neglectful parent according to their comments.", "Lol ummm… I hope this is reverse psychology or sarcasm", "Haha, okay. You think it’s okay to make your kid stay in their room so you can have private time with a brand new date? I don’t. And yes, I am a parent. My kid comes before a date.", "SHE LITERALLY REFUSED TO LOOK FOR AN ANIMAL THAT MAY AS WELL DIE BECAUSE IT'S DOMESTICATED. WHAT IS WRONG WITH YOU?!", "I’m a parent and *I* say she’s an AH so get the f out of her with that crap.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "> It sucks but actions have consequences and maybe she will remember that going forward.\n\nWhile I agree there are consequences - ***why should the pet suffer?*** \n\nIF OP wasn't going to take some responsibility for that living, breathing animal - she shouldn't have gotten it.\n\nFrom my reading of [THIS](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m5uwl/?utm_source=reddit&utm_medium=web2x&context=3) comment of OP - no-one even tried to look for that scared domesticated animal; abandoning it where it was thrown outside the house.", "Do you really think telling your 7 year old to stay on her room so you can hang out with your bf is a good choice?", "> This is a good parenting choice\n\nBuying a child a pet - and then when the pet gets outside, grounding the child to her room and letting the pet die outside? ([OP says](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m5uwl/?utm_source=reddit&utm_medium=web2x&context=3) no-one searched for the pet)\n\nGetting a Ferret (with no research!) because clearly because they're [smaller](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m57sp/?utm_source=reddit&utm_medium=web2x&context=3) they're easier to take care of? (Note - Ferrets are more work than cats)\n\nNo - I don't think that's good parenting.", "Fr, he’s clearly using this as an opportunity to direct anger hostility and aggression towards her under the guise of protecting his daughters feelings from “the exwife mom prioritizing the new bf above the daughter” when it’s not the case at all", "Oh thank gods, I thought it was just my house where the kids yell \"FBI OPEN UP!\" at each other.  And yes, I agree with the rest, too.", "This entire story, before losing the ferret and after, she sounds like a teenage sister, not like a mother. She is TA here.", "Idiot, taking animals as pers requires RESPONSIBILITY. And a 7 year old CAN'T be fully responsible for an animal, especially if it's something like a ferret. \n\nAlso, why couldn't she have someone babysit the kid for the night or planned her date for when she's with her dad?\n\nAnd \"disrespectful\" and \"ungrateful\"? Are you working in the circus by any chance because you're one hell of a clown.", "Are you 12 years old?", "But it was 6:30!!! \n/s", "I get the feeling mom is one of those people who routinely introduces their child to brand new boyfriends, gets the child's hopes up, then breaks the child's heart when the relationship ends.  It's probably a cycle that gets repeated over and over again.", "I had been dating my boyfriend for like four months before my daughter even knew I had one after four years of not dating “woah wait so you’re not a single Pringle?!” She had no idea.", "And why in the world would he be going into her room??!! OP states Kyle is as hesitant to even go in her daughter’s bedroom. Everything here is wrong but that stood out the most. YTA.", "Introducing, and being worried that he won't feel comfortable in 7yo's room??", "We taught our older son to do this and the younger is learning. It is independence, teaching them how to do stuff in the kitchen at an age appropriate level. Most (99%) of the time we still prepare their meals or prepare them with them but it sure came in handy when hubby and I both got taken out with a stomach bug in late November. Older son made both kids grilled cheese for supper using the sandwich press and hubby and I didn't have to leave bed/the bathroom and risk reinfecting them (they'd had it a week prior).", "She has weekends to do as she pleases if dad has kid on the weekends.  Most parents single or not do not get to just do as they please including having a social life.  You arrange it around the kids, you get sitters.  And you better be damn sure the bf/gf is someone you are pretty sure will be sticking around for a long time before you introduce them to your kids. It takes more than just 2 months to know that, when you only see them once or twice a week. I would say 6 months bare  minimum.", "This sounds like parenting. Being there for your child, spending time with them at night after school. Kids are not crate trained. Maybe mom should have adopted a ferret instead of having a child.", "You are projecting here. Unless you know OP personally, you have no idea the custody arrangement or what dad does with his time.", "I posted on two different  ferret sites one here and one on Facebook. This makes me so mad. I have four babies of my own. And the one time one got out I was so scared and looked for him for 24 hours till he was found.", "\"chill\"\n\n& her daughter, the 7 year old evil mastermind, used Kevin's fears \"*against him\"*", "Did as much research on pets as you did on good parenting: zero.\n\nYTA and you're scarring your kid", "Wow, you didn't do any research at all, did you?", "YTA for getting you daughter a ferret. They are clever horrible little creatures. You clearly didn’t put on any effort towards this decision. \n\nAlso you clearly chose you boyfriend over your daughter, she’s a kid who clearly doesn’t understand phobias.", "As a former petstore employee, and someone's who's rescued exotics ranging from you guessed it, ferrets to large monitor lizards and birds. No let is EVER a child's responsibility. EVER. YTA for being irresponsible in the first place, YTA for prioritizing your BF over your DAUGHTER. so much is wrong, and you are the focal point of that.", "YTA for not doing even one (1) google search’s worth of research about ferrets", "And newborn humans are smaller than 7 year old children, so they probably need less care too \n\nNot only are you an asshole, you're a stupid asshole", "Did you Google this at all? And now your daughter is the bad guy?", "Never get another animal.", "Cats are independent, ferrets are like having a toddler for 15 years. You did ZERO research on ferrets because I literally had a full belly laugh when I read that part. You have also clearly done zero research on parenting. Do better.", "Boy, all your blood is in one place, ain’t it?", "Ferrets are in no way easy. They actually require more care than a cat and I doubt you’re helping her care for it despite her being 7.", "Did you do any research prior to getting her a pet???", "Then why not a freaking hamster???", "Unrelated men statistically pose a danger to children in the household \n\nFactor in him knowing her way too early and going to her room?\n\nWeewooo weewoo", "You think a random man the OP has only known for two months should be totally okay with going into her seven year old daughter's bedroom even without the threat of a ferret? Really???\n\nAnd no, that's a completely apt description.\n\nShe has a seven year old who she wanted to keep in her room, out of the way, from very early in the evening so she could get some dick. That's exactly the right description.", "Found Kyle", "If you knew how to read you would realize that OP stated her daughter opened the front door in the living room to let her boyfriend in, not her room.", "There's a lot to criticize here but I don't think a phobia is one of them. They're not supposed to be rational.", "This is a shit comment. A phobia is a phobia, it doesn't have to do with age. \nThat notwithstanding,  the OP is TA.", "You do, admit it.", "Did you miss the part where she told her kid she had to stay in her room so she could spend uninterrupted time with her boyfriend?", "“She fed herself already”\n\nYou aren’t even doing the bare minimum if she’s feeding herself at 7.", "Wait what? She fed *herself*? She's 7!\n\nAnd given you have shared custody you *don't* spend 24/7 with her anyway. \n\nI was leaning to YTA & this comment just pushed me all the way.", "What do you mean she fed herself already?  You don't make her dinner?  Sure my kids could make sandwiches or heat some soup or make oatmeal at 7 but she shouldn't have to feed herself at dinnertime.  You should be providing the meal to a 7 year old.", "OMG! I hope your ex gets full custody. \n\nWhen I separated from my ex, the last thing on my mind was bringing someone else into my child’s universe (and she was much older than your daughter). There is NO way I’d prioritize some guy over my child.", "Just give her to her dad already. Then you can have all the fun you want.", "You don't need to spend time with your kids 24/7.  But your kids care and happiness should be more important to you than your own.  You sound like you don't even like her, and she probably feels that way too.", "Oh my god YTA. Your poor baby.\n\nAwful.", "7 year olds shouldn’t have to “feed themselves” and still need lots of monitoring. If she went to school today you maybe spent 2 hours with her for the day. \nThat’s some stellar parenting. Sounds like she might be better living with her dad. Maybe he’ll pay attention to her. I generally feel sorry for you child.", "You should give your parental rights, all you care about is your boyfriend also, you are not so smart, your boyfriend is horrible too, basically killed the poor ferret, you show no sympathy towards your OWN DAUGHTER. YTA a million times, you should NOT be a mother.\n\nYour comments are horrible, you talk about your daughter as if she was your pet, not your child.", "Here’s the thing, she’s SEVEN. She doesn’t need to learn independence so you and your dude can pretend she doesn’t exist.", "She’s 7, so I’m assuming she’s in school all day already. Most schools don’t get out until around 3, then it takes time to get home, so that gives you 3ish hours with her (since it was already 6:30), but probably less since she had made her own dinner and eaten it.\n\nLook, I get kids that can be draining, especially after a hard day. I have a 7 year old myself, calling him a handful would be an understatement. My husband doesn’t get home until after bedtime, so it’s just me and him most of the time. It’s hard. But he didn’t make the decision to be born. I forced him into this world, so you’d better believe I’m going to do my best to give him a happy life, which includes spending time with him.", "You are despicable.", "Please, please, just let her dad have custody. It is clear you care more about \"adult time\" than your daughter. 7 year olds should not be independent yet! They can be learning but shouldn't be taking care of themselves. I won't say what I think of you for having a man you have only known for 2 months interacting with your daughter, let alone staying overnight because it would get me banned. I will simply go with YTA YTA YTA YTA", "You hate the notion that you should parent your child instead of going off with your bf of 2 months.  I feel awful for how lonely and sad your kid is when she is with you, I hope her father loves her.", "Yeah, your idea of parenting is not to give her independence, it’s to care as little as you can. \n\nYou got her a pet so she would leave you alone. You don’t love your daughter. Please give her to her dad. At least she will (I hope) have a stable home, not be trown out for your flavor of the day.", "You make your 7 year old feed herself? Do you actually consider her your kid or your roommate? And bro, being a parent means devoting yourself to being a parent and being there for your kid, which you are clearly failing at but don’t seem to give a crap about.", "YTA. Especially since it appears that either your buddy Kyle already has a key to your home or you let a 7 yo open the door to people. Either way, you’re a mighty poor excuse for a mother, taken on top of letting a small child cook her own dinner and eat by herself and banishing her to her room. And now the ferret, which you said was supposed to keep her from being lonely, is gone. Just let her live with her dad. Then you can have the social life you seem to want and she can have a home life where she feels valued.", "She was just craving for attention, poor girl.", "I assume she just let it run wild, since she said it ran off, but she didn't say anything about if it was injured. Either way, what a dick move.", "I think you must be the boyfriend as worked up as you're getting.", "Obviously the kid mentioned does. Just because a rodent isn't a good pet for you doesn't mean other people don't enjoy them. Hamsters are rodents but they're a pretty common pet.", "It's not a rodent. And I care.", "I agree with you 100%.  Phobias are irrational fears; they are not about lacking courage, or for that matter, 'a pair'.", "Ferrets have no homing sense like a cat or dog does - if they get out, chances are they’re gone for good.\n\nOp is a cruel AH - seriously, you that hard up for some male attention?", "Poor kid I feel so sorry for her, op yta  and  taken care a ferret is way harder than taking a kitten in which you should have gotten \nidiot, That poor ferret is domestic  right it won't survive a hawk would get it and killed \nthat ferret ands whocares   about your  boyfriend  you ex is right have a heart.", "“…he was hesitant to even go in Nina’s room knowing Peanut-Butter was there.”\n\nWhy is some random boyfriend looking to go into a 7 year old child’s room? The OP clearly wrote that this new boyfriend was (at least) attempting to go into a young child’s bedroom.", "The first part she said he is afraid to go in her room.", "☝️☝️☝️☝️", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yeah and like how long has she known this man to be completely aware of his fear of tiny animals? \n\nI am going to be honest I don't think my 7 year old brain could have understood a grown adult being petrified of a ferret to the point of violence. I would have probably  thought it was a funny act he was putting on and we were playing a game.", "Oh you know what, I meant the adults all suck, the child def doesn’t 🙈", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "He killed a child's pet in front of her. He probably shouldn't be invited back before he gets therapy and deals with his small animal murder disorder.", "She’ll defend kyle! Poor man and his fears, but fuck her 7 year olds feelings!", "There you go again...defending your 2 month fling while taking your anger out on your daughter.  Great parenting mom.", "And you're still with him and attracted to him after that..ugh..are you that lonely?", "Damn... I highly doubt Kyle is worth your time haha.. poor wil Kyle", "He killed peanut butter in front of your daughter. He isn't really the victim here.", "You, and Kyle, are pathetic.", "Lmao what a crap mother, no wonder her dads pissed. You basically showed your daughter men mean more than her. Man i wanna say more but I'd get banned. \n\nNicest thing i can say: i hope your ex goes for full custody bc disgusting \n\n\nYes this seems minor to you but your daughter is 7 this is locked in her mind now that shes less important than a 2 month fling.", "Why would you get your daughter an animal that you knew your boyfriend would hate? It's almost like you WANTED some sort of traumatic event to happen to your daughter out of spite because you resent caring for her, and her stress and trauma makes you feel good.", "This is pathetic. You’re TA. Stand up for your child, not your two month old boyfriend. Who threw an INNOCENT ANIMAL. That’s disgusting", "And if he’s willing to do that to an ANIMAL, how terrified do you think your poor daughter is now probably thinking he’ll do that to her if she makes him angry again?\n\nYTA", "I absolutely think it's the consequences of her own actions. But I don't think OP handled any part of this situation correctly", "Ferrets aren’t rodents. \n\nKid is 7. Kid loves ferret. Kid did age appropriate kid thing, believing that anyone who actually met Peanut-Butter would realise their ‘mistake’.\n\nYes, we all need to learn that different people like different things, and to respect boundaries, and that not everyone can get along just because you love them. \nBut that’s a process. It involves parenting. \n\nThis is just a big traumatic mess.", "Your ex is right. 100%", "What a crazy concept! Look for the animal. Put your child before some random man \n\nIf you had taken care of the child and the animal that you are responsible for first, you could have talked to your daughter and probably grounded her. But screaming at the child and abandoning an animal seemed like the proper choice to you because a man you barely know was upset ... that's fucked up thinking", "My God, you are so immature.", "Wait, you got your… checks notes… 7y.o. A pet that she’s taken remarkably good care of and when she makes ONE mistake due to immaturity/actually liking you bf and the pet gets out you can’t be bothered to even look for it? Because it’s “dark” and you’re “tired”. YTA you may have gifted your child that pet but it is YOUR responsibility as the parent to make sure that pet is taken care of, being tired is not an excuse. “Too late” what is wrong with you\n\nETA: at least go find the body, surely you can understand how bad it would be if your daughter found that later", "Have you even looked up tricks and tips for finding lost ferrets? We have a local one who gets out occasionally & has been found every time. They may be lucky but you didn’t even try to help her look?!?", "He’s right.  YTA.", "Well, someone here is a parent. A good parent. YTA.", "YTA. \n\nNina is seven. You thought a fitting consequence for a seven year old not wanting to be stuck in her room alone all night was… a dead pet? Because you didn’t want to wait for date night until she was safely back at her Dad’s house?\n\nI’m sorry but do better next time.", "He is correct. Poor kid", "Yeah I know. A lot of other things was on my mind while I was typing the comment", "I don’t think the pet should suffer obviously but I don’t really thinks there’s much that can be done if it ran off somewhere. The whole situation should have been avoided by simply not throwing a live animal at someone while greeting them at the door.", "Asking someone to give you some privacy for a few hours while you spend time with a friend is not selfish or inappropriate. Even a seven year old can hang out in her room full of toys. You understand that mothers are human beings, with a right to requesting some privacy, and you understand that asking a 7 year old to play in her room for the evening with her toys and her pet ferret is absolutely not child abuse, right?", "We had two ferrets, one was a real trouble maker. We'd take her out into the yard on a leash, and she slipped it once.\n\nI used a harmonica. Still don't know why, but it always made them run up to me like crazy. She came running up, and we got her inside.\n\nI only kept it for times like that. That trouble maker, stealer of bouncy balls, lived to 13.", "No it’s the mother on another throwaway account.", "It’s not a relationship it’s a booty call. Disgusting.", "And now she let her new boyfriend hurt her child's pet by throwing it down on fucking cement and refused to let her go try to save the poor animal. That's straight up traumatic to put a child through. Poor fucking kid.", "You misspelled ‘assume.’", "Oh I have no issue with kids being taught to feed themselves. But the feel here from OP is that when brand new boyfriend is around, kid is expected to make herself scarce, and take care of herself. Definitely not a \" this happens occasionally\" vibe.", "Well, you see, she desperately needed dick after her nap and then her child acted like a child which ruined her night dicking...", "Well no one’s caring for it anymore because it’s lost and most probably dead thanks to OP.", "Hamster are terrible pets for children, no pet is ready to be 100% a child's responsibility until they're teens, and even that is iffy!", "And if *you* knew how to read you would’ve read the part in the fourth paragraph where OP says “when he first started coming over, he was hesitant to even go in Nina’s room knowing peanut butter was in there” \n\nSo, Back to the original question, why did a boyfriend of less than two months need to go into the bedroom a 7yo to begin with?", "I understand that. But a child that young doesn't have the life experience to expect an adult to react like that.\n\nAn animal is potentially injured from being thrown by an adult male and is lost outdoors because the parent failed in many ways.\n\nOP was the one that brought up that he couldn't bear to enter the child's bedroom and I am questioning why in the hell he would have needed to go into the bedroom if a little girl. This shows a pattern of poor judgement on the part of OP", "I'm teaching her independence. She's old enough to grab a \"kid cuisine\" from the freezer and put it in the microwave", "Ferrets aren’t rodents, they are weasels.  Either way, the poor thing was abused and is probably now dead thanks to OP and her AH BF.", "Sure but it sounds like Kyle had just thrown the ferret so there’s a chance it was still nearby. OP didn’t even let her daughter look outside.", ">taken care a ferret is way harder than taking a kitten in which you should have gotten idiot,\n\nbUt It Is SmAlLeR iT mUsT bE eAsIeR - ([Quote,](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m57sp/?utm_source=reddit&utm_medium=web2x&context=3) OP)\n\n>That poor ferret is domestic right it won't survive a hawk would get it and killed that ferret\n\nbUt ThEy aRe ReLaTeD tO wEaSeLs ([Quote](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m8xpo/?utm_source=reddit&utm_medium=web2x&context=3), OP)\n\naNd ThErE aRe WiLd FeRrEtS ([Quote](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m9qd5/?utm_source=reddit&utm_medium=web2x&context=3), [OP](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5maqq7/?utm_source=reddit&utm_medium=web2x&context=3))\n\n>Poor kid I feel so sorry for her\n\nbUt I aM tEaChInG iNdePeNdAnCe ([Quote](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m6o3y/?utm_source=reddit&utm_medium=web2x&context=3), OP) and ShOuLdN't hAvE tO bE wItH kIdS 24/7 ([Quote](https://www.reddit.com/r/AmItheAsshole/comments/10jrd3h/comment/j5m5oo4/?utm_source=reddit&utm_medium=web2x&context=3), OP)\n\nETA - I hope it's clear: I completely agree with you, u/Prior-Second-8290 \\- and OP is a MASSIVE AH.", "I stand corrected. I must've skimmed through that part... though *maybe* it's because her toys were there and he was trying to bond with the child since her own mom sucks.", "The mom and the bf definitely suck. \n\nEdit: However, upon further consideration, the bf might not suck. If I was surprised at the door with a ferret, I might freak out too", "According to the post he basically just tossed it outside and it started to run away. Not really killing the pet in front of the child. Though it will likely die from another predator outside.", "Best comment. This is exactly what I was thinking after reading. Poor wil Kyle was scawed", "You're absolutely right!!! They definitely could have handled it way better than they did", "Thank you for correcting me! I absolutely agree with everything in your comment. Op should have definitely handled this better and absolutely not have introduced their SO to their kid after dating for two months.\n\nOp absolutely needs to do better by their kid", "I mean, she had to give her the cold shoulder, otherwise she would lose even more time with her booty call. I stopped reading at, “I lost my night with him”. The selfishness was too much. YTA, it was like 6:30, that’s not to late to go look for her pet. Sheesh.", "He wasn't respect someone else's phobia just to ward them off. I didn't want her to think that was okay. I have a fear of spiders, and if someone put one on me I would go crazy. I just want her to learn for the future, even if this is a tough lesson", "After she made the 7 year old stay in her room because she wanted to spend time with her boyfriend.", "Ferrets can survive in the wild because they're related to weasels. I didn't look for it because it was too late and she shouldn't have a ferret if she was using a living and breathing animal to weaponize it against others", ">I don’t think the pet should suffer obviously but I don’t really thinks there’s much that can be done if it ran off somewhere. \n\nBut that's what makes OP TA - to the animal, and the daughter.\n\n>The whole situation should have been avoided by simply not throwing a live animal at someone while greeting them at the door.\n\nTrue - but - the child is 7 - and OP failed on \\*SOO\\* many levels in being a responsible adult for the living beings in her house: both her child and the pet.", "And in another hour the child would have been about ready for bed.\n\nBut OP says that since it was 6:30 and the child had already made her own dinner there was no reason for the child to be present.\n\nBoyfriend could also come over for quality time when the daughter is at dad's house.\n\nIt's iffy parenting to have a man around the child after two months", "Lol you keep popping up with the same rhetoric. Does it hit too close to home or are you OP's burner?", "That pretty much seems to sum it up.", "I dunno why hamsters are terrible pets. They rarely bite, are easy to care for, and run slowly. I had hamsters from first grade to about 5th grade. Never a problem.   Not much more difficult than fish.", "Lol what part of this post said he needed to go in there? Your reading comprehension skills need some refining. Maybe she took him in there to visit with the daughter a few times, or does that sound too rational for you to understand?", "I will agree on all points but I will also say my daughters love showing off their room and all the toys in it. Everyone who comes and every time they come my girls rush to show them their room and play with them in their rooms. If the daughter invites her mom and moms bf to play it might have to be in the room depending on toys and how big. Barbie house are not easily moved. But absolutely OP YTA and if you want to just chill with your BF you wait until after her bedtime or when she is with her father. Hopefully you have posted about a lost ferret because you owe your daughter one Peanut Butter", "I think you're just lazy and don't want to care for your own child.", "Independence is a fine lesson to teach but complaining that you have to spend 24/7 with your child but then also saying you’re teaching her to be independent doesn’t work. You aren’t spending 24/7 with her. You’re giving her a lot of responsibilities and then locking her in her room which is unfair to a child", "Yikes, YTA. How often are you cooking dinner for your daughter? How often is she isolated to one room so you can have alone time with your new boyfriend? \n\nI can’t fathom how a parent could care so little about their child being distressed over their pet. You sound cold and selfish, especially considering you’re upset “she ruined the night”.", "That's not independence. That's neglect.", "Shes 7 she needs a parent and dinner not independence and microwaved garbage??", "I am a licensed therapist and I am here to tell you that, although I get what you're going for, you are incredibly misguided here. She is seven years old. She should not be in charge of feeding herself. Grabbing her own snacks, sure. Dinner? No. \n\nI am also concerned about the child being put in a room so you can have private time with your boyfriend. It's not unreasonable to expect alone time once she's in bed and asleep. She's seven. She wants to be with her mom and other adults that she cares about. \n\nSome might find this dramatic, but this could easily become a negative core memory for her. Not only the trauma of suddenly losing a pet, but also being made to feel as though it is her fault. I would strongly encourage you to apologize and try to make it right.", "My knew how to make basic things when they were 7 but when I came to meals, it was my job as their parent to feed them. There is a balance between teaching independence and neglect. No child should be forced to stay in their room just because their mother is more focused on her latest man. You’re a parent and you need to put your child first.", "You call it teaching independence, I’ll call it lazy patenting and borderline neglect.", "“Teaching her independence” what a joke. Coming from a kid whose mother chose to spend her time with her boyfriends and lived in frozen meals, spoiled alert: I barely have a relationship with my mom now as an adult. \n\nP.s. from your other comment about “parents not needing to spend 24/7 with their kids” your time off from your kid is when she’s at her dads, get over yourself.", "I hope CPS pays you a visit", "Yeah, no. Feeding her is YOUR job.  YTA", "You are a bad mom, cps should visit you...", "Both adults also refused to look for the animal. They killed her pet and yelled at her for ruining the booty call", "Yeah OP is attracted to a cruel coward...what a turn on ..what a stud..thinking OP is super desperate", "And are you going to address the other topic that everyone else keeps pointing out?  Why are you prioritizing some random dude you barely know over your 7 year old child that you chose to have?", "Cool, letting a domesticated animal die from exposure is awesome. Great lesson to learn.", "You’re a total ASS, worst parent of the year, and honestly I can’t understand why people like you bother having kids or pets at all. Teaching consequences, SURE! Ground her ass, even REHOME her ferret, have her write an apology note to Kyle whatever. LEAVING a living creature that your child obviously DEEPLY cares for, a LIFE that your child has now been forced to lose because YOU are not just a shitty parent, but a shitty person. She now has to deal with something that heavy, and I hope she HATES Kyle for being such a wuss ass, really? Throw a ferret? Grow up. You need to grow up too.", "She already learned. She lost her pet. The same pet you didn't help look for. But all you focused on was YOUR BOYFRIEND.", "He’s hopefully older & more mature, so I’d hope de wouldn’t act like a 7 year old. Pretty sure losing her pet is enough to learn a lesson", "If his phobia is so bad, why did he try to go into Nina's room in the first place?", "It wasn’t too late. You’re full of excuses. DOMESTICATED animals, like a ferret, are not going to survive as well as a weasel. That doesn’t help her heartbreak either. It also would depend on the climate a lot. How old is the ferret", "Just admit that you care more about your 2 month fling than you do about your own daughter.  We all can already see that it's true anyway.", "It’s a living, breathing animal that you’re happy to allow to die being ripped apart by a predator just to teach your (very young) daughter a lesson? She made a mistake, but even if she was trying to scare Kyle, her feelings were hurt and children do much shittier things for far worse reasons. Does she even understand the full extent of a phobia? Your daughter sounds like a sweet kid who’s otherwise shown love and care for her pet and actively enjoys spending time with your boyfriend. Plenty of kids would be brats screaming the house down every time he came over. Put in the effort to at least try to find her pet. Put some food out, a blanket with its smell, I don’t know, anything to at least try to mend the relationship with your daughter. She’s more than learned her lesson by now, holy fuck.", "Sooooo… your solution is to release a pet, something not native to your location, into the wild. Because a 7yo made a mistake like 7yo’s do? Wow. \n\nINFO: You know this is all on you, right? You are the crappy parent who decided to weaponize a pet. You are deliberately causing distress to your daughter and choosing to portray it as “a lesson”. It’s on you that you got a damn ferret which are significantly harder pets than cats. You did no research about them at all, eh? It’s on you that you left a **7 year old** in charge of it. It’s on you that you’re picking some random dude over being a decent parent to your child. It’s on you that you don’t actually seem to have a clue about parenting. \n\nAlso INFO: I’ve read some of your replies and this can’t be a real post right? No one is this damn ~~clueless~~ stupid. I’m going with stupid.\n\nOh. And feed your kid, lady. A 7 year old shouldn’t be in charge of their own dinner. Good lord.", "Stop pretending your daughter was trying to hurt your bf. She’s 7 and and likes your bf. Her brain thought she could make him like her ferret. \nYTA big time. \n\nYou’re making excuses for not looking for your daughters pet. Bad excuses.", "That’s not how it works. This was a pet, not a wild animal. It doesn’t know anything about living in the wild. I doubt it’s local to your area. It doesn’t have a social group or a winter den or food stored up.", "You DAUGHTER is not weaponizing the pet.  YOU are.  YTA", "Dear lord OP, she’s a child! YOU got her the animal anyway, but the second it affects your dating situation, you’re going to let a poor animal and your child get crushed? How can you not see YTA here??", "I think the issue is that way too many people treat hamsters like fish and think that if you put food in the cage and occasionally clean it out, you're good. They need enrichment and if you don't give it that they can start engaging in destructive behaviors.", "Hamsters require a big space and ton of enrichment. Which might be too hard for a young kid. Most small pets are actually harder to care for than advertised when done properly. Like fish don't belong in a fish bowl etc.", "Why though? That's the question. There is absolutely no reason an adult stranger should be in a child's room.", "This is actually so funny to me. The literal next sentence is “he still tried his best though, despite his phobia” so who’s reading comprehension skills need work? Yours! \n\nThey can visit in common areas of the home . There is NO reason for him be going into her bedroom and the fact that it’s significant enough for her to mention says something to me. Why is him not wanting to enter the room even a consideration??\n\nYou’re arguing over a minor detail in the overall post but ignoring all of the glaringly obvious red flags mom is flying all over the place. Go troll somewhere else.", "I wish I could upvote this more than once!", "Oh no, they are both absolutely asshole for both not looking for it and yelling at the kid. Just wanted to pipe in to say fear reactions are irrational. It's not like he kicked a puppy on purpose. But still, assholes for the everything else.", "I don’t understand what OP is supposed to do here. Her daughter has her own room but her spending time there is ‘prioritizing’ the bf?", "I prioritize her education first and foremost, and teaching her to be kind and respect others is important", "Lol you people want this guy to be some kind of creep so bad. Nowhere in the post does is say he was ever in there alone or for what reason he was in there. But i guess it’s easier to make stuff up than actually form an opinion using the information OP provided.", "Lol “he tried his best though” implies that he was invited inside the room to visit with her daughter, and fought through his phobia to do so to be nice. You sound dumb. You are turning this post into something that it’s not to fit your own narrative and make the boyfriend out to be some predator which is gross but I guess typically of most redditors who can’t read well and decide to fill in the blanks of post with things they just make up.", "But you're not kind to her and you don't respect her.  You try to crate her like she's a pet just so you can spend time with your booty call.", "And forcing her to stay in her room because you wanted to spend time with your boyfriend is important to her growth, how?", "You left an animal outside to die which is neither kind nor respectful", "Wrong - you prioritized your “boyfriend”.\n\nJust give her dad custody, and save your daughter from more mom-inflicted trauma.", "In what regard is it kind or respectful to force someone to stay in their room so your boyfriend can come over? I don't think this is teaching kindness or respectfulness at all.", "You are a hypocrite. You want kindness from your daughter when you showed her none. You basically grounded her anyway before she did anything wrong just to make Kyle happy. Your child is not your property that you can just put away to make things convenient for you. It disgusts me that you choose a man over your child. It's her home, Kyle's the guest, not her.", "What about the kindness she SHOULD be getting from you?  Starting with you IMMEDIATELY going to find her pet.  Except your booty call matters more to you, right?  YTA", "You sure taught her, Op. She will remember this lesson.", "Well, you set a poor example of being kind and respecting living creatures.", "You neglected her and killed her pet. \n\nThat's all you're teaching her, that you are a monster.", "You mean like banishing her to her room so you can fool around with your latest boyfriend?", "You don’t respect her or her feelings.", "Can you please explain how not helping her look for her pet that she loves and leaving her animal to die out in the wild is kind or respectful to your daughter?", "Exactly!! This isn’t respectful at all. This is teaching the daughter she is a burden."]}