{"id": 8137, "submission_id": "10jvhmn", "title": "WIBTA if I pretended to be a ghost?", "selftext": "Ok so this was not the intention when I did it.\n\nMy sister suddenly passed away a couple weeks ago. To make a long story short, drama has ensued. \n\nI was the one to gather my sister's belongings. There was not much.\n\n My mother and sister were never close. Barely spoke in the last 2 years.\n\nIn her possessions is a statue. A mother daughter one. My mother collects these statues. She does not know I have it. Considering my sister's life style the past couple years, it says something that she chose to carry this with her. She was 45. \n\nI wanted to get it back to my mom, but didn't want a show, or any drama. I just wanted her to have it. \n\nSo when she was using the bathroom I placed it on top of the hutch where she keeps them. She's pretty anal, she's going to notice it soon. \n\nIt just occurred to me, that my mother, being in a state of mourning still, as its only been a little over 2 weeks, might have a \"omg you'll never get this\" moment. \"The statue i gave your sister appeared on my hutch\" I can hear it now. She's a smart woman, but we can empathize how that could make her feel.\n\nI just intended to get it to her without giving it to her. I didn't think it through. \n\nWIBTA if i told her the truth if she is comforted by it appearing?", "created_utc": 1674529371, "permalink": "/r/AmItheAsshole/comments/10jvhmn/wibta_if_i_pretended_to_be_a_ghost/", "score": 54, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I unintentionally may have played the role of my sister's ghost\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Well first off I’m sorry for your loss. Secondly, I hope it’s okay to say this title is pretty funny.\n\nYou kind of ask the question in two conflicting ways so I can’t really give a judgment, but I’ll just say if you think your mother would be comforted by seeing the statue, you should give it to her, but you should also not scare her to death. Let her know that you found it and wanted her to see it. Maybe it will provide her some comfort.", "I’m sorry for your loss.\n\nYou should absolutely message your mum and let her know what you did though, before she notices it, since YWBTAH if your lead your mother on like that.\n\nI think it’s sweet that you want to comfort her, but making your mother think that her daughter’s ghost had visited her could pose problems in the future that you probably haven’t considered yet. Best not to interfere with her grieving process and just let her know what you did.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOk so this was not the intention when I did it.\n\nMy sister suddenly passed away a couple weeks ago. To make a long story short, drama has ensued. \n\nI was the one to gather my sister's belongings. There was not much.\n\n My mother and sister were never close. Barely spoke in the last 2 years.\n\nIn her possessions is a statue. A mother daughter one. My mother collects these statues. She does not know I have it. Considering my sister's life style the past couple years, it says something that she chose to carry this with her. She was 45. \n\nI wanted to get it back to my mom, but didn't want a show, or any drama. I just wanted her to have it. \n\nSo when she was using the bathroom I placed it on top of the hutch where she keeps them. She's pretty anal, she's going to notice it soon. \n\nIt just occurred to me, that my mother, being in a state of mourning still, as its only been a little over 2 weeks, might have a \"omg you'll never get this\" moment. \"The statue i gave your sister appeared on my hutch\" I can hear it now. She's a smart woman, but we can empathize how that could make her feel.\n\nI just intended to get it to her without giving it to her. I didn't think it through. \n\nWIBTA if i told her the truth if she is comforted by it appearing?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "This literally happened like 2 hours ago. I was driving home and was like oh shit! \n\nThink I should text her I put something for her on top of the hutch, then she can be surprised by what it is?", "I am going to call her first thing in the morning. I think me calling this late might scare her more in the moment.", "I would just call or text and let you know what you found, and where you put it. That way she can prepare unless it would be shocking for whatever reason.", "Why do you want it to be a surprise? Just text her and tell her. This is probably not a great time for emotional surprises.", "Just text her \"Hi mom, I forgot to tell you I put sister's statue on the hutch, I hope that was OK.\"\n\nNot everybody thinks a surprise is a good thing.", "That’s fair.\n\nI’d be less worried about scaring her and more concerned about leaving her with what seems like concrete evidence that her daughter had visited her. That sort of thing can lead people to make terrible decisions, like hiring expensive mediums, refusing to move no matter how badly they need to, it can also lead to serious depression if they believe they were contacted once and were never contacted again.\n\nIt’s fine though, your heart was in the right place. Grief can lead people to do silly things. \n\nI hope that your grieving process is easy and thorough, and that you can enjoy the comedy of this situation someday (because this story is actually quite funny despite the morbidity)", "Honestly it may bring her peace to think her daughter is making peace from beyond the grave. You may ruin it for her. Just leave it alone and if she says anything, gently tell her."]}