{"id": 8178, "submission_id": "10kbbj8", "title": "AITA for not realizing my son brought home his actual girlfriend?", "selftext": "My (56M) youngest son \"Tanner\" ( 19M)  as far as I knew was gay. He'd only ever talked to me or his older brother's about crushes on boys as early as middle school.  He only had boyfriend's throughout middle school and highschool and the first relationship he had in college was a guy.\n\nOver the weekend Tanner came home with a girl \"Natasha\" (20F). He introduced her as his  \" girlfriend Natasha\" and a little confused we just kinda went with it . I was just thinking he meant girlfriend in a friend way. Though in hindsight Tanner's never been really feminine so I just kinda chalked it up to him discovering himself more at college.  At dinner Saturday night I asked about how his  apparent ex Corbin was doing and if they had moved in yet not realizing yet they clearly broke up.  \n\nMy other boys apparently got it already and started snickering and Natasha looked confused while Tanner got mad. I  finally noticed Tanner getting upset and  asked what was wrong and he yelled at me about how he  introduced Natasha as his girlfriend when they got there and I had an oh shit moment. I tried talking to him Sunday before they left  and I tried to explain that I  hadn't realized and gets mad and tells me again that he literally introduced her as is girlfriend. I told him I thought he was gay and he gets mad and says that he's bi and that he never explicitly said he only liked guys. AITA", "created_utc": 1674582499, "permalink": "/r/AmItheAsshole/comments/10kbbj8/aita_for_not_realizing_my_son_brought_home_his/", "score": 578, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Making assumptions about my son. Not realizing Natasha was his girlfriend.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH – You put your foot in your mouth. It happens. If he's mad because she didn't know he likes guys, you did him a favor. It's better she knows now and either accepts him for who he is or doesn't. It'll come up sooner or later.", "fellow homosexual here. \n\nhahahahhahahahah NAH", "You’re NTA, it was a misunderstanding, not something you did to be malicious.\n\nYour son can’t expect you to know what he doesn’t tell you, and you can only base your knowledge off of the things you know.\n\nI suggest talking to him about the situation and make sure he knows that you weren’t meaning to upset him or anything, you were just going with what you knew.\n\nPersonally though, I don’t think you’re an A H.", "NTA\n\nIt sounds like you made an honest mistake with the context you had at that time.\n\nPerhaps this draws some attention to needing to be more aware of what’s going on in your son’s life. Not in a nosey way. He obviously shouldn’t expect you to know anything he hasn’t told you (which is why I feel his reaction makes him the AH here). \n\nHowever, it makes me wonder if there is any reason he hasn’t shared any of this information with you before, both about being bisexual and going through a breakup. Perhaps there is a need to build more trust and openness between you both, or more initiative on your end to know your son better.\n\nI don’t mean that to sound rude or to discredit you as a father. Just stating something to consider, if you haven’t already.\n\nBest wishes to you. 💙", "NTA. You didn’t mean it maliciously, you went off of all the knowledge you had. If your son hadn’t bothered telling you him and his ex had broke up, how were you to know? Have a chat with him and maybe just apologise to the girlfriend and say you genuinely didn’t know and had an ‘oh shit’ moment.", "Look. As a bisexual, I have known a lot of older folks who decide to assume once they know I like the same sex that I must be gay and literally never consider the possibility of bisexuality because (and this is the shitty part) they don't think it exists. Only gay or straight. I don't know if that's you so I'm not accusing you of it.\n\nBut when your son comes home with a girl that he literally introduces to you as his girlfriend and you keep making comments full of stereotypes (\"he never was very feminine\") while skimming right over the actual words coming out of his mouth and never bothering to take a minute to clarify them, that's probably the nerve you stepped on.\n\nI don't think you meant to be TA. But I do think you accidentally acted like people who definitely are. It's up to you if you keep trying to convince him that you aren't an asshole or if you simply tell him \"I'm sorry I hurt your feelings and didn't pay close enough attention to what you told me. I love you and your girlfriend seems lovely.\" At this point, continuing to justify what you did and said is continuing to risk sticking your foot in your mouth, whereas simply offering a straightforward apology for the mistake and an acknowledgment of what your son was trying to share with you is probably the best way to make sure he KEEPS sharing things with you. I think a lot of people get stuck on trying to prove they didn't mean harm when all that's really needed is acknowledging that harm happened anyway and moving on with the day.", "NTA.  It sounds like a very confusing situation.  I admire you for caring and trying to be involved in your son’s life.  Keep trying.", "NAH - it's a misunderstanding. He'll get over it.", "NAH. I mean, at the moment I'm sure you are to Tanner, but this is seriously going to be hilarious down the road.", "I'm leaning NAH, with maybe a soft YTA for the lack of tact before you were sure what the circumstances were. Obviously you can't be expected to know things without being told and you made some incorrect assumptions, but all you can really do is apologize and hopefully he'll realize that it was just a misunderstanding and let his anger go.", "NTA just a misunderstanding... Let him cool af..tell him you didn't know he was bi", "Mild YTA. You didn’t mean to engage in bi erasure, but you did.", "gentle YTA. \n\nthere was nothing malicious in it, but if you were confused when he introduced her as his girlfriend, that was the time to ask.\n\n\n\"oh, the two of you are dating? lovely to meet you\"", "Idk you’re kinda TA.  Yes it slipped but if he says she’s his girlfriend yeah let me put my son on blast that he’s gay/bi in front of her and embarrass your son.", "NTA it's hard to keep up, sometimes.", "YTA for assuming your kid was lying to you when he told you he brought his gf.", "YTA.  Guys do not apply the term girlfriend unless that is a situation where the two of them are bumping uglies.  Even gay guys do have girlfriends (have regular sexual relations with females) sometimes.  It's rare, but it happens.  Even if he was on record for the whole family stating he was 100% gay (which is not the case)\n\nHis announcing a girlfriend clued everybody else into the situation.  Your comments about his recent boyfriend, in context, were quite...inappropriate.", "NTA\n\nSounds like an honest mistake. But next time try to avoid talking about exes just in case..", "I’m leaning NTA because it was a misunderstanding, but maybe you could have asked him privately?   I agree with others that you could communicate more with your son and would have known he and Corbin broke up, but communication goes both ways and you don’t have ESP.", "INFO: How much of this was said in innocence and how much was passive-aggressive? It's  not clear to me.", "Did you two never talk about his sexuality? Small YTA he did introduce her as his GF if you were confused could have easily pulled him aside and asked quietly.", "Yta he literally said his 'girlfriend Natasha'.  How much clearer could he possible be??????", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (56M) youngest son \"Tanner\" ( 19M)  as far as I knew was gay. He'd only ever talked to me or his older brother's about crushes on boys as early as middle school.  He only had boyfriend's throughout middle school and highschool and the first relationship he had in college was a guy.\n\nOver the weekend Tanner came home with a girl \"Natasha\" (20F). He introduced her as his  \" girlfriend Natasha\" and a little confused we just kinda went with it . I was just thinking he meant girlfriend in a friend way. Though in hindsight Tanner's never been really feminine so I just kinda chalked it up to him discovering himself more at college.  At dinner Saturday night I asked about how his  apparent ex Corbin was doing and if they had moved in yet not realizing yet they clearly broke up.  \n\nMy other boys apparently got it already and started snickering and Natasha looked confused while Tanner got mad. I  finally noticed Tanner getting upset and  asked what was wrong and he yelled at me about how he  introduced Natasha as his girlfriend when they got there and I had an oh shit moment. I tried talking to him Sunday before they left  and I tried to explain that I  hadn't realized and gets mad and tells me again that he literally introduced her as is girlfriend. I told him I thought he was gay and he gets mad and says that he's bi and that he never explicitly said he only liked guys. AITA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Gonna go against the grain and say YTA cause you made a very big assumption on your son's sexuality without being told. Bi is a thing, and he was very clear in introducing her as his gf- you just let your misconception cloud your understanding \n\nNever assume someone's sexuality without being told\n\nWhile you didn't mean to do it, it was a bit mean and put your son and his new gf in an awkward situation", "[deleted]", "Soft as can be YTA. It was clearly an honest mistake, but it was a bonehead move to say it in front of Natasha.", "YTA.  Too bad you choose to not listen to the literal and actual words coming out of your son's mouth.", "NTA.  your son is.  but only minorly.  it's not a big deal", "His son explicitly told him he brought his GF.  \nDad decided not to believe him.", "[deleted]", "Plus once he actually talks to him. He might actually learn something about his child", "I would agree.  Bi seems to have never entered OP's mind.", "Have to agree. Mild YTA.", "Why would that be embarrassing exactly?", "For what it’s worth, I have a couple of friends who are men, only one of whom is gay, who refer to platonic friends as “girlfriends.”", "Are you the spokesperson for all guys in the world now?", "Yeah that’s not true at all.", "What? I referred to my friends who were girls as girlfriends all of my 20s.", "passive aggressive?", "For what it’s worth, I have a couple of friends who are men, only one of whom is gay, who refer to platonic friends as “girlfriends.”", "I think the main misunderstanding here is the way the word girlfriend is used. I’m a lesbian and when I say girlfriend I obviously mean my romantic partner, but when I say that, people sometimes interpret it as “girl who is (my) friend” because the term is used by others to mean a platonic friendship.\nIt’s frustrating when people misunderstand what I mean, but if it’s a genuine mistake and they aren’t aware of me/my dating history, I understand why they might not realize and I’ll clarify.\n\nI understand why the son is upset, and I also understand why op was confused. I don’t think it’s a “dad not believing him” thing I think it’s an accidental misinterpretation thing.", "Not to be homophobic in any way. But (in my experience) a lot of gay guys call their female friends their “girlfriends”", "It's common for people to call their friends who are girls their girlfriends. There's even a whole TV show called that lol", "Girls call their friends girlfriends sometimes, don't mean their dating. This was just miscommunication.", "I’m a straight woman. Many would refer to my friends that are also girls as “girlfriends”. That wouldn’t mean anything other than they are friends that are girls. Especially with older generations. It’s not anything to do with lgbtq. \n\nIf he never came out as bi to dad, and dad had only seen him with boyfriends, he made an assumption since girlfriend is code for friend that is girl. It’s that simple.", "I should’ve said reiterate instead of talk to, but because I’m assuming OP wasn’t able to get the full point across the first time, trying to communicate it again after the moment has passed might be helpful. The son may have had time to think about the interaction, and hopefully will be more willing to listen.", "Do they take them home to meet their Parents and introduce them as their \"girlfriends\"?", "Of course not.  It is telling that there is only one person in the OP family who would have misunderstood me if I was, though....", "That must have caused some awkwardness, at times...", "Tbh as someone who's not the best at context, it does sound like it could be passive agressive.", "[deleted]", "Except son wasn't a gay man, dad assumed he was gay. Also described son as \"not overly feminine\", which Im taking to mean that would be out of the norm for him", "I certainly hope you’re right. 💙", "The one who is gay might, actually, but you make a fair point. I’m just trying to say that there may be some exceptions to what this commenter said.\n\nIf my gay friend told me he was bringing his girlfriend to come hang out with us I, knowing him, would assume it’s a platonic friendship.", "Or, perhaps there is a cultural shift taking place, as has happened with other words or phrases over time.\n\nHave you honestly never heard a woman say they’re going out with their girlfriends? If you apply the English literally that means they’re claiming to be in romantic relationships with their whole friend group.", "That’s a reasonable assumption given all of the past relationships OP knew about were with males.", "Not reasonable because his son was actually bi. And literally brought home a girl introducing her as his girlfriend. And following implications were son does not use effeminate language that would describe a friend as a girlfriend \n\nWhy he gets the AH vote is he literally ignored his sons personality because of his impression that he was gay. OP made a big wrong assumption", "Where does it say his son is bi? He’s only dated the same sex and only talked about the same sex.\n\nIf a gay man introduced me to his girl friend I would assume she was his girl who is a friend. In the same way I would assume a straight woman who introduces her friend as a girlfriend is just a girl who’s a friend.", ">Not reasonable because his son was actually bi\n\nUnless he told OP that, then it makes sense for OP to come to his own conclusions based on his observations of his son's dating history. It would be one thing if the son said he was bi and OP is just ignoring that bc he only sees his son date guys, but it sounds like Tanner waan't explicit about his secuality. You can't expect OP to know Tanner is bi if Tanner never says he is.", "NAH\n\nGirlfriend can sometimes, especially by gay men, be used as a term for friend. \n\nYour son never communicated that they broke up with their previous partner. Your son has also never before, to your knowledge, had relationships with women. To your knowledge, he’s gay, not bisexual. Apparently that’s not the case.\n\nI hope this girlfriend didn’t find out your son, her new boyfriend’s sexuality at this time. Not that it matters to most people, some people might be shocked to find out their partner isn’t straight. It’s something my husband knew about me from the very beginning, I’m a bisexual woman. Son is already “out”.", "Bi erasure is a valid concern so I get your son's anger but you seem like you genuinely misunderstood and then presumably apologized for your mistake so NAH.\n\nEdit: INFO. Did you apologize? If not Y-T-A.", "NTA. Calling female friends \"girlfriends\" isn't exactly uncommon, I definitely understand the confusion. No reason to make a big deal out of it, Tanner could've just clarified their relationship status in that moment instead of getting all worked up about it.\n\nI do wonder though how much you're involved in your sons life. If you thought Corbin might've already moved in with your son, I assume it was a rather serious relationship between them. Yet you didn't know they broke up, and that for a time long enough for Tanner to find himself a new girlfriend.   \nI would assume Tanner might feel like you don't care enough about his life and that's why he's pissed that you don't even know about his sexual orientation and apparently never asked about it.", "NAH, this will be a funny story that will be repeated lots if they stay together.", "NTA\n\nSend him a text saying that he never told you he was bi. That you thought he was gay because he never mentioned liking girls. If he still made over it that's on him. Atleast he knows your side.\n\nYou don't have to keep apologizing for it. He's either going to forgive you or not. He might be more upset you brought up his ex. Probably a sensitive thing for him.", "There was zero malicious intent, it will be fine. NTA", "Clueless dad.\n\nPay more attention next time. Nta, but just... my dad would do this.", "YTA. You are still holding on to misconceived notions and latent homophobia, otherwise you would have realized when he said he had a girlfriend, he has a girlfriend.\n \nFeminine in no way equals gay.", "NTA. Your son overreacted. You seem like an extremely supportive father.", "NTA.", "NAH\n\nDo talk to your son though and reassure him it was an honest mistake. \n\nLike how are you supposed to know he's bi? Or pan? Like, he's dated only men and all signs up until now pointed to \"gay\".", "NAH. It was a misunderstanding. I imagine everyone will get over it.", "NTA. It was a misunderstanding. People in the comments are harping on about bi erasure, but it sounds like OP’s son has had several relationships, all of which were with guys, so I don’t think OP made too big a leap by thinking his son was gay", "No your not the AH, your son buried the lead.   Where was the phone call \"mom, dad, I've met the amazing girl named Natasha, she's the greatest girl ever, I can't wait for you to meet her\"?     Then he gets mad when someone you've never heard of comes walking and there was no confetti?", "NTA\n\nIt was a honest mistake. Also, frankly, if she's his girlfriend, it's not cool if he's deliberately hiding his sexual history.\n\nIt's unfortunate if she found out this way, but also if the relationship is solid, this shouldn't be a huge deal.", "NTA  It doesn't sound like Tanner bothered to tell you he broke up with Corbin and started dating Natasha, just showed up with her, so I can see how you made the mistake.  Tell him it was unintentional, you're sorry if he was embarrassed, and that he needs to keep you updated on his life if he expects you to be up to speed with his relationships.", "NTA \n\nYour son overreacted", "This is why I hate that people use “girlfriend” to mean a friend that’s a girl. As a queer guy I say NTA, it was a simple misunderstanding.", "YTA for assuming all gay men are feminine.\n\n\nETA: I've never met anyone under the age of 60 who uses \"girlfriend\" to refer to their friend who is a girl. That's simply not something people my generation or younger do", "Na, you don't bring up your kids x in front of the new partner no matter the genders. OP is an AH.", "Who is TA? This seems like NAH to me.", ">If he's mad because she didn't know he likes guys, you did him a favor.\n\nI didn't get that impression at all. It isn't suggested by the post. I assumed he was mad because his dad was asking how his boyfriend was and if they were going to move in together soon, in front of his current partner. I can see why he would be offended on her behalf, and feel awkward.", "\"Hrm thats weird he called her his GF, I better bring up his ex-boyfriend.\"  \n  \nYeah, OP is an AH.", "I totally get your response and agree with you that bi-erasure is real and is a problem. But....why on earth would the son just show up with a total stranger without any notice to his parents? He never told them he broke up with his boyfriend? Never told them he was dating someone new. never told them he would be bringing her over?? It's just such a weird way for the son to act that I feel like this story is fake.\n\nI brought a few boyfriends home over the years and like...always asked if I could bring them over. If I just rocked up with a random person they'd be pissed at the lack of warning. This whole situation is weird to me.", "Exactly this. Especially the last part.\n\nOne of the worst things about being bisexual is of course having to come out, but to certain people it seems like it's constant if I switch genders of partners.", "Wish this was the top comment.", "Sounds like very insightful and good advice.", "This, all this right here.", "Yes, and who the hell would ask about a person’s ex when the person pretty clearly identified the new guest as their girlfriend? OP’s definitely the AH", "But his son isn't feminine? Not sure what that has to do with anything except revealing ops homophobia.", "My cousin calls all his friends who are girls his girlfriends, so I do not blame OP.", "But his son isn't feminine /s", "You would be wrong I know several guys that do moron", "My gay friends call me their girlfriend all the time. It's a thing...though unfortunate in this situation because it caused a misunderstanding.", "One of my gay friends calls me and his other female friends girlfriends. \n\nI’m bisexual and call my group of lady friends “girlfriends”, and I’m married to a man. And sometimes I’m like “I’m going out with a girlfriend” instead of “I’m going out with a friend.”", "The whole point was that OP didn’t _know_ Corbin was an ex", "I say NTA because although I understand Tanner’s frustration, I don’t really think it’s fair to get mad at someone for not knowing something you never told them. The yelling at OP part is what I personally consider to be A H behavior, but I do get why Tanner was upset.", "I mean. I have definitely told my parents \"hey, I'm bringing my partner home\" and not specified anything further than that before. I did the same thing with my best friend's parents, and they were exactly the sort I described where they didn't think bisexuality was real. So when I told them I was bringing a partner over to meet them and it was a girl they would talk to me about how they were happy I trusted them with being gay. When I later came home with a boyfriend they very confusedly asked me if the gay thing had just been a phase.\n\nIt's not actually that weird for bi folks not to be specific in their language about partners when they mention them in the abstract, and in this particular case (no offense meant to OP) it TRULY does not sound like OP and his son have a close and communicative relationship about the detailed ins and outs of the son's relationships, so I don't think OP expected or got anything more than a quick \"hey I'm bringing my partner home with me this time\" when the son called.", "I’m not particularly close with my parents (especially about dating), but it is weird to me if they explicitly know you’re dating someone else but you’re bringing a new partner to not say “hey, so and so and I broke up I’m bringing someone new”", "> But....why on earth would the son just show up with a total stranger without any notice to his parents? He never told them he broke up with his boyfriend?\n\nCould be lots of reasons.  I refused to discuss who I was dating with my dad for about a decade, because he was obnoxiously nosey about shit that wasn't his business.  He'd get to meet a partner that I was dating if the circumstances came up, but I _absolutely_ didn't keep him updated when I broke up or started dating someone else.", "When you weren’t told they broke up? Like as a bi dude I am well aware bi-erasure exists. But OP was still under the impression the Tanner was dating Corbin. It’s not like he was introduced to Natasha as Tanners girlfriend while he thought Tanner was previously single. He was under the impression that his son was in a monogamous relationship with a man.", "Some people do. Op says his son didn't do that though.", "This is why I've started using the word partner when introducing. It does sound a bit more \"official\" than gf/bf  but it kind of makes the \"relationship declaration\" less ambiguous.\n\nEdit: I get tired of people asking if my date is a gf or my gf. It really shouldn't matter, but some people really seem to NEED to know.\n\nedit: if to is.", "Kinda pictured this as, Girlfriend with a capital G or girlfriend with a lower case g. G being partner and g being friend.", "Yeah, that was how I would have read it too.  Especially if son was casual about it.   \n Just a miscommunication, NAH.", "I literally just asked my husband if it was cool if I went out with my girlfriends on Saturday night and he did bedtime with the offspring. I’m a straight woman. It’s a completely normal turn of phrase for lots of people. Hardly intended to be bi erasure.", "Maybe it's regional or something but I don't know anyone who does that besides like my grandparents and aunts", "Really? I know families have different norms but they didn't follow up with any questions? No \"how long have you been dating\" or \"what's their name?\" or \"do they have any dietary restrictions\"? Just no questions, at all, about this person you were bringing to their home? I'm just a bit flabbergasted. I'm not super close with my family either but if I wanted to bring someone home I'd give them a quick run down of the person's name, how long we've been dating and if they needed any accommodations. If I didn't think of it they would ask.\n\nI would think the son would at least give a heads up like, \"hey I dumped X and now I'm bringing Y to dinner\" so that the parents don't say awkward stuff like \"oh how is X doing?\" in front of the new partner. I feel like at least some of this is on the son for not giving a heads up to avoid making his new partner feel awkward.", "See the issue is it sounds like Tanner didn’t say ‘hey btw I broke up with Corbin a while ago and I’m bringing my new partner when I come by later’. He just showed up and said ‘this is my girlfriend Natasha’. So OP’s information at the time of the introduction was that Tanner was still dating Corbin. Now was OP a little dense? Absolutely. Do I necessarily blame him? No. As a bi dude myself I get how it can suck to have people disregard your relationships as you being ‘wishy-washy’ or how ‘you just can’t make up your mind’, but that’s not what was happening here.", "Yeah like, all of this could have been avoided if the son had just given them a heads up that he was bringing someone over and it was a girl. I'm all for fighting bi-erasure, but I don't think OP was wrong for assuming his son was gay if he's only every talked about boy crushes and only ever dated boys. OP's son is young so it probably explains a lot of this, but he really should have seen this coming. A quick phone call of \"so-and-so and I aren't dating anymore and also I'm dating a new person her name is such-and-such and I'd like to bring her over for dinner\" and gotten all of this out of the way ahead of time.", "That's kinda my point though. If your parents suck, are nosy and controlling etc, why even bring a partner home? This wasn't a circumstance that just came up. OPs son deliberately decided to bring his girlfriend home and didn't give them any pre-warning that ANYONE was coming over, let alone that he'd broken up with his ex-bf that he was in a serious relationship with and was dating this new person. \n\nI hear you on nosy parents, I didn't keep mine updated on my dating life and only introduced 2 people to them. But then if we assume that OP sucks and is a shit father, it begs the question, why is the son introducing his new gf to his family and expecting them to just KNOW what's going on?", "Theres a very obvious reason why you're getting downvoted so much and I think you need to figure out why before continuing in the comments", "I mean considering OP literally didn't know who his son was dating at the time we can pretty clearly guess they don't have that level of communication but also in my case yeah!\n\nWhen I brought home my wife for the first time all I told my parents was \"I have a date coming by tonight, so I'll make us all dinner, but I may not be around much after that.\" And then that was that! I was an adult, in college, with a job, and only living at home because the school year was out of session, so as far as any of us were concerned there wasn't anything much else to talk about.\n\nOnce my wife and I got more serious, we all definitely had more in depth conversations! But that was well over a year later and still very much more me telling my parents things, less them asking me questions. At the time, it just didn't seem like the time or the place. I was old enough that I didn't need my parents protectively interviewing me or my partner about our relationship, and while I was there to see my parents, my partner was there *with me* not *to be introduced to them* which is a minor but important distinction that seems to be present here in this story too. Many older teens (18/19) will sort of let their life casually unfold in their parents' presence rather than officially informing them of it until such time as they decide there is something to officially inform of. It's a stylistic choice I think more than anything, and tends to happen most in families that raise sort of \"live and let live\" kids, whether on purpose or on accident.\n\nMy parents very much did that on purpose! Not everyone who develops that approach did so because their parents meant for them to. I genuinely don't know if OP intended to be so hands off in his approach to knowing what goes on in his son's love life. But queer kid's especially tend more towards that hands off-ness due to early fears and anxieties about acceptance (yes, even if our parents end up being accepting, we often still fear it, hell, my mother was literally married to another woman and I was still hesitant about coming out to them because they were never quiet about \"assuming\" my straightness and it can be scary to go against that). So it may not have been entirely OPs choice. But it also may have been! If OP and his son have struggled with their conversations about his son's love life in the past, this lack of communication now is likely a bit inevitable (though it doesn't have to stay that way! The more OP is open to communicating, asking non-shaming questions, and being genuinely engaged, the more likely that distance shrinks).\n\nAnyway, I realize that's a lot of words to answer your question, but it's a pretty complex situation I think!", "But neither did Tanner ever say to OP \"Dad I'm gay\". Dad made that assumption all on his own. And as I'm sure we've all heard, when we assume, we make an ass out of u and me.", "In my case, because I'm not close with my family I didn't bring home just whoever I was dating. Only if we had been together for a while and intended for it to last. In total I've dated about 8ish people (depending on your definition of dating), I've only brought 2 home. My parents have incidentally met other people I've dated when they visited me in college once or twice but I didn't let them know we were dating because it wasn't serious and so it didn't concern them. \n\nMaybe I view things more black and white, but if OPs son isn't close enough to his parents to tell them who he's dating, then why is he bringing them home? In my experience, you only bring them home to foster a relationship with your family because you think this person is going to be around for a while. It doesn't sound like this relationship has been going on for very long... But maybe the son doesn't think of it like that and was just thinking of the free meal they could both have, who knows. But ultimately I think OP is NTA and the son really could have done some work to avoid that awkwardness. If he's going to be bringing a new person home he should give his parents a heads up.", "The son didn't even tell his father that he and his boyfriend had broken up – OP assumed they were still in a relationship. With that info, I never would have skipped to the conclusion that Tanner and Natasha could be a couple.", "He did though. OP literally said so. That's the thing. He was given repeated indications that he just breezed right by because he *wasn't paying attention*", "> You can't expect OP to know Tanner is bi if Tanner never says he is.\n\nHe never said he was gay, but for some reason you think OP should assume that means gay instead of bi?", "It's a problem because of bi-erasure. That he could be bi is a reasonable conclusion because OP literally had to ignore him introducing a gf to keep the misconception. OP is the one who implied his son wouldn't use the term gf casually as well. \n\nBy that same logic, there is no reason to assume Tanner is gay if he never says he is. There's equal possibility of gay and bi. It's a common assumption you have to be gay or straight, but the reality is sexuality is fluid for many people and you should actually never define someone without being explicitly told. \n\nPeople who identify as bi often face issues in lgbtq+ communities for the same reason of some people will not accept they are capable of a heterosexual sexual relationship and accuse them of being closeted. It's a sore subject for many, which is likely why Tanner reacted strongly- he should not have to be made to justify a heterosexual relationship because of previous homosexual relationships, and vice versa. Some people find it exhausting, and brothers reactions kinda indicate OP's son is already dealing with it.\n\nNot to mention the whole discussing the ex in front of the current partner, which is just awkward for everyone, especially if the relationship is new and Tanner hasn't gotten into his previous relationships with his current gf.", "> Where does it say his son is bi? He’s only dated the same sex and only talked about the same sex.\n\nThe same place it says he's gay.  I.e. nowhere, OP just made assumptions.", "....\n\nIt's literally the post. Furthermore, not every gay man uses the \"stereotypical\" language, and OP confirmed that includes his son. Both you and OP jumped to huge stereotypes to ignore the OP's son introduced Natasha as a romantic partner because obviously he couldn't be bi and must have been using outdated slang that he doesn't actually use normally.\n\nIt's a textbook example of bi-erasure and completely exhausting for people who identify as bi.", "I mean ahead of time. The son doesn't live at home (OP thought he had moved in with his ex-bf already) so to just show up for dinner with an extra person and no warning is really odd to me. OP was under the impression that he was still with his ex and that they would be moving in together. I can see how he would skim past the \"girlfriend\" comment because he thought he was in a serious relationship with someone else. There was only 1 indication and it was the girlfriend comment. There was no other convo, hint or anything to clue OP in. What repeated indications are you talking about?", "Based on Tanner's history that OP saw, it does make more sense. Whether we like it or not, it's unavoidable to make judgments and assumptions about other ppl. It's human nature to look at someone's behavior and have your mind supply a reasoning behind it. Oh, that person is wearing scrubs, so they probably work in the medical field. Oh, that person always chooses the meat-free option whenever we go out for lunch, so they're probably a vegetarian. Oh, my son has only dayed men for years, so he's probably gay. \n\nShould we make an effort to be conscious of our assumptions and recognize that they could be wrong? Absolutely. But most assumptions like that are going to be harmless, especially if we acknowledge when we're wrong and make an effort to respect the new information we learn about someone.", "> It's a problem because of bi-erasure. That he could be bi is a reasonable conclusion because OP literally had to ignore him introducing a gf to keep the misconception. OP is the one who implied his son wouldn't use the term gf casually as well.\n\n**You are waxing eloquent about bi erasure on the wrong forum.**\n\nThis is not that. I’m sorry but it isn’t. No, people shouldn’t assume a guy is gay just because he has only dated guys.\n\n**But it is very clear that OP NEITHER informed his dad that he had broken up with his previous ex, whom his dad thought he was going to MOVE IN WITH, nor that he was dating someone else, prior to bringing someone home.**\n\nAnd the term “girlfriend” is absolutely used in contexts outside of dating. And it’s still a logical conclusion to assume the he just picked up the phrase at school  when, as far as OP knows, he’s *still dating a guy.*\n\n> By that same logic, there is no reason to assume Tanner is gay if he never says he is. There's equal possibility of gay and bi. It's a common assumption you have to be gay or straight, but the reality is sexuality is fluid for many people and you should actually never define someone without being explicitly told.\n\nWe all understand that, or we should. But that’s not the issue at hand in OP’s post. \n\n> People who identify as bi often face issues in lgbtq+ communities for the same reason of some people will not accept they are capable of a heterosexual sexual relationship and accuse them of being closeted. \n\nMost of us are aware. This is not that. \n\n> It's a sore subject for many, which is likely why Tanner reacted strongly\n\nAgreed \n\n> - he should not have to be made to justify a heterosexual relationship because of previous homosexual relationships, and vice versa. \n\nNo one asked him to justify it. They just misunderstood him.\n\n> Some people find it exhausting, and brothers reactions kinda indicate OP's son is already dealing with it.\n\nSure. But if he anticipated this, the least he could have done is give OP a heads up that they were bringing a PARTNER. And not the one OP clearly is under the impression they’re with. \n\nI get that he shouldn’t have to explain it, and that’s honestly probably why he didn’t say something beforehand, but it also isn’t fair to his GIRLFRIEND to being her into a situation like that where their parents was totally not in the loop.\n\n> Not to mention the whole discussing the ex in front of the current partner, which is just awkward for everyone, especially if the relationship is new and Tanner hasn't gotten into his previous relationships with his current gf.\n\nWhich in my opinion was absolutely the son’s fault, because he’s the one who brought her and announced when they arrived that it was his girlfriend, knowing full well there was a chance would be a bit blindsided (rightly or wrongly is honestly irrelevant - in this case, it’s family). And *especially* if he hasn’t “gotten into previous relationships” with her. \n\n**Because - again - OP of course would NOT have brought up the ex if they were aware that they WERE the “ex.”**\n\nMy take on this whole thing is that it was an honest mistake on OP’s part, and either immaturely deliberate lack of communication, or just a general lack of foresight, on the son’s part. \n\nNo one is genuinely an asshole here, but son definitely overreacted given the situation, in my opinion. As young adults often do. A little grace and understanding for family who you *know* are not behaving maliciously goes a long way.", "The only problem I see here is your Is virtue signaling. The dad can't know anything his son doesn't tell him. Since his son had only exclusively dated men, he made the reasonable mistake thinking that his son was gay. Once he found out his son is bi, he obviously has no problem with it. This was an honest mistake from an obviously accepting and loving person. Stop trying to make it out to be something it's not", "Figuring that someone who only has dated people from one sex is attracted to thay group is just rational thinking. \n\nGranted OP was a bit dense but you are literally trying to discourage people from thinking correctly", "Bi erasure is a really crappy thing. I'm a straight woman, there have been a couple women over the years I have found attractive, but for the most part I am really not at all interested in women. It fascinates me that bi people get treated so poorly by both camps in a weird \"pick a side\" way. I haven't chosen to prefer men, and as far as I can tell, gay men don't choose to like men, and lesbians don't choose to like women, we just like who we like. I find it so weird how bisexuals are suddenly considered wishy washy choosers instead of just genuinely attracted to both.\n\nThat said, if you have only known someone to date one or the other, and they've never really even expressed any interest in the other, right or wrong you might just assume they are gay or straight. OP was dense here, but we don't know how Tanner was interacting with his gf. May have been projecting friend vibes, too. He'd clearly never mentioned her, which is kinda odd. I'd mention if I was being someone to my parents house, personally, especially if it was a romantic partner that may not be expected. OP made a wrong assumption, but not out of malice or bi erasure, just ignorance of the full situation. \n\nHow it's handled from here on out is the biggest thing.", "The first line literally says he’s gay. No where does he say his son is bi. Not sure you understand what a gotcha moment is because you whiffed it on this one.", "Bro I don’t think it’s that deep. Obviously OP didn’t even know that son and his previous partner had broken up, so it’s fair for him to think regardless of being gay or bi that she would be a girl friend. Son has also literally never before expressed to OP his interest in girls. The son didn’t give OP enough information to be fair for him to realize this. He can’t be mad at OP for not knowing he was bi when he literally never told OP he was. I think they’re a bit oblivious, but not an ah. I think there’s NAH. Everyone assumed things that shouldn’t have been assumed.", "what stereotype did I jump to? That if a person is in a homosexual relationship with another person of the same sex and only has sexual relations with people of the same sex that makes them gay? Is that a bad stereotype to have? Should I just assume every person who has sex with someone of the same sex is bi? Isn’t that the thing gay people have been fighting against for decades? That it’s not just a phase or they will grow out of it.", "If OP breezed right past multiple explicit comments in the middle of dinner and only realized the truth when his other kids started actively laughing at him, why should we assume he didn't do the same thing with comments given to him ahead of time?\n\nLike I'm not assuming he WAS given a heads up either. I'm just saying that it seems incredibly generous of you to look at a man who expressly states that he just didn't notice multiple explicit statements because he assumed he already knew the truth and never bothered to ask any clarifying questions until far too late wouldn't have done the exact same thing before hand too.\n\nI think we have plenty of reason to believe that this is a kid who either A) does tell his dad things and knows he'll miss/ignore/forget them or B) DOESN'T tell his dad things BECAUSE he knows he'll miss/ignore/forget them. In either case, I don't think that's unreasonable of Tanner and IS rather a bed of Dad's own making. I hardly think it makes him a monster! But I don't think it makes Tanner one either.", "If someone brings home a girl and introduces her as a girlfriend, you had better damn well not bring up the ex unless you are absolutely positive they don't mean in a romantic sense. There might be a reason OP's son does not discuss relationships with his father or, worse, he had said something about the break up and dad straight forgot.\n\nIt is bi-erasure because OP literally had to create loopholes for language his son doesn't typically use to create the narrative she wasn't his gf. This is why son is upset. OP knows son better than that but still created an awkward situation", "It's not virtue signaling when the literal problem is OP could not even entertain the thought his son could be bi when being introduced to his son's girlfriend. OP caused an awkward situation and straight used gay stereotypes his son does not even fit into to ignore that. That's why his son is upset. It was really ignorant on OP's part, and son's experience is not all that different from situations other bi people experience", "> The dad can't know anything his son doesn't tell him.\n\nHe didn't tell him he was gay, and yet you immediately defend that assumption.", "It's not rational because you need to make the assumption people can only be attracted to one sex for it to be rational, which is inherently a false assumption. That's why it's bi-erasure.  Most people acknowledge sexuality is a spectrum", "Exactly. I’m a bi dude who has primarily dated women and my relationships with men have been pretty casual to date. That means my parents, despite knowing I am bi, have only meet 2 of my prior girlfriends and no prior boyfriends. They have meet friends of guy, girl and non-binary friends of mine before. If I am introducing my parents to anyone I am dating I always make it super clear that the person I am introducing them to is a romantic partner.", "> The first line literally says he’s gay.\n\nBut it's false.  He's _not_ gay.\n\nThe kid hadn't said one way or the other, but for some reason (bi erasure), it's okay to assume he's gay just because he hasn't proved otherwise.", "Ok but what explicit comments are you talking about? There's only the one:\n\n> Over the weekend Tanner came home with a girl \"Natasha\" (20F). He introduced her as his \" girlfriend Natasha\" and a little confused we just kinda went with it .\n\nThat's the only statement I see until OP asks about the ex-bf during dinner on Saturday and his other kids start laughing and Tanner gets upset and then OP understands. Then the next day OP tries to talk to Tanner and he blows up. So to me, Tanner is the one dragging this out into a whole big drama (maybe understandably since he's just 19) because his dad didn't read his mind.", "NAH\n\nYour son is embarrassed I get it but it was a misunderstanding.\n\nAnd to be clear here  you thought he was dating someone else so not only did you assume she was a platonic GF because you didn't know he  was interested in girls you also thought he was dating someone", "NTA. In this day and age saying girlfriend doesn’t always equate to dating. Especially if he’s never dated a girl.", "NTA.\n\nLol. Sucks for Tanner, but you did your best.", "NAH you had NO malicious intent. Just a misunderstanding on what you thought he meant when he said my GF. Don’t beat yourself up over it. He has to realize he never explicitly said he was bi either so he should cut you some slack.", "NAH", "NAH. As someone who's bi, I can understand his frustration with someone getting his sexuality won't. But, it was also a simple misunderstanding.", "yta\n\nYou know what they say about Assuming..... \nWhy would you bring up his x anyway?\nThat doesn't sound like company dinner conversation", "NAH but if you’re confused about a situation i would advise TALKING to people instead of just bringing up exes in front of new girlfriends", "Nta you truly didn’t know. Apologize  again", "LOLOLOL ah man that is too funny. NTA", "NTA.  It kinda sucks that this happened for your son but it was an unintentional oversight/misunderstanding.", "NTA.  It sounds like you might be a tiny bit old-fashioned, but it also seems like you're trying your best to be supportive and there was a miscommunication along the way.  Hope things calm down soon!", "NTA It’s difficult keeping up. Tanner should have privately warned you that he would be bringing a new romance to dinner.", "You made a mistake. It doesn't make you an asshole.", "NTA. I literally am laughing because of this miscommunication. I get exactly what you meant because many gay men call their female friends \"girlfriend\". It's fairly common. Also you thought he was gay because that's how he always presented himself to you. It's not your fault you didn't know he is bisexual because he never told you.", "YTA why in a million years would you bring up how the ex is doing in front of his current girlfriend on your first meeting.  You were blatantly trying to be a turd it seems like.", "poor Natasha - it sounds like she had no idea.", "NAH/NTA lol if I had literally never mentioned having a romantic interest in girls (and clearly shown an interest in guys) I would’ve sent a quick text that I was bringing my girlfriend home before actually bringing her home. Especially since it’s not exactly uncommon for gay guys to use girlfriend to refer to platonic female friends.  \n   \nnot that the son is really an asshole but it would’ve helped to give a little heads", "NTA.  A simple misunderstanding.  You don't know what you don't know, and it sound like you son doesn't share a lot of information with you.  You were just going on past history.", "Seems like a NTA thing. Plenty of people use the term girlfriend to mean a friend that is a girl. It's not like you denied that he was bi when he told you. You just made an incorrect assumption that many people have made.  Seems like a misunderstanding.", "Soft AH - it is not a good idea to discuss other relationships in front of the person he brought to dinner. I get it that you didn’t know, sounds like she didn’t either.", "NTA but it’s understandable he is upset nonetheless, additionally his ex is probably a tender subject for him, as well as this new thing of dating a women. \n\nYou’re misunderstanding definitely didn’t help, but it doesn’t make you an asshole.", "I'm in between N A H and Y T A\n\nBut ultimately YTA for assuming, there's an old saying that to “assume” makes an “ass out of you and me”.", "Yta\n\nYou should have taken the time to find out and ask what sexuality he is for sure. You could have done this in a non threatening way. And yes - he did introduce her as his girl friend. If you had questions at that point - you should have pulled him aside in private and asked instead of putting him on the spot in front of everyone.", "Yeah, wow I can't for the life of me understand why people are saying OP is TA here. It was a misunderstanding,  it happens. Some people here are being mean about it when OP wasn't being malicious in any way. He made a mistake.  And if you actually read the post you can understand why. Jesus..\n\nNTA.", "NTA. I actually had a very similar experience, OP. I had a friend who said he was gay, had only dated guys, and had never shown an interest in women. He called all of his friends (including me) \"girlfriends.\" I ran into him a few years later, and he introduced me to his GF. I naturally thought she was a friend, and I at some point said something very innocent that PISSED him off (basically, from what I said it was clear he had been dating a guy at the time of the story). He said he was straight and stormed off. I ran into him another year later, dating a guy, calling all of his girlfriends, and I literally felt like I was going crazy. I was super tense the whole night and didn't want to say anything that might upset him. I kept expecting him to bring it up and explain what happened, but he never did.\n\nOP, call your son and apologize later, but I don't think you did anything wrong. Everyone makes mistakes.", "YES. it’s the “feminine” part that got me. I can believe OP honestly had no ill intent but he still clearly has some internalized biases that need some working on, so asshole or not for this specific situation he should take this as a learning moment.", "girlfriend is extremely ambiguous", "But in the english language the term \"girlfriend\" can and is being used for platonic friendships.\nCombine this with the lack of knowledge about the breakup with the ex-bf and it's really simple to understand this is a genuine misunderstanding.", "He didn't assume he was lying, he misunderstood what he meant.", "I do it! Granted I'm a girl but I'm well under 60 and I refer to my girl friends as \"my girlfriend\" in many types of conversations. Like, \"oh I'm traveling to X city this weekend and staying with my girlfriend Sarah\". Maybe it's a regional thing but it's very normal where I'm from.", "I hope his son sees this post so he can understand his dad is at least slightly homophobic", "Every girl I've known all my life has girlfriends, and not in the lesbian sense. It would be sexist to say men can't use the phrase, too.\n\nNTA Misunderstandings happen.", "Tbh I honestly thought the ex bf was trans and their new name was Natasha and now went by female pronouns (hence the girlfriend title)😂 so OP isn’t the only clueless one here", "If I had brought a date home to introduce to my parents, I would have given them a heads up first. \"Hey, I'm seeing someone, their name is\\_\\_\\_\" I mean OP didn't even know their son had broken up with their last relationship.", "I think it exposes some internal biases, but not homophobia. Otherwise there would have been problems earlier when the son was continuously dating men.", "I'm 41 and female lol \n\nMaybe the real difference is most of my social circle isn't heterosexual 🤔", "Agreed", "I'm also a lesbian, and straight women referring to their platonic female friends as girlfriend is so confusing/annoying.", "I too, am a hag.", "Even us girls call each other \"girlfriends\"", "[removed]", "But, would you introduce your girl friend to your parents as “my girlfriend”? I personally would just say friend.", "Assuming someone is gay is homophobic and not believing when someone says it’s their girlfriend despite dating men is biphobic", "He did tell him though, OP just misunderstood because he assumed his son’s identity. I get how the assumption was made but Tanner did in fact communicate the only relevant information. The yelling at least in my mind seems exasperated, not enraged.", "> I asked about how his apparent ex Corbin was doing and if they had moved in yet not realizing yet they clearly broke up.    \n  \nIt's literally 2 paragraphs.  \n  \nEdit just to summerize OP and yours ridiculus thought process:  \n  \n- Son introduces parent to his \"girlfriend Natasha\".  \n  \n- Parent has the exact thought of \"Huh I guess Corbin is his ex\"  \n  \n- To figure this out if that's true, parent asks if his son is still moving in with his \"apparent ex\".  \n  \n- surprised pikachu", "Right? That’s what I’m saying! Everyone is saying OP should have known! She was introduced as Tanner’s girlfriend! But let’s just do a gender swap here and say Natasha was Nate and introduced as Tanner’s boyfriend, which is used way less in a platonic sense. It would still prompt the question of ‘Wait, what happened with Corbin? The guy you were dating and considering moving in with last I heard?’", "Bi woman here, and same to be honest. Unless you tell me you broke up with someone, it's probably going to take a good minute for those wires to cross on their own. If I wasn't 100% certain, without a shadow of a doubt, I would just assume that whoever was still dating whoever. People discover that they have a different sexuality than they previously thought all the time. \n\n\n\nI would be appalled to be the person who asks their kid about their new partner, only to find out that the new person is just a friend, and that the kid is still with the first partner. \"Oh, we're dating now\" is easier to mend than \"Oh, I'm still dating *xy* \" . One is just being slower on the uptake, and the other is being unsupportive and insensitive. I would prefer the former, personally.", "[deleted]", "True enough", "Maybe that’s the reason, your friend group HAS to be more specific lol Most of my gay friends are men or are married women so there’s less confusion", "\n>Edit: I get tired of people asking if my date if a gf or my gf.\n\n....what?", "no I totally agree lol I hate it and it makes it so much more difficult to make it clear to people that I mean girlfriend in the gay way and not in the friend way", "He was also unaware tanner was single before meeting his girlfriend as he said “apparent ex Corbin” and asked if Corbin had moved in yet. Dad can’t know what he son doesn’t tell him.", "the son stated he was bi, he was dating a man previously. op didnt just assume he was gay because he was feminine, he assumed he was gay because he was dating men.", "Or would it be more homophobic to assume he can’t be having a platonic female friend cause he never was feminine presenting? And eager dad to have a het son…\n\nWe could go in circles\n\nWhat OP actually intended was not malicious or homophobic, nah imho too OP", "Honestly there is no winning here, if the dad had jumped on the \"it's my girlfriend\" while thinking 1) that his son was gay 2)that his son was in a relationship with a guy and 3) that gay men often call female friends girlfriend it could ALSO have been constructed as homophobic lmao like imagine if she HAD been a friend and the gay son realised how *ready* his father was to see him in a het relationship. \n\nThat's simply a misunderstanding based on the double meaning of the word \"girlfriend\", dad is NTA.", "Yeah except a lot of gay guys(myself included) call their women friends girlfriends. So if someone who has been with only guys brings a girl somewhere, calling the girl his girlfriend doesnt immediatly mean its their non platonic girlfriend.", "This father was not homophobic. He was supportive and just didn’t feel the need for his son to come out of the closet, or that’s how it seems. He raised that human, I’m pretty sure he didn’t do anything out of malice and it was all out of love. Some of y’all are so fast to just throw shitty names at people and hope they stick for some upvotes. There are so many people in this world that hate gay people, this man is not one of them.\n\nEdit - dad is NTA", "..screaming at windmills intensifies..", "It's regional and generational. My elder millenial bestie like 8 years my senior calls all her friends girlfriends.", "I think it would be the only relevant information ~if~ OP had the complete context of his son's life. Which Tanner did not provide it seems.\n\nTanner exclusively dated men for 6+ years, it's a pretty safe assumption to make imo. Should OP have clarified at some point? Maybe. But Tanner could have also clarified at any point as well. He also didn't communicate the breakup from his most recent boyfriend (who was apparently long-term enough that they were moving in together). It seems like there is just a major lack of communication on both parts and Tanner sort of expecting OP to read his mind or at least pay such close attention to his dating/sex live that OP would just know he was bi. \n\nTanner seems a little self centered and OP seems a little oblivious. Hurt feelings were inevitable.", "I think the \"apparent ex\" is OP's conclusion now in hindsight, not at the time, given the second half of the sentence saying that he didn't realize they had broken up.", ">not realizing yet they clearly broke up. \n\nMeaning he didn't know Corbin was an ex. \n\nOP thought his son was still dating Corbin and the girl he brought home was not a romantic partner, but a friend.", "The son hadn’t told OP that they’d broken up. OP didn’t realize bc the son hadn’t told him. Are you expecting OP to read minds?", "Work on your reading comprehension.", "Yeah I’m surprised at all of the people calling OP TA for assuming the son was gay. The son has ever only dated boys and only talked about boys? I feel like that’s a completely natural conclusion.", "I feel like you’re really thinking too hard on this. People don’t have black and white relationships, especially with their parents. The son is 19. He’s away at school. Maybe he doesn’t feel like keeping his parents informed and him going from one relationship to another wasn’t a big event in his mind. It’s easy to look back in hindsight and say why didn’t you do this, this, and this.", "Girlfriend is unfortunately ambiguous. It can mean romantic partner or it can mean friend that's a girl. I know many people who use it in the second sense. Perhaps partner would have been less ambiguous.", "You know like is she *a* girlfriend or *your* girlfriend? The former implies a friend that's a girl; the latter implies a romantic partner.", "It’s an easy mistake for the father to have made.", "I remember reading that the tendency of straight women referring to their platonic female friends as 'girlfriend' provides a significant challenge to gay/bi women who have to take extra steps to introduce someone as their partner and not just as a platonic friend.  It didn't occur to me that this could potentially affect bi men as well.", "Especially if the last piece of info you have is that said person was planning on moving in with their boyfriend. In that case ‘they meant girlfriend in a platonic way’ seems like less of a leap than ‘they broke up with their boyfriend and meant girlfriend in a romantic sense’ even if you know the person is bisexual.", "If everyone else understood the father should’ve if he knew is son", "No, he says multiple times he thought his son was gay and is moving in with his bf Corbin.   \n  \nAgain, it's 2 paragraphs - read them slower and then come back with another excuse since youve had to change your first two.", "Okay, so OPs goal was to out his son cheating on Corbin with this new girl - and possibly make sure she knew he's banged dudes in the past.  \n  \nI suppose exposing cheaters isn't straight AH behavior. I'll stick with him being an AH though.", "No, I'm expecting him not to ask infront of his new partner what happened to his old partner.", "Dude outted his son to his new partner.  \n  \nWork on your compassion.", "Regardless of dating status or sexuality it's weird and bordering on rude to show up to your parents house for dinner with a +1 and not warn them. What if they didn't make enough food for an extra person? My parents would have been annoyed with me if I did that and probably chided me to ask them next time, or at least give them a heads up.", "That logic works if they ran into each other at the grocery store or a restaurant or something. But that logic kinda falls apart here imo. Tanner took his new girlfriend to his parents house. Even if you are low contact with your family that seems like the time to make the clarifying text of ‘btw I broke up with Corbin a while back and am seeing someone new and i’m bringing them when I come over later’. If OP had still assumed the person introduced as his girlfriend was a platonic friend then I would agree he is an ass. \n\nBut as a bisexual man who is low contact with my parents, who do know I’m bisexual by the way, there is a certain amount of you can only be so mad at them for not knowing information you kept from them…\n\nThis honestly just sounds like a sheer lack of communication on all sides leading to a big foot in mouth situation.", "I mean what is Dad supposed to do? Not believe his son is gay despite him only ever talking about boy crushes and only dating guys since middle school? That would make Dad an un-supportive AH who thinks this is all just a phase. \n\nIt doesn't sound like he's ever had an issue with who his son dates, he just didn't immediately realize it was this girl because it's not who his son usually dates and wasn't the specific person *he still thought his son was dating.*", "Except he was put in a position where in the moment he had to assume something. Either he assumes Corbin and Tanner are still together and Natasha is a platonic friend, Corbin and Tanner are still together and in an open relationship with Natasha, Tanner and Corbin are still together and Tanner is boldly also cheating on Corbin and introducing his affair partner to his family, Corbin and Tanner broke up and Natasha is a platonic friend, or Tanner and Corbin broke up and Tanner is now dating Natasha. Now I admit that at least one of those is pretty unlikely, but those are the options that I see. \n\nI will concede that it would have been best for OP to get clarity after Natasha had left instead of asking about Corbin while she was there - but I’m still not sure I want to call him an asshole for coming to a reasonable conclusion based on the information he had in the moment. Which to recap was: Tanner is dating Corbin. Tanner introduced Natasha as his girlfriend. It’s not uncommon for platonic friends who are girls to be described as girlfriends. \n\nAnd honestly the ‘op shouldn’t assume Tanner is gay’ cuts multiple ways. He also shouldn’t assume that he broke up with Corbin. The son was expecting him to assume something and OP got it wrong.", "lesbian here! he didn't assume anything he just did his best to support his son and misunderstood the situation. he's not homophobic for this when he only brought home men—the son never explicitly came out as anything and the dad was just doing his best to understand his son but misunderstood the situation. it wasn't anything malicious or him refusing to see his son. he was just using the info he had. focus on actually homophobic people. NTA OP.", "Exactly, and he seems to be sorry about the misunderstanding. So i dont think he did anything wrong.", "I'm literally a different person but go off.", "No. OP thought the girl was a friend, not a romantic partner. \"Girlfriend\" is ambiguous that way. He didn't think his son was cheating. He didn't think he was outing anyone. He just thought he was asking his kid about his relationship in front of a friend.", "But he didn’t know the old partner was an old partner? He thought Corbin was a current partner and Natasha was a friend.", "I agree, and my parents would feel the same. I’m just saying that there doesn’t need to be a deep reason for why he forgot to update his parents on his dating status. He’s a kid.", "I was just giving examples of what could have happened, clearly there’s a lack of communication. I don’t even think OP was the AH, I just don’t think it’s that deep if the son forgot to keep the parents up to date on his dating status. It’s his own fault what happened, but I don’t find it unusual.", "Better an understanding father than a oblivious one. He doesn’t need to be painted as an asshole, he already feels bad about saying the wrong thing and upsetting the relationship with his kid. Everyone take a breather.", "Why would I care to read your name? You jumped in my conversation, not the other way around.", "He said he didn't know.  \n  \nHe then said he outted his kid since he didn't know.  \n  \nHe outted his kid to figure it out, he could of just not asked about the boy he thought his son was banging and moving in with in the person that was just introduced as his girlfriend.  \n  \nMaybe OP is just an idiot, that doesn't make him not an AH.", "No, he said didn't understand why his son referred to her as his GF and made an assumption.  \n  \nHe then outted his son.", "I'm not the one who brought up the deep reasons lol that was Thelmara. I'm just saying that if the son had the same reasons as Thelmara, it's even more odd to bring a new partner home.", "That’s fair. And I do absolutely get not telling your parents everything right away - even when you do have a good relationship with your parents!", "BEcause he was only into guys, only dated guys and only crushed on guys.  Call me crazy but that usually indicates someone is into guys.", "Ah yes, your super private conversation on a public forum.", "So you don't understand the difference between \"into guys\" and \"gay\", apparently.\n\nBoth bi men and gay men are into guys.", "Ugh, I wish I had an award for you!!! Great breakdown,", "It's such a difficult position to be in. I'm bi and a woman, and I've not been in a relationship with a woman. So many people, even friends of mine, have made jokes about me being straight and erased that side of me. And that hurt because they _knew_ I was bi.\n\nI agree with you here, the key difference is the knowing.\n\nOP says as far as they knew their son was gay, they thought he was still with his old partner and hadn't made the mental distinction of girl friend and girlfriend. But this doesn't make it bi-erasure. It sounds like the son never sat OP down and outright declared their sexuality, nor discussed anything that would have explained having a girlfriend and (in OP's mind) a boyfriend at the same time. There isn't anything in OP's experience with their son, at least that they've said to us, that is indicative of prior knowledge, awareness or experience of their son being bi. \n\nOP hasn't then turned around and said his son's relationships with men didn't count, and hasn't dismissed the girlfriend as some sort of beard. OP isn't erasing their son's identity, they are learning about it. This is new for them.\n\nAn allegory of sorts: If all the swans I had ever seen in the world in my lifetime up until now were white, I'd assume the next swan I see would also be white. I can't guarantee it would be, it could be green or purple or orange with polka dots, but I would feel very confident in assuming the next swan I saw would be white. No one has ever mentioned swans coming in other colours to me.\n\nMy limited experience of swan colours does limit my ability to predict what colour the next swan will be, but I don't know this, as I have only seen white swans.  For me to predict a purple swan when I'm only seeing white feathers everywhere would be so far out of left field that it doesn't make sense.\n\nAnd because I've only seen white swans, I don't immediately recognise the purple bird in front of me as a swan. I assumed all swans I saw would be white.\n\nAm I wrong for that assumption? Probably.\n\nIs that assumption still logical and understandable? Definitely.\n\nCan I be surprised at the existence of purple swans? Sure\n\nBut the important part is what happens with that surprise. \n\nDo I pretend purple swans don't exist now I've seen one? That this purple bird isn't a swan, but some other thing? Or think that all those white birds weren't swans in the first place, and that only this purple bird is a swan?\n\nNo, because that's the erasure - that's burying someone's identity.\n\nOr, do I take a moment to reconsider what colours swans could come in? And do I acknowledge that past history isn't always the best predictor for future actions, so I should be mindful about birds in other colours? Yes. \n\nAm I irredeemable for thinking swans came in white? No, you can be redeemed, because everyone has assumed that a bird only comes in one colour. Some might have thought pigeons were only ever grey, or all ducks had green heads.\n\nEvery single person has at some point made an assumption on a person's sexuality, and to pretend otherwise is lying to yourself. Whether it's assuming straight as the default, gay as the default, lesbian, asexual, pansexual and any other colour on the spectrum, an assumption has been made, based on a turn of phrase, tone of voice, haircut, fashion sense, whatever else. But it's what you do after realising that your assumption was wrong that matters.\n\nOP tried to apologise to their son, they tried to explain why they'd come to that conclusion in order to show it was a mistake and not malicious. OP isn't ignoring their son's identity, they were just ignorant of it.\n\nETA: [spelling]", "Who said it was private?  \n   \nIf you want to respond to something I said it's a bit weird to expect me not to respond to your response.  \n \nWhat's your name matter?", "I think that misunderstandings are very easy to dissect in hindsight, or when laid out before us. That said, it’s really not as simple in the moment. To me it sounds like OP was genuinely confused and possibly feeling awkward about the whole situation. in his confusion missed what may or may not have been clearly communicated. I’m guessing not because they both clearly have some significant communication issues. He definitely is NTA for making a mistake, especially since he did try to discuss it after the sons reaction."]}