{"id": 8246, "submission_id": "10l1s3l", "title": "AITA for going to a concert, leaving my partner to care for our young children?", "selftext": "Some mutual friends of me and my spouse's recently asked if the two of us wanted to go to a concert with a small group. My partner said he was unsure at the time and I told our friends that we would think about it. A few weeks went by, I asked my partner again, and he said he wasn't interested. I mentioned that I would still like to go. I asked if he was cool with this because we have two small children and coordinating care takes effort. At the time he told me he was okay with it, but I waited to buy my ticket to make sure that I still wanted to go to the event. Fast forward a few weeks I told him I was buying my ticket, and again he did not say he was opposed. \n\nNow it is a few days before the event and I could tell he is upset. When I asked him, he said that he's not looking forward to the evening because it is at bedtime and is a challenging time for our family. Our youngest is 2 months old and our oldest is 2.5y/o. Our toddler recently has had a sleep regression and you need to lay in bed with them until they are sleep which can take 30 minutes to 1 hour. \n\nHe said it was discourteous of me to buy the tickets knowing how difficult it will be to have both children by himself at bedtime. He said he has purposely avoided events that he wanted to go to because he did not want to leave me alone at this time. I agreed that was kind of him, but I wish he would have communicated this the several times I asked him about the concert the past few weeks.\n\nI have been on maternity leave for 10 weeks and have been looking forward to a night out. I didn't find the request unreasonable, although I do agree it can be challenging. Another detail is I have also been home alone with both children the last 4 days because of illness(I was ill while caring for the children) and our toddler not being able to go to daycare. I did feel overwhelmed at the thought at first, hoping I would be able to entertain them and balance care. We ended up having a wonderful few days together, although yes, at times chaotic. \n\nI offered to sell  my ticket and he said he didn't want me to do that. I told him that I would not go to the event if he was seriously overwhelmed and anxious about bedtime and evening by himself with the children. I told him I understand it's a hard time of day but I would have not bought the tickets if I didn't think that he could do it. Our lives are chaotic right now and it is hard with two small children. But I don't think it's unreasonable to leave the house for four to five hours one evening. \n\nThe last conversation we had he said \"I already know it's going to be a terrible evening\" \n\nEdit: My partner and I equally divide the workload for the kids, especially at night. Neither of us have done bedtime solo, I think that's what he's specifically stressed about. \n\nEdit #2: We have been actively trying to adjust to a normal bedtime routine for our toddler. They are in a regression. They have a new sibling in the house and it's a big adjustment. We are trying our best to eventually not need to lay with them at bedtime. It's a temporary measure. \n\nAITA for leaving my partner solo to care for the toddler and baby at bedtime?", "created_utc": 1674661846, "permalink": "/r/AmItheAsshole/comments/10l1s3l/aita_for_going_to_a_concert_leaving_my_partner_to/", "score": 1710, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Buying tickets to go to a concert without my spouse, leaving him with two young children. \n\n2. Bedtime is a challenging time for us and I will be gone. Our toddler needs someone in bed with them until they fall asleep which can take 30 minutes to 1 hour. And he will also have a 2-month-old baby to care for at the same time.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "No, you're not.\n\nYou checked,  he said it was fine. You checked again, he didn't object. You checked Again, still no objection.\n\nToo late to object, he objects. \n\nAlso, He's Their Parent Too. And it's literally 1 evening.\n\nYour partner can get over himself, you're NTA", "NTA. He should have actually communicated and not been passive aggressive. He's their father, time to do some parenting for one night.", "So.. he doesn't want to sell the tickets, he doesn't want you to not go, but he doesn't want you to go? Well then.. what does he want? \n\nNTA. You asked. Multiple times. He could have expressed at any time that he wasn't ok with it. Even if he wasn't ok with it, you're a new mom of 2. You need some time to go out and be with other adults. Have some fun!", "NTA. You asked several times and he said it was fine. Over to give him a night off so he can go out with with friends to even it out", "NTA.  He is their father!  He chose not just once, but twice, to bring children into the world.  What did he expect?  That he would never have to care for them for even a few hours?\n\nHusband seems to have a very 1950s view of fatherhood, as well as a truly crappy communication style.", "NTA.  You asked, he said it was fine.  He can handle the kids for one night.  You should also encourage him to go out one night himself too.  \n\nAlso, not that you asked so feel free to stop reading here, but you are setting yourself up for years of sleep misery with your toddler.  If you do not want to have to lay down with them for hours for years you should stop doing it now.  Toddlers are terrorists.  Don't negotiate with terrorists.", "You did say \"partner\" right?  So yeah.  That's what he is and \"partner\" is exactly what it means.\n\nNTA\n\nI hope you have SO much fun at the concert!", "I'm going with NTA- you asked him twice if he was okay with you going and didn't object. You've had to care of the kids alone for 4 days before, he can handle a few hour of one night. It sounds like your partner does not pull his weight with childcare and now when he is being asked to step up and do his part he is pushing back. Go and have fun at the concert, your partner will be fine. A good opportunity for him to learn how to handle the kids on his own because this won't be the last time he has to care for the kids without you. Better get comfortable now", "NTA. You asked multiple times before buying the tickets, and were given permission. He could have spoken up sooner. \n\nAlso, has your partner really never put your children to bed? After 10 weeks, does he not know how to do it? \n\nI hear you that it’s not easy, but not being able to manage for a single night, even if it’s not *fun* per se is…sure something. \n\nMore importantly, you communicated clearly, and he told you to go. You didn’t do anything wrong here. He did, but guilting you after the fact, for something *he* explicitly gave you his blessing to do. \n\nIgnore his guilt trips and enjoy your concert. You deserve a fun night out!", "NTA. It may well be a difficult few hours for your partner to deal with such young children by himself at bedtime, but welcome to Parenthood. That's just part of the job. You do what you can to get the toddler and baby to sleep and if they don't,  the world doesn't end. You gave him every opportunity to oppose your going to the concert, but he didn't object, so go, have a good time and don't worry. They're his kids too and he has to be able to look after them by himself.", "NTA, as the father he needs to be able to do that. Sure in this case he doesn't HAVE to do it, but he should learn to do it regardless. It's not going to be fun, but at least you will get a good night out of it. Say thank you, instead of I'm sorry and enjoy yourself.", "NTA. You checked in with him on this several times and it wasn't until you had already pulled the trigger and bought the ticket that he expressed that he didn't want you to go. His accusation that it was discourteous of you to buy the tickets is absolute crap - you gave him several opportunities to express concern and he didn't until after you had already committed to going to the show. He signed up to be a parent, which inevitably comes with some stressful, difficult nights and it isn't fair for him to expect you to never get a break because he doesn't want to be uncomfortable and have some parenting stress for one night.", "NTA you deserve time to yourself without kids to recharge.", "NTA especially because your partner is pulling a really AH move by being passive-aggressive in his communication.\n\nLike, put everything else aside for a sec about how as a father, he needs to be able to handle his children. Just focus on the fact that you raised this topic MULTIPLE times and he's telling you \"go but don't go, I'm going to be unhappy anyway, but don't mind me\". That's such childish behavior on his part! He needs to grow up.", "NTA!!!! Moms deserve a night out. Raising kids is HARD and you do it every day and night. ESP the point you made about them and you being sick. He can deal with it and he’ll survive. NTA!!!", "NTA.\n\nI've been in his position - it can be tough. That's what I signed up for when I had kids, and making sure my partner wasn't saddled with the whole burden is what I'd signed up for when I found a partner.\n\nYou checked before buying the tickets, he was ok with it then, that's on him.", "NTA.\n\nYour partner's anxiety is normal though. He's anticipating handling something by himself he hasn't done before.\n\nSo be kind but also follow through with your plans. Encourage him, tell him he's got this, help with some contingency planning if things don't go as expected. AND then be sure to send him out some evening to do something with his friends so he can have a little social time too.\n\nThe anxiety will decrease the more you guys practice letting the other one have some time out of the house.", "Nta . But after you night out I think you should talk. Cause \n1/ ok it’s stressful but would you be THAT anxious in the same situation? It seems no, so maybe he is a bit overreacting? \n2/ you give him the opportunities to tell you if he was ok and decide to say nothing and then start to be unfair.\n3/ he said he declined this kind of event, maybe he can give exemples. Was it recently ? Cause yes. You just had a baby so it’s normal he stay with you. before ? Why didn’t he tell you.", "NTA. He can suck it up for __one night__.", "**NTA** your husband is so wishy washy and passive aggressive with the way he's handling this. He just wants to make you feel guilty for going to the concert so he's saying all those things. He's also a parent and although i know it's hard to take care of kids, you were able to do so alone WHILE sick. Go the concert and have fun seriously.", "NTA. Your partner said it was fine _and you asked twice_. It's all on him. End of story. If you can't be straight and honest in your relationship, what's the point?", "NTA He will manage. It’s only one night. It will do you the world of good to get out for the night.", "Nta if he doesn't want you to do something, you partner actually has to *communicate*.   You offered a solution, selling the ticket, and he refused.\n\nSounds like he just wants to be a martyr.   'Poor me, woe is me!  My wife left me all alone for one night to care for my own children!\" \n\nLet me go get the world's tiniest violin.", "NTA - he should have voiced his opinion in the multiple times you asked him.  You are being a very caring partner to even be as understanding to this - God forbid he has to take care of the children alone.  Also - if you go into a situation with nothing but a negative mindset, that is going to set the tone.\n\nI also have a feeling that even if the night goes well for him he is going to paint the picture that it was terrible - he sounds like the type.  Good luck and enjoy your concert!", "NTA\n\n1. He will be fine. \n2. He could have spoken up on numerous occasions and chose not to.", "NTA. It's completely reasonable to expect that both of you will occasionally be able to get a nigh free. It sounds like you asked him several times beforehand, and he had the opportunity multiple times to say no. Although it's hard to put two small children to bed, that is part of parenting that everyone has to learn to be able to do solo. What if a medical emergency happened and you were in the hospital or something?\n\nAs long as you would be willing to do the same for him, so that he could have a night to himself, I don't see that you did anything wrong here.", "NTA, you communicated. Your spouse did not. It is on him, and you even offered to sell your ticket.", "NTA\n\nhe will be fine, he has to learn how to take care of them alone and you deserve a nice night out", "NTA in the slightest. \n\nYou have been home with both kids for the past few months, you deserve a break.  \n\nYou asked not once, but twice, before buying tickets to make sure your SO was ok with you going.  \n\nWorst case, it’s a bad night.  Best case, your SO does fine and it’ll help their confidence. \n\nEnjoy your evening guilt free", "NTA", "NTA\n\nYou asked him before you bought the tickets on more than one occasion. I know he is now anxious, but he would have to do this at sometime. \n\nAlthough I didn’t return to work for 4 months, I was the Secretary for a Residents Association and still had to take the minutes every other month. I was lucky in that I actually went into labour at a meeting, so it was 2 months before the next and my husband had to look after the children (nearly 4yo and a 2 month old) for 3 hours that evening (7:30pm start). He coped.", "NTA. He had so many opportunities to speak up about his stress. He will survive. It’s not cool of him to give you the emotional load of his stress and frustration when you asked multiple times if he was okay about this.", "NTA\n\nBedtime is tricky but he’ll figure it out. You both need time for yourselves. Make sure he gets a night out too.", "NTA\nEnjoy your time with your friends. Your partner thinks that you can handle both kids while sick, so he can handle them once while healthy.", "NTA\n\n\n\nSleep regression can happen out of nowhere. You asked him several times and he okay-ed you to go. He's just mad now because he feels it's not going to be easy. Guess what?? Having a poor attitude will guarantee that outcome. Also you never leave him alone with the kids to handle night time activities. Start doing it more often. He's being a bad partner. What about all the times you handle the kids on your own??.\n\nGo to your concert. Have a good time. Don't answer phone calls. Minimum text messages. Don't hurry home. You're entitled to have a social life and time away from your kids.", "NTA. You asked (multiple times even!) and he said he was fine. There was open communication. He should be able to handle his own children alone. It’s one evening, you asked if he was okay with it, and it’s not like you expect this from him regularly.", "NTA..whatever you do do not sell that ticket. He is perfectly capable of doing bedtime, even with issues. Go and enjoy yourself", "NTA.\n\nYou gave him plenty of time to tell you he needed you at home before you bought the ticket, and he didnt. Now he is guilt tipping you about how hard it will be right before its happening, but also tell you to go, but gives you a dig about knowing how hard it will be? Holding over your head that he (supposedly) hasnt done things he wanted to do to be nice to you? Thats mean. He is being mean.\n\nHe set you up for failure as soon as he refused to communicate his feelings untill you had the tickets.", "NTA\n\nIf he can’t handle the kids alone for **one single night** then he shouldn’t have became a parent. He’s allowed to be anxious about it, sure. But he’s acting like you’re leaving for weeks. You just took care of both kids all day for 4 days by yourself while sick. \n\nAlso, if you have an infant and toddler, in the last 3 years you’ve been pregnant for 18 months, aka half of that time. You’re not pregnant now, and deserve a night out. Have fun and enjoy it, and see if your husband can go out for a night soon too. Or maybe a date night.", "He's being very passive aggressive.   I don't think it's wrong for either of you to get night out, just unfortunate you can't take the night off together.  Maybe the compromise for him is finding out what event or thing he want's to do to have it feel \"fair\" to him.  You gave him plenty of time to say no.\n\n&#x200B;\n\nNTA", "NTA. He helped make the kids, he can help parent them.", "NTA however both of you need to be comfortable with managing your kids solo.", "NTA\n\nHe's seriously complaining about putting the kids to sleep by himself for one night? He's being ridiculous.", "It kinda sounds like he's catastrophizing. Sometimes the new parent anxiety paints everything with a worst-possible-scenario brush.\n\nI'm willing to bet that when push comes to shove the night will have some hiccups but will over all go smoothly enough and he will feel better about his abilities to care for your kids during bedtime (even by himself) after it's done. If this really is the very first time either of you has pulled a one parent bedtime than I think it's understandable for him to be a little scared, even if he really should be able to talk himself through that experience in a more adult way, or at least express his fears to you in a more measured fashion. Either way, my bet is all ends fine, and his confidence is boosted at the end, which gives you a really good opportunity to come home and say \"I love how beautifully you handled the night, and I'm so grateful I got to have this evening. I know I've been feeling nervous too about my first bedtime alone with the kids, but between my last few days home with them while we were sick, and seeing how great you did with them tonight, I know we're both rocking this parenting thing.\"", "NTA. Booohoooooooo. Parenting is hard sometimes, but he is a parent. Tell him to suck it up and you go have fun. Don’t let him start whining now, you’ll set a pattern of allowing weaponized incompetence.", "NTA- he's nervous, and wondering if he can really do this.   \nBut he can, and he'll feel proud of himself afterwards. \n\nTell him you'll have your phone on, can rush back home if it really gets too much etc. Then go and enjoy the concert.", "Please. I raised my son completely alone. Some people blow my mind over being inconvenienced with their own kids for one night. Go and have fun. NTA.", "Let me guess: you handle everything with the kids every other night and he can't be bothered to step up for one single night to give you a break? Pathetic.\n\nTell your partner the internet is disappointed in him.\n\nNTA", "NTA \n\nDoes your husband know a father and babysitter are two different things? Does he expect for you to stay home till they’re old enough to take care of themselves alone? \n\nI’d start setting more expectations for him or find a new partner who would actually be a parent to your kids and not find them to be a chore when you’re out. \n\nAlso red flag…. You were sick and still took care of your kids?? Does he help out at all or just get upset when you need a break?", "Just go and enjoy your well-deserved evening.\n\nHe'll whine either way.\n\nNTA", "NTA- and your husband is manipulative and so what if he has to babysit his own children?!", "NTA. You verified with him more than once he didn’t care if you attended and that he didn’t want to go. If he can’t be honest with you then he’s the only AH in this situation. He should have spoken up instead of expecting you to know he wasn’t actually okay with it.", "NAH - 1st. You need to develop, together, a better bed time routine. \n\n2nd. You both owe it to yourselves to have a night out, without the kids. Even if that means without each other. It's one night, he will survive, you would survive.", "NTA. You asked. You asked again and again. At some point if you aren't going to stand by your words then what is the point of trying to communicate. He said it was fine so go have fun. Maybe next time he will be honest about how he feels.", "NTA as the father of two kids all I can say is yes, he is right, it is tough. But it's all tough. It's tough for everyone but we all do have to suck it up and just get on with it. This is being a parent. Both of you need to be able to take a night off and know that the other is capable enough to handle it. You're lucky, beyond his griping it seems he's well capable of actually doing it. Just encourage that. Tell him he's an awesome dad who's got this, he can totally do it. Positive reinforcement when everybody is treading in new waters is hugely important.", "This isn't the first time and won't be the last time one parent is the parent of the nite.\n\nHe needs to grow the fork up.  Nta", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSome mutual friends of me and my spouse's recently asked if the two of us wanted to go to a concert with a small group. My partner said he was unsure at the time and I told our friends that we would think about it. A few weeks went by, I asked my partner again, and he said he wasn't interested. I mentioned that I would still like to go. I asked if he was cool with this because we have two small children and coordinating care takes effort. At the time he told me he was okay with it, but I waited to buy my ticket to make sure that I still wanted to go to the event. Fast forward a few weeks I told him I was buying my ticket, and again he did not say he was opposed. \n\nNow it is a few days before the event and I could tell he is upset. When I asked him, he said that he's not looking forward to the evening because it is at bedtime and is a challenging time for our family. Our youngest is 2 months old and our oldest is 2.5y/o. Our toddler recently has had a sleep regression and you need to lay in bed with them until they are sleep which can take 30 minutes to 1 hour. \n\nHe said it was discourteous of me to buy the tickets knowing how difficult it will be to have both children by himself at bedtime. He said he has purposely avoided events that he wanted to go to because he did not want to leave me alone at this time. I agreed that was kind of him, but I wish he would have communicated this the several times I asked him about the concert the past few weeks.\n\nI have been on maternity leave for 10 weeks and have been looking forward to a night out. I didn't find the request unreasonable, although I do agree it can be challenging. Another detail is I have also been home alone with both children the last 4 days because of illness(I was ill while caring for the children) and our toddler not being able to go to daycare. I did feel overwhelmed at the thought at first, hoping I would be able to entertain them and balance care. We ended up having a wonderful few days together, although yes, at times chaotic. \n\nI offered to sell  my ticket and he said he didn't want me to do that. I told him that I would not go to the event if he was seriously overwhelmed and anxious about bedtime and evening by himself with the children. I told him I understand it's a hard time of day but I would have not bought the tickets if I didn't think that he could do it. Our lives are chaotic right now and it is hard with two small children. But I don't think it's unreasonable to leave the house for four to five hours one evening. \n\nThe last conversation we had he said \"I already know it's going to be a terrible evening\" \n\nMy MIL is usually willing to come help but she is sick right now. The other friend that would help with child care is going to the show with me. So getting a babysitter to help isn't an option. \n\nAITA for leaving my partner solo to care for the toddler and baby at bedtime?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA", "NTA. He should be embarassed, acting like that.", "NTA - We’re all entitled to some “me” time. His turn is next. He’ll be fine w his children.", "NTA. You need a night out, what with having three children in your life. (Yes, I can read and count.)", "NTA\n\nYour partner is using the children as an excuse to be controlling and make you feel guilty about leaving them alone.", "NTA - I know it is hard, but he had an opportunity to give his partner and mother of his children a night out to feel like an adult. The fact that he has chosen to not partake in events is about HIM, not YOU. He is centering himself in everything, and should try looking outside of himself. Our kids are in their 20s and my wife still remembers those times she was able to get out and be an adult (we had no family help).", "NTA\n\nWhile the first night alone with two small ones is nervewracking, you went above and beyond to confirm he was okay with it and he repeatedly confirmed he was. At the end of the day, he's their dad so needs to learn to handle stuff like bed time solo.", "NTA. Your partner sucks and is manipulative af. He set up the situation so you lose no matter what you choose! “Blah blah blah of course go to the concert so I can be a victim and be a father to my own children.” “No don’t sell your ticket then I’m the villain.” “Big sigh- oh it’s going to be so hard to put them down.”\n\nI had an ex that absolutely ADORED being the victim and then complaining to his friends about us. How frequently are you being placed in a lose-lose situation by him?", "NTA as long as your cool with him doing it as well.. everyone needs a break sometimes", "NTA. He is a selfish husband. Go out and enjoy yourself", "I don’t think either of you are TA. There is a communication break down for sure but that doesn’t make either of you an A. I’m a long way removed from either of my kids being 2 months old but I do remember feeling nervous about being home alone with a 2 month old and a 4 year old. He’s probably just nervous and doesn’t know how to admit that yet.", "NTA at all.\n\nI'm about to put on your shoes, due in 4 weeks with an almost 2 year old. My husband and I have explicitly discussed that come this spring we both need a night off a week or every other week. \n\nMaybe a good compromise is having your husband go out for dinner or drinks with a friend the night after and you do a solo bed time? That way he gets a night off too. I'm sure you both could use it.", "NTA. It was stressful to handle bedtime alone with a infant and a two year old, but you should both be able to handle that. It makes life much nicer when having small kids to be able to get away, meet friends and do non-parenting stuff once in a while. Like going to a concert.", "NTA.", "NTA if your partner had an issue all this time he should have spoken up and used his big boy words. Maybe in exchange you can offer that he go to another event and you take care of the kids for that? But he's completely in the wrong here pretending to be fine with it until the last second then acting like a fucking matyr", "NTA\nYou checked in with him several times before buying the ticket. He didn’t stop you. If he really wanted you to stay home, he should’ve used his grownup words and said something.\nAnd also, every parent needs to learn to take care of their kids by themselves.\n\nI mean, what would he do in emergency and you’re not available for night time? \n\nIn this case, he has time to plan out how he’d like the evening to go. He can even find someone to come help him if he’s that overwhelmed.\n\nJust make sure he gets a night off soon too.", "NTA\nBeen in this same position, he might have difficulty getting through bedtime but he’ll do! You didn’t know how you’d get through the wk at home being ill. But you kicked the weeks butt. \nHave your night and try to be present in your evening. If the kids don’t go to bed then you’ll have cuddles waiting for you…", "NTA tell him to have a word with himself. You checked with him multiple times and he said he was fine. He's their father he Will cope. Even if bedtime doesn't go 100% to plan it will be fine.\n\nMy hubby can be a bit lazy when it comes to childcare but even he coped with six-week-old twins plus a two-year-old when I had a night out. Was he dreading it? Of course! But he had to suck it up. He helped make them so he can damn well get stuck in.", "Full NTA, you have communicated with his this entire time", "NTA", "NTA. But your partner is for that attitude. Kids can pick up on it, and he's right. It will be a terrible evening if he goes into like that.", "He recognized that you going was reasonable so objecting would make him the bad guy.  He was hoping you would somehow that he, a helpless father, could not be expected to cope with the kids the way a mother is assumed yo do.  He intended that you just sacrifice so he wouldn’t have to and do he could say it was your decision.  Didn’t work out and that wasn’t in the script.  \n\nHe is exploring all the ways he can maneuver you into being confined to the home as the parent without any of the oppressive aspects if that being seen as his acting entitled.  \n\nGood luck", "NTA. But your husband is a guilt-tripping AH who needs to learn how to DAD on his own just like you had to MOM on your own while he's at work. Go enjoy your concert!", "Why don’t you try doing solo bedtimes prior to the evening out? This will give him the confidence he needs and you will know that he can manage otherwise you will be thinking about this whilst out.\n\nIt’s all anxiety related, I have 3 grown up children but there was 3 under 5 yrs old. We would take in turns even though we were both home with the other there if needed.\n\nTbh I was very scared with a newborn but my husband just got in with it, very capable so I can relate to your husband.", "NTA you asked and he agreed. My husband and I try to do this somewhat often. It’s good for you to get out and for him to figure out bedtime. Hopefully something that interests him will come up soon and you can try it in reverse.", "NTA - you asked multiple times and he assented every time. I think now it is a reality, it is major cold feet and he's panicking. But you are going to have times where only one can do bedtime so not bad learning experience. \n\nAs to his martyrdom by turning down events so as not to burden you, he took your opportunity to decide whether it was really too much or not from you. So I am not sure why you owe him anything for making decisions without talking to you. He assumed a burden, you discussed it after managing sole care yourself for a period of time. Are you partners or is he used to making all the decisions? \n\nHowever, he is upset about putting two small children to bed on own. He is a responsible parent so it is this one aspect he's worried about. So trial runs might help but do it first so he can't sabotage you, consciously or not.", "ESH, he really needs to be more upfront with his communication, and stop saying things he doesn't mean. It's very obvious he doesn't want you to go. You really shouldn't be leaving your 2 month old already, that's too young.", "Info: \n\n>Our toddler recently has had a sleep regression\n\nHow recently? Has this changed since you asked if he was OK with you going? I don't think either of you are AHs, I think he is just scared. And I bet you would be as well if you were planning to do your first solo put down when the toddler is in a tricky sleep patch.", "[removed]", "NTA, I wonder is there time, can you try to do the bedtime on your own before the concert?", "NTA - father here, and it sounds like u did all the right things (asking, checking in, offering to cancel if it was truly necessary etc). He's stressed about it because as you pointed out it's overwhelming with those kiddos for anyone at that age (I have 3). \n\nI would just make sure yall are on the same page about these types of nights. In our house we don't do things like that which are just for fun. And if we do, we do them together and find a sitter etc. If there's something truly unique/important then of course we do it and accommodate, but usually we don't just go blow off steam at the expense of the other parent. Sounds like that is his perspective (not going to some events) so just make sure yall land on the same page.", "This!", ">  He is their father! \n\n\"This\" - _so much_. I _hate_ when any of my friends or coworkers would say \"oh, you're babysitting?\" \"No, they're _my_ kids!\"", "Ha! Toddlers sure do hold you hostage at this age! We are taking steps for a better night time routine. They had been sleeping great and are going through a regression. Hopefully it does not last. We've been trying all the sleep tips and tricks to get back on track", "Thank you for your reply. It's a hard time of life right now!", "Thank you so much for your reply. It gives a good perspective and I like your suggested support statement.", "That's exactly how I felt afterwards having them both home while I didn't feel well. It confirmed I can do it!", "Yeah, this. I remember when the kid was young feeling scared to do it all on my own but it's totally possible. It's just a bit daunting.", "He's actually very hands on and we divide and conquer the evenings evenly. So I was a bit surprised by his reaction. I think bedtime specifically is what is stressing him. Neither of us have done it solo yet.", "He used up all his sick time at work to take paternity leave when our baby was born. Since I'm still on leave I stayed home with them.", "This is not a red flag, sick parents have to take care of sick kids all.the.time. Especially when both usually work. She’s on maternity leave.", "I agree, we have been actively working to make better sleep habits for our kiddo. It's a process but we are trying!", "This makes sense. I was definitely apprehensive doing it for a few days solo too.", "Soo parents should be expected to stay home 24/7 when a new baby is born? Seems unhealthy. Everyone deserves a break. Especially new moms.", "Do you think a 2 month old needs 2 parents at all times? Because it seems that the father works every day based on her comment that she’s on maternity leave, while not mentioning his leave. So your logic is that a father can’t take care of their child as well as the mother? Newsflash: dad’s aren’t babysitters, they’re exactly as capable as caring for their children as a mother… or they should be.", "I already responded to this comment, but I literally had to come back again because I am *reeling* from this.", "That's insane.  It's a few hours!  He leaves for work every day.  There is no difference.  Every mom Needs a break.  I'm glad she's getting one!", "What?? She's not leaving her two-month-old *alone*, she's leaving the two-month-old with *their father*. Would you be saying this if OP was a SAHM and left alone with both kids most of the time? No. Because it's completely unreasonable to expect that all two-month-olds will have both parents with them at all times. Imagine.", ">You really shouldn't be leaving your 2 month old already, that's too young.\n\nWhat?? Too young for what??? They work. They should be going out. What do you think happens when you have a child?? They are supposed to stay by their side 24/7 for the first year? Can't take a shower by themselves?? Grocery shop? Doctor appointments? Work??", "Why exactly shouldn't she be able to leave the baby with its other parent?  A few hours away is not going to hurt the baby.", "She's not dumping the two month old on a babysitter, the baby will be with their FATHER. It's up to her if the baby is too young to do without her or not for a few hours.", "It’s literally a few hours.  He’s doing it every day for work.  How is one leaving ok but not the other??", "[removed]", "It is hard! I've been there. I think there is a line where you can be compassionate to the anxiety he is experiencing (it's a valid emotion) and firm on that you also both need to be able to do things for yourselves. Once you are both confident in your ability to look after the kids, it becomes no big deal to let your partner go out for the evening here and there. You can tell him how you used to get anxious doing this kind of thing too and it does get better by doing it. Also at the end of the day, if it doesn't go perfectly it doesn't mean he failed. Enjoy your concert :)", "It is hard and you’re all still adjusting to having 2 kids. But you’re right in your thinking and it’s not realistic to have all hands on deck 24/7 forever. My husband does the same thing of deciding ahead of time something will be awful and that behavior can be frustrating, but hopefully he’ll come out the other side better for it and more confident. It’s just new right now and it’s hard.\n\nEdit: NTA", "Can he “practice” putting the kids to bed by himself before the concert? It might help the kids (and him) feel more confident.\n\nAlso, NTA. He needs to know how to do this on his own. What would he do if you had an emergency and could not be home for whatever reason? He would just have to suck it up and get it done. He needs to do the same in this situation as well. You deserve to have a night out without the kids.", "Me too- especially if either of the kids are currently breast fed. It was fine in principle, but I remember panicking a few times that I didn't have that as an option if things went wrong!!", "Hmm, if only you guys knew that this concert was coming up so he could practice solo bedtime beforehand in preparation for the event...oh wait.\n\nNTA. He's an adult. If you can't rely on him to figure this out (whether it be calling in people to help, doing research, or practising in advance) your relationship is doomed. What will happen when there's a real emergency and you can't rely on him to step up?", "There’s a first time for everything and it has to come eventually. You checked in with him and he’s just stressed but he’s got this. You enjoy your night out, mama.\n\nNAH", "Also, his attitude of \"its going to be terrible already\" is going to truly mess up the whole evening. If he expects it to suck, it will. He will be grouchy and irritable and losing his patience. If he goes into thinking he gets quality time with his kids and makes his own fun, he will have a much better time.\n\nThis is the chance to build a blanket fort or have breakfast for dinner or start some fun daddy-daughter traditions.", "I totally hear this but no matter how hands on he is, dads always have freedoms that moms don’t.  Don’t feel guilty about your decision.", "Is a babysitter or friend coming over in the evening to help him not an option? If he wants you to be able to go to the concert but doesn't think he can handle taking care of the kids on his own then that seems like something he should have prepared for beforehand.", "How classic of reddit to always assume the worst of the dad with no evidence.", "So you watch both all the time while he’s at work?", "I wouldn’t stress too much about that. Your eldest has just had a major upheaval in their life, it’s bound to make them push boundaries and even regress at times. They also may use bedtime as that’s the only one to one time they get won’t their parent now theirs a new baby.\n\nNo judgement, my three year old did the same thing when his sister was born. Took a bit of time, but they’re back to their normal routine now. \n\nNTA by the way, you asked if it was ok several times. Your husband should have used his words and told you no, not guilt you later on. That’s not fair.", "Exactly don't feel guilty at all. I get it that you've both never done it solo, but he'll manage! OP will inevitably do it herself as well. This is what happens when you have kiddos so close together. Sleep times can be chaotic. It'll really probably be with just the 2-year-old really. The baby is a couple of months old and will probably eat, shit and fall asleep, haha. Then focus on the toddler. He's being pessimistic when he'll most likely be fine.", "I had this in my original post but had to make room for an edit. Normally my mother-in-law could come but she is currently sick. And the other friend that helps us with child care is coming to the concert.", "I typically work full time but I am home with the baby while still on maternity leave. Our toddler usually goes to daycare. Occasionally I have them both, but normally just the baby.", "You don't have to make room for an edit, the character limit only applies when you first post.", "That's unfortunate but still, none of this is on you. If he actually expressed his concerns one of the multiple times you checked with him, some sort of arrangement could have been made beforehand, such as hiring a babysitter to help for the night.", "You know who needed his mom to come help with the children? My grandfather, a man from rural Italy born in the 30s. I sure hope your husband is from our generation and can handle his own kids by himself for a few hours.", "NAH - this is just the challenge of having little kids.\n\nYou are absolutely deserving of a night out, and you kept him involved in the decision rather than springing it on him, so you are absolutely in the clear. \n\nYour husband is also right that his night is probably going to suck, and he's going to have to do it all by himself. He's not looking forward to it, which is ok. It also sounds like he's communicating decently well with you about his feelings. Remember it is not the job of either of you to make the other persons life stress free. It is the job of each of you to support the other's happiness.  If anything, it just sucks that he's feeling negatively about this experience already, which is coming out as angry at you. In the same situation, he could feel like he's happy to do you this courtesy and give you a night out that you deserve.", "NTA, but....\n\nIf neither of you can handle bedtime solo for a 2 month and 2.5 year old, you should definitely not have more kids.\n\nAnd laying down with your 2.5 year old every night until they fall asleep is setting yourselves up for a rough road for the next several years.", "NTA but as someone who has done bedtime by myself many times (husband doesn’t get home from work until late) with kids that age it is HARD and there were many times I had to run back and forth between the two rooms with each one crying every time I left to care for the other. It is exhausting and stressful and while I do it every week for half the week and have for the past year, I still don’t look forward to it at all.\n\nPersonally, if neither of you has ever done it before, I’d start with putting on Ms Rachel on YouTube for your toddler, get the baby down to bed, then go back and put your toddler down to bed.\n\nAlso, sleep regressions are hard. We have a Yoto, a little audio story box that our toddler listens to and falls asleep to at night. It’s usually Winnie The Pooh and it helps her a LOT when we can’t be there to snuggle her like she wants.", "NTA - Also understand his anxiety. It sounds like you do too. I think you are asking if you should go. Honestly I think you should, your partner will have a hard night, but my experience is it usually goes better than expected. Make sure he knows you understand his anxiety about this, that you appreciate it and will leave event if he needs your help.", "NTA. He can figure it out for one night. My husband has worked evenings since before we were married, so I've always had to do bedtime solo. My first two are 21 months apart, so while it isn't easy to get a toddler to be with a newborn, it can definitely be done.", "My husband does this sometimes - agrees more than once to something I ask and then is resentful. I tell him I am not a mind reader and if he wants something he needs to tell me. Over time this dynamic has improved but it is infuriating to ask multiple times about plans and then find out your partner didn’t truthfully express their feelings. You’re NTA and I urge you to address this issue so as not to have repeated incidents of your husband agreeing to something when he actually doesn’t want to.", "NTA - both parents should be able to do any part of childcare by themselves once the new baby adjustment period dies down. He's anxious and I get that, I would be too! But it's a hump he's going to have to get over for the family to thrive. Encourage him, build up his confidence but definitely go to that concert!", "I think you're somewhere between NAH and a very mild NTA.\n\nI get husband having said yes because he wanted you to be able to go. I get him now having regrets/second guessing his decision. It's even reasonable to share those worries with you. The part where he is the AH is where he then makes you feel guilty about doing what you both agreed on ahead of time and is entirely reasonable and healthy. But overwhelmed parents of newborns do get a lot of grace.\n\nBut you're definitely NTA for wanting to go or for going ahead and going. Perhaps you can help him see that it's going to be fine. Worst case scenario: neither kid gets to bed on time. They're tired and a little cranky the next day. Then life moves on and everyone is FINE. Remind him he doesn't have to do things the way they normally get done or perfectly. As long as everyone is alive at the end of the evening it's a success. In fact, it's valuable for the kids to learn that it's okay to deviate from routine and do things differently sometimes, too.\n\nMy sister-in-law has a great t-shirt from when her kids were young that says something like: \"Goal for the day: keep tiny humans alive.\" And when you remember that's ultimately the goal, it takes a lot of pressure to do thing \"right\" away.", "NTA\n\nIt's one night, and he's their parent too. You're not going on a month long trip to the wilderness.\n\nGo to the concert, and then you need to start having some chats with him about expectations and about passive aggressiveness that he dropped on you, because that's really crummy.", "He sounds lame. The best way for him to learn is by himself.\n\nYou deserve time to yourself that’s not kid-based", "NTA as you checked with him multiple times beforehand! \n\nThough I will say maybe having a practice run where he dealt with it but you could still be around to support if needed would have been helpful if he hasn't done a bedtime with them on his own before.", "NTA. You even offered to stay if it's too stressful for him. It's up to him now whether he wants to communicate what is wrong or not.", "NTA. you literally checked with him again and again. im sure you’ve put the kids to bed yourself plenty of times, is there a real reason why he can’t parent his own kids?", "NTA. \n\nYour partner will be fine with two kids for one night, unless he thinks the two of you can never be alone with the kids? But of course, he is okay with you being alone with the children, just not himself. \n\nYou need to have a conversation with him. First, you need to go to this concert. He agreed to you going, you are looking forward to it, he will survive putting two children to bed.  Be clear that he agreed to you going alone and you both need to be honest with each other and hold to your commitments. \n\nThe next part of the conversation is that he can't hold it against you that he turned down activities without even talking to you about them. The two of you are partners, and your family is a shared responsibility, and you both have to work together AND find time to be adults out in the world. You should each get some time to yourselves, time with just each other, and time as a family. Sure, there are time periods where that is harder (having an infant, when potty training is happening, etc), but when possible, you both need to get out and do stuff. \n\nThis is your chance to get out, for one evening. Sure, there might be chaos, but he can handle it, or he can ask a friend/family member to come over and help. What he cannot do is tell you that you can go, then get upset you are going, then mope around about how hard it will be before it even happens, and ruin your one night out. So YOU need to make sure you can be in the right frame of mind to actually go have fun and not deal with his emotions.", "NTA. I have two toddlers who are less than 2 years apart, it’s awful and hard and you NEED a night to let loose. I’m a SAHM and my husband works really hard but he is still an equal partner with not only the kids when he’s home but cooking and cleaning too. I know how overwhelming it is to be home alone with two small kids but if it’s not this concert it will be something else eventually and both of you need to be comfortable being alone with both of the kids at night. Sadly with parenting you are thrown in lots of overwhelming and stressful situations, for him this is one of them. It’s the first but I guarantee this won’t be the last so he has to suck it up. If he’s really mad and stressed about it may I suggest a family member come over that night and help him? Just so he has a little support? If that’s not possible and you don’t have help nearby it’s more of a reason you should go tonight. He has to get used to being with the kids alone otherwise you’ll be trapped never being able to go out without a fight for a very long time.", "NTA, he sounds like a big baby! Poor thing, having to do what good parents and teenage babysitters all over the country do every single day for their own children, just just one time lol", "NTA at all but do something about the sleep issues with those kids!", "Even though neither of you has handled the \"challenging\" bedtime routine solo, there may come a time before that routine settles down that one of you will have to be away for a night or more. Required absences are often stressful. Would he rather have to go solo for the first time when you're both stressed by whatever takes you away from home or on this occasion when your absence is for a fun reason and you'll only be gone part of the night?\n\nNTA", "NTA. You are not a mind reader. Your partner should have said something far earlier.  This kind of sulk into you get your way behavior is childish and annoying at best, and it is very controlling. You will end up forced to censor your words and actions before you do anything that you enjoy. Your partner will be able to say that he never asked you to do/not do XYZ because you'll be working so hard to keep him from pulling the angry muppet face. \n\nHis predicting a terrible evening is a great way to guarantee it, btw. \n\nYou asked your partner weeks ago. Don't let the jerk ruin your good time; he had every chance to act like an adult and chose not to do it.", "Nta, why was he against hiring a baby sitter?", "NTA - it's one night, he'll live.\n\nHe already had several chances to tell you he wasn't ok with it but didn't. Time to Dad up and figure it out..", "NTA. People have got to stop acting like caring for their kids by themselves is an impossible task. Parents can’t be always expected to be there together to divide and conquer. You are allowed to have some time away from them. And if he has a difficult night? So what? He’ll live because that’s life with children.", "NTA. Any objections he had he should have stated. Is the event by chance Rock the Universe? Just curious.", "NTA \nHe is a parent to these kids just as much as you and needs to parent them no matter what, even if it's a little tough. I take it most nights you're the one dealing with bedtime. Change your routine every other night you put the kids to sleep, take turns no difficult situation should be handled alone in a two parent household.", "NTA but he's certainly in that territory.  It's ONE night for heaven's sake.  Is he always so negative/catastrophizing--like a mental health issue--or is this a new thing?   He said he didn't mind if you bought the ticket so now he has to put on his big boy panties and be a father for an evening.  Frankly he sounds exhausting.", "NTA, I think he’s just salty, like I get salty when my dog has diarrhea and have to clean it he’s probably just tired but he’s your husband so you should just talk when sprits are high", "NTA. Back in the day, when rules for kids were not as restrictive, my father's best friend had a situation where he and his wife had to go away for the whole weekend. Their kids were 6, 4, and 2. I took care of them all by myself at their house, 30 miles away from my parents or other help. It was challenging, but they all got to bed, got meals, we played. The house was not set of fire. \n\nI was 11.\n\nYour husband will be fine.", "NTA\n\nIt’s not your responsibility to manage your panthers feelings.  He had the opportunity to say please don’t go and he did not.", "NTA\nHe could ask a friend or relative to come over and help him out while he stays at home with his kids. But he'd rather act like a helper than a parent who arranges supports as needed rather than expecting \"the boss\" to anticipate and plan for his wants as well as everything else. He showed up for work, what more do you expect? That he's happy \"on shift\" and rudderless until you get back?", "NTA your partner will survive one night alone with the bedtime routine. You bought your ticket after he said he was fine with you going. Go enjoy your night out.", "When the kids are young, you have to take turns to do what you like to do, and so sometimes that means (I hate this saying but it’s perfect here) you have to take one for the team. Families, at least those with a moderately healthy relationship, are teams. So if Team Leader M needs a night out with adult friends, then Team Leader D needs to take care of Cadets 1 & 2. And vice versa. NTA.", "NTA - He chose to be a parent. Turns out you have to parent your kids. Can’t serve the time? Don’t do the crime bruh", "I would have said N-A-H because parenting is hard.... but it sounds like he's not willing to accept a potential solution to the issue he's bought up repeatedly. You offer to cancel, but instead he wants you to go and what, feel guilty? Worry for the other parent of your children doing necessary, alebit difficult, chores? NTA.", "He’s a parent too. NTA sounds like you deserve a night out.", "NTA. You asked, multiple times, he didn't use his words to say it was a problem.  \n\n\n\"He said it was discourteous of me to buy the tickets knowing how difficult it will be to have both children by himself at bedtime.\" I'm willing to bet there are times you've done bedtime alone. You've just done *four days* alone. Time for him to step up and figure it out, and lay off the guilt trip.", "NTA at all! You checked with him multiple times before purchasing the ticket and even offered to sell your ticket. He declined, so you should go and have a great, guilt-free time. Yes, he will have a horrible night because he already decided that he will. That’s on him. He could be looking forward to a wonderful night of daddy time with his children, even if it can be challenging. His attitude is his responsibility, not yours.", "NTA. It’s actually important that each parent figures out a way to be able to do things on their own. Emergencies happen, and the last thing you would want in an emergency is the added stress & anxiety of how will I manage in my own or how will my partner manage without me- having confidence that your partner can hold down the fort is a valuable comfort. The arrangement you currently have was never going to last forever, eventually one of you was going to be the first one to be absent at bedtime. Is it somehow unfair that you happened to be the first one to have an evening engagement? of course it’s always going to be easier when you have all hands on deck, that’s true at bedtime or doctor‘s appointments or long drives. My kids are 6 & 8 and relatively easygoing about bedtime, and it’s still that much easier on me when my husband is present (his job has him away in the evening at least a couple of times a week, and it’s been that way since before they were born). The attitude your husband is giving you is completely unfair, and if he goes into it expecting chaos and meltdowns, that’s what he’ll get.", "NTA. You checked with him several times, leaving lots of time for him to speak up. You deserve a break and he should be okay to manage for one evening!", "NTA.  You asked, he said he didn't have a problem.  But additionally, doing bedtime solo for a 2 month old and 2.5 year is not terrible!  I did it alone for kids 3 times a week when they were young.  And then my husband was gone for 2 weeks for work and I was home alone 24/7 with no help.  I survived.", "Nta. You are going to a concert not traveling for a week to Dubai. He needs to get over his fears and just suck it up. You deserve a break. Plus, if he can't properly communicate his feelings like an adult then maybe the issue is that you are contending with three children, not two.", "NTA. He can handle his two young kids for bedtime. You gave plenty of warning and opportunity to cancel. He could have spent this time working out what would help him manage alone for an evening. What if you were to drop dead? Can he not be relied upon to care for his kids?", "NTA. He sounds more of a cry baby than the kids.", "You brought this up with your husband twice, telling him that you wanted to go and asking if he was okay with that. If he had concerns, he should have addressed them when you asked. I'm sure you would have been disappointed but would have decided not to gone based on his opinion. \n\nIf he changed his mind afterwards, he should have told you. Will it be a challenge for him? Likely. Will he be able to handle it? Probably. \n\nYou did your part by talking about it, and he said it was okay.\n\nNTA.", "NTA. He's an adult so he's very capable of handling two kids by himself... His kids.\n\nThe more stressed he gets the worse it would be. Don't let him guilt tripping you, enjoy your night out the same he said multiple times he was ok with.", "NTA and because he’s convinced it will suck, it will probably suck. And there’s a decent chance he’s gonna be a buttface about the whole thing.", "NTA\n\n Your husband is an asshole because he is guilt tripping you.  He told you it was OK and then waited until right before the concert to change his mind. If you waited weeks to buy the tickets, then he could have easily been working with the child to adjust habits. \n\n Being a single father with 50/50 custody, I understand the tribulations that go along with adjusting a child's schedule. It's not impossible, but it's very challenging.  You learn a lot about your parenting skills or lack thereof. \n\n Back to the question at hand. Using guilt in order to control you is a straight-up asshole move.  After 10 weeks of maternity leave, you deserve a little bit of relaxation.", "He's their father.\n\nHe can put them to bed, no matter how difficult, without you. It is good practice for when you resume your whole life rather than just being a 'mother'.", "NTA You asked, he said okay and now he’s upset? Too late. The time to be honest with you was before you bought the ticket and got pumped up to go to the concert.", "NTA.   Who’s the biggest baby in this story?  How did humans descend from the trees and walk upright across the savannah only to become the masters of the planet when a man with two small children can’t cope with being alone with them for an evening?  Go to the concert and stop babying your husband.", "Nta\nFirst you checked multiple times\nSecond kids those age are most of tje time hard but enough who do it alone.\nCan't a parent help him? Your or his mom?", "OP, everyone is different but when my daughter was 6 months I sent my husband to an European trip weekend and when she was 8 I went to Ibiza for a weekend with my girlfriends. And we are not 20 😀, well into our late 30ies.Everyone was happy.\n\nFind some balance on these subjects otherwise It will build resentment overtime\n\nNTA", "Nta, you checked multiple times that they were cool with it. They were probably assuming you wouldn't actually follow through with it. \n\nThe fact they are assuming it'll be a terrible night is them trying to guilt trip you into staying home. They are a parent too, they can give you a break", "NTA. While he is valid to few nervous about bedtime solo, you have him the opportunity to say no. He chose to make it a problem at the end. Also if he was looking for a challenge free life, then he shouldn’t have had kids. They are nothing but challenges, so might as well get used to it. Enjoy yourself at the concert!", "NTA. My ex left me for an entire weekend to clear off with his mate - I’d just had a rough wisdom tooth extraction and I had a 4yo and 2yo twins. We survived the weekend, your hubby can survive an evening", "You asked, he said it was fine. Multiple times. NTA. He’s acting like a toddler so he should fit right in with your kids that night", "He will figure it out", "Ahhh…there was a post like this a while back, wish I could find it…roles were reversed. Women beat the shit out of the guy! Set him on 🔥and roasted him like a marshmallow!", "NTA.  I used to have an evening bobbin lace class.  From the time kid #3 was 1yr, though having another kid, to the kids all in college, I went to these weekly classes. My husband treated those evenings as sacred.  He jumped through every hoop he could, to make sure nothing interfered. He didn’t enjoy putting the kids to bed on his own, and I’m pretty sure he sometimes bribed the oldest to help, but, they all managed.  I did take the new baby with me for a few months (maybe 6) because my teacher adored babies, and she demanded to hold him while I worked, but my husband would have kept him, too, had that been necessary. \n\nOccasionally when a kid was sick, I assumed I’d stay home, and he acted insulted.", "If your both used to bedtime routine together, then maybe he thought you wouldn’t say yes and then thought you might change your mind and be with him and kids.  But that’s besides the point as he did say it was ok for you to go.  But I wouldn’t put it past him if he gets asked out for a night and he says yes, and will continue to do so every time he’s asked.  Once you break the unspoken unit, it never goes back to being the same.", "NTA. It’s one night. If he was so\nUpset. He could use his big boy voice.  He just wanted you to feel\nGuilty and ruin your evening. So don’t let him. He can handle this.", "NTA \n\nHowever, I remember some of those stages when it really helped to divide and conquer. Could you guys hire a baby sitter for a few hours that night so he can fully focus on the infant and sitter can hang with the toddler?\n\nBonus, if it all goes well, you can use the sitter to get out with each other.", "Didn’t read it all tbh, sorry if I missed it.\n\nINFO: did he expect he would never be left alone with both kids at bedtime?\n\nI get he’s miffed to be stuck home with that headache, but that’s not related to you going out. Kids will always need you", "NTA. Sounds like your husband is being dramatic. Maybe do something special for him to thank him for wrangling 2 kids on his own at bedtime?", "Your partner is just a selfish, whiny baby.   While I understand (his/her) frustration, they should have spoken up one of the several times you asked.  They put the stress on themself.", "NTA. He’s a dad. He needs to figure it out. He also needs to communicate better bc he was wrong to be upset after the fact when he was asked repeatedly", "NTA but make sure he knows you are fine with him going to do what he wants to since you say he put off things not to leave you alone", "NTA so much. \n\nI'm not claiming to be some kind of super-dad, but... we have four kids and due to my wife's work schedule I typically have them alone at bedtime a few times per week. Ever since #1 was a baby, and being increasingly outnumbered since then. Being afraid of handling TWO kids... does not impress me.\n\nYeah there have been evenings that haven't exactly gone as planned but generally it's been ok. You have to figure out and establish routines.", "NTA time for dad to step it up, it won’t kill him. Everyone deserves to get out once in a while.", "Nta. He had time to speak up.", "Men parent your own children challenge every freaking year ever.  NTA", "NTA\n\nyou checked, they said OK. They can not like it all they want but trying to stick you on a guilt trip is a piss take. Parenting with a partner is a team event", "NTA you asked 3 or 4 times right? And he was fine every time.", "Men can blame woman with ,,it's just a child it's not that hard, you just need to watch and Feed it\" \nBut it's way too much for them, to watch their OWN CHILDREN FOR ONE FUCKING DAY. like bro wtf even-\n\nGod Bless my Bf is a REAL MAN and would always take care.", "I might be downvoted but I’m going with NAH he told you it was fine if you wanted to go so that’s on him. But on the other hand if you say you guys have divided everything equally and never done bedtime solo cause it’s a hard and stressful time then yeah you kind of messed up a little. It’s not fair if he’s never left you alone on bedtime just know that this opens a door when he decides to\nGo on one night out you can’t complain cause you owe him one so if you’re ok with that then go ahead. And he’s not even telling you not to go he’s just expressing that it’s going to be a thought night  so at the end is up to you.", "Nta I mean god forbid he could “babysit” his own kids for a single evening", "NTA. Sounds like you actually have three children to look after.", " NTA. Your not responsible for your partners feelings of anxiety. His feelings are fair but he can’t use them to guilt you.", "NTA you checked and checked again! He should use his words and speak up.", "So NTA! He’s stressed about having to care for *his kids* for a few hours because it involves laying on a bed for half an hour?", "NTA Have fun at the concert and don't allow your husband to guilt trip you into not going.", "NTA - your partner didn't communicate and you gave him plenty of chances. Can you offer to take bedtime on your own one night to give your partner a night off as a peace offering? He also needs to commit to better communication. It isn't your job to read his mind. And if he is going for the idea that you should have done \"the right thing\", that is BS.", "NTA. I didn't need to read the full post to know that. You asked and even waited to purchase the tickets. \n\nThey are his kids too. He agreed to taking care of them and sorry for his luck if he didn't want to closer to the event.", "NTA. Maybe he could do a trial run if bedtime alone with you still at home?", "NTA for expecting that your husband is capable of parenting his own children for a couple of hours", "NTA go to the concert, have fun and turn the phone to silent. Also to prevent a bunch of daddy can't find calls make a quick grab basket for both kids with diapers, pull ups, wipes and medicine. Make sure anything he might need can be found easily.\nYour the mom and he is the dad he can handle one night solo of kiddo duty. You handled the kiddos just fine when you were sick home alone with them. You had to put them both down for naps, feed them and everything on your own while he worked. Don't worry and go enjoy your time with friends.", "NAH,\n\nYou both could use a break. You aren't an AH for taking one, but he also needs to take one himself. It's perfectly reasonable to want a break just as it is to whine about being exhausted.", "If he didn't want you to go he could've opened his mouth and communicated this like an adult the first time you asked instead of sulking a couple days before the event so you 'feel bad' and stay home. You bought the tickets, he's gonna have to deal it with it for *one evening*. NTA", "NTA he’s being ridiculous", "NTA he’s literally a parent, why does he need help to take care of his own kids? I could understand if you were going out every day, but a concert for one night after you’ve been cooped up for ten weeks with small children?\n\nI’m a mom of 5 and work full time and you best believe I leave the alone kids with my husband every once in a while to go on a hike or kayak or attend a work party. I went back to work weekends when our youngest was 6 weeks old and he was alone for 12 hours at a time with a newborn and 4 kids all day but he figured it out without calling more than a couple times the first few weeks. My husband never complains. I do the same thing for him if he wants to have a break. We’re doing it alone with 5 whole kids under 8 years old and he can’t handle two? What if you got sick or hurt and were hospitalized and gone for even longer than a day or two? Every parent needs to have some sort of experience of being with their kids on their own because you’re not always going to have someone there to help.\n\nAll parents deserve a break. It doesn’t matter who makes more money, who pays more bills, or who has had it easier/harder. People losing identities outside of parenting and being an employee can make things a lot harder than they have to be. Just because you’re their mom doesn’t mean you have to sacrifice other things. If he had a problem he should’ve mentioned it long before now and you could even offer a trade off and let him go enjoy something while you watch the kids next time. But no, go to your concert and enjoy yourself mom.", "But what about all the imaginary events HE missed? NTA, but your immature husband sure is", "NAH.\n\nYou are reasonable with your plans. One night only, planned in advance.\n\nHe can express how the night is going to be hard for him, nothing wrong for wanting some empathy before something hard. Soft AH for guilt tripping about how he turned down events.", "NTA\n\nEven when splitting care, a disproportionate amount falls to mom and you have given birth. You need time away and he needs to get over himself and not make you feel guilty.", "Oh look, another dad who whines about “babysitting.” The weaponized incompetence is real. NTA", "He's trying to guilt-trip you into not going. Don't let him.\n\nWhen you come back, he's probably going to be angry. Ignore him (or alternative, time to get angry yourself bc this is his problem). He had ample time to communicate with you, he never said it was an issue and he is the freaking father for god's sake. What is he going to do if God forbid something happens to you?\n\nTell him to man the eff up and be there for his kids by himself ONCE.\n\n*\"I already know it's going to be a terrible evening\"*\n\n*- \"Maybe, but I'm sure you'll handle it perfectly fine without me.\"*\n\nNTA.", "Not trying to be rude but bedtime is a pretty basic parenting task. I'd have reservations about someone who is pushing back do hard about doing it a single time.", "NTA   he's being a weenie.  What does he think parents do when the spouse works evenings?   They have bedtime  duty every night that week.", "Wow... I understand your partner being stressed.  Kids at bedtime... that can be such a headache depending on what each child needs.  However, his time to raise objections would have been when you first asked... or even when you asked again before buying the tickets.  Instead, he waited until practically the last moment and laid it on so thick that you were sure to not REALLY enjoy yourself at the concert because of the guilt he's laying on.\n\nYou are NTA for wanting to go to a concert.  And your partner isn't either for feeling overwhelmed.  But he absolutely is TA for how he acted.  He actually called you discourteous after you asked multiple times and he said it was okay?  Dude needs a dictionary and ought to look up the word.  \n\nMaybe offer a trade off and he can have some night to himself and you can do bedtime solo.  But please let him know that his sudden change in attitude and his comments are not acceptable.", "First off I want to point out all the people on here assuming your husband isn’t helping. Y’all are sexist and assume bs way to quick without facts. \n\nSecond, NTA. He’s nervous, that’s all. Prep, help and, assess. You need this time off too. He needs to learn (as do you) how to do some things solo again. Push him to have some time to himself too, since it sounds like he may need it.", "NTA Your husband is being childish. They are his kids too, and he has a responsibility to parent them just as much as you do. It's not going to kill him to be in charge for one night. And you had asked him several times anyway.", "NTA it's one evening even if it's difficult it's still just 1 evening. You asked multiple times if he was going to be okay with you doing he kept saying yes. Enjoy yourself", "You checked. It's fine.\n\nSo long as you are willing to solo child care then he also should be able to. \n\nAnd the answer to a guy that finds caring for the kids solo to be so hard is to give them more chance to practice. \n\nIt's very important for both partners health and sanity to be able to go out now and then.\n\nWhen kids are little and/or challenging it might be just a few hours now and then, then evenings, then overnights. But both parents should gift that to the other.", "NTA - You asked, he said no problem - so he looked like a nice, generous man. Now you bought the ticked, he's not so nice and generous... Come on, it's one evening. If he can't be in charge of bedtime alone for ONE evening, he's not such a great father.\n\n&#x200B;\n\nEDIT: In her comments, OP says that usually her husband's mum would be able to come and help, but now she's sick. I bet husband had planned to call mummy and let HER do it all, but now that won't be possible he's panicked. Just imagine, he has to actually parent his own children for ONE whole evening! /s", "NTA. If you don't go to that concert I will jump out of a window. Your husband can't be alone with the kids for one day? That's pathetic. You asked him multiple times and he didn't say shit, only decides to say something when it's too late, that is also pathetic. Go to the concert and have fun, let your husband learn what it means to be a partner and father.", "NTA. Your husband had plenty of chances to object and he said he was fine. It's 1 evening, he'll be fine. If necessary you can ask a family member if they can come over for the night or for those few hours so your husband isn't alone", "NTA. You did your part by repeatedly checking with him. He’s the kids’ dad - he’s going to have to operate outside his comfort zone, and this is one of those times. Enjoy your well-earned evening, and don’t let him guilt you before, during nor after.", "Neither of you are TA and I don’t understand how everyone is jumping on him for being anxious about something neither of them did by themselves(putting them to sleep) and saying he had to be a father she admitted multiple times they split the workload", "NTA- Of course it's going to be a horrible evening for him. And he 100% signed up to that when you both decided to have kids. Having kids is hard work. I've never heard a parent talk about any part of parenting that they actually enjoy other than getting time off from their kids. Therefore you have both agreed to take 'the hard shift' solo occasionally, and you both deserve time off when you can get it.", "Poor little thing.... He has to face exactly what is it to be a parent.\nNTA, take your evening off, enjoy it, you deserve it. He's a grown man, a father , he will deal with the evening routine, as so many women around the worl do, without any complaint. \nIf you're able to do it, then he is too. You don't have magic trick or extra skills cause of your vagina. Tell him to suck it up (is how you say in English?) In silence ^^", "Nta.. go have some fun and leave daddy alone with the kids.\n\nHe will love it!", "NTA: You asked. If your partner can’t communicate, that’s his issue.", "NTA", "NTA. You gave him plenty of opportunities to say he wasn’t comfortable with this, but he decided to lie to you each time and say he was. Go to the concert and have fun! Maybe next time he’ll actually be truthful.", "Nah..and how the fuck you have two kids with this ungrateful double faced motherfucker ?", "INFO: when you say someone has to lay with you child up to an hour for them to sleep is that person always you?", "NTA\n\nFirst thing to say is in response to this:\n\n>The last conversation we had he said \"I already know it's going to be a terrible evening\"\n\nI'm sorry but this is a _tremendously_ asshole thing to say to your partner. If this isn't emotional manipulation I don't know what is. He's all \"don't sell your ticket\" but also making you suffer and guilt tripping you.\n\nIf he's anxious or has concerns, raise them, talk like adults, but this is just ridiculous to act this way.\n\nYou checked with him and it was only days before he raised a concern.\nEven then, this is a single event and one night.\n\n>He said it was discourteous of me to buy the tickets knowing how difficult it will be to have both children by himself at bedtime.\n\nIt's _absolutely not_ though - you've given him ample time to raise any issues he had and even now it's not \"too late\". But even with his concern, this isn't some kind of a roadblock - how is having you there or not going to change the difficulty of bedtime?\n\n>He said he has purposely avoided events that he wanted to go to because he did not want to leave me alone at this time.\n\nThis isn't \"valiant\" and he unfairly hasn't even given you the opportunity to say you'd be fine with it, either. You don't win \"points\" for sacrificing things for someone else without even their being aware as a couple.\n\n>I have been on maternity leave for 10 weeks and have been looking forward to a night out. I didn't find the request unreasonable, although I do agree it can be challenging. Another detail is I have also been home alone with both children the last 4 days\n\nYou know what, you're a Person long before you are a parent. Your mental health matters as without it, you can't be a parent and give both safety and care for your children.\n\nYou've looked after your children alone for 4 days - so why is it a huge sufferance for your partner? Is he not used to doing so? If so, this is a great time to learn and you have ample time before the concert for him to ask you what to do if he doesn't know already - which given they are years old, I'd hope he does anyway?\n\nWhere was he and what was he doing over this time period? I'm not suggesting he was off relaxing himself but the point is, if you can manage _while unwell_ for four days, he can manage _a few hours).\n\n>Our lives are chaotic right now and it is hard with two small children. But I don't think it's unreasonable to leave the house for four to five hours one evening.\n\nYou're right, it's not unreasonable and it's very important for you to take time to yourselves to do your own things and pursue your own hobbies, lives and pleasures where it's possible.\n\nNothing stops you going out - if he has such serious anxiety that you can't leave the house and leave him for _five hours_ while you're left to marinade in stress for _four days_ there's a serious issue here that needs addressing - does he have any kind of mental health issue? Could it be Post-natal depression? Has he found it hard to do things alone and panics?\n\nIf so - tackle this, together. Get him help, but all the same _you_ need to look after _you_ still and whether you get the support of friends, family or a babysitter there is easily a way for you to find a chance to take a \"time out\" without needing him to act this way and make you feel as he is.", "He doesn’t want you to sell the ticket and he isn’t telling you not to go, so the end result is he’s just making you feel bad for taking a night to yourself. NTA - you should go and have fun, and in the future, he needs to be better at communicating.", "Lord save me from fathers who don't want to parent because it's difficult. Kids are hard, suck it up. These are also always the same guys who talk about how manly they are. Want to be a man? Go grab the kids special rubber ducky and give them a bath. Then read Little Acorn for the 400th time. Then go and crack a beer, you did it, they're asleep.", "Exactly. Now he's booked OP a ticket for a guilt trip. \n\nWhy? Does he think it will give him something to hold over her head? Does he think this will keep her from every asking again? Or is he just naturally a miserable person?", "All this.\n\n&#x200B;\n\nBut also, him saying \"I already know it's going to be a terrible evening\" is just awful.  What a horrible attitude.  He needs to suck it up and change is attitude before he makes it a terrible evening for you and the kids too.  (Although he sounds like he is trying to ruin your evening already.)", "Fathers are parents also, they can watch their children by themselves. It's an important skill for each parent to be able to take care of their kids. \n\nNTA", "Yeah at this point he’s the AH for trying to ruin your evening - which he agreed to months in advance and several times.\n\nHe doesn’t have to be super duper yay I get alone time with the kids happy. But he shouldn’t be trying to ruin your night out.", "100%\n\nMy wife and I have a 4 year old. Bedtimes aren't usually tough, because she's very obedient and loves our routine, but they do run *long* because that routine is lengthy. Usually takes about two hours from \"bedtime\" to actually in bed with the lights off.\nBut it works and we have almost no troubles with her and bedtime.\n\nANYWAYS. I digress.\n\nI had a point I wanted to make...what was it?\n\nAh yes! \n\nDespite the somewhat draining length of the routine, my and I will still do nights where one of us will go off and do something and the other will have to fend with the little one. \n\nAll parents should get a night off once in awhile, whether that's together and the little one is at grandma's for the night (date night!), or separately doing our own things. \n\nSure I work hard at my job and I come home tired and don't look forward to those occasional nights where it's just me and the little one.\n\nBut my wife works just as hard (if not more) taking care of our kid for most days in the week. She feels the same way.\n\nThe only way these family dynamics work is if\n\n1. Everyone pulls their own weight.\n\n2. Everyone gets some time off once in awhile. \n\nNo exceptions. \n\nFamily life is hard (even with just one kid), and OP's husband needs to get his shit together if he can't handle one night alone with the kids.", "Also he can book himself a vasectomy to ensure there are no more children if he’s struggling with literally one night. Welcome to parenthood.", "The husband is so dramatic! Maybe it’ll be a quiet night for the kids, probably it’ll suck - but you’re right. It’s literally one evening of his life.", "I’m going to go ahead and agree with NTA, however I do want to point out that this is a direct consequence of not teaching boys to be vulnerable. Him constantly saying it’s going to be bad night is his way of saying “don’t go to the concert, I don’t think I can handle bedtime by myself” but he can’t actually say that because like many men he lacks the tools to share that type of vulnerability. Though, it’s not up to her to read into all that, so NTA", "NTA...it's 5.5 hours at the most. I am allowing for traffic to and from event.\n\nOP your partner is allowed to have his feelings...but feelings are not facts they change. Let him do bedtime alone. As a parent you both need to work through this moment. One of many challenges as a parent. I am sure every parent does this eventually.\nAfter your trip it's his turn to have a night out. Have fun.", "I agree with everything apart from \"get over himself\". It can be daunting to look after kids this young solo. He wants to do it for his wife hence saying yes, and now it is scary. But yeah she should go, and it will be good for him to prove to himself he can do it.", "That's it. I was always slightly terrified when left alone with kids. Especially the first few times. Always starts rough with the goodbye and then turns out better than expected.", "All of this! NTA", "This!\n\nHe is sucking all the fun out of the night and making it all about him.\n\nHe had multiple chances to say something, but now that the plan is made and the ticket bought- well, now he needs you to change that for him. Except he won't actually say so... He's just going to say no to all of your proposed solutions and then moan and complain and hold it against you.\n\nI'd respond to everything with \"you had multiple chances to object, now the plan is made\" rather than circle around his feelings every time.", "Yeah if you do the lay down with them for an hour, they'll want you to do it every single night.  You have to be careful what you incorporate into their routine.", "He has put them to bed, they just both haven’t done a solo bed time. In her edit she clears that they split everything pretty evenly.", "Read her edit, they split evenly.", "This is misandry.", "Not \"help\" - just parent them. Because \"help\" seems to be the problem. Many dads can \"help\" so long as mum is in charge, organizing everything and giving them detailed instructions of what to do, when and how, but they panic when they have to do it on their own.", "I agree. No, it is a different event.", "Why, exactly, shouldn’t she leave her 2 month old with its FATHER???", "We usually alternate nights to break it up/take turns. But he probably puts our toddler to bed more often because I'm breastfeeding our baby. So if bedtime falls at the same time baby is hungry, he will put the toddler to bed", "Right? Just because she gave birth to them doesn’t mean she has any more special insight as to what they need and how to get them to go the fuck to sleep. She’s grasping at straws just as much as he is.", "[removed]", "Tbf the OP says that neither of them has ever done a solo bedtime. So I don't think he fits into the dynamic that you describe.", "I'd actually look at it as a great opportunity to spend time with kids while Mommy is away. \"Daddy's night with the kiddos, woo hoo!\" Stressful? Maybe. Having kids can be extremely stressful but it's rewarding too. Heck, he could wear it as a feather in his cap (\"yeah I watched them both during bedtime which is a normally a two person job! Pretty good, huh?\"). I have no clue why some fathers seem to think that they are not an active participant in raising their kids and having responsibilities.  Dude, suck it up. One night.", "\"yes\" to all", "Because now he is anxious about how the evening alone with the two kids will go.", "You can just tell he's already planning to blow up her phone during the concert.", "I was thinking the same thing. “I just know it’s going to be a terrible evening.” Well, with that attitude I can guarantee it. Kids pick up on that shit. Change your outlook, figure out a way to make it fun, or at the very least, just don’t be a damn Debbie downer.", "Regressions are the worst!! But this too shall pass! Please go to your concert and encourage your husband to go out sometimes at night too (while you do bedtime) and maybe even have a babysitter and both go out. We found our bedtimes got easier as the kids got used to not being able to hold both of us hostage.", "BIG difference!  I withdraw my comment.", "Some people in this sub are so quick to throw around red flags and call people names etc. I’m sure he’s fine and is just anxious, like you said, bc it’s new. Things have been rough with sleep and that will mess with your head. It will all be ok.", "Your first solo is rough. He's probably scared. I'm doing a 1 and 3 year old for a week while my wife travels for work. For better or worse you make it special for the kids, and be a \"bad\" parent. Guess what older one? You get to hang out and watch bluey for an extra half hour while dad puts down the younger one. Then you and me can get you down all by yourself.", "NTA. But do you have some wiggle room in your budget? Maybe you can offer to hire if your spouse arranges for a baby sitter to manage the 2m while your spouse handles the 2.5y? Or maybe you have an in-law or a sibling who could drop by at bedtime for an hour? Suggest your spouse call around for air support. \n\n\nAnd even if you don’t go that route, sometimes that kind of contingency planning can help decrease stress/anxiety. \n\nYou got this, mama. You deserve your night out, guilt free and your spouse can handle one bedtime. And even if he can’t, what’s the worst that happens? Your toddler falls asleep a bit later than usual? Or on the couch? He’ll figure it out.", "Great opportunity for him to try, then. It's one night. He'll manage. Even if the kids don't get to sleep, he'll manage. Complaining that it's going to be a terrible evening means that he doesn't have to try. He could have said something to back when you brought up the idea, but he wanted you to feel guilty and make what he thought of as the right choice without his acting like a f'ing adult.", "Lmao. If the genders were reversed my comment would be the same, so no.", "BuT the UtErUs iS a MaGiCaL oRgAn! GiViNg pReCoGnItIoN\n\n/s\n\n\n\nETA: Thank you for the award!", "Eh I do think moms have a bit more of a natural connection to kids since they grew them for nine months. That being said It shouldn't effect work load/responsibility.", "They have a 2.5 year old kid, so having never done a solo bedtime raises some side questions I would have. But at the end of the day, OP gave him a heads up, and he said nothing three times. Using solo bed time as an excuse is weak sauce, in my mind. As with almost everything kid related, you gotta figure it out. Let OP have their night instead of whining.", "He's an adult, he can communicate his anxiety without acting like a sulky teen.", "I wouldn’t be surprised.\n\nThat or another seemingly common approach is possible — call his own mother for help.", "Yep. I'm guessing he magically won't know where anything is in the house while she's at the concert. I hope she ignores him.", "[removed]", "No, they share every night", "Thank you, that's reassuring. It's hard to understand also if you don't have small children. We just need to communicate better in the future and get through the chaotic babyhood/toddler time of life.", "Did you hear it though? They are a team couple, not a \"I have less freedom than you so I get to go out\" couple. They should approach this like a team (with empathy for his anxiety about the evening) such that they can progress to a place where they both feel comfortable having solo time.", ">This is the chance to build a blanket fort or have breakfast for dinner\n\nAW, this is the stuff that I miss the most from when my kids were little :(\n\nNow they're tweens/teens and way too cool for that (and Mom) \\*sob\\*", "Why should the father of the children need help putting them to bed? One child is two months-feed/change/diaper them and they are good to go. He just has to wrangle the toddler into bed.", ">45 min. ago\n\nThe uterus actually is a MAGICAL organ.", "Pretty sure they mean solo since they’ve had 2 children, especially since neither have done it, not just the husband. It’d be weird for neither one of them to have ever done solo bedtime at all. And \n\nOther than that, I agree, he had plenty of opportunity to object and doing so after the tickets are bought and with the excuse he used, lame.", "She probably means solo with both!", "Exactly!  As a parent, pity parties are totally a bad look.", "Or he can, as I’m sure they tell their toddler, use his words to say how he actually feels.", "Apparently he couldn't (at least didn't). I answered your why, I think she should go out.", "Going from one to two is a very difficult transition for everyone in the house (except the new sibling LOL, they just do their own thing) so if your husband is usually really good about sharing parenting duties then I would chalk this up to nerves about handling both kids on his own.\n\nYou will both get more used to things and in a few years you'll be so used to it that you won't even remember what it was like to only have to watch one child :D\n\nAlso, 2.5 years is exactly how far apart my two are, and I very clearly remember the sleep and potty training regression that hit my oldest when we brought her little sister home. It was a rough few months, but I promise that it gets better and you become a battle hardened veteran parent of two that doesn't blink an eye at anything less than blood LOL.\n\nGood luck, and enjoy your new family of four OP!", "Because two months olds are necessarily easy to put to bed? We don’t know how the baby acts or what they have, and she said neither of them have been solo for bed time in her edit.", "The whole human body is.", "Well, solo with both in 2 months, you've got to start Some time. He had time to object. He didn't. So guess he's starting now! Easy NTA.", "Even if that is the case, someone has to do it first. Why not the father?", "NTA. Dad should have voiced his concerns but Reddit is treating him like a deadbeat. The mom literally never did bedtime alone either. Not knocking her but it’s clear this guy handles his business as a dad and husband", "NTA. I'm not going to comment on your toddlers sleep issues because that's not what you asked. But I will say bedtime alone with small children is a bitch (I have 3 under 5 and do bedtime alone 5/7 days) so I understand him being a bit grumpy about it but at the end of the day he said yes so he doesn't get to change his mind last minute (obviously excluding emergencies)", "NTA. He agreed to it. You’re an adult that deserves to have fun. If he can’t handle a bedtime by himself, he sucks. Yeah, it’ll be different and maybe hard, but it’ll get easier over time. You guys are allowed to do fun stuff, even with kids!", "NTA - and if I may speak from personal experience he doesn’t care if you go without him per se, but I would be LT he’s now actualizing the responsibilities he’ll take on solo and his fear of failure is driving displeasure at your absence. \n\nThe easy way out is to make it look like he doesn’t want you to go, when in reality he doesn’t want to navigate bed time alone. \n\nSet the bar low for him, they’ll be fine, he’s just afraid he won’t meet your standard.", "NTA. He is scared that he can't make it, and it will be difficult. But there has to be a first time, and he did agree, so let it be the first time. You had the first time of 'being ill and taking care of the kids in daytime all on your own'. Tell him it doesn't have to be perfect, and if he falls asleep with the toddler left and the baby right of him it's also OK.", "Maybe I'm over simplifying this, but the 2 month doesn't really have a \"routine\" per say at this stage, so the focus should be on the 2.5 year old for 30 to an hour.  Can he babywear, or put the baby in the bassinet or crib or a swing chair to get the 2.5 year old to sleep (so long as the baby isn't fussing?) I think he's making a bigger deal out of this than needs to be made.\n\nNTA his passive aggressive attitude needs to be checked.", "[removed]", "[removed]", "NTA dude moaning about having to do a bit of parenting on his own. Boo fucking hoo mate. Join the club.", "NTA", "Info: are you bottle feeding? I was breastfeeding when my children were your kids' ages. I could not have left my children at that age for that long. \n\nYTA if your youngest doesn't take a bottle from your husband yet. That means no milk = no sleep = screaming kid.", "Ah, The joys of parenting and \"Adulting\", Lovely.", "NTA. Everyone needs a break and should be allowed to enjoy stuff, even when a new parent. It’s not like you’re gonna be gone lots now", "NTA.  This is ridiculous.  They're his kids too.  If you can watch them alone so can he.", "NTA.  Your partner needs to put on his big boy pants.  He gave the okay and is now chapped because you assumed that he was telling you the truth?  I can't stand those self-inflicted \"wo is me\" people.", "NTA.\n\nIt sounds like your partner doesn't want to prevent you from going because he would too obviously be a jerk. So he just wants you to feel bad for going. \n\nHe'll survive.", "It’s one night, he’ll live. NTA", "NTA - you asked multiple times. You said in your edit you two equally split the workload etc, so he can figure it out for a few hours", "NTA. \nOften the anticipation of it being bad is worse than the reality.  \n\nTell him to do a trial run one day while you have a chill out on the bedroom.", "NTA.  He needs to deal with the kids just like you. He can be unhappy about having to de  as l with the hard stuff, but he definitely needs to keep his trap shut.  This post indicates that you need a night out at least once a week so it becomes easier for him.", "NTA\n\nHe's a dad. He needs to be able to handle a nighttime routine on his own every now and then, just like you did for four days when your child and you were sick. What if the roles were reversed and he wanted a night out with his friends? \n\nYou both need to be able to handle some hard nights, even on your own, because there will be plenty that will come your way when it's NOT a fun event.\n\nHave everything he needs ready and in plane sight, that way he has no excuses to call barring a real emergency.", "NTA. Go and enjoy it. Then when he finds some reason he wants to go out and it's bedtime, then you will do the whole bedtime routine yourself.   \n\n\nStop listening to him complain. Just tell him you're going, you deserve a night out, and that he can plan a night out at a later date which you will support.", "NTA. You asked. He said he could handle it. He can handle it.", "ugh NTA its just one freaking night, he can deal. Jeez.", "NTA - it’s hard work but not impossible. You also asked if he was ok with the arrangement multiple times and he didn’t disapprove. I would do actually be 100% supportive of my partner going out, you need the time away from the kids and enjoy some me time. Nothing wrong with that.", "FFS, you asked him several times and he was happy for you to go. Now he throws a hissy fit because he has to look after his own children for a couple of hours, you know, like a parent. The worst that can happen is he can’t get them to sleep and cry for a while. So what. No one died, it’s a one off event and you deserve a break. NTA.", "I rolled my eyes so hard at this. NTA", "NTA.", "NTA, but you know this.\n\nIts one night, Jeezus, worst case scenario they are still up when you get home.\n\nNot the end of the world.\n\nThat bullshit your husband is pulling, you best address that real quick.\n\nLife doesn't always run on schedule, and him doing passive aggressive shit with the kids as an excuse is pathetic.", "NTA. I don’t know how many more times you could have checked in with him.\n\nHonestly he needs to grow up. Sometimes you have to do things you don’t want to do with children so I don’t see why he has to mope about it and try to ruin your enjoyment of your night off.", "I'll never understand why people have children with a partner who refuses to be a parent.", "Nta\n\nYou gave him many prompts. He should have said something before hand. He’s being a jerk.", "NTA. Your husband is being a manipulative dick. He's one of two parents. He needs to man up and take care of his kids and let his wife have some time off. I guarantee he would expect it for himself.", "YTA, and oblivious on what’s going on. Your partner doesn’t want you to put these decisions on them. They expect you to be responsible and make these decisions yourself.\n\nIf they make a decision there’s no winning. Either they are controlling and declined you fun times, or they are to get through the horrible evening.\n\nResponsible thing would be to understand that and not to put a partner in this position in the first place and just responsibly decline because it’s clearly not the time.\n\nThink and read the room.", "Lord, this is tiresome. Go, have fun. Hubby needs to stop whining and suck it up.\n\nNTA.", "Nta \n\nYou repeatedly checked in to see if this would be ok and he said it was. It’s pretty shitty of him to do this and try to guilt you when he’s the one who said it would be fine", "NTA.   Your partner needs to grow up.   Parenting is hard, you adequately communicated.   He needs to figure out how to do the same.", "Oh my goodness....he can handle bedtime for one night.  Definitely NTA.", "NTA. He’s a parent too, so he can figure out caring for his kids.", "NTA.\n\nI have no time for this kind of petulant immature bullshit.\n\nYou checked in with your partner with plenty of notice before purchasing tickets (courteous and respectful) and was told it was fine. \n\nA few days before the event he starts to sulk because you took him at his word that this was ok and now he's on the hook to parent by himself for one whole evening? To the point where you're seriously thinking about selling the tickets and giving up on your opportunity to go out and enjoy yourself? \n\nThis is a behaviour I've seen many times with selfish immature people, where the whole point of it is to ensure (consciously on their part or not) that you don't actually get to enjoy your event, because they're setting up a situation where you feel guilty going, or are stressed the whole time worrying that they're upset or not coping, or that the kids will be suffering. It's bullshit. It's a way to punish you and have something to hold over your head. If it's because he's anxious, then it's on him to communicate that effectively and respectfully, and to put in some strategies to support himself, not make you feel bad for wanted a single evening out.\n\nIf he'd wanted to go out for something like this and you didn't, do you think he genuinely would have batted an eyelid at leaving you at home with the two children?", "Omg he will be fine. I was alone with my one and two year old for six months. It's one night.", "OMG!!! you’re leaving him alone! WITH HIS OWN CHILDREN?! FOR A WHOLE NIGHT?!?!?!?! howEVER will he manage? \n\nNTA, he’s being ridiculous", "Absolutely NTA. You gave him MULTIPLE outs. You clearly indicated that you would arrange care with appropriate notice. Not your fault he doesn’t know how to use his words. Also, daddy can take care of the kids for one night.", "NTA this is not okay behavior. He failed to communicate properly and is now trying to get out of it. He is a parent, sometimes that means doing bedtime alone. He will survive. Sure, might not be easy, but what about parenting is? \n\nHave fun at the concert!", "\\>Now it is a few days before the event and I could tell he is upset. \n\nYou are not the asshole. However this is where you made the mistake.\n\nMost people think that parenting comes naturally. For some it does. For most, they need training. What you should have done was training your husband and children to do the bedtime.\n\nYes it is not your responsibility. Its both of your responsibility. However, if you did that, this would have gone much more smoothly.", "NTA.\nHe can parent his children alone for a night.", "NTA\n\nCommunication is key and he choose not to communicate. There could have been an important conversation about your need to get out of the house for your own well being and his opposition to the particular time of this particular event. \n\nHe can have his miserable time in the evening that could have been avoided if he had discussed this. You have worked hard and should have some fun.", "Deadbeat dad identified", "NTA.  \nHe had multiple chances to object, and waited until you got them to voice his concerns.   \nAre the two of you supposed to completely stop doing things you enjoy? There's going to be things that he wants to do, leaving you to watch the kids.  \nNobody said parenting is easy.", "lol nta am typimg this while putting to bed my darn stubborn 3yo as her 1yo sister i alrready laid to bed an hour ago as my wife works\n\nits just 1 nigbt", "NTA he's being weirdly passive aggressive.", "NTA bc he had ample time to object. he's not either an AH he just is not good at communicating.\n\nhe mentions he hasn't been able to go out, or has been declining things (?), in order to parent.\n\nmaybe offer to watch the kids alone one night in near future so HE can also go out and enjoy some time off. \n\nit sounds like he hasn't been expressing that need, but now that he sees you are doing that, he wishes he can too.\n\nhe can handle one difficult evening with the kids. we can all do hard things for people we love.\n\nand hopefully with encouragement he can get better at communicating with you. you guys are a team!", "NTA - it sounds like your partner likes to play the martyr which is not a good look.  You asked them multiple times if they are ok with it.  You then offered not to go even AFTER they said multiple times it was ok.... and they're still bitching.", "NTA, and geez - it can be a lot of work, but taking care of kids alone is part of being a parent.   It may be a difficult evening for him, but it may not, and who cares?  He's spending time with his kids.", "NTA. Drives me insane when men find parenting “hard”. I had to watch my two nephews (3 and 1 year old) for almost two weeks while my SIL was in the hospital and my brother was tending to her. Was it easy, no but it’s what comes with the territory when you have children. I would do it a million times over and they are not my kids! You give up some comforts, social life and sleep because that’s what happens when you have children. Tell your husband to stop sulking and grow up. \n\nYou asked your husband multiple times if he was okay with it and he said yes. You did everything right, enjoy the concert!!", "As a mom to a 2 month old and older kids including a 19 month old, I would say NTA. I understand your husband is overwhelmed, but he should have given you a straight answer from the beginning at that point. Your husband’s not at fault for being overwhelmed, but he is at fault for not being clear with you from the beginning and also saying you could go and then changing his mind later about whether he could handle solo bedtime with the kids. But for the sake of your marriage and family, I would suggest you two have sit-down discussions about anything out of the normal going forward to make sure you’re both on the same page. And you should also be talking about how the division of labor needs to be more fair. If you’ve taken care of both the kids the last 4 nights, homeboy needs to step up his game. Yes, it will be hard, and yes, he can still do it. Worst case scenario, can you find a family member or sitter to help him while you go? Not to say that that should be your mental and physical burden, but I’m trying to think of ways you could still go while knowing your kids are well taken care of. And then you can figure out the rest with your partner after the event.", "NTA. Parents need time to do enjoyable things that aren’t centered on your kids. Hopefully you guys can talk and he can go to one of the many things he’s apparently been turning down. No one wants to parent with martyr.", "NTA.\n\nFirst, you asked TWICE and got confirmation that it was fine. If he was going to be resentful, he had ample time to bring it up to you. It will be challenging, but he will survive. He should be happy to do it, and looking forward to a night out of his own in the future. Personally I think getting to step away occasionally is healthy. In any case, I don't think he handled this well. It's not fair to tell you it's fine, then make you feel guilty, but not let you cancel. It's manipulative. Also, he's got a very negative attitude about hanging out with his own kids. Sure it'll be a challenge but he's a parent and caring for your kids solo is just something you need to do from time to time. His defeatist attitude would be super annoying to me. He should suck it up and realize that this will happen occasionally for both of you.", "NTA. He had plenty of time and opportunities to speak up.", "NTA he is just a dude and stressed about the kids. He will be fine and he will get over it as long as everything is on the up and up.", "NTA. Ugh passive aggressive behavior like this is the worst. Why didn’t he just say something before?? You’re not a mind-reader. Also, yes you deserve a break. You’re not even gone for a full day, just one night.", "NTA. You were completely considerate and gave him multiple opportunities to ask you not to buy tickets. He chose to make no complaint. Now you’ve even offered to sell the tickets, and he says no and continues to complain.\n\nIt sounds like he is being passive-aggressive and trying to get something he can hold over you later as “remember when you abandoned me?”", "NTA please go to the concert. The passive aggressive attitude he’s expressing is not ok and he needs to communicate better.", "So no one here has thought that he was perfectly fine up until the date was getting closer and closer. Until the realization that he would not be fine at all.\n\nEdit: This might be a stretch but you should be prepared for resentment from him. After you leave and come back or before you leave.", "NTA, but your husband is being a baby himself. If he's telling himself it's going to be a terrible night already, SURPRISE, he's going to have a terrible night because he'll have a bad attitude about it the whole time. He needs to pull up his big boy pants and realize he had TIME to object- MULTIPLE times, and he instead chose to wait till a few nights before the concert. \n\nSo yeah, he \"doesn't want you to cancel your plans\" but he's gonna complain and whine about it the whole time, and make himself into the victim.  \n\nShow him this post. He needs a reality check. You're not asking for the moon here- especially when you handled the kids the past 4 days while they were sick.", "You’re a grown woman. If you want to go to a concert, you should be able to go to a concert. A solid marriage allows for their partner to do things without them and without making them feel guilty. \n\nIf your husband can’t handle bedtime by himself, he should probably attend parenting classes. \n\nShit, the amount of ‘girls trips’ I went on when my Daughter was under 10yo would probably put your husband in a fit of rage.", "NTA, go out and do NOT feel guilty!! You can owe him a night out while you stay home with the kids!", "NTA. It's one night. He'll survive.", "NTA \n\nYou gave him multiple opportunities to say he wasn’t okay with it and he didn’t take it. He doesn’t get to change his mind right before the event.", "NTA. He has major, major communication issues. Him being that honest with you about how he feels about it after you already bought the tickets actually makes him the asshole. He made his bed, and now he has to sleep in it. It’s super shitty that he’s now making it hard for you to enjoy your night out. I’m honestly grossed out - he’s guilting you for something he explicitly approved of earlier. Weird bait and switch, don’t you think? And I don’t love that he’s not being supportive of your social-emotional health.\n\nAlso, what’s his plan here? Neither of you are allowed to enjoy yourselves at night until the kids are easy?", "Jebus, he is an asshole. Speaking as a man, what the hell excuse has he for saying you can't go? He doesn't want to go so fine he doesn't go.   \n\n\nHow many kids do you have? How do single parent families work when they have to put the kids to bed? \n\n  \nTell him to wise the f\\*\\*k up and be a man/father and look after his kids. If he is such an inadequate man tell him to order a babysitter and let a teenage girl put him to shame.  \n\n\nAs an aside, lying with the kid with the sleep problem will not help, you need to sit beside/on the edge of the bed moving away while supporting the kid. We had the same issue that dragged on and on until we followed the advice given - 2 weeks later the issue was over.", "NTA. My wife usually handles bed time because our daughter does better with her, but sometimes my wife wants to do stuff and I do it. Is it a little challenging? Yeah, but I’m still the dad and mom still deserves to have fun or just relax in her own way sometimes", "It's tough with two small children that close in age, I've been through it, and it got easier, it felt like a miracle when we got to the point of one person being able to put both of them to bed, so much time was freed up.\n\nNTA, you did everything right. Your hubby was probably torn between wanting you to have a night out and not wanting to be left alone with bedtime.", "NTA - I bet he expects you to take care of them on your own. He can do the same", "NTA. He’s an adult. He has a mouth. He could have used it to communicate his preference. He doesn’t get to play the martyr “I didn’t do things I wanted to for your sake!”-card. Thanks honey, but I didn’t ask you to do that, and if we had talked about, maybe you would have been able to some of those things. And he doesn’t get to play the victim now because you couldn’t read his mind and he definitively doesn’t get to do the whole passive-aggressive “Oh No, just go. It’s fine. I’m still going to make you feel like shit for going, but No No, it’s fine. You don’t have to try to find solutions, or comprimises. I’ll just give grief for not Reading my mind!”", "NTA\n\nThis guy needs to man up and be a parent. If my wife wants to go somewhere, you know what I say? \"Have fun, I got it.\"\n\nYou get to take breaks.", "NTA - your not responsible for his guilt.   You asked and asked again but he didn't want to tell you no because he knew it was not unreasonable. Now it's time to follow through and he's just pouting.   Let him pout.   He'll be fine.", "NTA - You asked repeatedly and he said he was fine with it. If he wasn’t, it’s no one’s fault but his own. Go to the concert.", "Is there someone that could come and help your husband at bedtime? His parents, your parents? You are absolutely NTA but I also understand that bedtime with two kids can be very stressful if he’s not used to doing it by himself yet, especially when your youngest is that young. Some people are not comfortable with newborns even if they don’t admit it or even recognize it themselves.", "NTA.  I absolutely near-violently detest passive aggressive BS!  You gave him MULTIPLE opportunities to object.  He did not, until you’d already bought the ticket.  Now he’s whining about putting two small children to bed ONE night?  He needs to step up, be a good parent and a good partner, and a fucking grown-up, and stfu with the whining and PA behavior.  In the future he needs to use some basic communication skills and say something if he has a problem, not wait and then try to make you feel guilty when you don’t read his mind!  OP, go to your concert, have all the fun, you deserve a night out.  Ignore him, if you can.", "NTA\n\nHe needs to use his words and say so when he had concerns when he's asked, not wait until you've already purchased tickets and then act like you're the villain. If you can handle the kids, so can he.\n\nStart bedtime routine early if needed and get the kids settled with dad.", "Nta. I had twins 4 weeks ago, and also have a 3 year old. My husband is going to be home by himself for 4 hours tomorrow (beginning of nap time falls within those hours) because I have a hair appointment. Is my husband nervous? Sure. But he mans up, and handles it like a real parent.\nIf your husband can't communicate, he should not complain.", "NTA. You have watched both before. He can do it for a few hours. We all need time away to be ourselves. He needs to get over it and realize this is parenting.", "NTA. However, if you aren't going to enjoy yourself at the concert because you feel guilty or are worried about how bedtime is going, you will be wasting your precious \"free\" time. Enjoy yourself and deal with any fallout after you get home.", "NTA It will be a great learning experience for him and hopefully next time he won't be so freaked out by taking care of his own children for a few hours.", "I don’t have 2 kids, I only have one.  My wife is usually the one to do the bedtime routine but she works in event coordination so she out of the house once or twice a week at least and I do the whole thing by myself.  That’s part of being a parent.  Is being a parent as easy as sipping daiquiris on the beach? No.\n\nIt’s one night.   He’s not looking forward to it, ok, so?\n\nYou checked and checked and checked and every time he told you it was ok.  NTA", "NTA.  Although this concert is a planned event, in life the unexpected can and does happen.  I'm not wishing any dramatic event to occur in your life, but if you had to suddenly be away from home for a few days (say you had to have a brief hospital stay), your partner would have to figure out how to manage on his own.  Seems like if he had some experiences, such as one single bedtime to deal with the two children on his own, might come in handy.  He is the other parent, so while I understand it won't necessarily be easy - it's something he should do in order to overcome his anxiety and learn that he is indeed capable of handling between with two little ones, even if it takes awhile and leaves him drained (for one night only).", "NTA.. he really needs to learn how to take care of these 2 on his own for short spurts. I was a young mother of 2 that did it in my own every single night. He'll survive just fine.", "You are NTA, and he is right, it’s going to suck. Some parts of parenthood suck, and you endure through it. He is totally allowed to have these feelings and to share these feelings. These feelings do not negate the validity of your night out. Your guilt is your feeling to work through. You’ve expressed it, and now you can go to your concert.\n\nHe needs to honor himself and not avoid every event that would leave you doing solo bedtime, just because it would suck for you. That’s a convo for another day.", "NTA. He sounds like he is waiting for you to say 'never mind, I won't go anymore', which you kind of already did. He is just waiting for you to add 'here is the ticket, you go and have fun hun'.", "No you are not. But now you need to let him do the same thing. Have him pick something he wants to do that and you take care of the kids at bedtime.", "NTA. You're living with three small children, not two.", "NTA he should have said something right away if he a problem with it. Communication is key.", "NTA. \n\nI'm childless, and see roughly one band or artist a month. Sometimes even more than that. This thread hasn't made me any more eager to have kids.", "NTA. You checked multiple times, he said he was OK with it.", "NTA.  OP checked with hubby at least 2 times and he was ok with it.\n\nI am sorry but we are talking about 1 night where dad will have to step up and take care of the kids on his own.  He must have missed the note that said having children will not be all sugar cookies and unicorn's.  Raising children is work and partners giving each other breaks is very common.  Hubby needs to just step up, take care of HIS kids and stop whining.", "You asked multiple times if he was okay with you going, and he said it was fine. \n\nHe finally voices his objections and you offered to sell the ticket and not go, and he said he didn't want to take that away from you.\n\nHow can you be the asshole here??? He says it's fine that you go, he says he doesn't want to stop you from going, but man is he ever going to whine about it so that you can't fully enjoy your evening. I think we can all see who the asshole is here.", "NTA because he refused to tell you until after he let the resentment build. His unwillingness to communicate is not your issue to take responsibility for.", "NTA. Oh come on. I agree with him that it sucks that he has avoided events to not leave you alone and now you’re going, however that is canceled out by the fact that he said it’s ok several times. He should have said so from the start. \n\nIn addition, they’re HIS kids!! He can’t deal with them alone for ONE night??? Whenever I’m asked by my wife if I’m ok taking care of our daughter alone for a day or something I watch her like she’s gone crazy. She’s MY daughter. Of course I’m fine with it. Your husband needs to get more comfortable taking care of his own kids. They’re babies. Not a bunch of spitting cobras.", "How many kids does the OP have? Just curious, NTA, but on the other hand, if there are 3 kids, I'd not be happy either if I had to deal with the bedtime alone", "NTA.. you asked, several times... He did not voice his concerns. \n\nThis type of behavior is a communication pet peeve of mine.", "NTA. there are two of you, he can handle it. Your life shouldn’t stop when you have kids. It might be harder to coordinate but you can’t just stop doing things that make you happy. Maybe next time we will actually do something for himself too and have fun.", "NTA, he has to be able to take care of the kids.\n\nI'm also going to a concert Saturday, my partner is not interested because of the genre, but he would never say I shouldn't go.\n\nStand up for yourself and go enjoy the music!", "NTA. It is good and necessary for each parent to 1. Have some time off and 2. Be able to take care of your own children by yourself. Yes sometimes it’s SO hard but it is good for both kids and parents to learn how to do it. Also right now your kids are so little, that age is hard and sometimes you just gotta hang in there…. Just be sympathetic to your husband and show how much you appreciate it and make sure to give him a chance for a night off as soon as you can.", "When husband traveled when eldest was 3/4 and youngest was newborn/1, we went a little feral at home. My favorite (and eldest's) new bedtime routine when \"daddy\" was gone was to turn off the lights in the bathroom and throw glow sticks in the bathwater. Maybe bubbles if we had them. Occupied him for an hour or so in a few inches of water and let me sit in the toilet and feed youngest and talk to both. This was special because we only did it when dad was gone. We also would eat \"junk food\" dinners (nuggets, mashed potatoes, corn) and watch too much aquanauts. \n\nSolo parenting is hard. But, one night, dad can deal and make it special. If he goes into this with a bad attitude, it's going to be as bad as he thinks. \n\nNTA.\n\n(Also, I am a firm believer of cry it out. They get a story, tuck in, and a hug but then, door closed. Cry, get out of bed, do what ever but they stay in the childproof room. No way am I going to be held hostage by a tiny person for more than 15 hours a day. They have a nightmare? Come to my bed. But I am not going to sneak out of a toddler's bedroom like a thief)", "NTA. Hes right that it will be difficult, but he can do hard things, especially for the people he loves.", "NTA.  You asked and he agreed.  It is not too much to ask either parent to be alone with the kids for one evening.  I’m a dad and have raised 3 kids and have been alone with them young many many times.  He will survive just fine.", "NTA you gave him several opportunities to voice concerns. He has already decided it will be terrible, so it will be a self fulfilling prophecy. He has a bad attitude", "NTA, and you need to put your foot down about your partner manipulating your emotions like this. He's free to express how he's feeling, but he has no right to play up this \"No, no, it's fine. Go and enjoy yourself. Don't worry about me being miserable and having a terrible night. No really, it's fine, I want you to go. Have fun, don't trouble yourself thinking of what a terrible time I'm having.\" That's childish and manipulative.", "NTA. He’ll live.", "There are going to be times when one of you will HAVE to solo parent due to emergent circumstances.  It will be so much easier to do this if you have solo parented when it wasn’t an emergency.  \n\nMy husband and I do the toddlers bedtime routine together because life is crazy and we enjoy the quiet together time while we wind down.  \n\nShit happens and he had to unexpectedly solo parent at night when I busted my leg last year.  Because he had solo parented before, it was a lot easier, even combined with the upheaval of me being so injured.  \n\nToddler is absolutely my barnacle, but that just means we do more daddy put downs, not that I get stuck to do them by default.", "This isn't me finding fault in these two.  However......I can't believe that neither one of them has had to fly solo with their oldest child, at bedtime, in 2.5 years.  I know the father purposely passed on some things, but still.  And an infant at 2 months required frequent feedings, but they sleep a TON and shouldn't be any problem at all.", "All this, but OP should definitely make sure that he gets out soon for a fun time.", "This.  I clicked the link going \"please tell me it's not the dad please tell me it's not the dad\"\n\nNo. You are not an asshole for expecting a grown ass man to suck it up for *one evening* to allow thr *mother of his children* a well deserved break. \n\nFfs.", ">Well then.. what does he want?\n\nReading the post, I thought the same. \n\nBut after reading her comments explaining that they both take care of the kids together, I guess he really wanted her to go but now that the event is close and him knowing it will be difficult, he is probably just annoyed in advance at the thought of what's coming, which I get. \n\nAnd since the children are so small, it's normal to be stressed. It's not the typical AITA post whith red flags and disrespect/abuse all over the story. They will get through this, it's nothing major.", "I assume he expected his mum to come and do it, but now she's sick...", "He is an equal partner and parent. It seems as though he is anxious specifically about bedtime solo. I agree, I wish our communication had been better for this situation.", "She explicitly said he parents them equally with her?", "I will offer a night out for him too. I told him better communication in the future will be key.", "Yes, I did offer for him to go to activities he is interested in too.", "I'm definitely in support of a couch snuggle kind of night. You are absolutely right, firsts with your kids can be daunting.", "Babywearing was a lifesaver for me when our kids were little.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yes, we are breast and bottle feeding. I have bottles and extra milk ready to go in the fridge. Baby has no issues with eating from a bottle.", "It stated in the original post that both of them have been there for every bed time. This is going to be the first time that it's a solo experience for either of them.", "Someone didn't read the post.  Sounds like dad is a good dad.   Stress about a difficult night is not unusual even in those resigned to it.  He has not asked op to not go or sell the ticket.", "I think it’s because bedtime has been stressful lately and neither of them have done it solo yet. But OP asked multiple times, and it’s only one evening. Maybe this will be the night toddler falls asleep on their own because mom isn’t there.\nSide story: the first and only time my DH put our child to bed by himself he was very positive and generous about doing it. But when I came home I peeked into the bedroom and our son was halfway dressed and lying partially on our spare bed, not in his crib. I let it go because DH thought he did a great job but our son fell out of the bed in the middle of the night. He’s fine though!", "Mine don't sleep that easy so sometimes its \"bounce them on the couch while staring into the void that is baby lullabies on youtube for hours on end\".\nBut it won't bloody kill you to do that.\n\n(Diagnosed health conditions, special needs kids, hosptial specialists involved, normal advice doesn't help)", "To be fair OP says she has never been alone with them at Bedtime either.", "right! martyrdom will get him nowhere. I hope OP enjoys the concert. they deserve it!", "He wants to make sure that she won't enjoy the show because she feels too guilty for leaving him with the children, so that she feels less incentivized to make plans to go out and leave him with the kids in the future.", "Exactly. He's expecting a failure before it even happens. That's not a good mindset to be in about your own children...", "Kids are for life… not just the 30 seconds of fun", "Turn your phone on silent during the concert. Have fun! \nNTA", "NTA \n\nNeither is your husband except for the part where he already knows it's going to be a bad night.  It won't be if he doesn't expect perfection.\n\nMaybe just expect it will be new. And different. And that when mom or dad take an evening away, it's not necessarily a cause for distress.\n\nCan he give the toddler a special treat night of story reading for hours? Or heaven forbid a special movie and snacks? Holding the infant the whole time might be what happens. Is it going to hurt the universe if the toddler falls asleep on the couch with Finding Nemo playing wearing their pajamas? Dad and toddler can make it an unusual night. It doesn't have to be bad. Have things ready as best as you both can be prepared that things won't be regimented or stay as planned. \n\nHe should not be turning down attending things that are important to him either. But it is all about balance. You both should discuss and decide what a reasonable amount of time away is and be able to hand off to the other without feeling guilt. They're your kids, not aliens. Well....maybe only a little bit alien.\n\nGood luck,  plan as best you can, listen to him express his anxiety, and make sure he has your confidence.", "Been there. He needs to suck it up for you. This will recharge you and help you feel like more than just a parent. This is one night. One bedtime. A few hours. He’s been through harder things in his life. I did this everyday and most nights after a c section. While supposedly having a partner. We’re no longer together. \n\nFeel free to show him this comment: do it, with a good attitude and encouragement for your partner who needs to know that you can and will show up to support. Guilt trips are for relationships that will crumble.", "Oh it’s not always better than expected. I’ve had nights where it starts out rough and ends rough. Lol. Agree. NTA. If he is scared to do bedtime alone he should have opened his mouth. That being said. She never did bedtime alone with both kids. So I don’t think this guy is a slacker dad", "There were no tips or tricks that worked for us at this stage. I went full tough love after trying all kinds of reasonable things. Not for everyone, but no regrets. Good luck, and enjoy your night out. Offering to reciprocate might help with your partner.", "OP just gender-swapped a common cultural thing that pisses me off *sooooooooo much*. \"_Fine_.\" If you didn't _mean_ it was fine, then why did you _say_ it was? As far as I am concerned, we had this discussion and a decision was made.", "He is definitely handling this in a childish manner. Don’t be too hard on him though. He is used to having his teammate by his side at all times. Being alone at bedtime will be good for him. My 19 month old scares the shit out of my wife and I nightly so I get it. We sometimes act childish and take it out on each other but try not to hold grudges. It’ll get easier. You two sound like you make a really good team. You are both doing a really good job.", "My husband is like yours. He’s an equal partner with the kids, but he has his limitations in terms of what he can handle since he gets anxious. And doing something like this for the first time alone without any potential backup would freak him out. He would do it, but he would be super overwhelmed. I think you should take a more compassionate approach—you are partners after all—and tell him you’re going but ask him what he needs to make this easier for him. And do all of that. And yes, ideally, this is a convo you both should have had earlier. For my husband, that might look like me promising to handle bedtime the next day solo so he could go for a hike or whatever so he could focus on that when things get really hard with the kids. \n\nFor now, you deserve to go and he deserves to feel comfortable handling the kids while you’re gone, especially with if it’s his first time doing it solo. \n\nI can tell you that this approach has helped our marriage thrive. We both give each other that grace. We had 6 in 6 years and my husband can legit handle putting all of the kids (including the 2 month old) down for bed on his own while I take the time to go workout. To be honest, I think he might even do it better than me and I’m the primary parent.", "So no one here has heard of last second thoughts. Last second to realize that it is something he doesn't want to do.\n\nHas anyone thought that he was perfectly fine or thought he was perfectly fine until the date got closer and closer.\n\nEdit: this might be a stretch but better be prepared for resentment on his part after you come back. Or even before you leave.", "Perfect time to start!", "If neither of you have done it solo, it might be TIME for one of you to give it a shot. Working together is great, but kids need one-on-one time with their parents too. It gives them time to form unique bonds. Also, you need time with your friends. And vice versa. He will be fine. Your kids will be fine. And you will be fine.", "I think it's hilarious that so many of y'all report every comment about misandry while we almost never see reports about misogyny. Not sure what message you think you're sending with this but I am quite sure we're not removing comments because you simply don't like them.", "Then you are golden.\n\nGo, have a wonderful time, thank him for being a great dad, agree it's not easy to put the kids down and then, this is very very important, do not feel the tiniest bit of guilt. \n\nGo, have fun.", "Then NTA", "In an argument the other day, my husband commented on how I spend my free time reading things on where our children are developmentally and good parenting practices. Less than 5 mins later, he tells me that he can’t do all the things I do. It broke my damn brain.", "Ok I absolutely agree that NTA, but to be fair NEITHER of them has done bedtime solo ever, apparently, and he has also cancelled shit for this.\n\n So it isnt that he thinks that she can do things he cannot, its that he thinks they both need each other. It doesnt sound like he thinks what you are describing", "But they have been doing it together all this time. It's not like Mom does it all the time and Dad has to do it this once.", "[removed]", "Since the second child was born neither of them have done a solo bedtime.", "Well, he's just going to have to muddle through it then. If it doesn't go smoothly, too bad. It's one fucking night and she'll be there for the rest of them until one of them needs a night off again. NTA", "As already mentioned, one of the parents has to do it alone for the first time.  No reason it shouldn’t be Dad.", "Sometimes anxiety is just worried about the what ifs. It's not productive and sometimes people need to tell their anxiety to stop ruling their mental health. \n\nI'm speaking as someone that catastrophizes a lot and I literally give myself anxiety over nothing. It's not fun. Being crippled by your anxiety means you can't do normal tasks.", "Too bad she won't be able to hear it, lol.", "Because he's miserable so she has to be miserable too...", "This was my thought as well - and then OP does the same, so they both feel more confident.", "It's definitely different with two kids now. We are obviously still navigating through to find our routine. It has been a busy few weeks with the kids. It doesn't help that sleep has been limited with a newborn overnight too. It's usually man-to-man coverage. When you're outnumbered it's a little overwhelming!", ">dads always have freedoms that moms don’t\n\nWhat does this mean?", "Always? Ur crazy", "imothro asked a question, OP gave a response and you literally just refuted OP to the opposite. How is that fair", "Yes, I absolutely would do this. I messaged him and said if he had expressed his anxiety or unwillingness weeks ago we could have made arrangements well in advance to have someone come to help. Unfortunately my MIL who would normally come to help is sick and my friend who also helps will be at the show with me. So planning ahead of time to find someone would have been necessary. \n\nI told him it's okay to be creative in our bedtime approach for that night. I'm definitely not holding them to any routine!\n\nThank you. I'm hoping he and I can talk more to resolve the issue so it's not bothering me while I go out.", "\"I'm so glad you work to improve our family, because I won't.\"", "YES!", "That's bullshit (I say as a person who is 9 months pregnant). I don't know this kid, I haven't met them yet. My partner knows equally as much about this kid as I do. The only difference is that my body feels like it's being stretched in half and his doesn't. Perpetuating the myth that moms magically have some kind of extra insight just because the kid was once in our bodies only puts extra pressure on us when the kids are outside of our bodies.", "We decided after 8 years to have a second kid. Thought it would be easier because the 8 year old can kind of take care of himself. The only thing that changed is that the wife and I are old now. And always tired. Lol.", "I have small children, and it's important that you both be confident enough to handle the routine by yourselves because you both deserve to have a social life outside of your home. Needing both of you to do it means neither of you gets that. We got our routine down soooo good that we could list the steps for babysitters and grandparents, and that freed us up a lot to go have dates and such. We streamlined to make it short and sweet. ETA: We made it so anyone could put our kiddo down because he always knew exactly what was coming and it wasn't reliant on either one of us being there, though of course he'd prefer being put down by one of us. I just made it clear that wasn't always going to be the case.", "Yes and they would have done that. Had he been part of said team and communicated his needs at any point during the three times OP discussed it with him. Instead, he’s playing silly by deciding a couple of days beforehand that he’s going to guilt trip her. \n\nI actually would have more respect for him if he’d come to her, even at this point, and said “look I’m really sorry, I know I said it would be ok but I just don’t feel ready to do solo bedtime yet and im feeling really anxious. Could you sell the ticket and we’ll get ourselves to a place where we’re both happy with the situation, sooner rather than later?” Instead of this passive aggressive “no don’t sell but i know it’s going to be a terrible night.” \n\nThat’s the behaviour that doesn’t make it a team", "They do seem like more of a team than other couples I have seen...but they're clearly not truly equal if her partner is btching/being passive aggressive about having to put children to bed alone for ONE NIGHT...meanwhile, she'd made to care for the kids alone during the days when the eldest couldn't go to daycare even when she was sick. How many naps did she have to do alone?", "Yeah I did, I just meant that no matter how much of a team you are— moms are just different than dads. Innately, our instinct is to ALWAYS have the babies at the forefront of our minds. Example: Dads can come home from work and say ‘ok I’m gonna go take a shower’ without having to worry what to do with the baby.  Moms always have that ok I’m responsible for this little person in the forefront of their minds.  Moms get ready while the baby is rolling around in the walker with them in the bathroom.  \n\nI’m not saying anything negative about dads, but it’s just different.", "Right? \n\nI am unaware of these extra freedoms. I should bring this up to my wife and let her know, as a dad, I should have more freedoms then her.\n\nJokes aside, just seems some ones bitter their partner doesn't help out when they see others that do.", "**This is only *my guess* for what the person meant**: Probably the fact they don't carry the baby and give birth, so that would give them more freedom especially if you have a breastfed baby. \n\n*I did not make that statement so I'm not sure, therefore I am guessing!*", "Absolutely. Women feel physically worse and have more hormonal changes. That's about it. They don't get super powers. Some mothers can't even bond with their babies at all after birth! Both parents still start from scratch in needing to put in the effort to build the connection to their child and figure things out.", "It is weird but I find it is easier to put two young children to bed than 1 a lot of the time. It doesn't make sense, but it works that way.", "No like I said in my reply before— it’s just the little things.  Riding in the car without having to worry about how loud your music is, having time to yourself during the workday, being able to schedule appointments without having to make sure the other parent is home/having to get a sitter— the mental work of what everyone in the house is going to eat for the week.  I’m not trying to make this a huge discussion, just pointing out that there are a lot of little things that add up that people don’t realize.", "Well that's dumb lol.", "That time is after they gotten over the sleep regression of their 2.5 y/o. Not just whenever.", "And he has had ample opportunity to practice as well.", "All of that can be summed up with \"if you live gender-normative lives from the 50s, dads have it easier\", while ignoring that that's not actually the normal case anymore.\n\nMy wife and I work the same amounts. We also separate duties of our kids pretty fairly. Neither of us gets to not think about the kids while the other is a slave to them, because **we're both their parents**.\n\n&#x200B;\n\nI'm sorry that in your life, or experience, the woman has been saddled with the kids while the dad works, does their free time stuff, and doesn't involve themselves in appointments or activities that the kids are part of...but to make it seem like that's either acceptable or normal is ridiculous.", "I think alot of the comments a reading too deep into it, honestly I wouldn't know but parenting is bard I don't know the shorter version of it but I dont think anyone is the asshole here, what I've taken from it is that he's just expressed his discomfort with it while still encouraging her to go, which he has every right to communicate that. I may be wrong but that's what I've taken from it, NTA", "If your partner has decided “it’s going to be a terrible evening” then I guess it will be, for them. But that is not your fault. You checked in with them multiple times and honestly, learning how to be alone with the kids is a part of the parenting experience. You are NTA. Have a fun concert!", "Nta. But why not offer him a night off next weekend as well? Could be a nice thing for him to look forward to and build your relationship and shows you're also willing to brave it alone, as well as thanking him for the night off", "Seriously? He kept saying it was fine and now he's guilting you because he can't suck it up for ONE NIGHT to give you a break? WOW!   \n\n\nYou are NTA and you should go on with the Plans you have made and ask him to please not ruin it when you get back by whining about it. He's a big boy, he can do this. Last, I think you should consider leaving your cell phone at home or turned off while you are out.", "NTA\n\nI have a partner who watches three children 6,4,1 with little to no complaint so I can have my time and I do the same for him. \n\nYou asked multiple times and it's not a ridiculous request for him to watch his children so the mother could have a break", "Everyone climbs into mom and dad’s bed for bedtime. Infant dry and fed. Toddler falls asleep, infant maybe falls asleep, dad doesn’t fall asleep to keep everyone safe. Transfer baby or hang out with baby until mom is home. \n\nIt’s ok to press the easy button in unusual circumstances.\n\nNTA for coordinating care so you can go out and actually going out", "NTA\n\nHe's trying to guilt trip you into staying because he doesn't want to deal with it.  Plain and simple. \n\nGo, have fun.", "NAH, I don't think there's anything wrong with you wanting a night out or your husband expressing his apprehension about his ability to do what needs to be done. He's been vulnerable with you admitting he is not looking forward to it. He is not wanting you to cancel the night out but maybe wants a heartfelt thank you and an acknowledgement that he is doing his bit, just like should get when doing yours.", "NTA. You gave him every opportunity to voice his concerns. He declined to and then complained AFTER you’d bought the ticket. He’s martyred himself for absolutely no reason at all. \n\nMaternity leave can be a really isolating time for some women - you deserve to have some fun!\n\nHis attitude to the original question and his subsequent expectation of the evening kind of stinks.", "NTA: Parents dont babysit. They take care of their children; its division of labor. Nothing better than jumping into the deep end to get confidence you can do it.", "He is a parent… he needs to step up. It’s a concert. Not a month long stint. Enjoy yourself and don’t let the door hit you on the way out!", "NTA. Your husband is being passive-aggressive and pathetic. I used to babysit a family of 5 kids (ages 6 months to 8 years) and bedtime was hard, not fun, but I was delighted the parents got to go out and have fun. I cannot imagine not feeling that way about my own wife. Gross. (Oh and I was 17/18, so he can definitely handle this as an adult.) On another note, does anyone else find it a massive ick/turn off when a man says putting two kids to bed is scary and unachievable? Get it together. Jesus.", "He's a father, wtf.\n\nNTA.", "So he’s annoyed you want him to parent his own children so you can have one day off? NTA. If anything this will be a good thing and make him appreciate your role more", "Hubby needs a reality check.  If this is the hardest thing he ever has to deal with as a father, he's a blessed man.  TBH he sounds a bit over dramatic.  Staying with your own children is not babysitting.  It's normal parenting.  Over the years that your children will be living with you, there will be many times when you stay with the kids, times when he stays with the kids, and then times when you get a babysitter.  For now, it's not 50/50.  Sometimes it's 90/10.  Sometimes it's 40/60.  Given that you have a 2.5yo, I would have thought that he would have figured this out by now, but some people are slow learners.\n\nNTA", "Yup, you’re up, Dad! You can do this.", "I am a father and I cant imagine the balls on this guy for trying to make his partner feel guilty on the heels of 4 days where she had no help. This is how murder happens. I want to mock him on her behalf. \"oh no booohooooo are you going to make it? should I call your mom and tell her to come over and help her little baby be a proper father...\" I am now irrationally angry.", "Lol right? My husband works afternoon shift until 10pm and we’re about to have our second. I will be doing solo bedtime with a 2.5 year old and a newborn 5 nights a week. I haven’t zero sympathy for this guy who’s scared to do it alone for 1 night. Especially since he couldn’t even put his big boy pants on to express his unease when asked multiple times. \n\nNTA", "She said she was sick the last few days. I wonder if that made the husband more anxious about being alone with kids, who will likely get what mom had in the next few days. I wonder what the wife will do if the kids get sick the day of  or a few days before the concert", "This could be true, but it could also be \"I don't want you to go but I don't want to be the bad guy and say that so I'm saying this so that you'll just decide not to go on your own and I get what I want but it's not my fault because I didn't *ask* you not to go\" which my ex (a  woman) loved to do. \n\nEither way, if he thinks he can't do it or doesn't want her to go, he needs to communicate properly (and not say it's totally fine the three times she asked and then walk it back).", "I read it as neither has done bedtime solo since they had the second kid-- i.e. neither of them has had to do bedtime alone with two kids yet. It would be pretty wild if they've never had to do bedtime solo with the 2.5 y/o.", "It gets better! \n\nOn a practical note, when mine were similar ages I used to try to time it so baby would fall asleep in a stretchy wrap (cheap on Amazon, you can find videos on how to put it on online) while the toddler was in bath/having dinner. Then I had both hands free to help them bath/teeth/pj's/into bed etc.\n\nHope it goes well and you get a good night out.", "I agree nothing major. I'm sincerely trying to understand. What does he want? Because if doesn't know what he wants, how can she help? \n\nI see two people stuck in a problem, but only one has a way to solve it. The other is still trying to figure it out. (Which isn't meant to be a criticism, just an outside perspective)", "Sorry - posted before the edit.", "I mean, I had a 3yo when my younger one was a baby baby and my partner would have gone nuts if he was never allowed to go out.\n\nHe's an extrovert that needs social interaction, so the past few years have been tough. They're his kids too, sure absolutely, but that doesn't mean we both have to be home every night.\n\nMy youngest was a cuddle bug, he wouldn't sleep without cuddles (fixed now, thank the gods) and would cry when he was put down. I still managed dinner, bath and bed time solo regularly. My introverted butt would rather have a close friend visit me at home then go out, not that I don't get to when I feel like it.\n\nSure, the first time solo and outnumbered can be scary, but whining about it and trying to guilt your partner out of doing something she clearly wanted to do, that she ran past you numerous times... Thank makes dad the AH imo.\n\nLearn how to be an outnumbered partner and let your wife have her break.", "Im in the same place basically. I have two kids broadly in the same age-range. My wife says, \"Im going out for a couple of hours at night\" and I...put the kids to bed? And a lot of people have noted that they havent done solo bed time yet, but...he can figure it out? It can be stressful, but that's the job. I would never make my wife feel shitty about going out because of my own issues.", "\"This is how murder happens.\"\n\nBwahahaha!!!!!!  I'm totally using that.  Thank you. I needed that. :)", "Not always", "If he wants to bring up “I’ve canceled stuff for childcare too“ then he should not be bringing that up the day of in the middle of an argument, he should’ve made a note of that in the past. It doesn’t even have to be contentious, but he chose to make it an attack point. Hell, he could’ve used it as a good way to bring up how you each need to be able to have your own time outside the house for the sake of your mental health and other relationships!", "Yes, but Dad is upset because he has to do it by himself. Mom doesn’t have any special magic that would make doing it by herself better than how it will go for him. At some point they’re both going to be alone with the kids, and they just have to take the leap.", "No. Stop trying to justify stiffing mothers with the mental load with your stupid bs.", "One of them is going to be the first to do it, eventually. Is there a reason it can't be the father?", "Always the same type of suggestion in this sub - make more work for a woman because a man can't be bothered. \n\nMan doesn't want to do chores? Give him a chore chart and manage his ass. \n\nMan doesn't want to be lone caregiver for a night? Call his own mother (note, not his *father*?) to help out.", "I wish I had an award for you!! 🏅", "NTA- he said he was ok with you doing this . Boo hoo he has to put 2 children to bed- he’s their father he can just get in with it- millions of people manage.", "NTA you should be able to leave your kids with their other parent at any time for any reason! What is his plan if something were to happen to you?! I have two similarly-aged children (18mo and 2mo) and even though it's hard to take care of them alone every day, I do it! I don't have any special kind of insight more than my husband and so when I need a break, he takes them without question or complaint. He swears he wouldn't have signed up for this if he didn't want to, even when its difficult. As long as they are both safe/dry/fed hell, leave them for 5 minutes to go in another room or step outside for a smoke if you get too overwhelmed.", "NTA", "NTA\n\nAre you kidding me? He needs to learn how to do this. God forbid, you are suddenly taken away from this world and he has never done every part of childcare by himself at least once. Why do whiny parents, mostly fathers but mothers too, think they must always have someone to hold their hand through taking care of their children. Hubby and I had 4 children during a time that allowed 6 weeks maternity leave and no paternity leave. He would go back to working his PM shift one week after the kids were born and I would be the one to put all the kids down at night.  At least I knew that if anything had happened, it may have been difficult emotionally and financially, but I would at least have the skills to care for the kids on my own.", "My children still suck at going to bed and never has my husband discouraged me from attending events on my own. \n\nNTA but your husband is.", "NTA you asked twice and he said it was fine TWICE.", "NTA. Even if it is 'one terrible evening', so what? He'll survive. I'm sure you've had some terrible days with the kids. Just because it'll be hard for him doesn't mean you should cancel your plans when he never communicated this to you. He's capable, it'll be fine.", "NTA.  Your partner needs to say what he means and means what he says.  This was some weird test to see if you developed telepathy or something.", "He’s passive aggressive as hell. NTA", "NTA and here's some advice for sleep regression for ages 2 and older:\n\nMy kids are 14, 6, 4, 2 and 8 months.  For sleep regression, try melatonin. Our pediatrician recommended it and it worked great.  I'd say try it before your night out so you know it works for your 2.5 year old. 1mg was the dose we gave and after maybe 10 minutes of quiet time/ laying down,  he was out.  Good luck!", "I think pushing something the size of a water mellon through something the size of a small lemon (not assuming here, just picking random fruits) gets you a \"get out of jail\" free card for a night or two. As a side question, what would happen if you would need to go away for work, would the family implode? He'll survive, and so will the children, I'm sure.", "I came here to comment exactly this. No need now. 😂", "And she even offered to sell the ticket and stay home! She's given him every \"out\" possible and he hasn't taken her up on one of them; he just wants to complain.", "Wait and make sure they’re starting asleep first. \n\nSource: put my son to bed last night. Four times.", "Men want kids until they're the ones taking care of them. Then it's, \"I can't do it,\" \"It's too hard,\" \"But you're so much better at it than I am,\" or \"But I had to work all day!!!\"\n\nI'm not having kids because it's hard. I don't want that hardship in my life. If you're considering becoming a parent, but you only want to be the fun parent/you think your partner will do most of the hard work, *don't become a parent.*", "Want to complain about kids? Wear a fn condom. You made them you get no sympathy from me if it's too hard to put two kids down.\n\nYou might get some empathy if you're having a challenging time but the minute that gets whiny it's over.", "My next door neighbor's wife is a doctor and they cover a hospital in an adjoining state, so she travels there at least once per month for 2+ days, sometimes twice in a month.\n\nHusband takes care of the kids while she's gone, including the now 2.5 year old, who is a terror (but SUPER SUPER CUTE).", "NAH although your husband should try to communicate better. However I can understand being totally fine with something in the abstract/future and then when the date gets closer and you think about things that could go wrong, being more and more nervous. And those ages are really tough! But you also deserve time for yourself (as does he!)\n\nCan you hire someone to help? Even just for an hour to hold the baby while he puts the toddler down? Maybe you can also hire someone to help you for the evening sometime soon so he can get some time out?", "Except he didn't say anything at all.  These are all things he could have brought up many times - especially when discussing a potential event.  He's going to have a very unhappy life if he continues to do this.", "Why? Why does one of them \"have to do it first\"? They have a newborn and a toddler with sleep regression. Neither of those are permanent conditions, so why does one of them \"have to do it first\"? They can both be home for bedtime until one or both of their kids becomes a better sleeper.", "I said NTA. I believe NTA. But the comment I was responding to is making husband out to be a deadbeat loading all parenting to OP while he does nothing. This is NOT what is happening here.", "I agree, but he's not protesting because he just doesn't want to take care of his kids. I agree he needs to gut it up.", "We have a 5 month old and 2 teenagers I feel you so deeply on the tired.", "Exactly. My husband and I share the parenting roles as evenly as we can but the fact is, when I’m pregnant or breastfeeding, I can’t just down a big cup of coffee without thinking about it in the same way he can. Right now I’d kill for a big hit of caffeine!", "Yeah I totally get what you mean", "I was thinking this as well! First time for everything and all that. NTA", "Leave it to reddit negative iq smooth brains to try and shit on a perfectly fine partner for no reason lmao. This is why you're alone.", "My mom made this mistake and because she was in school, I ended up putting my brother to bed all the time. It sucks. Don’t fall for it!", "Reddit full of men hating misandrists lmao. A dude has one flaw and they'll crucify him.", "My husband would watch the movie Gettysburg when on night shift when they were super little. He has fond memories of burping the baby while watching Gettysburg. When they were older it was hours of Kipper.", "100%", "Yeah my ex worked swing shift the entire time our three kids were small. Bedtime Solomons always my gig. I have no sympathy for someone who has to do it alone ONCE. Especially when he had tons of chances to say no.", "I'd probably leave it home if it were me.\n\nWith the ringer on for once.🤷‍♀️", "The evidence is that he said it was ok multiple times while asked over a period of weeks and is now being passive aggressive and manipulative about it", "But then he should say \"honey, I'm sorry. I really thought I could do it, but now I'm really anxious about it and I'm not sure I can.\" and they could work out what to do together. He told her not to sell the tickets and to go but then says \"It's going to be a terrible night\"-- that's guilt tripping and it's manipulative, whether he intends it to be or not. He's doing the whole \"no, no, I'm not saying don't go, I'm not asking you not to go...I'm just going to be miserable...and it's going to be really hard...but you should go\" thing trying to get her to give in without actually having to communicate and ask her for what he wants. It's understandable that he's anxious and maybe only now realized how much, but the way he's approaching it still makes him TA.", "Dare to send him an article or video about parenting sometime. The response I got was \"that's too long\". 🙄 When it dealt with the EXACT problem he was having trouble with at the time.", "Not JUST pReCoGnItIoN. Don't forget the Super Special Womanly Cleaning Expertise. /s", "If he had said he was uncomfortable when she asked before buying the ticket, that would be totally fair and understanding. It's the timing and the passive-agressiveness that makes him in the wrong here. Also, OP must have done double nap time alone while she was sick and home alone with both kids.\n\nI don't think the husband is a bad guy, I think honestly he's just panicking a little.", "This comment copied from the original here:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/10l1s3l/aita_for_going_to_a_concert_leaving_my_partner_to/j5u270e/\n\nPlease help report this bot.", "“No. Fix it *for* me.”  **stamps foot.", "And the inability to have weaponized incompetence.", "Why?  For practice.  Anything could come up that would force one or the other of the parents to take care of the kids alone.", "I agree.", "Yup I wouldn't be surprised if he bombards her with a thousand texts and phone calls the night of the concert with dumb questions and complaints. \n\nOr if he magically gets sick the day of.", "They are terrible. Something that helped ours was I recorded myself singing their favorite songs and then I'd put that on when I left to ease them into it. We also used sleep stories for kids and those helped too. You'll make it!", "I had 13 months between my older two; then 10 years later number 3 was born & I had 18 months between him and youngest. My strategy was to sing and read them to sleep. I could hold the baby and read either with a penlight or Kindle. As teenagers, the older two would sometimes forgo activities out with friends to hang out for storytime with the littles when I was reading one of their favorites. I read Harold and the Purple Crayon, Junie B Jones, the Little House series, and traditional fairy tales & legends, but I also read \"older people\" stories like the Narnia books and The Lord of the Rings Cycle. A lot of happy memories there.", "Go the fck to sleep is an awesome little story lol\n\n\n\nOP NTA you repeatedly asked, he repeatedly said dw. So... dw! He'll get over it. Have some fun, you've well and truly earned it. Heck you could even call it your push present! (Only just learned that's a thing a few days ago lol)", "I think the best solution would be to find a sitter for 2 hours to watch the 2 mo old while dad does nighttime routine with 2.5 yr old.  Do you have a trusted family member or friend willing to back him up so you can enjoy adult time?", "He is 100% allowed to be anxious about it. Being a parent is really hard. But I want to throttle him for trying to make her feel guilty about having very reasonable me time request. Bet he wouldn’t think twice about doing this in reverse. Incompetent.", "Hum... my family is kinda busy and I dont think they would be up for babysitting random people kids from the internet \n\n/j", "Got you covered 😊"]}