{"id": 8257, "submission_id": "10l1pe1", "title": "AITA for snapping at someone who was trying to “help” my boyfriend?", "selftext": "Me (20M) and my bf (19ftm) are from the same town but both go to different universities. I was at home because my class haven't started for after Christmas break yet. My bf’s classes have started but he had come back for the weekend because it was his friend’s birthday.\n\nAfter the birthday at party he went back to his parent’s house because his train wasn’t for a few more hours. He has a strained relationship with his family so I had been checking up on him over text most of the evening.\n\nWell when he was at the train station I got a text from him that he needed me, and also what platform he was on. I got there as quick as I could and when I found him he was freaking out, it was a mix of a panic attack and a meltdown (he’s autistic) and this woman was trying to “help”. \n\nShe kept getting closer to him even tho he was trying to move away from her and she just kept trying to grab him and his stuff which just made things worse. She was also trying to stop me from getting to him, saying that I would scare him more.\n\nI was able to get past her and calmed him down, she tried to get close again and I turned to her and snapped, telling her something along the lines of you’re not helping, just go away. I don’t remember exactly, I was too focused on my bf.\n\nOnce he was calm I got him on his train and told him to text or call me if anything else happened. I went to leave the station and the lady was there talking to a worker, she then came up to me and said I was an asshole and she was just trying to help. I have a half assed apology and told her that anyone could see she was stressing him out more and she needed to let go of her saviour complex and let someone who actually knew what to do help. \n\nShe there some insults towards me and I just left, now that I’ve calmed down I do worry that I was TA. So AITA?", "created_utc": 1674661656, "permalink": "/r/AmItheAsshole/comments/10l1pe1/aita_for_snapping_at_someone_who_was_trying_to/", "score": 617, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i think i may be TA bc in the end she was just trying to help and in my worry i was rude\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, you were trying to protect your partner and you didn't necessarily say anything wrong or offensive. You just told her how it is. She may have had good intention but she wasn't being helpful.", "> She kept getting closer to him even tho he was trying to move away from her and she just kept trying to grab him and his stuff \n\nOkay but why would anyone think that this would be helpful? I mean, yeah, you could have been more polite but it sounds like she was being really annoying and it's not like you hurt her. NTA", "NTA: She could of been helping or not helping so you did the right thing pushing past her as you know you can calm him down.\n\nThen again she doesn't seem like a nice person if she was so bothered by you helping your boyfriend she actually went to security when there was 0 problem to whinge.", "NTA. Not sure how she thought trying to grab someone who was panicking would help anything.", "NTA. She was prioritizing her own desire to be helpful over his wellbeing and ignoring the signs that her behavior was making it worse, she needed to be told to back off. I would have been more likely to give her the benefit of the doubt if she hadn't been trying to touch him without his consent and trying to stop you from getting to him. Good intentions or not, her behavior sucked and she is the AH for getting upset at you for calling that out.", "NTA. She made a mistake, which can happen, and since you were in a stressful situation you went overboard, which is understandable. She should have apologized the moment she saw you knew what you were doing, or at the very least inquired about your bf. Don't feel bad, sometimes people snap, that doesn't magically turn them into bad people.", "NTA. You knew what you were doing and you could tell she was making the situation worse even though her intentions were pure. It was just in the heat of the moment, I don’t see why the lady took it so personally. You could have also explained to her about his condition (after everything was alright) and that you are his boyfriend \n\nEdit: misgendered by accident", "NTA\n\nYou know him and his behavior. She doesn't\n\nShe needed to back off", "I would've put N A H but since she threw insults, NTA. \n\nYou see the situation differently because you know your partner and his reactions to a panic attack. So while it was obvious to you that he was trying to get away from him and what the situation was, she may have thought he was having a dangerous manic episode and was trying to keep him away from the edge of the platform. \n\nWe should *want* people to be supportive and helpful to people when they are experiencing a mental health crisis. Did she go about it in the best way possible? No. And while its not your responsibility, this could have been a learning moment. \n\nAt the end of the day, you did right by your boyfriend and that is the most crucial thing.", "NTA, meaning well doesn't excuse her behavior, she needed a reality check.", "NTA\n\nShe might have think that she was doing good, but if it wasn't for you your boyfriend could get worse. She had no right to insist after you got there, you had every right to be pissed at her behavior.", "ESH, Everybody Sucks Here.\n\nShe wasn't trying to \"help\" as you put it, she was actually trying to help. Which is a pretty normal thing to do when witnessing someone having a serious meltdown. The fact that your boyfriend was near the train tracks probably escalated her thinking she should step in, people commit suicide you know.\n\nDid you even make it clear that you knew your boyfriend?", "NAH\n\nShe was trying to help him out, though clearly not knowing what she was doing, and didn't know you knew your boyfriend at first (gender and gender presentation may have been a factor in her suspicions of you as well)\n\nThat said, your frustration and snapping is perfectly understandable given the circumstances.", "ESH She was trying to help. She wouldn't have known the extent of your bf's situation. She saw a fellow human being having a panic attack and wanted to help.\n\nYour response wasn't nice, but it came from your own frustration and worry at that point. \n\nIf everything had been left there, then neither of you would have been AHs. Her coming up to you after wasn't a great idea. You telling her she had a saviour complex wasn't a good idea. Exchanging insults was a dick move on both sides.", "NAH.\n\nYou were both trying to help.  It's OK that you were short with her in order to be helpful to him. \n\nI don't know if you made it clear to her that you were this person's friend, but if you did then she should have backed off.", "soft YTA - you could have been more patient with the lady, who was just trying to help and probably didn't understand the situation completely. But it's entirely forgivable and understandable that you reacted to her the way you did given how stressed you were.", "Going against all this. YTA. A woman sees a person having what you describe as a meltdown. She does what most compassionate ppl would do, goes over and tries to calm him down (not knowing he’s autistic and may not like to be touched). Sure we should all have physical boundaries, but this panic attack sounds pretty bad and may have been scary to this woman herself. Here comes this stranger blowing in and telling you to back off they got it. Who are you? Let’s change it up. A young woman is having a panic attack and a meltdown and a woman tries to help. Exactly the same way. Here comes a man rushing in and says back off I got this. Who is he? Is this person actually gonna be safe with this stranger? I would hate to leave and something happens. She wasn’t necessarily trying to butt in and takeover, etc. Had it taken you longer to get there, you should be glad someone stopped to at least try to help him so he wasn’t all alone on the platform. Way too big of a reaction to this woman whether she was likable or not she was there when you weren’t. All you had to say was thanks, we’re together, really appreciate you waiting with him for me to get here, thanks for helping him. You rightfully came with high energy afraid for your bf, but took that our on a stranger who was just trying to help.", "Yes. Yta. You had every right to be. 🫶", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe (20M) and my bf (19ftm) are from the same town but both go to different universities. I was at home because my class haven't started for after Christmas break yet. My bf’s classes have started but he had come back for the weekend because it was his friend’s birthday.\n\nAfter the birthday at party he went back to his parent’s house because his train wasn’t for a few more hours. He has a strained relationship with his family so I had been checking up on him over text most of the evening.\n\nWell when he was at the train station I got a text from him that he needed me, and also what platform he was on. I got there as quick as I could and when I found him he was freaking out, it was a mix of a panic attack and a meltdown (he’s autistic) and this woman was trying to “help”. \n\nShe kept getting closer to him even tho he was trying to move away from her and she just kept trying to grab him and his stuff which just made things worse. She was also trying to stop me from getting to him, saying that I would scare him more.\n\nI was able to get past her and calmed him down, she tried to get close again and I turned to her and snapped, telling her something along the lines of you’re not helping, just go away. I don’t remember exactly, I was too focused on my bf.\n\nOnce he was calm I got him on his train and told him to text or call me if anything else happened. I went to leave the station and the lady was there talking to a worker, she then came up to me and said I was an asshole and she was just trying to help. I have a half assed apology and told her that anyone could see she was stressing him out more and she needed to let go of her saviour complex and let someone who actually knew what to do help. \n\nShe there some insults towards me and I just left, now that I’ve calmed down I do worry that I was TA. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Because at some point one should recognize they are making someone uncomfortable, and if he was backing away from her, that is a dead giveaway.  Further, she still made an issue of it after you called him down, even calling security.  That's not how you \"help\" someone and she should have backed off when she noticed that your BF was responding well to you.  Also, I would have to imagine that her sticking around for a minute or so she would have observed that you two knew each other, making her behavior worse.", "NTA\n\nYou didn't owe her any more than the half assed apology that you gave her.   She may have been trying to help, but she wasn't listening or paying actual attention to the person who she was trying to \"help\".", "Poor lady, can't be a hero to the disabled person she saw.  NTA", ">She may have had good intention but she wasn't being helpful.\n\nSince she was being awfully insistent and entitled and turned extremely hostile, it makes me wonder if bf was targeted and she had a Church van around the corner. OP doesn't state if bf's family is Christian, just that things are tense. This kind of reminds me of a 'deprogrammer' kidnapping.", "Yeah, someone trying to grab a panicking person is just going to panic them even more.\n\n\nWhen I move into panic attack, touch is a really effective way to calm me IF that person is emotionally a 'safe place' already (mom, partner, etc). Some stranger trying to touch me would be lucky if I don't scream in their face or drop to the floor into a curled up ball", "\\*boyfriend", ">even though her intentions were pure. \n\nUnless she was trying to pull him into a Church van to take him for deprogramming.... We don't know if bf's family is Christian.\n\nNTA OP, I hope I'm just Reddit spitballing but keep an open mind.", "\\*partner", "Boyfriend*", "Especially on a train station platform of all places. I don't know exactly what the OP's bf's meltdown entailed, but there's a real possibility that the woman on the scene might have been concerned about a possible suicide attempt. I've been in that situation myself years ago. I positioned myself between the person and the tracks whilst someone else went for help. Every time they moved, I moved in response to make sure I was always blocking them, and if they would've tried to get past me towards the tracks I absolutely would've grabbed them.", "That's quite a leap from \"strained relationship\"", "Oops, so sorry about that I’ll edit", "I said friend because it doesn't matter if she was girlfriend, friend, or partner.  The point is they were known to the person instead of a stranger.", "Maybe, I hope it was a wild reddit leap, but it's not like similar disgusting nonsense hasn't happened before.", "its ok, i skip past or misread gender and ages on posts all the time lol", "NTA, but I feel like I’m missing some context here. In what possible world is someone trying to bodily handle both a person and their belongings considered helpful?", "NTA", "INFO:\n\nIs this real?  Your boyfriend was being chased around by some woman for, what, fifteen minutes?  Twenty?  Half an hour?  However long it would have taken you to get your winter kit on, make your way to the train station, find your way to the platform, then find him.\n\nThis whole time, he's in enough distress that he couldn't verbalize, but not enough that he had a problem texting?  But also not enough distress that anybody else, including staff, attempted to intervene?  Beside some train tracks, where the person in distress could easily fall, or jump, to a tragic end?\n\nAnd your response was to pack him on to a train and wish him luck?\n\nAnd despite being so flustered that you can't articulate anything beyond 'just go away,' you're also articulate enough to publicly dress her down for a 'savior complex?'\n\nWhich means you think anybody offering assistance to a person in obvious distress has a savior complex?", "NTA. People trying to 'help' are some of the most dangerous people out there.", "Wth did you get all that from?", "Absolutely insane conclusion to draw", "Nah, it's just savior complex.  It happens to my kid far too much.  She's tiny, and most people assume she's 12 or 13 (she is an adult) and they want to \"help\" her or some shit and get rather offended when they find out she is A) an adult,  B) quite capable and C) not afraid to tell someone to mind their own business.  \n\n\nPeople like train station lady have this overwhelming desire to be a hero in any situation, real or imagined.", "> it makes me wonder\n\nMy redditor mind, too many crime dramas, and the gf listening to too many true/unsolved crime streams.", "It's an insane world and the bf is ftm and there are some very rabid people out there. I'm **not** saying that it **is** what was happening. Its just a scary paranoid thought that *depending* on details not in the post, area they were in, political and religious leanings of the family and town and whatnot, things that **only** the OP and bf are able to consider, then it *may* be something that they want to consider as a possibility.", "No this is fear mongering plain and simple", "Could be, could somehow by chance be totally correct. From just reading through rn i was pretty creeped out by how this person was trying to “help” OPs bf, like if you see someone who might need help surely you first ask them “hey do you need help? Can I help you?” But if the person keeps trying to move away from you, you don’t fucking keep moving towards them/grab their stuff and then the bit about stopping from OP approaching him too, idk we’re only getting this one side of the story and maybe not all of the details but from what OP says I’d be very weirded out by the situation too", "And she was \"trying to help\" long enough for OP to actually get to the train station FROM HOME! So yeah, if this is real then bf started texting for help and who knows how long it took OP to get there (I'm guessing at the **very** minimum 10-15 minutes) and when he does arrive, this woman is trying to grab his bf AND his luggage. The post doesn't say if the woman had just responded to the meltdown or if she *caused* the meltdown. Why ***wouldn't*** my mind go to possible abduction?", "NTA. I have no doubt she wanted to help your boyfriend at first but she was hurting him in reality. You were right to call her out, she needs to learn that her intention doesn't prevail over the reality of her actions.", "NTA, you tried to apologize and she swore at you. All that needs saying", "NTA - In a crisis and someone was making it worse, sometimes you don't have time to  say pretty-pretty-please in your most sweetest voice.   This lady should just get over it, could she work any harder to make this guys life about her.", "NTA", "YTA. Not the first time when you were trying to get her to leave him alone, but when you unnecessarily insulted her afterward, to confirm that yes indeed you are an AH.", "NTA. I feel like it should be common knowledge that 1. YOU DONT GRAB RANDOM PEOPLE. And 2. YOU *DEFINITELY* DONT GRAB SOMEONE HAVING A PANIC ATTACK. By insisting and continuing to try and grab him, she went from concerned stranger to harasser VERY quickly. \n\nYou were just trying to protect him from this crazy lady.", "NTA. People with a hero complex don't care about the person they are trying to \"help\". \nIt's all about them being seen as a hero. You absolutely did the right thing by protecting your partner. He is so lucky to have you!", "NTA.\n\n>She was also trying to stop me from getting to him, saying that I would scare him more.\n\nThat's kind of stupid from her. You did good.\n\nPs: if you see an autistic person struggling DON'T tuch them (unless they ask otherwise), stand too close or get between them and the only way out. Also don't shout.", "You'd be surprised. I have trauma related issues and have had people try to force themselves on me to \"help\". Jokes on them, my responses make me punchy so I just end up yelling in their face or screaming for help.", "If someone moves away from you and clearly doesn't want you to touch them, *and you pursue them and keep trying to touch them*, I'm absolutely *not* assuming good intentions. \n\nIf a stranger doesn't want you to touch them, then don't fucking touch them. It is not hard, and it sounds like this woman wasn't even able to summon up that basic decency.", "[deleted]", "What are you trying to say?", "Yeah, or, bf is a hottie and that woman \"just \" wanted to help him to get a pass or worse", "I once had a panic attack in a hospital, my husband had coded and even though he was brought back quickly I watched it happen. I stood in the hallway, off to the side and it wasn't very busy after they were all in there. (They had all ran in and I was just kinda standing there in the hallway after I wasn't in anybodies way.) Anyways I was having a panic attack and no less than three nurses saw me from their station on the far corner, came over and tried to hug me to \"calm me down.\" You know after I told the first one \"no thank you\" you think a nurse wouldn't touch me even if she did need to move me.", "*He\nAlso *boyfriend", "Could someone tell my what ftm means ?", "While I think it was the wrong thing to do, it sounds to me like she was worried he was going to jump onto the tracks.", "Sounds to me like she was worried he was going to jump onto the train tracks.", "i think you got some details about my post mixed up.\n\n>Is this real? Your boyfriend was being chased around by some woman for, what, fifteen minutes? Twenty? Half an hour? However long it would have taken you to get your winter kit on, make your way to the train station, find your way to the platform, then find him.\r  \n\r\n\n1st my bf didn't text me bc of the lady, he texted me because he could feel himself starting to panic and get overwhelmed. the lady arrived sometime between the text and me getting there. it took me about 20 mins, give or take, to get there.\n\n>This whole time, he's in enough distress that he couldn't verbalize, but not enough that he had a problem texting? But also not enough distress that anybody else, including staff, attempted to intervene? Beside some train tracks, where the person in distress could easily fall, or jump, to a tragic end?\r  \n\r\n\nagain he texted me before he went full panic and before the lady got there, it was pretty late and he was on the least busiest platform, there was almost no one there because he had just missed his train (part of the reason he got overwhelmed). its a small station and most of the employees were focused on the busier platforms that went to larger towns and cities. my bf is selectively mute which mostly happens when he's in distress, so yeah, he couldn't verbally communicate.\n\n>\r\r  \nAnd your response was to pack him on to a train and wish him luck?\r  \n\r\n\nyes, after i calmed him down and made sure he was ok, since the line he takes isnt one that's needed frequently there is only 1 train every hour, i had about 30-20 mins before the next one after everything.\n\n>And despite being so flustered that you can't articulate anything beyond 'just go away,' you're also articulate enough to publicly dress her down for a 'savior complex?'\r  \n\r\n\nwhen i first told her to go away i was trying to help my bf while she was getting away, the second interaction happened almost half an hour later when i was alot more calm.\n\n>Which means you think anybody offering assistance to a person in obvious distress has a savior complex?\n\nno i don't, but when you way of 'helping' is causing more distress but you continue to do it and stop others, who are more knowledgeable (i told her i knew my bf) from helping, then yeah, comes across very savour complexy.\n\ndoes that answer your questions?", "female to male aka a trans guy/trans masc person", "then you could have used \"you know him\" instead.\n\nlike you said the nature of their relationship isnt important so why specify friend, especially when thats false.\n\nalso \\*boyfriend", "NTA.\nShe might be trying to help, but she wasn't. She was making it worse. If someone is panicking, crowding them and touching them can make it worse. Different, but I have severe panic attacks and if someone tries to touch me for whatever reason or won't leave me alone it makes it worse. Listen to the person who's having trouble. Ask if you can help, but don't push, see if you can call someone or tell a worker that someone needs assistance so that no one else bothers them.\nHonestly it goes a long way if you just read body language. He kept trying to get away from her and she didn't see that. That annoys me to no end.", "NTA, sometimes people have savior complexes or just want to help and have more confidence in their ability to read a situation or in their efforts to intervene than they actually deserve.", "NTA\n\nThe fact that she kept trying to grab his stuff, that concerns me. More than just the fact that she didn't get the hint to stop trying to touch him. Trying to grab his things would potentially keep him tethered there so he could get them back--as if she was actively trying to prevent him from getting away from her.\n\nIt's not that hard to say to someone, \"Do you need help?\" It's actually a much better choice than grabbing at an already agitated person. She had no idea how your boyfriend would react, she could have easily gotten whacked in the face or shoved.", "I'm gonna go against the grain and say YTA. \n\nYou don't specify where exactly this happened, but if it was in the vicinity of train tracks, having a manic episode or a panic attack or a meltdown next to train tracks is dangerous. Even if it wasn't next to tracks, he was clearly in distress and in need of help. She was exercising kindness to try to assist someone in a (maybe) dangerous position. While you say \"anyone can see you're stressing him out,\" I don't believe that is true, depending on what his episode actually looked like. Just because you, his partner, could see that her attempts to help were stressing him out, doesn't mean everyone can. For all she knew (and hell for all you knew) his stress was completely independent of her help the entire time. You've said in some comments that you don't know exactly what triggered this episode.\n\nBut why you're TA in my book is that nowhere in your account did you communicate that you're this person's partner and have a high chance to be able to help and even speak on his behalf. For all she knew you were a rando who also 'had a savior complex' and you'd make the situation worse too. Don't forget, she had been there experiencing his difficulty being communicated to by a stranger and you never said why your help is any different. A simple \"He's my boyfriend\" would have explained everything in three words.\n\nYou're not seeing this from her perspective at all and judged her poorly as a result. She was trying to help your bf, and you lashed out at her when she had no reason to hand the situation over to you. \n\nWhile understandable that people are jerks in times of crisis, you came here to reflect on whether or not you handled this well. \n\nYour bf is okay, and that's the #1 thing. But YTA", "I get this so much, like you and  very_busy_ newt, I have panic attacks and people always think crowding around and touching is the best way to help and I try very hard to tell people no. Maybe sometimes, but very specific people like my sister. If she sees me in the middle of a panic attacks, she remains calm, asks if I wanna be alone or have company. She sits next to me until I say if touching is allowed or not. Hugs or just a presence nearby from someone who I consider safe goes a long way, but sometimes being alone is better. \nWhoever is having a panic attacks will somehow give you clues to what they want by body language like he was above. When she kept getting closer he would get farther away.", "What's ftm?", "NTA\n\nShe’s butthurt. Not your problem. Glad you got to your bf and he felt safe. Way to go!", "NTA, from an autistic, thank you! my partner has come across rude before but puts me first", "YTA for yelling at her. She was trying to help. You can’t expect people to see a grow man in a full meltdown and not try to help even if they don’t know what to do. You could have thanked her and moved on.", "NTA.  I would have done the same thing.", "NTA", "Y'know that scene in Airplane!, where the entire passenger roster lines up to shake and slap the woman having a panic attack?\n\nkinda like that I guess"]}