{"id": 8283, "submission_id": "10le40t", "title": "AITA for telling my boyfriend to pull over so I could walk home?", "selftext": "This is about me, 28yo F and my 30yo M Boyfriend. Last night we were drinking with my coworkers, and right as we were leaving, we got into an argument in the car. Out of drunken anger, I told him to pull over and I got out and started walking home. We live in a small town (only 5 miles end to end) but our apartment was 1.5 miles away through hills. \n\nIt was 11pm and it took me 50 minutes to walk home and I was very angry and hurt that he actually pulled over, even though I asked him to.  Every car that passed by, I either hoped it was him looking for me, or I was worried it was a kidnapper. I got really on edge that I would get kidnapped since it was the middle of the night and I was just a girl by herself. \n\nHe did try calling me 10 minutes into my walk (which I later found out is when he got home), but I was too angry to pick up. I couldn’t believe my eyes when I got home and his car was just parked there. I had to call him to let me in since I forgot my keys and when he opened the door he didn’t say a word. \n\nI was fuming that he wasn’t even trying to look for me or asked if I was okay. I found out that he just went home and slept and when I confronted him about abandoning me in the middle of the night to walk home, he just said “well you told me to”. AITA?", "created_utc": 1674691760, "permalink": "/r/AmItheAsshole/comments/10le40t/aita_for_telling_my_boyfriend_to_pull_over_so_i/", "score": 88, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked my boyfriend to pull over and let me walk home, but I didn’t think he would actually let me walk an hour home in the middle of the night and not look for me. I might be the asshole since I actually told him to do it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "“I was just a girl by herself” are you actually kidding me?? You are a full grown ass 28 year old woman who TOLD the person driving you to let you out of the car. You expected to communicate the wrong information and have him find the correct answer. That’s absolutely insane. If you cannot communicate your desires to your partner, you aren’t mature enough to be in a relationship. You desperately want to be the victim here, but all your boyfriend did was EXACTLY what you asked him to do. I’m sure if he refused to let you out of the car, you would be accusing him of abuse and trapping you in his car against your will. You are too old to be throwing drunk temper tantrums. I am 27 and cannot imagine acting this childish. Grow up. YTA.\n\nETA: Was the hope that he would be panicking looking for you? If you ever find yourself WANTING to cause the person you supposedly love to panic, you should save them the stress and trauma of being with you and just break up. You sound toxic.", "YTA\n\nIs this real? You were drunk-furious and demanded to be let out. He let you out and you walked home building an aggrievement over your apparent assumption that he wasn't looking for you out of worry?\n\nYou shit on someone, you got nothing to complain about when they shit on you. And he didn't shit on you. He respected your expressed wishes.\n\nMaybe don't get so wasted you say things you don't actually mean. Christ. \n\n&#x200B;\n\n&#x200B;\n\nDemanding to be let out as a trap . . . .", "YTA.  This is the literal definition of \"fuck around and find out.\"\n\nYou found out.\n\nGrow up.", "\"I was very angry and hurt that he actually pulled over, even though I asked him to.\" Yes YTA for that part alone. don;t be that person.", "YTA \n\nThis isn’t healthy behavior and you are being abusive to your boyfriend. You told him to pull over. You voluntarily got out of the car. You ignored his phone call checking on you. Then you were mad because he did everything you asked him to do. What would have happened if he ignored your request to let you out of the car? \n\nStop drinking and get some therapy for your anger and probably other issues.", "YTA.\n\nYou told him to let you out. If he hadn't done so at that point, he would have Bern forcibly confining you against your stated will.  He tried to call you but you didn't answer and so he reasonably assumed you didn't want contact with him at that time.\n\nTry not demanding things you don't want.", "Yes, YTA. You let your mouth write a check that, it turns out, you did not want to cash. Don't do this next time.", "YTA\nDrunk-mad-asked to get let out of the car.  You can’t switch the blame to someone else because you made a mistake. Own it and move on.", "YTA. You told him to let you out so you could walk home. So he let you out. And he tried to call you but you were too drunk and angry to pick up.\n\nWhat the heck was he supposed to do?\n\nNext time, don't pick drunken fights with your boyfriend. At 28 you should be past that stage. So much YTA. Grow up, please.", "INFO: You asked him to pull over to walk home....then you were hurt he did what you asked. What? He could not win either way.", "YTA. You're 28, which is way too old to be getting drunk and belligerent and definitely way too old to be playing games like this. You had so many choices other than your little \"I'm just a poor damsel out on my own\": pick up for your boyfriend, get an Uber to pick you up, have a friend come get you, etc.", "YTA. You're mad because he did exactly what you asked him to. Then, when he called (probably to check on you or offer to come get you after all that,we'll never know....)you didn't answer. You experienced the consequences of your own actions. Take this as a lesson to think before you speak.", "YTA play stupid games win stupid prizes.  You told him to pull over then proceeded to ignore his call.\n\nSorry that’s on you.  Yes he shouldn’t have actually done it but you told him to.\n\nEdit-Yes I know she’s the one who told him to pull over.  Literally said she’s the AH for that.  Only reason I said he shouldn’t have is because it was dark and dangerous and if something did happen he’d be stuck with the guilt.", "You asked him to pull over even though you didn't actually want him to. He tried calling you but you rejected the call. What else could he have done? Call another 10 times?  OP, you're 28 - you should be taking some personal responsibility for your safety.  You're not necessarily TA for feeling hurt by an argument and needing his support. But YTA for giving mixed signals and wanting to be pacified repeately and putting yourself in potential danger.", "YTA you are twenty eight fucking years old. Be so for real with yourself. \n\nThis is embarrassing behavior. I would leave you.", "YTA because had he not let you out of the car you would’ve gone into a rage about how he’s keeping you trapped in the car. Nobody has time for childish games at 30. Grow up", "YTA. \n\nWell, technically this could be an E-S-H if your boyfriend was driving drunk but I can't tell from the post if he was or not. \n\nSo anyways, let me get this straight. You *insisted* on being let out of the car to walk home. He *tried* calling you, but you refused to pick up because you were too mad despite the fact that that would have been a great time to admit that you were scared and needed him to come back and get you. Then you got pissed at him for NOT... what? Driving around searching for you? Trying to force you back into the car? You were drunk and pissed, how exactly do you think you would have reacted to him doing that? You put him in a no-win situation and now you're fuming that he respected your stated boundaries. Make up your fucking mind about what you want. \n\nYou're way too old to be playing these manipulative, childish games. Time to grow up before you hit 30 and are still behaving like a teenager.", "YTA. If he didn’t pull over you’d probably throw a fit about that too. Lose lose for him. You sound like a lot to deal with, perhaps look into therapy.", "YTA. \n\nTold him to pull over, he did & you’re mad that he did. \n\nYou are mad he didn’t look for you. \n\nYou were scared you’d get kidnapped. \n\nYou are such a childish kid.", "yta\n\nyou asked him to stop and let you out. not letting people out who demand to be let out, is kidnapping in a lott of places. he called 10 minutes in, you could have changed your mind then. \n\nAfter that it is walk or call an uber/taxi time. 50 minutes walk is not that long, and you asked.", "YTA. I understand you were angry but you made the decision to have him pull over. You made the decision to open the door and get out of the car. You made the decision to walk home and ignore his phone call. Decisions have consequences. This is on you and you have no right to be angry at him for complying when you told him you wanted to get out of the car.", "YTA. Are Meegan?\n\nhttps://www.youtube.com/watch?v=eirBtt7wIDU", "You are mad that... he respected your boundaries and even tried calling you to make sure? YTA", "YTA- Br careful of what you ask for, you just might get it.", "YTA.  That you even have to ask is a little concerning.", "As you demanded, he let you out of the car. Then, he called, but you didn't pick up.\n\nThis one is easy: YTA.", "YTA.  You made a decision, an angry one to be sure.", "YTA.   \nYou. Told. Him. To. Pull. Over. He did as you asked. Don't blame him that he did not conform to your drunk mind-game expectations. Seriously.  \nHad he come back to get you, you probably would have yelled about him not respecting/taking you seriously.", "YTA, ilyou put him in a no win situation. You'll get angier if he pulls over to do what you ask and the same if he doesn't pull over  and not dk what you want.\n\nYou're acting more like you're in your late teens/early 20s. You need to grow up.", "YTA. Kristin Bell used to do the same thing until she realized she was a stupid idiot who thrived on drama and not love. Read her story and grow up. \n\nAlso, don't drink and drive.", "YTA - this it what happens when you play silly games and he called your bluff", "YTA grow up already... 28 is long over due to be this petty... so many red flags he is ignoring", "YTA. Just tell him how you feel instead of making up stupid tests for him.", "Lmao you demand he lets you out. And you get mad that he does and then he called you to make sure you were ok and then you ignored him. YTA", "YTA. He did what you asked of him. He even tried to call and you didn’t pick up. What, did you expect him to chase you, a 28yo woman, through the hills in the dead of night? Did you expect him to pace the floor wondering where his adult girlfriend is and if she’s safe? You’re 28 years old! You made three adult choices (got drunk, got out of his car and trekked 1.5 miles to get home, and refused to answer his phone call—and I’m assuming refused to call back when you realized you were in over your head) and it’s not his responsibility to worry about the consequences of those decisions. Granted, I’m sure he did worry, hence the phone call, but that can only go so far.\n\nYou are *almost 30 years old.* It’s time to start acting like it.", "YTA \n\nIt sounds like you just wanted him to break down and grovel, and instead got even more pissed when he just did exactly what he you told him to do.\n\nYou’re way to old to throw a temper tantrum like this.", "YTA \n\nYou asked him to let you out.\n\nHe did. He called to see if you were OK but you refused to answer. \n\nDon't play the bait game. The \"he should've known\" game.", "YTA\n\nYou're 28 not 18, time to grow up and stop playing teenage games", "Classic *play stupid games, win stupid prizes*. \n\nHe did what you asked, blame yourself. **YTA**", "YTA. There is so much wrong here. As you noted that was some drunken drama, and you created it yourself. You told him what you wanted and he complied. You didn't answer your phone. He called your bluff. What you're expressing now is incredibly manipulative. And I suspect that neither of you should have been driving.", "YTA. He did what you asked.  If he hadn't let you out you'd probably be mad about him not doing what you asked.  You're too old to be playing games like this.  Grow up.", "YTA wtf is that petty teenage attitude and thinking? You are an adult, why don’t you start using your words instead of throwing a tantrum.", "YTA you met the consequences of your actions, sorry you didn’t like ‘em", "Play stupid games and win stupid prizes. YTA", "YTA. Don’t say things like that when you don’t mean it and then get mad when it doesn’t work out the way you thought.", "YTA, and also him. Was he drunk driving? \n\nAnd you did that thing that every one hates.. Asking/telling someone to do something then getting mad when they do it. Say what you mean, mean what say, deal with the consequences like an adult.", "YTA.  He did exactly as you asked, you then ignored his calls, and now you're upset he didn't try more things?  Grow up.  People can't read minds and no one is responsible for your words except you.", "INFO: If you didn't wanna be let out....why did you ask? If you were so mad that he wasn't looking for you, why did you not pick up the phone when he called, likely to make sure you were okay??", "YTA.  If you didn't want to walk home, why did you tell him to pull over and let you out?", "YTA. You’re mad because he did exactly what you told him to do. And don’t perpetuate that story that when women say something, they actually mean the opposite. You made a choice, suck it up.", "What d'you mean you're hurt that you asked him to pull over so you could get out and he he did it? I'd be horrified if he _didn't_\n\nYTA", "YTA. Does he read minds? Think about the consequences of your own actions, ig", "You sound toxic af......YTA", "YTA You asked to be let out of the car. You chose to walk home. You had a phone, you could have called him to get you or called a friend or called for an uber. Now you are mad that he did what you asked him to do? That he didn't come looking for you, even though he called and you refused to answer? But you were able to call because you forgot your keys. \n\nStop being mad that he refused to indulge your drunken tantrum.", "Soooo, you're mad he did exactly what you said to do? Don't play stupid games with your boyfriend.  Yta", "YTA- maybe rethink the whole drinking thing next time. You asked him to pull over, he respected your choice and you walked home.   At ANY point you could have called him to come get you.", "YTA for not wanting him to do what you ask him to and ignoring his call.\n\nImportant lesson here is ,  drink less.", "YTA. You told him to pull over & let you walk but you expect him to drive around (drunk) looking for you? You both also sound very immature.", "He called you. You knew he called you but you didn't pick up. YTA. Perhaps he can bring you a shrubbery.", "Yta for not understanding actions have consequences", "Lol, my bf did exactly what I told him to while I was throwing a tantrum,  AITA?\n\nOF COURSE YOU ARE. Normally, people (much younger than you) learn from situations like this, but the fact that you're here asking does not give me hope.\n\nLook, it's fine to be mad, and it's fine to be drunk, but you really should think through every possible outcome *before* you say things that might have you walking home. Then,  if you're not comfortable with any one of the possible outcomes, you can make different choices.\n\nPlease just learn from this,  I had to go down this road way too many times before growing the eff up, and it's just way easier and more enjoyable if you learn from the first stupid choice.", "YTA - Easy.  Say what you mean, men arn’t mind readers and you clearly were taking this too far but when he called your bluff you get mad at him?", "YTA. He was being respectful of a request that you made. \n\nYou chose to get out the car. You chose to walk. You chose not to pick up the phone. You chose it to call him. \n\nYou chose wrong a lot of times here.", "Your BF respected your request, gave you the space you asked for, called to see if you were all right, and waited up for you at home to let you in.\n\nYou were playing a game of emotional blackmail to 'test' him, and see if he responded up to your relationship expectations, instead of being grateful he listens to what you want and does as you ask when you need him to. \n\nYou didn't actually want to get out of the car and walk - you wanted him to protest, and placate you, and admit he was 'wrong' in the argument to 'save' you from leaving. So you shouldn't demand things, and then be upset when you get exactly what you ask for.\n\nYTA.", "YTA.\n\nMaybe try being absolutely direct in what you want him to do. Sounds like he's in the doghouse no matter what he does, and expecting him to decipher what the correct course of action here is insane. \n\nDirect communication is key!", "YTA\n\nHe respected your decision.", "YTA. Play stupid games and win stupid prizes.", "YTA \n\nIf he refused to pull over and let you out of the car he could be charged with a felony!!\n\nIf it wasn’t what you wanted then you shouldn’t have told him to do it.", "YTA you got into a fight and told him to let you out of the car. Then you ignore his call. If I was him I would seriously be reconsidering wanting to be such a toxic female. \n\nAnd kidnapper really. You are a 28 year old women  Grow up and stop playing stupid games", "YTA. Leaving the car and waiting for him to look for you is some heavy passive-aggressive shit. And of your drinking is leading to you making dumb decisions like this, it’s time to cut down or stop.", "YTA.... It's called *personal accountability*, don't ask for shit you don't really want then make it other people's responsibility to fix. It's YOUR responsibility, no one else's fault but your own.. and if you were actually kidnapped it would have been your own choices, not his, that landed you there. Again, accountability. \n\nBut I imagine you would still blame him for leaving you if you were, instead of thinking  \"I should have stayed in the car\"", "YTA and too much drama, expect to be walking a lot more places soon.", "YTA. You told him to pull over but didn’t actually want him to them you get out and walked and are mad that he didn’t come back begging you to get in the car? Then he called you and you didn’t pick up and now you complain that he stopped calling? \n\nSo you are mad at him for - checks notes - doing what you told him to. \n\n What kind of fucked ip psycho game is this? What you wanted was for him to beg and plead because in your twisted mind that would have been proof of his live or what am i supposed to take away from this??\n\nYou say you are 28 but you act like 17. Can you just grow the hell up?", "YTA. Play stupid games, win stupid prizes. \n\n&#x200B;\n\nAlso, you were both drinking? Why was he driving? You're both TA for that alone.", "ESH for driving drunk, enabling drunk driving, and being too immature to handle your alcohol.", "YTA you asked him to pull over and he followed your instructions. You are one of those people that say no when they want a yes and confuses everyone argh When you use words, make sure you say what you mean.", "Question; why did you tell him to pull over and then get mad when he did what you asked?", "YTA - You are responsibly for what you say and it was, pull over. Infact, he couldn't win because you're upset he did and you likely would be upset if he did not. Take responsibility for your words. Why were you stunned the car was parked? This is what you wanted.", "YTA", "YTA. He did exactly what you (in a fit of anger, drunken or not) asked him to do. You then doubled-down on your tantrum by not answering the phone when he called…..yet expecting him to come rescue you.", "YTA, I used to throw tantrums when I didn’t know how to explain my emotions so I get it, but I recommend doing some work on emotions and how to communicate. Otherwise it hurts both people to be dramatic for no reason", "yta either way he loses… if he didn’t listen you would have gotten mad about that too", "YTA - If he didn’t pull over the title would be be “AITA for getting mad that he didn’t pull over”\n\nGrow up.", "YTA. He did what you asked, and you're not some helpless little girl (even though you're acting like a child).", "YTA If you don't want to get out and walk home, then don't demand the driver to pull over so you can walk home. I feel like you shouldn't have to be told that. What was he supposed to do? Fight with you over it? Beg you not to do it?\n\nGrow up, OP.", "YTA. Don't play the dramatic card if you can't handle the consequences. You put yourself in that situation.", "YTA\n\nGeez, because of women like you, men think we're all crazy.", "YTA. You told him to pullover and let you out which he did,and now you’re made at him for respecting your wishes? Grow up and stop playing games.", "YTA. Accept your consequences. You told him to pull over and let you out. He did as asked. Next time, communicate what you actually want and stop playing childish games.", "YTA 100% Based on every facet of your story, I can't believe that you're legal drinking age. Grow up.", "YTA He didn’t cater to your manipulative and dramatic games. Did you have a parent growing up that would pick fights with your other parent? Did they like getting a reaction by provoking and then have a big make up? This sounds like trauma bond reenactment. He didn’t play the game. Get therapy and stop trying to pick fights and have make up sessions to feel loved.", "‘This is about me’\n\nYep \n\nYTA", "YTA and too immature to be in a relationship. Stop playing games and grow the fuck up", "YTA and you need to grow the fuck up.", "He’s an AH for drink driving \nYTA for asking him to do something then acting outraged that he did what you asked him to do\nGrow up", "YTA. You need to understand that most men do not think this way... they dont read into things like we sometimes tend to. They are very straightforward. If you ask him to do something, he is just gonna do it, hes not gonna spend hours deliberating about it or turning it into something it isnt. And he especially doesnt want to get into a pointless argument over it.\n\nLife is not a romcom. Dont put your partner in these weird positions where hes made to feel bad because you have communicated your feelings to him incorrectly and he couldnt read your mind. Just say what you mean.\n\nEdit: changed wording.", "While I think he probably should’ve insisted on driving you home (safety), you showed no signs of wanting to be in the car with him even after he gave a follow up call.\n\nYTA.", "Every one here is an asshole \n\n1- Drunk driving. \n\n2- you told him to let you walk and he did\n\n3-he tried calling you didn’t pick up \n\n\nHonestly your both extremely childish\n\n\nLet’s be honest if he didn’t it would of been a fight you just wanted him to drive off and come back so you could feel superior to him", "INFO: was he drunk driving? And you were cool with that?", "You literally didn’t tell us what the argument was. \n\nBut drunk driving is near cool. ESH for not taking a cab/Uber.", "YTA. You told him to pull over so you could get out and he did. \n\nIt took you 50 minutes to walk 1.5 miles? I can walk a mile in 17 minutes on my 60+ year old legs. You certainly could have walked that far in less than half an hour. Not likely your small town is rife with kidnappers either.\n\nA few AH points for him driving drunk but you were the bigger AH here.", "ESH\n\nOn the one hand, he was only doing what you asked, and he did call. I wouldn't have let you out, though.  \n\nYou're more of TA than he is because a grown woman in good health should be able to walk a mile and a half without freaking out unless you live in a dangerous area.  \n\n(Unless he was also drunk, in which case you're both equally horrible for letting him get behind the wheel, but him more than you.)", "ESH for the drunk driving, not knowing your limits and acting immature", "ESH Why was anyone driving if you were both drinking? Sounds like you both need to do a little growing up and luckily no one was hurt, just OPs pride", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis is about me, 28yo F and my 30yo M Boyfriend. Last night we were drinking with my coworkers, and right as we were leaving, we got into an argument in the car. Out of drunken anger, I told him to pull over and I got out and started walking home. We live in a small town (only 5 miles end to end) but our apartment was 1.5 miles away through hills. \n\nIt was 11pm and it took me 50 minutes to walk home and I was very angry and hurt that he actually pulled over, even though I asked him to.  Every car that passed by, I either hoped it was him looking for me, or I was worried it was a kidnapper. I got really on edge that I would get kidnapped since it was the middle of the night and I was just a girl by herself. \n\nHe did try calling me 10 minutes into my walk (which I later found out is when he got home), but I was too angry to pick up. I couldn’t believe my eyes when I got home and his car was just parked there. I had to call him to let me in since I forgot my keys and when he opened the door he didn’t say a word. \n\nI was fuming that he wasn’t even trying to look for me or asked if I was okay. I found out that he just went home and slept and when I confronted him about abandoning me in the middle of the night to walk home, he just said “well you told me to”. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA - since when does somebody following instructions made them TA?  You told him to do something, he did it - and now you're mad.  I hope he runs away fast.", "YTA.\n\nHe did what you asked him to do. \n\nDon’t drink and argue. And don’t drink and drive.", "YTA- Either way you would have been mad at him. You told him to pull over and when he did you got mad he listened. If he didn’t pull over you would most likely be mad that he didn’t listen to you and might have yelled at him while he was driving which could be a distraction putting not only yourself in danger, but him and other drivers in danger as well.", "YTA\n \nYou asked for this. He obliged and checked on you.  \nReal life is not a rom com.  Those are problematic as romantic guidance because they fill people with unrealistic ideas because they are fictional.  Don’t use make-believe to decide what to expect in real life. \n \nThis is entitled behavior.", "YTA you’re a grown woman, stop acting like a teenager, this is embarrassing. You should know better, you made your bed you sleep in it. \n\nIf you can’t make safe decisions while drunk, you shouldn’t get drunk. Period. \n\nNow, Why don’t you guys sit down and have a mature sober discussion about what happened like adults?", "YTA. You’re angry that he did what you asked him to do in the first place and then you’re angry that he didn’t go out to look for you or try to find you even though YOU ignored his call. Grow up.", "Um YTA and you need to learn how to communicate better. You sound like a shitty character in a tv show.", "YTA. You told him to.\nI fully understand wanting to walk home instead of being in the same car as him if you were fighting, but you don't get to follow through on a dramatic decision and then get angry when he respects your decision.\n\nThese kinds of games belong in high school relationships.", "YTA \n\nI say this as a female, this kind of crap is so much of what's wrong with dealing with arguments and relationships. You yelled at him to let you out, he did. He called you 10 minutes later, presumably to check on you, and you ignored him. \n\nBut you're butthurt because he didn't come crawling to you and beg you to get back in the car? \n\nGrow up. Learn to communicate properly. He did exactly as you asked and even tried to reach out part way through. You are ridiculous and I cannot believe you think it's OK to be mad at him over this.", "YTA. \n\nInstead of playing games and getting angry when other humans aren’t mind readers, maybe you could try communicating like an adult?  It’s not fair to make other people responsible for the crap going on inside your head.", "YTA - If he doesn‘t pull over and let you out he is then guilty of kidnapping you or holding you against your will.\n\nYou, being drunk, and good decisions don’t seem to be good bedfellows.", "YTA.  FAFO", "YTA. These kinda manipulative games will end your relationship.", "YTA big time\n\nThe childish entitlement from this is substantial. Grow up", "YTA: Are you sure you're 28 and not 18? Cause this mess sounds like some 18 year old mess.", "You fuck around, and you find. You definitely found out. Y T A", "YTA - you got what you asked for!\n\nPerhaps you should avoid alcohol, since you apparently can’t handle it?", "Grow up dude. Are you kidding? YTA", "What the heck did I just read? You told your partner to pull over and let you out so you could walk home. Then out of anger you refused to pick up the phone when your partner called, likely to check on you. Then you were angry that your partner left you *like you demanded* and didn’t run around checking up on you *when you weren’t responding to a check in*?\n\nThis is on you, and is wrong to be angry at someone for not reading your mind, especially if that would be in direct contradiction with the words from your mouth. If you were worried and wanted help, you could have called and I bet would have been picked up. YTA", "\"How dare you do what I say?\"\n\nYTA", "“why didn’t my boyfriend kidnap me and hold me without my consent?” \n\nYTA", "YTA. You probably should quit drinking because you clearly can't handle your alcohol.", "YTA \n\nAre you 28 or 12?", "YTA \n\n>Out of drunken anger, I told him to pull over and I got out and started walking home.\n\nThere are three options, and I suspect all of them are correct:\n\n1. you are angry that he did what you told him\n\n2. you are angry that he let you do what you wanted\n\n3. he let you find out after f**king around\n\nGrow the f**k up.", "YTA. Play stupid games, win stupid prizes. Grow up.", "YTA. Your behavior was ridiculous at every step of the way. \n\n* Demanding he pull over. YTA\n\n* Ignoring his calls when he wanted to check in and make sure you were safe. YTA\n\n* Expecting him to apologize when you were in the wrong. YTA\n\n* Being manipulative and saying he was the one in the wrong because he did not force you to stay in the car. YTA \n\nI hope that clears things up.\n\nYou’re lucky you didn’t get hit by a car or otherwise injured. Happens to drunk people who decide to leg it home all the time, yes even in small towns and even when you know where you are. He was probably beside himself with worry.", "YTA you're dumb and immature", "Oh come on, YTA. He did what you wanted, and you got mad about it?!? He even tried to call you, but you ignored it. Stop playing childish & petty games", "YTA and big time", "YTA, grow up", "YTA. I can't believe your age, you sound like a teenager. Grow up.", "YTA and toxic to boot.", "YTA. Girls who pull stunts like this give the rest of us a bad name. Don’t make threats you don’t mean. Don’t ignore calls when you want help. As others have said, a true case of FAFO.", "Hahahahahahahahaha I can’t laugh any harder if I tried. He did everything you asked him to and he even tried to call you but YOU ignored it.\n\nNo way in hell is he on the hook for this.\n\nGrow up and learn to stop hitting the bottle so hard.\n\nYTA", "YTA. If it isn’t the consequences of your own actions.", "YTA. You are too old to be playing these kind of games. Grow up.", "YTA play stupid games win stupid prizes.", "Lmaooooooo YTA", "YTA", "YTA....\n\nI hoped you learned a few hard truths during your walk...\n\n1.  Careful about what you wish for because you might just get it.\n\n2.  When you drink, you make stupid decisions.\n\n3.  When you drink, you become combative.", "YTA. This is the kind of nonsense crap that gives plays into stereotypes about women acting like irrational, emotional children. You are 28 y.o. so act like an adult.", "YTA. he did as you asked. i think you really just ignored all his calls in an attempt to make him feel bad, panic, think something happened to you, search for you and feel justified in having your little hissy fit", "YTA. What you are doing is called emotional manipulation, and he ain’t playing.", "YTA.\n\nWhat did you expect him to do, hold you hostage after you told him to let you out? Learn how to be straightforward. Life will be so much easier.", "YTA. He did what you asked. Say what you mean and mean with you say. Life isn’t a game and he shouldn’t be expected to be a mind reader.", "YTA.  You asked him to pull over and he pulled over.  He called you but you ignored him.  Make better choices next time.", "This reminds me of the junior high school drama I’d witness where the girls would get mad at their boyfriends and stomp away yelling “leave me alone” or “don’t talk to me!” And then get mad when their boyfriend wouldn’t follow them or try to talk to them. \n\nSay what you mean and mean what you say, YTA. You did this to yourself, OP. FAFO.", "Lol…..\n\nDoes this even need an answer?\n\nYta you dumb dumbass.", "YTA. Girl... grow up. I'm sorry, like these other comments are saying, play stupid games win stupid prizes. Like that's some next level petty shit. On top of that you didn't answer his call but you wanna be mad because he let you walk home after you told him to let you out of the car.", "YTA. OP is a walking red flag. Immature and toxic. The biggest mistake BF did was not changing the locks when he got home, considering it a bullet dodged, and moving on.", "YTA. These games are ridiculous", "This is hilarious! YTA.", "YTA, and you sound incredibly childish.  You need to grow up.", "How are you 28 and still behaving like a toddler? YTA", "YTA. He did what you told him to do. Grow the fuck up. \n\nAnd you refused to answer his call. You brought this on yourself.", "YTA stop acting like a child, you asked for it so you got it. I bet if he didn’t let you out you’d be here screaming about kidnap, grow up.", "YTA, girl drunk or sober you sound problematic as hell.", "YTA youre too immature to be dating. Your having petty fights and blaming him but 1 you asked to walk and I am sure you probably told him more than once to pull over and 2 you didn’t answer his call. Be single.", "YTA\n\nHe did what you asked.\nAnd when he tried to call (to make sure you didn't want him to do something different, to see if you were okay) you didn't pick up.\n\nHe might have done something different ifmhed been sober, and presumably so might you.\n\nBut OP.\nDONT DRIVE DRUNK.\nYOU BOTH SHOULD HAVE BEEN WALKING.", "YTA - Let us know how the apology goes.", "Come on, seriously! Don't say shit you don't mean. You were and still are acting like a spoiled child.\n\nYTA + You're clearly not the brightest crayon in the box.", "YTA maybe stop drinking", "YTA\n\nYou told him what you wanted. He obliged. Say what you mean and mean what you say. Don't play games.", "YTA", "Uhh...\n\nYou demanded he pull over and let you out.  \nHe tried calling you, but you ignored his call.\n\nAnd you're angry at him for letting you out and not checking on you. Got it.\n\nYTA", "YTA\n\n1. You let your bf drive after drinking\n2. You gave him a no-win situation and you are blaming him for not winning. \na. If he had not stopped the car, that would be abduction. And possibly he couldn't trust you not to attack him while you were drunk and cause him to crash. This is probably the worst option.\nb. If he lets you out, to walk home, without knowing that you are safe, he's a jerk. At least he tried phoning you, but you refused to answer. And then blamed him for it.\nc. If he lets you walk, but then drives slowly behind you, he's being creepy. Plus he attracts police attention. And he's driving after drinking.\n\nSo b. Is probably his least worst option.\n\nActually there was an option d. But most people wouldn't think of it. Park the car and walk with you, or at least near enough to ensure your safety.\n\nSeems to me, you are just creating for reasons to blame him. Why do you think this is necessary? Is there some other problem between you that you are avoiding confronting? Are you setting out to destroy your relationship?", "Everyone is Assholes… You were drinking, get an Uber 😡", "YTA. Words. Use your words. Do not expect a certain reaction. He cannot read your mind. If you aren’t upfront, you will keep being disappointed. Pick up your phone. Ask him to pick you up.", "Hahaha, this is awesome and you totally deserved it.", "He seems immune to your manipulation tactics.  YTA", "YTA", "Woman to woman: YTA to your whole gender as well as to your boyfriend. The rest of us are out here PLEADING with men to take us seriously when we say “No” and “Leave me alone” and you are MAD that your boyfriend actually does that. Do us a favor and dump him: one of us will enjoy being in a relationship with a respectful man. You can have one of the jerks who don’t take no for an answer.", "Girl you’re almost 30, stop this nonsense.", "Play stupid games, win stupid prizes. \n\nYTA.", "YTA.\n\nYou told BF to pull over and let you out.\n\nBF pulled over and let you out.\n\nYou got out.\n\nEnd of story.  \n\n(He didn't abandon you; he did exactly what you told him to do.  This is entirely on you.)", "ESH. Play stupid games, win stupid prizes.", "Everyone saying Y T A is suffering from that idiotic brand of Redditor smugness. \n\nESH. OP was drunk and did something stupid. I hope/ assume her bf was sober since he was driving. You really gonna ditch your drunk gf and go home and let her walk? If OP was run over or fell, or was attacked or injured in some way, I wonder how righteous her bf would be when explaining to the cops \"well, she told me to.\"\n\nJesus Christ.", "ESH - You for having the maturity of a teenager and him for drinking and driving", "I agree with you. NTA. You were drunk and I feel he should have been responsible for you. Although I do think that you should have picked up the phone I think he should have maybe gone around the block a few times and made sure you were safe. I don’t care if I get downvoted he should have acted like a man and taken care of you while you were drunk and walking home alone at night. I wouldn’t even want to be with a man who doesn’t care about my safety.", "Yta. Also your boyfriend drove home drunk?", "YTA — Being manipulative in saying you want him to do one thing but actually meaning the opposite and expecting him to know that is toxic. Say what you mean. \n\nAlso ESH if drinking and driving was going on. Also ESH for having such intense arguments while on the road, distracted emotional drivers are dangerous drivers.", "YTA- You asked him to stop and let you out. Your boyfriend stopped and let you out. WTF else was he suppose to do.  \n\nAlso what’s with the drinking and driving BS here? You guys were out drinking and then got in a car?", "Drinking and walking alone at night….not smart. Grow up. Both are AHs.", "ESH. The whole drinking and driving issue makes your snit rather marginal in comparison.", "ESH yeah it was immature to drunkenly get out of a car and walk home, but he left you there alone to be kidnapped. He’s the worse AH.", "ESH. Sounds like your bf had a bit to drink before getting behind the wheel, that’s shitty, You sound like you can’t handle your drink, also shitty. BTW statistically women are killed by men they know, not strangers. Far more terrifying is a man who WON’T let you out of the car (src my own life). Hope you enjoyed a night of your own drama. Can I suggest, I dunno, a hobby?", "> Was the hope that he would be panicking looking for you?\n\nFor some reason, I picture OP wanting her boyfriend to assemble a posse and have the entire town look for her.", "She's the star of her own RomCom apparently. /s", "She’s so full of drama and got upset that she got what she asked for. Yikes. She sounds so exhausting and she needs to work on herself. Oh yeah. YTA.", "\"I demanded he pulled over so I could get out!\"\n\n-He pulls over, and OP gets out *willingly.*\n\n\"How could he leave me out here, helpless and alone?!\"\n\n-OP has a working phone she could use in an emergency.\n\n\"How could he ignore me?!\"\n\n-He tries to call her phone, which OP *refuses* to answer.\n\nYup, it's another classic case of FAFO alright.", "Best part was the 'I refused to answer when he called, but then called him because I forgot my keys'. Working phone, so phone-a-friend or uber were options. \n\nAlso, a side question. How did it take an hour to walk 1.5 miles?", "Exactly this YTA. Don't ask to walk home if you dont want to walk home.", "You stole my comment! 😂\n\nYTA", "Not only this, but Boyfriend was obligated to pull over and let OP out - failing to do so could be interpreted as unlawful confinement or the local analogous criminal charge.\n\nIf OP doesn’t want to be in the car, Boyfriend did the right thing by pulling over and letting OP out of the car.\n\nOP should grow the hell up - it’s clear she wanted to manufacture a no-win situation for Boyfriend: if he doesn’t pull over, he’s an asshole for forcing her to stay in the car. If he does pull over, she is upset with him about it and expects him to come rescue her from her own poor choices. \n\nThis is highly manipulative behaviour from OP and Boyfriend should pull over and leave her on the side of the road of life if she can’t come to her senses on shit like this.", "Right? My ex gf did that once, & I pulled over. She admitted she was mad and unwilling to continue arguing, but did not want to walk home.  (Although it would been roughly 13 miles to get back to her dads, or 30 something to where we lived)\n(She blew up on me over something small, I forget what exactly, and I mentioned she was ranting about how her mom does that not even an hour prior, which she hated)", "agreed, and way too old to be referring to herself as a \"girl.\" You are a full grown woman, OP", "If he refused she could make a case that he held her against her will, I wouldn't run that risk with a girlfriend going on a drunk rage.", "> Yes he shouldn’t have actually done it but you told him to.\n\nAnd then we would probably have seen another post from either of them about being the GF being held against her will. \n\nThe BF was in a no win situation, but he did call her and she didn't pick up - even though she was worried about being kidnapped!\n\nThis is all on her", "> Yes he shouldn’t have actually done it\n\nDoes she not have any agency at all? \n\nHe should have refused to let her get out of the car if he thought it would be a bad idea? Wouldn't that be controlling and abusive if he did that?", "She’s over it", "No she used too till Dex told her she wasn't allowed too and that he wouldn't stay so she now goes to the front door and slams it", "Lack of foresight or adequate accountability.", "I'm sorry but I have to disagree She sounds immature and psychotic he needs to run", "Ni", "> people ~~men~~ arn’t mind readers \n\nFTFY", "Please don't generalize all women like this! I always say what I want and communicate correctly", "Wow, way to go generalizing both sexes!!", "he was driving. and might be sober. OP mentioned she was drunk, not if he was.He could be out drinking and having alcohol free or soda, knowing he is driving.", "Yeah.  It's time to grow up.   All of you put eachother in danger.", "only one who was confirmed slightly drunk was OP. no mention if the driver was.", "> t took you 50 minutes to walk 1.5 miles? I can walk a mile in 17 minutes on my 60+ year old legs\n\nYeah I was wondering about that too.", "\"I wouldn't have let you out, though\"\n\nThere's a word for that - it's called \"kidnapping\"", "BF _could_ have been drunk driving but OP doesn't actually confirm that one way or the other. A fair few people seem to be assuming she did, but that's a misreading of the post.", "And now that Im reading comments I see others feel the same way.", "Well, whatever happened after getting off the car, is on her, and her alone. Can’t be mad for getting what she wanted. YTA.", "All whilst wailing hysterically and falling upon his knees under the heavy weight of regret.  \n\nAsking himself, why, OH DEAR GOD, WHY he was such a fool for doing EXACTY what she asked of him.", "I was thinking this too. “I was playing hard to get and you were supposed to chase after me!!”", "In fairness to your last question, OP had been drinking", "Replacing walk with crawl because 50 minutes to \"walk\" 1.5 miles means they spent more time on the ground than on their feet.", "This reminds me of when I decided to walk because I was mad… and then regretted it and was like well this was dumb. And I didn’t have a phone to call with. \n\nSeriously op should have answered phone and said pick me up, I don’t want to walk anymore, please. Because yea life lesson here", "Exactly. This was a Morton's Fork for him. No matter what he did, OP was going to be mad at him. OP is just mad that he chose the option less likely to end up escalating to something dangerous.", "I know it is.  Just saying yea not smart to do what he did.  However she told him to.  That’s on her.\n\nI only said he shouldn’t have because if something would have happened he’d have that guilt on his conscience.", "I’m saying it wasn’t a good idea and probably not smart.  However that’s on her.\n\nEdit-Not sure why Im being downvoted for saying it wasn’t smart.  Because it wasn’t. But whatever I literally blamed her and not blaming him.  Continue to downvote me I’m going to bed.", "Does she say it on his podcast?", "Im not lol... I know we arent all like that ofc. I've just noticed that a lot of women do tend to do this. Probably could have worded it a bit better, but you get the gist...\n\nLike saying they're fine, but they're really not, and then expecting their partners to some how decipher their true feelings and read their minds, but then get mad when it doesnt happen... just bizarre and manipulative.", "OP said “WE were drinking with my coworkers” also said “WE got into a drunken argument”. Using context clues it’s clear bf was drinking as well.", "“Last night we were drinking”", "Nah, that's called 'continuing to drive while asking \"are you sure you want to get out here?\"'  A mile and a half is going to be maybe 3 minutes of conversation.", "Way to reinforce the point.", "True. Maybe 1.5mph is the average speed of a drunken tantrum.", "She was drunk and angry and wanted an excuse to be mad at him.", "Yes it wasn't a good idea. But it was HER bad idea. \n\nHe's not wrong to have let her out when she requested it.\n\nHe has to respect her agency and he did that.", "Na Ellen show.....I honestly cracked up laughing \n\nCause I vividly remember her saying dexter said she couldn't leave the house when they fought. \n\nThey need to do a movie together", "OP did NOT say \"we got into a drunken argument\". OP said \"we got into an argument.\"  You added the word \"drunken\" yourself.\n\nOP confirms she was drunk but does not say if BF was also drunk or not, or say if \"we were drinking\" means BF was drinking _alcohol_.\n\nIn short, OP doesn't actually say BF was drunk driving - you've just assumed that he was.", "we were drinking, does not mean till drunk. also if 9 drink beer, and 1 soda, it is still we are/weredrinking.\n\nWe got in an argument (drunken not mentioned) then she said it out of drunken something, confirming her as drunken.", "you can drink alcohol and still drive, as long as you're below the legal threshold for blood alcohol content.", "You can go for a drink or 2 and not be drunk.  OP said “out of drunken anger”.  So while it’s unclear if he was drunk she was.", "Way to say the same thing over again when you have no more arguing points left", "Your comment made me snort-laugh. 🤣", "Exactly why I said she was an AH and not an everyone sucks.", "My sister gets drunk off of one beer and it takes me it less 3/4 to get drunk. Everyone has a different tolerance. If you even have a single beer you should not drive.", "That is literally why I asked.", "you do you.\n\nthe rest of us will follow the law.", "Just wanted to say he might not necessarily been drunk.  She’s an AH for sure unclear if he is.", "I don't know why the two users who replied to you are giving you such a hard time when they admit that they don't know the answer to your question either. It was a reasonable question."]}