{"id": 8352, "submission_id": "10lyjia", "title": "AITA for deviating from my niece and nephews' routine while we watched them instead of speaking to my SIL because I thought it was unfair?", "selftext": "Our niece and nephews(11M, 9F, 8M) were going to stay with us for a week while my husband's sister and her husband went to a wedding out of state and made a vacation out of it. SIL has always gotten parenting inspiration from celebrities and online blogs. The first clue something was off was when our niece came to us and told us that our son (14M) wasn't giving her his Switch to play first. I explained to her that the Switch is his so she had to ask nicely for a turn, and it was up to him to share. When it was time for the 8 and 9 y/o's bathtime I told them to get ready for their baths, our niece shouted \"I'm first!\" and went to get her stuff. At bedtime, I asked them what story they wanted read, and again it was our niece that answered.\n\nThe following day they wanted to watch a show, and I told them to agree on one. Our niece went \"We're watching (show name here)\". I told her that she needed to talk to her brothers to find something all 3 of them agree on. Her response was boys always pick everything so I took that to mean that her brothers often pick and let her put on the show. When it was dinnertime, my husband called everyone to the kitchen and was plating food up for the kids on a first-come, first-serve basis. Our son got in there first and our niece told him that he needed to wait because she and Auntie go first because girls go first. My husband explained that at dinner time dinner is served as you get in the kitchen or take turns so no one goes first all the time. Bathtime and bedtime story was the same thing- she wanted to go first and pick first, so I told her since she got to go first with both the night prior, one of her brothers got to go first that night. She said that she was supposed to go first because 'girls first' and that's how their parents do it.\n\nHere's where I may be an ahole- I explained to her that in our house, we share and we take turns. That's how things went for the next two days until their parents called and she told my SIL that we weren't following the rules. I talked to SIL and she was upset that I changed the kids' routine without talking to her about it first because she was just trying to provide an environment for her daughter where she would take precedence. I told SIL she never mentioned these 'rules and routines' when she asked us to keep the kids and even if she had, I wouldn't have agreed to them since they would, and have, impacted my own child. I also told her she's not providing an environment to make her daughter feel valued and special, she's raising her to be entitled and being unfair to her sons. The following day my husband's parents showed up to pick up the kids and since then, his relationship with his sister has been strained. AITA for deviating from their routine instead of bringing it up to my SIL first?", "created_utc": 1674757213, "permalink": "/r/AmItheAsshole/comments/10lyjia/aita_for_deviating_from_my_niece_and_nephews/", "score": 658, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1: I changed my niece and nephew's rules and routine because I thought ti was unfair to my nephews because my niece is being raised to always go first and pick first. 2: I didn't talk to my SIL about it first, I just told my niece in our house we share and take turns and had the kids abide by our house rules.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Yikes... that's a crazy way to raise a daughter. Your SIL isn't doing her any favors. She'll be shocked when she enters the world as an adult and realizes nobody cares about her rules/opinions.", "NTA. Her thought process makes no sense. It's fine to make sure your daughter knows she's valued and special. It's definitely not okay to teach her that because she's a girl, she'll always get to be first or always get her way. You're correct, she's just teaching her to be an entitled brat!", "NTA. Your SIL is sexist and is raising your niece to be sexist as well.", "Nope your house your rules (which 100% healthier in my opinion). NTA. What a terrible way to raise her kids. Yikes. I feel sorry for the people who have to deal with niece in the future in the real world. How is school going to go with that attitude or dating? Geez.", "NTA - You weren't feeding them food they shouldn't have or letting them stay up until 2:00 a.m., you were simply requiring common courtesy and fairness instead of pandering to \"Miss Princess Diva I'm Going to be an Entitled Social Media Influenzer When I Grow Up.\"  What SIL is talking about is not a \"routine\", it's a mindset of selfish entitlement that is going to lead her sons to despise her daughter and her daughter to be shallow, self-centered and very unpopular when she gets older.", "NTA and your comments about her learning entitlement are correct. Kids should learn “being cool”, which is sharing, not whining when things aren’t 100% perfect, and adapting, going with the flow of life. Life will wallop you hard if you don’t learn these basic coping skills. Nice work OP.", "NTA. This isn't even a routine. This is someone trying to instill sexism in their children. Nope nope nope", "NTA\n\nThat's just dumb. She can't possibly expect you to take care of her 3 kids exactly the way she would, upending your own rules and routine to do so.", "NTA\n\nYou are right. She is raising her daughter to be entitled and her sons will resent her for it and will go low to no contact if she doesn't stop making them feel that the daughter is more important. It will also ruin their self confidence as their parents made them to be lower than their little sister. \n\nIf the \"routine\" was so important she would have brought it up but did not. I think your way is the better way.", "NTA but your SIL is if she thinks another household is going to be an exact replica of hers for an entire week of free babysitting.  Different families have different ways of doing things and that is to be expected. It would have been ridiculous of you to contact your SIL while she was on vacation to clarify who gets to get a plate first. Notice how she didn't bother to mention this rule to you before she dropped the kids off?  Because it's dumb and inconsequential.  Be happy you won't be asked to babysit again, it sounds like a no-win situation (and your niece sounds like she's becoming a brat).", "NTA\nDifferent houses have different rules and routines. A 9 year old is old enough to know this and to not always be first. It is strange to teach one child they should always take precedence over their siblings.\n\nThe parents did not tell you their “rules” in advance. If they wanted to make sure they were followed they should have discussed it before leaving their kids with you.", "NTA and good on you guys for showing your husband's nephews that their opinions count, at least for 2 days. Those poor boys!\n\nYour SIL should have explained her strange rules to you at the outset, so you could have had this discussion and refused to look after them at the outset. Your house your rules.\n\nYour husband's relationship with his sister should be strained. Their values don't align and she is ruining her daughter. I'm not saying withdraw, actually he needs to continue having robust conversations with her and challenging her views. \n\nHow did it take so long for you guys to pick up on this or is it a new initiative? Surely this amount of misandry comes out in family gatherings? What does his parents think or are they copping out to keep the peace?", "NTA She went too far the other way", "This reminds me of \"Ladies First,\" from \"Free to be You and Me.\" (Yes, I'm old.)\nNTA\n[Ladies First by Marlo Thomas](https://youtu.be/0NkYlelUUck)", "NTA.  Your house.  Your rules.", "\"AITA for deviating from their routine instead of bringing it up to my SIL first?\"\n\nNo, NTA\n\nIt's not like you're giving Milk to a child that's lactose intolerant, keeping them up past their  bedtime or trying to convert the kids to a new religion.  In your house, everyone waits for their turn.", "NTA, and wow your SIL is full of herself.  I have to guess that she was treated like a princess growing up, which is what got her here.  That's an excellent way to raise an entitled, bratty child who thinks she needs designer brands just because she's her.  When you ask someone to watch your kids, you have to understand that your rules aren't going to be followed (health reasons aside).  They're going to have to adapt to the temporary housing situation.", "NTA\n\nThese children are old enough to handle a temporary change in routine and it's good for them to learn that different households do things differently", "NTA.  There could be a slight debate if you didn't have a child of your own, but you've got your own rules and routines around the house for children and they need to acclimate.  Thr same as if your child stayed at a friends house you would hope he didnt try to force them into his routine.  You were doing them a favor.", "NTA especially because you didn’t even know about this “rule” in the first place. Even if you *had* known, still N T A. Your SIL is setting her sons up to be incels and for her daughter to be spoiled and entitled.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOur niece and nephews(11M, 9F, 8M) were going to stay with us for a week while my husband's sister and her husband went to a wedding out of state and made a vacation out of it. SIL has always gotten parenting inspiration from celebrities and online blogs. The first clue something was off was when our niece came to us and told us that our son (14M) wasn't giving her his Switch to play first. I explained to her that the Switch is his so she had to ask nicely for a turn, and it was up to him to share. When it was time for the 8 and 9 y/o's bathtime I told them to get ready for their baths, our niece shouted \"I'm first!\" and went to get her stuff. At bedtime, I asked them what story they wanted read, and again it was our niece that answered.\n\nThe following day they wanted to watch a show, and I told them to agree on one. Our niece went \"We're watching (show name here)\". I told her that she needed to talk to her brothers to find something all 3 of them agree on. Her response was boys always pick everything so I took that to mean that her brothers often pick and let her put on the show. When it was dinnertime, my husband called everyone to the kitchen and was plating food up for the kids on a first-come, first-serve basis. Our son got in there first and our niece told him that he needed to wait because she and Auntie go first because girls go first. My husband explained that at dinner time dinner is served as you get in the kitchen or take turns so no one goes first all the time. Bathtime and bedtime story was the same thing- she wanted to go first and pick first, so I told her since she got to go first with both the night prior, one of her brothers got to go first that night. She said that she was supposed to go first because 'girls first' and that's how their parents do it.\n\nHere's where I may be an ahole- I explained to her that in our house, we share and we take turns. That's how things went for the next two days until their parents called and she told my SIL that we weren't following the rules. I talked to SIL and she was upset that I changed the kids' routine without talking to her about it first because she was just trying to provide an environment for her daughter where she would take precedence. I told SIL she never mentioned these 'rules and routines' when she asked us to keep the kids and even if she had, I wouldn't have agreed to them since they would, and have, impacted my own child. I also told her she's not providing an environment to make her daughter feel valued and special, she's raising her to be entitled and being unfair to her sons. The following day my husband's parents showed up to pick up the kids and since then, his relationship with his sister has been strained. AITA for deviating from their routine instead of bringing it up to my SIL first?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Anybody that's taking my kids so I can vacation for a week can parent them as they wish (minus obvious things).", "NTA. The routine sounds ridiculous and SIL did not mention it ahead of time. Did she really expect you to just follow what a 9 year old said?", "NTA. When she complains tell her rational non-sexist people make the rules at your house. If she doesn’t like it, tough titties.", "NTA \n\nSimply because your SIL didn't discuss her \"rules\" prior to you watching her children.\n\nHouseholds are different. If your SIL's policies are critical. She should have mentioned them. If she had actually done that. Personally, I would have gently informed her that, \"We don't do things that way in our home. I will understand if you want to make other arrangements for your children, but we aren't going to disrupt our routine to do that\".", "NTA. I do agree that boys really need to be raised to respect girls... but the way she's trying to do it will create a monster", "NTA\n\nGirls don't always get to go first  If your SIL is teaching her kids that, she is setting them all up for failure.\n\nGood for you for taking turns and enforcing it. \n\nI'm sorry your In-Laws decided to show up and ruin things", "NTA\n\n&#x200B;\n\nYou handled that well.", "NTA", "I'm willing to accept, theoretically, that this method could be done well.\n\nBut it seems from the post that the niece is already struggling with a fairly standard case of \"spoiled\" instead of achieving some breakthrough in gender relations.", "I dunno some people over correct .‘you’d be surprised at how many women have grown up in houses where they were second class citezens . Doesn’ make the sister correct but ican see how it came about especially  in certain cultures and corners of the world", "“Influenzer” is so appropriate!  Social media can be such a disease. :-)", "Reverse sexism is still sexism.", "The closest explanation I got for why she didn't mention it was that her kids knew the rules, and she didn't think our 14 year old would eat dinner with the family at that age so it wouldn't be an issue.", "I've been wracking my brain for the past few weeks since it's happened to think of things I overlooked. At family gatherings it hasn't been blatantly obvious, or at least the *why* aspect of it hasn't been. I always thought the boys were just introverted or not in a rush because they've always just waited after their sister for SIL to make their plates at gatherings in recent years. Niece has her toys at my in-laws and SIL's place, the boys have theirs, and I've never been privy to their bedtime routines before. SIL said she started to implement it after reading about some celebrities doing the same thing to encourage their daughters.\n\nHis parents think she's just raising her sons to be gentlemen.", "Oh gods lol Thankfully niece isn't that kind of obnoxious but I do fear she could wind up that way.", "That is a bizarre explanation. Regardless, your house your rules when it comes to such minor issues.", "Why would she think your kid wouldn't eat with his family? That makes no sense. Does she expect him to buy and make his own food or something... Honestly that kind of worrying about how her son's will treated in a few years.", "But she's not 'encouraging' her daughter, she is teaching her to be a brat. Why do her sons always have to cater to the daughter? It might work now but when the eldest son becomes a teenager, all bets are off. He might not be so willing to let 'Miss Ladies First' have her way all the time.\n\nAnd most 'celebrities' are either not raising their children themselves or going to extreme ends to raise them. It's rare that you hear about children of famous people who are actually normal and down to earth (and I do hope that she means real celebrities and not social influencers who are known to lie). The problem with this kind of childrearing policy is that it can have lasting effects on the siblings. The boys are not going to want to have anything to do with her when they are grown and the girl will not understand why her wants aren't being  put first by anyone outside her family.", "\"And so she was. And mighty tasty, too!\" The whole film is g-rated. A good thing to have playing when next you babysit...", "No she expected that he would be a moody teenager and eat whenever he wanted and take his food to his room. Apparently thats what all the teenagers she knows of does.", "I might if there's ever a next time. I'm hoping she relaxes and stops keeping her distance soon, it's been almost 3 weeks.", "That's crazy! Plus she thought a 'moody teenager' would just hand over his switch the moment his cousin demanded it?  No way\n\nYour SIL needs a healthy dose of reality", "Your SIL might actually like it. It is a very family-friendly, feminist film from the 1970s.", "NTA those poor boys, she is insinuating that her sons aren’t as important wow.", "NTA. First, You’re not expected to know her household routine without ever being told. Second, you’re allowed to express your disagreement as the other parents involved when their lifestyle impacts your child. Third, You also have every right to point out that you will not follow their routine in your own home, when their children are the guests. You’re the adults in your home and your household rules apply as long as everyone is safe and provided for.", "NTA. They are creating an entitled and spoiled child. Their sons are going to go low to no contact with them, especially their sister in the future.", "NTA. Your in-laws are being absolute jerks to their kids. They won't raise healthy daughters OR sons this way. And how were you to know they had such idiotic parenting ideas?", "Jesus, those poor kids. Your in laws won’t have to wonder why their sons don’t call them in the future. Also they have a hell of a storm coming once the monster in the making hits puberty. If they come crying to you because their daughter doesn’t listen to them and does what she wants, feel free to laugh at them", "You're NTA. On the bright side, she won't be asking you to mind her spawn again! 🤣", "NTA first it's your house and these \"rules\" have no impact on safety or health so they don't really matter in the grand scheme of things. Second she didn't mention them, and third it's exactly going to create an entitled princess brat of an adult in your niece. Ick. You can't change how they want to parent but you didn't do anything wrong in your home either.", "NTA\n\nYour SIL has every right to raise her daughter the way she thinks is right. But in your home you have the same right. I think I would tell your SIL, here in the real world...", "NTA your sil is an asshole raising an asshole. I just want to see their faces when the real world inevitably crushes her.", "NTA, your house, your rules.", "NTA\n\nSIL should have told you ahead of time. Personally, I'm a little floored that people ask you to babysit for a week and then complain over routines that don't involve serious things like medication, etc. The kids aren't home. Of course the routine will change - and I think that's a healthy thing for kids to learn. Not everyone does everything the same and that's okay.\n\nAlso agree with OP. Daughter is getting the wrong message out of her routine.", "[removed]", " NTA", "NTA.  Does your SIL know that her daughter *demanded* to play with your son's switch first and then tried to get him in trouble when he didn't let her?  SIL needs to change her parenting style because she's putting her daughter on a path to not have many friends as she gets older.  No one is going to want someone with the attitude that she has right now, as a friend.\n\nShe needs to explain to her daughter that this rule only applies to their house, no one else is going to follow it.  She and her daughter should also apologize to your son.  Niece had no right to demand first use of his property and then try to get him in trouble when she was told \"No.\"  \n\nMy sister taught her son's \"ladies and guests get served dessert first.  The only exception is if it is your birthday then you get the first piece of cake.\"  Her youngest used to demand being given dessert first and would throw a fit if that didn't happen.  He got in trouble with his mother when he threw a fit and almost destroyed my birthday cake (his dad grabbed him around the waist and hauled him away, he was 4 and is now 6).", "Oh do fuck off. How was that not being civil, I was just being sussinct. There's fuck all you can do. I have many accounts. And yes I understand the irony of this statement.", "NTA\n\n\n\"Ladies/girls first\" should be taught to your sons, from a chivalry perspective, not to your daughters as a right/privilege. Daughters should be taught to be polite and humble if offered the first serving/opportunity IMO.", "At least hopefully the nephews will remember which family they can turn to when they go no contact in high school.\n\nNTA This has nothing to do with celebrity style parenting - it's just good ol fashioned favoritism.", "This is it.   \n\n\nWhen in Rome…", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yes, I did let her know that she demanded my son's Switch and thought she was entitled to play with it first or at her whim. She apologized and insisted that she taught her that she can't just have other people's things and the rule was a family rule. My take is either that's smoke out her butt, she didn't have the foresight to define family properly, or her daughter is already on the path to feeling entitled to what boys have when she wants it because she has asked politely and properly to play with her female cousins' things.", "I am not. I don't see any way raising one child to \"take precedence\" over the others in this modern era can be done well.", "Wtf \n\nWhy wouldnt a 14 yo eat with his  parents ? She sounds unhinged. NTA. I hope your husband doesnt resent you.\n\nJust wait a few years, we ll see your SIL in offmychest saying \"my daughter cant do shit and is a spoiled entitled woman and i dont understand\" or in AITA with \" AITA for expecting my SIL to take care of our daughter who is spoilt  to teach her life lessons?\"", "errr, I could be wrong, but this isn't what \"Ladies first\" actually means etiquette-wise, and outside that context, she's not going to raise 'gentlemen'...whether she means to or not, it's more of a weird golden child scenario.\n\nNTA, by the way.", "In the conversation we had, she says that her daughter is going to grow up in a world where she's always second to, and put behind men just because she's a woman, and she wants all 3 of her kids to know this. That is why she wants to raise them to know that girls go first in their household because of this. She got the idea from Mila Kunis and Ashton Kutcher I think? She names off various celebrities and bloggers that raise their kids, supposedly, with this kind of stuff.\n\nThere are so many better ways of raising them to get the same message across that doesn't put one child on a pedestal above the others.", "Well tbf, with how obnoxiously she's raising your niece, her teenage sons may very well behave this way when they reach 14. NTA, mom of 3 girls.... Girls go first doesn't even work for us!!!", "Yeah my teens are not allowed to take their dinners to their rooms. You eat with the family or you don’t eat, unless there is an extenuating circumstance.", "Stick to your guns here OP. They probably won't ever come back to your house again, but if you ever see them at a family gathering then make sure you stick up for your son when he's expected to give up his possessions in the name of gallantry. \n\nYou can agree to disagree with them and still get along. I've had to bite my lip for years about my brothers' unschooling of their own children.  What's important is that you and your husband agree and that you have a discussion with your son about the limitations of their approach and that he can be a gentleman to his cousin without being a doormat.", "NTA. Your house, your rules. You are also correct that she is raising her daughter to be entitled, but unsolicited feedback on parenting never goes well, so I'm not surprised the relationship is strained. You could apologize for that part, but it's probably best she not leave her kids at your house again.", "NTA", "NTA this isn't a routine this is just your sister being obvious the daughter is her favorite. You can teach your daughters to stand up for themselves and that they want matters without telling your two other kids they don't matter. \n\nWhat shit parenting.", "Nta - your SIL has some serious issues regarding gender", "NTA. Your house, your rules. The daughter is going to be an absolute nightmare later in life. Though it already sounds like a bad dream. Favoritism is going to negatively affect all the children. All you can do is cut them out of your life.", "NTA, damn raising a spoiled rotten \"princess\" is going to bite them in the asses when she hits the teenage years. \n\nThe boys will move out and go no contact and they will be raising the \"princess's\" children.", "NTA\n\nIt will come back to bite them in the ass royally in just a few years", "NTA - that is incredibly twisted.  Those kids are all going to grow up so fucked up/", "NTA you were nice enough to watch their three children for an entire week, and she's whining that you didn't let her daughter do whatever she wanted and control everyone in the house?  That's entitlement, not a routine - you breaking a routine would be saying \"Nah,  you don't have to brush your teeth, and you can go to bed whenever you want!\"", "NTA\n\nYour house, your rules. You are right, they are raising her to feel entitled. She already does. It's not at all fair to the boys. Everyone should take turns.", "NTA.  Op should not have been put into that position without previous clarity.", "NTA, if it was a deal breaker for her she should have been clear about it before leaving her kids with you.", "Your house, your rules, your routines.  SIL is a batty one.  NTA", "NTA. This isn’t a schedule or routine, it’s a ridiculous house rule - for someone else’s house. And one that she didn’t even mention to you! Your house, your (very fair) rules. How were you supposed to know this was a “rule” and not just a kid that needed to be told that other people matter, too. Your niece needed to hear that from someone, I’m glad it was you, saying it kindly to a child you love, rather than all of the ways she’s going to hear it from others going forward. I feel bad for her and for her brothers. 😔 Good for you sticking up for your children. I hope your SIL gets over this soon, she was incredibly out of bounds.", "NTA.  there is a social structure of *ladies first*.  This ain’t it.  The world is not girls first. Nor should it be girls second.  Taking turns is the way. I can’t believe a parent is teaching a child that she’s always first!  Most important job ever, your nut job SIL failed and is raising a child who will have no friends and become an adult no one wants to be around.", "It’s a very Angelica-from-Rugratz brand of “girl power” that is actually just raising a bully lol jfc 🙄", "Omg samesies!", "And without even telling OP about this INSANE rule!!", ">  I have to guess that she was treated like a princess growing up, which is what got her here\n\nAlso possible she was disregarded in favor of her brother.", "Boys need to be raised to respect girls and boys. Girls need to be raised to respect girls and boys. \n\nEveryone needs to be raised to respect everyone else.", "I haven't thought about Rugrats and Angelica in years, but you're absolutely right.", "My heart is BROKEN for her sons. 😭", ">She apologized and insisted that she taught her that she can't just have other people's things and the rule was a family rule.\n\nShe probably only told her *once* that the rule was a \"family only rule\" and also failed to define what she meant by \"family.\"  She should have repeated to redundancy that the rule only applied to their house and not anyone else's until her daughter responded with \"I get it, this rule is only for our house.  Can you please stop reminding me.\"\n\n>because she has asked politely and properly to play with her female cousins' things.\n\nOr she assumes that the rule applies to all girls, so she needs to ask other girls for permission first.  It's just boys whom she can demand their things because \"I'm a girl, and ladies first.\"\n\nShe's heading down a path where a boy could get physical with her because they've been taught that it is okay to get physical to protect their stuff from someone trying to take it.  SIL didn't think the consequences through.", "This sounds like a self fulfilling prophecy to me; you SIL is royally screwing up her children. I’m baffled as to why her husband thinks this is ok. Hopefully you and your husband can be a resource for the nephews in the future, it seems like they will need it.", "Def NTA. There's a way to teach and promote gender equality and this ain't it. Her daughter is only learning how to be a self centered jerk.", "NTA - regardless of what i think of your SILs parenting methods, she didn’t tell you about this supposed sacred routine.", "What in the actual fuck? Sil is raising a child that’s going to be so unprepared for life because she will not  be allowed to “go first” because she’s a girl. I feel sorry for the boys growing up being stymied by these “rules” she’s teaching the boys to be door mats (like her husband seems to be) to women.", "NTA. I was ready with a YTA based on the title, because routines are important, but this isn’t routines at all—it’s house rules. Your SIL needs to read a dictionary instead of a blog.\n\nWe have certain actual routines for our daughter around baths and sleeping and meals, for example, and we ask that people maintain that when they watch her overnight because she’s two and needs routine. BUT we are clear that the house rules we follow are set by whose house we’re in. If Grammy doesn’t want you touching that at her house, hands off.\n\nSIL can’t expect you to run your home her way just because her kids are there.\n\nAnd, fwiw, I’d be just fine with your house rules if you wete babysitting my kid.", "NTA - Good Grief . . . your house your rules. Their daughter will be sadly disappointed in life where women don't always get to be first . . .  I wonder what happens in school? Is their rule for girls first a rule at the school too?", "NTA. How unfair are the brothers gonna be treated in the future, i can imagine if the sil takes it too far, she will raise an annoyance of a girl and th2 boys could be frustrated, shy and introverted and think they are worth lesser or something like that. And yeah, your house, your rules!", "Does your SIL have a low IQ?  This is crazy in 2023!!! How on earth does everyone's school day go? I'm surprised the princess isn't getting bullies or ostracized by the other students.", "NTA\n\nYour house your rules. And your rules weren’t causing any harm to anyone. You weren’t ignoring their health or their care.\n\nMy mom pulled lower key versions of this. Part of the reason my sister are bat shit crazy.", "NTA - your SIL is unhinged and creating a monster. But on the bright side she will not ship 3 kids off to you for a week again!", "NTA and I'm worried for all those kids. Sons might end up resenting women, daughter might mess with the wrong man. Just all around awful way to raise kids", "NTA. I'm taking your SIL's whole \"My approach to parenting is to make my daughter feel entitled and make my sons feel like crap\" thing out of it. I've told my friends this before I've done (free) kid sitting for them. If you come back and your kid is alive, I've done my job. If you come back and your kids have no significant injuries, I've done a good job. If you come back and your kids have eaten three times a day and gotten some sleep, I AM THE BEST KID SITTER IN THE WORLD. Anything beyond that? Anything like, \"Susie only eats vegan and must go to bed at 8.30, NEVER 8.45,\" is really beyond my remit. Hire a professional babysitter if you have specific rules that need to be followed this closely.", "I'd say that the less you see of that SIL asshole the better. It is perfectly ok to allow assholes to not like you, even family. You are 100% right and she is 100% wrong. Unless she is going to apologize or alter her position, she can go fuck herself.", "This is just ridiculous. My husband is very old school Southern gentleman. When we go out to eat he always says \"ladies first\" and me and my daughter order and then him and our son. My daughter and I are always gracious, not bossy about it.  What the SIL is doing is next level dangerous. Its going to raise a brat!! Manners were invented to unite, not divide. **NTA**", "NTA -this is bizarre. All she is doing is creating an entitled daughter and potentially resentful sons. It’s not teaching the boys to value and respect women, but you making a stand and requiring your niece to share probably made an impact on your nephews. Your SIL does not get to dictate the rules in your house, particularly since it would impact your son. SIL is a huge asshole and her sons are going to grow up hating her and your niece.", "NTA. Your SIL is not only sexist, but also doing a huge disservice to her daughter. What the heck is this kid going to do when she has to wait at a medical office or in line at the grocery store?", "[removed]", "NTA, that's the most ridiculous version of 'parenting' I've heard of. In the end it will make females spoiled and entitled, while the boys are always forced to be last and never get what they'd prefer!", "From the title alone prepared for Y but clearly it is NTA Seriously this is ridiculous. Especially if they didn't tell you.", "NTA SIL is blatantly sexist and I feel bad for her sons. \nAlso the kid will be a nightmare so maybe don’t look after her anymore", "NTA.  Your SIL didn't do her homework.  Somehow she simply assumed you would read her mind and blindly follow her in-home procedures.  Of course you followed your own practices in your own home.  That is what adults do.  By keeping her distance, she is doing your family a favor.", " NTA.\n\nShe's doing everybody a disservice. \n\nShe's delegitimizing her son's choices, personalities, and property.\n\nThe girls go first motif also often comes with more insidious undertones that will be terrible for her as she gets older.\n\nThat such things would've impacted your child is a huge issue that she should've known wouldn't fly.", "Not just the daughter, what a crazy way to raise their sons!!!\n\nNTA", "Also SIL is this even the real reason, or is it SIL just playing favorites or trying to compensate for own feelings of powerlessness.  Either way, shudder.\n\nAlso, niece complains that your house doesn't do things exactly how their house does and SIL's response is too scold YOU instead of just saying \"every house if different.\"", "\"Influenzer\" deserves an award. 🏆🏆💰💰", "I feel sorry for the nephews that have no say at all in anything, like they dont even exist. Can't tell me they shouldn't be going to counselung because they're going to have problems growing up in that atmosphere.", "This is one of our concerns: the boys will grow up to have their kindness taken advantage of by the wrong kind of woman. Her husband goes along with it and lets her set the tone for parenting, which is fine if that's the life he wants but I personally feel he needs to advocate for all of his children so they are better prepared for life and teach them that relationships and treatment aren't one-size-fits-all.", "According to SIL she has told her daughter that the rules are only for family. She does act normal with her female cousins at bigger family gatherings.", "They are already quiet, and were quiet when they were with us. I've always figured they were shy or introverted but now I'm stuck worrying if it's because of her putting their daughter on a pedestal.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "That’s exactly what popped into my mind. Crazy", "Thank you!  I wish I could claim original credit, but I wouldn't dare.  I just thought it was so good that I wanted to see it gain popularity.", "She definitely was not disregarded in favor of my husband, neither her nor their sister.  The whole reason the in-laws showed up was that she wanted them to take the kids so they'd have their rules maintained.", "Seen too many movies. All teenagers are the same there, more or less", "If she’s raising one kid to take precedence over the other two I’m guessing she’s gonna end up with at least one moody teenager", "Can you talk to her boys and see how they feel? Someone really needs to intervene in that household...", "Oh you mean the same famous idiots who boast about not bathing their kids and refusing to give them an inheritance?", "I would talk to our nephews about it, as I stated, before I never really thought much about some things but now I am. The boys have always been quiet and I thought it was because they were shy or introverted, but now we're worried that it might be over how SIL is raising the three of them. I can't imagine that constantly being second is good for anyone. I will talk to my husband more about when we see the kids again whenever she stops being mad at us.", "NTA. Quite aside from this approach not seeming to do much other than make your niece feel entitled — including to your son’s own property — these rules were never explained to you by the parents, in advance. Any unusual rules need to have been explained to you ahead of time, so that you were getting the information straight from the parents and could choose whether they were rules you were comfortable enforcing. Instead you were apparently supposed to take instructions from a demanding 9yo, and couldn’t back out from taking care of the kids.\n\nNo advance instructions means they’re agreeing with you parenting your way. Your way seems like a fine way. And you’re right, they don’t get to set rules that affect your own child in your own home.", "NTA. They got free childcare for a week, did not set the rules ahead of time, and now are upset that you didn't guess how they wanted you to behave? Your SIL could show little more gratitude. And next time let them take their kids to the wedding/vacation or pay for a nanny.", "NTA. Your sister in law didn't tell you this beforehand. It's not her house, not her rules. She can be mad all she wants. Let her. People need to learn to they can't get their way all the time and can be disappointed.", "Nta, I know we're all worried about your niece, but what about your nephews? Are they going to grow up resentful with the belief that there is no inequality because \"women get everything\" as misogynists like to preach? Or will they allow their girlfriends to be controlling towards them and make all the decisions because they've been taught that it's normal? Your sister isn't teaching feminism and equality. She's teaching that women are better and men are inferior and it's going to mess up all the kids.", "NTA.\n\nBut, why are so many adults playing into this delusional woman's beliefs? Why is her husband allowing, and actively treating his sons this way, why is your husband's parents allowing, and actively treating their grandsons this way? Has your brother told his sister the damage she's doing by neglecting her sons? Has he asked  why his parents allow it? I would be rethinking their relationship with my child, if they are all ok with neglecting the other two boys. What is wrong with them all. How do they accept it? \n\nEveryone who allows the unfair treatment of the boys to continue\n A T A s. I would forward these replies to every adult that is letting those boys down, with an email telling them they're all abusive and suck.", "NTA. She had undisclosed rules she never stated then was upset when they were not adhered to and they’re getting (presumably free) childcare for a week and get upset that upon learning of rules you don’t agree to, you decline to acquiesce.", ">because she was just trying to provide an environment for her daughter where she would take precedence\n\nHoly cow is she doing to raise an entitled and spoilt brat of a human...", "NTA.\n\nBut, why are so many adults playing into this delusional woman's beliefs? Why is her husband allowing, and actively treating his sons this way, why is your husband's parents allowing, and actively treating their grandsons this way? Has your brother told his sister the damage she's doing by neglecting her sons? Has he asked  why his parents allow it? I would be rethinking their relationship with my child, if they are all ok with neglecting the other two boys. What is wrong with them all. How do they accept it? \n\nEveryone who allows the unfair treatment of the boys to continue\n A T A s. I would forward these replies to every adult that is letting those boys down, with an email telling them they're all abusive and suck.", "NTA.. SIL needs to be told to chill, and that you are not on board with her silly sexist games.", "Shes raising her daughter to be entitled and teaching her sons to either be mistreated by women or resent them. I mean this is harmful. Its honestly dangerous.  This is how Ed Kemper became a serial killer. Seriously. NTA. She's making seriously harmful mistakes.", "Hahahahahahsha! SIL must be having a laugh! Did she give you their routine before they left? Even if she did, your house your rules.  I have a very different parenting style than my sister.  When her kids are with me, we follow my rules.  I’m more like you, my sis… that’s another post! \n\nNTA. Your niece hopefully will grow up to be a well adjusted person with expectations based on reality.", "And there is nothing wrong with learning that there are different rules in different houses.", "I'm SO glad I wasn't the only one thinking of this.", "🏆🥇🥇", "Honestly I bet that this is a nice vacation for them actually getting a say in movies and getting dinner first.", ">I'm willing to accept, theoretically, that this method could be done well.\n\nHonestly I'm struggling to see this, when SIL says:\n\n>she was just trying to provide an environment for her daughter where she would take precedence.", "The problem with that culture is that there are first and second class citizens at all, not *who* the second class citizens are.", "Oh for sure. All there kids are getting a terrible example of how healthy relationships go and are being set up for failure in life.", ">His parents think she's just raising her sons to be gentlemen.\n\nThis is not what raising boys to be gentlemen looks like. My grandma had a big part in raising my two little cousins (boy and girl) and while the boy was expected to open doors for us girls, we were also expected to be polite say thank you when he did. In all other ways he and his sister were treated equally; the girl is now a strong young woman and the boy is happily married to a woman who appreciates the fact that he steps up and does half the housework and child-rearing (no babysitting father here!). \n\nSIL is teaching her daughter to be a tyrant and her sons to be doormats. I don't see that going well for any of them.", "Of course it's because the daughter is being put on a pedestal. Do you have any idea what it's like to be neglected like this? They already realise at such young ages that their voice means nothing, and have already started to stop voicing their opinions, wants, and needs. I can't believe how many adults are ok with sitting by, and allowing these boys to spend their childhood ignored, and  neglected.\n\nWill any of you care enough if one of them starts to self harm, or gets so depressed they contemplate suicide? Anyone going to step in before they become so anxious they can't function.", ">Nope, that will be husband not SIL making that complaint--SIL will still be defending her precious daughter.    \n>  \n>Or we'll be hearing from the sons.", "Ah.  that had actually registered at one point but I'd lost the plot.  Thanks for the reminder!", "That sounds like a recipe for turning her sons into misogynists, actually. They’re going to be looking forward to getting out into a world where they don’t have to always do what their sister demands. \n\nEveryone wants to be shown that they matter, that they are valued. If they don’t get that at home, they’ll go looking for it somewhere else.\n\nSwing that pendulum too far back, and it’ll swing forward sharply just as soon as it’s let go."]}