{"id": 8437, "submission_id": "10mqaia", "title": "WIBTA for offering my son meat; he has been a vegetarian so far because his dad is a vegetarian but I am not and we are separating.", "selftext": "My ex-husband has been a vegetarian for 20+ years and when we had a kid he asked if we could raise him as a vegetarian. I agreed with some conditions (eg not reading labels to check for animal products, broth and fish ok, and if he wants to eat meat when he is older it will be his choice). Our son is 3. We also have a 4 month old baby. \n\nWe are separating. The separation is very amicable and we are good friends and want to prioritize a good coparenting relationship. I would like to offer my son meat for a few reasons but I definitely don’t want to be an asshole. Here are my reasons for wanting to offer meat:\n\nI am not a vegetarian and would like to be able to make non vegetarian meals without having to cook separate foods for my son. \n\nMy family is not vegetarian and it is extra work for them to make vegetarian options/for me to bring something separate for my son.\n\nMy son has no preference for eating meat vs not.\n\nI have been responsible for making sure he gets enough iron and it is easier with meat options \n\nWIBTA for going back on our agreement to raise our son as a vegetarian?", "created_utc": 1674839868, "permalink": "/r/AmItheAsshole/comments/10mqaia/wibta_for_offering_my_son_meat_he_has_been_a/", "score": 54, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I want to take that might make me an asshole is offering my son meat to eat after agreeing he would be raised vegetarian. This might be an asshole move because we had previously agreed on it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YWBTA if you do it without discussing with your soon ex spouse.\nJust state you will let the kid choose but once you have your separate house you won't be as strict on the rules as it would be unnecessarily difficult on you yourself.\n\nNAH if you discuss this nicely with your ex and let your kid decide himself. Maybe try it the first time when you have your own household and first time custody by yourself.", "You;re setting yourself up for trouble with co-parenting in my opinion especially if you don't speak to your ex about it first. NAH yet but could easily go that way.", "I think this is something to discuss with your ex.\n\nBut one thing to note, start out slow! Your son has never had meat and does not have the enzymes to properly digest it. He likely will get sick very easily from meat.", "NAH\n\nBut I'd say give it time. Get coparenting off right. Don't make waves if you don't have to. Keep everything the same for a bit and then gently approach the idea and go slowly. And always always be respectful and have your child respect his ways at dad's house.", "INFO: when you made the initial agreement, how old were you expecting your son to be when he could start choosing for himself?", "NTA.  It is a bad agreement to begin with for a child.  When he's older, he can make his own decisions.  And even if you agreed to this at one point, you have the right to change your mind, especially when you become the sole caretaker.  You shouldn't have to cook multiple means for everyone, or cater to the whims of an adult who isn't there.\n\nAnd you don't have to list any reasons other than \"I don't feel like it.\"  NTA", "Have you discussed this with your ex? Rn there's no interpersonal conflict to judge, as he may agree with you.", "NAH - I would give my ex a heads-up that the kids may eat meat while they're with you, but I tend to over-communicate with my ex.", "NTA but remember to slowly integrate meat into his diet if he’s never had any before", "If feeding your kids vegetarian is not terms of your divorce or custody.... Feed them whatever you want when they are with you. \n\nAgreements in marriage died with the marriage, You're not obligated to pacify your ex, although it might make some waves in co-parenting. \n\nI'm sure it's a pain making two separate meals, as a single mother you have a lot more important things to worry about than vegetarianism. Nta", "NAH.\n\nIf your relationship is good, can you ask if he’d be open to revisiting the agreement outlining what you’ve mentioned here? Your ex isn’t wrong for his preference but neither are you. And you’ve given no indication in your post that he’d be anything but reasonable. Why not ask him if you can discuss?", "NTA for offering him meat. You would only be the asshole if you pushed meat on him or have no alternatives if he does not want the meat. For example say your making Hamburgers if wants one, and if he says no have a veggie burger available. Etc. No pressure. Just options.", "NTA  your ex cannot dictate what you eat in your separate, own household. Live your life OP, sounds like you’re on track with good nutrition knowledge with you and your son’s meal planning!", "NTA. If things truly are amicable, I think this is reasonable to explain to your ex. The kid will still have vegetarian meals at dad's house and if when he gets older he chooses to be a full vegetarian I hope you would then accommodate some vegetarian meals, but since he's only 3 and it doesn't fit into your life style and the kid doesn't have a preference, this seems very reasonable", "Your ex most definitely will think you're the AH.  But, you aren't together anymore and I feel like, at this point you should both be able to feed what you want.  At some point in life your son can decide what he wants because he will have seen all the options.  \n\nIn general you have to be on the same page with values and whatnot, and I know there is a value attached to being a vegetarian, but now that you aren't together he can't really expect you to live that life.  I think.  Awful answer, sorry.  NAH.", "NTA\n\nSon can change his mind later on, no one is born a vegetarian.\n\nThough this amicable separation might become one that isn't. If I were you I would at least tell about this to his father since he will find out one day anyway.", "NTA\n\nIf your kid chooses to not eat meat, then fine, but if he’s cool with meat and you’re cool with meat, then go for it. Your ex-husband no longer has any say in what you feed your kid unless you’re not providing enough nutrition or something.", "NTA.\n\nIm a vegetarian just like your husband but I genuinely think it's not only your husbands decision but also yours and your sons. Your son is 3 so I do think he is old enough to decide if he likes certain foods or not. Maybe compromise with your husband by telling your son what meat is before trying it aka explaining to your son in a child friendly way that meat = animal. Maybe make some dishes were the meat is served separately and ask your son if he wants to try the meat first. However if your husband is unwilling to compromise I wouldn't worry about your husbands opinion too much as long as you're still making healthy meals (which i think you probably are).\n\nBut please for your sons health try to slowly introduce the meat to your sons diet as his body is not used to meat. I've been a vegetarian for a few years now and I had meat once or twice in that time and it did make me feel sick. It definitely wasnt the taste as I have always liked the taste of meat and am just vegetarian for animal reasons. I don't know what it was that made me sick but I have vegetarian friends who have similar experiences. \n\nDefinitely do also talk to your childs doctor about this as well just to make sure that his body can handle the change in his diet as his body has never digested meat before.", "NTA\nThe agreement was that you would raise him as vegetarian together.\n\nThat part of the arrangement is already broken.", "NTA. \n\nIf the kid likes meat then woohoo, if they don’t then no big deal. The only blowback you’re likely to get is from your ex so be ready for that.", "Why don’t you try talking to you ex? \n\nIt doesn’t matter what anyone on here says. You say you want to continue to have a good coparenting relationship- that won’t happen by making these choices based on what an Internet forum tells you. That happens by discussing these matters with your ex.", "NTA. Your son doesn’t understand why his dad wants him to be a vegetarian. It’s not like your ex husband is doing this to instill a religion in him. I get not eating meat is a culture in itself but I don’t think it would hurt for your son to be exposed to different ways and make a decision for himself when he is more mature. Perhaps you and your ex husband can continue to co-parent and teach your son to be respectful of dietary differences in your homes and be flexible with change. I think going with the flow is a valuable skill for a young child to learn.", "If you are separating, you do you.\n\nYou can offer what you want as long as he isn't allergic.\nBut respect his wishes.\n\nNTA\n\nEdut: saw the ages now... it is hard to feed young kids everything they need on a vegetarian diet.\nYou are the opposite of A here.", "NAH. Please just make sure to make the change in diet slow for your son.", "NTA, your kid should be able to choose what they would like to eat.", "NTA.\n\nWhen you're married and raising a child, you rightly assume that you will go on being married and raising the child together.  And part of that is having a similar approach to parenting, including diet.  You agreed to raise your son vegetarian to appease your husband.  So of course you didn't add to your caveats \"and assuming we don't divorce.\"  \n\nBut the fact is, people do divorce for a variety of reasons, including a difference in parenting style.  It's not reasonable to expect you to continue to bend to his preferences after you divorce.", "NTA look if it someone’s option to go fucking vegetarian than it’s also your option to eat meat. NOT ANYONE ELSES. If he has a problem or shut anyone has a problem with that than he is a hypocrite. Tell him that. Let your son eat meat if he wants", "NAH", "NTA. Your obligation is to feed your children food that provides them with everything they need to be healthy. He can decide if he wants to follow a different diet when he is old enough to that choice (which, to an extent, is up to you).", "There's no dispute unless you ex has objected.", "YWNBTA. You'd be going back on your original agreement to raise your son vegetarian, but you're also going back on your agreement to be married and raise him as a vegetarian together, so I think the situation has changed enough such that this is reasonable.", "[deleted]", "you say he doesn’t mind meat or tofu. but he has never eaten meat so he doesn’t know that. make sure he know where meat comes from so he can make an informed decision. also, since he’s never eaten meat, meat will most likely make him sick", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy ex-husband has been a vegetarian for 20+ years and when we had a kid he asked if we could raise him as a vegetarian. I agreed with some conditions (eg not reading labels to check for animal products, broth and fish ok, and if he wants to eat meat when he is older it will be his choice). Our son is 3. We also have a 4 month old baby. \n\nWe are separating. The separation is very amicable and we are good friends and want to prioritize a good coparenting relationship. I would like to offer my son meat for a few reasons but I definitely don’t want to be an asshole. Here are my reasons for wanting to offer meat:\n\nI am not a vegetarian and would like to be able to make non vegetarian meals without having to cook separate foods for my son. \n\nMy family is not vegetarian and it is extra work for them to make vegetarian options/for me to bring something separate for my son.\n\nMy son has no preference for eating meat vs not.\n\nI have been responsible for making sure he gets enough iron and it is easier with meat options \n\nWIBTA for going back on our agreement to raise our son as a vegetarian?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Have you considered taking your kid to the pediatrician to get his opinion?", "NTA. Feed the kid whatever and when he's old enough to make his own decision, he can let you know what he wants. It's kind of a moot point though - if he's eating fish and animal-product broth, he's not a vegetarian anyway.", "NAH. *Do* discuss it with your ex, but otherwise, the kid is both of yours, and also should be exposed to a variety of food while young for multiple reasons, including preventing allergies and healthy growth. I would calmly explain that you respect his choices and he is free to continue as he has in his home, but now that you are no longer together, you can't adhere to that diet as strictly and require leeway where your kid is concerned. As long as you can both be respectful and his vegetarianism is for personal (ethical/health) reasons rather than cultural/religious practice, I would hope you can come to some compromise until the child can properly articulate their own choices.", "nta. your time, your rules.", "You might want to talk to your doctor first and your ex, the thing is if your son has never had meat before you can do damage by suddenly introducing it. \n\n&#x200B;\n\nNAH unless you just start feeding him meat with no care.", "NTA - different houses, different rules, different menus.\n\nMy ex and co-parent is probably 90% vegetarian, he never cooks meat but will it out. So the kids meals there are mostly vegetarian. I eat it all - my meals will often have meat.\n\nMy kids don't have a preference on being vegetarian. In fact, when my oldest claimed he was vegetarian I switched to a vegetarian diet for my house on his days, which involved a lot more grains and vegetables. His Dad's version of vegetarian is pasta, rice and black beans and cheese quesadillas- pretty much these on repeat basis. Once I incorporated variety of vegetarian food, they wanted to return to my usual menu at my house cause I refused to make the same limited food. I am not okay with such a limited diet and if we are going vegetarian then it will still have variety.", "NTA", "My with is a vegetarian and I am not.  I cook most of the meals.  If we split up she will cook for the kids what she wants and I will cook what I want.  I expect though in your situation a good conversation ahead of time is the right way to go.", "You are very obviously the AH here and it's incredible that you don't see it", "We are raising our daughter vegetarian, and to be fair that is mostly my thing, he's just going along with it. If we separated and he decided to give our daughter meat I would be PISSED.\nEdit: YWBTA", "Yta if u guys were together he would be a vegetarian and now that u and hubby seperated all of a sudden u wanna change that I think ur being vindictive if ur separation is amicable then y all of a sudden then you say couple reasons that are just lazy reasons this sounds all bitter to me", "YWBTA if you didn't talk to your co parent firstly", "I would definitely discuss first and kid is never forced to eat anything.", "I would definitely talk to him first, but am curious about what the general consensus is about whether this is reasonable or not, and I think if I ask my friends they will just say I am right.", "Good point thank you!", "He'll be fine - he's eaten fish and beef/chicken broth (if i understand what OP said correctly).", "I think this is the right path. It is really likely that once the kid gets into school, he will want to try meat and it will resolve itself w/o OP's intervention. \n\nOP just needs to make sure her ex is aware that he is responsible to make sure the kid gets enough protein  while the child is with him. It isn't difficult to do, but it is so important at that age and plenty of people blow this off", "At any point if he expressed interest in trying meat he would be allowed to, but we also tell him “you don’t eat meat”. So I guess when he started to question why he doesn’t or say he wants to anyways (we tell him he is not supposed to do all kinds of things that he pushes back on so if he pushed back on no meat it would be allowed). Does that make sense?", "Good point.", "Yes that’s what I am thinking. I am just hoping for some feedback about whether it’s a dick move because if it is and my ex is uncomfortable I will drop it for now. It’s important to me that I’m not a dick about parenting issues especially early on. I want to set a good tone for coparenting but I also might just want to be able to make chicken or whatever some nights.", "Yes I wouldn’t do it without his dad knowing.", "My son (also raised veggie) recently asked to start eating meat. I said that was fine. And he asked \"do we need to go to the doctor and check? Because I know that when I was in your tummy, he told you I was a vegetarian\". It was so cute. He thinks it's like dinosaurs, some are born meat eaters, some aren't.", "That’s not strictly true. Babies are born vegetarian as all they require at that age is milk. It is the parents choice what they then add to their diet.", "Yes I would definitely talk to him first. I do think it helps to have an idea of whether what I’m asking for is reasonable to a bunch of strangers though- if everyone said this was an asshole move I would not push the issue as much as if it seems reasonable.", "[deleted]", "We go by division of responsibility so we choose what is offered and our son chooses what he eats. Or that’s the ideal goal anyway I do often just make him a grilled cheese or whatever, he is picky (like many 3 year olds)", "At 3?", "I guess it depends what my reasons are. In this case I don’t see being vegetarian as a benefit to my son so much as to my ex. If I was asking for something that was a personal preference and not a benefit to my kids I would be open to discussing it. But I know he feels strongly about it for himself… I am trying to think of a good equivalent to help me put myself in his shoes but it’s a tough one to think of!", "We asked his pediatrician when he was a baby. She said she supports vegetarian/vegan/etc diets in kids but to be mindful of iron intake. He has been healthy as a vegetarian so far and his dr hasn’t raised the issue again aside from asking about his eating in general at well checks (she has also reassured us that it’s normal for kids to be picky and live off goldfish crackers and to keep offering a variety of foods but has no opinion one way or the other about meat specifically)", "how so? things like vegetarianism shouldnt be forced on children as it is. let the kid decide when he is old enough", "I'd love to hear your arguments as to why OP might be the AH here", "I’m literally asking for people to point out if I am being an asshole without realizing it so please point it out but explain why or it isn’t really helpful.", "Why? Is it not HER choice?", "Op wants to change because she would now only be cooking for her son, on top of regular meals.\n\nNta", "It is definitely not coming from a spiteful or vindictive place. Lazy maybe a bit.", "It doesn't sound vindictive to me. It sounds like she wants to eat meat occasionally, and now that she's not constantly being respectful of her partner's eating habits, that's far more of an option.", "I think it's reasonable, as long as you talk to him. Make sure he knows that, as the home setting has changed, you plan on introducing meat. \n\n\nMy husband is a vegetarian while I'm not. His dad was pescatarian while his mom wasn't. My husband was raised eating meat, and he wants to raise our kids eating meat, so they can choose when they are older. But, while our kids eat meat, most meals at home are vegetarian...if we split up, I'd be more likely to cook meat. \n\n\nAlso, I'd make sure you still have some vegetarian meals. Make sure he understands that Daddy doesn't eat meat, and Mommy does, but that other foods are also great. You can make meat a \"sometimes food,\" so if he loves it, it doesn't become a \"I like mommy better because I want chicken nuggets\". Have occasional vegetarian meals.", "NTA. I love this comment, you acknowledged your friends are biased and came for an unbiased view before approaching the topic to make sure it is reasonable. Definitely talk to your ex and see how they feel about it, it sounds like you all compromise fairly well.", "Also be advised it can be rough on your kids GI to make that change suddenly so you’ll need to slowly incorporate.", "NTA Simple as that. It is likely to cause issues with the ex but that's tough shit. You two presumably also had an agreement to stay together forever but look how that worked out. People change. Opinions change. You are not remotely harming your child with what is a totally normal diet for a human.", "You're a single mother now, there's a lot more important things to worry about than pacifying your ex with the kids vegetarianism. Do discuss it with him first, He doesn't have to agree but best not to blindside someone.", "Personally I think yeah wanting to change it is pretty iffy. Yall had an agreement. And it sounds like it's pretty important to the dad. Also it's really not hard to get proper nutrition as a vegetarian even a kid. Or without having to do entirely separate meals. Just saying.", "And of course your friends are more likely to side with you over your ex. lol What a silly statement.", "As someone who did that for the ten years I was vegetarian before I went vegan, no, no he will not.", "3 year olds actually need shockingly little protein and can have those needs pretty easily (at least it was never a big issue based on the foods we would normally eat even without meat) iron on the other hand I really struggle with and often use infant cereal in smoothies and stuff because it is so iron fortified", "It sounds like your son has asked before then? Do you eat meat in front of him?", "Telling him he doesn't eat meat isn't giving him a neutral choice, You're telling him no unless he rebels.", "So you guys basically forced him not to eat meat when he expressed he wants to? Yeah your ex husband is looking more and more bad", "It would only be a dick move if you did it without talking about it. Neither of you should be making unilateral decisions about you child. Feeding you child meat while with you, and your ex sticking with vegetarian on his time is a good compromise, but make sure it is known.", "That is so cute. My son also is extra interested in which dinosaurs eat meat like mom and which don’t like him and dad 😂", "But again, it doesn’t really matter what Redditors think is reasonable. You’re an adult, he’s an adult. \n\nTalk about it like adults.", "Yeah, 3 year olds will definitely not eat things they don’t like. I remember watching my brother throw a bowl of peas across the kitchen a number of times.", "I stopped eating meat when I was 3, the only person in my very Slavic, meat-positive family. It’s been 26 years since that day, and I’m still a vegetarian.", "Why just her's? Because she's the mom? Do father's get no say in how their children are raised?", "She was doing it before for her husband and son and I’m sure made a piece of meat for herself honestly I think she being bitter she even said in her post she wasn’t reading labels or whatever when they made the agreement um she wasn’t concerned bout her husband either so to be honest she wasn’t even down for it from the beginning as well this just makes it a whole lot easier for her to do what she wants if she not being bitter they say opposites attract but some things u have to have in common in a relationship", "Y do they have to be together for her to respect his wishes they agreed on it when they was together she could still eat meat but he asked if they son could be vegetarian it should still be even if they not", "Thank you!", "If it's important to the dad, he can not serve meat. But that doesn't mean the kid has to follow. He's 3, old enough to say what he wants to eat.", "I’m saying I am asking strangers because I don’t think my friends would be objective.", "Isn't this exactly why OP is asking kind strangers on here what their opinion would be?", "Why not? He's already been consuming animal protein. I mean, I wouldnt give him a big burger at first, but you don't introduce any new foods to little kids like that.", "I didn't realize. I was thinking about growing kids and muscle growth, etc. I knew iron was an issue, however.", "I do sometimes. He knows mom eats meat and dad and kid don’t. He hasn’t asked why or said he wants to eat meat. I’m trying to think of an example of when we have said “you don’t eat meat”. Like at a party if there is cheese and pepperoni pizza we will say that one has meat and he knows that means he doesn’t eat it. If he said “I want to eat it” we would have had a discussion but he hasn’t. It has never been an issue.", "I agree this is a totally inappropriate way to “give him a choice”, especially as a toddler. The wording will be so confusing for him and he would likely say no to it because he felt like he wasn’t allowed to, even if he was.", "Do you think it’s wrong to raise a kid as a vegetarian? Just curious.", "We were a triceratops family for a long time! You get it!", "No I’m saying is it not your DAUGHTERS choice in what she wants to eat. If she wants to eat meat you’re actually going to say she’s not allowed? That’s wild to me", "Op hasnt said that she was the sole cook for the entire family. I am assuming the husband also helped out which would explain. Also, I can barely read your text walls please for the love of god add commas.", "I would absolutely read labels for my husband. I didn’t want to have to do it if I was making something for my son separately. Example a brand of alphabet soup that uses beef broth- my husband would not eat and when we are out he will ask about ingredients in soups or make sure there isn’t fish sauce in a sheet etc as many vegetarians would. I didn’t want to have to do that for my son- like if we get served vegetable soup somewhere I didn’t want to have to ask. My husband can ask for himself so it was never extra work for me. \n\nUp until now I wouldn’t often make meat for myself I would usually eat a vegetarian meal and then I have some meat snacks like pepperoni sticks or lunch meat and I order meat at restaurants etc. I am starting to do meal plans for just the 2 of us and thinking it would be so nice to just have meat be an option for dinners again. It is truly not a spiteful thing.", "Because now that there are only two people in her home, she shouldn't feel obliged to keep eating vegetarian as often as she did. And when she chooses not to cook veggie she has to cook two separate meals. That's a lot more work.", "I wish more posts were like yours. It would take down the drama of the posts but make for a much nicer world view.", "Meat (especially beef) is a lot heavier on the stomach and more likely to upset it, especially if you aren't used to eating it.", "He is offered fish but often doesn’t eat it. He’s probably had Iike 10 fish sticks in his life and a few bites of salmon cakes.", "As a counterpoint to the other answers you're getting, my partner was raised vegetarian. He also basically had the \"if you want meat and it's around you can have it, but by default you don't eat meat and we won't serve it to you\" rule. He's tried various meats, but he stayed mostly vegetarian.\n\nHe's very grateful that he grew up vegetarian because transitioning to being vegetarian once he started having ethical opinions about it would have been much harder otherwise.", "No I think it’s wrong not to give them a choice though", "There's a vegetarian child at my daughter's kindergarten group. He's about 16-18 mo, I don't think he understands why when the rest of the children are drinking milk or eating something, he has to drink soya milk and eat vegetarian food, different from the rest. He's always angry and trying to \"steal\" the food from the other children. It makes me sad, honestly.\n\nIs it wrong? It's your decision as parents but the truth is that you are not giving him all the options.", "I believe it's about balance more so in their younger years. They need all their different minerals and vitamins. Have you been giving your son additional supplements and vitamins in addition to his vegetarian diet?\n\nI mean vit B12 is hard to come by in a vegetarian diet, and I don't mean they don't get it at all, it's just so much less than when having occasionally red meat. I as a mother would worry about it, i have seen kids who where raised vegetarian with iron and vit B12 deficiency, which caused extreme exhaustion and brain fog, while if they where supplemented with these vitamins and minerals it wouldn't have come to that.\n\nBut once again, younger years it's about balance, the moment they are old enough to speak for themselves you can accommodate to the diet they prefer. For me that age is from 6 years up. My oldest daughter is 13 and for 2 years she didn't eat meat, although she ate eggs, cheese etc. Now she has slowly introduced meat again, but it has always been her choice, not mine bor any other adult in her life.", "I would argue it’s unnatural. Currently pregnant, about to pop. My husband and I are pretty much on a carnivore diet. We eat tons of meat, eggs, dairy gets included, minimal simple vegetables and we don’t eat any processed foods, grains, sugars etc. it’s our preference and it’s how we have learned, as 30 something’s, our bodies feel their best. That said, in no way am I going to force this on our child. I intend on him being exposed to a lot of food and options so as he gets older he can make his own choices. He’ll try meats and dairy, vegetables and fruit, healthy grains. I think the only thing we won’t be giving him is processed junk food. Sweets, fruit snacks, etc. if he has those things later as he grows up, fine, it just won’t be in our home. That said, I don’t think raising your kid vegetarian is wrong I just think you’re not allowing him the option of figuring out what Whole Foods he likes and doesn’t like, and I think kids need meat (my own biased opinion) so I think he’s missing out on a lot of nutrients.", "Yes!!! 🦕 🦖 😂", "My daughter is 15 months old LoL she doesn't have a preference. When she's old enough to make this choices then I don't have a problem with that. This Ladies kid is 3, also not old enough to make that choice.", "I don’t know how to edit 🤦🏻‍♀️ sheet should be curry no idea how it turned into sheet.", "I understand where you are coming from trying to go along wit someone else’s thing is hard trust I go through it wit mine on eating pork I don’t they do on occasion my comment was towards what the story was about u agreed on it when u guys were together but now that u aren’t u want to from my perspective it sounded bitter if it wasn’t I do apologize if you talk to him he def gonna want him to be a vegetarian cuz that’s what he believes ur baby has been one all this time it may make him sick if he changes his diet honestly being a vegetarian not really bad thing wit everything going on wit this chicken epidemic I might consider being one fully", "Oh man I love the drama of AITA! Also how the title is often so misleading. “AITA for kicking a dog?” Turns out it was a stuffed dog blocking the only exit of a burning building 😂", "Well yeah of course, but it's not like he's going from never having eaten animal protein to a sudden onset of it.\n\nI wonder if animal milk proteins are metabolized in the same way? Like if a vegetarian who drank cow milk starts eating meat again, would their body process the meat more easily than a vegan who started eating meat again?", "I second this. I was raised vegetarian but told I ever wanted meat I could eat it but it wouldn’t be bought or prepared for me. I’m really grateful for it. My personal ethics mean I have chosen to stay vegetarian and would be upset at this point to have eaten animals growing up.\n\nIn general, I don’t think the default thinking should be eat meat until you choose not. If eating meat is immoral/unethical then allow your child to make that choice when they’re old enough, not the other way round.", "She said he’s already been asking and expressed interest.. also 3 year olds definitely know what they like and don’t like.", "Lmfao right? I did think yours was gonna be more of a spite thing. I was pleasantly surprised.", "How does a 3 yr old make a huge choice like that? Especially when he's never had it? And doesn't understand the implications of it? Not only that, but if he's never had meat, all of a sudden eating it could make him very sick.", "I go by “parents job to decide what is offered, kids job too decide what to eat” and up until now meat hasn’t been offered. \n\nWhy would you be mad? Because he had agreed to it,  because you think it’s what’s best for your daughter, because the idea of meat grosses you out? Something else?", "Because we made an agreement. I don't eat meat because I hate the idea of eating other living things. If my daughter gets older, truely understands where meat comes from and makes the choice to eat them, THEN it's her choice. If I had been given the choice as a kid then I would have chosen not to eat meat."]}