{"id": 8482, "submission_id": "10n5axa", "title": "AITA for \"hiding my true personality\" by always wearing a wig at work?", "selftext": "So I (F21) recently started working at a corporate job and it's been around 3 months. I started dyeing my hair since last year and I change the color like every two months. However, I have always showed up in my workplace with a long black wig and it doesn't look fake at all since I'm south asian with natural black hair anyway. \n\nThe issue arose when one of my colleagues whom I have become friendlier with added me on my instagram. He saw pictures of me in my   shorter violet colored hair at a concert. When he saw me the next day in person at work he was a bit confused as I had long black hair again. He made a joke like \"you didn't tell me you had a twin sister. was that her on your instagram story last night?\" I replied no that was me and told him I'm wearing a wig right now and I always have at work. \n\nHe asked me why that was necessary and I just said I don't know I think I like to make a certain appearance at work and keep it separate. He said that's way too much work and started gossiping about it with few other coworkers. They said I am going way overboard to hide my true personality. Some of them started calling me Ms. Uptight whenever they see me. I also dress in a more formal style than others so that contributed to the name as well I guess. \n\nI asked them to stop and they only made it worse and more defensive. I guess I could just stop wearing the wig and show up normally but the thing is I really like the way I dress and look at work. Plus I would be out of there in a few months anyway. I sorta regret adding him on my instagram. AITA here?", "created_utc": 1674877720, "permalink": "/r/AmItheAsshole/comments/10n5axa/aita_for_hiding_my_true_personality_by_always/", "score": 3983, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be TA for creating two separate lifestyles at work vs at home or with friends and by continuing to wear the wig everyday\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Report this to HR. You are not obligated to show your \"true personality\" at work. You are allowed to present whatever professional image you want in the office as long as it complies with the dress code. Your co-worker doesn't get to criticize or harass you and drag your other co-workers into doing the same.", "NTA. This dude is being inappropriate and fostering an uncomfortable working environment. I would unfriend him and refuse all interactions with him and his group that isn’t directly related to work. Kill them with professionalism. \n\nAnd document everything. If things escalate you may need to go to your direct supervisor to discuss your work environment.", "NTA\n\nBut also take this as a lesson to be really careful who you add on social media.", "NTA. You are being bullied. You are allowed to define your work/life boundaries however you like. If you prefer to have one look that makes you feel professional for when you’re on the job, and more playful, fluid looks outside of work… who the hell are they to judge? And why do they care? Reeks of jealousy, insecurity, and just meanness. Definitely would Restrict colleague’s account so he doesn’t have so much access. Sucks when somebody has to be hurtful for no reason. I hope they stop being such petty jerks, soon. N-T-A, OP. Not at all.", "NTA. Women wear wigs for all sorts of reasons and keeping a firm boundary between your work self and private self is fine. Deal with their comments for a few more months and don't add coworkers on your Insta next time.", "NTA, but your coworkers are. Block them on your Instagram and take it to HR if they don’t get off your back.", "NTA. Report the little gossip to HR and block them on insta. The way you dress (including your hair) is not for others to dictate.", "NTA There's nothing wrong with dressing/having a certain style for work and a different one for off the clock. And from the way I take your post BOTH styles ARE a part of your personality. Your coworker is the AH for assuming he has any say in how you chose to represent yourself anywhere.", "NTA and this is bullying. you’ve tried approaching them yourself about it to make it stop, if they refuse to drop it and you think it’s worth it (since you’re only there a few more months) take it to your boss. if they don’t do anything about it make a formal complaint to HR. how you dress and style yourself at work vs at home is none of their business as long as you’re dressed appropriately.", "NTA. You’re at work. Work you has black hair.", "Of course you’re NTA. How you choose to present yourself at work vs. in your personal life is completely your business. You sound very put together and professional, something your colleague is clearly lacking.\n\nI would remove him as a friend and report his behavior to HR. If they want to call you “uptight,” lean into it. Mandatory harassment training for all!", "NTA you should dress and appear as what makes you the most comfortable.", "You’re absolutely NTA. You can wear a wig for any reason, especially just for the hell of it. How you express yourself is for you and you only. Why are people such entitled pricks these days?", "NTA\n\nThey were out of line. There are women who wear wigs due to cultural & religious beliefs. Some due to work requirements (like no unnatural hair colors). If it continues file a complaint with HR.", "NTA\n \nThey are participating in petty gossip type activity.", "NTA\n\nI’m so sorry they’re being Aholes, but you have every right to have a professional persona. It’s none of their business. And you’re being harassed. \n\n  \nTalk to HR, or tell these jerks straight up you won’t stand for being harassed. And document (email to yourself) exactly what you say and what they reply.   \n\n\nHope it all turns out okay. But you don’t have to put up with this.", "NTA. People are allowed to be multifaceted. You do you, enjoy your wig, enjoy you hair. This is coming from a hairstylist, so don’t listen to those jerks.", "NTA.\n\nYou get to decide what parts of your personality and your life you share at work. It’s none of his business if you wear a wig to work or not. \n\n(I had a similar experience with a coworker who claimed I was being “secretive” because most of my work clothes don’t reveal my full sleeve of tattoos. His demands to see them, much like your coworker’s demands that you stop wearing a wig, are a form of harassment. Let your HR department know this is happening.)", "NTA. Ugh this is one of the reasons it’s so important to keep social (and social media) and professional life separate. Not saying you did anything wrong, mind you. But in the future you might want to have an account for work friends and friend friends. And keep them both on private. I would take this to HR and nip it in the bud.", "NTA is the hidden personality in the room wit us?\nThey’re clearly weird, gossip type people who you should ask to leave you alone.", "NTA. They’re creating a hostile work environment for you when you’re trying to exist in a professional manner, that’s so fucking weird or your colleague to be so aggro about it", "NTA, why  do they care so much about how you present yourself at work?", "NTA. Most of us have separate work personalities. I know I'm mostly different outside of work.", "NTA\n\nYou don't need to justify your decisions about anything to do with appearance to anyone you work with. It's frankly strange that they seem to care one way or the other. They hopefully just lost all privileges of access to your personal life and social media.\n\nI'm thinking the next interaction should go something like, \"If I hear the name 'little miss uptight' one more time, you are going to find out from HR exactly how upright I can be.\" \n\nI would chalk this up to a lesson on keeping some separation of personal life and work life in the future. Also, don't give them the satisfaction of influencing how you choose to present yourself at work.", "NTA. absolutely nothing wrong with wanting to present yourself a certain way at work, and it shouldn't be anyone's business why you choose to do so.", "NTA. You be however you want. They suck for making an issue out of it. I know plenty of people who hide their true personality at work in various ways for various reasons.", "NTA\n\nDress how you like, if it conforms with a dress code.  They are harassing you and creating a hostile workplace.  If it’s not ok for them to bully you for having purple hair, it’s NOT ok for them to do it when you wear your black wig. The office isn’t for showing your true personality, it’s for showing your professional workplace personality.  As long as you’re happy with it, enjoy it.  I will note that if the two personalities are very different, you may not want to invite your work colleagues to your personal social media. Given how things have played out with this colleague, time to drop them from Instagram, I think.", "NTA, wearing a wig doesn’t hide your personality. Sounds like your coworkers just want something to talk about. If it’s not affecting the way you work, then it shouldn’t matter. I would go to HR if it develops any further.", "NTA. If you like how you are doing things, there is no need to change it up because some people are awful. You need to decide if you hate what they are doing more than you like how you dress and look at work.", "NTA - it's your life. You do you. As an aside, this sort of thing is exactly why I have never been, nor will I ever be, social media friends with work colleagues.", "NTA. Lesson learned - co-workers are rarely true friends", "NTA. The same coworker sounds like the type to mansplain “appropriate” work attire and hair style no matter what you showed up wearing. He would have been just as vociferous about you working with short red /blue / green spiked hair saying you should have worn a professional looking monochrome wig.", "NTA.  I wear collared shirts when at work, but almost never when off work.  Does this mean I'm hiding my true casual personality at work?", "You are NTA.  And, I don't think this is a HR-type issue.  I could be wrong, but I don't know of any discrimination-against-wigs laws.  Or blue hair.  Or that people don't have to work with AH's.  Hold your head high in your long lovely hair!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I (F21) recently started working at a corporate job and it's been around 3 months. I started dyeing my hair since last year and I change the color like every two months. However, I have always showed up in my workplace with a long black wig and it doesn't look fake at all since I'm south asian with natural black hair anyway. \n\nThe issue arose when one of my colleagues whom I have become friendlier with added me on my instagram. He saw pictures of me in my   shorter violet colored hair at a concert. When he saw me the next day in person at work he was a bit confused as I had long black hair again. He made a joke like \"you didn't tell me you had a twin sister. was that her on your instagram story last night?\" I replied no that was me and told him I'm wearing a wig right now and I always have at work. \n\nHe asked me why that was necessary and I just said I don't know I think I like to make a certain appearance at work and keep it separate. He said that's way too much work and started gossiping about it with few other coworkers. They said I am going way overboard to hide my true personality. Some of them started calling me Ms. Uptight whenever they see me. I also dress in a more formal style than others so that contributed to the name as well I guess. \n\nI asked them to stop and they only made it worse and more defensive. I guess I could just stop wearing the wig and show up normally but the thing is I really like the way I dress and look at work. Plus I would be out of there in a few months anyway. I sorta regret adding him on my instagram. AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, your coworkers suck for this, you don’t have to stop wearing the wig and tell them to stay mad.", "NTA and now you know to not add any one from work to your personal social media", "NTA.  Delete him from your Instagram and don't add people from work.  Reprt to HR if they keep gossiping.", "ESH, Everybody Sucks Here.\n\nHe shouldn't be gossiping. \n\nBut if you want to keep your work life and personal life separate like you say, then don't tell people about your Instagram. Pretty simple.", "Is it fair to say that concert-OP and work-OP probably dress differently as well? A wig is just an extension of the overall appearance: e.g., halter top vs dress blouse. What's the big deal? OP's coworkers can f\\*ck right off", "I wasn't trying to advertise my instagram. He found a reel he wanted to show us that could help us decorate an office party in a certain aesthetic and I didn't think too much about it back then.", "NTA Why the fuck does any adult care what another adult looks like if it has no effect on their lives, whatsoever. This is like grade-school stuff. I would go to HR if I were you. You shouldn't be harassed. Especially because they don't know if it's possibly for religious reasons (I know it's not, but it's not something that is acceptable to judge, or even question, a colleague about).", "NTA - I agree with the HR comments.", "NTA. He's an AH and an idiot. Hair is not personality.", "NTA. You don't need to justify your personal style choices. They're crossing a line. I wouldn't even entertain the question but, if you'd like, a simple and firm \"Because I like it\" is a full response.\n\nKeep rocking the wig, try not to let their rudeness get to you, and don't look back when you leave in a few months.\n\nAlso, I advise against linking anyone from work with your social media going forward. Best of luck!", "“I dress up like Clark Kent cause y’all can’t handle my Superwoman.”\n\nNTA", "And this is why you don’t add people from work you keep your work life in your home life separate", "no one at any corporate job is showing their true personality at work. NTA", "You are absolutely NTA. When you're at work, you're at work. When you're not at work, you're not at work. Your coworkers have no right to your true personality or anything that exists outside of the time that you are paid to be in their presence unless you choose to share it with them.\n\nWhat your coworkers are doing is harassment, plain and simple. I recommend sharing this with human resources but if you can't or that is a dead end, rest assured you are NTA.", "NTA. You have a right to wear a wig. Unfortunately people aren’t always nice. Report them to hr.", "This! You are 110% entitled to keep your personal life private and present yourself the way you choose at work. AND you can still be your authentic self. People are allowed to have a professional and personal side.", "When I change jobs recently I made a point to not share my Instagram with any of my new co-workers. It's worked out great.", "I always have to explain that I never add coworkers on social media. Select few have been added after finding employment elsewhere but while actively working for the same company? Nope, that's not happening.", "NTA. Your coworker is overstepping and trying to dictate how you dress at work. You say you dress formally, so I'm guessing you are well within dress code, so they really should keep their opinions to themselves. Also, don't add your coworkers to your personal social media accounts. I personally keep almost all of my personal details as private as possible, but it can be a hard habit to get into if you're the type of person who is very open with that stuff. Make a LinkedIn account and just add them there, and only post work-related content on it.", "Unless it's about expense reports, people need to shut the fuck up at work.\n\nNTA", "Nta", "NTA. They are. And if you're in the US then you have a case on your hands to get them all in some serious shit for harassing you. Workplace harassment is no joke. DOCUMENT EVERYTHING.  Report them and if nothing changes then lawyer up and get paid", "I do this. We are allowed to wear whatever or look however we want in our office but I like to separate my 'work person' from my 'real person.'\n\nMy boss saw a picture of me at a music festival in the local paper with my coloured hair,  exposed tatts, face piercings, ripped denim, and heavy black makeup. I had a beer in one hand and was flipping the horns and screaming happily at the camera.\n\nShe mentioned that she saw me in the paper, was lucky to recognise me, asked if I had a good time, and that was it. \n\nThat's how it should be. The only thing anyone at work is entitled to is your good work ethic. Do you get your job done? Yes? Good. That's all that matters.\n\nGo to HR and let them know you are being harassed for your appearance. Because these people sound like the type to keep going and even escalate their issue with you. Document everything they say or do. \n\nNTA", "Just for my own sake of curiosity, how many of the people giving you shit about this are women or AFAB people? This is just straight up misogyny. They're literally telling you that your physical appearance = your personality, and even still, why do THEY feel entitled to your 'true personality' anyway? They're work colleagues, not friends or a partner. They're disgusting and should be dealt with like the gaggle of sexist creeps that they are. 'Uptight'.. Like yeah, genius, you're at fucking WORK, not Suck and Fuck Fest wtf? NTA", "You seem to have figured this out by now, but it is always a bad idea to add coworkers on social media.  I only add people after I leave a job.  I don't want anything I post to affect my professional life.\n\nNTA.  Your body, your choice.  You get to decide how you want to look.  Also a lot of people with brightly colored hair get unfairly devalued in the corporate world for it, and by dressing the way you are dressing, you may be giving yourself a leg up in your career.", "NTA, the dude is a creep (he cares way too much about your appearance and now he's verbally harassing you)\n\nThis is why I don't add coworkers on social media", "NTA. Block him. It sounds like both looks are expressions of your personality and you don't seem uptight at all. You be you and ignore them, they clearly don't have enough to do at work.", "op=NTA\n\nnone of their darn business how you dress or don't dress at work  Or during non-work hours.\n\nAs long as you follow the companies guidelines you are fine! (one of my employers listed Must wear underwear as part of the dress code--was curious who was going to be checking that one....)\n\nThey are bullying you and it sucks that you can't trust this A-H colleague.", "NTA, wigs are completely normal to wear. Plus colorful hair isn't really welcome in the corporate world.", "NTA.  You are being harassed.  At work.  Time to get management.  And HR.  Involved.", "NTA at all", "NTA. We all have a different work face than our home/with friends face. My wardrobe is much more casual outside of a sales job. I have a customer service voice that I use on the job. I have a hand sized tattoo on my lower leg that my friends and family know about but I don't even post on facebook because I consider it personal. He's creating drama and tension where it doesn't need to exist.", "NTA. Their reaction shows its not a workplace where everyone can be themselves without judgement, which is sad and absolutely not your fault. Its theres. You did nothing wrong OP.", "NTA. Your work friend is TA.", "NTA, You do you at work.  I would block him from socials.  If they are still harassing you and calling you names even seemingly polite ones, go to HR.\n\nThis is why I refuse to add anyone from work to my pages.  My life outside of work is not their business", "Context is king.\n\nI go shirtless at the beach and sometimes when I’m working out. That doesn’t mean “I’m hiding my true self” because I wear a shirt to work.\n\nI like to wear sweatpants. That’s my true self. I don’t wear them to work. They’re not appropriate.\n\nYou feel like a natural hair color is more appropriate at your job than a wild dyed one. Ok, nothing wrong with that. You express yourself on Instagram. You knuckle down at the office.\n\nYour coworker is acting inappropriately.\n\nOne word of advice, dressing significantly out of the norm for any workplace can be off-putting to people. I’m not saying it’s wrong or people should treat you differently, but the reality is that they will.\n\nYou mention you dress more formally than most folks at work. If what you mean is that most people wear a polo and khakis but you wear a button up shirt and dress pants, you’ll look a bit nicer, but folks likely won’t comment because you’re close enough to the norm. Same as if you dressed a bit down from everyone else and wore jeans with the polo instead of khakis.\n\nHowever, if everyone else wears workout clothes and you wear a high powered business suit, you’re going to stick out (and probably not in a good way).\n\nETA: NTA", "NTA. This is a prime example of why I do not accept or add colleagues to FB/Instagram. I’d remove his access.\n\nSounds like you have been true to yourself in how you present at the office. That’s your professional side and colleagues don’t get a say. While considerably different than your weekend look both are authentic to you.", "NTA. I think you're being smart about keeping things very professional. Everybody says stuff like hair color, tattoos, etc don't affect your career, but they're wrong. It's really unfortunate, but so many people in management just have an unconscious (sometimes conscious) bias against anything that's not \"proper and normal\" and it'll affect your progress. They just won't say it cause it's unethical af and they know they'll get reamed for it", "NTA. Your coworkers on the other hand are AH. Dress how you're comfortable at work, if you like the wig wear the wig. I'd report the coworker that started the gossiping to HR, and block him on social media.", "NTA. Report it to HR as harassment and them creating an unsafe work environment.", "NTA\n\nA lot of jobs have dress codes against things like unnatural hair colors. And even if it is not a rule, how you present yourself professionally matters. It's none of his business.", "It's no different to wearing 'work clothes' and 'going out clothes'.", "NAH. You're allowed to do whatever, but they are allowed to not like you", "NTA. \n\nThis is obviously turning into a hostile work environment. Please escalate this to HR! \n\nWhile it’s true HR exists primarily to protect the employer, your coworkers’ actions are potentially opening them up to liability. Your coworkers are harassing you, name-calling, and trying to shame you for (of all things) being professional! \n\nThat’s absolute bullshit. Your coworkers *suck,* and I’m sorry they’re bullying you.", "NTA\n\nHe is not your friend. Cut him from Insta.\n\nYou can work as hard as you like on your appearance at work (what is so hard work about a wig?)  I bet you look great. Congratulations on dressing smartly for work.  I wish more people would.", "I like that you have a wig and use it \n\nI always say you shouldn't be your true self at work. You should be your true professional self. Some things aren't needed to be shared at work. And that would be anything you don't want to share. \n\nPeople should be free to express themselves at work in a manner they feel is appropriate for them. Some people share a lot, some don't. \n\nAs long as you aren't sharing your monthly cannibal crew meetings or other such unsavory habits or interests, then be who you are.\n\nSince I am sitting here with my green hair, which I do wear to work, I just want to say who you are, who you like, and other aspects of yourself are absolutely acceptable to share at work. Just, no one needs to know about my cat fur crafting hobby. If I  have one. I don't. Really. Mentioning for a friend. ;)", "I have pink and purple hair and just like to present a more muted look for work so i wear black or natural blonde wigs. Fuckem NTA", "Nta, you're entitled to want to keep that separate and he's being weird and petty spreading gossip", "NTA.", "Nta wish others had the same professionalism", "For real. Why is he entitled to her hair? Frankly, a wig seems like a great idea for anyone that wants a clean-cut professional look while getting a bit funky on their off-hours.", "And be sure to use the words “hostile work environment” because that’s what these coworkers are creating for OP.", "Yas 👏. OP, it’s going to be okay . Def get the regret but all good, other commenters are absolutely right, remove that person from your social media.", "She should already go to a supervisor and to HR.", "Agree with all of this. How is it any different from wearing makeup for work when you rarely wear makeup on the weekend? Presenting yourself professionally at work but not outside of work is what most everyone does and frankly what you’re kind of supposed to do. It just happens to include a wig in OP’s case. \n\nIf she’s leaving this job in a few months, I agree with just dealing with the comments as long as they don’t escalate to the point of making it unbearable. I can’t imagine that I’d go to HR over it like a lot of people are suggesting as long as it hasn’t crossed a line that only OP knows if they’ve crossed. And yeah, I’m just going to assume she’s already deleted this guy from Instagram and learned her lesson on that.", "Was about to say the same thing. Never add any of your colleagues to your social media. Keep your professional and personal life separate.\n\nEven when one of my jobs required me to be active on social media, I created a separate account that was to be used specifically for job related posts and promotions.", "I straight up lie and say I don't use it. All my names are pseudonyms online", "LinkedIn is social media for colleagues\n\nEverything else is social media for friends", "NTA, I bet he's just jealous he's not as hot as you", "NTA report them to HR.", "NTA- this is workplace bullying", "NTA you like to keep work and your private life separate and that is how it should be. Far too many people spill far too many details of their private lives to their colleagues who then wade in with their opinions, or who use the info as a weapon against them as in your case here and start work place bullying.", "NTA. wearing a wig is not hiding your true personality. go to HR (and hopefully they'll do something about this harassment)", "NTA but your colleagues are bullying you and you should speak to HR. It’s none of anyone’s damn business if you wear a wig at work, your body your choice.", "NTA!  What is wrong with some people??  This person is not your friend. I would stop being friendly and keep things strictly professional.", "I guess y must report them to HR block them on Instagram et let the relationship be just professional\nNTA", "NTA. Talk to hr. Now.", "NTA dude is a creek who thinks he's entitled to access to your personal life. He probably found your insta persona attractive and is annoyed you won't present to him in that way so now he's shaming you. Document and take to HR is you can.", "NTA. \n\nWear what you like, it's no one's business.", "Familiar is not the same as real.\n\nThank heavens you are more than your corporate persona!  I am reminded of a time someone I knew from ballroom dance club wanted to go to a different sort of bar. I guess they hadn't expected me to appear in the leather and chains appropriate for the club?  That was actually a big part of my 'true personality' at the time.  Of course I didn't wear that attire ballroom dancing, that would be silly.  But I loved dancing and was active in both worlds.", "“way overboard”? your choice to show or hide what’s on your head is way overboard? wait until they meet people with alopecia and cancer, or hijabis. and you’re not getting paid for your “true personality”, you’re getting paid for the expected standard of professionalism", "nta, what you do in your private life is your business...  you are not in the wrong to keep a professional look at work, thats why it's called place of work work! if he keeps it up you should for sure contact HR about him, and learn not to care a tiny bit of what he thinks.", "NTA\n\nHe isn’t entitled to your appearance. Wearing a wig isn’t hiding either, it’s a valid and acceptable head covering.", "NTA\n\nYou're not \"hiding your personality\", but so what if you were? \n\nHow is that anyone's business? As long as you get your work done, you're professional, and you're not difficult to work with on the whole, that's all you need to do.", "NTA. Actually that's probably something we all do. We behave a different way in a professional setting than we do in our day to day. For some, it's not the case of course, but to be shamed for enjoying boundaries between work life and home life is an AH move. I'd agree that it was probably a bad idea to intermingle that relationship by adding him on any social media.\n\nYou live and you learn.", "NTA, you are free to put whatever you want on your head unless you violate company policies which is not the case unless you are prohibited from wearing wigs lol", "NTA. Your co-workers have no right to bully you over have a work look and a home look. The corporate world doesn't like funky colored hair, etc. You could be risking your job by not looking the corporate way. I don't know if going to HR would even help. They are more about protecting the company than the employees. You added the coworker to your out personal life, HR might not be sympathetic.", "NTA", "NTA Their probably going to talk shit about your real hair to. He isn’t a decent friend and it’s honestly no one’s business. Seems pretty dumb to amount someone’s personality to their. Now that I write it out. It seems super dumb", "I agree with reporting to HR. You're maintaining your professionalism and style at work. Keep being you and don't let the harassers get to you. Only change you if it's YOU that wants to change your appearance.", "NTA. If you want to dress more formally for work and wear a wig it's no one's business but yours. Your co-worker is being unprofessional and I would report his actions as I don't think they're acceptable.\n\nNot to rub it in or anything but it was a mistake to add him on Instagram.", "What a nice bunch of people.\n\nFirst thing to do is to take him and anyone else who's bullying you off your Instagram, and any other social media. Block block block. If they're going to use access to your personal information against you, time to make sure they don't have access.\n\nSecond is to speak to your manager. This isn't acceptable behaviour in the workplace.\n\nYou're NTA but they are.", "or a incel coworker who is trying to convince op to look a way be finds attractive so he can make shots at her", "Appearance and personality obviously have some relation for both men and women.", "[removed]", "[removed]", "[deleted]", "And it makes you uncomfortable too. Say both hostile work environment and uncomfortable. Two key words that make HR really listen to you. And scare the crap out of companies. It is no one's business who you are outside of work. Block him from your social media. He is no friend. NTA. I know lots of people who look different from work than home.", "Unless it's racist, sexist or based on another legally protected category, no it isn't. Don't throw around legal terms without knowing what they mean, especially to HR.\n\nEdit: I forgot quite how misunderstood this term is. [Here](https://www.askamanager.org/2015/01/hostile-workplace-its-not-what-you-think.html) is an explainer.", "Comment stolen from u/Mansardonfire.", "Comment stolen from mystupidheart.", ">but you can't wear a wig to work for months then be surprised at people gossiping about it when they find out.\n\nI feel like you can. No sane person is going to think they'll be gossiped about, called Ms Uptight or told they're concealing their true identity for wearing a wig. Like it's a wig, it's not like OP was concealing some big horrible secret. \n\n>I know people who are always too careful about what they say and don't communicate anything meaningful about themselves. \n\nWho cares? It's work, you're there to go in and get your job done not share your life story. You don't need to know everything about work colleagues, you're not there to socialise. You're not entitled to knowing meaningful things about them, and knowing those things doesn't automatically make you work better as a team. \n\n>Obtaining meaningful feedback from someone who hides herself is difficult; working with them is draining because you constantly second-guess yourself, it's like there's an elephant in the room. \n\nHides herself? By wearing a wig? Seriously? What meaningful feedback are you losing out on from not knowing your coworker wears a wig? How does not knowing your coworker wears a wig impact the feedback you guys give to each other?\n\n\n>personal and private life separate without it being disingenuous, OP could have shown someone her hair a few weeks after she started and noone would have cared. She chose to mislead them.\n\nHoly hell. Again, the issue is over a god damn wig. How is it disingenuous to not tell your coworkers you wear wigs? They never asked, it probably never came up and is none of their business. Fuck, what if the purple hair was a different wig, and OP had alopecia or cancer instead? Like I just genuinely can't wrap my head around how you think it was wrong of OP to not disclose she wears wigs after a few weeks of working there. ITS NONE OF THEIR BUSINESS.", "It's fucking hair, stop being weird. The degree to which people feel entitled to the people who are only in their vicinity to get paid are beyond gross.", "What do you care how someone presents themselves at work as long as they are respectful and not hurting anyone? Have you EVER worked in a corporate environment? Why do YOU care about someone's appearance. It has nothing to do with you and it has nothing to do with their character. Are you also one of those people that both don't like coily short hair but think wearing a wig is deceitful??\n\nA woman can do WHATEVER SHE WANTS with her body. \n\nEverything you said here is ridiculous. I can't believe you said all that about a... wig.", "Do you also feel that people with alopecia should show their 'true personality' by not wearing their wigs? Or that people shouldn't wear make-up, because it covers up their 'true personality'?", "Policing a woman's hair kind of does give off some sexist vibes though", "doesn't bullying fall into the \"hostile work environment\"?  \n\n\nracism and sexism are usually tied to \"discrimination\".", "Harassing a woman bc she is too “uptight” at work bc she makes an effort to dress conservatively with the aim of getting her to look more like she does when going to a concert is absolutely some sexist BS. No way they’d be doing this to a guy. \n\nYou’re NTA OP. Report them to HR.", "No, it is mobbing therefore if it is a hostile work environment, in any case that is regulated by the laws of each country.", "I think this guy is mad because he thought OP had a \"sexy Asian librarian\" thing going on and it's fake so he can't hit that. \n\nBut calling her Ms Uptight is not going to be a hostile work environment ™️, and using the phrase will weaken OP's case with HR.", "I allow some \\*former\\* colleagues on my Facebook once we are no longer working together. I have made exceptions for 2 or 3 colleagues to whom I became so close I consider them personally -- not the company, but them -- to be family. Otherwise, my rule is the same.", "With multiple people involved and name calling that got meaner when asked to stop, how is this not hostile work environment?", "Right, I can also accept that some colleagues can become friends - the two aren’t mutually exclusive.", "https://www.askamanager.org/2015/01/hostile-workplace-its-not-what-you-think.html", "this is an hr issue ur not in highschool ur work.. no one got time for that", "NTA, what he is doing is harassment and bullying, you should report it.", "It is important that all of us are nice to wiggers.", "NTA.  this sounds like it's harassment or about to be.  these people need to learn not to talk about people's bodies at work.", "NTA Probably for the best you are leaving soon, that work environment doesn't sound pleasant. There is nothing wrong with keeping work and personal life separate and them giving you a hard time for being professional really says something about that workplace.", "NTA, your entitled to do what you want with your body. Your work colleagues are ah for not respecting your choice. I would remind them to either respect you or you will be making it formal hy going to HR.", "NTA.  You aren’t hiding your personality - you’re showing them your work personality - which is all they’re entitled to see.  They don’t get to decide how you should dress &/or what your chosen hair/grooming regime does or does not include.  Your “personality” doesn’t have to be as “singular” as they seem to believe it does.", "NTA.", "NTA, of course. Your colleague is though.", "NTA\n\n&#x200B;\n\nIf they don't stop, report them.", "NTA. Your co-workers sound annoying. Why are they so obsessed with how you look?", "NTA and block him.", "NTA.\n1. Why is it his or your other colleagues' concern how you look?\n2. Who doesn't act more professional i a corporate job than at their free time?\n3. It sounds like they're being bullies.", "NTA. My dude, he has a crush on you, and from that post, it's not good news- he's weird and controlling and he's barely an acquaintance. Report to HR, block him on insta, and stay away from him outside of work stuff. Got to put that boundary firmly in place since he thinks he has the right to judge how you dress/complain you aren't being 'real'.", "Take him off your Instagram and don’t add work “friends” again until after you’ve left the job. I’m terms of this issue, NTA. Imagine you were black instead of Asian (as a black woman. I change my hair all the time (it’s currently green) ) but how I show up at work is absolutely not open for discussion. A mess.", "NTA, you can maintain a professional appearance at work and relaxed in your private life. \nReport his butt to HR and block him on Instagram.", "NTA\nbe who you are. If that means having a workplace 'look',  that's fine.  Them being weird about it....is about them, not you. But don't be afraid to mention it to HR if it becomes bothersome or stressful", "NTA, be who you wanna be hun", "NTA we all have a work image and if yours includes a wig so what?  No one else’s business. I’m a teacher and what I wear to work is different to what I wear at home or at weekends. Your coworker is a shit for ‘outing’ your wig and for showing your photos to others and your other workers are nasty and opinionated. Not their business. I would block your work ‘friend’ btw.", "Most people don't resort to wearing wigs, which there is no problem with, but they do keep their job persona separate from their private persona. It's quite healthy to separate your life from your job.\n\nTo put in perspective, nudist have jobs but they can't show up to work without clothes on. They maintain that lifestyle outside of work. It's not hiding their persona.\n\nNTA", "NTA.\n\nYou, and only you (and HR's requirements) get to determine what you look and act like at work. If someone is shaming you for that, in any way, thats fucked up. especially if they're sharing your private outside-work information with people without your consent. that they're then also using those other people to shame you for your stylistic choices, is deeply inappropriate.\n\nthis definitely has validity as an HR complaint.", "NTA and your coworker gossiping about you explicitly proved the very reason why you kept your private life separated from work. Block him on social media and get HR involved whenever one dares to call you \"Ms Uptight\" or anything \"funny\" ever again.", "Most of us \nThere's nothing wrong with wearing wigs. I wear them all the time for different reasons. I personally like that strangers dont know what i really look like. I feel it's too personal and I feel safer when they don't.", "NTA. Your colleagues should keep their expectations to themselves, how you present yourself at work is none of their business. Btw, please remove the colleague who started gossiping from your instagram.", "NTA.  People often act and look different at work due to expectations of professional behavior and dress, so I’m not sure what your co-worker is whining about here.", "Info: why do you think you could be the AH? I only ask because from my perspective it is a clear NTA.", "NTA. You do you and go in however you feel comfortable and professional. Like others have said, report it to HR because that is creating a hostile work environment.", "NTA. I cover my tattoos at work, does that make me fake for not showing them off? The answer is no. As long you as you are professional about it in the business world, it doesn't matter.", "NTA- life lesson, though. Keep your personal and work life separate.", "NTA. So long as you're within the guidelines of whatever appropriate attire is,  you can dress how you want. And never add coworkers to social media.", "NTA Talk to HR", "Never mix work and personal life. Especially as a minority or a POC. Lesson learned. NTA.", "NTA- Many communities use wigs daily.", "NTA, however, if you insist on keeping your personal and work life separate,  you shouldn't be sharing social media accounts with your coworkers, especially the hostile ones who seem compelled to use it against you for trivial reasons.", "Honestly I really applaud you for understanding that how you present yourself in a professional setting is very important rather than going with nice, but wild hair and complaining that you're not being taken seriously. NTA", "Lesson 1.  Do not add work colleagues to personal friends groups.  Your work and personal lives are separate things.   Once you have stopped working together that's different but it can only lead to a mess.  In the mean time be who you want to be at work and at home.  NTA", "NTA.  \n\n\nNo more comments as people ahve said it better. Commenting to vote.", "I didn't know my personality was kept in my hair - interesting. Definitely NTA, and if they continue to harass you, have a talk with HR.", "Nta block him an get hr involved.", "NTA  - wow they need to leave you alone. You can do what you want what is it to them? I say this as a fellow constant colour hair dyer (have some purple myself rn lol). I work in a coorporate office and have basically my entire career. I dont wear a wig but I dont see the problem at all.", "NAH The wig thing is weird. Part of being successful at work is building authentic relationships so your co-workers are reacting to your perceived trickery.\n\nDepending on your industry coloured hair would affect how people see you though so it’s understandable that you would downplay it. \n\nIn my conservative industry, people with coloured hair usually end up doing streaks of the colour in amongst their normal colour. It’s just enough to look edgy but not too much. \n\nComes across as confident and authentic but not too crazy. Not too casual.", "Why do so many rando men feel so comfortable giving unsolicited commentary about women's appearances......\n\nTheir opinion matters not even a little bit, not even at all.", "NTA.  You aren’t hiding your personality - you’re showing them your work personality - which is all they’re entitled to see.  They don’t get to decide how you should dress &/or what your chosen hair/grooming regime does or does not include.  Your “personality” doesn’t have to be as “singular” as they seem to believe it does.", "This right here, since you're heading out the door anyway you might as well take the toxic trash with you out. NTA", "NTA. You don't owe those assholes anything.", "This. Also, block that coworker on Instagram and all social media. The gall of some people!!!!!", "Exactly. Since when is conducting yourself professionally at the workplace is a bad thing. This coworker needs to be taking notes rather than bully her.", "Yeah this guy is a real AH. \n\nI get the curious question, but he has zero right to any judgment and *definitely* no business spreading this around maliciously and stirring shit with other people about it.\n\nNTA", "The way I see it, OP has a versatile personality and she's clearly expressing that through her wig at work. I'd go to HR. NTA obviously. The gall of some people, seriously.", "> How is it any different from wearing makeup for work when you rarely wear makeup on the weekend? \n\nOr wearing a fucking shirt or other business attire. \n\nAt work I wear a shirt, always, even though I never do so in private unless I’m at a somewhat formal event (wedding, burial, …), at the start of the pandemic I even did it for months during early WFH though I’ve relaxed that as it’s a hassle. \n\nIt’s not required by work, almost no colleague wears anything other than a t-shirt and hoodie, but I like the separation it gives between private and work contexts. \n\nComplete NTA.", "Say what? \n\nMaybe you work with a bunch of assholes, but I've never worked in a place where it was appropriate to gossip about someone's hair. I also don't see a problem with people keeping their private lives, you know, private. What a crock of bull.", "If someone is bald and wears a wig are they also hiding their true identity? You can present however you want to in public. Many people have a public professional personality and a private personality that no one knows about.", "*To be illegal, jerky conduct must be based on race, religion, sex, national origin, age (40 or older), disability, or genetic information.*\n\nThis is a grown man in a business environment harassing an Asian woman and telling her she should look sexy like her Instagram for him, and not be so 'uptight'. Do you think he would do the same to a white man wearing a toupé? Do you think the co-workers would name call him as well?\n\nReport him OP.", "I think you are confusing what is actionable by law and what is acceptable in the workplace. Alison is talking about a legally defined hostile work environment versus an HR issue. Employees’ actions toward each other can create a hostile work environment without rising to the level of a law suit. Management and HR have a duty to nip behaviors like this in the Bud before it causes an issue in the workplace. And the OP is of Asian descent and so she may have a very different view of the language in question and the implication of a cultural stereotype. She should indeed approach a manager or HR. I would never allow this to happen among my employees.", "[deleted]", "I was thinking along these lines also. I like to eear wigs and I don't think they mask who I am. I also have tattoos and I never showed them at work. I don't think my coworkers need to know everything. Should I also share my appendix scar?", "[deleted]", "Your first sentence is really what this is all about.", "[deleted]", "Yep.", "She definitely should tell HR, especially since it’s multiple employees and continuous behavior, but nowhere did he say sexy nor did the post imply that. Weird that you gave her a “sexy instagram” and created that dynamic into the story.", "And a woman of color on top of that.", "*I'm* not the one confusing the two issues. At *no point* did I say the behaviour was acceptable. \n\nI said it's not, legally, a hostile work environment at which point going to HR and threatening them with a law that doesn't apply here is a bad plan.", "But how was OP not being genuine by wearing a wig? Maybe she thought she wouldn't be taken seriously with brightly coloured hair. It sucks but a lot of corporations still have that mentality, especially if you have a client base that's older and more conservative.", "Not really. It again would be something she is embarrassed about", "Sure, but it's also not your business. If they don't want to share, they don't have to. But besides all that- gossiping and name calling someone for wearing a wig? For wanting to have a certain professional style? Not only is wearing a wig like not an issue, but to demand they no longer wear it and then react like school children for not giving into the demands is weird as fuck.", "A male colleague taunting a female colleague as \"uptight\" because she doesn't dress or style her hair the way he prefers? That's like right out of a \"don't sexually harass people\" corporate training video. \n\nIf OP's company has an HR department that remotely cares about that sort of thing (and I realize that's not always a given), this would absolutely be grounds for them to get involved.", "Gender is involved and this doesn't seem to fall under \"isolated incident\" given that he subsequently involved OP's colleagues who then escalated.", "If they don't want to share they don't have to but people are entitled to how they interpret that.\n\nI never once said wearing a wig was an issue.", "It's bullying. That's definitely an HR issue.", "Race, gender and national origin are arguably involved with the bullying.  Thanks for the link, really augmented my own point.", "How is calling her uptight related to her race, gender or national origin?", "\"if showing my 'true personality' means giving all of you more gossip material, count me out. You're not the people who get to see the real me\"\n\nNTA. Tell them to get stuffed.\n\nAnd I mean, kudos to the people telling you to go to HR, it sounds like a nice idea in theory, but anyone who has worked in \"big corporate\" who has gone to HR, knows you'll just get a nice little letter stating \"your complaint could not be substantiated\", etc etc, and it'll give the gossipers more ammunition. Honestly I just wouldn't bother, since you said you're done there soon anyway, and any HR investigation would take at least that long. \n\nStop responding to them when they speak to you about ANYTHING not strictly work related. Walk away without a word, if you can. Just don't engage. And remove that guy from your Insta.", "NTA", "NTA. Loads of people do what you do, perhaps not to the extent of wearing wigs but still alter their appearance to go to work. No shame, do what you want. Just makes the rest of your colleagues sound like they have f*cking boring lives.", "NTA. Report to HR….your employer probably appreciates your desire to dress and look more conservative at work. Most do, even if they dont publicly say it. You are being bullied for being professional.", "Nta. It's your body and you can wear a wig whenever you feel like it", "NTA. Document everything. Report this to HR. Document that, too.", "NTA. No different than a tee shirts and ratty jeans at home and a suite for work.  Go to HR. you've ask him to stop. Remember at work it's an acquaintance not a friend.", "See this is why I hate adding people from work on freakin ANYTHING. People are childish. I say you keep up with the wig just to piss them off.\nNTA. On another note depending where you work, even if they don’t explicitly ban “extreme hair”, customers tend to generally frown on anything that isn’t “natural” and love to say shit and feel like they have the power to get you fired for dumb crap.", "What you're talking about is workplace harassment. As long as you're doing your job and maintain a professional appearance, your hair and clothing are not their business.\n\nBlock him and all co-workers on Instagram. Keep your private life private from these judgmental hooligans. \n\nI'd go to HR. This is ridiculous.\n\nNTA", "heres what you should do if life was a workplace sitcom: ditch the wig. dye your hair black, style it the same as the wig. when someone pulls your hair to prove its a wig, go to HR. of course life is not a workplace sitcom so dont do any of that. anyway NTA. basically the same as wearing different clothes to work vs to party.", "NTA. Block him on social media and report him for the harassment.", "NTA\n\nBlock him on IG. Then go straight to HR and report for sexual harassment. Incase it isn’t clear how this is sexual harassment, a man is policing a female’s body by telling her how to present herself.", "NTA but report them to HR.  Pro tip to keeping work and real life separate - never ever ever add work people to social media or social life.", "Nta. Work & play are better separated. I’d mention to the co worker that if he & they don’t calm down, I’d have no other option but to engage HR. Good on you for keeping them separate. I’d be blocking that idiot on social media too.", "They're harassing you. Report them. \n\nYou're free to do whatever you please. You don't have to keep them happy. Why do they even care? \n\nNTA", "As if hair color is an actual personality. Report to hr.", "NTA, its your choice m8 it doesnt mateter as logn as youre not offending someone.", "Nta - holy cow. If you came in without the wig they would find something wrong with that too. They just sound like gossipy busybodies.", "Report to hr that is bullying and it should stopped. You ask them to cut it out but they make things worse it is time to get hr involved and it is unhealthy situation", "Block the coworker from your Instagram\nSimple", "This is your personality. Dress for the occasion if you want. \nWork clothes at work. \nIt’s not you being fake it’s you being in work mode and comfortable with presenting that.", "NTA it's a corporate job and they don't have a dress code about \"natural\" hair colors? I would have assumed that was the main reason for the wig. Even if it's not it's none of their business if you choose to dress formally for work. If they continue to harass you about it, I think you should go to HR like other posts suggested.", "NTA. My professional personality and outside personality are two different people", "NTA\n\nI have alopecia and have worn wigs for many years. So much so, people tend to be rude and ask if I'm wearing a wig. As a black woman it's insulting. Again, it's asking an invasive & intimate stranger & demanding an answer because they asked it. It doesn't work that way.\n\nAll black women & goes for all women have different texture hair. One can't assume we all have exact type of hair. On both sides of my family there is Cherokee & Irish. I used to have mixture of brown, red & black in my hair coloring.\n\nKeeping one's social & personal life separate is a *practical* choice. People who are of a minority tend to be attacked typically by what's termed crab barrel mentality. Where people encourage while backstabbing in the back to pull down.\n\nThere are perceptions that many have of the workplace. \"Sometimes\" one can't tell how conservative or liberal a company is where which can sabotage oneself instead of being able to assimilate more into norm. Tattoos, piercings, hair colorings & alternative clothing where allowed can set someone apart & it can be harder to blend more attitude.\n\nIt's your choice to do whatever, don't let a man (and if white), tell *you* how your hair should be styled and colored. That's also a subtle form of racism. IF don't know, this is bullying increasing peer pressure to gossip creating a hostile & uncomfortable situation about you and your hair. Put 'me' in your place, because I have alopecia it would be stopped in a heartbeat either by myself or HR.", "NTA\nReport to HR and document, if possible, the name calling", "NTA. You want to differentiate between your work self and your home self, how is that any of their business? And I know more than most that regardless of how hard you work, some places will penalise you for not dressing a certain way. The wrong tattoo or hairstyle can often rule you out for a promotion. \n\nI would talk to HR.", "NTA and hr visit is in place right now. This is creating a toxic work environment for absolutely no reason. Many companies don’t like colorful hair or more expressive looks, so I completely understand why you would present yourself in a formal way only", "It's work. Of course you have a different personallty at work. It's a more professional personallty. \nMost change their attire, almost everybody tone down their behaviour, and you - you wear a wig. \nThere's nothing wrong with that, and if someone think it's different to wearing a tie they're mistaken, and if they think anybody bring their true self to work, they're delusional. \n\nNTA. He had a chance to get to know the real you (if you wanted of course) but he blew for such a stupid reason", "NTA. \n\nThis is harassment.  Talk to/email HR.\n\nTake notes with specific dates & times in a work journal (notebook & pen are best for this, since the computers are company property and no one can hack your handwriting).\n\nIf a co-worker is calling you mean nicknames, then they are creating a toxic workplace environment.  \n\nLots of people wear wigs for lots of different reasons: religion, hair loss, for funsies.  You don’t need to justify your reasons.", "NTA stop adding people from work to your social media", "Nta. I cannot believe how dumb your colleagues are. Hiding true personality? Oh please", "not the asshole. you can dress however you want. if you feel comfortable wearing a wig and dressing more formal at work, i don't see what the problem is. a lot of people do that. your coworkers don't sound like nice people. but not the asshole", "NTA your hair is not your personality, it’s physical appearance and it’s none of the coworker’s business", "NTA - you work with nosy, judgmental pricks. You’re trying your best to comport yourself in a professional manner and they are undermining you. It’s so weird.", "Stop adding co-workers on your social media. Keep them out of your business!! Just because they ask.doesnt mean you have to tell them!!!", "NTA", "NTA. Go to HR immediately and remove that coworker from social media. What you do in your personal life is not their business. I personally love this idea, I’ve always wanted to dye my hair but don’t due to work.", "NTA. It actually makes sense to have a more professional look at work. Your style is none of your coworker’s business", "NTA. Report him.\n\nHe thinks that you should look like a 'quirky Asian anime girl' for his enjoyment.\n\nYeah nah.", "NTA report them to hr for hostile work environment\nAlso block him asap.", "NTA. Tell him you went on his Instagram account, but you're confused... is his twin in all these pictures? Because at work, he wears a tie, shirt and trousers, but on Instagram he wears t-shirts and jeans. And at work he goes to meetings and makes reports, but on Instagram there are no pictures of him in meetings or making reports. And at work he's with colleagues... but on Instagram there are NO pictures of him with colleagues, just these other people called... \"friends\". It's just *so incredibly confusing* that someone behaves differently in a professional setting. Tell him if he feels the urge to fart in front of a client, he has a moral obligation to let rip as loudly as he would on the couch at home, because otherwise he's just not being his authentic self.", "NTA \n\nThey are all just jealous Op! You keep doing you and block him on instagram if he is just going to bully and gossip. As well, please report him to HR.", "NTA: Hair color does not define a personality, and even so, there’s nothing wrong with you wanting to present a certain way in a professional setting vs your personal life. \n\nHowever, defaulting to name calling and worrying so much about something that doesn’t affect them in any way says everything we need to know about their personalities.", "Go to HR immediately and report this. \n\nNTA", "NTA. As someone with ADHD, I get \"masking.\" It's usually not this obvious, but I understand it. For many of us with a neurodivergent disorders, we are told to wear shoes while cleaning to trick our brain out of relaxed mode into work mode. Some need to wear an apron. You have your own look. Own it. It really sounds like a fun way to work.", "NTA. You do whatever you want I'm sure it looks great.  F that guy.", "NTA. Some companies won't hire you if you show up at the interview with colorful hair (stupid, yeah, but it is how it is). How you present your self in a professional setting can affect your chances at getting better opportunities. And most importantly, your hair is no ones business, these people need to take a step back.", "NTA\n\nOmg, I love having crazy fun hair but started a job where I  work closely with former military. It caused issues all the time, I went back to a natural color and everyone loves me now. Ridiculous because my hair color really has nothing to do with how well I do my job but it made such a huge difference in how the men and the old fashioned women treat me that I will be wearing fun wigs out and keeping natural.\n\nIf you do hide your true self it's your business not his, he might even be one of those guys who think bright colored hair is a warning to avoid due to mental health issues. \n\nDon't most people dress more formally in a business environment that they would at a concert? I know I don't run around in business wear if I can help it.", "NTA. Step one: I’d block him on social media and pretend I’m confused if it comes up. If it persists…Step two: tell him you want to go on with life the way it was before he saw you in instagram, meaning leave me and by fashion sense along. If it persists… Step three: report to HR.", "100% NTA. Work is not life. \nBut this is also why I don’t do “friends” at work or add socials. P", "NTA. You're following the dress code, you're fine. It's not like people are one dimensional and present exactly the same in every situation. I wear bellydance clothes at the Renaissance Faire, bright summer dresses as long as I can, and elegant skirts and jewel toned tops in winter. All of them are 'me'.", "**NTA**, As others said, report this harassing behavior to HR.\n\nI have tattoos... many of them. I wear a long-sleeved shirt when I go into the office. No one with whom I work knows I have them. I purposefully got them placed on my body so I could easily cover pieces. Does this mean I am hiding my true personality? Hell, no!\n\nI also know few would even question this decision as I am a white male, and the privilege afforded to me by that genetic factor means few would ever openly talk about my tattoos. These people are engaged in a misogynistic and possibly racist campaign against you. They are also invading your personal and private life.\n\nReport this!", "NTA you have your business attire at work and there is nothing wrong with it. Definitely report to HR your co workers are acting like teenagers gossiping over something that doesn’t pertain to them. Also word of advice do not friend co workers on socials it will bite you in the ass. ( I speak from experience) had a previous manager who had other co workers ‘spy’ on me on my SM", "NTA.", "NTA at all. This is workplace harassment and you don’t have to put up with it. Like another commenter said, report this to HR.", "Nta I grew up being taught who you are at work should reflect the company not you. You can be whoever you want during your time but stay professional at work. Points for living your best life and still staying professional at work", "NTA. Speak to HR. They're bullying you.", "NTA. I agree with others re going to your manager or HR. As an “older” worker, a good rule of thumb is to never add coworkers to your social media account’s including linked in while still working with them. Say you don’t have them or use them for another purpose (dog rescue, is a good one) and don’t add them.", "NTA Block him on Insta.  Talk to HR.  If you were covering your hair for religious reasons, do you see how it's harassment?", "NTA.  Remove him and report to HR", "Take that as a lesson that coworkers are not your friends NTA", "NTA. Report to HR.", ">I guess I could just stop wearing the wig and show up normally\n\nOr you can report them to HR for harassment, because that's what this is.\n\nNTA", "NTA and I definitely agree that you should report the coworker to HR.  Commenting on someone’s appearance at work in this way is harassment.  To gossip about it is further harassment.  Also, block all of them from your social media if you can.", "NTA, both are your styles/personas. You have a a professional work persona style and an off work persona style. Most people do, especially when there are work dress codes. They are both you. Tell your co-worker you are doing you and go back off.", "NTA. Ugh. This is why I rarely make real friends at work. Also, for one person who wants you to show your \"true colors\" at work, there are others who will secretly judge you for not looking professional. Can't win in some industries and workplaces!! \n\nThere is 100% nothing wrong with what you are doing and it's already similar to what lots of other people do in order to fit in. Plus, he has no right to bully you over your choice of how to present yourself professionally.", "NTA. For future reference, you never add people from work to your social media, at least the ones connected to your personal life, especially if you're intending to leave said workplace soon anyway. You avoid a lot of work drama by keeping the work buddies at work. Also, never assume someone from work is your friend that easily/soon. Most people are out to exploit you if they see you as a threat to their position, especially if it's an office job.", "NTA and this is harassment.", "NTA your coworkers are giant AH and you’d be reasonable to report it to HR. A social media account especially for ‘work friends’ is a good idea then u don’t have to reject friend requests but also can control the image they see.", "NTA and contact HR over this workplace bullying", "NTA - Block him on instagram and report all of them to HR", "NTA.  Everyone presents a more professional look at work (or at least they should).  Lesson learned about Insta though.", "NTA everyone does this to an extent, even if they try not to. You naturally have a diffrent persona for every situation, like the kind of person you are around your parents, teachers, friends, ect.", "NTA. Go to HR and report your co-workers.", "NTA.  This is no different than wearing business-casual in the office but doing \"beach bum\" on the weekend.  We all compartmentalize our different \"selves\" like this.", "NTA!\n\nThese people are literally bullies, and you should talk to HR. Under the 1rst amendment, you have freedom of expression as long as it doesn't violate other laws (public nudity, ect.) This, however, violates nothing. Stand up for yourself, and talk to HR.", "This is why work friends stay work friends.  Nta and girl they need are the uptight ones taking ehat to can and cannot wear to work. Def report to HR for harassment", "I've said this my whole life. Your coworkers are not your friends. Don't hang out with them. Don't add them on social media.", "Most work isn't about self expression. It is about doing a job. Report this to HR. Most people have different sides to their personalities and don't show them all at work.\n\nI enjoy dirty jokes. I know some good ones. I don't tell them at work.", "Glad you're out of there in a few months -- this is a good lesson about what kind of place you want to work, and how much you want to share with your colleagues.  There are plenty of tech jobs with a fetish for 'authenticity' where they'd definitely think it was weird to wear a wig and dress conservatively for work, and let your freak flag fly on the weekend.  And plenty of other jobs where that'd make perfect sense and maybe even get you props for keeping them rigidly separate.\n\n(I prefer to work in the places where they DGAF, because I don't think I'd have the energy for separate personas at work and outside work, but you should definitely do you, and your colleagues should respect that.  Their behavior is wrong.  NTA.)", "Also block this guy from your social media accounts.", "Yes! I learned this the hard way years ago.", "Way to victim blame.", "“He shouldn’t be gossiping, but it’s **your** fault for sharing your socials” \n\nYes, because *shocker* even amongst coworkers there’s this thing called “connecting”. It’s one thing if OP was actually doing something on her IG that warranted unnecessary comments, but wearing a wig? Totally justifiable reason to create a hostile work environment according to your book. Don’t be stupid.", "Sounds like your industry sucks.  I'm my industry people do and look however they want, no one fucking cares either way.", "Not liking someone for their hair color would make them an asshole.  They're 'allowed' to be assholes if that's what you're trying to say.", "It’s also a way to get around the rule of having “no unnatural hair color” which a LOT of companies have. It’s a great idea actually. I wish I had thought of it instead of having to dye my pink highlight out.", "It’s perfectly okay to maintain two different personas for your work and personal lives. I dislike it when companies are being nosy and wanting to know what the employee is doing or up to outside of work hours. In most cases, it’s irrelevant to how well they are performing at their jobs", "This is the way…", "Or the word “harassment” that is a key hr word for this.", "Right?  I’m autistic and ADHD, and you better believe I hide that at work.  I also don’t announce that I’m LGBTQIA+ at work either, because it’s none of their business!", "BLOCK ALL COWORKERS ON THE FIRST DAY OF ANY JOB ON ALL YOUR SOCIAL MEDIA.", "I have the same policy - I don't friend co-workers on social media until one of us is no longer working for that company, and sometimes, not even then.", "Many black women wear wigs daily. To their jobs. Are they disingenuous? What about people going through chemo? \n\n\nIt's not your hair, so mind your own business.", "Right? My workaround when I feel like coloring my hair is to go red (right now I only have it on the ends, my natural color is brown). It is a natural color, it's just not my natural color! And there's a bit of plausible deniability, like it's just a very reddish brown.", "This would classify under sexist. Its appearance based.  I was in an HR position for 19 years.", "You are maybe giving OP a good reason not to go to the EEOC or the state equivalent, but she is absolutely allowed to tell HR she feels like her coworkers are creating an environment she is uncomfortable in, maybe even one that she feels is hostile. I would also say you're far too comfortable saying this isn't based on sex or race. She is an Asian woman who presents at work as a somewhat traditional Asian woman and now that her coworkers know she can looks differently they are bullying her about it. It is clearly based in some understanding of what traditional Asian woman norms are and I wouldn't be so quick to say it absolutely isn't based on a protected class.", "Seems to me like there may be a racist element, as well. Like, “Oh, you presented us with a more traditional style for we how with think Asian women look and we made assumptions about you (model minority, meek, smart-but-compliant) based on that identity, and now it turns out you might be more dynamic and fiesty than we thought; I feel uncomfortable with the unconcscious bias that has been exposed inside of me, so I am gonna DARVO this sh*t and say you did something wrong rather than confront that within myself.” Might be hard to prove, though, but I feel like it’s a part of this.", "Yup! In no way do I act the same at work and at home. Professional me and Private me are very different people. Private me is definitely less cheery lol.", "Oh please tell the coworker ‘I would never comment on your toupe’ and do it when others can hear!", "You must be the coworker..", "And I'm sure some commentors fail to realize that there are many microagresions that woc deal with, that we can't necessarily say,  \"it's racism!\" because so many who never experienced that won't get it. It's like a type of code switching here, needing to look a certain way to be taken seriously and being nonwhite makes it more of a challenge. We know the stereotypes, and many of us have to present a certain \"professional\" (defined by non-poc) appearance to have one less stereotype to be judged on.", "He didn't say it, but it's very clear that what he meant.", "Ms uptight is literally a sexist term. Uptight used solely against woman that aren't \"friendly enough\". \nThat guy problem is that op isn't friendly and open to him enough, which he think he entitled because he is a man and she's a woman. This is a clear case of sexism so I don't understand what you're on about.\n\nMoreover, you yourself said he was looking for \"sexy Asian librarian\" \nHow is this not sexist and racist?", "Calling someone inappropriate names that make them uncomfortable at work=toxic", "Nope: https://www.askamanager.org/2015/01/hostile-workplace-its-not-what-you-think.html", "You have a male co-worker telling a female co-worker that she is \"uptight\" for not dressing/styling her hair the way he thinks she should. That absolutely falls under sexist behaviour.", "No one said threaten with the law. They are telling her to go to HR and say that her work environment is uncomfortable and hostile. It is not a threat; it is truth. Many companies have their own definitions of hostile and unacceptable behavior that are ten degrees above the law’s requirements. And a bunch of hyenas ganging  up on a woman of Asian descent and making fun of her appearance is pretty damn close to the line of the law.", "I am white and a woman. But it is insane in this day and age to feign ignorance that other cultures have other experiences and that what seems harmless to a middle class white male might be devastating to someone else. To not bother to look into the eyes of someone different and try to understand another’s experience is shameful.", "\"Toxic\" is not the same as \"specific legal thing\". If she went to HR and said \"toxic work environment\" or \"shitty work environment\" she'd be right to do it.", "Again, as I said, Allison is talking about a legal, actionable discrimination, not company policy or HR issues. I have already pointed that out. Allison Greene is Ask A Manager.", "...okay, what do *you* think \"tell HR your company is doing an illegal thing\" is?", "You would think, but I mean... you have schools scared to teach about race since it may hurt white kids feelings, while ignoring the other nonwhite kids who actually are going through discrimination in their lives, and not just feeling uncomfortable from a book.\n\nThere's so many layers to it that people refuse to acknowledge and it's why progress will never truly go forward because there are so many who just wanna block it, and not care what someone else who looks different to them goes through.", "What does this comment mean? Genuinely don’t understand what you are saying here.", "Yes, and \"hostile work environment\" is a real life legal term that doesn't mean \"my feelings were hurt.\"", "The \"arguable\" is exactly why it doesn't reinforce your point.\n\nDon't use legal terms you don't understand the meaning of.", "\"Hostile work environment\" is a specific, legally defined term. I'm saying\"don't use legal terms with HR unless 1. you're sure you know what they mean and 2. you want to be implying a subtle threat\". \n\n*Good* HR won't take it that way. Actively terrible HR will sweep the whole thing under the rug anyway. Poor to mediocre HR is what one should be prepared for, and slinging legal terms around to try and get them moving is more likely to backfire than to help. Op *should* complain to HR, but in my opinion she should avoid the specific legal term.", "His point is that \"hostile work environment\" is a spesifc legal term, and defined in the relevant law. \nSo if you want to use it, make sure it answer that definition.", "Calling a woman uptight because she's not dressing the way he wants? Involving colleagues in bullying her and pressuring her to do so? You don't see how gender is involved?", "> Don't use legal terms you don't understand the meaning of.\n \nThey clearly do, especially after you explain it a few times. They just do agree it doesn't apply in this case.", "[removed]", "NTA.  I’m so sorry this happened to you.  You’re allowed to dress any way you like.  There’s no excuse for how he’s treating you. \n1. Block him and the other coworkers on Instagram.\n2. Report him to HR.  He’s bullying you.  There’s absolutely nothing wrong with you wearing a wig.  \n3. You don’t have to justify wearing a wig.  You owe him no explanation.  He does not get to dictate what you wear.", "NTA - You're keeping your appearance at work professional and there is absolutely nothing wrong with that.", "NTA. Your colleagues are behaving like high school kids. Report this to HR.", "I bet they'll stop bothering once they get called in to HR  like honestly what the hell is this 8Th grade tell them to grow the hell up like honestly go to HR and report that cause lord the immaturity", "Just want to say, what a great way to free yourself to look how you want outside of work! I love dying my hair fun colors, had never considered wearing a wig at work to be more professional. Creative thinking!", "NTA \n\nYou can wear whatever hairstyle you want, and you do not owe anyone an explanation", "NTA, but this is why I don’t add co-workers onto my Insta unless we’ve known each other for years and actually hangout outside of work often. Otherwise if I like them, then get added after I leave or they leave the job", "NTA, and contact HR", "Just going to guess his age is somewhat older than you and he saw you as a young conservative Asian woman who would be stereotypically submissive to him. Your Instagram broke that illusion. He's abusing you this way because he can't abuse you the way he would prefer to.\n\nNTA", "NTA.  \n\nIt’s your hair and you can choose to wear a wig at work if you’d like to.  This is practically harassment.", "NTA\n\nI knew a woman who had a completely different corporate-appropriate wardrobe she simply never wore to work. She kept them separate (saw her out an about and complimented her on it, which is how I learned about it). \n\nYou’re under no obligation to share all of yourself at work. Your co-worker is a jerk and a bully.", "NTA. Keeping one's work life and private life separate is a valuable skill that is lacking in way too many people. Keep doing what you're doing and report the coworkers to HR.", "NTA. Co-workers are not your friends. Keep work and home separate. Also black women wear wigs *all the time.*", "NTA… your coworkers are the assholes. If wearing a wig is your jam, then that’s your true personality.", "remove all your colleagues from your IG. if they make fun of you even though you asked them to stop - they don't need access to ur shit.", "NTA \n\nGo to HR. Your work life is work. Block him off of your Instagram immediately!", "NTA\n\nUnless your workplace bana wigs, you are allowed a work look and play look that are not alike.\n\nThis is harrassment. They are creating a hostile work environment.", "NTA report him to HR. Your personal life should always be separate from work life. I personally keep my social media private to avoid anyone from work creeping on my profiles", "NTA", "NTA Your “true personality” is none of his fucking business.", "Block all of them from your socials", "NTA \n\nYour appearance is none of their business. Time to remove the work acquaintance and block anyone from work. And report them if the harassment continues. But you don’t change you for them. Ever.", "NTA. If you want to dress professionally at work, by all means, do so. If that means that your hairstyle is natural rather than multi-colored, fine. That is definitely your choice. I don't know where you work, but many companies don't allow pastel colored hair. Your co-workers have turned a bit of teasing into bullying. Personally, I would ignore them for a while and expect it to go away. Most bullies give up if they get no reaction. (This is strictly for teasing bullies, not physical or sexual bullying.) If it didn't stop in short order, I would go to HR. I have a very high tolerance for stupid, though, and generally don't give a crap what ridiculous nonsense my co-workers say about me. If you don't have this high tolerance, go to HR now. And take this childish person off of your instagram.", "NTA but don’t add coworkers on social media!", "NTA. Keeping a professional demeanor and appearance at work is a good skill to have. If you're known for your colorful and funny cursing in your private life, would you use the same language at work? They're being unprofessional.", "NTA - make all your socials private and do not connect with anyone at work until you or they don’t work with you anymore. No one at your workplace deserves to know anything about your private life unless you allow them into it.", "NTA and block your coworkers. Your wardrobe choices at work are perfectly fine.", "NTA HR pronto that’s bullying.", "NTA", "NTA\nThere's a long list of things you just don't comment on about your colleagues, including (but not limited to) appearance, body type, fashion choices,\n\nI'm concerned he fancied you as you present at work and feels \"tricked\" that you actually live a life not in line with his approval. At any rate, it's grossly inappropriate for him to be even commenting let alone bullying and white-anting.", "Tell them this is your \"professional look\" and how you want to present yourself on the job. Ask them why they want to maliciously gossip about you and why they should even care. You CAN remove him from your IG account and should because he's maliciously gossiping about you. \n\nBullies usually back down when confronted, especially if there is an anti-gossip/bullying policy in your company. Take it to your manager before going to HR, so he has a chance to investigate and manage his direct reports. Any discipline he decides whether or not to take will be run through HR for approval and record-keeping purposes. At the very least, they will receive a documented Verbal Warning.", "NTA but if you want to keep your personal and business lives separate, maybe you should consider not being friends with coworkers on social media. Just a thought.", "NTA. Report these people to HR. You can wear your hair how you want as long as it is something that makes you feel comfortable. Maake sure you document too because it is their word against yours.", "Nta and block him on Instagram. I agree to talk to HR. You are going out of your way to present an utmost level of professionalism and have found a way to be your true self while not having to deal discrimination.", "I agree with reporting to HR. If you want to *entirely* shut them down you could use a few vague references to gender expression. (Hear me out: A woman expressing feminity is expressing gender identity.) HR cannot ask you directly about your gender/sexual identity and preferences.", "Nta\n\nCoworker is an idiot. There are millions of rules and corporate etiquette designed to change you into something acceptable to “represent the business” and all of them come at the expense of the “real you”", "Nta and you should stop communicating with those coworker and report any further disrespectful and creepy behavior.", "NTA.  Nothing wrong with having a separate work and personal persona.", "Nta. Report to HR. Work is work, private life is different. You are not obligated to coworkers to share private life. I dont friend coworkers on social media until either myself the other have left the job.", "NTA. \n\nI’m physically the same at work, but my PR voice, attitude, ethic is different than my real self. I swear like a sailor and am quite colorful at home. You just do the same with your physicality. You do you.", "NTA. Please report this to HR", "NTA. You can present yourself however you want, and we dont exist only of 1 type of personality.the wqy sou look at work is part of your personality too. I would never say i only exist like this or that, bcs i can dress and even act pretty different depending on my mood or where i am.", "Obviously you're not uptight, you're gauging situational appropriateness. NTA. Gossips are TA", "NTA\n\nAsk the next person who makes a comment at work, in a nice, clear voice, to please stop harassing you. Then go immediately to HR before they can lie about what happened. (and I recommend recording everything--phone in pocket is not going to be noticed)", "You mean women don’t store their personalities in their hair?", "NTA. You are being bullied. Consider approaching your union or the company HR Dept. If you go to HR, keep written records and if possible, have your own witness.", "NTA, and a wonderful example of why you shouldn't connect to coworkers on social media.", "NTA. You really like the way you dress and look at work. It's professional and within the dress code. No problem.", "NTA and I kinda love this idea and hope to try it one day since I’m losing my hair due to meds :’)", "NTA\n\nFirst of all, it's time to make your page private (if it is, block him). Second go to HR because he's encouraging the office to harass you for your professionalism.", "NTA. Work is a professional setting and your personal life is private. Your wig has become part of your \"uniform\", and is no one's business but yours", "NTA.  I used to wear a dress shirt and tie when in reality I'm a jeans and t-shirt guy.  I speak politely to colleagues when out of work I swear like a sailor.  And I regularly say things in private company away from work and colleagues that would get me fired if I did it in a work setting.  You are just adapting to your environment.", "NTA. OP choses different hair styles and outfits for work and private. What part of this is an issue to coworkers?", "As soon as I saw the title, I knew you were a young woman. This is along the same gross school of thought as the \"c'mon, give me a smile\" dudes. NTA by far. I could see him complimenting your hair color or style then dropping it, but the \"hiding your true personality\" thing and gossiping with coworkers is really shitty. Besides, many people actually *want* to not show their full & true selves at work for many, valid reasons. I doubt he'd ever say the same sorta thing to a male coworker with a tattoo sleeve that is always covered up.", "NTA,  they are either being hostile or welcoming you to the bro club, if you are not returning the razzing and they are not stopping… HR is your answer, that’s blatant hostility.", "NTA\n\nI had my hair colored in a low balayage so I could hide it with a pony or a bun on video calls. My team didn't realize my hair wasn't black for MONTHS. \n\nYou know what they did when they found out? Nothing. Because that's how decent coworkers react. \n\nYour coworker is a jerk and you need to report him to HR. You deserve better.", "By his logic, people who have cancer and lost their hair shouldn’t be wearing wigs in the work place because it makes them feel more comfortable? \n\nNTA. I know you wear your wigs for a different reason and as long as it’s professional and doesn’t hurt your work, then forget about him and go to HR if he doesn’t stop.", "NTA it sounds like you like to be seen as more professional at your job. Idk what's wrong with that, it seems respectable and responsible to keep work and life separate. Plus it's not your coworkers business. You do you, if you want to wear a wig then wear one. I don't like when people try to harass others into changing who they are. Plus it sounds like a case for hr if you feel comfortable escalating it or want to for that matter", "NTA. At all.\n\nTell them one time (if you haven’t already), “I don’t want to discuss my appearance at work. These comments need to stop.” Then loop in your supervisor.\n\nWhat this dingbat doesn’t seem to realize is how women are penalized for their appearances at work in a way that men are not. While unusually colored hair is more acceptable now than it used to be, it is very possible that showing up to work with purple hair will result in professional consequences for you that you’re not even aware of. For years, women have been penalized for being too casual, too quirky, too sexy, too ___ at work (hell, Ask a Manager just recently ran a question from a woman being nitpicked over her BRA at work)—now too professional and formal?? Give me a break.", "NTA. Didnt know a person’s true personality sat on top of their head. It actually sits about 1 foot behind your right ear.", "why are men", "NTA. Go to HR. You're being harassed and this is a hostile work environment.", "NTA and they are really out of line and unprofessional.", "NTA.   I agree, you really shouldn’t have added him to your Instagram.  What a jerk!  What you wear and whether you wear a wig is entirely up to you.  You don’t need to change anything, but the problem you have will likely happen again if you are posting photos on social media.  Some employers now check social media before offering someone a job, so be aware.  I’m sorry that you have been made to feel bad, and that others in the office have all piled on.  They should know better.  Good luck for your future.", "This is called a boundary. You don’t want people to know too much about you or have a certain impression based on your appearance at work, so you set a boundary by concealing your hair. It’s like work uniform. NTA", "What you are doing is called code switching. You dress a certain way at work in order to be perceived as professional and not problematic.  If you came in with violet hair, next thing you know you’re out of dress code compliance. Report first to your manager and then HR", "not to mention there maybe is some dress code rules saying natural hair colors only. if OP is rocking flaming rainbow colors, that might get her into hot water, despite being totally awesome.", ">You are allowed to present whatever professional image you want in the office as long as it complies with the dress code. Your co-worker doesn't get to criticize or harass you and drag your other co-workers into doing the same.\n\nAll of this! \n\nOP report them to HR and block them on Instagram.", "Also use this as a learning opportunity to never let coworkers into your social media. It's not their business what you do in your personal time.", "Most people present themselves differently at work than they do at home, OP is just adding a wig. I personally like to dress a certain way at work so that I know when I put on those clothes, I'm in work mode. I change immediately when I'm done work so I know I'm NOT in work mode. \n\nNTA and I totally agree that this should be brought to HR. \"Ms. Uptight\" is not a cute nickname, it's workplace harassment.", "She should also take him off her insta. I'm assuming it's private but, if not, she should do that. Since he's making such a big deal of it in person, I'm inclined to believe he'll continue to do so on sm. NTA, op. He has absolutely no reason to say anything about your appearance in or outside of work.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Really?  You’re blaming the victim?  He should have no say on what she does or does not wear.  Bullying should never be tolerated.", "\"all feeeeeemales are living decoration, obligated to give me pleasant eye contact & smiles, willing to hear any commentary I might deign to offer about her appearance\"", "No they aren't. They're being dicks, but a hostile work environment is only if she's being discriminated against due to being a protected class (race, sex age, ect). If her hr is any good calling it a hostile work environment will hurt her case not help.", "Yup. Not OP, but I work in a casual engineering environment where I’m almost always in athleisure or sweatpants. I’m also a metalhead, and concert me dresses very differently, to say the least 🥹", "Yeah, this is harassment plain and simple, and you have tried all non-formal means to stop it. You are well within both your rights and established workplace norms to go to HR with the issue. It's a tough decision, bc they can stop the outright harassment but the vague ostracization is likely to continue.\n\nNTA, and I'm sorry your coworkers are jerks", "Really? Wigs are a lot more common that you seem to realize.", "And she’s Asian so there could be racism as well.", "Thx for that link. Very interesting website.", "It sounds sexist to me. Policing what women wear, how they present themselves, and accusations of being “uptight” are all forms of sexism.", "As someone who's also ADHD, I'd love to have a completely separate worksona for jobs. It would add the perfect spicy element that would help keep me focused. \"Hi! This is my worksona Amelia. She's so neurotypical and loves to answer emails in a timely manner!\"", "I think you might want to say \"dress shirt\" or \"blouse\" or something XD", "Some women also wear wigs for religious reasons.", "Yeah, I mean, I hate how overused \"hostile work environment\" is but they're criticizing a woman cause she isn't dressing how they want her to at work when she's being completely professional, and very possibly because the first coworker who saw this likes her.", "I don’t tell people about my health issues, which resulted in nine surgeries and a permanent abdominal/digestive alteration. So I must be the biggest hypocrite on the planet. And I’m going to keep being one because coworkers are acquaintances, not friends or family (who also aren’t required to know everything about you). You don’t have to share everything with everyone.", "How does fucking hair dictate who some one is. Your argument is dumb", "'stop hiding your true personality'\n\n'stop being uptight'\n\nWhat do you think he meant by her 'non-uptight, true personality'? Why is he suddenly so focused in on her since seeing her Instagram? \n\nWeird that you can't see that. Also worrying.", "This is 100% wrong. Calling someone - ANYONE - a derogatory nickname is an HR violation. A man calling a woman, ESPECIALLY a woman who is a POC, a derogatory nickname is definitely going to be on HR's hit list. \n\nHR is not there for the employees, they are there to protect the company. Having a male employee running his mouth and harassing a woman is lawsuit territory.", ">he thought OP had a \"sexy Asian librarian\" thing going on and it's fake so he can't hit that. \n\nThat sounds both sexist AND racist, so I don't know where you're coming from!\n\nA hostile work environment is anytime you don't feel safe at work due to another colleague's words or actions. This guy recruiting other people to make fun of OP for her choice to wear an accessory, and she no longer feels safe at work.", "Using TM with hostile work environment weakens your case.\n\nIt might not fall into the legal definition for sexual harrassment, but it does fall into the bullying category.\n\nNo company wants to he the case study at law schools", "Calling a woman Ms Uptight because you don't like how she presents herself is like, textbook workplace sexism. I'm almost convinced that OP took this out of a workplace training video where they use this as an example of what it can look like.", "The only thing that the post attributes to “him” and not “they” was that she was going overboard and it was too much work. All of a sudden he’s stalking her “sexy” instagram. Interesting that only his comments are seen as sexist and not the other coworkers. Like I mentioned she absolutely should tell HR, but this thread “reads between the lines” and “implies” so much and then make it fact.", "He's the one that brought her Instagram up to others after seeing another side of her. He started the 'uptight' comments. He wants her to look like her Instagram self, that much is clear. I wonder why he's want her to look 'less conservative'.\n\nC'mon dude, it's pretty clear even if it's not in black and white. Like other -isms, it's hard to define, but you know it when you see it.", "You’re the one calling it illegal. The original commenter was not. There are legitimate business interests to nip this in the bud before it escalates. Hiring and ramping new hires up isn’t free, let alone the lost productivity when someone leaves due to workplace bullying.", ">you have schools scared to teach about race since it may hurt white kids feelings, while ignoring the other nonwhite kids who actually are going through discrimination in their lives, and not just feeling uncomfortable from a book.\n\nOh you mean the governor of Florida and his cronies?", "NTA. This is why I immediately block the people I work with from my personal social media. You need to either block all of them and make professional profiles and keep it so bland it isn’t considered food. Good luck!", "NTA. Why’s it any of their business? You go to work to work, you go home and do your own thing with whatever hair you like!", "NTA. You can do what you want. It's your body. Wear the wig, and enjoy it. Report them to HR, if possible! \n\nAlso, one thing I've learned over the years is to not have coworkers on your private media. Like, at all. Boundaries are important. Keep your work and personal life completely separate if possible.", "NTA\n\nYou have every right to choose what look you rock where. They have no right to become fashion pundits at work, this isn't E! Tell em 'they can rock out at work if they like, but you prefer not to - you also prefer not to gossip and critique colleagues choice of clothes/social media profiles.' It's hilarious they wanna cll you uptight - when their issue with you is you don't wear your natural crazy colours hair....they need to get a life and also improve their critical thinking. don't even listen to people like that imho", "NTA and you should not tolerate their behaviour. Speak to HR and ask them to ensure that you can work without being harassed.", "NTA-at all. What a weirdo that guy is for harassing and gossiping about you over this. I think your idea is genius", "NTA", "NTA. Just because your coworker doesn't hide his true personality (aka being an asshole) at work doesn't mean you have to.", "I think it's smart. You can be professional at work and still have fun after work.", "NTA but go to HR. They are bullies.", "No one shows their “true personality” at work! We all wear a work mask and depending what our job is, most of us don’t wear our “true clothes” to work either. What an awful person. \n\nNTA. I’m a bit older and work in a corporate setting. I would find your out-of-work hair preference appropriate these days too. In fact I would personally enjoy seeing your hair in the office. But I understand wanting to feel and appear more professional too, especially when you’re young, ambitious and want to be taken seriously. Both hair options are perfect though and neither is anyone else’s business. What a jerk. If there is anyone with hair extensions or weaves at work, tell the jerk to go tell them the same thing so that he’s inclusive. Because it is the same thing. If you’re a fighter, you could even hint at discrimination when you say that to him.\n\nBtw I learned early on not to add work friends to my social (except LinkedIn) unless they became really special. They belong to your wig life, not your “true life.”", "NTA. First of all, remove him from Instagram - he'll come crying to you, so prepare your reply. Maybe that he is way too obsessed with your looks (make this my second point) so you won't give him more material to gossip you to your colleagues (a third point). Fourth, the workplace is not where you show your personality, it's where you show your professionalism. Fifth, personality is NOT the clothes you wear. This is a lousy mindset. Six, even if it was, see point four, and you are under NO obligation to have a relationship with him that is close enough to show him your \"personality\", interests or whatnot. Seven, I'm not sure your work environment would appreciate the blue spiky hair (you haven't mentioned a specific type of workplace), so why should you get in trouble over his obsession?\n\nAnyway, from a practical aspect, he is too obsessed with you, so take some measures about it.", "NTA, your hair is no one else's business. As long as you are complying with the company dress code policy, I don't know why anyone else would even CARE that you wear a wig. I know I certainly wouldn't. Then again I mind my own business at work and stay the hell out of anything that doesn't directly affect me.", "NTA. It's perfectly correct and normal to have boundaries between home and work. Your co-worker is out of line bringing non-work into work. He's also a bonehead in telling you that it's too much work and being a gossip. You are happy with your work look, it's comfortable to you, and no one else's business. You do you, and let the chips fall where they may. I would in the future not add co-workers to your social media, they don't need to know what you do outside of the workplace. Your value to your job isn't based on what he or anyone else thinks.", "NTA \n\nYou are being professional! You are not “hiding” anything. if these people were your friends they would already know about your appearance, but they are work friends at best. Most jobs have a rules about professionalism and appearance (official or unofficial), and you are following the “rules” about being successful at a job. I have facial piercings, gauged ears and assorted body piercings. I don’t wear my fun (gigantic) gauges or face piercings at work, because people can have perceptions about them that could impact my career. \n\nAlso, Ms. Uptight is a stupid fucking name for someone with magenta hair. If I found out my more corporate attired coworkers had a bigger wild streak outside work, I would be impressed and pleased.\n\nIt’s petty office drama. Don’t engage it, or report it, whichever is better for your career. Don’t change your appropriate, adult clothes that you like for a bunch of bored asshats", "I think it's very smart & sensible that you keep your personal & private life seprate & you appear professionally in the office, don't listen to them, they will find a new gossip in 5 days.", "You should report this coworker to HR. What you’re like outside of work is nobody’s business but your own, and everyone has a persona at work that’s at least a little bit different or filtered from their personal life. If they’re smart, anyway. \n\nNTA, but to protect yourself in the future you should avoid letting coworkers add you on social media. Nothing good comes from it.", "Why do they care so much about your hair?? That’s weird", "NTA\n\nyour coworker is however  - and is in fact bullying you for your private life choies which in no waybrelect badly on your company. Complain  to HR and then cut this snide gossiping judgemental person out of any part of your personal life.   \n\n\nkeep repeating to yourself and others ‘random men do not get to decide what i should look like‘ no, just no.", "NTA.  You need to block them on Instagram and take it to HR, tell them you don't like this behavior and want them to stop.  If they don't stop, take it to HR.", "NTA report report report. As a black woman I use weave and wigs to give my hair a break. I wouldn’t stand for anyone policing me doing so. I also wear clothes I would NEVER dare to wear to work. \n\nJust because they are being 24/7 doesn’t mean it’s your problem", "NTA. There’s nothing wrong with your choice but there sure is with theirs.", "NTA - But your work place sounds like middle school . . . nasty gossips and mean girls . . . Stay yourself! You are absolutely right about the differences in workplace and after work activities and keeping your personas seperate. I like that . . . but then your work mates sound like they are . . . what . . . 12?", "I don't show my true personality at work. It absolutely is a persona. I have to work with all sorts of people that I wouldn't associate with in my private life. I don't think they'd like my real personality. \n\nI can still be kind, supportive, helpful, competent, responsible, etc. Most people think I'm genuine, calming, \"unflappable\". But in reality, I'm just projecting a professional persona. \n\nI applaud you for knowing what is professional and what is not, and taking measures to be professional. You are clearly a good employee and a smart,  thoughtful person. \n\nNta. Go talk to HR. You shouldn't be harassedbecause of your choice of clothing (especially since you're not distracting anyone).\n\nIn the future, use LinkedIn as your \"work social media\", and keep work people out of your personal social media.", "NTA. They’re harassing you. There’s policies against that. Report them to HR if they don’t stop. You have a right to work in a safe, comfortable workplace environment without fear of harassment and bullying. \n\nAlso, you’re right to protect yourself from any potential backlash from your employer. \n\nWhile you are reporting your coworkers,ask what the policy is for appearance and hair color not a natural occurring color like blue, violet, green, etc. Ask for the policy in writing. You may be correct in covering it up because it’s often deemed unprofessional in many work places. I’ve known people who have been fired right after coloring their hair a color that is not natural. So unless it’s direct policy, your employer frown on it anyway and fire you for a made up excuse since they couldn’t fire you for hair color without it being discriminatory.", "NTA: funny how your \"true personality\" is apparently supposed to be expressed not by doing what you want to do, but by doing what your coworkers expect you to do.", "I wear a wig to work everyday.  I lost my hair to chemo last spring.  It’s nobody’s fucking business that I wear a wig.  I don’t wear a wig when I’m home because they are hot and itchy.  I also have different wigs for different occasions like church, going out with friends, running errands, etc.  Good wigs are expensive so I try to rotate through mine and wear different ones for different occasions to not put too much wear on any specific wig. If someone said anything about my wig wearing I would tear them a new asshole.  OP you are NTA, far from it.  Your coworker is certainly an AH though and I hope you take it up with HR.", "What the hell is wrong with your coworkers?? You are dressing appropriately for work and that’s all anyone needs to care about. Absolutely you are NTA and I would report this bullying to HR.", "NTA..... First of all your hair color does not define your true personality, thats just an outward expression and completely cosmetic. IMO wearing a wig for work to look more professional is no different than getting a tattoo but specifically placing it so it can't be seen at work in a dress or short sleeves. How many of your female co-workers have a tramp stamp or belly button peiceing that no one but their hubby knows about? Guys with a wolf tat on the back shoulder under that dress shirt? Shorter men wearing boots to appear more taller and dominant. Shall we get into fake nails, eye lashes, hair extensions, and spay tans.... all are professionally acceptable and are all just as fake as your wig. Your work does not care about your personal expression and I applaud you for being mature enough to know that so you can keep your position instead of flaunting it. 👏  I'm big on keeping my work life and professional life separate, life is less complicated that way. If you like changing your hair color thats none of your works business when you still put forward the professional look that you want to. People gossiping are just pathetic and have issues in their own lives that they are distracted from by talking about you. Happy people don't talk crap about other people for the fun of it like Middle Schoolers. Js.", "NTA. You are absolutely not required to share any of your life outside of work with your coworkers. You come to work and do your job just fine, regardless of who they think you might be. You set standards for yourself to look a certain way at work, and there’s nothing wrong with that. If anything, they should envy you, IMO.  \n\nI’ve had multiple coworkers who always dressed their best at work, and one in particular always made me want to be more like her. The way she would carry herself, not just in appearance but also personality made her an extremely likable person and also super inspiring. One of the most professional people I’ve ever met, who is a total goofball like the rest of us outside of those serious situations. Best boss I’ve ever had.", "Yeah OP, I’d cut that colleague out of my social media immediately. What an AH. I think it’s really cool that you are able to find a way to make working more comfortable for yourself AND express yourself the way you want. You go! NTA x 10000.", "Could have told him the purple hair was a wig.", "I just wanted to add-your wig is part of your personality. You die your hair a different color every 2 months, well, every day you have your hair 2 different colors. That’s not really hiding your personality but really staying true to it. You get to enjoy 2 different colors each day you wear your wig.  Just ask yourself-isn’t different colored hair who I am right now? Am I being true to what I enjoy doing? To me it looks like you are. NTA.", "NTA but your coworkers are. Making commentary and gossiping about your appearance is harassment. It’s none of their business that you wear a wig- what if you were in fact wearing it for a medical reason? Tell them to stop  and if they don’t report them to HR. NTA- I know plenty of people including myself who tend to have an alt aesthetic and I have covered tattoos, piercings, colored hair, and dressed more professionally for work this is not abnormal. But your coworker’s behavior is.", "NTA- work life is work life and private life is private life. How much you want to mingle those two is absolutely up to you. Dressing professionally and using a wig for work to keep to that esthetic is totally your right and there’s nothing wrong with it.\n\nI’d remove the coworker from your insta and  just tell them you like how you look for work and it’s none of their business how you choose to conduct yourself.", "NTA you are being professional and you enjoy doing it. You are doing absolutely nothing wrong. Lesson learned though. Keep work work because people suck!!", "NTA if you're in a corporate environment they tend to have dress codes against fun hair. So it makes sense that you'd wear a wig to work.", "NTA.  I've known several people in the past who absolutely separated their work life from their home/personal life.  This is totally OP's call to make.  \n\nOP should go and talk to HR about this issue.  Also don't add anyone from work to your social media accounts (probably don't need to say this now).", "NTA \n\nReport them, this is workplace harassment. Don’t let it slide.", "NTA. You're keeping your appearance professional at work. It's not their business and their behavior is unprofessional. Keep doing what you're doing.\n\nETA: If you're doing better than them at work, this may be the only way that petty people can criticize you. Tell them that you'll report their harassment if the behavior continues.", "NTA - You choose to present yourself in a professional manner at your corporate job. Bet you don't wear the same clothes at home and at work. \n\nI think its healthy to keep work and home life separate. Document the insults, tell them to stop, and if they don't report them to HR.", "NTA but you just learned the hard way why you don't add current coworkers to your social media regardless of how \"friendly\" yall are.", "NTA go to hr if they start harassing you", "NTA", "This is why you don’t add work friends to social media.", "Your coworkers are probably just jealous because their true personalities suck. NTA.", "NTA This is why you like to keep that separate and you have every right to do so!", "NTA\n\nWhat a ridiculous thing. I dress/act differently at work than I do socially. It's called professionalism. Not saying vibrant hair can't be professional; just that my appearance/demeanor is different working than socially. Pretty much any successful adult I know acts/presents themselves differently at work....cause it's work...\n\nEither way, how is it any of his business? Are you acting inappropriately at work? If not, then what the hell does he have to complain about. You could be putting on a complete facade and it shouldn't matter. It just sounds like your \"true personality\" is professional when working, more expressive/vibrant socially. Which I think is true for a lot of people.\n\nDefinitely file a complaint with HR/manager. He is harassing you. Also block him on social media.\n\n\nI would love to see how that meeting would go. I imagine it...\n\nHR: Why are you harassing OP?\n\nCoworker: She wears a wig to work.\n\nHR: And that's a problem because..\n\nCW: She's not showing her \"true\" personality\n\nHR: Her work is suffering?\n\nCW: Well, she's just not being her true self. \n\nHR: But is there a problem with her work? How she treats her co-workers? Clients?\n\nCW: But, but she's not showing her TrUe pErSoNaLiTy \n\nHR: Please stop harassing her.", "NTA. It's none of their business. If you want a more professional look at work, that is still part of your personality. I definitely have a different personality (and look) outside of the office.", "nta your coworkers are toxic", "This is why I don’t make friends with people at work, you gotta keep ‘em separated.", "So very much NTA. Please, for your own sanity, make a report to HR about their harassment, the escalation after you asked them to stop, and how this is making a hostile workplace for you. You are likely not the first person they've bullied, nor will you be the last unless they're stopped, so please report them. \n\nTotally NTA, that insensitive and judgmental heel deserves to be blocked!", "NTA.  Block him.  Defriend.  Sadly people don't wear AH shirts to let you know behind their facade what they are.  Hair is one thing.  His attitude and what he's doing to you is another.  If anyone hid their true personality, it was him.", "NTA people like your coworker is why I never add people from work etc to my SM and I keep all my SM private. I treat people at work nicely but consider them work colleagues or acquaintances at best, I don’t like to  S*** where I eat.\n\nYou shouldn’t change anything for them, how you are at work is part of your real personality that you’ve chosen to share with them, they are not entitled to all of you. As long as you do your job your private life is not their concern. What they are doing can be classified as bullying, you’ve asked them to stop mentioning it and they haven’t so I can only suggest you speak to HR to get them to stop and block all of them from all your SM accounts asap. Good Luck…. Hope everything goes well with the new Job.", "NTA- You should report them to HR for harassing you. It's none of their business.", "NTA.  This is your choice.  \n\nInform HR that you are being harassed for your professional attire at work.", "NTA. Report him to HR and block him on IG", "NTA that is so weird and creepy of them to be so concerned. I think your idea is brilliant! There’s a lot of corporate workplaces that don’t allow for unnatural hair colors and this is a clever work around. \nAlso if you just wanna wear wigs to wear wigs and have fun that’s your business too.", "NTA\n\nYou like the way you dress at work and I am assuming you are within whatever dress code expectations that exist.\n\nThe “hiding your true personality” and calling you Ms. Uptight sounds like shades of sexual harrassment, and at minimum is workplace bullying.\n\nYou’re hired to do a job and be professional. That’s it. You are absolutely allowed to have interests and dressing style (including haircolor) that is different from work. \n\nI can’t shake the feeling the accusation of “hiding your true personality” is your co-worker finding your off-hours dress sexually appealing, and he feels entitled to that. Hence, trying to frame your very reasonable seperation of your professional style vs. liesure style (or in this case, party style, since you were at a concert) as something nefarious. Kinda like how some folks like to accuse women of lying for wearing makeup.\n\nHe’s being gross and inappropriate; telling him directly to stop (“That is inappropriate and unprofessional, and makes me uncomfortable. I expect you to stop.”) and even filing a complaint with HR would be appropriate.", "NTA!!!!!!\n\n\nThats all i got to say.", "NTA. And just one of many, many reasons not to add coworkers to social media.", "NTA your coworkers should not be harassing you, demeaning you, and creating a hostile work environment. If this continues I would seriously consider having a chat with HR. start keeping records. It is absolutely okay to keep work and home separate it's absolutely okay to cultivate different looks for different things.I don't wear a wig but the way I will look at work is completely different from the way I look when I'm out drinking beer and hanging with my friends. Heck most of my coworkers don't even know that I have hair halfway down my back because it's always up. Half my friends have no idea I go to work with my hair up like a damn ballerina. You do you op. Make no excuses for it.", "Definitely block him on Instagram sio he gets the message. NTA you can present yourself however you want", "NTA. You are a victim of harassment and it needs to be reported. You may be leaving soon, but he should be held accountable for his actions.", "NTA :(", "Who do you work with, teenagers?  Where do they get off telling you what you should and should not do?  The nerve!  You do you girl.  And the workplace harassment has to stop! Report it! So NTA!", "Honestly, she should have never added him as a friend to Instagram, I never connect with coworkers on social media, it never ends well.\n\nObviously NTA.", "And remove him from your insta.", "For all he knows, party you has purple hair.", "It takes me a long while to add anyone from work and it’s only people I’ve most likely seen outside of work by that point", "This. I have a sick sense of humour. I'm mildly Aspergers. I'm a gobby left-winger. I have no contact with any of my family. Sexually I am into \\[deleted on legal advice\\]. I do not share any of this at work.", "I don't even use my real name so they can't find and request me either. No colleagues on social media at all. People at work would be SHOOK if they saw my Facebook 😂", "That was sort of my first thought too. He thinks she's pretty, saw the hair, probably fetishisized it, tries to bully her into dressing how he wants to see her at work. The whole thing is gross.", "YES! A wig IS expressing her personality, how are her coworkers so obtuse. She’s not obligated to present herself in a manner that’s pleasing to them. They sound awful. Instead of using the opportunity to get to know more about her and her interests, they’re talking to other coworkers about how much work her wig is?? The caucacity. NTA", "Ikr? That was my first thought, actually. Probably she's accustomed to having jobs where 'unnaturally' colored hair wouldn't be allowed or be otherwise out-of-place? In which case, brilliant compromise.\n\nAlso - can we just pause to acknowledge that when someone *regularly* wears a wig, that *is* a part of their public self, not just a costume piece or something. The coworker has it all wrong...she's not 'hiding' her 'true self', she's presenting her public self in public.", "I mean, you could definitely argue that this touches on some sexual harassment, sexism and/or racism. Calling a colleague *Ms Uptight* could easily be enough that HR doesn’t want to take the risk, especially since it is repeated and this person is recruiting others to do the same. People certainly overuse the phrase “hostile work environment” but this is actually a case where it kinda does apply.", "My worksona also likes to wear nice clothes and is very polite and chipper. She's a fun little character I play at work so I don't accidentally murder anyone or tell them to go fuck themselves with a cactus! Oopsie!", "You are not replying to someone who said it wasn't an HR violation.  They're talking about which terms to use when reporting to HR.", "NTA.\n\nYou should be able to express yourself however you want. Also, who’s gonna tell them hair isn’t a personality trait? Lmao", "NTA— and please report them all to HR. I also love to dye my hair, I have lots of piercings and tattoos. My current job is very open to those thankfully, but in the past I’ve worked at Corp places that aren’t and did what you do now. You’re not deceiving anyone, and you like it so there shouldn’t be a problem. I bet you look awesome no matter how you look and your coworkers can kick rocks!", "NTA. This is a HR violation so report it. They are harassing you based on your appearance and making derogatory comments about it. Calling you names in the workplace is NEVER ok, no matter if they are curse words or just Ms. Uptight. If HR doesn't take it seriously, go above them. This is not OK and honestly, this is why I don't recommend adding people to your socials from work.", "NTA. Report their harassment to HR or supervisors.", "NTA - okay darling, you're awesome and it's a great work around to corporate culture to wear a wig. Promotions, blink impressions and such. You have the right to present yourself any way you want. They're AH.", "You are being bullied. This is workplace bullying. Take a week or two to record incidents and collect evidence and then hit up company HR.", "NTA. They are creating a hostile work environment for you and you should report it. And remember - retaliation is also reportable! You don’t owe them anything outside of your work self. And it’s interesting that with everything going on in the world, THIS is something they choose to focus on.", "NTA. You are dressing professionally and appropriately for work. How you present yourself at work is different than out with friends, or home alone, or with family. That is totally normal and healthy. Your coworker is the asshole for judging you, sharing your information, and getting others involved in bullying you with name calling. You need to block this person from your personal accounts, and be careful who you share with at your next job because you will be leaving soon. Keep doing you 👍", "Go to HR. NTA. They are jealous because you have a more professional and put together look than they do.", "They are definitely harassing you and being all in your business. How you live your life away from work shouldn’t bug them and during work either.", "I am a woman with a shaved head and I have many wigs. There are absolutely circumstances where I'll wear a certain wig with a certain outfit to convey a message or boundary. There's a Jewish tiktoker who uses a \"natural\" looking wig as her head covering. You're not alone and definitely NTA", "NTA at all. I remember seeing a video a few months ago from a black women speaking about how she feels the need to go above and beyond her white coworkers to appear professional looking at work to get the same level of professional respect that they do. It reminded me of this because the moment they found out you weren’t as “professional” as they thought your coworkers started disrespecting you despite it being a choice you made that has no bearing on their lives whatsoever. Like others said I would go to HR, especially if you’re leaving soon at least HR can get them to shut up until you go.", "NTA. Just very strange.", "Your appearance is not your personality. In any case, what you do with your hair is none of their business. Sounds like workplace bullying to me", "\"I'm Asian and I have cool hair. I think way too much about it. AITA?\"", "Run, do not walk, to HR. This is straight-out harassment, no different than if he was commenting on your short skirt or low-cut top. Commenting on others' appearance at work is a definite no-go.\n\nYou are being harassed, borderline sexually. NTA.", "NTA. That’s bullying and never ok.", "If I showed up in my “true personality” at work I’d get fired or sent home. Yoga pants (or no pants), tank tops no bra and unbrushed hair are not exactly the professional image most employers want to see. lol", "Calling a woman Miss Uptight is literally a sexist thing to do, the fact that they're implying her wig that looks like natural hair is a problem just sprinkles a dash of racism in the mix.", "Finding and preemptively blocking coworkers on social (except LinkedIn, and I don’t post anything personal there - I barely post at all) is one of the first things I do when starting a new job. I’m connected to *former* coworkers that I was friendly with, but that only happens once we no longer work together. If asked, I say point blank that I don’t connect with coworkers on social media except for LinkedIn, so they can find me there if they like. Not sorry.", "Yeah, I always get downvoted when I link this too. I've stopped trying to argue with people who fling the phrase hostile workplace around. I don't know if they just don't like being wrong or are in total denial about how the world works, but people just don't want to understand this.", "My kids are lucky - we are a charter school district - the whole city - so educators can experiment and are not just stuck with a curriculum. My kids learned the truth behind the Trail of Tears in third grade and all about the civil rights movement and are learning the truth about slavery.", "You explained it better then I. Thank you!"]}