{"id": 8518, "submission_id": "10ngbts", "title": "AITA for not allowing my roommate to use my eggs?", "selftext": "Last week, I went to make pancakes in my kitchen & almost all of my eggs had been used by my roommate. Eggs have doubled in price in the last year. When they got back from grocery shopping, I asked them if they got stuff to make breakfast for themselves because I need my eggs. \n\nFast forward to a week later, I noticed that there was a box of pancake mix left on the counter. This indicated to me that they were going to make pancakes in the morning…. Which needs eggs. They still had not bought their own. So, I went ahead and boiled 10 eggs for my lunch next week & labeled the eggs container with my name bc I need the remaining eggs for banana bread. \n\nNext morning, I wake up to my roommate yelling at my other roommate (his gf) that he had to go to the store to buy eggs because they obviously saw my name. Am I the asshole for making them buy their own groceries?", "created_utc": 1674916105, "permalink": "/r/AmItheAsshole/comments/10ngbts/aita_for_not_allowing_my_roommate_to_use_my_eggs/", "score": 45, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) the action I took that should be judged is the fact that I didn’t speak to them about it and just predicted they would need the eggs and used basically all of them to force them to buy their own \n\n2) it might make me the asshole bc I didn’t communicate and forced them to buy their own\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Well done on your quick thinking!\n\nYour roommate shouldn't have used your eggs without your permission and he shouldn't have planned to use them again without your permission. He also shouldn't be yelling at his gf for his own thwarted misdeeds. Perhaps going to the store will give him time to clear his head and think about all this a bit more sensibly.", "NTA. And I hope you reminded him to pick up two dozen since they still owe you from using the previous dozen you had in the fridge.  And I bet he tried to use one of your eggs and realized it was hard boiled, not that he saw your name on the package.", "NTA. Groceries are ridiculous so I don’t blame you.", "NYA. My roommates and I do not share groceries. I pay for what I want and I don’t touch anything that I didn’t buy.", "NTA if the agreement is for each roommate to buy his/her own groceries. He should have replaced the eggs he took from you the first time.  He took your food without permission.\n\nHe can also buy pancake mix that doesn't require eggs.", "Nta - he still owes you a dozen eggs, what a mooch.", "NTA whatsoever, mate. Think his passive-aggressive need to yell at his partner as a way to let you know they're getting eggs was as hilarious as your passive-aggressive move to boil those eggs and label the carton. Smart move you did there for the entitled ones to get the message.", "NTA *if* there's a previous understanding or agreement that foodstuffs are an individuals and not shared property.\n\nIf it's been the practice that it's all shared (like the pancake mix, which you both seemed to use), the ESH.", "NTA\n\nIf they're using pancake MIX, they don't need eggs anyway.", "NTA however If you are both using the eggs does it not make sense to buy one of those big bakers packs and share them. \n\nThe big 30 boxes are cheaper (per egg) than the dozen or half dozen boxes. Even the 15 boxes are cheaper. Since its something you both use then surely it would make sense to share the burden of buying the eggs? Similarly with milk flour and condiments etc. Also fridge/cupboard space comes at premium in a shared house.\n\nIt would be better for both parties to share the burden as much as possible. Work out what things you both use weekly (milk, cereal, eggs, flour, condiments, seasoning etc) and just take it in turns.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLast week, I went to make pancakes in my kitchen & almost all of my eggs had been used by my roommate. Eggs have doubled in price in the last year. When they got back from grocery shopping, I asked them if they got stuff to make breakfast for themselves because I need my eggs. \n\nFast forward to a week later, I noticed that there was a box of pancake mix left on the counter. This indicated to me that they were going to make pancakes in the morning…. Which needs eggs. They still had not bought their own. So, I went ahead and boiled 10 eggs for my lunch next week & labeled the eggs container with my name bc I need the remaining eggs for banana bread. \n\nNext morning, I wake up to my roommate yelling at my other roommate (his gf) that he had to go to the store to buy eggs because they obviously saw my name. Am I the asshole for making them buy their own groceries?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Also, get pancake mix that doesnt require eggs....", "NTA, unless you have a joint grocery fund that everyone pitches into and agrees on what is going to be purchased, they are your eggs. And yes they have gotten crazy expensive.\n\n\nJust a heads up, you can sometimes get liquid eggs (not just egg whites) cheaper than a carton of eggs. That works if you dont need an unbroken yolk.", "NTA, unless you have a joint grocery fund that everyone pitches into and agrees on what is going to be purchased, they are your eggs. And yes they have gotten crazy expensive.\n\n\nJust a heads up, you can sometimes get liquid eggs (not just egg whites) cheaper than a carton of eggs. That works if you dont need an unbroken yolk.", "YTA, You have the right to claim your own food, but me personally I find a Tit-For-Tat situation uncomfortable. Do you each have to have your own cartons of eggs, cartons of milk, bags of flour, etc? Hope you have a big fridge for all the double items. And eggs are $6 a carton, that’s $0.50 an egg each, that’s still not crazy…\n\nI think it’s less stressful if you guys both loosely taking turns buying common items and share (eggs, butter, milk, condiments, etc), but don’t keep strict score or make a thing of it. Sure, some months you may pay more or they may pay more, but the comfort and commodity is 100% worth it to me\n\n\nUnless you are in debt and REALLY hurting for $.50 an egg, then I do apologize and see your point and hope you make it through this tough time. \n\nAlso- I’ve never used eggs for pancake mix, I always just use milk/water and mix haha it still works, pancake batter is thick enough you don’t need an egg to bind it", "YTA for being so petulant over *eggs.* 🥚\n\n>\tI asked them **if they got stuff to make breakfast for themselves because I need eggs.**\n\nFrom what you said, it sounds like you weren’t being straight up instead of just saying, “hey, eggs are expensive atm. do you mind buying your own separately?” Don’t ask about their breakfast. Be straight up.\n\nTo then boil ten eggs a **WEEK IN ADVANCE** of your lunch and then write your name on a carton (as if they don’t know it’s not theirs) is passive aggressive af. \n\nI’d love to read their POV of you as a roommate 😭\n\n**edit to those downvoting:** They didn’t use the entire carton. They used a few for breakfast because OP never asked them not to.\nYTA if you can’t have a discussion with your *TENANTS* about sharing a fridge, for fuck’s sake", "Possible ETA. Have you explicitly told your roommate that you can't afford to share eggs? It sounds like they also might not know eggs are expensive right now since it sounds like they haven't even attempted buying them. \n\nHave a conversation instead of being passive aggressive. If they still eat your eggs, they are def th AH.", "No I don’t use any of their groceries", "They are in relationship, I think OP is not. She may end up with way less than half!", "I agree that butter, condiments and flour can be shared. But not eggs or milk. They use those items more than me and it turns into me buying their groceries for them. It doesn’t make me comfortable to think I have enough eggs/milk to make something and finding out they used it all (multiple times).\n\nAlso interesting about eggs for pancake mix, it calls for it on the box so that’s why I’ve always used an egg", "Whether OP is in a tight spot or not, they're not obligated to buy their roommates anything. It's the roommates obligation to get their own supplies. It sounds like a  shared home so people should just use common sense buying items and not overstock and buy essentials. It'd be different if there was a prior agreement but it's not indicated and just rude of the roommate to use someone else supplies/groceries", "Ive been in this situation several times with roommates. Unless there is a specific agreement about sharing groceries, which was not specified here, then it is perfectly reasonable to be upset if a roommate is mooching off of supplies you purchased. Personally, if you need to borrow an egg or two, that shouldnt be a big deal, but if you take the last of them, you at least owe the courtesy of a notification and a replacement for what you took when you next go to the store.\n\nA loose agreement to take turns buying groceries? Ive done that, and got burned every time. Other roommates will be all \"Hey make sure you pick up X items,\" and expect me to cover it all, and when its their turn, its \"Oops, I forgot what you wanted.\" and they only get the bare minimum for their needs. Granted this is my personal experience, others may have had different, but I think its rather naive to think such an agreement will last long without somebody taking advantage... intentional or not.\n\nI just paid 12.99$ for eighteen pack carton of eggs. That will not last a week in my house. \n\nAnd if you like pancakes with no eggs in it, good for you. Two eggs in a standard batch of pancake batter has always been the norm for people I know, and on every recipe Ive seen.", "I agree. It’s a tiny fridge and having two cartons of milk and two cartons of eggs is mad for two people living in the same place.", "You cut out where I said “my eggs”. Also I boiled them 2 days ahead of time😂 not a week lol. Plus, they always make breakfast on the weekends so that question was normal. Also I’m not just their roommate, I’m the landlord", ">as if they don’t know it’s not theirs\n\nIt sounds like that is the case. OP's roommate used the eggs when there was no name on the container, but didn't when there was a name on the container.\n\n>I’d love to read their POV of you as a roommate\n\n\"AITA for yelling at my gf about having to go to the store after my other roommate used their eggs before I could steal them?\"", "Idk what kind of life you live where you can afford to not worry about someone eating your eggs when they’re running $6+ a dozen, but I’d like to live that life.", "We’ve actually had multiple conversations about how eggs are really expensive rn!", "Not an answer to the question though", "I still think a minimum verbal agreement should have happened. If you let them use your flour or sugar once and said nothing, that just means you are letting the groceries be shared. You not using theirs is not their decision, so they dont have to be bothered by it. \n\nEven a gentle pointer that eggs cannot be shared cos it's a bit expensive and you are trying to ration your use should be verbally spoken prior. If you have, then NTA. Else, I am not so inclined to say they should have known.", "They can buy the eggs 2/3 of the time then.\n\nI think it gets a bit petty when people start counting individual eggs but definitely if 3 people are using them them they should all contribute 1/3 of the cost or buy them 1 in every 3 times.", "Ok cool, glad it works for you and your roommate! Whatever works for you guys, go for it and best of luck", "That’s true, depends on how close you are to them too. I personally love sharing with friends/family, but am not the same way with people I am not close with.", "Cartons of eggs are stacked in the store, so you can stack them. Lol\nYou can get farm eggs that don't require refrigeration.", "Yeah, I’d rather spend a couple bucks and keep the peace, unless I was really hurting on cash", "Bruh I’m commenting on what you wrote. You said “for my lunch next week.” \nHow am I supposed to know that meant two days? I can’t read your mind.\n\nAlso you’re the landlord? 😬😬😬 \nQuit being passive aggressive. Tell them, “plz buy your own eggies and don’t use mine.”\n\nIf they use your eggs again then that is a separate conversation.", "“AITA for making breakfast with my roommate’s eggs while they sit in the corner side-eyeing me with cartoon expletives in a 💭 above their head?”", "They can have a conversation of “please don’t eat my things” rather than being passive aggressive without talking first. Not once did OP say in their post that they had a convo about keeping their food separate.\n\nIs it really so hard to have a mature discussion? Especially in a house where roommates typically share common things for cooking, such as eggs or milk. Why couldn’t OP talk to them?\n\nI have a roommate and I do NOT live a life where I can spend money freely despite your assumption lmao. If my roommate ate my eggs, I’d ask them not to. I wouldn’t make a Reddit post asking “aita for being passive aggressive 🥺”", "Then yeah, I think NTA but definitely \"remind\" them about the groceries and be really clear. Sounds like labeling your food worked too. That's annoying to have to do for sure.", "That’s not the same. \n\nWas the conversation “eggs are expensive” or “replace the eggs you took, they were mine, please buy me 12 tomorrow”. \n\nThose two things are not the same. \n\nOne deals with the issue, the other is passive & indirect & does not fix anything.", "Okay I’ll be more specific. Our agreement is to not eat each others food. I stated that on the first day they moved in.", "Yes, they damn well should have known, because they know whether or not they purchased that particular item for their own use. Food doesn't just appear, the fridge isn't a magic portal that regenerates groceries.\n\nIt's ridiculous to assume you have free usage of someone else's food, just because they let you use their sugar once. That's awful logic.\n\nThe starting point should be 'i should ask if i can use this,' not 'i guess i can just use this because i wasn't explicitly told not to.'", "I have a tiny fridge and i put other things on top of the eggs carton.\n\nThere are people out there who put their eggs in cabinets? That’s kinda nuts. Never really thought about it before but wouldn’t work for me because i don’t use eggs a lot.", "Bc it’s Saturday and next week is in 2 days 🤣", "Plz tell me how I was supposed to know that “next week” meant two days in this context?\n\n“Next week” usually means the WEEK of next. \n\nYTA, period, and I cannot imagine being your tenant bcs you are insufferable both in text and (by your own account) IRL 👍"]}