{"id": 8591, "submission_id": "10o75gd", "title": "AITA for threating to take my girlfriends car away if she doesn't get a job?", "selftext": "So I've been with my girlfriend for over three years. We met at our old job but she got fired from there soon after we started dating (failing a drug test). Since then she's been jumping in between different jobs, apparently none were \"good enough\" for her so she keeps quitting each one after just a few months. But for the last 7-8 months she hasn't worked at all. She even stopped applying to jobs completely. \n\nNow for the car, about a year into our relationship I bought her a new car that I'm paying monthly for. Technically the car is legally mine, the only reason I bought it was because at the time she had a 1hr commute and her old car was crap. Even though the car and financing is in my name she used to pay for it from her salary. But now that she's been unemployed for several months I'm the one that has to pay for it. I also have to pay the whole rent and financing on my own car. I'm barely making ends meet. She only uses the car once or twice a week to go shopping or meet up with her friends. So a couple days ago I snapped and told her that if she doesn't get a job I'll take that car away and give it to my mom. And since I've said that my girlfriend has stopped talking to me and when she does she's extremely rude and aggressive. Also I just want to point out that I've even offered to find her a job, one of my friends is a manager at a small bakery and he said that he could hire my girlfriend. But she still refuses to work at all. On one side I feel like AH but on the other I can't afford all those bills. So AITA here?", "created_utc": 1674997327, "permalink": "/r/AmItheAsshole/comments/10o75gd/aita_for_threating_to_take_my_girlfriends_car/", "score": 2877, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I threatened to take my gfs car away if she doesn't find a job 2. Because my girlfriend is now treating me like I am an asshole.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, but seriously, where do you see this relationship going?", "NTA. “Secretly hoping that things change” is not a strategy. If you want your life to change, you have to do something different, like moving out & letting your girlfriend fend for herself. I don’t see how giving the car to your mom helps your financial situation. You’re still paying for it. Why don’t you sell the car to mom or someone else?", "NTA, it's your car and you can do what you want with it.", "NTA\n\nAnd please reevaluate your relationship.", "NTA. you allowed her to use it under the circumstances she was helping pay. those circumstances have changed and it is not fair of her to expect you to go broke just so she can drive around twice a week.", "NTA, you need to face the facts that this girl is a bum and is planning to leech off you as long as she can. Stop enabling her at your own expense. The fact you were willing to finance a car for her in the first place shows that you are a caring boyfriend but unfortunately some people will take advantage of any kindness they can.", "NTA because she refuses to work and you have to pay for it.", "NTA on the car.  Your name is on the note and probably the insurance.  Your property to do what you want.  Personally, I would sell it to balance the books.\n\nAs for your gf, you have to ask what she is bringing to your life?  Does she make you happy and feel fulfilled?  Does she meet your needs?  Does she add anything to your relationship?  For me, nothing in life is free.  If she wants to be in mine, she has to bring something to the table.", "NTA. Your gf is using you.", "NTA, it's your car.", "NTA. It’s your car, you get to let her use it in your terms.", "NTA, get a new girlfriend who will partner with you", "That is not your girlfiend. She does not respect you. She is not a partner. She is using you. Break uo. You deserve better.", "Sounds like you should just split up.", "NTA - leave your girlfriend and take the car", "NTA also break up with her.", "She's using you. She decided to be a stay-at-home GF without consulting you and talking about if it was feasible. Take the car to your mother or sell it. Tell her it's an expense you cannot afford.\n\nNTA", "NTA\n\nShe's obviously gotten way too comfortable being catered to. Stand your ground and if she still refuses to get a job, take away the car, stop paying her half of the rent and bills.", "NTA. You’ve done enough for her, she thinks this is the new dynamic. Stop financially supporting her, let her start to sweat. Then she’ll start earnestly looking for a job", "NTA\n\nDon’t put yourself in a financially challenged situation because your gf’s attitude. Sit her down & explain the concept of money. If she cannot talk to you about $$ like an adult then  she is not mature enough to have a car. Get rid of the car.... & maybe the Gf too\n\neta — did something change in your lives recently? Does your gf want to be a housewife? She understands there is a car payment due right?", "NTA she's not paying any bills but she's going out shopping with her friends?", "NTA. You've let her be a leech long enough.", "NTA. Take the car. She also needs to move out. She won't change until she is forced to.  She is looking for someone to take care of her. Dont get baby trapped", "NTA, but I think the car is the least of your concerns with this relationship.", "NTA sell the car, leave the girl. She clearly has a lot of red flags happening here.", "Stop paying for the car. Also stop paying her rent. And any other bill of hers.", "nta but why do you want to be with her.", "NTA\n\nIf your name is on the title of the car, it is your car.  You are now making the payments on the car.  If you want to give the car away, sell the car or destroy it with a baseball bat, that is your right.", "You need to have the much, much larger discussion here. Her actions are destroying both your financial situation as well as her CV. As someone occasionally involved in the hiring process, job hopping combined with long gaps in work history would be suspicious. I know there are many valid reasons to explain those things, but it sounds like it doesn’t apply here. \n\nIt seems reasonable that, in order to compensate for her lack of financial contribution, you would need to offload some of your burden. She is not holding up her side of the partnership.\n\nYou also need to decide if someone who is this flippant about both work and general life responsibilities is a person you want to be with in the long run.\n\nNTA", "I was this close to giving you a yta from the title alone but then I read the story.\n\nI think it might be time to move on from the relationship, OP, or get her some professional help to unpack why she's being like this. \n\nNTA.", "NTA", "NTA she is using you for a car and free rent sounds like.", "NTA. Although I personally would add some boundaries in there for your GF. Something like \"In 2 months if you do not have a job, then I will sell your car to my Mom\" and then follow thru. \n\nYou also could make boundaries such as \"I cannot afford to continue to afford to pay X, if in X time you do not have a job I will stop paying for it\". \n\nThis is your GF, not your kid. It's not your job to parent her or to pay for everything like you have been. She probably got aggressive because shes sending her free ride is coming to an end", "NTA\n\nSounds like she is taking advantage of you and if she doesn't change her attitude about what's fair in a relationship you would be better off without her.", "There is no point in giving her an ultimatum after she has watched you struggle to make ends meet and pay both of your bills for 7-8 months. She is not going to change. She is using you because she wants to do exactly what you see her doing every day. The fact that she got angry and became rude, aggressive and is giving you (who is taking care of her like she’s your child) the silent treatment like a temperamental teenager spells break up to me. You should really be asking her to leave not just saying you going to remove access to her car. She’ll still be jobless and will just have her friends come pick her up and you will still be taking car of a jobless gf.", "NTA, you got the car as she needed it, she no longer needs it. Through her own choice. The agreement between you was that she pay and she's not doing so. She's taking advantage of you by not even trying to find a job and expecting you to cover all of her expenses. \n\nBut check your finance contract as you might not be able to have the car kept at a property you don't live at if you give it to your mother.\n\nThere may be other options to relinquish one car aswell.", "NTA\n\nIs there a reason for her not wanting to work?", "NTA damn you upkeeping a golddigger you silly boy", "NTA if she doesn't get a job sell the car.  You might also want to rethink your relationship, it sounds like this is just the beginning of your problems with this woman.", "NTA\n\nSounds like a leech.\n\nDTMFA sell the other car and  KIM.", "NTA.  Your girlfriend is not singing a sing about Chang me. She seems happy the way things are, you are supporting her.  \n\nWhat are you getting from this relationship?  Other than financial stress.", "NTA, but take the car away from her before you dump her and kick her lazy arse out of your life.", "NTA. But why are you still with her and complaining about life?", "NTA end the relationship, you are not an ATM", "NTA.  But she's not going to change.  It's close to a year and she's still not working.  Why would that change?  Keep the car and kick her out.  Life is way too short for this.", "Wait, so you’re paying for everything? Even her shopping? Best think things thru OP. I get that it’s a shared life, but if ure footing the bill for everything, that’s harsh on you. You owe it to yourself to be able to save money and build a future out of it.", "Either end the relationship or realise you love her enough to let it go. Nothing good will come from taking it away it will only cause a bigger rift to form between you.", "NTA. But the girlfriend is not concerned that you are struggling to make ends meet.  In case you are not aware she’s not planning to work.  As long as you stay in this relationship she will take take take.", "ESH. Your gf is refusing to take any responsibility in the family finance and you are trying to raise your gf.\n\nYou can't raise your gf. If she doesn't want to work, you can't force her. If it is important to you that your gf works, you need to choose a different gf.\n\nSo I would say, treat her like the adult she is -- tell her that she needs to pony up the costs of her living because your pay isn't enough. It is up to her to figure out how, not your problem, and if she can't do it, you will need to cut the costs a lot.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I've been with my girlfriend for over three years. We met at our old job but she got fired from there soon after we started dating (failing a drug test). Since then she's been jumping in between different jobs, apparently none were \"good enough\" for her so she keeps quitting each one after just a few months. But for the last 7-8 months she hasn't worked at all. She even stopped applying to jobs completely. \n\nNow for the car, about a year into our relationship I bought her a new car that I'm paying monthly for. Technically the car is legally mine, the only reason I bought it was because at the time she had a 1hr commute and her old car was crap. Even though the car and financing is in my name she used to pay for it from her salary. But now that she's been unemployed for several months I'm the one that has to pay for it. I also have to pay the whole rent and financing on my own car. I'm barely making ends meet. She only uses the car once or twice a week to go shopping or meet up with her friends. So a couple days ago I snapped and told her that if she doesn't get a job I'll take that car away and give it to my mom. And since I've said that my girlfriend has stopped talking to me and when she does she's extremely rude and aggressive. Also I just want to point out that I've even offered to find her a job, one of my friends is a manager at a small bakery and he said that he could hire my girlfriend. But she still refuses to work at all. On one side I feel like AH but on the other I can't afford all those bills. So AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[NTA](https://youtu.be/icbAsFpVW7E)", "NTA", "NTA dump her and keep the car", "NTA\nShe has a free ride. Rent car food...do you give her an allowance too?\nI'm sorry to say it will never go back to whatever you are dreaming about the good old days. \nWhat do you want from the relationship?", "NTA. Take a peek into your future. Please", "NTA but are you sure you want to continue this relationship? I would have dump her long ago.", "Just split up no chance this will last", "you’re dating a bum. take the car away. nta", "NTA but do take into account the sums your girlfriend paid towards the car when sorting out accounts during the inevitable break-up.", "NTA. She doesn't want to work. You need to break up with her and keep the car. Wake up this relationship is dead.", "NTA. I would sell that car to your mom asap and stop giving GF any spending money. See if she sticks around and gets a job or if she ditches you.", "NTA\n\nThat said, you are being treated like a doormat. Grow a spine.", "[removed]", "NTA - but you need to take off your blinders and see the red flags waving at you. your gf is using you. she doesn't want to work but it's ok since you support her. gold digger anyone? and seriously if you won't leave her, start hoping she wouldn't find another guy with a bigger wallet and fatter paycheck.", "NTA. I can't see this relationship going anywhere, to be honest. She's using you and contributing nothing to your joint expenses. It's amazing that you have put up with it this long. It's not just the car, it's rent, utilities, groceries, and whatever she's else she's spending money on. It's time to get rid of the car and cut off any access she has to your checking account.", "NTA, and understand that this is relationship might not have a future. You’re basically taking care of a kid. Also what do you do for work?", "NTA, but dude, you need to not be in a relationship with this person. If she were choosing to be a SAHM or something or otherwise contributed to your combined household that would be different.  But you have no reason to be paying for her car and struggling financially if she doesn't need it for a job.  If this is a dealbreaker for her, then I guess you have your answer and will be better off for it if you ask me.", "Your stuck with that car bill whether she works or not.  Your real decision is does she stay or does she go?  And she knows that as I doubt the car means all that much to her.  If you can sell the car to your mom to help your budget, do so.\n\n&#x200B;\n\nNTA", "NTA... take the car, tell her the lease is over. Then, get rid of her if she doesn't want to contribute.", "YTA for wanting to isolate your gf completely because you don’t like something instead of talking to her about it like an adult.\n\nYou’re also the AH for threatening to take away something (why are you treating her like a child you have the authority to punish?) that she paid into without offering to compensate her for the value she added.\n\nAlso, you specifically admit that you “got it for her” so taking back a gift is super fucked up.\n\nNote:\n\nYou wouldn’t have been the asshole if you’d just said “I am no longer going to pay for this car because I can’t afford to keep up the payments. If you want to keep it you should really get a job”\n\nNor are you an asshole for not financially providing or wanting her to get a job\n\nBut because you went about it like she was a child you had to discipline instead of communicating your issue as a partner, you’re an asshole.", "[removed]", "[removed]", "I'm secretly hoping that things change and go back to the way they were.", "By giving I did mean selling it to her, obviously at a much lower price than market value.", "If it was a finance company and she didn't pay for 7 months the car would be repossessed", "NTA. But she's not going to change. It's close to a year and she's still not working. Why would that change? Keep the car and kick her out. Life is way too short for this.", "All of these things will affect OP badly. The car is in his name as are the loans - and if the rent doesn't get paid they lose the house.\n\nBut breaking up is reasonable. As is finding a paying housemate.", "Do you also pay for her weed ?", "Lmao expecting someone to contribute financially to their transport and living situation is not “trying to raise them” he literally says he cannot afford the bills without her help.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Well considering she is acting like a child I’d say that he treated her pretty fairly. And if you had read the post you can see that he has tried to talk to her about the job situation and has even offered her a job that she turned down. If she’s isolated it’s because she’s lazy and doesn’t want to work for a car that she broke the agreement that was set up for her to get.", ">You wouldn’t have been the asshole if you’d just said “I am no longer going to pay for this car because I can’t afford to keep up the payments. If you want to keep it you should really get a job”\n\nHe can't do that though. The car is in his name and a lack of payment would fuck with his credit score.", "Copied from u/BlowingLotsOfBubbles", "At what point was it better? You mentioned she hasn’t been able to hold a job since you started dating. This is who she is, she’s telling you clearly, listen to her.", "Let me tell you a secret. That's not going to happen. GF is fine with the current situation and will never go back to \"the way they were\". OP you are being used and it's time to cut your losses and move on.", "I honestly don't think it will change unless you or her decide to change. \n\nShe might need professional help. Or you might just need to leave and find someone who matches the life you want for yourself a little better.", "Yikes. People are typically on their best behavior when the relationship is still new. Once you've been dating a while the true colors come out. She's using you.", "Hoping is not a plan. And if she doesn't see a problem, nothing will change.", "NTA. But massive red flag.", "As somebody who spent 15 yrs hoping that things would “go back to the way they were” when things were actually that way all along…leave her. If she hasn’t already, she will start lying to you about looking for work, job interviews, having jobs but the check went to the wrong place, etc. I’m so sorry. It hurts so much to be in love with someone who may have a lot of great qualities but can’t grow up and is ok with using you. Save yourself before you marry or have a child with this person.", "You said she failed a drug test. What role is addiction playing in her life? Are you trying to ‘get her clean’ or ‘keep her clean’ by yourself?  Is she interested in being employable?", "Naive.... Good luck.", "Be sure you’re using a condom at all times going forward.  Don’t rely on her for BC.", "You mean to when she was failing drug tests?", "People only change when they want to, never because someone else wants them to. If it were me, I'd assume that the present situation won't change and make a decision accordingly.", "How long to you plan to \"hope\"?", "Whatever you sell it for make sure it covers the rest of the finance or at least the majority of it", "Can you add that info to your original post? I was thinking the same thing as the previous poster.", "I didn't mean just stop paying the bills. I meant stop paying anything for her. Sell the car. Buy only enough groceries for himself.", "No. That is not what it is about. Telling someone \"if you don't get a job, I'm taking away your car\" is when you're trying to raise them, because you're doing all the thinking for them and still not expecting the other person to be responsible for anything. The point is, they need to be responsible, they need to start figuring out how they are going to get the 50 %  of expenses and how to cut costs. Obviously so far the gf has thought that a half assed attempt at working is enough to fulfill her part of it, and exactly that happens when someone tells them to get a job instead of telling them to get a half of the household's money every month -- no matter what it takes, she needs to get that, regardless if she has 0 or 10 jobs. It's up to her to figure it out.", "Tell me you have toxic relationships tendencies without telling me you have toxic relationship tendencies.\n\nIf you view your partner as a child, break up.\n\nIf you aren’t comfortable providing for your partner financially, don’t provide for them financially. \n\nIf you don’t feel like your partner is taking your feelings seriously, break up.\n\nDon’t treat them like shit and stay with them. It’s just immature and borderline abusive over time", "She's not an addict, she smoked weed at a party on Sunday and then was drug tested on Monday and she failed.", "Okay but telling someone “get a job or I’m taking the car” when you are paying for the car and you are taking it to give to someone who will help pay for it is not trying to raise them lol it’s literally self preservation. What are you even talking about?", "Lol all your comments tell me about you is that you think it’s okay for someone in a relationship to default on agreements and live rent free while your significant other struggles to make ends meet and then whine when you can’t go shopping or out with your friends. Sounds pretty toxic to me.", "Are you in USA\nLaws have been passed in certain areas that weed is not an issue", "Try reading again. Pay attention to what words are used.", ">you think it’s okay for someone to default on agreements and live rent free\n\nI literally said he should stop providing financial support for her. \n\nYou seem weirdly obsessed with defending toxic behaviors. Do you also isolate your partner and treat them like a child? Is that why you’re offended?\n\nI recommend therapy so you can learn healthy relationship patterns and learn how to actually make meaningful bonds to other humans.\n\nHave a nice day!", "And in some areas weed is still evil.", "I am and I did and it was still dumb lol", "Lol so stop providing financial support for her like let her starve or be homeless? You don’t really think before you say things do you?", ">let her be homeless\n\n-sigh- man, you really ARE struggling with even the most basic semblance of healthy relationship skills, aren’t you?\n\nNo. \n\nLike, sitting down with your partner and being honest about how you’re feeling, setting a healthy boundary and then enforcing it.\n\nSaying something like “I am feeling overwhelmed financially and have made the decision that I can no longer continue to financially support you. I understand you do not have a job, but you have x amount of time to get a job so that you can viably support yourself, because I am no longer able to”", "Lmao sounds like you are the one who has some extreme misconceptions about what a health relationship is. And like I said, he’s been supportive for months and has even tried to help her find a job. If you had even elementary reading comprehension skills then you would also see that he has literally done exactly what you are suggesting. He said “if you don’t get a job I’m selling the car” to which she responded by pitching a fit. But yeah this guys a real AH for financing her whole life for the past few months how dare he….", "Ah yes, healthy communication and a lack of abuse…how unhealthy of us. Better notify my fiancé that we’re somehow unhappy because we’re not exploding at each other and treating each other with contempt.\n\nGuess we should ignore world renowned psychologists who have written extensively about how criticism, defensiveness, contempt, and stonewalling are the most common predictor of divorce. After all, some rando on the internet thinks it’s perfectly FINE to treat your significant other like a child, what could the experts possibly know?\n\nIf you ever do want to work on your toxicity, therapy really does tend to help with -gestures- all that.", "NTA. Break up with her, she's using you.", "NTA\n\n Why are you still with this woman? Where do you see this relationship going?", "NTA for your plans for your car, but I think Y T A to yourself by staying with this person. \n\n**Date someone for who they are right now, not for who you hope they might turn into one day.** Most people don’t make major changes in lifestyle, personality, morals/values/beliefs, or behavior. They certainly don’t change just because someone else wants them to, not even a significant other. People *only* change because they genuinely want to make a change for themselves. ...But chances are that who they are now is fairly close to who they’ll always be. \n\nYou’ve been with her for over three years, for the almost the entirety of your relationship she’s been either half-assing it at her job or unemployed. She has completely stopped searching for a job for the last 3/4ths of a year (which is a huge chunk of time in your relationship). At some point you need to accept that *this is who she is, and she’s not changing for you*. She *likes* being unemployed and relying on you financially, she doesn’t care that this financial burden is leaving you exhausted and stressed out, and she doesn’t ever plan on changing her current unemployment situation. \n\nSo your only two real options here are accept her for who she is and that she will always be completely financially dependent on you, or break up so you can give yourself the chance of finding someone who is willing to pull their weight financially in the relationship.", "This is called a dependapotomus they can get up to 500 lbs", "NTA", "NTA.  She is taking advantage of you.", "Take the car back and kick her out of your life - unless she is doing all the cooking, cleaning, household maintenance. You don't need a freeloader in your life.  \n\nNTA", "NTA It is time to part ways with the gf. She has been using you for quite some time and now has even stopped being friendly towards you.", "NTA but went about it the wrong way. You need to sit her down and talk finances and her contributions. It’s up to her to pay up.", "Yes definitely you are the AH to Yourself. You are barely making ends meet because of an abled adult who won’t work. She isn’t your wife, not a mother to your kids, she is taking advantage of you and you are letting her. She isn’t talking to you while you are supporting her because you finally put your foot down a little bit? That takes a lot of nerve and its all because she doesn’t respect you. You need to put this car up for sale and kick her out. Your mom, hopefully wouldn’t take it and will tell you to put it up for sale but sadly this could be why you are dating someone like this in the first place. You have to look out for number 1(thats you) and not anyone else. She is selfish and doesn’t care about you at all wake up if this is even for real.", "Dump her", "This got me angry because my sister has two degrees from Ivy League colleges and her and her bf go half on everything my mom has degreees and can’t find a good man but a woman like this using and wasting the time off of a man who bought his gf a whole car because her own car wasn’t good enuff for him", "NTA. She’s using you. I’m confused why you would ever recommend this woman to a friend for a job. She has already shown she can’t keep one, why risk losing the friend over it? You won’t need to leave her, once you stop providing for this woman she will be gone like a fart on the wind.", "NTA \n\nShe's not contributing to the bills, you have to pay for everything and can really afford to - somethings got to give. \n\nI think it's perfectly reasonable that she either get a job or sell your mom the car.", "NTA. You are being taken advantage of. Don’t let her gaslight you. You are being extremely reasonable and she is an adult capable of working. What she’s doing is abusive. Think about what people would say if the genders were reversed.", "Why would you give the car to your mom instead of selling it if you're barely \"making ends meet\"?\nNTA.", "ESH. \n\nYou're delivering an ultimatum and using a gift as leverage to make her do what you want. And you're being a bit condescending to her by offering to get her a job \"for her\". \n\nShe's taking advantage of your support/enablement and putting you in a very difficult position financially, and doesn't seem concerned about making any contributions of her own right now.\n\nYou need to have a conversation about what the both of you expect out of this relationship and where it's going. It feels like you two aren't on the same page at all, and this blow-up is probably just the final straw in a mountain of straw that's been building up for a while.", "NTA. Why are you even with her? Name on good thing.", "NTA do what you need to do with the car. Your finances are at stake. Please make sure to wear a condom. When you start to hold her accountable, she’s going to try to keep you on the hook.", "ESH she had a car before you and then you got rid of it and now you are trying to take away the replacement??? you need to at least sell this car and get her a cheap one like her old car if you are taking away the new one.", "Why are you with her? Take care of yourself first so you can take care of others. Sell the car to pay off the debt, she cannot afford to make the payments. NTA", "Nta op.  But you really need to take a step back and look at this situation.  She's using you buddy.  You deserve better.", "NTA…your girlfriend is using you.  There are jobs out there. She chooses not to get one. It is working for her.  Ask yourself, “what am I getting out of this relationship?”.", "YTA to yourself for still being with her. She wants you to take care of her. She wants to be a stay at home gf. Get some self respect and stop supporting a fully capable adult. \nNta for taking the car away. Take it you don’t even have to tell her or warn her about it.", "Nta. Change the locks, ignition if it's PTS and kick her out. She is just free loading off you and if you're not into it then it's time for her to go. Find yourself cheaper housing, a better gf and give your mom the car if she needs it.", "NTA", "NTA.  You are being used and you need to start setting some boundaries.  Honestly, I think she should be your Ex already, but if you want to stay with her there has to be some change.  You should not be paying everything, even her luxury car (not for work use) so she can shop and play with friends, while you struggle to pay basic bills.\n\nShe gets a job and contributes ASAP or this needs to end.  She also needs to learn better communication methods, because being rude/aggressive is NOT acceptable at all either.\n\nIn the future, don't get into a relationship where you're the \"father.\"  You're supposed to be equals.  If you make more money, yeah, pay an equitable amount of the bills, but you should look for a partner who is at least TRYING, or actively engaged in working on themselves or their future.", "NTA\nShe's a freeloader and has no intention of getting a job. I'd suggest putting a tracker on the car to", "NTA. Your girlfriend is taking advantage. She needs to grow up. Don't put up with it.", "NTA. She's your gf not your young child. She's leaching off you. She needs therapy to figure out why she can't stick with a job.", "Have you considered that your gf is suffering from depression or a different mental illness?\n\nI know everyone is telling you to ditch her but there is probably more at play here then “she’s just leeching off you.”\n\nRegardless good luck to you.", "NTA\nDriving a car is a privilege, not a right.  It is a huge responsibility.  On top of that, most people buy their own vehicles once they enter adulthood…and this includes auto insurance and fuel.  She can’t pass a drug test?  She can’t get a job?  She doesn’t sound like she’s ready for any responsibilities whatsoever.  Why are you with her, man?", "Don't let your friend hire this girl at that Bakery it's just going to be something she's going to screw up for you and you're going to lose a friend because she is just a screw up you need to give her a hard most of reality and kick her ass out take the keys from her and don't let her back in and take that car to your mother's", "NTA - Lose the Leech", "NTA- she is mooching off you and it’s wrong. The car is a drain on your finances you don’t need. She needs to step-up,or ship-out. Personally i think this is a go nowhere relationship but there is no accounting for love. So p does she love you or are you just very very convenient?", "NTA OP a family friend of mine had a very similar situation except his now Ex GF worked. What happened was that the family friend and his ex lived with each other but other than going to work, she refused to pay the bills, she refused to help out around the house, leaving him to do everything except pay back her student loans. She spent his/her money to the point where it led to them breaking up. Eventually, he found someone else who actually pulled her weight and helped out around the house, and now they're married. So OP, read this carefully, she's treating you like an ATM and not her boyfriend. Things won't go back to the way they were due to the manipulation she's putting you through. She's being a major leech DUMP HER!", "Also, don't allow your friend to hire her at the bakery. She will just let him and you down and possibly burn a bridge between you and your friend. Stay strong and good luck.", "Bro leave this mooch, why are you even dating her? Shes literally using you", "NTA. Move out, find your own place just for yourself, and let her find her own place to live. Under no circumstances let her move in even for one night. She won’t leave. If she wants to eat, she’ll get a job. Right now it doesn’t look like she has any incentive to get a job if she can just depend on you paying all the bills, plus the rent, plus buying all the food. She’s not a girlfriend, she’s a leech, and she’ll suck you dry. Then she’ll move on to the next guy that she can leech onto.", "NTA- this is a huge financial burden. And I don’t mean the car. \n\nI’d give a time line for her to get sorted and keep a job or you’ll return both her and the car.", "NTA", "NTA. He who pays for the car…owns the car.", "my dude, she isn’t gonna change. She’s mooching off you. Take the car, dump the girl.", "You sound like you have a teen on your hands and not a grown woman good luck raising your kid\n\nHasn't applied in 8 months for a job yet she finds the time and money to go out  with friends twice a week using the car your paying of but can't get off her ass to work and not be a bumb", "NTA \n\nBut you know you're her Sugar Daddy, right?", "NTA. Also not the boyfriend. Give the car to your mom. Kick the gaslighting woman out of your home.", "NTA.  Your relationship seems to be near the end of its course.  Don't let your GF work for your friend, she won't last.  Take the car now, give it to your mom before she trashes it for spite.", "She is using you.", "NTA", "Put her out and sell the car not the Ah but you will be one as long as you support her life style and not yours she is a slacker and user I would be unhappy to if you told me I had to get a job to help support me and you while setting on my ass doing nothing check out your relationship it is one sided", "NTA - She refuses to work at all? What IS she contributing to this relationship?", "If you two don’t have children, and she’s just being lazy for the fun of it… NTA", "Nta", "NTA but didy ou really sign up for this? I mean its a relationship its meant to be shared and this sounds so one sided", "Why are you with this girl? She sounds lazy and exhausting. She is walking all over you. NTA", "NTA. Sounds like when you bought the car, you didn't sign up to pay for all of its expenses so she needs to fork up or she doesn't get to use it anymore. Sounds like you could have been nicer about communicating though...", "Maybe an adult conversation about how you can’t afford the car on one income instead of ‘snapping’ and threatening to give to ur mom (I get it’s prob bc she would pay you but still a weird mom shout out). Also likely gf has something going on that makes employment difficult— adhd, bipolar, or ptsd/anxiety about work. People aren’t usually just lazy there is often something else keeping them from being successful especially with a pattern of failed attempts. ESH", "NTA, but this relationship is toxic.  It sounds like she is using you for money.  Hoping you can get into a better situation.", "NTA… she’s basically using you and you don’t deserve that… wishing you all the best 🙏", "Nta your girlfriend is being lazy and it is within your right to take away the car", "NTA but I have news- you’re not her boyfriend, you’re her sugar daddy.", "Exactly!  Take a good hard look OP. This is your future if you choose to make a life with her.", "Certainly leading to financial stability.  Mostly just financial dependence.  Then a kid to \"fix things\".  Then 18yrs of misery.", " NTA\nI would be unhappy to if you told me I had to get a job to help support me and you while setting on my ass doing nothing check out your relationship it is one sided", "When all you are doing for change is hoping, the only change you will see is that hope eventually dying when the change you actually want never happens", "Haha dependapotomus, that's awesome", "Actually, don't get rid of her. Not your problem. Once you take the car, I somehow think that tick will sort herself out.", "[removed]", "Comment stolen from: /u/Drayden71 \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/10o75gd/aita_for_threating_to_take_my_girlfriends_car/j6d28v0/\n\nBot Reported.", "She is literally showing you her true self. She doesn't want a relationship, she wants someone who will support her, she wants a sugar daddy. Get out before she ruins your financial situation.", "The bottom line is she won’t go back to the way she was before. Odds are she was only working in the first place to survive, but now you’re the one providing for her. She was probably always like this, you just didn’t know.\n\nAlso, her resume as you portray it is full of massive red flags for potential employers. She might be able to get some type of retail job, but most entry level corporate jobs will turn her away. I say this as I’m hiring for my next associate position and short job histories are an automatic no for me.", "She only had a job for a few short months at the beginning of your relationship. The relationship has been like it is now far longer than it was \"like it was back in the beginning\"  \n\nShe's not interested in changing. She's interested in the status quo where she doesn't have to work but has everything provided for her including her own car, fully funded by you.", "Why would she change them, she is being taken care of and doesn’t have to lift a finger? I think she’s gotten comfortable with you taking care of her and see’s no reason to work.", "Damn why'd you get down voted for this", "Mate. By your own account she has NEVER held a job for more than a few months. You need to find a new gf.", "I’m sure you are. But you are not compatible, and every day you prolong the inevitable is just extra suffering that you will have to deal with. Rip the bandaid off, for your sake", "I'm really sorry, I can understand that that's hard. Unfortunately, from the timeline you have provided, there is no reason to believe that your hope is founded in reality. I understand your hesitation, the prospect of being alone can be daunting. But I think you would thank yourself in the future for not letting yourself be taken advantage of. And the sooner you face that, the sooner you can start to move on.", "She has shown you who she really is. That's not going to change. So you have to ask yourself-do you want to be solely financially responsible for her? Because that's what being with her means. If not, then you need to break up with her and kick her out. I know it's painful, but to make room for a healthy relationship, you gotta end this one.", "They won't. I think secretly you also know you are NTA. You need to revaluate your relationship, where you are now and where you're going. Don't look back at the past, the future is ahead of you. Or something like that.", "Why secretly? Time for serious conversation. Post time, in fact.", "This is sad. You’re just an ATM to her and an enabler for her lazy lifestyle. Don’t you think you deserve better for yourself? NTA", "Relationships don’t work on secret hopes. You have to communicate and deal with realit. Ask her what her plans and goals and hopes for life are and tell her if those don’t fit with yours.", "Is she depressed? Could she need some mental health help? Or is she just mooching off you? If it’s the latter, give the car to your mom and maybe consider moving on.", "Oh come on. She lost a job through her own negligence and she’s being too precious to get another job. At what point was this relationship ever decent?\n\nDrop the dead weight.", "They won’t. And she’s shown you that. \n\nI’m not a big fan of ultimatums because they rarely work. But you gave her one and it’s reasonable. But I highly doubt it’s going to work \n\nYou feel like you’re drowning right now but instead throwing you a lifeline she’s pulling you beneath the surface. It’s not going to change \n\nPlay the tape through. What happens if she doesn’t change and you stay with her? Do you see yourself being happy? I’m guessing you already know the answer to that but are still working at accepting it\n\nNTA and you deserve a partner, not a dependant", "Partial comment stolen from: /u/Creepy_Addict \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/10o75gd/aita_for_threating_to_take_my_girlfriends_car/j6cy3o2/\n\nBot Reported.", "I doubt she'll start lying. OP seems to be rolling over and taking it. The only reason she would lie is if he started making noises about dumping her if she doesn't find a job.", "At all times?  Even when he’s peeing?", "People are just trying to signal to op that their hopes are not realistic. In this case downvoting shows a different kind of disapproval. It's not uncommon on this sub.", "he’s been paying for over a year so i feel even at below market price the value should still cover the remainder (hopefully)", "I mean if she’s acting like a child then he has to treat her like one. I see what you’re saying but it doesn’t apply here. He’s had the convos with her. He’s been financing her lifestyle for months. Paying for everything while she sits at home doing nothing. Like a child! So yea he has every right to treat her that way if it’s the way she’s presenting herself to him. I don’t have a job rn (start a new one next week) but I still find ways to get money. I still try to help as much as I can. I Don’t bring extra costs to the house, I don’t have a car I don’t use but twice a week, I make a lot of my own meals, I have friends come to me or I go their places to avoid having to pay for eating out. There’s things she can do to get money and help out every now and then but she’s refusing to do anything at this point. The car is in HIS name, under HIS credit score. So if he doesn’t pay it he’s shit out of luck on his credit.", "> if you don't get a job, I'm taking away your car\n\nIt’s not her car. Taking away his own property that was lent for a specific purpose isn’t “raising the gf”. She hasn’t paid for the car, it gets taken away, that’s how the real world works. I’ll argue that letting her keep the car is an act of “raising her” more than what you’re arguing.", "*Especially* when he’s peeing", "Fair enough, I guess", "If he treats her like a child, she will behave like a child. Way to cement that dynamic. If he wants her to be a child in the future, too, yes, treat her like a child by all means. \n\nNo, don't step on that road unless you want to screw up the relationship for good. That's just a pissing contest on who can be nastier, just separate instead.", "Again, it's not about the car but about not contributing to the finances, not contributing to cuttings costs. If she was paying half of the household costs (even without having a job), nobody would be saying that the car needs to go to someone else. So the car is not the problem, the problem is that she isn't contributing, and that needs to be fixed. That *really* needs to be fixed, because it's a way bigger issue than any issue with any car could be.", "that doesn't stop employers from terminating for it though even if there are no charges brought up against you", "Yes, in many places it’s no different than alcohol. You can buy it, you can consume it but if you test positive for either one at work, termination is absolute. It all depends on the job", "Even if it's legal, employers can and do terminate people for testing positive for weed. But also, it isn't legal in all states. For example, it isn't legal in the state I currently live in.", "My job you will still get fired for failing a drug test", "Why be with someone who doesn’t want to work and just wants to live off of you? She could’ve told OP that she didn’t want to work and just wanted to be a SAHG but she didn’t. She’s manipulating him into it by not working and basically banking on the fact that he’ll pick up the slack. If it was me, a few weeks after she stopped working there would’ve been a convo on duties and who does what, what the plan is going forward etc. and then if 8 months later nothing changed and I’m burnt out trying to keep my head above water I would’ve blew a gasket too. You’re coming down on OP for “treating his gf like a child” why aren’t you coming down on her for treating her boyfriend like he’s her dad and has to pay to keep her alive?", "I'm from California...    interesting \nThe law does not bar employers from using impairment tests or tests that identify tetrahydrocannabinol (THC), the chemical compound in cannabis that can cause psychoactive effects, as part of their workplace drug test policy.\n\n￼\n\nhttps://www.cda.org › Article-Details\n\nCalifornia workers gain protections for off-the-clock cannabis use ...", "At my work it wouldn't even show up on the drug test. A friend used to set his alarm to smoke a bong then go back to bec", "If it were me, I would have dumped the non-contributing gf already.\n\nOP's problem is really that he has chosen a gf who he can't afford to have. You can't raise or change your spouse, and if you aren't willing to dump your spouse, then you need to accept your spouse the way she is.\n\nTreating your spouse like a child is a prelude to splitting up. Skip that and split up already, perhaps in a more amicable way than if you enter that pissing contest.", "I’m sorry but you’re wrong. OP did everything you said he *should* do and still got nowhere. “Just tell her you’re not gonna pay for the car” okay but the car is in his name, he’s paying for it, and he can fuck his credit up if he doesn’t so that doesn’t make any sense to me. I believe you’re right he shouldn’t have to raise his GF but you’re wrong saying he should’ve had conversations with her about everything when he clearly did and still nothing was done. At this point all he can do is treat her like a child because that’s how she’s acting. She has no job, don’t contribute, expects him to do it all for her just like a child. So yea he was in the right to be mad and blow up on her after multiple conversations with her about it. You’re wrong. Your relationship is not someone else’s so please stop with the “oh me and my fiancé…” BS because that situation has nothing to do with this one.", "YTA for how you handled this.  You bought the car without her asking for it - did she agree to this? \n\n>So a couple days ago I snapped ...\n\nand gave her an ultimatum.  Lovely.  \n\nHow about approaching her like an adult should? \"I know you've had trouble finding the right job fit, and I've tried to be supportive. But I can't afford the car on my own. We can sell it, or my mom is willing to take it and take up the payments. What do you think about that?\"\n\nAnd yes, failing the drug test, that would have been the red flag that stopped the relationship for most non-drug users. OP mentions it but then skips past it. Is 'snapping' a delayed reaction to that?\n\nFurther, the apartment. Can you afford it on your own, and do you care enough for the gf to support her? If not, be honest and split up. I'd say the same thing regardless of sex - if you're with someone for fun, fine. If you're living together, you'd better be willing to pick up the financial slack when things go South, or you've made a mistake. We've all been there, usually on both sides - needing help, giving help. If that's not the nature of your feelings for this person, you're doing both of you a disservice.\n\nYou've already let it go past resentment on your part, so you need to act - either on yourself or the relationship.", "The gf might be depressed. Most people don't do nothing unless there's something wrong. That said, my dude, don't be financing cars for other people. I don't even finance cars for MYSELF. It's bad debt no matter how you slice it. Sell the car and have a frank discussion with her. If she's too depressed to work, she needs to get meds and therapy and benefits or something until the meds even out and she can go back. \n\nI've had a depressed partner before where I was footing the bill for rent etc. We had a frank discussion where I said listen I can't carry us alone, we're going to struggle if so. She got her shit together and now things are better than ever. \n\nNTA but my friend don't be financing shit for other people.", "NTA\n\nBut, here, look—what *realistic* outcome are you expecting from your GF? You’ve given her an ultimatum; how long do you let her sulk before you expect an answer? And are you going to follow through with your threat?\n\nBecause if you don’t after laying down an ultimatum, you have just demonstrated that she has complete power over you, in that she knows that any threat you make is just bark without any bite.\n\nThe first place to start, though imo, is “what do you want out of this relationship and what do you realistically see actually happening at this point?”", "op=NTA\n\nif you can't afford it, and it's in your name(title and payments) then you have no choice.\n\nThe only thing that is important to consider before transferring title/payments to your mother is if the amount of payments your girlfriend made on the vehicle are more than the payments she owes you for bills you've had to pay while she's unemployed.\n\nSo you got the car about 2 yrs ago.  And she's not been paying for what? at least 6 months?  So what is the value of that remaining 18? months of payment.  \n\nHowever, you have to make a decision, are you willing to continue to support her not working? Not even trying to work.  \n\nAnd yes, failing a drug test even if it was 3ish years ago.  Has drug use continued?", "NTA for now, but will be if you allow this to continue. Is it because she can't get a job that requires a drug test? Major red flag.\n\nYou should probably take the car before something happens to it and either sell it or give to your mom. She has some serious issues.", "NTA. Get rid of the car and the girlfriend; she’s using you.", "Op your girlfriend seems to be just like my ex. He was let go from the place we worked, tried getting work at other places, then stopped all together. He made excuses for every time he lost/left a job. \"I didn't like the atmosphere\" \"They were letting staff go and I was one of them\" etc. The longest one was about 2 months, meanwhile I was paying for everything and stressing over it\n\nThis is what you need to do:\n\n1) You need sell off the car. She will probably try her hand at getting it back, even if you gift it to someone else. Get rid of it\n\n2) Dump the girlfriend and kick her out. If there is one thing I have learned, it's that these people do not change. You are providing, and she is comfortable with that. She doesn't plan to ever go back to work while there is someone paying her way\n\nMy ex broke up with me but still lived with me for a while. During this time he was still using me to pay for him (my mistake). I ended up kicking him out, and after an incident of finding out he put my card details on some of his accounts and getting them removed, I have not once had to pay his way ever again", "NTA. Unless you want to fully support this person forever....", "NTA captain oblivious, but it sure sounds like you can’t afford to be a sugar daddy to a lazy girl with a drug habit.", "NTA but she is a leach and will likely always be a leach. Tell her to go find another sugar daddy to take care of her unless you want to have an adult child for the rest of your life.", "NTA. She clearly thought she was going to get a free ride and you corrected her on it. Take the car before she damages it and find someone who's willing to support themselves if that's what you want from a partner.", "NTA, but she’s one of those “I don’t have to work and I’ll just be carried thru life” idiots, you should bail asap. The only thing that is going to give her a dose of reality is the safety nets being removed. You still paying her rent without her having a car probably won’t change anything.", "NTA.  It isn't her car.  It is your car.  If you to tell her that you will take the car away, why are you still dating her?", "NTA except to yourself. Is she really what you want.", "NTA. \n\nHowever you do understand that this is how your entire life will go if you stay with her? The reason for all the jobs is because she doesn’t want to work. You could lay her dream job at her feet and there will still be something so wrong she needs to quit. You need to decide if you want to support her your entire life or want to move on.", "Nta. Since it’s legally in your name and she isn’t paying for it I would just sell it.", "Nah man get out if she keeps acting like this", "NTA and you need to take your car back before she causes some real trouble. \n\nand you had better make sure you use a condom.", "NTA but don't threaten to take her car, just take it and tell her she can have it back when she actually needs it for a job. Two cars are unnecessary in your guys situation in this economy right now either way", "Sounds like you're being used. NTA", "[removed]", "nta.. and you are still with this deadbeat ? Why ?", "So you have a rude and aggressive girlfriend who hasn't worked for months and isn't looking, drifts between jobs and got the sack for drug-taking. And you are paying for her. What does she actually bring to your relationship? NTA.", "NTA.  Go ahead and give the car to your mom, and give your gf an eviction notice.  She treats you like crap and is using you.  Time for her to go.", "NTA\n\nDon't give the car to your mother - sell it for a normal price and get the finance paid off.\n\nYour girlfriend clearly prefers a jobless life with you paying the bills.  If you don't want this to be the rest of your life, then now is the time to end the relationship.  Also, consider that her next move might be to get pregnant and trap you with a baby.", "NTA.  \nYou're not obligated to pay for anything for her.", "What is keeping you together?", "NTA. Why are you wasting your time and money on someone who is too lazy to work, and who sulks like a toddler when you point this out to her? Dump the GF and sell the car. Problems solved.", "No but she is baggage and is that fhe future you want", "NTA. When did you become her sugar daddy?", "NTA dude you're being used it's time to go. If she loved you and wanted to be in an equal partnership she would have a job she just wants someone to take care of her so she doesn't have to have responsibilities. run away. If she actually cared about you she would make every effort to take care of her side of things.", "NTA. She is using you.", "NTA she lives outside now, yeah?", "Kick her out. This will only get worse. What are you getting out of this relationship? Because you're paying for everything and she feels entitled to that. You teach people how to treat you. Believe me when I say that you could do so much better. Cut her loose and kick her out. This is untenable.", "NTA. Sell the car or give it to your mum. The reason your gf lost the job she had when you met is probably the reason she hasn't had a job since, also probably the reason she has stopped bothering to try to get one since. So tell me again - why is this lazy, entitled mooch the love of your life?", "Read Codependent No More. You deserve a better life partner. By being nice you're enabling her toxic BS. She hasn't had any severe consequences that's why she is doing this crap. NTA.", "All good, except you should sell the car. The used car market is strong and you don’t lose a ton of money like before. If buying the car was a “mistake “ and you can’t afford it, then turn it into cash, don’t just transfer ownership. Anyway, it will be easier for your gf to understand your decision that way. Unless you are trying to send her a message that you’re through with her.", "Mmm yeah NTA she’s thought she had a sucka and didn’t have to work, she felt you out durning the times she quit because”the jobs weren’t for her”. Sit her down and talk to her not at her let her know your expectations and ask her why she hasn’t been job hunting, let her know she has to hold down a job you are not her bank or her sugar daddy.. it’s going to be a hurtful conversation especially if it gets heated but remember no matter how long you have been together she is not your wife. For what ever reason she hasn’t even made it to fiancé in a long engagement..and if you in the future plan on marrying this one you should be having second thoughts at this point… she’s looking for a free ride in this relationship,If you two have different ideas of what a relationship is maybe she needs to move out.", "NTA \n\nPlease send her back to live with her parents before she gets pregnant with a trap baby. It will be so much harder then", "NTA but dude your girlfriend is a hobosexual - unless you’re independently wealthy and like being a sugar daddy she needs to leave.", "OP, the car's legally yours. Give it to your mother.", "You started dating and she got fired for failing a drug test, then bounced from job to job—exactly what made you thing she was a keeper? Take the car away, and then take yourself away. NTA", "NTA get rid of the whole girlfriend she is dead weight", "NTA if your girlfriend wanted to actually turn things around, she would have taken steps to do so by now, even if it was acknowledging the need for help (if she has depression). She has no motivation to work and she is completely fine with you paying for everything, even if it financially crippled you. Regardless, you should probably reevaluate this relationship for your sake.", "NTA. You are being taken advantage of. Tell your GF she has one month to find and keep a job and help with the bills, or you will have your mother take over the loan and your GF will have to find a new place to live.", "NTA\n\nI don’t understand why you are paying for your girlfriend’s life (it’s not like she is your wife) when she just can’t be arsed working.\n\nDitch the woman and keep the car", "NTA get rid of the leech.", "NTA, but you will be if you keep bankrolling this girl. She's gotten quite comfortable with her situation and isn't looking to change it. You said she failed a drug test when you met at work; is she still using (or was it just weed)? Please don't have unprotected sex with her or you'll end up supporting her *and* a child. If you truly want the relationship to succeed, have a frank talk with her about getting - and keeping - a job so she is a partner, not a leech.", "Why get a job when you provide everything?  At least you know now that you’re not an SO, but a meal ticket. Once it dries up so does she.  Nta.  And dump her ass.", "NTA. She is using you. She is a freeloader. Sell the car. Dump the GF.", "NTA but why are you still together?  She's aimless, lazy, and expecting you to continue to subsidize her life.  You don't need to put up with that.\n\nAlso if she's that terrible at keeping a job, please do not encourage your friend to hire her.  It'll end badly and probably damage your friendship.", "NTA \n\nYou are funding her lifestyle. And sidenote: Is this someone you want to marry and have children with? She sounds like a bum.", "Get rid of the car and the girlfriend.", "NTA. If she can’t figure out how to pay for it, it HAS to go. You need relief too", "NTA but no offense, why are you buying her a car?", "YTA, your the problem. So follow along. You start dating GF who soon looses her job due to drug use. She then jumps from job to job, so you you reward that by purchasing her a brand new car. Wow surprised this didn't work out well. DUMP THE CAR! Get a puppy.", "leave before you become eligible for alimony. j/k kinda \n\nNTA but seriously this isn't going anywhere based on your story", "NTA\n\nPlease post an update telling us you've seen the light and dumped this person who is doing nothing but using you for free housing, free food, and free transportation.\n\nAmazing that she has money to go shopping with her friends but not pay her way in this world....", "YTA, for allowing yourself to be used like this and for so long. Dump the user and don’t ever allow yourself to be taken advantage of like this again.", "Info: what do you get out of this relationship? Is she the love of your life? If not, she’s just taking advantage of you and you should SELL THE CAR and pay off your own. If your barely making end’s meet, you should focus on that first. NTA", "NTA , i know it's difficult but i wouldn't get her a job through your manager. This will adversely affect the relationship between you and your manager if something bad happens or she leaves like her older job. You should encourage her to get a job on her own.", "Uh, does she still have her other car? If so, then it's not like she's now stranded. However, if she DOESN'T have that car, then you have just prevented her from going to job interviews, which is mondo counter-productive.", "NTA", "NTA.  Sell your second car and put the money into a savings account.  Tell her again that she must find a job to help pay bills.  If she still refuses, try to get out of the lease and leave.", "NTA. You should not be paying for everything plus her car. Give it to your mom. Sell it. Just get rid of it so you can use the car payment money for something else.", "You and she are not married. One of the reasons people live together without getting married is to avoid legal entanglements if they want to split. \n\nSo here you are.  You now know she intends that you support her. You are not ok with this.  So why not tell her that your partnership isn’t developing as you thought it would so you want to go your separate ways.  You are totally free to make that decision. You are also free to not have an argument with her about it.\n\nYou can tell her that it can still work out if she is willing to reset the relationship.  Separating doesn’t preclude that.  Perhaps she will find someone who wants to support her and perhaps you will find someone who wants the same kind of partnership you do.\n\nKeep in mind though that your girlfriend may suddenly become pregnant to keep the relationship in place. So take care.", "NTA. She's refusing to get a job probably so she can leech off of you and make you her sugar daddy. If I were you, I would break up with her and take the car since you did say that the car is legally yours.", "Nta\nGive your mom the car and kick her to the curb. She's a leech and has no shame in taking advantage of you.", "INFO: Why is she not applying for jobs? If she doesn't even leave the house except for getting groceries and maybe see a friend, I would think that she could be depressed.", "NTA\n\nBut you DO realize she is using you right??? RIGHT!?!?!?!?\n\nShe has the perfect set up. \n\nSomeone who pays her rent, bought and pays for her car. \n\nPays for her food. \n\nPays for everything while she pays around and does nothing.\n\nIs this how you see the relationship developing? Can you see youself with her in 5 years? With children?\n\nShe is NEVER going to work again unless drastic measures are taken.", "Y. A. T. A.\nIt doesn't matter what happens, you cannot force another person to do anything. And when you try to, you come off as a control freak.", "She needs to go. No reason to be suffering in a relationship especially since the law, kids and property aren't binding you together. \n\nI'm sure there is a mature, giving partner waiting for a like-minded man. You'll have room for better after you let the squatter go.\n\nYWBTA if you keep playing yourself.", "Ask her to see a medical professional about depression. If she refuses, tell her that you have to make financial choices that impact your future. Sell the car or sell to your mom who takes on the payments. Boundaries are good. Just be better about sitting down and talking about all the finances and what her expectations are and yours.", "ESH! Obviously, your GF needs to sort her shit out. Fair enough. But somehow, in an adult, consensual relationship, you think that “punishment” is the way to fix problems or issues you are having as a couple? Perhaps grounding her or sending her to her room might fix things for you both? You both need to be adults and focus on the issue and figure out why you are where you are.", "You should rip off the bandaid and break up already.", "See- this is the problem I have with straw purchases. NEVER finance anything for someone else. If they don’t make the payments, it dings YOUR credit, not theirs. If it gets repossessed, it gets reported against YOU. Just doesn’t do it.", "NTA - See if you can sell the car hopefully for close to payoff. Check out Carmax, Carvana, and your local car dealerships. If you can get rid of the car and only have a small amount of balance left to pay you'd probably be much happier than if you just gave it your mom which would still leave you in your same situation (responsible for paying off a car you can't really afford). You'll also probably be much happier if you dump your girlfriend. It sounds like the relationship is basically over anyway.", "NTA - she’s mad you called her out for being a user with no desire to improve.", "Not an asshole", "NTA\n\nBut think about what you're doing. She's leeching off you.\n\nYou're almost an AH for issuing an ultimatum like that, when you should be breaking up with her.", "Unpopular opinion, but YTA.  Not for the goal you are trying to achieve, but for the manner you went about it.  You can't afford rent, two car payments, and the rest of the living expenses needing to downsize and sell her car that is no longer necessary? If she isn't able to cover the payments anymore as agreed that wouldn't be AH behavior had it been presented rationally like that.  \n\nYou made the declaration out of  frustration at your breaking as a threat to her as punishment.  That is AH behavior.  \n\nUnless your mom is planning to take over the payments, giving it to her doesn't address your financial issues.", "NTA\n\nHowever keep two things in mind.  1) It will be nearly impossible for her to find a job without a car.  Especially if you live in America anywhere outside a big city.  2) I am going to get torn to shreds for this, but hear me out.  While you LEGALLY own the car, she MORALLY has some ownership over the car, since she HAS made payments on it in the past.  If you just yank the car away from her, you will be stealing the money she has paid into the car.  You will need to pay her back the money that she has paid into the car.\n\nETA:  I hope you understand that your relationship is over.  If you take the car, she will never forgive you for it, regardless of how fair it is, and regardless of whether you pay her back the money she paid into it.  If she's left without a car, she will be unemployed for much longer than she would have been otherwise, and any hope you have of getting her to work will be dashed.  But also, if you don't take the car, you aren't going to motivate her to get a job either.  Cut your losses OP, leave the car or take it, but either way, it's time to find a new girlfriend.", "Short, sweet, and accurate", "As someone who chased a similar relationship for five years, through a marriage and eventually divorce, I know it’s complicated. OP probably sees flashes of what the girlfriend could be, and wants to support that.\n\nBut OP, you cannot make her into her potential.\n\nYou are not supporting her by shielding her from normal-people struggles. You’re allowing her to be her absolute least-potential self.\n\nAnd I promise that if you take her car away, she’ll figure it out. If you end the relationship, she’ll either find her potential or she will find the next person to let her be her absolute minimum.\n\nNTA, but you’re unkind to yourself and to her if you continue to fund her minimum self.", "As an aside and to piggyback off this... anyone else seeing the giant red flag in the first paragraph regarding the gf losing her job because she failed a drug test...", "There is zero incentive for your girlfriend to get a job.  Why should she?  She has transportation (provided by you) at her disposal so she can come and go as she pleases.  Her rent is covered.  She has no food expenses.  Who buys the gas for the car - is that you also?  Why should your girlfriend go get a job when everything is provided for her by you!", "This 👆NTA", "We haven't heard much about there relationship though. Maybe she is really depressed? I'm not saying you're wrong or that he shouldn't leave but maybe proposing in the situation to get mental help could help? \n\nI don't think I'd be willing to pay someone who is capable of working rent that long.", "Oh man, I just had a Godfather's flashback.  \"Leave the c\\*nt, take the cannoli.\"", "GF sounds depressed and a bit lost to me, but the question is does OP genuinely want to help her through that? If not, OP should sever the relationship so GF gets a clear message to find help elsewhere, don't you think?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", ">wanting to isolate your gf completely because you don’t like something instead of talking to her about it like an adult\n\nWhat is it that Op doesn't like?\n\n>You’re also the AH for threatening to take away something (why are you treating her like a child you have the authority to punish?) that she paid into without offering to compensate her for the value she added.\n\nOp's name is on it, op is footing the bill for it, GF only paid for it when she had a job but now refuses to get a job.\n\n>Also, you specifically admit that you “got it for her” so taking back a gift is super fucked up.\n\nFor her job which was an hour away, but now 0 hours away cause she hasn't got one now.", "She's not giving him any sugar either", "😂😭", "And we all know how kids raised in those environments turn out.", "She is telling him and showing him who she is unfortunately he is not listening. He has a made up version in his head and heart of who she could be, based on his needs and wants, but that is not who she is at this point in her life and maybe never was or will be.", "Depends on the drug. Cannabis? Probably not that big of a deal from the scope of what drug it was. Personal responsibility aside, the drug itself I'd a bigger red flag then failing the test imo", "But it sounds as though 'the way they were' was a gradual downward slide; she happened to have a job when you met her, she lost it because of the drugs test, and ever since then she's been showing you she either isn't able to, or doesn't want to, keep a job.\n\nJust out of interest, did she ever come to you to express worry about the fact that you were now paying for her car and it might be putting financial strain on you?", "Do you actually see that happening? Reddit can often tell people to break off relationships prematurely, but this one… it’s time to leave my friend", "News flash: It won't get better if you keep paying for everything and enabling her. And even if you got her to go back to work and start paying her share, it won't last.  The minute you put a ring on her finger or she gets pregnant she will quit again, if not before.  Why would you continue in a relationship where you are setting yourself up for a lifetime of financial hardship?  Losing her job over a failed drug test should have been enough to end it.  Not being able to keep a job was another big neon sign to get out.  Now she refuses to work?  What more do you need to know she isn't the one for you?\n\nNTA", "As my sainted mother used to say: You can hope in one hand, and shit in the other. See which one gets filled first", "It won't. Before she was masking her true self. Now that she's shown you who she really is, whatcha gon do bout it? Will you believe her or keep wishing for a pipe dream to come true?", "It won't. \n\nBTDT", "I'm sure you realise the downvotes on this comment are from people trying to help you. (Also: NTA)", "Why not just sell it at market value? If money is tight for you, then you aren’t in a position to give away money like that unless you owe your mom a debt or something.", "The C? It’s leave the bang bang right?\n\nEdit: apparently I’m slow, I just got it. Kept thinking about at and then had an “ooohhh duh” moment", "I think that they need to have a long and honest discussion about their future. It sounds like OP has just accepted the status quo up until now, which makes him passively culpable in how the relationship is currently. At the very least it’s worth sitting down and talking.", ">gf only paid for it when she had a job\n\nYes, which means she paid toward it as I said.\n\nNo one is obligated to pay for her. He should break up if it’s a problem.\n\nBut breaking up is infinitely better than treating her like a child and isolating her.", "Sounds like a lot of salt tho.", "School shooters", "If you've lost a job because of drugs , that is a giant red flag, irrespective  of what the drug is..", "Op isn't treating her like a child, he's treating her like someone that can't continue payment on a car so the car gets repossessed.\n\nOp hasn't got enough money to continue paying for the car, rent and his own car. Something's got to go and should be something that is getting the least use, the car.", "Agree to disagree, I guess. We need more info then just \"she lost a job due to drugs\". A failed cannabis test at a desk job is not a \"huge red flag\" to me, especially if it is legal in the area. Cannabis reads positive for a very long time after the effects have worn off, weeks or even months sometimes.", "Cannabis can be detected by a drug test for a few days after use (depending on the amount of use and type of drug test) - meaning she could be coming to work perfectly \"sober\" and still flag on the test. Obviously we don't know the legalities of cannabis in their area, but it's totally possible the employer was overstepping.", "OP, you seem like such a sweet guy but also almost willfully naive. \nI don’t know what field you guys were working in when she got fired or what part of the country you’re in, but the events you just described of “smoked a little weed at a party on Sunday” (implying that is somewhat out of character or at least that she’s not a daily pot smoker) then “totally random, untargeted drug screen on Monday” are highly, highly unlikely. \n\nI know it seems like a small detail to harp on, but I’m wondering if you might see things differently if it turns out the entire “relationship” was an orchestrated deception on her part. \nThink back to the beginning of the relationship if you can. Knowing her the way you do now, does everything she told told you from back then stand the test of time?\n\nWas your former mutual employer known to be trigger happy with the random fire drill drug tests just to keep everyone on their toes? (If so, honestly would then she had even less of an excuse not to pass.) \nBut if this was the first truly random surprise test, wouldn’t you say the timing is just unbelievably unlucky? \nWere you or anyone else that you know of acted to take a drug test that day or was it just her??\nDid you ever independently verify somehow that she was actually asked to take a drug test that that day, or that is was random?? And if she did fail, you’re sure it really was just for marijuana and not something more hardcore ?? \nAgain, I know there are still regions where marijuana is still illegal & frowned upon, but even in those places I think it is often rare for someone to get fired on the first offense for marijuana without being offered some sort of treatment program.", "Why is she smoking weed that close to a drug test unless it was a random? Everyone knows it will take a min a week if she barely smokes to clean out her system", "The drug tests are random, sometimes they're every few days and sometimes they were once a month. Plus it's always just a few people at random. She got tested and I didn't.", "Weed is legal in my state. However,  you can and will be fired/denied employment at a lot of places for smoking it... including the local grocery store.", "> Again, it's not about the car \n\nSome of it is actually about the car because the car was being paid off with a specific stipulation and she’s not fulfilling it.\n\nTaking the car back IS taking steps towards fixing the issue. The gf needs to face consequences for her actions and taking the car away is a natural one. The rest will follow. I still don’t understand why are you calling him the asshole for exactly.", "Right that's one state. Currently, as you acknowledge, other states can and do fire people for testing positive for THC. In addition, we don't know that OP is in a state where THC is legal as it is currently not legal in all 50 states.", "I'm happy for you. I sadly know people who have lost their jobs for testing positive for weed. Hell I know someone who pinged a drugged test because they ate poppy seed bagels.   \n\n\nhttps://academic.oup.com/jat/advance-article-abstract/doi/10.1093/jat/bkac079/6743162?redirectedFrom=fulltext", "Esh, because you should have talked to her about your resentment way before it got to the point you exploded. you also don't say if she is refusing to look not getting call backs or what.", "A gift is a gift. You should transfer the title to her name and let her make the payments, or fail to. The repot man can take it away, but you shouldn’t.", "NTA", "NTA - she’s got two free rides - the car, and you!", "Uumm why are you with her??? NTA but you need to look at the big picture. Bon courage", "NTA, she's using you", "**NTA OP**.  There's an old saying **\"You can't help someone who won't help themselves\"!**  Sorry OP but either you continue to drown in debt or you get rid of the leech before she try to trap you by getting pregnant.  You need to find someone who shares your life's game plan and she's not the one.  She's content to be right where she is, work free and you taking care of her and all the bills.  She don't care as long as you keep letting her live the life she wants to live.", "NTA\n\nIt's not your job to support a grown adult. Give her an ultimatum. Take the job offered, find a job on your own w/i a week, or I sell the car, change the locks & you can find another way to support yourself.", "OP,  you’re her sucker.", "Take this as a lesson learned... don't buy someone a car that isn't going to be responsible enough for it. NTA.", "NTA, but taking away her mode of transportation is a great way to ensure she doesn't get a job.", "NTA.  The hard truth is you have a dependent, not a partner.  Except the dependent is a grown-ass adult.   Don’t give her a break in the purchase price if the car.  She has demonstrated she is unwilling to contribute to the financial health of the relationship.  What makes you think she will ‘buy’ the car from you?  Make payments?  You will be back in the same place except without the asset (car).", "NTA. Why is this woman still in your life. Sell the car, dump the girlfriend, enjoy a positive cash flow.", "NTA and while I agree with others that this relationship isn't and you should strongly consider moving on, at the very least do NOT inflict her on your friends as an employee. You're going to lose all credibility if you want to leverage those connections to help out better, more responsible friends in the future.", "NTA. Sell the car, ditch the freeloader.", "NTA! If your relationship has boiled down to ultimatums because you can't reasonably converse, then it may be time to reevaluate the relationship.  Do you really want to parent your partner? Once you marry, then you inherit your partner's debt too. \n\nP.S. Please do not get her a job or ask friends to hire her, because that is the easiest way to ruin a friendship. It may also erode other people's trust in you when you force them to deal with your baggage ... she will probably be a flaky employee.", "Take the car and use it to drive far away from your idiot girlfriend", "NTA.  Drop her like a hot potato.", "NTA\n\nGet rid of the baggage before it mutiplies.", "Sounds like she's always had issues holding a job, don't know why you still expect her to change. See her for who she is. NTA", "NTA. Run", "She doesn’t need your car, your apartment, or this relationship. What is she bringing to the table? Tell her she has a month to get a job, and must keep it for at least a year, or the entire relationship is over.", "Oh dude next she will want to be a SAHM she is a freeloader get your car and shoe her the door unless you want to keep being the doormat", "Give the car to your mom and leave. She isn't going to change. She got use to you caring for her", "NTA. You need to cut your losses. This relationship isn't going anywhere good and you don't want to have kids with this woman", "NTA You are being used. I'm willing to get that she'll bleed you dry and then leave you when you finally put your foot down. So I guess you need to decide, are you willing to be bled dry? Is the relationship good enough? Is the sex good enough? For me, I like my partner to be a contributing member of our partnership.", "NTA.  Take the car back and sell it.  Stop being a doormat", "NTA. You’re her boyfriend not her father. It’s not your responsibility to take care of her (even if she is depressed). You’re too young to be that unhappy", "So here’s the thing, everything you said is completely reasonable and would make you NTA.\n\nJust know, even if those actions are 100% warranted it’s not going to make the situation any better.  Without the transportation it’s going to make it harder for her to find and keep a job.  And for her, that’s going to be your fault.  Every path, even the correct path, this is going to get worse.\n\nI know this is AITA and not relationship advice.  The real question you should be asking yourself though is why don’t you just get her a U-Haul?", "NTA.  She’s using you man. Time for an exit plan.", "It looks to me like she got comfortable and doesn’t want to change. Question is do you want to change?", "NTA she trying to be stay at home moocher without talking to you about it", "Is she still using?\n\nIt doesn't sound like she will ever be a worthy partner for you. She's freeloading. I don't blame you for being frustrated. It's time for her to get her own place. You need someone who will be in this with you, not be a dead weight.\n\nNTA", "NTA\n\nBut, you seem to have unwittingly entered a relationship with a hobosexual.", "NTA. But your girlfriend is taking you for a ride & taking full advantage of you.", "NTA, but you need to seriously consider the relationship and should make moves to leave the whole situation.", "NTA \nGive the car to your mom. End the relationship. IT’s not going anywhere.", "NTA. Get rid of her. She's using you.", "Sell the car and get a new girlfriend. \n\nNTA", "NTA but can you sell it to help yourself", "NTA.\nYour GF is mooching off you. Failing a drug test is also a red flag. I'm definitely not one of those \"ban all drugs\" kinda people but failing a drug test at work is basically like turning up for your driving test drunk. It's dumb and really illustrates a profound lack of common sense.\n\nYou should immediately sell the car, whether to your mother or someone else and drop your monthly expenses. Tell your GF that you don't have any more money to pay for all of those things and that she needs to earn money. I reckon she will break up with you very quickly and find someone else to sponsor her lazy ways within days.", "NTA when people show you who they really are always believe them ....this is who she is and has been for most of your relationship by the sound of it even if she gets another job to placate you after a short time it won't be good enough like the rest are you sure she's quitting or is she actually getting fired ....I wouldn't even get her the bakery job you could end up loosing a good friend over it", "NTA. I’m sorry to say it but this relationship isn’t going anywhere. She doesn’t respect you. Break it off now before you legally commit to her.", "Just break up and take the car. When you're at a point of laying down ultimatums and she's emotionally abusive bc you don't want to enable her anymore it's far past time to move on. You can't control her. You can only say what you will and won't accept in your life and remove yourself if it's a situation you don't want in your life. ESH you for threatening this instead of the two of you communicating your needs and wants in healthy ways and her for being a mooch and not hearing anything you've said about her lack of contribution to this point. Set your boundaries (i.e. I want to be in a relationship that is a PARTNERSHIP where both contribute equally. I refuse to remain in a relationship where I'm being used and dismissed. How shall we solve this problem and, if unsolvable then we need to speak about going separate ways and wishing eaxh other well) and remove yourself if nothing changes. Controlling her isn't the way.", "NTA. \n\nAnd do you really want to burden your friend with her as an employee (if she were willing to take the job?). Chances are she quit before she was fired from those previous jobs, and the few times she leaves the house, is she using still?", " X@xcx", "NTA, how old are y'all? She needs to grow up and be a productive adult. Does she have any mental illnesses or is she just being lazy because she knows you'll pay for everything (b at that point she's just a user).", "NTA keep the car, ditch the deadbeat burnout.", "Info \n\nHow is she going shopping or out with friends without any money? If she has money she should use it on actual bills.", "It’s going to hell in a handcart.", "> get her some professional help to unpack why she's being like this.\n\nI was with you until this last statement.  How can OP get her some professional help when he is already drowning in debt?  And most likely, since GF don't have a job, she probably don't have any medical insurance.", "That is really good insight and advice right there!", "And the fact he had to buy the car in the first place says that either her credit is crap, or she doesn’t have a license. Either of these is also a red flag. And yes, there could be legitimate reasons to have terrible credit, like a medical bankruptcy. But credit history is definitely something to look into, as it is a clue someone may well be financially irresponsible. So OP kind of knew this girl was financially irresponsible, and used drugs, even before she stopped working at all. Hard pass on this girl.", "I'm sorry, that's never going to happen.  It would be wonderful if we could turn back the clock and return to the way things were, but we can't.  \n\nThe best we can do is try harder and get close to the way things were; if we try hard enough.", "This is what is known as the \"sunk cost fallacy\": I've invested so much in this, I have to keep going in the hope that it will work out. Have you seen any evidence that it will, OP? It doesn't sound like it...  Consider cutting your losses and getting out.", "Evict her", "> selling it to her, obviously at a much lower price than market value.\n\nnope. do not do that. it is just another form of enabling her leeching off of you", "Exactly.  Her new job requires such a long commute because she FAFO at all the places in range of her shitty car.  I don't love a lot of things about my new place after our move, but I'm mature enough to look around and know where my bread is buttered.  Options are limited, so I'm not going to burn bridges on the ones available to me. OP has a GF who doesn't care about consequences for herself and certainly not others around her", "Does that make him the salty daddy?", "Jesus...", "NTA\n\nIf you take a job that has been upfront about brig tests being done at either scheduled or random times your choices are don’t do drugs if you want to take and keep the job, take the job with full awareness you could be selected for random drug test and lose the job or don’t take the job. \n\n\nSounds like gf took the job and decided option 2 worked for her and then she got busted. \n\nOP as you are paying for everything what incentive does your gf have to work?  And where does she find money to go shopping or meet her girlfriends?  \n\nFull disclosure I’m a fossil but my suggestion would be take the car back. See if your mother will either pay you outright for the car so you get some of your initial investment in it back or take over the payments then take ownership after paid off. Also be sure you get both sets of keys to the car back so your GF doesn’t decide to take it back. \n\nAt that same time you might wish to suggest to GF she can either get a job and start paying her share or she needs to find another place to live. \n\nUnless she wants to fix herself what you see is what you will get.", "Move over Salt Bae, there's a new sheriff in Flavor Town!", "It’s kind of two different conversations.  It’s hard to judge since we don’t know what the drug was.  If it was cannabis, there’s a fair argument to be made that being fired for that isn’t right.  I think alot of people would put cannabis on par with alcohol and nobody in their right mind would think being fired on Wednesday for the 3 beers you had on Saturday night is fair.\n\nNo matter what the drug is though, those were the rules in place at the job.  Cannabis use for a desk job isn’t the red flag, but knowing the rule and ignoring it I would say is.", "And we don't know if it was Cannabis, it might have been Coke, the point is we don't know but she got fired for a drug test meaning she is working somewhere they test for drugs and she did them anyway.", "Using cannabis when you can get fired for using cannabis is a red flag just like any other flavour of \"i dont give a shit about meeting my financial obligations\".", "Those are the terms of your employment even if they're unreasonable  Don't smoke weed if your job drug tests, it's pretty straightforward.", "We don't know but the point is that failing a drug test isn't immediately a sign of irresponsibility. Some of those tests are just massive overreaching by employers.", "How much does your relationship  orient on smoking weed together?  Do you have other things in common?", "If you have a job that says you have to wear a red shirt to work, you do that or not work. If you have a job that tests for drugs, you don't do drugs that can be detected if you want to work there. That is being responsible, just wishing away a condition for working somewhere obviously didn't work. My personal belief is that anything I have done in my off time is none of their business but a business can make their own rules. If you don't like the rules, work somewhere else.", "Except it is.  If you work at a place that drug tests, and you go ahead and smoke/snort/pop something on the list of things that will get you fired, that's an obvious sign of irresponsibility.", "Employers typically drug test a new hire. After that, they only test if the employee has injured themselves on the job or given them a reason to supect the employee is using on the job. It’s too expensive to regularly test employees. She’s not a new hire. You do the math.", "At the same time, if your employer is trying to regulate something completely unrelated to the job, that is absolutely a ridiculous overstep on their part.", "Just like I can't wish away my medical conditions of chronic pain and fatigue, cannabis is my only source of relief. Its not moral for companies to dictate what pain medication im using if I'm not using it at work. \n\nI'm pretty worried about what type of job ill be able to land in the future but if I didn't have relief from my chronic pain, I would have no future. I've tried many other medications and it hasn't helped or has made things worse.\n\nI'm going to college for a degree in ecology. I'd like to be able to use my degree.", "NTA. Your girlfriend forgets she is not your wife and/or the mother of your children. Such behavior is only okay if she's either of those.", "Why are you with her? What is she contributing to the relationship?  She sounds like a free-loading moocher and now she's trying to manipulate you by being rude and agressive.  \n\nPerhaps it's time to give her a written eviction notice which may wake her up, or not. Either way, why are you still with her if she's not being an equally contributing partner?  You have some hard decisions to make.", "NTA and why are you with someone so unreliable and averse to work? It’s your car. You can’t afford to keep paying for it. Your girlfriend can’t pay for it. Car has got to go", "YTA ESH", "NTA but you need to rethink this relationship. Why would you want to be with someone who uses you like this?  Her next logical step is to get pregnant. Then you're on the hook for 18 years no matter what. You think she's expensive now, wait till there's a kid in the house.", "NTA, she clearly doesn't think she has any responsibility to you for the car at least (probably for everything) and now considers it your problem alone to finance your shared lives. That's not OK, at all!", "NTA. \nSell the car. She can get a job and save up to buy a used car.", "She's using you. Bottom line. NTA", "NTA.  But OP why are you with her?   She is an adult and from what you described she is not suffering mental or physical health issues that is preventing her from finding a job so she really have no excuse.  She needs to drop the superior attitude thinking most jobs are beneath her and grow up.   It is not your job to shape her into what she could be, she has to want to do it for herself.  \nI think the main question OP need to ask himself is does he see a future with her if she continue to be a lazy layabout and make zero change in herself.   OP is holding on the version of the potential gf who might shape up and be awesome yet the harsh reality is the gf doesn’t want to change.", "Nta what is she even bringing into the relationship/ your life at this point? She's just a parasite", "NTA, its not even the lack of job for me but the entitlement to your hard earned money. You are being taken advantage of and shes throwing a tantrum in attempt to get the car back and continue to use you.", "I’m not answering the question, sorry in advance. Y’all need to break up, I’m so sorry but this relationship has become paternalistic and weird and I don’t think either of you are equipped to be handling this right now.", "ESH I know not everyone understands this but you didn’t buy her a new car. You can’t give someone something you don’t own. If you did own it, you could give it away but you couldn’t take it back once it is no longer yours. It’s obvious why she’s an AH", "NTA.\n\nThis is just a financial reality check.\n\nAs a couple, can’t afford her current choices. As a single income household, you can’t afford her current choices. She either has to wake up and understand the financial reality of her situation or she has to learn to go without.", "Stop wasting your own money and time and dumpppp thatttt biiitchhhhh", "NTA sounds like she has personal issues you don't need to be involved in", "NTA.  You need to get rid of her.  Take the car and kick her lazy ass to the curb.", "NTA, you need a new girlfriend.", "ESH You only because the correct line was “I will sell the car” not “I will give the car to my Mum”. You don’t punish people by taking their toys and giving them to someone else. You sell the car because you can’t afford the lifestyle. Accommodations need to be made if you two are going to be a 1 income household.\n\nHer - she unilaterally decided that your household will be 1 income. At least have a conversation about it.", "NTA: it's a stock answer on reddit, but dump her. She's just using you to support her.", "NTA what did she bring to the table other than a warm body? It sounds like she expect you to take care of. I just dropped her if I were you.", "NTA, take the car away, cut her off on almost everything.  You do the shopping but do not buy her any extras (treats, hygiene products) do not pay any of her bills (no fun without a phone).  Do not give her money as she likes to meet up with friends and you are paying for it. She has two options, get a job or find a new sugar daddy.", "NTA, if she stopped applying for jobs all together then she has no intentions of getting one at all. I'm afraid you are getting used at this point and need to see yourself out of this situation.", "NTA, break up with her. She isn’t worth it.", "So other then her going on her knees tell me what she brings to this relationship?", "NTA. Red flag.", "NTA, but why are you dating and supporting someone so irresponsible, immature and adverse to being a functioning adult?  Isn't that the bigger question?", "I just don't understand why people on Reddit stay with people like this. NTA. It is your car, sell it to help pay the bills.", "Two of my daughters' friends just went through something similar. The guy was simply not making enough to support both of them and her work behavior was the same. She was telling me about it and I said that he would be breaking up with her soon. He finally did it and kicked the girlfriend out. I'm proud of him.", "NTA but if you’re at the point where you have to take a car away, you need to find someone else who will be dependable and contribute. The dynamic in this relationship is not going to be repaired by taking a car away. You deserve better.", "Sell the car. Kick her lazy butt out. NTA.", "NTA. She’s using you. Give the car to your mother. Reassess why you’re in this relationship.", "NTA. Kick the gf out. You can do better than that. Don’t t say, “but I love her”. If that’s the case, then stew in your own codependent issues.  Peace!", "NTA. What a train wreck situation. Get out while you can, but do not tell her as you are making plans. There’s no end to her behavior as long as you are willing to enable her nonsense and she’s shown you, very clearly, who she is. This is far from an equal partnership and is this what you want for your future? I’d sell that car or give it to your mom the day you leave. She’s liable to wreck it, steal, damage or anything else when backed into a corner, especially if she’s using drugs. You are 100% supporting her lifestyle and you 100% can chose more for yourself. Even if she had paid car payments it would be like paying to use it, she has zero claim to it.", "NTA.  she doesn’t appreciate all you do and have done.", "Shouldn't you find a grown-up gf as opposed to dating your daughter?", "NTA.  Give the car to your mom and give your girlfriend to her mom.  Dating is supposed to be fun!  It is not supposed to be one person burdened and stressed and the other getting a sleepover each night.  What is the attraction- for real?", "NTA, technically and legally it is your car. I think the answer is to get a new GF and send this one on her way using public transportation.", "How old is she and how old are you?", "NTA anchors away", "NTA", "I never understood how people can stay with SOs who clearly have zero regard for responsibility.", "Op isn't an asshole, but his idea and the way he phrased the argument is stupid.\n\nGirlfriend doesn't need a car to to go to work anymore, and having two cars when one person works and bills are tight doesn't make sense.  Get rid of the car because it makes financial sense to \n\nSell the car to mom.  His mom presumably needs a car, he has one that's not really needed, sell it to her.\n\nShe needs to get a job because her attitude and mooching isn't fair.\n\nOp managed to make the argument about all of these and none of these all at the same time.", "Well said!", "I recommend being suspicious of anyone who quits their job, or gets fired due to something dumb and avoidable, early into a relationship, and can't bounce back on their own and *you* need to move them in and support them indefinitely. Layoffs are a different thing, those can happen to anybody, but it's usually just a little too convenient when someone claims their boss is an asshole and they've \"had enough,\"\\* or they get fired for a failed drug test or attendance issues, shortly after they feel they've locked you down and you seem nice enough to help them out in a tough situation. And if they have no friends or family they can bunk with temporarily and it has to be you, that in and of itself could be a red flag, it may mean they've already burned through their support network.\n\n\\*it's fine to quit a truly toxic job, but you should either have something new lined up before you quit, or at least have a solid \"fuck off\" fund. Your new significant other is not a valid safety net!", "Yeah no that's not how that works. She's financially abusing you. keep a close eye on your birth control and don't trust that she's taking care of it.", "Let's say that this shiftless and dishonest woman tells you she's eight weeks pregnant. Seriously now, what are you going to do? How successful across your life has looking the other way and wishing been?", "Why would they when she has everything she needs being paid for? Youre a sugar daddy at this point. Time for an ultimatum and stick to it.", "Nta I’d sell the car pay it off, and dump the excess baggage.", ":)   :)    :)   \n\nYou're here with us now, that's all that matters.", "More likely, there were performance issues or something that required drug testing- showing up absolutely stoned, some kind of accident, etc.\n\n\nMost companies that say they do random tests don’t- they just say they do, to justify handing you a slip to go get tested, or a cup to piss in, etc, when they feel you might’ve have gone done fucked up.\n\n\nIt actually takes a lot, to reach that point too.", "Please pay attention to birth control! This is not a time for blind trust. GF doesn't sound one bit responsible. If you're trying to take back control of your life, a baby is the last thing you need.", "What? I mean i can legally drink doesn’t mean I’m going to be drunk at work. See how dumb that soudns", "So she knew it was a possibility and still decided it was a good idea.  Your girlfriend is irresponsible. Who pays for these shopping trips and the trips out work her friends? You? You're a chump.  She has ZERO interest in you except the money.  I am so sorry that you have been beat down and no longer have the confidence to see that you deserve better.  This chick has to go.", "NTA. Keep the car drop the gf", "YWBTA to yourself if you stay in this relationship.", "Why did you think a relationship with her was a good idea?", "NTA but please get yourself out of this before she ends up pregnant", "NTA but you need to realize that you are being used. Get out of that relationship.", "NTA but I think it's time to move on. She is using you and draining you.", "NTA. She is going to allow you to continue supporting her as long as she is allowed. Her lack of responsibility does not bode well for serious adult commitment.", "NTA. Give her a deadline.\n\nseriously think about what you are getting from this relationship. She is throwing a temper tantrum because she is not getting her way and expects you to come groveling back and apologize to her for her horrible treatment of her. You can expect this behavior every time you set boundaries with her. You don’t give ages, OP, but she is not an adult emotionally.", "NTA. You better make sure you don't get her pregnant or you're going to be in a deeper whole.", "NTA for taking the car. But definitely y t a for saying you'll give it to your mom. Leave your mom out of your relationship/disagreements. Relationship101", "NTA personally, I think you should’ve just dumped her when she stopped looking for jobs if you’re paying for the car and the rent that means that you’re also paying for food and stuff and also probably supplying her with shopping money so not only you should’ve taken the car no question but should’ve dumped and kicked her out if she’s not talking to you good luck man", "NTA But I think this relationship is over. You sound like her dad now and she is acting like a petulant teenager.", "Nta but this really doesn’t seem like a healthy relationship at all imo", "Nta. It’s so surprising to me how some girls get guys to pay for everything, even rent, for free! I never met a guy like this . Wake up, OP! Are you her dad? Why are you supporting her?", "NTA. Tell her she has a week to find a job or break up and tell her to get out. You don’t need a leech living off you. She’s using you.", "NTA.. tell this heifer to get a job.", "NTA - It is your car. You can use it - or not use it - however you like. She is not a stay at home parents and you are not married. You do not owe her anything. She needs to cover her half of the expenses. I would absolutely get rid of the car to ease the stress on your expenses and she can get her own shit together.", "NTA\n\nSounds like this relationship is about to end.  Your GF wants to be a kept woman, not a partner.", "NTA - Tell her to get off her ass, get a job and start pulling her weight. Honestly? You need to start planning your escape. She has shown you who she is, and she's not going to change.", "Nta kick that lady out on the curb you'll be much better off and I'm sure she'll find a job right quick.", "NTA are you familiar with \"Why don't you get a job by the offspring\" ?", "NTA , but I'm curious , how is she financing going shopping , but not financing the car you got for her ?? Months out of work I don't understand how she affords anything. \nYou got to drop the hammer soon man, else your just being taken advantage of", "NTA but if u do take the car away she will never get a job. But yeah I agree to have a new car one must be willing to work.", "The fact that she used to pay for it kind of complicates this, even if not legally, morally, the car partly belongs to her.\n\nYou don't really get to take the car away from her and give it to your mom if your gf part owns it.\n\nYou are basically NTA, but you should work on the premise that you \\*don't\\* fully own that car.", "NTA, your girlfriend is a leech", "I’m confused about why you bought her a car.", "Nah your fine you should just dump that sugarbabe you got there to find a real women who can survive by herself( even a onlyfans one is still better than the thrash u got there)", "ye because I mean it's her car still, she paid for it", "😂…. Run buddy", "INFO: why are you with this girl 😭", "I’d just end things, you aren’t married. I have no idea why people act like dating is marriage itself", "info: ...wait was the car a gift to her? and she has to pay for it? or did she ask you to buy it under your name?  was this discussed before you bought it for her? \n\nthese all would widely change the verdict tbh", "NTA Time to kick the freeloading druggie to the curb.", "NTA \nTake it away and break up", "NTA really, but you should sit down with her and have a talo about your future. This isnt right", "NTA, sell the car, pay her back what she put in and break up.", "NTA at all. And I wouldn't risk a friendship (with the bakery manager) by recommending her for a job. She has proven herself to be irresponsible and nothing you do to help her will ever be enough. She is certainly acting like a girl in terms of lack of maturity; she is definitely not your friend.\n\nGive the car to your mom, but it's the girl who needs to hit the road.", "NTA but definitely an Idiot.  Your GF sounds like she has had an unstable life/career since you met, why are you still enabling her? She’s not your dependent but your treating her like a child.", "ESH\n\nYour girlfriend is a mooch or someone in need of social care, and you are oblivious. You've been sitting on this car thing for about 8 months by the sound of it - what do you hope it will accomplish? \n\nWhere does she get money to anything, and why is it not a job if that is a matter of importance? And if you're the one giving her money - why?", "NTA\n\nBreak up, take back the car. \n\nShe sounds like she found someone who will simply pay for what she wants and *that's* what she doesn't want to lose.\n\nAt her point, any job that pays and doesn't send her home in tears is \"good enough\".\n\nTaking the car away might be the only way to send that message.\n\nNot that an (I'm hoping to hell) adult woman should need her (hoping again) adult boyfriend to parent her like this, though.\n\nI'm more worried about that. You sure you really want to date her more?", "Why would stranding her at home help the situation?", "Nta.  You said you would give your car to your mom and she buckles down and gets a job?   No she quits speaking to you!!!!", "To go shopping, no less.", "This succinctly sums up the correct path forward. NTA", "I think it’s worth having the conversation anyway. \n\nNot for the sake of the gf - she sounds incredibly immature and selfish. It’s to OP’s benefit if this relationship ends. \n\nBut any mature relationship is going to require having the difficult conversations at some point. Why not get a little practice in when you’re not invested in the outcome?\n\nOP she needs to either contribute financially, or move out (without the car). Then you can get a paying housemate to share costs with.", "I'm 28 she's 25", "Lmfao", "It was very good and ultimately true.", "At that point he should just break up with her.", "Well, white crystal vs white crystal?", "I took a surprise drugs test once at a place I worked  literally smoked weed that (every) morning. Never heard a peep about passing or failing. Sometimes they're not even looking for weed, is my thought.", "Exactly. \n\n\nShe sees him as a free ride. Stop being that.", "Weed stays in the body for a long time.  A heavy user could test positive a month after last use.  She possibly smoked  within a framed time before the test but it is life.  You use, you lose and if it's something harder than weed she has some issues and probably lacks self esteem.  He is NTA but she needs to not be enabled either.  He probably needs to give her a set amount of days to get a job and start paying for the car.  If not then don't enable her.", "Ask any railroad worker if they think that is overstepping and I assure you they will be taken out of work if they fail any random test.  How about a drunk pilot/ stoned pilot?  Nope  employer is not overstepping.   I can keep on thinking of issues like  getting hurt working fast food on a deep fryer  cause you used the night before or  maybe you're a bank teller and you deposit someone's funds into the wrong account.  Life lessons are hard for people to learn.  You have to hit rock bottom sometimes to wake up.", "Why did I read this is Guy Fieri’s voice", "It depends on the type of job.  If it is like dental, medical, pharmacy attorney  they  immediately do a drug screen.   Risk/liability issues for them otherwise.  Also she could be driving a car for the job, using a forklift or hvy equipment.  Being a trucker,  think about needing to be sober for any job that requires putting others at risk or injury.  They can't and won't look the other way, the very least issue they would worry about is someone stealing for the drug use.  Nope   Things are not that lenient.", "A little common sense here please. Of course this is within context of your job. If you are showing up stoned, your employer has all the right to take issue with that.", "Yup, sometimes there’s an on-hire,  but after… it’s almost never done without a specific reason.\n\nRegulations might be that reason.  But some vie I doubt she’s in any of those jobs. Just saying.", "I worked in rehab for Railroad employees, airline employees etc I know  that they do random tests all the time.  They do it for safety.  They know these people  have lay overs and they know they drink or use at times, not all but the transportation industry is all over this issue.  They would rather try to rehab these people than train a new employee.  So they do random tests on all employees. It is NOT triggered by  any behaviors.", "Some jobs yes see my reply below this one.  But you are not  speaking for all professions I hope.  I  have a ton of common sense. Please.", "They do it all the time with railroad workers.  I think possibly pilots too.", "You may have to think about abstaining for a month prior to any interview.  I understand your issues but  the world doesn't care it's their business, organization and most companies will require a physical for the bigger jobs out there and if you aren't up to do the job  that is a concern for them.  I hope you are going to be okay and it will all work out but please don't use for a month before a interview.   Peace.", "Not the AH. Your GF has issues bigger than the elephant in the room that will cause problems forever. Sell the car, and send her back to her Mommy.", "NTA, deadbeats are gonna deadbeat, she's gotta take responsibility for herself at some point.", "I mean dude it sounds like you are being used as an ATM.  What exactly are you getting from this partnership?  Assuming you see it as a partnership.  She doesn't seem to be pulling her weight.\n\nI'd just tell her you can no longer afford the car and need to sell it.  Then tell her you need her to start coming up with her portion of the rent otherwise you will need to move into a smaller place and there won't be room for her.\n\nIt's more than likely she will just leave, which will tell you everything about how she viewed the relationship.  Or she might step up.", "NTA, but uhhh sounds like you’re attempting to raise a 5 year old daughter and put her on punishment. Maybe it’s time to find someone on your maturity level rather than reasoning with a child.", "NTA but seriously why are you dating her?", "NTA but realize this will be the end of your relationship if you do this so be prepared. Any joint financial accounts take your 1/2 and open a new account at a new bank. Change all security measures for financial, social and streaming accounts before taking the car. Make sure you have all keys beforehand.", "YTA. You cannot threaten to take away her means of transportation like she's a teenager. You legally control it, but you admit that she was paying for it for quite a while. You both own that car, so even if you're legally able to do this it's still wrong.\n\nIf you don't respect her and the relationship isn't working, end the relationship and figure out how to handle the car. Make it her responsibility legally. Do not treat your adult partner like a child.", "NTA but make good on the threat. Give the car to your mother and move out of your shared place. It’s not your job or your place to tell an adult to act like an adult. You’ve given her plenty of time to get her life in order. Time to move on and learn a lesson from this relationship, which sounds like a dumpster fire.", "Time for a new GF.", "NTA - you bought the car so that she could get to work safely. If she isn't working then she doesn't need the car. And if she isn't pulling her weight at all, do you really need the gf?", "NTA. But it sounds like GF has some depression issues. I would give car to mom or sell it, but suggest therapy too. This situation won't solve itself and you've been more than reasonable. If you break up over it I think in the end you'll know it was for the best.", "Take the car back. She's using you financially and won't change until she is forced to do so. NTA", "NTA\n\nCar is in your name and she has been jobless and not paying for it for months. Take this as a clue as to what your life will be like if you continue in this relationship. Don't get her pregnant or this is your life for the foreseeable future.", "NTA", "NTA", "Info: what exactly does she bring to the relationship? Because I'd it's just sex, there are cheaper ways to go about it and some will actually act like they like you.", "NTA I dont see a future for this relationship, I mean, she's technically a burden", "NTA- Sell that car or give it to your mom and find a new girlfriend. She is doing nothing but using you and she won't change.", "NTA, time to end this.", "NTA-  why work when someone is paying everything for me?  You are being used and you need to open your eyes and realize it", "She goes out shopping? With what money?\n\nYou need to reconsider this whole relationship if you don't want a stay at home girlfriend.", "Welcome to the next (however long this relationship lasts) of your life.  She's shown you who she is.  She won't get a new job, she'll just abuse you until you're tired of her shit and you throw her out.  At which point she'll just find some other person to latch onto.\n\nSorry man, but you should just leave her.", "Kindve a lot of discrepancies in the story. 1- how long did she pay for the car with her salary? Because just taking the car would mean you got free payments out of her for the financing in your name. 2- how is she shopping if she doesnt have a job? Or going out with friends? Are you giving her money? \n\nSeems like everyones the asshole here. Need better communication over clear areas that are important to eachother loves. Stop thinking money through actions and discuss it.\n\nAlso.#3- is there 2 cars in this situation? Just sell 1 if you're having money issues.", "NTA.  Don't threaten, do.  The problem will solve itself.", "NTA She is a mooch and if your paying for the car... just put the loan and car in her name and then stop paying and it.. she either gets a job or it gets reprocessed.", "NTA. Make sure you have all of the car keys. Kick her out. This is not a relationship worth saving.", "NTA.  Your girlfriend is pissed because you made a clear boundary.  Boo hoo.  That's what adults do.  Give the car to your mom and let her make the payments if your girlfriend won't get a job and make the payments, and then find a girlfriend who will respect you and contribute to the relationship equally.  xx, Leslie", "Even if you generously assume she didn't have an intention to mooch off you, I hope you realize that the longer she is not working without any consequences to not working, the harder it will be for her to find a job...or keep one.\n\nHer gap in employment will just keep getting bigger.  And it's hard to look for work, especially if you're unemployed. It's unpleasant -- it's unusual to not get rejected in the process. With her growing gap in employment and streak of bouncing around, she will be asked unpleasant questions at interviews. \n\nAlso, you really can't afford that car on your income alone. You can't even afford to give it away.  And you certainly can't afford your girlfriend as she is right now.\n\nNTA", "This. A relationship is a partnership. Right now it seems like only one person is willing to pull the load.", "Lol, comment straight out of r/seducingwomen", "Um, yes; yes I did see that flag!", "Yes yes yes yes yes yes!!!!", "Thank God I live in Canada, where drug tests of the caliber in the US are unconstitutional.", "No, it's an obvious sign of employer overstepping what should be a hard line unless you're working with something like heavy machinery.", "Both are heavily regulated industries.", "With a lot of employers, it should be a hard line, and nothing said she wasn't working with machinery.", "Unrelated to the post (you're obviously NTA OP), but why are you financing two new cars when you are \"struggling to make ends meet\"? \n\nI understand that part of your poor financial status is due to having a deadbeat girlfriend, but come on dude. Has no-one in your life ever told you that taking on debt for a new vehicle is one of the worst financial decisions you can make? \n\nIMO (after you break up with your girlfriend ofc) you should sell both vehicles and buy yourself a car you can afford OUTRIGHT (do NOT take on more debt).", "NTA. \n\nAlso she’s your girlfriend not your wife. Get rid of her.", "NTA, it seems evident that she is using you.", "Just sell it. Oh, and get the fuck out.", "Sounds like you need to ditch the girlfriend. She's dead weight if she's unwilling to contribute to the household when she's able to.", "ESH. Why are you still together? Just break up with her already, you clearly don’t like being in this relationship", "NTA. Be careful she doesn't \"accidentally\" get pregnant, dude", "I’d say YTA - bear with me - if you need to force your girlfriend to get a job and use financial coercion to make her into who you want her to be…. That’s coercive. You’re an asshole for being controlling rather than just making a decision about whether you want to be with the person you’re with. If you broke up with her and took the car with you I’d say not the ass, but being financially manipulative / controlling is asshole stuff.", "NTA leave her. She's a leech that needs to be burnt off. Quit letting her use you. She's fine not doing anything because you're taking care of everything. End it.", "This guy dated this girl (met through her work). He has good job. He soon moves into her place & she quits work (childcare issues). So his \"can pay his bills\" job is now paying all her & her kids expenses. He keeps trying to get her to work. Nope. Few yrs & he's broke, credit trashed, he leaves. She immediately takes up with his best friend (dude knows she's a leach). Best friend married leach & she quits work & takes up a Mary Jane habit big time. He's already complaining...wonder how long til divorce? Guy reminded him again what a leach she is before they married.", "NTA sounds like you got a case of Gold Diggeritis.  I would give her the ultimatum of get a job or get out.  I would also give the car to your mom and have her assume payments on it.  Tell your GF that if she wants a car she will have to buy and pay for one herself.", "NTA\nGet out now", "YTA.  You made it sound like you can't afford her car but then said you'd give it to your mom... And how will she find work without transportation?  You got it for her, it's hers.", "NTA, please consider breaking up with her and taking the car with you.", "relationship sounds horrible. tough as it may seem short term, get out of there.", "NTA get out now and take the car. The relationship is over she is using you and was just eading you into paying for her life. I dont normally say this about people but thats clearly what shes doing", "Why do you want a child instead of a girlfriend? She sounds like me when I was about 16.", "First red flag...\"failed a drug test and got fired\"\nWhy are you still paying for her? What incentive does she have to get a job when you pay for her lifestyle? You aren't a sugar daddy ... you're a fool and NTA. .Take that car away", "YTA", "NTA - but the best thing OP can do for her is take away the car she is borrowing from him (it isn't her car) and probably if she doesn't appreciate that, then break up with her and let her have some time to grow up and mature.  This might be a huge blessing for OP, a nice clear red flag he can plainly see that gives him a chance to bail before things get too far.", "NTA", "NTA. You have a daughter, not a partner. You need someone in your life that understands that nothing is free. If she is to be a partner, she too must provide for the home in some fashion that you both agree to. \n\nShe has decided to be a parasite to you. I suggest sending your girlfriend on her way and letting your mom use the car. Life would be easier for you if you sold it though.", "NTA This relationship is not good for you. You need to reconsider it.\n\nAnd, if you've been depending on your gf for birth control, time to start using condoms YOU buy and keep safe, because a sudden pregnancy might happen. \n\n(And, if thinking about that makes you nervous, you should kick her out immediately, because it means you know deep down that a long term relationship with her and children will be toxic.)", "NTA why are you still there?", "If you think giving ultimatums and threats is ok, that it’s going to magically make her bend over backwards and find a job all of a sudden, just leave.", "INFO is she still taking drugs, which might explain the apathy? Either way does not sound like this will get better.... NTA", ">you cannot make her into her potential.\n\nThis ought to be a bumper sticker.", "This is really good advice. I walked this road as well and in retrospect it would have been kinder for both of us if I had ended things sooner.", "Can you get a medical marijuana card?  I have one and I’ve been told to show it when getting tested and if my card is valid, the lab is not allowed to report a positive result", "Okay, I was ready for a different answer, but NTA. The car is in YOUR name. YOU bought it and are making payments on it, YOU get to do what you want with it.\n\nAlso, NGL, the GF sounds like a deadbeat. Maybe time to consider moving on. She sounds like she's using you.", "NTA\n\nThis is a relationship where only one person is putting in effort and the other is taking advantage of them. Kick her to the curb.", "YTA\nFINANCIAL ABUSE... MEN TRASH", "How come she was paying for the car that you “bought” for her?", "DOT, jobs, ie driving, are subject to random too.  I've had randoms pulled on me at all of my jobs.  There's never a reason for them, except once, but I passed out at work from heat exhaustion that time and the ER did a full tox screen."]}