{"id": 866, "submission_id": "yk352f", "title": "WIBTA if I don't attend my brother's fiancee's funeral because my husband isn't coming?", "selftext": "Names changed,\n\nI'm (f32) married to Luke (m33), and I have 2 siblings Jack (m35) and Zoe (f27). Jack got engaged to Sara a couple of months ago. Sara had some drama with Luke's sister, but this was some time ago and I assumed everyone had gotten over it. Jack and Luke aren't close mostly due to this, but their relationship is getting better (or I thought).\n\nSara recently passed away in a crash. Our entire family is reeling from this. The funeral is coming up and our family are all attending, Zoe was invited along with her boyfriend. Jack said that I can \"only come if I don't bring Luke\". I asked why, he said I know why and Sara wouldn't want Luke there. I was pretty surprised at that and said if that's the case maybe it's better if I don't go as well. Jack really blew up (which I do understand because he's dealing with a lot of grief) and said we never cared about either of them.\n\nMy parents agreed that it wasn't really fair that Luke isn't coming, and Zoe said it's not our choice and I'd be an ass if I don't go to support Jack. So, AITA?", "created_utc": 1667389940, "permalink": "/r/AmItheAsshole/comments/yk352f/wibta_if_i_dont_attend_my_brothers_fiancees/", "score": 831, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My brother's fiancee passed and I'm invited to the funeral, but not my husband because of some history with his sister. My sister's boyfriend however, is invited but not my husband. \nI might be acting selfish and unsupportive if I don't go, making me the AH.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "So Sara had drama with Luke’s sister, but not Luke himself? Weird but we don’t know the reasons so can’t judge on that.\n\nHowever YWBTA if you don’t go at least briefly to support your brother. He is going through grief right now so he doesn’t really have to make sense in his decision so just suck it up, go show face, and move on.", "How does Luke feel about not being invited? Because so far, it sounds like you're the one being offended.\n\nIt's a funeral, a very traumatic moment for your brother, so be understanding and give him your support a) by being there for him and b) by not bringing your husband along. At a later date, when the grief won't be as fresh, clear the air about your brother and your partner being in social situations together. This one isn't about you.\n\nIf you insist on bringing your husband or don't go at all, you will be TA, right now you're just on the cusp.", "YWBTA - for not seeing the obvious, Jack doesn’t want Luke there. Clearly, their relationship is has not gotten any better. Funerals are for the living. Either you go to support your brother or don’t but Luke is really not a factor in this equation. Dead people don’t care who attend their funeral & her funeral is not about you & your family’s drama. Your brother & Sara’s family lives have been traumatically forever changed. Be respectful to their grief\n\nETA", "YTA. Sorry to be harsh but for this, grow up and get over it. I’m sure your husband can handle not going to one funeral. You should be there for your brother, that’s more important than anything else right now.", "YTA.  Funerals are for the living.  Go for Jack.  He is the one who needs support.  If he doesn't want your husband there, don't bring your husband.  You can take a few hours to go and support your brother during the worst time of his life.  Or you can be TA.  Your choice.", "Look, you love Luke, and you want to be a good partner to him. Usually, if your husband was being excluded from a normal family event, I’d say don’t go in solidarity. But this isn’t an unreasonable request from your brother. \n\nThis is the funeral for the woman he loved. \n\nLuke and Sara didn’t get along. Your brother probably tolerates Luke for your sake because, I assume, he tries to be a good brother. That doesn’t mean your brother wants your husband there at the funeral for a woman your husband doesn’t even like all that much… Would your husband even be able to offer your brother the support he needs? \n\nYour brother is going through a very rough time. I strongly urge you to go and support your brother. Your husband can afford to sit this one out. \n\nWho knows, maybe if you and your husband respect his wishes, that could eventually bring you all closer together.\n\nYWBTA if you don’t go.", "YWBTA holy hell. This is horrible. Support your brother and then leave him alone.", "Info: what was the drama? Usually when people on Reddit leave information out it is information that would make them look bad. So, that makes me lean towards YTA.", "YTA. This isn't about you or your husband. Even if what Jack is asking is completely irrational (which we can't be certain without knowing details about the drama), cut him some slack, he's grieving. You need to support your brother and your husband needs to take one for the team.", "YTA. Your brother is grieving. Who cares if your husband isn't invited... the funeral isn't going to be an all day event.", "YTA. Greif is a painful process. In grief, the person faces anger issues. Due to this, he didn't want to invite Luke, and I agree with why. Sara was very precious to him, and he thought that Sara wouldn't want him there. You need to support your Brother right now, not your husband.", "Yes YWBTA it's a funeral not a date. The need for your husband to be there is weird.", "YWBTA your brother needs all rhe support he can get right now, this doesn't need to be about your husband just be there for your brother", "NTA, Ya'll are married and events like this are a package deal. To exclude your husband and not you for something as big as a funeral means that you don't go unless you and your husband are okay with you attending without him. Personally, I would be but if you're not comfortable going because of him slighting your husband then that's reasonable too.", "YWBTA. Suck it up, honestly. It’s a couple hours of your day and it’s ONE day of your life. I feel like Jack and Sarah had reasonable issues with Luke’s family, and really—is this a hill you want to die on?\n\nAgain, it’s just a couple hours of your life TO HONOR YOUR BROTHER’S DEAD FIANCÉ. You might do untold damage to your relationships by not going. Think about the years of damage you could avoid by taking it on the chin, being the bigger person, and honoring an untimely death for a couple hours. Also, Jack’s fiancé just died. Just be the bigger person ffs.", "WYBTA. Please go and support your brother in his time of grief. Your husband will get over it.", "NTA. \n\nHe banned your husband, he banned you by association. If that's his choice, respect it and don't go. Clearly, he doesn't care too much about family being there.\n\nI see loads of people saying, \"It's your family, support your family.\"\n\nGUYS her husband IS her family. By barring some of his family, he's barring her, and he clearly doesn't care if family comes if he's cool with that.", "NTA", "YWBTA if you don't go. Set whatever drama it was to one side, no matter how severe it was, and think of it this way: your brother is grieving, he needs you. Ignore Luke, ignore Sara, ignore everything else except your brother. He's going through hell and he needs his sister. Perhaps try finding a middle ground, where you go to the funeral but don't stay for the wake? Funeral services are usually fairly short, a few words from family, some goodbyes said and then some songs near the end. I'm sure you can manage that for the sake of your brother. If you cannot, then be aware that he will remember this and it will likely permanently sour your relationship with your brother.", "YTA. This isn’t about you. This isn’t about your husband. This is about your brother and his pain. He has loved you enough to maintain a relationship with you. Be there for him. Don’t defend your husband or his sister. Just be there for your brother.\n\nBe there for your brother now or don’t bother in the future because you won’t be welcome.", "YTA if you don't go to the funeral to support your brother, and the best way to make sure that what you're worried about (starting a trend of Luke not being invited to things) will happen is to make a bfd about this and not go to the wedding. Just go and be nice and supportive. \n\n(Just to be clear even *thinking* 'you wouldn't be so sad if you'd only dated Luke's batshit sister in the first place' is not being supportive)", "YTA. Your brother is grieving the loss of the person he thought was going to be his life partner. This is a HUGE loss and his family should support and rally around him in whatever ways they can. It seems that your husband probably isn’t too upset about the death and if it helps your brother grieve comfortably, you should both be mature enough to just not push this. He wasn’t mean about your husband not coming, he just said that for personal reasons he shouldn’t attend. Reasons your husband undoubtedly understands. Also, it won’t just be your brother and your family there. Your brothers fiancés family will be there too and maybe they don’t all like your husband for whatever happened in the past. That’s allowed and they deserve to grieve their loss without any added distress. Grow up and support your brother who is experiencing likely his greatest loss to date.", "This isn’t about your husband- this is about you supporting your brother and your husband should be encouraging you to go.\nYTA if you don’t go or kick up a fuss about this", "NAH. If your husband not invite, don't go. He is your partner. Support your partner, it seems your family does not support your marriage.", "Since you haven't responded to any of us asking about Luke's opinion or feelings I'm going to go ahead and say, the funeral isn't about Luke, or you, or even Sara. It sure isn't Zoe's or your parent's business.  The funeral is about Sara's family & Jack.   Now Jack is your brother, unless Luke says you're not to go, you get your butt up and go hold your brother tight.  You love on him and you make sure he knows that you AND Luke welcome him in your home anytime and that you love him.\n\n&#x200B;\n\nIf Luke says no......then my belief is our spouse is our first family to stand by.\n\nNTA yet.\n\nBut in a few months you need to make it clear to your entire family that your husband is not to be excluded from family things.", "YTA. Like really the asshole. You are telling me your husband supported his sister in fabricating lies about cheating in order to break up Sara and your brother. Which caused Sara to go into a depression, and you think it’s that easy to get over? Hell I know Sara wouldn’t want him at the funeral, and I totally understand why Jack wouldn’t want your husband there. He supported an unhinged person in breaking up his relationship. What the hell", "YTA your brother is grieving, you need to be an adult here and support him.", "YWBTA I think. \n\nSupport your brother. Surely your husband will understand.", "Your brothers fiancé literally died. You would 100% be the AH if you didn't go.", "YTA.  This is not about Luke.  This is about you being there to support your brother.  You can sort out exactly why the issue with him and Sara’s family isn’t as resolved as you thought it was later.", "You need to go to support your brother in his grief.", "YWBTA and you already are TA. \n\nYour brother just lost his fiancée horribly and unexpectedly, HER FUNERAL IS NOT ABOUT YOU OR YOUR HUSBAND. Know that if you don’t go, you’ll likely never have a relationship with your brother ever again. YTA already for adding stress onto your brother right now by picking fights. I can’t believe someone has to explain this to you. \n\nIf it’s upsetting you that your brother didn’t want your husband at the funeral, that’s something to be discussed down the line. It doesn’t hurt anyone for you and your husband to respect Sara’s wishes right now, and discuss/try to work things out with your brother later. \n\nAlso, this doesn’t factor into my judgement at all, but I think you’re hiding something in your comment about the drama. I don’t see how a bad date and an argument between sara and your sister-in-law, which seemingly was years ago, would currently affect your brother’s relationship with your husband. I also don’t see why an argument would have sent Sara into a depression unless you’re hiding the magnitude of your sister-in-law’s harassment/abuse. The way you described it sounds very immature, not like a soap opera, as you described it. I also think you’re downplaying your husband’s involvement to sway people’s judgment.", "NTA.  A spouse is an extension of oneself.  \n\nIf your husband isn’t welcome, then you aren’t either", "NTA. I wouldn’t go either.", "I am fully prepared for my down votes but absolutely NTA. Grieving doesn't give someone the right to just act how they want. It sounds like your husband was not even involved in the drama other than being related to the other party. Funerals should be about putting aside petty differences and coming together not being used to tear them further apart over old petty BS.", "YTA there’s no coming back from skipping a funeral or a wedding.", "Your brother is grieving and doesn’t want someone there that hasn’t supported him in the past. That’s understandable. I also understand that it stings for you that he doesn’t want your husband there, and could be going overboard in what their disagreements/issues are because of his late fiancé. Don’t be petty - it’s not the time for it. Your brother needs your love right now, not a fuss. YTA if you continue on like that.", "YWBTA\n\nUnfortunately I have a lot of experience with funerals, I can tell you that it is a day that is 100% engraved in everyone's mind, even the smallest word you say.  Everyone will start commenting on your absence and it will become part of that day.  I recommend that you go that day, do not say anything about why your husband is not there, just go unnoticed but morally support your brother, because if you do not go, it will greatly affect your relationship with your entire family. There are times when you can stand up for your husband, but this is not it.", "YWBTA. This day isn’t about your husband, it’s about supporting your brother. It’s a funeral for a woman he didn’t get along with being held by an entire family who probably doesn’t want him there, not just your brother. \n\nAlso if I have this correct your husband’s sister went psycho and lied to your brother’s girlfriend to break them up. So her actions literally resulted in him losing the woman he was in love with short term and potentially permanently. And your husband was ok with that and supported her ?? I understand standing by your family but when somebody clearly is wrong there’s no way to justify supporting their bad behavior. I honestly can not see why he would even want to go to her funeral.", "I think you might be the asshole.  Does Luke care that he is being excluded?  Are you making this about you?  Can you not get through the funeral without Luke?\n\nQuit asking grieving people to act sane/ rational.  That's not fair.", "I don't really know, we don't have enough info IMO.\n\nWhat was the drama about? Has there been a big fight? Did they ever spoke of it and resolved the issue?\n\nAlso, you didn't say \"Fuck you, I will not come to the funeral\", you said, as you wrote, \"Maybe, if that's the case, I shouldn't come either\" and I interpreted that as \"Maybe you are inviting me only because I am family, but I don't feel welcome\"", "YWBTA \n\nJust go and support your grieving brother, wasting energy being salty that your spouse isn’t invited is just pointless.", "YTA. Your brother is grieving and needs you. Now is not the time to take a stand to defend your husband. The fact is having Luke there would upset your brother even more than he already is as would not having you there. It doesn’t matter who is right about the argument,  it matters that you support your brother. The argument will probably blow over in time. His sister not coming to his fiancée ‘s funeral will never blow over. Why is this even a question?", "So to summarize your SIL ( Luke's sister) kind of stalk your brother after one date, harassed Sarah to the point she felt in depression and for you your brother and her family should have left this in the past? \n\nYou said Luke's family talked things out with your brother. Did they apologise or did they try to play down what happened? (The way you described her make me think they try to play it down in order to minimise any consequences). \n\nYour brother loves you enough to keep contact with you despite the fact that you married into the family of the person who was obsessed enough to hurt one of his loved ones. He loves you enough to ask you to support him in this difficult moment but you're too self-centred to see what your husband represent to him and Sarah's family. If you want to burn this bridge you should absolutely stay home. \n\nYTA", "YTA.\n\nNeither your husband or you have any direct connection to the deceased. The funeral is not for you. It's for your brother and the people who knew her. \n\nYou would be an ass if you chose to not support your brother at a time like this", "YWBTA. This isn't a wedding, it's a funeral. You will be there to pay respects and to support your grieving brother. This isn't a social visit where your husband is being slighted.", "YWBTA if you don't go.   This is bigger than some old drama so suck it up and go and address the rest later.   You're right about the exclusion,  so you can go and then let Jack know later that you attended to support him but you will not continue excluding your husband.", "I understand where you're coming from but YWBTA, you don't need to 'win' the funeral and if your husband can help by not attending when it presumably isn't a must-attend event for him then he should. Husband should let brother know that he understands and reiterate how sorry he is for the loss. Pushing this issue is just going to ruin husband and brother's relationship irreparably.", "I'm all about supporting your spouse and creating boundaries about how you are willing to be treated, but now is not the time.  Go without DH and support your brother in his grief.  The grieving \"spouse\" is allowed to be unreasonable at this time and also allowed to say what is going to help him most.  What is going to help him most is not being reminded of an argument by having your DH around.  It is not about your DH at this time.  \n\n\nYTA, sorry.", "YTA. You're supposed to bring comfort to your brother in a difficult time, not more problems", "YWBTA - the funeral isn’t about your it’s about her loved ones and supporting them. You brother needs you at the funeral. You need to go. It’s ridiculous that Sara’s drama with Luke’s sister is effecting everything when everyone involved seems to be in their 30s. Your sister was means to my sister so I can’t be polite at shared family gatherings is 16 year old stuff not 30+ stuff. However, she is dead now and her funeral isn’t the place to make a point. Go for your brother, you will regret if you don’t.", "ETA. Putting conditions like that on you is messed up. If you were close, then telling you specifically not to bring the person that would support you is spiteful. But on the other hand, if you don't go, it's unlikely you'll have any relationship with your brother afterwards. But with only limited information, it's not really possible to judge if that's a relationship worth saving.", "YTA. Just read why Luke isn’t invited. Luke should absolutely not be invited. Luke and his family deeply hurt Jack and Sarah.  It’s a huge betrayal if you choose the people who hurt and manipulated Jack and Sarah over them.  Your husband is in the wrong, not your brother.  You need to be there for your brother and not his stalker’s family.", "I have a feeling I may be the only one.... but NTA.\n\nYes, OP should be able to go and support her brother but her brother cannot impose restrictions without consequences.\n\n>Sara wouldn't want Luke there.\n\nI'm sorry but Sara isn't there to give her opinion.\n\n>I'd be an ass if I don't go to support Jack.\n\nWho is going to support OP? If not her husband, then who? It's the death of her brother's partner. There are going to be extreme emotions and no one in her family is going to be able to support her when they are supporting Jack, which is entirely fair, but then she should be able to bring her support system with her.", "Honestly yes YTA.i think you should support your brother and keep the drama to a minimum", "NTA I understand he's in a bad way but no unless there is a good reason standing with your partner is the more important thing imo", "I'm going to go with NAH.  Your brother is grieving and will be for a long time, so yes it would be good if you would be there to support him.  That being said, your husband is your partner and if he isn't invited, I understand you not wanting to go.  Per your above statement though \"Sara had some drama with Luke's sister\", so that is Luke's fault how exactly?  Also, I suppose it is different in different places, but I don't really understand being invited/uninvited to a funeral.  If someone dies and there is a viewing/funeral and you wish to pay your respects, you just go, no invitation needed, but like I said, that may be different in different places.  The bottom line is this situation sucks all the way around.", "yes, of course. Your brother is grieving, he’s allowed to be a little bit unreasonable right now. Is his disinviting your husband stupid, yeah of course, but does it make any difference to your husband- no not at all. So why do you have to die on this hill? yes, you will be the asshole if you decide to be petty about this one thing to your grieving brother, and you will damage your relationship with him probably permanently.", "YWBTA. In most situations, you’re right in that supporting your spouse comes before everyone else. If they’re not invited, you shouldn’t go. This is one of the very few exceptions. Your brother is grieving and struggling to deal with a million painful emotions. Dealing with one thing more by remembering that his fiancé had been upset by your husband and wouldn’t have wanted him there (doesn’t matter who was at fault or what the reason was, just that he has these feelings), might be the thing that breaks him. He needs support from people who love him right now far more than your husband needs a defender.", "NTA You should have a discussion with your husband, to see what his thoughts and opinions on the matter are. It is a team decision, but if your husband really wants to work on his and your brother’s relationship he would tell you to go. Either way even if you don’t go on your own accord your husband will still get the blame", "YTA", "Funerals are for the living. \nYou should do your best to support those who mourn.", "INFO: What’s the drama? This sounds like missing reasons.", "Nta...if they can't resolve their issues then you're a united front and you stick with your husband...send your condolences and be done with their drama.", "YTA. This isn’t about you. Grief is a heavy solemn pain that doesn’t go away easily or quickly. Forgive your brother for not acting in a way that you consider rational right now and go support him. He and Luke can mend this later. If you don’t go you’re throwing your relationship with him in the garbage and you’ll both have to mourn that too. Luke will be fine for one afternoon at home. Thank your lucky stars you still have him when you get home.", "YWBTA just got to the funeral and figure it out later. You can’t get the experience back.", "YTA since you provided no information on the “drama” or the what the conflict actually was. Can’t help but feel like you’re leaving out the real reason your husband isn’t allowed to attend the funeral.", "YTA\n\nGrief goes outward, your brother has asked for your support - YOUR support not your husbands.\n\nDoes it seem wrong that Sara hated your husband over something his sister did? Yes (though I suspect there's more to that story) but Sara has died, she's not the one asking for support or being judged", "Yta, go support your brother there's no need for your husband to be there. Figure out the drama later, this is your family.", "Are you seriously not going to support your brother on one of the hardest day of his life because he wants to honour his dead fiancé's wishes?\nIt doesn't matter what the beef between Sarah and Luke was, your brother is simply sticking to what he thinks Sarah would want in her funeral.\nBe a good sister and be there for your brother. Yes, YWBTA.", "Info: who is paying for and in charge of the funeral? \n\nJack or Sarah's family? \n\nUnfortunately Sarah was his fiancee not wife, so typically that means her family would be in control. \n\nHer family doesn't even have to invite Jack. So if they have rules and feelings on who can attend then what they say goes. \n\nJack was not Sarah's only family and in another comment you said the funeral is private because that's the way her family wanted it. So more than likely her family is in charge. \n\nYou don't get a say in this. Jack doesn't get a say in this. \n\nLeave luke home, respect Sarah's family and support your brother. \n\nIf you don't YTA", "YTA. \n\nYour husband’s sister caused major issues in Jack’s relationship because she was obsessed with him after one date. She lied to Sara and broke them up - and your husband got involved in it all. Perhaps Jack doesn’t want any reminders of that time. \n\nYou should be supporting your sibling when he’s grieving - just as Luke supported his sister, even when she was in the wrong. It’s not the time to stand with your husband - he doesn’t have to go to the funeral but you should, as a good sibling.", "YTA\ni see that Luke didn’t really have anything to do with this from what we can see but that doesn’t matter, your brother comes first here, he’s grieving, you need to be there for him", "YWBTA\n\nYour brother is grieving.  He is allowed some room to do things that don't make a lot of sense. \n\nPresumably Luke is not going to be heartbroken if he can't go. Just go, support your brother, and put all the drama aside for a while.", "YWBTA - I would be like jeeeez, but your brother is grieving. He gets a pass for not wanting your husband there and for blowing up. \nGo. Support him. Or lose him. This is something he wouldn’t forget. \n\nLook, if you go, and he’s starts ranting and raving about your husband because of the beef Sara, then you can quietly leave. At the end of the day, you get to go home to someone you love. Your brother doesn’t.", "YWBTA. Even before I read the details about the drama. This isn’t about your brother and husband liking or not liking each other. And your husband is not entitled to go to the funeral and it isn’t necessary for him to be there. You should go to support your brother.", "YTA. \"Some drama\" is so minimizing. You should really have lead with a more honest assessment of what happened between Luke's sister and Sara.", "NTA.  Support your partner.", "NTA Your husband's sister is an asshole though!\n\nYour brother is punishing your husband for what his sister did, your husband had nothing to do with the drama his sister pulled YEARS ago.\n\nHe is making this funeral a family drama when it is time to say a finally goodbye, his emotions are running high but he doesn't get to give you the *me or your husband* ultimatum bullshit.", "YTA he doesn't have to invite your husband.", "YTA. Yeah, it sucks and seems petty. But holy shit, your brother is going through some life altering, mind altering stuff. Go support him!!", "YTA \nIt’s not a headship to leave husband at home.  It’s not a wedding.   Go support your brother and leave it at that.   Also, your post is extremely vague as to what went on with your husband and brother/fiancé.   I am guessing those details matter.", "NTA\nJack is grieving, I understand that.  He made a choice in saying you can come but not Luke.  You can then turn around and make the choice if you want to go or not.  Maybe talk to Luke and see how he feels about you going without him vs standing by him and supporting him.\n\nMaybe you and Luke should send Sarah’s sister a card and flowers, to send your condolences…don’t just sign the card for him, have him sign it too…that would go a long way in bridging the gap in the family…after all, that is kind of where the trouble started", "YWBTA if you don’t go, prepare to never have a relationship with your brother again", "YTA.\n\nYou mention in the comments Luke’s sister was obsessed with your brother to the point of lying about being intimate with him in order to break up his relationship.\n\nYou add to that information that Luke’s sister is smart and pretty and you don’t understand why Jack didn’t/doesn’t(?) want to be with her.\n\nIt strongly sounds like Luke’s family, including you, are dismissive of Luke’s sisters problematic behavior and don’t hold her accountable for anything.\n\nEven without good reason people in mourning are allowed to be selective about who they want around them while grieving. Your husband didn’t have close relationship with your brother or with Sara. He wouldn’t be helpful to your brother’s grieving process and isn’t grieving the loss himself, therefore it’s okay for him not to be there. You mention answering on his behalf. Did he even want to go in the first place?\n\nBut based on your comments, your sibling *has* a good reason. By dismissing that you risk the chance of destroying your relationship with your brother.", "Goodness, they all really put you in a tough spot. But since it's your side of the family I think you need to talk more about it with your brother Jack. It's really inappropriate to not invite Luke to a funeral because of \"drama.\" BUT. It sounds like it might be more than drama. I think you have an obligation to try to work through this with your brother Jack on behalf of your husband. \r  \n\r  \nIf you decide not to engage further and just go forward with your plan not to attend, YTA. \n\nIt sounds like there's... a lot more to it than what you've written, so results may vary.", "YTA- if you don’t go prepare to end all relationship with your brother. He’s at a low point, he’s maybe not rational. Why is this a thing you need to fight your brother on? \n\nAnd I read the reasons they’ve got a dispute that’s a good enough reason for him to not be there. It’s not game of thrones they don’t need drama at the funeral it’s just one less burden on them. Show some compassion and don’t make it about your wants.", "Funeral is for the living. Go there to support your brother who lost a loved one. This is not about you and your husband. Also, your SIL actions are terrible. Your husband stand by that? Questionable character. YTA.", "INFO: what was the drama about? I think there’s context missing here…\n\nIn any case, your brother isn’t thinking rationally right now. YWBTA if you didn’t support him.", "YWBTA. Your brother is broken. Sara is dead. What beef is there left except that being fabricated amongst the living? Take the high road, support your brother. If your husband is a good person, he won’t revel in the death of Sara and will understand the important of being there for your brother. And especially since doing the right thing now will substantially uncomplicated your lives later.", "I don’t understand these people that say you would be ta if you didn’t go. You and your husband are a team, and should be in solidarity together. NTA", "YTA\n\nSomeone worded it well: this isn't Christmas supper. It's the last act you can do to her, it's the last farewell. If she wouldn't want your husband there, that's fine. And it's your right not to go as well, but make sure this is really want you want your last act for her to be like. Not show up because you're mad your husband wasn't invited?\n\nEdit: your/you're", "I was on the fence when first reading this one but the comments definitely shows YTA if you miss the funeral. \n\nYou may see it as something minor with Luke supporting his sister but it’s so much more to Jack. \n\nThe sister caused the woman he wanted to spend his life with to go into depression with her abuse and lies. And Luke supported that. Why would your brother or Sara’s family want that reminder at her funeral. I don’t even understand how you ended up marrying Luke with how his sister treated your brother. \n\nYour brother is grieving and at times like this memories come back. Luke would be a painful memory for him even if he was growing to have a better “relationship” with him their is memories and pain associated with Luke and his family. \n\nYou have a decision to make. Are you willing to lose a relationship with your brother? I don’t think there is any way to come back from this if you miss the funeral and like others have said everything else can be discussed later after Jack has had time to grieve.", "YTA. Look up the “circle of support” and realize that right now, your brother is in the very middle and needs his family to set everything else aside and support him in his grief.", "Info; what does your husband think?", "ESH. All of you seem exhausting", "I mean, I think your brother is being unreasonable but he kind of gets to be unreasonable right now because his fiancé just died tragically. I think YWBTA if you can’t find it in you too just support your brother and your family right now. This isn’t about you.", "YTA \n\nIt is a funeral not a wedding", "YTA go to the funeral. Although i do find it weird that the fiancee is dictating a guest list when technically her parents should be in charge of that. Also ive never heard of people being invited to a funeral just banned.", "The drama was between the girls, from what you say, but apparently it was juicy enough to get the men involved and they're still feeling some kinda way about it. \n\nWhich *doesn't matter*. Someone is dead now. Drama takes a back seat. \n\nYour brother has lost his fiance in a sudden and traumatizing way. He has asked you to be there for him. \n\n**Be there for him.** \n\n**You'll regret it forever if you don't.** \n\nNAH, he's grieving and you're an innocent bystander being \"punished\" in lieu of your spouse. But go to the funeral, with or without your husband.", "Soft YTA. I understand your reasons, but a funeral probably isn't the time to make this stand. Go to the funeral and support your brother, and hopefully, in time the tension between Jack and your husband will resolve. You'd stand to lose a lot more by not going - possibly causing irreparable damage between you and your family during a difficult time - than you would gain by not showing up as a show of solidarity with your husband. In five years, you'll know you did the right thing regardless of how it worked out.", "YTA - it’s a couple hours of your life to support your grieving brother. This is not the hill to die on nor the time for sorting out past grievances. Go to the funeral without your husband….deal with the drama another time. Do not bring any of it up at the funeral!!! This isn’t about you", "I'm not going to decide YTAH or NTA because grief makes things horribly weird.\n\nYou should go. This isn't about Sara or your husband. This is about your brother, who is grieving and needs your support.\n\nIt might be awkward to go without your husband, but go. \n\nJust go. Deal with the other stuff later.", "YWBTA. You should be supporting your brother. If he feels it’s in the interest of Sara for your husband to not be there, then you support your bother alone.\n\nIf you do not go, assume you have rightfully lost the support of your brother.", "YWBTA simply because the funeral is not only to mourn your brother's fiancée but to mourn a daughter/sister/cousin/granddaughter/niece/friend etc. There will be others there grieving, some may know of the drama and absolutely  no one will appreciate drama.", "NTA. If this dispute between Sara and Luke’s sister is so great that her brother will ban her HUSBAND from a family funeral (this is his SIL, whatever their previous differences), then clearly OP is also guilty by association and shouldn’t attend.", "YTA your brother is in mourning, the funeral isn’t about you or Luke. Be there for your brother.", "YTA. So your husbands sister tried to ruin Jack and Sara’s relationship and you’re wondering why Jack isn’t invited.", "INFO what kind of drama exactly? And why would drama with Luke’s sister be reflected on Jack and Luke’s relationship? \n\nTentatively I would go NAH, because if Luke was really unrelated to the drama then it stands to reason you would want to support him. But Jack is grieving and Sara might not have gotten over it the way you assume, so he wouldn’t want to deal with it while also grieving his fiancee.", "YTA you need to go to the funeral alone. Luke’s sister and her whole family terrorized and bullied Sarah to the point of breaking them up and causing depression. Luke ABSOLUTELY should not be there. He’s a reminder of pain for Sarah and it’s her funeral!!!\n\nI can imagine family members even wanting to tell him off. Is that the atmosphere you want to create at her funeral?!\n\nIf you are a decent sister you will apologize and attend the funeral alone. Luke needs to be nowhere near Sarah or her family.", "I have to go with YTA, especially after reading why your brother's fiancee didn't get along with your husband. However, it's clear you plan to not go and lose your brother permanently. You already previously chose to date a guy who was trying to convince your brother to go out with his sister who your brother did not want to date and who spread lies about your brother cheating so the girl he DID want to date would break up with him, which is a weird ass choice.", "I don’t want to say YWBTAH because I think this is more serious than some arbitrary vote, but I think you will seriously regret not going. Your brother will probably never forgive you (or Luke for that matter). I don’t know how Luke has handled Sara’s passing so far, but I think what he says/does in these next couple weeks will go a long way. This drama didn’t even originally involve him. I think him telling your brother along the lines of “I understand due to our history you not wanting me to be there, but I would like to pay my respects,” will ease some of the tension between them right now. Either way you definitely need to go and hopefully your husband is understanding. This isn’t about you, or Luke, but not going makes it about you two which seems petty right now.", "Yes YTA you’re brother is grieving, it may not be fair your husband isn’t invited to the funeral, but are you really willing to lose your relationship with your brother over your husband not attending a funeral?", "Yta, your calling it drama between Sara and your SIL via your husband from years ago but your brother's response even in grief concerning your husband says it has nothing to do with said unnamed SIL and is way more recent.  Stop lying to us and holding things back and state the truth, it sounds as if Sara and your husband are really who has history along the lines of her saying no and him not listening and you believing him not her.  The problem is your husband from this tone not his sister and the sooner you deal with the truth the better", "YWBTA for ditching your brother at his fiance's funeral. Your husband played some part in your brother's and his fiance's past trauma, so it's understandable that they don't want to see them. Respect their wishes. Support your brother. \n\nDON'T MAKE THIS ABOUT YOU! FFS", "It sounds like the reason your husband isn’t welcome is because the sister will be there who had drama with him?\nI’d say YWBTA if you didn’t go at all. There’s some things you are a unit in and some things you can be separate in. If your husband has some sort of bad blood with her family it would be less harmful for him not to come. Go for your brother and your family. We don’t have enough info to know what happened between your husband and the sister to really say wether it’s justified he’s not to come or not, but it’s really not your call as the future sister in law to make a call that’s probably coming from the sister.", "From your comments, your SIL is unhinged and didn't get over Jack and tried to ruin the relationship with his now deceased fiancée.\n\nThen husband's family tried to talk to Jack, I guess and get Jack to forgive and forget. \n\nQuestion is, how hard did your husband go into getting Jack to look past SIL's actions?\n\nDid he do anything or did Jack just lump them all together even if your husband didn't personally do anything?\n\nDoes Jack see this as an attempt to hook his sister up at his own fiancée's funeral?\n\nDo you think he'll (your husband) do that?\n\nI need answers here.", "NTA. \n\nYour husband did nothing to Jack at all. He is not responsible for his sisters behavior and to put someone else’s behavior on their sibling is reaching. It’d be like your brother doing something wrong to Luke and then Luke getting mad at YOU for your brothers actions. \n\nYour brother is grieving and I understand that hurts and it sucks. But that isn’t a reason for your husband, who had done nothing wrong, to not be invited to the funeral. And honestly Zoe needs to butt out. This isn’t her drama. \n\nYou can go if you want to, but even if you don’t you’re not the asshole.\n\nEdited: took out wedding and replaced with funeral lol.", "So, what was the drama?", "YTA\n\nYou’re really trying to make someone’s funeral about you?", "YTA your husband's sister was the cause of the \"drama\" and your husband enabled her. Also, it wasn't drama she did some serious damage and put someone into depression. And your asshole husband supported and enabled his sister. Are you surprised your asshole husband didn't get invited to the funeral of a person who hated him and his sister? Someone they bullied? Your brother is gracious that he even invited you, maybe blinded by your sibling relationship. Glad you cleared that for him.", "YTA. Your husband’s sister lied about Sara and drove her to depression because she had feelings for Jack after one date and wanted to break them up. Your husband and his family supported this. \n\nIt makes perfect sense why Jack doesn’t want Luke at her funeral, but even if he didn’t have a very good reason THIS IS A FUNERAL, not some party he’s missing out on. You are not the grieving party in need of your husband’s support; your brother is the one who needs yours. Get out of your feelings and be there for him jfc.", "YTA", "NTA. Ultimately you and your partner come as a package. That's how it is.", "YTA. You have no leg to stand on here. A funeral is very different from the \"other family events\" you are afraid to set a precedent on. I mean, the fact that you're with someone who would defend what his sister did to YOUR BROTHER is horrible, but if you don't attend this funeral, when you KNOW your brother is having a hard time because he just lost the love of his life, then you're a terrible sister and don't deserve to have any contact with your brother. And that's where this is going if you don't go, by the way. It won't be \"what if they won't invite my husband to family dinners?\" Instead, it'll be an issue where your parents have to decide who to have Thanksgiving with because I guarantee your brother won't want to be there if you are. And that's not an exaggeration. Your brother is in an insane amount of pain, and you even considering not going when you know he wants/needs you there for him...\n\nDo better.", "YTA for making this about you and Luke. It’s not about you. It’s about the very real grief your brother is feeling right now over tragically losing someone he was going to build a future with. You don’t have to agree with your brother’s decision, but you should be there to support him. Set aside your feelings about the situation and just go. You’re only going to cause more tension in your family if you don’t.\n\nEdit: Name change. I accidentally wrote Jack when I meant to say Luke.", "yes, you would absolutely be the arsehole for not supporting your brother at this time. he doesn’t want luke there because the man was in support of his harasser and that boundary is fair. \n\nthe fact that you got together with the brother of that woman is weird as fuck to me. I cannot imagine how that played out, when you met him while this shit was going down (his sister harassing your sibling and his partner); but you should absolutely support your brother who just lost his fiancé", "YTA already.  And I really think anyone not voting that way is not reading between the lines here.  \n\nOP, you are already showing yourself to be on Luke’s sister’s side with how you describe her and claim to not understand why Jack wouldn’t want to date her.  \n\nThis woman went on one date with him and then tried to ruin his next relationship with lies.  This sounds like harassment and borderline stalking.  The fact that this woman confronted Sara at all is terrifying to me.  They went on one date, she is not an ex girlfriend, in no way was it appropriate for her to talk to Sara let alone frame her??? And then you say Luke’s family got involved which is how you met him - so you’ve clearly taken his family’s side otherwise you’d just say “yeah she was wrong but Luke’s family apologized profusely and are doing our best to get her help” - but we know from how you’ve spoken about his sister you don’t think there’s anything wrong with her.", "YTA if you don't go to that funeral. This is about your brother grieving for his dead fiancé, not your husband being blackballed from a funeral. Stop the pettiness and be there for your brother. They can hash out their problems between themselves on a later date when he's not grief stricken!\n\nThis is the first class ticket, choosing beggar wife from the other day all over again! Family drama does not belong at funerals and weddings!", "YTA. You do not have to stay all day. Show up, hug your brother. Let this all be the end to the drama.", "Your brother lost his fiancée. He is the one that needs the most support at this time. I think, to preserve a relationship with your brother, you go alone. YWBTA if you don’t support your brother", "Not going to that funeral is one of those things that you could never undo and would never be forgotten. It would damage your relationship with your brother beyond repair.   \nLuke's sister caused Sara to believe she was being cheated on, causing the relationship to break up and Sara to fall into depression. Luke stood by his sister and what she did.  \nYour brother doesn't want to be reminded of that when he's mourning the loss of the woman he was going to spend his life with. By standing by his sister, he condoned her actions.   \n\n\nThe impact this would have had on Sara (and your brother) must have been huge, it's time he could have spent with her and that was taken from them. I wouldn't want him there either. YTA if you don't go", "YTA. Funerals are not the place for egos.", "NTA if you go or not. Why is is Luke even the guilty party? He isn’t guilty for his sisters actions. Sara had an unhealthy grudge against the whole family apparently over 1 individuals actions. Jack has been roped into this warped mentality. Remind Jack that Luke’s sister was the guilty party and wouldn’t be there but Luke is your husband. Tough situation You won’t be an asshole whatever you decide to do.", "YTA - Go support your bro. What if Luke died. You would be a mess. Not exactly thinking rationally. Just go and support your bro. Be the family he needs right now. Grief is inanity. Don’t cause more drama.", "Do you really need your husband to go to a funeral ? \n\nFor me, YTA.", "YTA It's not your funeral and if your brother says no I wouldn't argue. Is the strain on your relationship with your brother during a really hard time for him really worth it just to fight for your husband to be there? Considering the past with his sister I wouldn't push it.", "INFO. It really depends on what the drama was, and Luke’s involvement in it.", "It sounds like your husband's sister caused a lot of problems for your brother and his fiancee, and depending on how involved your husband was with it, he might have, too.  You also don't say how long \"some time ago\" was.  A year ago, a decade ago, 3 months \n\nYour brother had a woman in his life that was stalking him and intentionally used lies to try to ruin his relationship with someone he loved, either to \"make him be with her\" or out of spite, yet you describe her in glowing terms, and say you don't understand why he didn't want to be with her... (Maybe he saw her personality flaw of being a lying, vindictive, stalker!  After all, Ted Bundy was a handsome charmer, too...) \n\nSo honestly, no, it doesn't sound like you have shown your brother much support, and I can see why he feels the way he does towards your husband's sister.  \n\nNow, how long ago all this happened, and how much your husband supported and helped his sister stalk and harass your brother depends on how unreasonable your brother is being.  He's probably not just mourning the future time he now doesn't have with his fiancee, but also the time in the past with her that he was robbed of.  (It's easier to be gracious over something that's stolen from you when you have a lot more of it, which is probably why your brother was more forgiving before she died.) \n\nIf you want to heal this, and if you don't want to be an ass to your brother, go to the funeral.  Be loving and supportive.  Don't make any comment or reference to your husband not being there or about your sister in law.  If someone else (your brother) brings it up, just say how very sorry your husband is about his role in the past, and for his loss now, and how very sorry your are that you can never finish making amends to Sara.  If you can't do that, then don't go.\n\nAlso, keep in mind, since your brother wasn't married to her yet, unless she had a will or something stating otherwise, then her parents are her next of kin, and keeping your husband out could very well be THEIR choice - one it sounds like your brother agrees with.  After all, I wouldn't want one of my child's stalkers / tormentors at their funeral...", "NTA, your brother is being selfish  over petty drama between Sarah and Lukes sister. So not even with Luke himself.... Your brother is petty, whether he's sad or not, he can't take his issues out on other people, let alone other people's issues with other people on someone not involved. If you want to be with your fiancé while you're at a funeral with miserable people all around you bringing you down, then you're allowed to have your fiancé with you.\n\nIf your family whisper or judge you then they're petty fucks themself who lack enough intelligence and awareness to understand that drama is with Luke's sister. Not Luke, not you.", "YTA “it’s not really fair that Luke isn’t coming.” Really? It’s not “fair?”", "Jack is way out of line by saying that someone can't come to the funeral. He's also way out of line by putting conditions on your coming. And Jack is blowing up because you're taking the choice he offered you (\"don't come if coming would mean that Luke comes\"). Let him blow up. I hope for his sake that he gets over it.\n\nNTA.", "INFO: What are Luke's feelings on the matter? \n\nI would take this one on the chin and go without him, Jack needs his sister more than Luke needs to be there.", "YWBTA, your brother is grieving, this is a time for mourning, not a social event. Like weddings, we may not understand the rules but it is their \"day\" and up to them to decide. It was your brothers fiancé, but her family will be there and if Luke being there burdens the grieving process, he shouldn't be there. (Not saying he would do anything or say anything but just his presence). \n\nThis was commented without knowing what the drama is.", "If Zoe and Sarah had drama what does that have to do with your husband? There’s a lot missing here", "YWBTA, your brother just lost his life partner. Get over yourself.", "You left out all relevant info.  I will have to assume you husband is a major AH.  YTA", "YTA. This isn’t a wedding, it’s a funeral. Go support your brother, put the pettiness behind you for one day?", "YWBTA for sure. Your husband isn't missing out on an all-inclusive vacation, or wedding invitation. Why are you both so fixated on whether or not he should be there when his presence is unwanted. Your brother lost his partner, and since it sounds like neither he or his partner were close to Luke - why don't you simply just be there for your brother and stop making this about you and your husband.   \n\n\nYou would be a huge ass to choose to \"support\" Luke because for whatever reason you both feel like his exclusion matters in any way at all. It doesn't. Supporting your brother here is the compassionate thing to do. Who gives a fuck if Luke wasn't invited to a goddamn funeral, it's not like he's missing out on some happy affair.", "YTA. You’re in a shitty position, but if you don’t go to support your brother, you absolutely would be the asshole.", "YWBTA. I get your point and usually I’d be upset too but this is different—he lost his fiancé. If you want to mend fences with your brother, you should go. Better yet, if you want any relationship at all in the future with your brother, you should go. If you do not attend, he will not forget. Time will likely provide clarity and resolve this, but if you don’t show up, the gap will only widen. \n\nHe is presently reeling from the death of his fiancé and lashing out. The devastation he is feeling cannot be put into words. Go be there for him. Don’t make a thing of your husband not being there that day either.", "NTA, an invite is just that, you don’t have to go, especially if the person you’re spending the rest of your life with has been told to stay away because of drama with his sister.\n\nJust ask yourself if the roles were reversed, would you tell your brother’s fiancé not to come? He’s grieving, but it’s pretty fucked that he’s directing that anger towards your husband (I’m assuming he had nothing to do with the falling-out). You can support him before and after the funeral.", "NTA you're married to Luke not Jack. This is your chance to set the tone for how things are going to go. Stand by your husband. I get that your brother is grieving, but that doesn't give him an excuse to be an asshole.", "YWBTA. The funeral isn’t about you or your husband. The funeral will go on even if your husband isn’t there. Are you that dependent on your husband that you can’t even be away from him to comfort your mourning brother? Don’t make this funeral about yourself.", "INFO: Are you sure your husband didn't do something to Sara? The way this reads is that Jack knows something, thinks you know something, but hasn't figured out you don't know.", "YTA after reading your comments about drama. Your husband's sister spread lies about your brother, broke his relationship and because of this Sara was in depression and by your other comment it looks like your husband supported his sister. Your husband is also TA.", "YTA", "I see a lot of y t a but I’m going with NTA just for you did not have a good relationship with his fiancé, your husband can’t come and there seemed to be no effort from them to get along and leave the drama in the past. You don’t have to physically be there to support your brother. It may be hard on him but what does you physically being there do when the deceased did not like your family?", "NTA - Your package, both come or neither. you put the boundary, Jack can suck eggs and roll around in his grief alone.  If something is still bothering him this much, I wouldn't go if they said my S/O wasn't allowed. \n\nYou might need support and Luke is your partner in life.", "Idk who the AH is but I’d go and leave hubby behind. 10 years from now you’ll be guilt free and everyone will know you chose to be mature and keep the peace during a difficult time. On the other hand if you don’t go or cause a stink about hubby not being invited your brother will NEVER forget it. Don’t let this carry on to be life long family drama.", "YTA. Be there for your brother. Petty grievances don't matter right now. Is it fair that your husband isn't invited? Maybe not. But it's not exactly an appropriate time to play tit for tat.", "yes, YWBTA, 100%. Death should make you get over the pettiness.", "I’ll get downvoted for this but NTA. You and your husband are a package deal, and your brother is kinda being a choosing beggar. He can’t ask for your support and also say “eww no don’t bring your HUSBAND”.", "I believe that everyone will be the asshole. \n\nSo here is my reasoning.\n\nSo because there has been drama in the past by the deceased fiance and then your husbands sister which doesn't involve your husband, your husband is uninvited. Since in the post it says the entire family is reeling, that also includes you. If you were to go to the funeral, you would be supporting your brother, but who is going to support you? You husband is now part of your family so that means your brother is keeping you away from your husband during a time where you would be mourning over someone you have gotten a relationship with due to the connection with your brother. So your brother is an asshole but also not as much as people will make them out to be. He is grieving. I would also understand more if the deceased fiancé's family was organising and paying for the funeral.\n\nHowever, you would be the asshole if you don't support you brother at all. This is going to be a very hard time for him because of loosing his fiancé so in a hole he does need his sister there to support him. If your partner is fine with you going alone, that is fine. It would most likely be hard and all but being there to support your brother is something that he will remember for a long time. He would remember it negatively if you did not support him by being there for him. \n\nSo overall, my judgment is you and your brother are asshole.", "YTA - the day isn’t a couples date… does your husband even want to attend?… my guess is they’d be fine skipping it and you pulled this petty move out of revenge more than anything. Feels like a very immature move. You’re there to support your brother and mourn Sarah… why would you be shocked someone who didn’t get along with the deceased wasn’t invited?\n\nWhat exactly isn’t “fair” about it?! This isn’t a trip to the county friggen fair… this isn’t family dinner… this isn’t about you or your husband.", "YTA. Wth is wrong with you. Your brother is in a lot of pain, why does it even matter that your husband is not invited???!", "YWNBTA although I'm curious what the drama was\n\nIf the issue is with Luke's sister, why should Luke be held responsible for that? You guys are married and a social unit, if your husband isn't invited (I know some events there are no '+1s' or whatnot, but in this case the sister's bf is invited), that just sounds petty. It also sounds like he's just holding grudges.\n\nJack's grieving though so he might not be thinking it through, and I suggest you be gentle with him, but I'm sure in the future he'll realize his mistake and apologize. For now, I don't think you'd be the AH for not attending", "I'm going against the grain here. But NTA. Honestly if my husband was banned from the funeral, I wouldn't go either.", "YWBTA\n\nSorry but some things and decisions do not need to be justified, top examples would be the boundaries in your home, the dresscode for a wedding, and the invite list for a funeral.\n\nYour brother lost his partner, and while it may seem unfair to not invite Luke, he is well within his right to do so and stille expect his family to support him.\n\nNo one can force you to go, but if the only reason you won't be supporting your brother is cause he didn't invite your husband then yeah, YWBTA", "YTA / YWBTA. The rule for funerals is dump out not in. I’m sure it’s shocking but it sounds like nobody involved was all that close, except maybe you and your siblings. Whether it’s reasonable or nice or not is not that important right now. Luke and Sara will never have the chance to make things right so maybe leave that to one side and focus on your bereaved sibling.", "NTA  \nHe can either get your emotional support or choose to continue to behave like a child, not both.", "NTA.", "INFO: what's your relationship with your brother like? You haven't mentioned anything about it, nor expressed any feelings at all beyond being surprised at your husband being asked not to attend.", "If your Husband never had a nice thing to say about Sara when she was alive due the drama between his sister & Sara then yes, you'd be YTA for assuming your Husband would be welcome and refusing to support your brother.", "Nta your brothers being ridiculous not allowing your husband to come, good for you for standing up for your husband. If he didn’t want drama at the funeral, then he shouldn’t have banned your husband from coming.", "Just read through the comments and found the drama \n\n\n\nIt's a bit of a long story, and honestly the whole thing sounds like the plot of some soap.  I'll try and sum it up. Jack  went to law school with Luke's sister. She had a massive crush on Jack and they went on one date, but he wasn't interested (Luke's sister is a very smart, confident woman and I don't really know why Jack ditched, but his choice). A little while later he met Sara.\n\nI don't know the nitty gritty details on this but she apparently went up to Sara and told her to leave him, and made it seem like she was cheating on Jack. Sara fell into depression and broke up with Jack, during that time Luke's family tried to talk it out with Jack (this is when I met Luke). Eventually Jack and Sara got back together later.", "Soft YTA.\n\nFunerals are inherently for the grieving people not the person who died. Grief is weird and messy and your brother is going through the thick of it. He might regret saying Luke can’t go one day and maybe he won’t. Be there for your brother who just lost his partner.", "It seems that Luke’s involvement with the Sara drama was only peripheral, so if that’s the case NTA. It seems like guilt by association and that’s not fair.\n\nJust … please don’t try to hook Jack back up with Luke’s sister lol. I would definitely avoid that move.", "WTF? YTA if you don’t go. \n\nNow is NOT the time for drama and petty bullshit. Yes it’s petty. You may not think so because it affects someone you love but your brother just lost his better half. \n\nGo to the funeral. Be there for him. Do NOT bring up the drama between your man and your brothers girl. Not to ANYONE!!! It’s not the place. \n\nJust be there for your brother. There will be time in the future to make amends and apologies and shit.", "YTA. Sara is dead. This isn’t about who she was or what she did anymore. This is about showing your brother he matters to you and you care that he’s hurting. Maybe it’s unreasonable for him to say your husband isn’t welcome at her funeral. But he’s grieving and grieving people often lash out. If you care about your brother show up and support him in this awful time for him.", "YTA. Whatever the beef between the 3 of them was, it’s irrelevant at this moment. Your brother is going through unimaginable pain and the most difficult time in his life, he has the right to invite whoever he wants that he feels would be supportive on that day. You should be there for him and put your childish shit aside. You are a selfish asshole for digging at him.", "Sounds like your brother is hurting and needs to be loved. Please communicate with each other. Don't let this fester", "YTA. You’re making a funeral all about you and your husband when it should not be. Sounds like petty drama but now would not be the time to be extra petty. Are you willing to ruin the relationship you have with your siblings and possibly other family because your husband is not invited to  attend a family funeral?", "YWBTA, all the family issues aside. Do you really want the reason you weren’t with your brother when he was burying his should’ve been wife, that your sister-law and your soon to be sister in law had beef. Besides, if your brother doesn’t want to see your husband that’s kind of fair. He’s grieving not all his choices are going to make sense at the moment. Unless, your husband is trying to pull the “don’t go or less….”, you don’t have a reason not to.", "YWBTA. Go support your grieving brother. Don’t make this about you. Talk to him about it down the road.", "INFO: why won’t you go without Luke?", "YWBTA, your brother is freezing and honouring what he sees as his fiancé's wishes. This isn't about you or your husband. It's about your brother and his loss. \n\nFunerals are about saying goodbye to friends and loved ones. Your husband wasn't a friend or loved one. Why would he even want to go? Go and support your brother if you love him. Don't go if you don't love him. \n\nIf the riles were reversed would you like someone whom your husbands family had conflict  with at his funeral. You have to respect your brothers wishes. He's doing what he thinks is right.", "Yta. Sara's dead just respect her wishes. She didn't like your husband and that sucks but get over it. Be there for your brother.", "Different opinion from the crowd but NTA. Your brother, albeit possibly unintentionally, is dividing you from your husband and that is not ok. Unless there’s more to the story around this drama and it’s a much bigger problem than you’ve stated, this is an unreasonable request from your brother. Plus it’s petty.\n\nYou shouldn’t feel bad supporting your husband in this instance.", "YTA! And that A part includes your husband's sister as well. \n\nReading your last comment, explaining the past history of why Sara hated your husband's sister, makes it very clear that Sara was bullied by your husband's sister into breaking the relationship with Jack. And then your husband's family had the audacity to go and ask Jack to forgive your husband's sister!!! \n\nIf you can't see why you are in the wrong here, then you are YTA.", "NAH. Jack doesn't want your husband there. Ok. That's his perogative. Don't try to force the issue or just crash the funeral with Luke.\nYou want your husband's support during a day that would be emotionally difficult. That's understandable too. If you can't face the funeral  without your husband to lean on then don't go. Send your condolences. A beautiful wreathe or donation to charity.\nBut I would suggest. Make an appearance. Alone. You don't have to linger. Don't stay from beginning to end.  But go. Be there for your brother.", "YWBTA if you don't honor your brother's wishes. \n\nYou may think this will blow over but things related to funerals/deaths tend to stick.  I have aunts and an uncle who still don't talk to each other over a burial plot argument related to my grandmother.  And she died in 1995!  \n\nTwo of my four aunts have gone to their graves still not speaking with my uncle.  One of the surviving aunts is still holding onto the grudge and she and my uncle live in the same fucking town.  The other living aunt never stopped talking to him.  They are all in their 70s now.  \n\nGo and support your brother.  This day affects him more than it does Luke.  If this situation has taught you anything, it should've taught you that romantic partners can be temporary and family is forever.", "Soft YTA. Is it a bit strange that your husband is not allowed at the funeral? Yes absolutely. But is it the time for you to take a stand about this? No. \n\nPeople say funerals are for the dead. In my opinion they are for the living to say goodbye. And the living come with grief, sometimes guilt, a history of feelings towards other mourners and due to the circumstances the feelings are rawer and more on the surface than usual. And that regularly leads to unpleasantries at the grave or the wake afterwards - or is that just my family? \n\nTaking this into account it can make sense to ask someone that isn’t particularly close the the deceased and can stir up the raw negative emotions in other mourners not to come. I’m not really supportive of this approach but I can understand. \n\nNow regarding your attendance: asking for your spouse to be included in invitations makes a lot of sense for most events, like holidays, weddings, birthdays etc. But not funerals. It is for the living to grieve and to be supported by loved ones they feel comfortable with. Especially when it is a small funeral, they are more intimate. Not attending would be a slap in the face for your brother, be there and support him. Let it go, be he bigger person, it is not worth a permanent strain on the relationship. \n\nAnd a question: does your husband want to attend? Not because you are going but because he is genuinely grieving for Sara? If not (and it doesn’t sound like it) be the bigger person and let the family have their goodbyes to Sara as they wish.", "Grieving people don't always make sound decisions. I think it would be best to go to the funeral if you want to have any relationship with your brother in the future. \nSoft YTA.", "YWBTA to not attend the funeral. Jack may seem unreasonable but this is a time to honor his request.  I don’t know what the heck your parents think is ‘unfair’ for your husband to not attend the funeral. Besides which, if you don’t attend the funeral it’ll be a cold day in hell before your brother forgives you.", "Yes, YWBTA. It's one day, your brother asked you to go, and you should be there.", "NTA\n\n&#x200B;\n\n\"nd Zoe said it's not our choice and I'd be an ass if I don't go to support Jack.\" .. They are wrong: It IS your choice. Don't let that AH bully you.", "Your brother wants you to attend his fiance's funeral without your husband?  I'm pretty sure if ANYONE asked me to do something while excluding my wife I'd politely decline the invitation.  I love my wife, she's my best friend, and although we do things independently fairly often, nobody who singles her out for exclusion is likely to see my worthless ass at their event.\n\nNTA", "NTA. It sounds like Jack was looking for a fight. Jack has drama with Luke, not Sara, at least from what you’ve told us. I bet if things did seem to be getting better for a while between the two, Sara probably had an influence. You can choose to be the bigger person and support your brother anyway (family is family), but that doesn’t change the fact that he’s letting his pain turn him into an confrontational asshole and using his deceased fiancé’s name for his own personal vendetta.", "Soft YTA. You should go to support your brother. It’s unfortunate but be the bigger person and don’t make this a huge thing during this time.", "Luke would be a reminder of the pain and drama that happened when Sara briefly broke up with Jack. He would also be a reminder of Luke’s family trying to explain-away the abhorrent behavior of his sister.\n\nSo yeah, can see why they wouldn’t want Luke there.\n\nYour family probably supposes that you can understand that, too, and that you will still of course go to the funeral out of compassion for your grieving brother.\n\nYWBTA", "I want to say E. S.H, but your brother lost his fiance. Given the beef between her and your husband, I'm going to give him a pass.\n\nYTA, support your brother. After the funeral, **you get to go home to the person you love**.\n\nDoes your husband even really *want* to go honor her memory, or is it just he wants to go because he's been told he can't? \n\nDon't make this about you.", "This is an awful situation all around but seeing as it is your brother's finacée's funeral and not a wedding, I would advise that you follow your brother's wishes here. People go a bit crazy with grief and it sounds like your husband does not need to be there to grieve or support your brother. It would harm your relationship with your brother for a long time if you made it more about you wanting your husband there for social reasons instead of being there to support your brother in his time of grief. YTA", "NTA that drama didn't involve your husband and your brother even when grieving needs to pull that stick out his ass. \nDirect Quote   Jack said that I can \"only come if I don't bring Luke\". I asked why, he said I know why and Sara wouldn't want Luke there.\n\nWell don't go. Your husband is your partner and your brother needs to respect that. \n\nAnd whats sad  is your brother is trying to create High School Drama at a funeral. \n\nSend your condolences and leave it at that.", "YWBTA, your brother is grieving and bereaved shockingly early in his life just as he was imagining a life with Sara. Be gracious, go to the funeral on your own and pay your respects, your relationship with your brother will be impacted if you don’t go. \n\nI’d wager your brother feels that he couldn’t protect Sara at the end of her life and he’s feeling really protective, if not rational now. He needs you to show compassion and understanding", "INFO: why are the so adamant he not come? What ‘do you know’ that isn’t being shared for context?", "I definitely can see both sides of this. Just out of curiosity is Luke mad or offended he wasn't invited? He may not even be bothered by it but I understand you're married and if one should be invited then so should the other. With that being said I understand needing to be there for your brother. Admittedly I fail to see why your bro wouldn't like your husband over an argument 2 other people had.", "ESH, but your brother more so.\n\n\"*Sarah had some drama with Luke's sister*\", so that means LUKE can't go? I mean, sins of the parents and all that, but how is Luke responsible for whatever his sister did?\n\nIf Luke was your BF and not your husband, maaaaaybe I could get behind it. But this is your husband. Jack is super upset because not everyone is jumping to respect his fiancee, but then he completely denigrates your HUSBAND? How does that work?\n\nObjectively, you are right - you shouldn't go if Luke doesn't. But let me tell you as a woman who did stuff like that and then faced years of family recrimination, just go to the damn funeral without Luke. It will be a short amount of time, you don't have to stay for any reception (if any), just go and pay your respects. That hour or two will far, far, far make up for hours and years of conversations and whispers and \"remember when you didn't go to Sara's funeral....\"\n\nJack is being unreasonable and a jerk. So stipulated. But you have to think for him - my bet is that, one day in the future,  he will eventually apologize for this. just go and be as pleasant as possible and don't get huffy or resentful while you're there. Good luck, I've been in your shoes, believe me.", "Your husband is trash and so are you Yta", "YTA seems like you could put this one thing aside and share some comfort to your brother during this difficult time. If your husband is a good man, he would understand.", "YTA. \n\nAccept it, attend without your husband and support your brother. \n\nYour brother is living a nightmare and its not the time or place to discuss an issue that you thought was in the past between the person that died and your husband. \n\nIf you need to, approach your brother about it in a couple of weeks or months, but right now just be there for him and accept his (potentially unreasonable) requests.", "YTA. Your brother is mourning the love of his life. Your husband would be a stressor to him, so yes, you should honor his request and come alone. \n\nCome christmas, you should make sure you and your husband are invited as a couple, and there, you should not take no for an answer. But forcing your husband in now WILL lead to drama at the funeral, and your brother would have all the more reason to exclude you (and therefore your husband) from the family holiday festivities. Not because Jack has an issue with Luke, but because you violated his wishes. Correct or not, I'd expect your parents to fall in line with him come christmas if you press this now.", "INFO\n\nIt's hard to say not knowing what the drama was. Never mind I didn't catch that it was with Luke's sister.  Thought it was with Luke himself.  \n\nWhat does Luke say?  He's your husband.\n\nDo you love your brother?", "YTA \n\nLook Luke can sit home for one day. **The woman is dead.** Be thankful you and your husband are still alive and go support your brother. Believe it or not, someone’s death matters more than hurt feelings or whether or not someone gets an invite to the burial!\n\nWhile your looking at Sara’s dead body silently thank God that Luke is home alive and well watching TV.", "NTA your husband comes first, and unless he’s insisting that you attend, you’re right to stand by him", "Jack is being reasonable because if I had a stalker, I wouldn’t want one of her flying monkeys, your husband, to be there & then fear a new onslaught of advances. What role did your husband play in this stalking? Invitations don’t have to be accepted, and you don’t have to go to anything but YTA because your reason for not going is your husband. There are other ways to support your brother but saying he should get over the past isn’t your decision to make", "YTA. The last thing you will ever do for Sara, the love of your brothers life, shouldn’t be petty. A funeral isn’t about you, it’s about the person being buried. How can you be so cruel and self absorbed? \n\nDon’t bring him, why does he need to go? You can be away from him for one afternoon. If you respect your brother, you will go, and go by yourself.", "Not enough info.  What was the “drama” between the respective sisters…and how is Luke involved?  Also, what does Luke think about being told to stay away.", "Y’all need to start acting your ages. Without knowing the “drama” it’s hard to say who’s right or who’s wrong. Either way, you’re all old enough to know how to let shit go to come together and support family in a time of need. Your brother is not in a rational state of mind and shouldn’t be expected to be after just losing his fiancé. Be the bigger person and realize you need to be there to support him. \n\nI’ve also never heard of being invited to a funeral. In my experience anyone who wants to come to pay their respects to the deceased should be able to do so.", "INFO: What was the drama about?", "NAH. I get where your brother is coming from. Is someone wasn’t a friend to me when I was alive, why would I want them at my funeral? I have family that treat my grandma like shit, the day she dies I’m making sure none of them are there. \n\nIt’s also your choice to stick with your husband. You had to choose sides, and you chose him. Given the grief your brother’s in, he may not forgive you but that’s a risk you took.", "Honestly, YTA because you are downplaying the drama that occurred. Luke’s sister tried to break up your brother and Sara. She was almost successful while Luke’s family (including your FIANCÉ!) was siding with the sister. \n\nYes, everyone moved past the drama but it doesn’t change the damage that Luke and his family caused so he is not entitled to come to a funeral for someone he indirectly hurt.", "YTA\nYour brother needs you. This is NOT the time to take a stand about inviting your husband to everything you attend. You're worried about it being recurring, you can deal with it in the future. \n\nYour poor brother's fiancée is gone... and you want to be petty and fight to make it all about you? Selfish. Absolutely selfish.\n\nAlso, I read your comments. You are absolutely cold hearted.", "> And I assumed everyone had gotten over it.\n\n9 out of 10 posts on this sub could be avoided if people would just stop assuming shit. \n\nYTA\n\nWhy do you need your husband there in order for you to support your brother? Why do you think your husband has the right to attend this funeral, where I am sure Sara’s sister will also be? This funeral isn’t about you, and NO ONE should ever demand a plus one to a funeral.", "ESH.\n\nBased on what you've said, it seems super unreasonable for Jack to hold Luke responsible for drama involving his fiancee and Luke's sister. Unless there's more to the story than you've told us, it sounds like he's being petty and using the funeral to make his own feelings about Luke known. \"She \\[Sara\\] wouldn't want him there\" is something that nobody can argue with because sadly Sara isn't able to speak for herself. \n\nBut he's still your brother. Go and be there for him at the funeral. Your husband doesn't need to be there. It sounds like there is a lot of work that needs to be done on improving the relationship between you/Luke/Jack - but you stubbornly refusing to attend Sara's funeral just because Luke isn't going will make things 100x worse and may be something your relationship with Jack never recovers from.\n\nRelationships are often about picking your battles, and sometimes the wise thing to do is to let someone else's ass-ery slide. This is simply not a fight worth having.", "YWBTAH.  98% of all family funerals ( my side) have been attended without my spouse.  Family dynamics notwithstanding, it’s hard to get time off( esp being AD military) to attend a second+ degree relative by marriage funeral.  Your feelings are irrelevant.  Your spouses feeling do not matter.  If the fiancé of the victim does not t want X person there for any reason whatsoever, you acquiesce with a smile.  \n\nBelieve me, grief does weird shit to people and makes them act and react differently than they would normally.", "I think this would be hard to judge without context on what happened.\n\nFor one, your brother needs his family to be there with him as he is grieving. He absolutely should be comfortable during this process and not have to deal with unwanted guests.\n\nBut also, you have to stand by your husband. Is this something that he will take an issue with whether you attend or not? Or is he okay to sit this one out as respect for your brother? Will your attendance signify that you are not on his side?", "I’m gonna go with ESH on this one. Now is the time for your brother to put aside differences. But you should still be there for Jack at the funeral. Not being there could cause long term damage to your relationship.", "Info: what was the matter between them?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNames changed,\n\nI'm (f32) married to Luke (m33), and I have 2 siblings Jack (m35) and Zoe (f27). Jack got engaged to Sara a couple of months ago. Sara had some drama with Luke's sister, but this was some time ago and I assumed everyone had gotten over it. Jack and Luke aren't close mostly due to this, but their relationship is getting better (or I thought).\n\nSara recently passed away in a crash. Our entire family is reeling from this. The funeral is coming up and our family are all attending, Zoe was invited along with her boyfriend. Jack said that I can \"only come if I don't bring Luke\". I asked why, he said I know why and Sara wouldn't want Luke there. I was pretty surprised at that and said if that's the case maybe it's better if I don't go as well. Jack really blew up (which I do understand because he's dealing with a lot of grief) and said we never cared about either of them.\n\nMy parents agreed that it wasn't really fair that Luke isn't coming, and Zoe said it's not our choice and I'd be an ass if I don't go to support Jack. So, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA if you don’t go prepare to never speak to your brother again. He doesn’t need Luke’s support he asked for yours. Sometimes you need to prioritize the grieving party. It’s one day and it’s not about you are luke. So stop centering your precious feelings and attend the funeral ffs", "YTA. Get over yourself for your brother. You can be an adult and go without your husband for one day.", "NAH\n\nYou say you assumed everyone had gotten over it, but clearly Jack hasn't. Maybe he's just overly sensitive due to his loss. Or maybe he's unreasonable. It's hard to say and now isn't really the time to go into it.\n\nThe point is that Jack is in the midst of a nightmare, and he's your brother. I think you should go to support him. This isn't a social event anyway--it's a time for grieving.\n\nFingers crossed that Luke and Jack can work on their relationship later.", "I'll go with YTA.\n\nYour brother will be petty in that situation, he wouldn't give two shits about your husband or even your sister bf in this situation, it just happened to be that Sara had a rough relation with your husband for whatever reason... don't know, don't care. But he's saying goodbye to Sara in the funeral, is his time, not your or other person. \n\nYes, sucks your husband can't go, but he's your brother. So lik Zoe said, if you don't go you will be an ass and believe me, your relation with Jack will shattered and from what your sister said I believe even she will remember this in the future.\n\nGo and support your brother, don't be an ass.", "NTA. Jack shouldn’t ban your husband from the funeral and expect you to still attend.", "NTA. I wouldn’t go somewhere my husband was explicitly banned.", "Yta: Funerals are for the people directly impacted by the death and yes they do get to decide who is there or not. My 1st cousin's children died in a car accident this year. An accident that made the news and the community donated thousands of dollars to them BUT they still chose to have a private funeral for the kids with a less than 10 guest list. Sure I was hurt that I couldn't go BUT that's what they wanted. Go without your husband for one day. Yes, I agree it sucks that Jack is excluding your husband and is being an a-hole too. You don't have to join him in that behavior. Go and in a few months make it clear that your husband will be included in any future family functions that you are included in.", "NTA.", "Nah, NTA.\n\nBut you should be the bigger person and go. Your brother is probably not thinking straight and the emotional scar this will leave will make him very bitter towards you if you don't go.\n\nUnless you don't want a relationship with your brother in which case feel free to stand by your husband (I'd be hard pressed not to so the same)", "YTA it’s a funeral for someone who would’ve been your SIL and they have to respect her wishes if you know why she didn’t want him there. It’s not about you or your husband it’s about her life and mourning the loss of her.", "Uuhhmmmm.... Whether you're TA or not isn't the question. WTH does Jack know that you don't? What did Luke do to Sara? \n\nAre funerals becoming invite only now? This seems to be a thing now", "YAT\nI get that for most family events, if your family refuse include your partner, you'd refuse to go. But this is not a simple family event. It's a funeral.\nYour brother needs you for support after his fiancé death and as your sister, you should go. You had no problem with Sara or your brother. However it is completely understandable that your husband is not invited for the simple reason that Sara wouldn't want him there.\nI'm sure your brother would become even closer to your husband if you both showed that you respect his decision.\nYour husband has no business being at this funeral and if you don't recognize that and make the petty move of not going, then yes, you would be the asshole", "YWBTA. I don’t know what’s up between your bro & your hubby, not sure if you do either. But, going to the funeral is about supporting your brother. \n\nDo you love your brother? If so then you go, support him now when he needs it so much and later try to (gently) get to the bottom of the other issue and fix the relationship. \n\nReally makes me wonder what the drama was and why the men can’t get passed it.", "INFO: how exactly did you meet Luke? it seems his sister's family was harassing your brother because he told Luke's sister no.\n\nand you should really add the reason why Sara's family doesn't want Luke there to your main post. it shifts *everything*", "YTA, You can decide not to go but you'll be doing irreparable damage to your relationship with your sibling. My sister wouldn't participate in my wedding because my husband's best friend and best man was her ex-husband (that she cheated on and left), then when he was killed by a drunk driver 5 months later she didn't come to the funeral. We haven't spoken in 12 years. Put your ego aside and please do this for your brother without bringing up that Luke isn't there. Your poor brother, he needs this right now.", "NTA. Either Luke is being an ass or there is more that he knows that he isn’t telling you.\n\nRegardless of how Sara would have felt part of a funeral is being there for each other. It’s a time to let petty family BS go.\n\nNot to mention the drama you mentioned was between Sara and Luke’s sister. So what does he have to do with anything?\n\nEven if you should support your family you aren’t the one putting stipulations on attending. Your brother is. Grief isn’t an excuse to be an ass.", "Yta. Your husband's sister was the offender who  almost ruined his relationship and caused the woman he loved to fall into depression. would you want a reminder of the downs in your relationship at your love ones funeral?\n\nGoing further do you think Sara's family don't know what Luke's sister did. I'm sure they know if they are close. Suck it up and support your brother.", "I agree. Also, might be a cultural difference, but I do not see why there's an assumption that the spouse also needs to be invited to private events. Just because you're married doesn't mean that you *have* to do everything together. Also, even though it doesn't really matter that much, it would be nice to know what Luke thinks - if he doesn't care that much then what is the problem?\n\nAlso, happy cake day u/Alarming_Reply_6286!", "Check out OPs comments, his (hudband) sister did some real horrible stuff to drive them apart and from OPs comments her husband and his family supported her despite it. OP even makes an off handed comments suggesting she thinks it's just pretty drama", "You kinda sound like an AH too given you lean towards Y T A with no information.\n\nEdit: oops forgot spacing", "You seem to be missing the fact that the drama was not with her husband, it was with the husband's sister ...so for her brother to hold it against her husband is childish and immature. I don't care if hes grieving or not ...hes causing a rift in the family over something that her husband had no direct involvement in as far as she's said. So unless there's something that she didn't tell us and her husband was in fact directly involved it just isn't right to exclude him, he's family. She has every right to stay home and support her husband. Apparently even her parents agree.", "I can get behind this comment. If Luke is OK with her going, she could go, but then refuse to let him be banned from further family gatherings. I personally (don't think anyway) would not go without my husband. I hate funerals and need his support to attend. But that's a me thing.", "No one at a loved ones' funeral wants someone there they've had trouble with. End of. It's a shitty thing to do.", "That is not a good take. Spouses are separate people who USUALLY act as a unit but if the brother would be distressed during a funeral then he can call the shots.", "Id say dunerals where the deceased and their survivirs have beef with a spoise is like the 1 exception. This isnt xmas supper.", "I don’t think I can agree with this without more info. I’m inclined to say Y.T.A unless there’s more reasons to believe the differences were simply petty and not something deeper.", "She posts the reason below and it's bad. He has every right not to want Luke or his family at the funeral.", "I think NTA too, because Luke and Sara didn’t have drama, but Luke’s sister and Sara did. It seems a bit too much of a telephone line at this point", "All this!!!!", ">Don’t be petty - it’s not the time for it. \n\nOP's brothers wife was petty in life, so OP gets to be petty in her death.", ">So to summarize your SIL ( Luke's sister) kind of stalk your brother after one date, harassed Sarah to the point she felt in depression and for you your brother and her family should have left this in the past?  \n>  \n>You said Luke's family talked things out with your brother. Did they apologise or did they try to play down what happened? (The way you described her make me think they try to play it down in order to minimise any consequences).  \n>  \n>Your brother loves you enough to keep contact with you despite the fact that you married into the family of the person who was obsessed enough to hurt one of his loved ones. He loves you enough to ask you to support him in this difficult moment but you're too self-centred to see what your husband represent to him and Sarah's family. If you want to burn this bridge you should absolutely stay home.  \n>  \n>YTA\n\nOP, please heed this advice. Your husband is a big boy and I bet you he wouldn't care about not attending anyway. Go support your brother in his time of his loss.", "Did I miss something?  I read that Luke’s SISTER did something to them….but what did Luke do?  Is he guilty just because it was his sister?  It’s not like he told her to do that.", "Based on OP’s comment on the ‘drama’, Luke’s sister is basically Jack’s stalker and Luke’s family think they should be together.  If reading between the lines", "I agree that most people don't get invited to a funeral. You just go or not. But I do know that sometimes, certain people are definitely not welcome to the funeral, either because of their relationship to the deceased or because their presence and/or behavior will cause further harm to the bereaved. Sounds like Jack wants to mourn his wife without having to deal with being upset at Luke for whatever reason.", "Zoe is OP’s sister, not the SO.", "Jack can make decisions and people can choose how to live life accordingly. You don’t want my spouse there? I won’t be there either. If Luke had said he should sit this one out, that would be different. But banning someone that would be there to support you bc of bad blood in the past? His grief will be long-lived.", "It's a bit of a long story, and honestly the whole thing sounds like the plot of some soap.  I'll try and sum it up. Jack  went to law school with Luke's sister. She had a massive crush on Jack and they went on one date, but he wasn't interested (Luke's sister is a very smart, confident woman and I don't really know why Jack ditched, but his choice). A little while later he met Sara.\n\nI don't know the nitty gritty details on this but she apparently went up to Sara and told her to leave him, and made it seem like she was cheating on Jack. Sara fell into depression and broke up with Jack, during that time Luke's family tried to talk it out with Jack (this is when I met Luke). Eventually Jack and Sara got back together later.", "I don’t know, after reading OPs update on what the “drama” was, it feels justified to not allow him to attend.", "Did you see the drama? It's because Luke sister is a NICE GIRL and couldn't take no for an answer so she tried to cause jack and his gf to break up by spreading lies of him cheating.", "Right?  No time to ask him to be reasonable. It’s not a wedding.", "Wedding??", "Wow, so you are saying OP just conveniently left out that her husbands sister was full-on harassing her brother and his girlfriend, and now the girlfriend has tragically died, and she's upset that her husband (who her brother obviously sees as complicit) isn't invited to the funeral.\n\nHoly shirtballs OP,  YTA and I think your brother may be right about you not caring enough about them.", "I wholeheartedly agree. This is all insane. Op probably left it out of the actual story too to seem less like TA. YTA op.", "Where is your narrative coming from? Do you know something the rest of us don't?", "The brother is the one bringing family drama into this. Her HUSBAND is being banned from the funeral because of something his SISTER did. Brother doesn’t get to unilaterally ask for support from family, while simultaneously telling her that her family is unwelcome because of something he didn’t even do. Honestly, she is not the one being petty here.", "I am curious about the reason for why the husband isn’t invited. \n\nBut I definitely will say YTA for the OP.", "Per OP: \"It's a bit of a long story, and honestly the whole thing sounds like the plot of some soap. I'll try and sum it up. Jack went to law school with Luke's sister. She had a massive crush on Jack and they went on one date, but he wasn't interested (Luke's sister is a very smart, confident woman and I don't really know why Jack ditched, but his choice). A little while later he met Sara.  \nI don't know the nitty gritty details on this but she apparently went up to Sara and told her to leave him, and made it seem like she was cheating on Jack. Sara fell into depression and broke up with Jack, during that time Luke's family tried to talk it out with Jack (this is when I met Luke). Eventually Jack and Sara got back together later.\"", "Sara was not Jack’s wife. It is not up to him who attends her funeral. HER family has requested that Luke not attend Sara’s private funeral. That is their right. \n\nThis family is grieving the loss of a loved one, they do not need to see someone who caused their loved one pain at her funeral. OP & Jack should be gracious & not press the issue. They’re both massive AH for letting it go this far.", "Except the drama is between Luke's sister , the brother and Sara and considering this is around the time it seems OP met Luke it would seem both families knew of the drama and yet op still describes Luke's sister who tried to sabotage Sara's relationships favorably.", "Why is he waaaay out of line ?", "He was kind of pissed he wasn't invited, because he was just supporting his sister on something that happened years ago. He said he doesn't care whether I attend or not, but I just don't want this to become a recurring thing with Jack that he excludes Luke", "Apparently Zoe's family (possibly including brother) were bullying OP's bother into getting back together with the girl he had ONE DATE with", "Right we need some INFO on this drama and why it involves husband.", "Way to bury the lead OP. Why would Jack want the brother of the obsessive woman who caused his now deceased wife so much pain, lied to break them up, and sent her into depression? And assuming your husband took part in or indulged her unhinged behavior fair enough for Jack to exclude Luke.\n\nYTA. Massively. The fact you didn’t come out with this info in your post confirms this probably wasn’t all and things went down much worse.", "If the drama was with husband's sister, I doubt he was all that involved in it, but it's still shady that OP won't cough it up because it sounds pretty relevant.", "SO. MUCH. THIS. \n\nThere are so many accidental ways that people \"make drama\" during a funeral/after someone dies without really intending to. \n\nJust go. Leave your husband at home. If people press you about why he isn't  there, you can say that Luke and Sarah weren't close and you want to make sure you're completely focused on Jack's needs right now, since he is in mourning. Otherwise, just go and don't mention Luke's presence/absence.", "She said in her original post that the drama was between her husband's sister and the brothers fiancee. So I doubt it had anything directly to do with her husband.", "This. NTA - If it was Lukes call not to go, I can understand OP going to support brother alone. But when Jack basically asked OP to choose sides, I'd choose the spouse every time.", "She isn't the one being petty. She want's her life partner there, this isn't 'petty' as the brother was the one to say Luke couldn't attend. OP is 100% NTA  either way, it's Brother's fault this whole issue is even happening. He could have let Luke come and just not talk to him. It's that easy.", "Yeah in in the minority here and think NTA. If my husband was not invited I'd also skip. It seems like it would be less drama for everyone.", "Apparently she met Luke because their family tried to apologize for her [crazy actions.](https://www.reddit.com/r/AmItheAsshole/comments/yk352f/wibta_if_i_dont_attend_my_brothers_fiancees/iur3b61/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) I’m confused how a whole family gets so involved in the dating life of a woman in law school that her brother marries his sister.", "+1s? This is a *funeral*.\n\nOP can be without her husband for a couple of hours to support her brother while he grieves his dead wife to be. It doesn't matter whose fault it is - someone is *dead*.\n\nI think she'd definitely be the asshole for not attending, because the only reason not to woipd be to take a stance on something petty and inconsequential when someone is dead.", "Well based on the fact that his sister gave Sara depression I would assume no one from his family is invited to the funeral", "Well then you’re an asshole too lol.", "Same.  Sara had beef with Luke’s sister and nothing here indicates that Luke is at fault for that. NTA", "Do we have a note, email, text or anything saying Sara still had an issue? Or just brother deciding that his sister's support network isn't as import as his own.", "It’s not really about OP or her husband. Brother is the only person that matters here. His fiancé is dead. His life has been forever changed. He along with presumably Sara’s parents, siblings, other family would like to grieve without another family dragging their drama to the funeral services. OP can go or don’t go but don’t try to prove you’re right & brother is wrong. Be respectful & let these people grieve", "We don’t know how bad their problems are though. No matter who’s wrong or right, it’s still best to comply with Sara and her family’s wishes.", "I agree with you. The drama was between the husband's sister and the brothers fiance ...it had nothing to do with her husband. So why hes being excluded now is beyond me but it's kind of petty and childish.", "Wow, it really flew over your head didn’t it", "Did you see why the fiancée didn’t like the sister? And why the brother might hate the husband?\n\nI wouldn’t want the person who supported someone who tried to break up my relationship to come either.", "But \"some drama\" is how OP describes the situation. We don't know what happened and what the other side of the conflict feels about OP's husband's involvement.", "> Jack is super upset because not everyone is jumping to respect his fiancee\n\nHis *dead* fiancée.  Besides, it sounds like Jack wasn’t particularly happy with Luke himself over whatever happened.  Which suggests Luke actively took a side in the conflict, or at least didn’t explicitly distance himself from his sister’s actions - and while it might be helpful if OP would clarify exactly what the drama was, I can think of *plenty* of possible reasons why that’s not something Sara’s grieving loved ones would want to have to think about right now.", "You should read what that drama was. You'd change your tune.", "OP posted the story here: https://www.reddit.com/r/AmItheAsshole/comments/yk352f/comment/iur3b61/", "From what we're given here it seems like Jack can't feel it if she does.", "What story did you read? I don’t see anything that describes what kind of “drama” she was talking about and certainly didn’t see the word “stalker” anywhere in the story.", "When you’re married your a team and should be supporting each other. Her brother was rude to her husband. She’s not being petty or cruel she’s standing up for her husband. I would love to have a partner like that.", "Yeah it’s impossible to say without knowing this.", "OP commented : \"It's a bit of a long story, and honestly the whole thing sounds like the plot of some soap. I'll try and sum it up. Jack went to law school with Luke's sister. She had a massive crush on Jack and they went on one date, but he wasn't interested (Luke's sister is a very smart, confident woman and I don't really know why Jack ditched, but his choice). A little while later he met Sara.  \nI don't know the nitty gritty details on this but she apparently went up to Sara and told her to leave him, and made it seem like she was cheating on Jack. Sara fell into depression and broke up with Jack, during that time Luke's family tried to talk it out with Jack (this is when I met Luke). Eventually Jack and Sara got back together later.\"", "I would disagree that the brother isn't an AH. Only on the basis that he's giving her crap for not going and not understanding how she might want to support her husband. I understand he's probably grieving but he can still be an AH in his actions.", "Read OPs comments and OP needs to edit to add those Comments. Luke’s sister interfered with Jack and Sara’s relationship, because Jack went on a date ONCE with sister and he wasn’t interested. OP doesn’t seem to understand why her brother wasnt interested in her SIL either.", "Check out what OP said here: https://www.reddit.com/r/AmItheAsshole/comments/yk352f/wibta_if_i_dont_attend_my_brothers_fiancees/iur3b61/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3", "Apparently Luke’s sister went on a date with Jack and it didn’t work out. And she tried to convince Sara that Jack was cheating on her.", "Exactly... why would Luke even want to attend? You can’t resolve drama with a dead person & her living family doesn’t want you there. This is more about optics for OP. “Don’t make my husband look like the bad guy” .... Meanwhile, think it’s pretty reasonable to say this grieving family couldn’t care less about OP or Luke’s feelings. Not even part of the equation!! \n\nThank you :)", "And the “my parents don’t think it’s fair that Luke isn’t coming” comment may be the most asinine statement I’ve ever heard..... WTF kind of brain gymnastics does it take to get to that point.... Sorry you’re dead Sara but your family is being unfair to my husband & it’s not about you anymore!!! WHAT?!?!? OP PLEASE wait, to speak until you’re smarter!", "Read OPs comments to see what the “drama” was though. Might change your judgement", "You seem to be missing the part where Luke and his family got involved in the issue. And also missing the part where Sara’s family doesn’t want Luke at her private funeral.", "We now know that her husband was involved, so much so that OP and husband met during that whole thing. Apparently OP's husband's sister and Jack went on one date and ended things before Jack and Sara got together, husband's sister tried to break up Jack and Sara making it seem like Jack was cheating on Sara with her, they did indeed break up for a while, and husband's family, along with the husband himself, \"tried to reconcile Jack with husband's sister\" whatever that means.\n\nThe man just wants to say goodbye to his fiance and mourn in peace without the parties of all the bullshit. He says his fiance wouldn't want husband to be there and since no one can ask her, and it's his call. I wouldn't invite the husband either.", "You’re right.  The brother *can* call the shots.  OP ain’t an asshole for abiding by them.", "Naw, my spouse comes before anyone else, for any reason.\n\nNo exceptions", "I just read them and honestly still do not see how her husband should be excluded. From what it seems the husbands sister caused a lot of drama. She just said that the husbands sisters family supported her which lets be honest of course they would. They were probably being lied to as well. I  agree the husbands sister should not be allowed within 100 miles of the funeral but still say that without more information about how OP's husband was or was not involved OP's brother is being petty.", "The only thing Luke did was be related to his sister?\n\nI’m not seeing why he gets blackballed for something his sister did…?", "How was OPs wife petty in life? Please explain that to me.", "Where did I mention Zoe?", "Yeah the beef was between Sara and Luke's sister... not sure why Luke is being punished for that", "Smart confident women don’t lie about people cheating when they didn’t. No wonder he only went on one date with her.", "Wait Luke’s sister sounds positively unhinged but you don’t know why Jack didn’t like her?  \n\nShe went on one date with a guy and then proceeded to try and ruin his next relationship…", "Luke's sister was awful to Sara, literally lied & bullied Sara into depression from believing she'd been cheated on. Luke supported his sister through all this.\n\nAnd you are insisting Luke be given a front row seat at Sara's funeral? Did you even like Sara? Seems obvious Sara wouldn't want Luke at her funeral. It seems like your motivation is focused on competing with Zoe than supporting Jack and honouring Sara's memory.", "> during that time Luke's family tried to talk it out with Jack \n\n“Talk it out” as in “please forgive our crazy relative for trying to ruin your love life,” or “well, as long as you’re single…”?\n\nEither way, I'm pretty sure you already know this *more* than explains why no one even wants a *hint* of that drama at the funeral.  I was thinking the sister was just a run of the mill bully, but this is so much worse.  (And is Luke’s sister actually over it by now, or does Jack have reason to be worried about her having any avenue of access to him and his life now that he’s technically single again?)", "Um. \n\nI think you should probably appreciate that apparently Jack loves you more than he's angry at Luke's family but that doesn't outweigh him being angry about their actions.", "Apparently Luke’s sister wasn’t as “smart and confident” as you thought considering the damage she did. Why is it relevant how YOU felt about your brother not dating her?", ">Sara fell into depression and broke up with Jack, during that time Luke's family tried to talk it out with Jack (this is when I met Luke). Eventually Jack and Sara got back together later. \n\nHold up. So you met a guy because he was trying to harass your brother into dating his obsessive, possessive, and controlling sister. THEN you went and thought \"yupp! That's the kind of man I want to marry!\"???\n\nMaybe you should just respectfully bow out of your brother's life.... Good sisters don't make their brother's stalker their SIL.", "Sorry did you just happen to meet Luke or did you meet him as “the family member who attempted to reconcile my brother with the woman obsessed with him, when all they did was go on one date”.", "Go ahead and put Luke sisters is the offender in the post because that changes the context.", "So let me get this right.\n\n- Your brother meets a girl, doesn't gel with her and parts ways. Nothing wrong there.\n\n- Said girl turns stalker, and gaslights the next girl in his life to the point of depression. \n\n- Brother of stalker-girl comes to talk to your brother, to 'support' his sister. Which is code for, \"now that your girlfriend is depressed, why don't you give my sister another chance?\" - right?\n\n- you see this guy, an enabler to a stalker, and instead of supporting your brother, think, \"this guy is hot\" and get with him, and marry him. You do you, but did you expect your brother and his fiancee to ignore that or forget what happened before?\n\n- and when the victim of the stalking/gaslighting dies, you want your brother to ignore all that went in the past?  It's all water under the bridge? Or did you think Luke's sister could also join you at the funeral? \n\nI'm surprised he even wants you at the funeral. \n\nYTA.", "YTA they went on one date. He didn’t ditch her. That makes it sound like they were in a relationship when they weren’t. Luke’s sister sounds completely unhinged. And her family enabling her bad behavior isn’t much better.\nGo to the funeral and support your brother.", "Yikes", "INFO: What was the extent of Luke’s involvement in all this, and where does he stand regarding the funeral request?", "A smart, confident woman who's also petty and manipulative and lies? Wow, yeah, can't see why someone would dump THAT charmer.", "See this is relevant information. Because no matter how you spin it, you're married to your brother's stalker's brother.\n\nSo when people ask how you met, do you say \"his sister stalked my brother\"?", "YTA. Your husband's sister harrased your brother and his now dead fiance. And your houseband enabled her.", "You’ve been on this sub before haven’t you. This story sounds insanely familiar", "Okay so there was no big drama between your husband and brother’s fiancé, but your husband’s sister lied, broke them up, and somehow you two met because of it. Does your brother feel that your husband was too permissive in his take on how his sister acted? Do they feel like maybe you condoned or made light of it? You did benefit from the resulting coincidences so I can see how that perception would have come to be, even if you don’t feel that way.\n\nIf they felt like your husband was more on his sister’s side and never really on their side, and they’re not that close anyway, I don’t see why he needs to be at the funeral. It wouldn’t be a big deal for your husband to skip it. I would be an AH move for you to skip it. I’ll go with YTA.", "Guys law school drama is absolutely bananas. I guarantee that you can 5x the drama you're imagining and still be in striking distance to reality. That's my only commentary. Law school social drama is absolutely vicious.", "Yeah, that drama has zero to do with you. \nYWBTA if you don't go stand by your brother on what may be the most harrowing day of his life. \nWhy is this such a struggle to decide?", "So this smart confident woman harassed a man who wasn't interested in her, lied to his girlfriend to convince her that he was cheating, and even enlisted her brother to talk Jack into dating her again. \n\n *I don't really know why Jack ditched, but his choice*\n\nYou really don't know? Seriously? \n\nAnd now Sara has died, having lost a chunk of precious time with the love of her life because of your boyfriend and his sister who might still be stalking Jack for all you know. Of course he doesn't want either of them at the funeral, gloating over the fact that he's single again, just like they always wanted.", "You were already the asshole to begin a relationship with Luke in that context. Omg.", "He probably ditched her cuz she was crazy", "Where is the update?", "And how is that Luke’s fault? If my brother does something stupid that means I’m blackballed for life?", "Luke's sister. Not luke. I'm not sure what Luke has to do with anything in this situation unless he got weirdly behind his sister on this", "Very sad. Still doesn't change the fact that a young woman is dead and a family is traumatized. Drama can wait.", "Haha fixed it. Sorry!", "OP’s comment", "The post is missing so much context but the OP shared more on her comments about why they wouldn’t want Luke there and it makes sense why", "Right? Where is all this info?", "Yeah, I definitely wouldn't attend if someone treated my husband like this. Brother is grieving. Doesn't mean he has to be an ahole. Which he absolutely is being. The rest of the family can support him at the funeral", "I think it’s weird that people are being “invited” to a funeral .... or in this case not invited. I’m guessing it’s a private ceremony otherwise people typically just show up", "Wow. Smart, confident women don’t try to actively break people’s relationships, take no for an answer, and don’t lie and gaslight people into depression! And Luke and his family were clearly supporting the sister! This is NOT a small thing! Hard YTA!", "It’s a funeral for your brother’s dead fiancée. An event that can’t the repeated, a moment of loss comfort towards your brother you will forever regret. If things need to be hashed out later on between husband and brother, so be it. But you not going to support your brother is both selfish and, in my book, unforgivable. YWBTA.", "Are you for real? A recurring thing? How many times do you expect your brother's fiancee to die? \n\nEvery thing you comment convinces me further that YTA. Your husband is *kind of pissed* he can't go to the funeral of a woman who didn't like him, and whose relationship his sister, who he supported, tried to destroy? What? Why would he even want to go?", "Your husband supported the villain in a plot against your brother and his now dead fiance. It seems YOUR HUSBAND was in the wrong for doing so.\n\nIf you so doggedly believe in the need to support siblings in their struggles that you excuse your husband's culpability while doing so, why are you so reluctant to support YOUR sibling?", "Info: How did you end up dating a man who, along with his family, caused your brother and the woman he cared about a great deal of pain?\n\nAlso, why did you assume everyone had “gotten over it”? Did Luke and his family apologize to Jack and Sara? Were the apologies accepted?", "Respect the wishes of the grieving, but it doesn't seem like you're being honest about what \"supporting his sister\" means in the context of telling malicious lies motivated by jealousy to ruin a budding relationship.\n\nHow about this context: Would your brother have already married her if not for the heinous behavior of your SIL?", "You mean when Luke harassed jack because his sister wanted to date jack? That was how he supported his sister?", "Sorry? He supported his sister in trying to break up a happy couple because she went on one date with your brother before the relationship started?\n\nYTA.", "> I just don't want this to become a recurring thing with Jack that he excludes Luke\n\nOh, I don't think you have to worry about that because I doubt your brother will want to see either of you after this. You have lost your brother and can only blame yourself.\n\nYTA and so is your husband.", ">because he was just supporting his sister on something that happened years ago.\n\nWhat kind of apologist nonsense is this? He shouldn't have supported his sister's creepiness in the first place. He was supporting his sister harassing and sabotaging your brother's love life because she felt like she was entitled to him no matter what he wanted. She kept tabs on him AFTER ONE DATE and harassed his girlfriend too. That's what stalkers do. If I were your brother, I would've felt so incredibly betrayed when you started dating his stalker's brother. What kind of sister does that?", "Info: Is he pissed because he's also grieving the loss of Sara in some way and wants to be there for his own process, or simply because he's not allowed to an event?", "He supported his sister, a woman who tried to break up your brother's relationship with Sara using lies and accusations. He supported a woman whose lies almost tore the two apart and gave Sara depression. He supported a woman who hasn't taken ownership or this or apologised from the sounds of things. And you seem to support this too.\n\nNot really a wonder he wasn't invited. Did supporting his sister jnvolve condoning and supporting her behaviour too? And do you?\n\nThis whole thing reads like a sh*itshow on his families behalf. And a bit on your own.", "Jack should exclude you and Luke more in my opinion. YTA, both you and your husband.", "He was \"just supporting his sister\" in harassing a man who didn't want to go out with her. \n\nIf he really wanted to support his sister in an authentic way, he would have told her to move on and accept that not every date ends up being a relationship.", "Well his sister was wrong so she shouldn't they support. She cause your bother a lot of drama and you obviously don't support your brother.", "Why is that what you are focused on? Your husband's wife *died* and your focus is on a perceived slight against your husband. And, based on the explanation you gave, it's completely understandable why he wouldn't want your husband there. Have an ounce of empathy for your brother.", "Oh whole things weird. I guess nah 🤷‍♂️", "That's a lot of assumptions about OPs husband. The sister caused all the issues, trying to blame the brother for his sister's actions and make assumptions that he indulged her behaviour is ludicrous.", "It's in the OPs comments", "Love how you summarized this so well. Good work!", "OP isn't trying to prove brother is wrong though? OP is wondering if not going to funeral is AH behavior. Brother is the AH here for making OP feel like she has to betray her husband in order to be \"a good person\".", "Cool, if the family doesn’t want him there then they don’t want her there either.", "Complying with her wishes is fine. But that would not make OP the AH if this means she won't attend the funeral.", "Drama between Luke's  sister and Sara. That doesn't involve Luke. How was he involved in it. He wasn't. Sara decided to create drama before she died and involved OP'S brother.  All of it is unnecessary Drama.", "Luke’s sister broke Sarah and Jack up cos of jealousy.", "She explains it in another [comment](https://www.reddit.com/r/AmItheAsshole/comments/yk352f/wibta_if_i_dont_attend_my_brothers_fiancees/iur3b61/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3). Luke’s sister was in love with Jack and tried to break him and Sara up. OP met Luke in the aftermath.", "Funerals are not the time for family drama (sadly it does frequently happen) .... Jack is entitled to be unreasonable. His fiancé just died suddenly & his entire life has changed. Sara’s funeral is not about Luke, he should respectfully sit this one out. People typically don’t try to make grieving more challenging for the family.", "Hazelowl you're the best!", "I was hoping she'd respond and say what Luke's opinion is.  Honestly.....if the drama was between Sara & Luke's **sister**  then dang skippy get over it.  But, Jack has lost his true love and it's about him really not Luke.   \n\nI feel as if I just wrote a synopsis for a tv soap.  I hate insomnia.", "Op explained that her husband’s sister had a thing for her brother, got Sara to dump him and husband’s family intervened in some way though unclear how", "I’m confused why that implicates luke? Exclude the sister, sure. But why does Luke need to be uninvited? He’s OPs husband. \n\nIt’s wild how so many of y’all want to hang Luke for the actions of his sister. He is a part of this family now by marriage. If he’s not invited then OP should stand with her husband.", "That makes absolutely zero sense lol I still think Luke isn't telling OP the truth", "If my husbands sister was stalking my brother and my brother didnt want my husband at his fiancees funeral because my husband defended his crazy sister then id be like \"see ya later babe\".\n\nFunerals are times of high emotions. So no i woukd not cause with someone in mourning. There is no rationality in mourning.", "It attached to the wrong comment, weird. Sorry about that! Someone else said that Zoe was Luke’s sister.", "Exactly. Odd way for OP to choose to describe her.", "Judging by how OP doesn’t even see why Jack wouldn’t want Luke’s sister I feel like I can safely assume it wasn’t the “please forgive her” one.", "Agreed, I could swear I've read this backstory before.", "She posted it here: https://www.reddit.com/r/AmItheAsshole/comments/yk352f/comment/iur3b61/", "Huh? No it isn't.", "Yeah it's a private funeral, only the people invited are allowed to come as per Sara's family's request", "What? Maybe I didn't phrase it well, but I meant recurring as in excluding him from anything else in the future, where everyone else's SOs are invited but not mine", "Again... not about OP or husband. People attend funerals out of respect for the family & to acknowledge a fiancé, daughter, sister, cousin, aunt, has passed & will be terribly missed by the people who knew & loved her. It’s not an act of betrayal to attend a funeral without your husband who was not a fan of Sara & who is not welcome. It’s a sign of respect. Why would OP’s husband want to go?!? This is more about the optics for OP & less about a woman has died & her brother is grieving.", "Luke’s *sister*. Wow. Dumb Luke for being born into a family w a sister who couldn’t handle a break up in the most mature Reddit way.", "Should be the top comment tbh", "Luke's sister caused Jack and Sara to break up by lying about Jack cheating.", "I posed the same question about Luke's feelings on the matter. This entire thing could be the plot of a bad soap.", "Or Luke defended his sisters actions in trying to ruin Jack and Sara’s relationship. And Jack now doesn’t want someone like that at Sara’s funeral. \n\nOr Jack sees his side of the family as drama and doesn’t want or need drama at his wife’s funeral.", "So basically what I’m hearing is petty drama BS that has nothing to do with Luke is why.", "Yes it is\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/yk352f/comment/iur3b61/", "So reading this it's also sara's family doesn't want him there. I'm guessing the drama is something big.", "Gotcha. Sara’s funeral is not about Luke. He should respectfully honor your brother’s request. Her funeral is not the time to deal with your family’s drama.", "YTA. Why are you making someone else’s funeral about you and your husband?\n\nThe purpose of a funeral is to (1) honor the dead (Sara) and (2) support the surviving loved ones (Jack and Sara’s family) in grief.  Luke isn’t invited because it wouldn’t be honoring Sara (1). You’re invited primarily to support Jack (2). You want to refuse to do (2) unless Jack and Sara’s family don’t do (1). \n\nHow does that make any sense when (as you said in a comment) your husband doesn’t even care whether he goes? You’re causing an enormous rift in your relationship with your brother and causing him additional pain for something about which your husband is apathetic. Unless you actually want to cause Jack additional pain or cause a rift, it makes no sense at all.", "Then address it in the future if it happens. It’s not a stand to take *for a funeral.*", "Well if you don’t go I guarantee you both not being invited to future events will be recurring.", "You chose to date and marry someone, who had already contributed to causing pain and anxiety for your brother.  Every action has consequences.  Your husband not being included is a reasonable consequence.  How did you imagine everything would play out?  Forgive and forget?", "Funerals aren't family get togethers. They're for grieving and remembering a specific person. This isn't a wedding where everyone gets a plus one but you, a woman that didn't like your husband has died. Show some compassion and have some class.", "This is a very specific scenario though. If Luke hasn’t been excluded before this why would he be now for other things, besides the funeral? Sure Luke wanted to support his sister but his sister was the one in the wrong. Not Sara. I see no problem in what your brother is doing.", "I feel like this is a pretty unique circumstance? Why would this (hopefully) once in a lifetime situation be the one you make a stand on? \n\nAlso good god this isn't about your husband. It isn't about you. It is a funeral, it is about the deceased and their loved ones. That does not include your husband. Go and support your brother. Have some goddamn compassion", "Then maybe Luke shouldn’t have supported his petty and crazy sister. Luke made the decision to back his sister trying to sabotage your brother’s relationship, that comes with consequences no matter how much you think everyone has “gotten over it.”", "Don't have a shitty husband if you want him to be invited to events in the future.", "It will continue to happen until Luke cuts his sister off. She tried to break up their relationship by lying about him cheating, he shouldn’t be expected to forgive that.", "Well, is the harassment of your brother a recurring thing? Is your boyfriend's sister still stalking him and sending her brother/ your boyfriend around to \"reason\" with him? Is your brother safe around these people? It doesn't sound to me like they would respect his grief, seeing they didn't respect the relationship in the first place.", "The family got involved though\n“I don't know the nitty gritty details on this but she apparently went up to Sara and told her to leave him, and made it seem like she was cheating on Jack. Sara fell into depression and broke up with Jack, during that time Luke's family tried to talk it out with Jack (this is when I met Luke). Eventually Jack and Sara got back together later.”", "Should be an edit and not a comment. That’s why OP already knows YTA", "So you did!  I didn't see it.  Well, if I wrote it........it would be a good one.  ;0", "OP seems like she's either sugar coating what actually happened or she's clueless and Luke is a perv and hit on Sara or something", "For some reason I thought they meant the op. Didn't see that. Thought this was another case of aita commenters just inventing narratives.", "Interesting that OP’s happy to clarify the private funeral thing, but not what Luke’s sister did despite there being way more questions on that.  I’m starting to suspect she already knows the answer doesn’t help Luke’s case in any way.", "I don't think we're going to get an answer though.", "She did [here](https://www.reddit.com/r/AmItheAsshole/comments/yk352f/wibta_if_i_dont_attend_my_brothers_fiancees/iur3b61/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) but it was only posted a couple minutes before your comment so you probably didn’t see it", "I gave up and posted my vote & opinion.  \\*shrugs\\*  My husband is waving pancakes at me.", "Oh god that makes the whole thing so much worse....\n\nOP YTA! This is a funeral honoring the life of the person who passed, totally understandable why the family won't want anyone from your husband's family there"]}