{"id": 8684, "submission_id": "10p0etv", "title": "AITA for taking back my ring?", "selftext": "So this is a pretty low-stakes argument but me (f26)and my sister (f24) are at an impasse. \n\nWhen we were kids we inherited a ring each from our great-grandmother. I don’t know anything about jewellery terms/designs, but mine has five oval rubies in a row, and my sisters was one solitaire. Since then they haven’t ever really been worn, to the point that I often forgot they existed. Occasionally they came out and we tried them on for fun, but they’re expensive enough we weren’t allowed to wear them every day. \n\nCurrently my sister lives with our parents, and I live on my own a couple of hours away. Sometime last week the rings made a reappearance, and my sister sent me a picture of her wearing my ring. Out text conversation was literally - Me: is that my ring? Sis: haha yeah. I’m getting mine resized so I can finally wear it.\n\nI did not care that she was wearing it at the time but it did occur to me to get it when I next visited them and bring it back to my house.\n\nSo I arrived at our parents yesterday, and this morning saw the ring box where my ring lives, but it was empty. When I asked my mum about it, she said that sis was still wearing it (she was at work at the time). \n\nWhen she came back I asked for my ring a couple of times and she said I could have it back but didn’t actually give it to me. No biggie, but I wasn’t going to give up. \n\nI just asked for it again and she asked if I was going to wear it. I said I was, and she pointed out that the only reason I wanted it was because she was wearing it and that if she hadn’t been I probably wouldn’t have cared at all (and she’s right, I had completely forgotten about it)\n\nHer argument: I don’t wear jewellery much (if at all), so she should be able to wear it until hers is resized since that way it gets worn. Our mum sort of agrees with her and says it should stay at their house anyway since it will never get used at mine, and might even go missing amongst my stuff (she says I’ve got stuff everywhere which is only slightly true)\n\nMy argument: it’s my ring so who cares what I do with it, and in any case, I do really like it and want to wear it more (which I can’t do while it’s at our parents house). On the other hand I love my sister and don’t really mind if she wears it as long as I get it back and she doesn’t keep it (she likes mine more than hers). \nEDIT, I think this last line might be giving the wrong impression, there is absolutely no chance that she would have ever actually stolen it or kept it from me when asked. If that was in any way a possibility I wouldn’t feel guilty or like an AH in the slightest. \n\nAITA for taking it back for petty reasons and not letting my sister borrow it for a few weeks?", "created_utc": 1675080677, "permalink": "/r/AmItheAsshole/comments/10p0etv/aita_for_taking_back_my_ring/", "score": 360, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I took my ring back from my sister for petty reasons. I might be the AH since I don’t need it soon, rarely wear jewellery, and she only wanted to wear it until hers was resized. The only reason I have a claim on it is because I got it when I was a kid, if it was just a random bit of jewellery it would objectively be better off staying with her. She’s also my sister and I feel like a jerk for insisting in it back when she was enjoying it and I would have gotten it back anyway\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nIt’s your ring and your property. She took it without asking and was using it regularly.\nIt’s okay to be disturbed or not liking it when people use your things,", "NTA. It's *your* ring. You're not taking it to be petty, you're taking it to wear. (And I *do not* trust sis not to be pulling a stealth theft here, where it'll be \"just a few weeks\" for several years and then \"well I've had it so long and you didn't mind......\")", "NtA. It is your ring. Dont give it to her", "NTA It’s your ring.", "NTA it’s yours. Doesn’t matter if you wear it or not.", "NTA but you should ask yourselves what’s going on here. There should be a discussion about boundaries.", "NTA. You are allowed to want your belongings with you and decide what is done with them.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo this is a pretty low-stakes argument but me (f26)and my sister (f24) are at an impasse. \n\nWhen we were kids we inherited a ring each from our great-grandmother. I don’t know anything about jewellery terms/designs, but mine has five oval rubies in a row, and my sisters was one solitaire. Since then they haven’t ever really been worn, to the point that I often forgot they existed. Occasionally they came out and we tried them on for fun, but they’re expensive enough we weren’t allowed to wear them every day. \n\nCurrently my sister lives with our parents, and I live on my own a couple of hours away. Sometime last week the rings made a reappearance, and my sister sent me a picture of her wearing my ring. Out text conversation was literally - Me: is that my ring? Sis: haha yeah. I’m getting mine resized so I can finally wear it.\n\nI did not care that she was wearing it at the time but it did occur to me to get it when I next visited them and bring it back to my house.\n\nSo I arrived at our parents yesterday, and this morning saw the ring box where my ring lives, but it was empty. When I asked my mum about it, she said that sis was still wearing it (she was at work at the time). \n\nWhen she came back I asked for my ring a couple of times and she said I could have it back but didn’t actually give it to me. No biggie, but I wasn’t going to give up. \n\nI just asked for it again and she asked if I was going to wear it. I said I was, and she pointed out that the only reason I wanted it was because she was wearing it and that if she hadn’t been I probably wouldn’t have cared at all (and she’s right, I had completely forgotten about it)\n\nHer argument: I don’t wear jewellery much (if at all), so she should be able to wear it until hers is resized since that way it gets worn. Our mum sort of agrees with her and says it should stay at their house anyway since it will never get used at mine, and might even go missing amongst my stuff (she says I’ve got stuff everywhere which is only slightly true)\n\nMy argument: it’s my ring so who cares what I do with it, and in any case, I do really like it and want to wear it more (which I can’t do while it’s at our parents house). On the other hand I love my sister and don’t really mind if she wears it as long as I get it back and she doesn’t keep it (she likes mine more than hers)\n\nAITA for taking it back for petty reasons and not letting my sister borrow it for a few weeks?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - I've been told this before too.  'Ohh you never wear jewellery' so you're not entitled to inherit any.  'You don't use expensive silverware, I'll give it to Y'\n\nIf the ring needed to be protected and kept in your mothers home then why was your sister wearing it about the place ?", "Get it back now or she will keep it. The writings on the wall.", "I do feel the need to defend her a little and point out that she knew I ~~would~~ wouldn’t care she was borrowing it because I’ve legit never worn it for longer than about 10 mins at a time, it only nominally mine. I felt like a butt asking for it when she was enjoying it and would have given it back.", "Okay I need to defend her here, it absolutely would have only been a couple of weeks. She would have NEVER stolen it from me, if that was even a possibility I wouldn’t feel guilty at all. But I know she would have returned it when I asked (since she did).", "To clarify I’m not giving it to her and she was never going to keep it, but I feel like a heel for not letting her borrow it when I know she was enjoying it. She’s my sis and I love her, I don’t like intentionally being an AH over something so small.", "You didn't defend her here. You pointed out that she knew you wouldn't like it and did it anyway. Unless you meant wouldn't, instead of would.", "Fair enough. I don't like that you had to ask twice, though, and I really don't think \"it's mine and I want it back *to use it*\" is a petty reason.", "Fair enough. So you need to agree the boundaries. Have a conversation, with her about what exactly you expect e.g. \n1. Happy for her to wear a ring but for specific timeframe agreed ahead\n2. Commitment that she will look after it and won't be careless due to sentimental value\n3. What happens if she looses it", "I did. I’m gonna make a little edit to clear that up", "In fairness, the first time I asked we were in separate rooms and the second time we were having dinner and got derailed into another conversation. She gave it back the next time. And she was right, I probably won’t wear it all that much so there’s no reason not to lend it to her in the meantime. Like, objectively I know that ‘it’s mine and I want it’ is a good reason, but you can still feel like an AH for doing it.", "Ntha, understand this you will never get that ring back if you let her keep wearing it", "NTA. Your sister is a thief. She knows it's your ring and started wearing it without permission. Then she asked if you were going to wear it. That's not her business. It's your ring. Call the police, theft is a crime and if the ring is worth a lot, is a felony.", "If she’d asked, it probably wouldn’t have bothered you. She didn’t. And then she dragged her feet about giving it back. You were right to take it back. It’s super tacky to take something without asking and then act like it’s no big deal. And shame on your mother for agreeing with her. NTA", "NTA but you're acting like my kids over toys and they're six and two.", "NTA. It’s your inherited item. Take it and care for it. Find a special place to keep it so it doesn’t get lost. \nWhy are her feelings more important than yours? It’s yours, get it and enjoy it.", "It’s yours take it back tell mom to mind her own business NTA", "NTA. But just take the ring it’s your ring and she has her own. Doesn’t matter if you wear it or not take the ring. It simplifies life down the road", "INFO: why can’t you wait a few weeks? You haven’t worn it since you were a kid so it’s not like you’re missing it…", "Why ask this question when you respond to defend your sister. I’m confused as to the point of you asking this if you keep saying you want to defend your sister.", "She didn't give it back and taunted you. She has no intention to return it, not when she thinks she has more entitlement because she wears jewelry.", "[removed]", "Then why are you posting?", "Why wouldn't she return it when you asked for it? I think you're naive about her intentions", "She didn't ask permission and resisted returning it. Sounds like stealing to me.", "Do you often bend over backwards for everyone? It's your ring, and you want it. If your sister cares about you, she will respect that.", "DO NOT LEND IT TO HER. She'll keep it.", "\n  N`` add", "OP you said she would not keep it from you when asked - after she has deleted my kept it from you when you directly asked for it.\n\nTell her to return it, pop it on your finger and go on with your day. If she doesn’t ask why she is withholding your property from you.", "If that’s the only issue, let her use it a few weeks.", "NTA, my mom and sister used to do this, borrow my stuff and then because I didn’t ask for it back soon enough they’d play the “well you don’t even want it/you don’t wear it” etc it doesn’t matter it’s mine.  It was very annoying as a teen to deal with", "NTA\n\n\"You're right, I haven't thought about that ring in a long time, but seeing you wear it reminded me of it and inspired me to want to appreciate it more.  I think you should keep wearing it until you get your ring back from being sized and then we should have lunch so I can see the new fit of your ring and pick up my ring.\"\n\nIt doesn't sound like you're angry about her wearing the ring, but you should set some boundaries that you want the ring back.  It's fair to want to have your own property regardless of how you plan to use it.", "NAH.", "NTA.\n\n\"It's mine, and I want it back, and I expect the respect of being asked if you want to borrow things of mine.'\n\nThat said, if she really likes it and you're indifferent to it, maybe consider having it appraised and sell it to her?", "It’s your ring, your property, end of story. She took your property and wore it without your permission. What would happen if SHE lost YOUR ring?!?! You wouldn’t have a ring. It’s your property and you decide what you want to do with it. Take the ring, bring it to your place, and don’t let her touch it. NTA", "NTA\n\nIt's YOUR property, it doesn't matter which ring your sister likes best.\n\nIf you want to use your ring to hang towels, so be it. If you want it to stay on its bokx forever, so be it\n\nYour sister can't decide what to do with YOUR property. And she had to give it right back when you asked for it, period\n\nSince you don't know about jewels, resizing a ring doens't take longer than a week. I believe your sister has her's safed in its box and uses yours because she prefers it", "NTA - Get your ring back. She didn't even ask if she could borrow it. And now she won't. It doesn't matter if you don't wear it. It's yours.", "NTA. It's *your* property, you don't need a reason.", "NTA\n\n&#x200B;\n\nThere is no need to let someone else have YOUR jewelry.", "ESH\n\nI get why everyone is saying you're not. Of course it's your ring and your right. But if you have a good relationship with your sister, why be petty? You wouldn't have noticed the ring or worn it if she hadn't used it. She's getting enjoyment out of a family treasure and it deserves to be shown off! Why take that pleasure away out of pettiness? As sisters, I'm sure there will be a time when she could take something from you to be petty and you wouldn't like it. Reddit are quick to just be extreme and say 'You're morally right, who cares about family, black and white views blah blah', but do you really think all of those commenters have happy families with that kind of attitude? Family is more nuanced than that.\n\nShe sucks a bit for not asking in the first place. But honestly if you're close sisters, I don't know if she would have thought about it. Just like most siblings may borrow a pen or a hoodie from each other if they need it and have an assumed acceptance of that. If you don't like that, then make a new rule. But be prepared to be disadvantaged by that rule one day.", "NTA\n\nThe rings doesn’t care if it gets worn. You each have one, and if you don’t want to lend yours to her then you shouldn’t", "I have three older sisters.  We shared everything growing up.  With that being said, if I asked for something back, there would be no hesitation and no mockery.  NTA but your sister fits the bill.", "NTA - Your ring, if you want to leave it in the box until the day you pass you are allowed.  She is not entitled to even make an argument about something that doesn't belong to her.", "Nta it's yours! What if she loses or breaks it?", "Sounds like theft", "NTA. If it’s yours, it’s yours. It’s a Matter of principle. She should ask before wearing it, and give it back when asked. I would take it the next occasion you get. She has hers. You have yours.", "Hey. She's your sister so of course you're defending her. But the verdict of most of us is that your NTA. Your sister and your mother are being rude over this. Get your ring back, sis", "[removed]", "The sister hasn't worn hers either so it's not like she's missing it either. Also OP lives a few hours away. Is the sister going to drive the ring to her when she's done wearing it?", "Then she should have asked.", "[Bot](https://old.reddit.com/user/Naedfg) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/10p0etv/aita_for_taking_back_my_ring/j6iule0/)", "I've worked in the jewelry business for over a decade and a lot of things can happen to jewelry in the span of only a few weeks that can completely devalue the piece...even though rubies are corundum and obviously quite tough.\n\n1. The band could become tarnished/bent depending on the alloy.\n2. The rubies could chip and be scratched. (Yes, they can, in fact, chip or be scratched regardless of the fact they are corundum.)\n3. The rubies could be exposed accidentally to chemicals they are not intended to be exposed to at all.\n4. Unwanted dirt and skin detritus, although capable of being cleaned, is still not something you should have to clean after the fact on your own or at a reputable jeweler.\n5. Biggest factor here: if your ring has five fine oval rubies there is a chance one could fall out. It does happen, and if this were to happen when you were wearing it obviously you'd be the brunt of the accidental loss. \\*However\\* if a ruby falls out/pops out/etc., while your sister is wearing it I am sure it might be more of a headache than it is worth.\n\nThese are just things to consider. Personally I think you are NTA for wanting your ring back. I know \\*plenty\\* of people that keep their jewelry in boxes for years only to take it out on very special occasions or if the mood strikes them. So yes, please take your ring back if you want. It's yours isn't it?", "If she’d asked, it probably wouldn’t have bothered you. She didn’t.", "[Bot](https://old.reddit.com/user/Substehfh) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/10p0etv/aita_for_taking_back_my_ring/j6ie3fx/)  \nYeah, bot. Tell them theft is a crime. Go on.", "It seems that you don't want to accept the verdict of NTA... what if your sister loses your ring? What if she gets mugged and the ring is taken? I understand that she's not stealing it from you but it's still your ring and it's very valuable, you should be responsible for it - not your sister and not your parents.", "Thank you!!! Was about to say the same thing!! What if it gets lost while sister has it!!", "I wanna say NAH. I do think it would be very nice of you to let her keep wearing it until hers comes back though", "NTA\n\nSince you seem to have trouble believing everyone about that:\n\nHer deciding to resize your ring without asking your permission was not reasonable. That is why you are nta, and it isn't a nah situation. It is perfectly reasonable for you to wish for your own property to remain usable for you should you choose to, and resizing might make it unusable to you. \n\nGet your sister one of those spacer things that makes it smaller if it's too big, or let her continue wearing it on whatever finger it fits if it is too small for the finger she's wanting to wear it on, if it makes you happy to see it being worn more and you don't mind her borrowing it.", "NTA, it sounds like your sister was trying to take ownership, maybe they liked yours better, maybe they just wanted both.  But if you let it continue, the next time you asked, it would be \"but it fits my personality so well\", or \"but I have been wearing it so long, it's like I have a connection to grandma\".   \n    \nYou say there was no way they would have stolen it, but I think you may be looking at the situation and giving too much benefit of the doubt to your sister.", "NTA\n\nYou say she would not steal it, but if it's taken without your permission, that's the exact definition of stealing. If she is getting her ring sized, what's the chance that this ring is not the right size for her also? If you lose your own possession, that's bad on you. What happens when she loses your possession? Will she then give you her ring? And she had the ability to just give you the ring when you asked for it, regardless of the reason why you were asking for it, but chose not to!", "Nta I have noticed that people who use something long enough will start believing/acting like it's theirs. I remember my sister borrowing my pristine, admittedly barely used, typewriter. This was several decades ago obviously. She used it till it fell to pieces and then bought herself a pristine new one and I had nothing. It was the moment I realized that being raised to be nice was something I had to get over. I'm 60 and still struggling with it.", "If you 100% believe your sister would not keep the ring, let her keep it until hers is re-sized. If she's already taken it in to be done it should only be a matter of weeks or even days.", "NTA. Your ring. Any other argument does not work. However, in the update,  if she has no intention of keeping it, whats the big deal in letting her wear it for 2 more weeks?", "NTA Its your ring. Is your sister going to compensate you if she looses it or a stone? Is your mother? Take the ring back it’s yours.", "NTA - it is your property where does your mom & sis get off thinking they have any right to put stipulations on what you can do with your property?", ">Her argument: she should be able to wear it until hers is resized since that way it gets worn.\n\nINFO: what?  I don't understand this argument.  Like, at all.  Her ring is getting resized, which implies she had not been wearing her ring previously.  So why does she need to wear yours until hers is ready?\n\nAlso, \"that way it gets worn\"?  Does she think that it will hurt the rings feelings if it's not worn regularly?  That it won't get the proper exercise if not worn regularly?  WTF?", "You say \"there is absolutely no chance that she would have ever actually stolen it or kept it from me when asked\" - but that is exactly what she did. You asked her for it repeatedly and she kept it from you.", "Nta. Your ring. She needed permission before wearing it", "mixed.\n\nit seems like her wearing it is a factor in you wanting back.", "NTA but if you do not lay claim to it and take it away, in a few months your mum will say, 'you should let your sister keep it, as she wears it all the time anyway and is now very attached to it. It has sentimental value to her and not you.' You do not appear to be aware of the 'stealing by degrees.' Your mother is already enabling her wearing of it, which should never have happened. Get it off her.", "NTA.  **Them keeping it safe for you was okay when you were still a child.**  \n\nYou are an adult now.  **It's yours.  They should have handed it over to you,** years ago.  Letting your sister wear it, without first asking your permission, that's them crossing boundaries that shouldn't have been crossed, already.  \n\nYou, an adult, having control over what belongs to you, **that's not petty.**  \n\n**Do not let your sister borrow it.  Take it home.**  It's not a pet that needs to be walked.  It's something that belongs to you and you should have it, even if you put it in a bank box and leave it there for decades.  Or if you keep it in your cookie jar.", "NTA.  Quit arguing.  Tell her, “the ring is mine.  Give it back now.  All your arguments are irrelevant.”", ">there is absolutely no chance that she would have ever actually stolen it or kept it from me when asked.\n\nLiterally what she's doing right now. Take it back cause if it goes on for long enough then it might turn into \"Oh but it's been mine for so long now!\"", "NTA - Your ring, your choice on who wears it.", "This is the question", "I feel similar but with the soft grading of N A H because nobody seems to be doing anything with malicious enough intent for me to call them a real AH here lol", "Why do you think she’s going to give it back in a few weeks? She told you that she would give it back the first time you asked, and then flipped the conversation to why your request is unreasonable. Why will that change in a few weeks? Your mother said— in defense of your sister’s not wanting to give it to you— that your house is an unsuitable place to keep it and that you should leave it there. Why would this change in a few weeks? Get you ring back now or next time you’ll be rehashing an old fight, which is always harder than just sticking to your guns in the first place.", "Get the ring. Bring the ring home. Bring it to a reputable jeweler to be cleaned and checked for damage (loose stones etc.). Get the ring appraised and insured. Keep it at home on a safe place unless you personally are wearing it. If sister asks to borrow it say no.\n\nNTA but maybe the jeweler can also polish your spine a bit?", "NTA, take your property and that's that.", "NTA\n\nIt's fine to have confidence in the character of your sister and to be open to letting her wear it. But I think you don't want to face that your sister crossed several lines of decent, respectful behavior with you. It doesn't mean she's horrible; it does mean that you are right to take some steps to safeguard this bit of your inheritance.\n\n1. Sister never asked you if she could wear the ring. It wasn't for just a little bit; it was for an extended number days. That is completely ignoring/disrespecting you as the rightful owner of the ring.\n2. You asked for it back repeatedly, and she repeatedly never gave it back to you.\n3. You pointedly asked for it back, and SHE ARGUES with you!!! It is not her call to decide the logic of why you want the ring now or to feel entitled to wear it while hers is getting resized. (She never wore it before; she only wants it now because she has decided she wants to wear her ring and can't yet wear it. That's no bigger reason for her to wear it than yours, AND it's NOT HER RING to decide who should wear it right now.)\n4. Look, I just went through figuring out some inherited jewelry that me, my SIL, and my sister all received. We are happy to loan things to each other, but we also completely respect who now owns what and have never and will never presume to have the right to say what the owner should or shouldn't do with their property. Your sister (and your mom) needs to learn some respect for your rights at the owner. Your mom should also learn to not get in the middle of things between her adult daughters.\n5. At this point, if you have doubts about your ability to safeguard the ring in your own place, you can choose to make your home a safer place for you to keep things or choose to get a safety box. You could leave the jewelry at your parents, but (1) not even your mom respects your ownership of the ring and (2) it's really time for you to be responsible for safeguarding your property.", "YTA. If your ring is important to you, why did you leave it at your parents?  And why are you asking since you acknowledge your objection is petty and that your sister isn't stealing?", "NTA. I once let my sister use something of mine and she refused to give it back. It wasn’t anything that had monetary value. I didn’t think she would ever do that to me either. So no matter what you think, you really are NTA.", "op=NTA about the ring\n\nbut I think you are NAIVE about it.  You are so sure that ring will come to you, but they are doing everything at this point to keep it from you.\n\nGet the ring, make sure it's insured, Get a jewelry box or small safe(fireproof) and put it there when not in use.\n\nDon't assume that this won't turn into a family conflict, even loving families get into stupid fights over \"small\" things.", "NTA. It doesn’t matter if she “knew” you wouldn’t mind. Is she psychic? No. Is this ring your property? Yes. She should have asked. Period.", "NTA \n\nYou thought about it after seeing her wearing it. She should have given it back immediately. \n\nI am not saying your sister is a horrible human and you need to stop being so defensive of her. Her borrowing it was fine, not giving it back immediately was not ok and you are always in the right to take back your own property.", "NTA. Just get your ring back. It’s yours. No reason for your sister to be wearing it period.", "Thank you for your response. I was actually feeling worse having posted and seeing everyone vilify my sister - we’ve got a healthy dynamic, I only posted coz I was curious if people agreed with her or me, but I don’t like that everyone is assuming she’s evil or manipulative", "We do have a tendency to revert to our child-like selves over things like this….", "She’s not resizing mine, she inherited one as well but it’s too small for her, so she’s getting it resized and wanted to wear mine in the meantime", "Honestly take the comments with a pinch of salt. AITA is notorious for assuming the worst and having some really extreme views. That's why I had to comment, even though I knew I'd probably get downvoted. I personally love having a family where we help each other out and do favours etc, but it's a two way street. Reddit likes to promote a 'this is mine and this is yours' mentality, which works for some but not for others. Just see what kind of relationship you want and go from there. But personally I'm in favour of not being petty because one day I'm sure you'll get good karma back :) Good luck!", "Thank you for this.  So many folks seem to think jewelry is almost indestructible.  Those stones are hard but can be chipped or ruined by whatever liquid you get on it.  It’s best to take care of them.", "No problem! Thank you for commenting. :)", "It’s not that I don’t want to accept it, but it seems like most people are voting me nta because they think my sis is some evil manipulator who was looking for a chance to steal it from under me, and that’s not the case. We’re *sisters*. We have a healthy dynamic. We’re going out with friends tonight. I don’t like everyone acting like this is some huge drama between when the only reason I posted was to see what other people thought of the situation. I really hate everyone vilifying her - she’s a lovely person who had no reason to suspect I would even care she was wearing it."]}