{"id": 8784, "submission_id": "10q5qq2", "title": "AITA for telling my roommate that speaking a language is not a personality and she needs a new one?", "selftext": "I (f19) am in my first year of college, living with a roommate, Katie (f19). Katie speaks three languages (English, German and Spanish) and she makes it her whole personality. \n\nWhenever I ask what she’s watching, she’s watching something in another language. So obviously I can’t watch it. She’s always listening to music on her headphones and when I tried to bond and listen to what’s she’s listening, it’s in another language again and I couldn’t stand it. \n\nHer friends all speak one of the languages she does and whenever I hear them, I can’t join the conversation because they mixing everything so I’m left out of their convo.\n\nThe other day, I saw she had a new book on her desk, Portuguese coursebook. I asked her about this and she said she’s taking private Portuguese classes starting February.\n\nI told her she has to let it go, that she needs to develop her personality because speaking a language isn’t a personality trait and she’s just boring.\n\nShe got really annoyed with me and told me I’m an asshole and to stop eavesdropping on her convos.\n\nI told her she’s boring and has to fake her personality.\n\nNow, she’s not speaking to me.\n\nMy friends are split, some agree with me and some agree with her.\n\nWho’s the asshole here? AITA for telling the truth?", "created_utc": 1675187945, "permalink": "/r/AmItheAsshole/comments/10q5qq2/aita_for_telling_my_roommate_that_speaking_a/", "score": 3119, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole because I told my roommate she needs a new personality because speaking a language ain’t one. I might be an asshole because I’m only going to be living with her for the next w months and after that it’s none of my business what her personality is and perhaps I should’ve kept it to myself to avoid being an ass\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Green isn't a good color on you.", "YTA - she has a personality. She has friends, interests and hobbies. Just because you don’t like her music or can’t keep up with her friends doesn’t mean those things don’t count, it just makes you sound jealous and judgy.", "YTA.  Jealousy is not a personality either.", "YTA. It’s funny how many of these boil down to petty jealousy", "YTA - 100%. Your roommate has an interest and is engaging with it and with people who share that interest. There's nothing stopping you from also enjoying movies in another language--you could have asked her to turn on the subtitles. Between the two of you, you sound like the boring one, tbh. You're lurking around your roommate, judging her for having interests that don't involve you, and then were needlessly nasty to her because you can't speak the same languages she does. \n\nOne of you definitely needs to work on her personality, but, spoiler: it's not your roommate.", "YTA shes not making it her personality, youre just sad and jealous. Have you heard of subtitles? And music can still be pretty damn good  in other languages, i dont speak french, but i sing my heart out phonetically to Indila when shes on.\n\nAlso, YOURE THE BORING ONE, being so caught up in other peoples stuff. Get your own personality that isnt toxic. If this is truly your personality, you should be the one faking it to a better one.\n\nYTA x100", ">AITA for telling the truth?\n\nWhat you did was give your uneducated ignorant jealous OPINION. Not the truth.\n\nYou sound jealous and it ain't cute. \n\nYta", "Hello, jealousy, old friend. \n\nYTA", "YTA\n\nHer enjoyment of other languages is HERS and kudos for her learning even more.\n\nThe boring jealous AH here is you", "YTA. Katie does not need to change and dumb down herself just so you can glom onto her interests, tv shows, music or friends. Stop trying to police what she learns, watches, listens to or speaks, and maybe go get yourself a clue.", "YTA\n\nYou're just jealous of her linguistic ability and need to get a life.", "YTA.\n\nThis entire post screams envy. You’re the only one who has an issue with her knowing other languages\n\n>I told her she has to let it go, that she needs to develope her personaility because speaking a language isn’t a personality trait and she's just boring\n\nSpeaking different languages isn’t a personality trait, it's a skill. What IS a personaltiy trait is jealousy, this is what you have OP", "You need to stop making only speaking English your personality and actually develop a real personality that makes people want to be around you. \n\nYTA", "YTA. What makes YOU interesting other than putting others down?", "YTA. You don't need to like her or approve of her personality. Be courteous to each other living together and let the rest go.", "YTA...It sounds like she's leading a full life. Give it a try.", "YTA. Why do you care what her interests are? Get your own hobbies/ personality that doesn't involve putting down others.", "YTA. \n\nYou are projecting your own insecurities onto Katie.\n\n  \nThe truth is, she's not boring; she's got friends and a personality for every language she speaks, and you (by your own admission) have the one personality that can't bond, relate, join in, or stand learning a new trick.", "YTA - The only person making a big deal about the languages she speaks is you.", "YTA because she has a personality and interests that you don’t seem to understand or value. It’s far better to tell her you feel excluded and can’t find ways to share or get to know her better because of her interest in foreign language. Being a roommate doesn’t mean you have to be best friends, it just means you need to interact satisfactorily.", "YTA. Your roommate can do whatever she wants within reason and craft her personality based on whatever she chooses and does not require your approval. I wonder if you are jealous of her abilities.", "YTA- get the hint she doesnt want to be friends with you.  She is allowed to talk with her friends in whatever language they wish to speak.  If they wanted to speak to you, they would.", "YTA - this can't be real, can it? When did she ever indicate that it was her personality? She likes languages as much as you like complaining about what your roommate does.", "The fact that she seems to have plenty of friends with whom she can converse would indicate that she has plenty of personality to attract those friends.\n\nYTA", "YTA. I understand you may feel left out but you’re projecting that onto her. For example, coming from an East Asian ethnicity it’s really common for us to read/watch/listen to shows and music in other languages; I don’t think you would say to a Chinese person who listens to K-pop that they’re faking a personality. I personally take Japanese classes because it’s an interest of mine to go to Japan. My school is 90% Filipino students and I have picked up some Tagalog to help with fitting in. Please re-examine your own insecurities before ruining anything left of this friendship", "YTA.\n\nThis sounds like another story I heard.\n\nThe only difference is OP in the other story made the comment during a party.\n\nThey were also voted YTA.", "YTA. From your post, it seems like your roommate has a skill with picking up languages. She has interests in foreign films, music and books. That doesn’t make her boring. That opens up a minimum of 3 new worlds and cultures for her to explore. \n\nYou don’t really speak on her personality or yours for that matter. A personality is a group of characteristics/qualities that make a person who they are. Describing her personality would include her disposition. Is she a happy go lucky, go with the flow kind of person? Is she an anxious nervous need to plan everything person? Her language skills aren’t a reflection of her personality and your lack of language skills aren’t a reflection of yours. \n\nBut your lack of understanding and judgement and jealousy of your roommate does speak to your personality. Turn on subtitles. Listen to the beat of music you don’t understand. Music is universal. I don’t speak Spanish or French and still enjoy songs in both languages. \n\nMaybe do some self reflection because it sounds like you may be insecure and you’re projecting that on your roommate. So again, YTA.", "YTA\n\nYou just described your roommate as well educated, interested in TV and music and continuing their education, and as having friends.  \n\nYou've described yourself as jealous, intrusive, and petty.\n\nYou didn't \"tell her the truth\".  You exposed yourself.", "YTA, jealous much?\n\nNews flash, the world doesn't revolve around you.", "YTA.  She is very intelligent being able to speak 3 languages, some people can barely speak one.  You are jealous of her.", "YTA, nowhere does this seem like a personality trait, she just knows other languages and you seem super jelly about it. \n\nPersonality trait would be bringing up another language all the time with strangers who don't speak it, interjecting all places she uses her languages, etc. \n\nI'm horrible at languages, but I still watch tv and listen to music in other languages because good content is good content. Subtitles exist if it really matters for that reason. \n\nRather than being a dick, why not apologize and ask her for recommendations if you're actually interested in bonding and not acting out some teenage highschool bully aesthetic? Or invite her to do something fun together that doesn't involve her interests?", "YTA and so narrow-minded. Go learn a new language.", "YTA she sound far from boring, very interesting actually. Your jealousy is shining through OP, let it go.", "YTA it doesn’t sound like she’s made it her entire personality, it just means she’s able to enjoy media in different languages and have conversations with her friends in different languages. If she wants to learn an additional language, more power to her. Again, that’s not her making it her entire personality. It’s just something she enjoys doing. She doesn’t owe it to you to be “interesting” to you or only watch tv you can watch or only listen music you can also listen to.", "OP you’re just jealous that while she can speak three languages, you can’t even properly type in one.", "YTA it's not a personality. She can enjoy different things because she can speak the language. \n\nKinda obvious.", "This troll again?\n\nYTA", "YTA\n\n\"My roommate can do things I can't so I told her she's boring.\"\n\nYTA", "YTA and wow! How can you possibly think your roommate is the one with the problem? She was not put on this earth to entertain you.  Try developing some of your own interests, and finding other people who share them instead of expecting someone to change how they are just to accommodate you.", "YTA - If you feel so jealous and left out, just learn a new language.", "YTA and OP?  Did you ever consider that your roommate doesn’t WANT to be your friend?  Maybe she is actively avoiding talking to you or spending time with you because you talk to her like this.  Leave her alone.", "YTA. The fact is that speaking multiple languages and exploring the cultures they reflect is a lot more of a personality than mean girling your way through life by belittling people with an actual skill set.\n\nYou're the one who needs to let it go and become a more rounded person.", "You sound like an American rooming with a European.   YTA no matter what your nationality is.", "YTA, and an obviously very jealous one as well. Katie is very smart and I’m sorry that makes you feel so dumb.", "\"I told her she has to let it go, that she needs to develop her personality because speaking a language isn’t a personality trait and she’s just boring.\"\n\nYou didn't tell any truth. You're just an insecure asshole who gets triggered by other languages for some reason.\n\nYTA.\n\nYou got upset because you saw a cookbook in a different language. Really stop and think about how pathetic this is for a second.", "YTA, you should probably work on your personality. Being judgemental isn't a very good personality.", "Yea I don’t think anyone was agreeing on you with that OP I think you lied at the end to make it seem like someone was agreeing with you YTA", "It’s true that speaking more than one language does not make a personality, but that’s not the case here. She has friends and interests and hobbies and a life that involve other languages. Her friends know her personality because they share her hobbies and interests in those other languages. You don’t know that because you’re a small minded monolinguist. And also YTA.", "LMAO you’re mad someone is listening on their headphones to music you don’t like? And that you can’t eavesdrop on her private conversations because you don’t speak the language? It also sounds like she does more than “speak” the language — she actively immerses herself in lots of different cultures, which is actually a pretty interesting personality. It’s also clear she doesn’t WANT to share with you, even if it was in English. It’s low key unhinged to be mad people do things privately that you can’t partake in. YTA.", "YTA\n\nHave you actually tried to talk to her about things that might interest bothof you? Or was your goal just to keep butting into things and getting mad when it's in a language you don't speak? \n\nYou don't need to be friends with your roommate. However, life is so much easier when you actually get along with the person you live with. Try apologizing and ask her about herself. Maybe you two can find common ground or interests that'll make it possible for you to bond.", "Yes, YTA. Her personality is whatever she wants it to be. Being a jealous AH isn't a personality either, FYI.", "I can’t believe there are people like this, wow! YTA", "YTA. \n\nYou sound jealous. And I mean, you probably should be. Katie sounds smart, interesting, talented, dedicated to her hobbies and passions and like a really cool person to hang out with. You on the other hand... \n\n>>I told her she's boring and has to fake her personality. \n\nGirl... I don't think you're a very good judge of what's interesting or not, nor do I understand why you'd think she'd give a fuck what you think about her. You're *roommates*, not friends. She doesn't owe you bonding time or to include you in her conversations with her actual friends. And she's not *faking* her personality - she has one, and it sounds like a great one. You're just not compatible with her and are pissy about her not catering to you. Grow up.", "When I read the title I was expecting your roommate to be going around constantly bragging about it and doing something silly like answering all your questions in a language she knows you don’t speak and then saying something inane like “whoops, sorry, I forgot you don’t speak \\[X\\]!”\n\nBut nope, you’re just sad and jealous because you can’t butt in to what she’s doing all the time and bizarrely insert yourself into every aspect of her life the way you seem determined to do for whatever reason.  Massive YTA.  Leave your roommate alone.", "YTA. You frankly sound boring and fake. Do you have nothing better to do than get pissed off because she can do something you can't?", "YTA. Your roommate sounds awesome, it's very cool that she can speak multiple languages. And you are extremely rude. You don't have the right to tell her she shouldn't learn another language. \n\n>AITA for telling the truth?\n\nThere was no “truth” here, just you being an ahole.", "Well, you tried to tear her down for her accomplishments...that goes into AH territory.", "It must be really fun to be around you. \n\nAnd to think that there are people forced to interact with you.", "YTA, so very much. She's definitely not boring, she's cultured.", "YTA she has different interests than you and pursues them. One thing if you don't like being left out, but you don't have to be an AH about it.", "YTA. She is not obligated to watch or listen to everything in a language you can understand. Also, subtitles are a thing, you know...", "YTA - Its none of your concern what books she reads or shows she watches or languanges she learns.", "YTA. You sound jealous and nosy. You don’t like not understanding something? Learn the language!", "YTA congratulations your personality is that of an asshole! And a jealous one at that! Also, I don’t think your roommate wants to hangout with you… because she only hangs around smart people.", "YTA - If your jealous that Katie can speak three languages take the time to learn a new one.", "[removed]", "She has friends and hobbies. She sounds like she is doing fine.\n\nYTA", "YTA and you are clearly jealous. Deal with your issues.", "YTA. And you didn’t tell the truth, you gave your shitty opinion. Obviously she enjoys learning languages- this does not make her boring. If anything, it makes her more interesting, as she can read/watch/listen to media from a variety of cultures. Also- and I say this as an American- only knowing one language is a predominantly American trait. The majority of people in developed parts of the world know at least two languages- their native language, and English. In parts of Africa many people know at least one native dialect (if not more), French, and English. Get over yourself.", "YTA, and she's not the one that sounds boring.", "YTA. You sound jealous and intimidated. It's okay to realize she and many more people in the world are far smarter than you.", "Or you could learn to speak another language and not be so arrogant.", "Language troll is back. YTA.", "Katie's life doesn't revolve around you. Leave her alone. Make your own friends. \n\nYTA", "YTA here. She's cultured and nothing you've described is boring except maybe your incessant need to try and insert yourself into anything she's doing. How about you get your own hobbies and leave her to her thing?", "YTA. You’re her roommate, and it doesn’t sound like you would make a very good friend.  My daughter learned to speak fluent Spanish, graduated college and teaches English in Spain. It’s not only part of who she is, it’s her job. Calling someone boring is an insult.", "Haha, what? Your roommate has interests she spends time on and shares with other people? Cringe. \n\n/s \n\nYTA. Why would you be so worried about her spending time on something she's interested in? Is this triggering insecurity in you?", "YTA - why are you so bothered about someone having language skills?", "YTA, look for other friends if you don't have the same interrests, outing yourself as being ignorant seems like a bad move though.", "Did she invite uou to watch a movie or hung out with her friend? Because to me it seems that you try to impose yourself to her and you feel excluded and jealous. YTA", "YTA ... Because what she watches and listens to have CONTENT that forms other parts of her personality, but because you don't understand those things, you don't understand what other things she's interested in.  \n\nIn other words, you don't understand what she's about because you don't understand the language in which it's presented.  Her friends speaking in a different language probably aren't exclusively discussing conversation in a different language.  I would assume they discuss issues and interests that DO form a personality.\n\nThat's not her problem.  \n\nRoomies need to coexist without conflict. Period.  That's all.  And you're creating conflict where none actually exists.  She has a personality, but you just don't understand it, due to language choices.  That a YOU problem.  You have expectations of your relationship with her, that exceed her own, and judge her because you don't understand the languages in which she expressed her personality.\n\nHaving said this, it wouldn't kill her to try to be a little more inclusive.  Your feelings of being excluded are being exaggerated into judging her personality.  Find other friends.", "YTA. It sounds like she’s minding your own business and you’re upset you can get involved with it. Mind your own business and leave her alone.", "I’m struggling to see why you think this is something wrong with her. YTA. Let her live her dang life.", "Speaking multiple languages is a huge flex and you sound jealous. YTA", "YTA. Who the fuck says that you need a personality. Sounds like you are more jealous of her ability to learn languages than anything", "YTA\n\nShe doesn’t “make it her whole personality,” she just has friends and interests beyond your limited scope. You sound insanely jealous and more than a little xenophobic. Maybe you should try learning a new language yourself (and expanding your interests as well).", "YTA: Get your own personality instead of being mad you can’t glom onto everything she does", "YTA\n\nDorit from Real Housewives of Beverly Hills made it her personality and she’s cashing in thousands per episode. \n\nJokes aside, if you want to bond ask her to turn the English subtitles on when she’s watching something. (Hello, how do you think we all watched Squid Games, wasn’t the awful English dub.) And it is possible to enjoy music in another language without speaking that language. Selena is one of my favorite artists and I’m nowhere near fluent in Spanish. Look up the meaning of the lyrics and the emotion in the vocals will translate. \n\nShe’s not boring because *you* don’t understand the language she’s choosing to consume media in. However you may be uncultured because you refuse to open your mind just a teeny bit and put some genuine effort into getting to know her likes and dislikes. You’re choosing not to because you’re assuming just because it’s not spoken in English you have no way of understanding it. Your dismissiveness and lack of effort make you an AH.", "She's a linguist. She speaks three languages, soon to be four, and all you seem to speak is judgy asshole masquerading as English.\n\nYTA", "YTA. She isn't making it her personality she is just using the languages and learning a new one is something that interests her. She's not rubbing it in your face or even being rude about it she's just using the skills she has.", "This is really familiar", "YTA get over yourself", "YTA - If you can’t understand most of what she says or listens to, how on earth do you think you can accurately assess her personality?", "YTA.  Clearly you are jealous.  Hopefully that's not your whole personality.", "YTA, why do you hate on someone who has something they love in their life? Sounds like you want to interact in her life more than you want to live your own.", "Let me guess…you’re American?", "YTA\n\nYou are the one trying to force yourself onto your roommate and HER friends. You are not entitled to her time or conversations or friendship. \n\nAnd you definitely does not have the right to police her interest and personality. \n\nBut hey, perhaps the next roommate will be more of a doormate when Katie reports you to the dorm for creating a hostile enviroment.", "YTA, and I'm sorry YOU don't have any outside interests besides crapping all over your roommate.\nGet a hobby or something.", "The boring one here is you. So petty and envious. Maybe *you* should start learning, might help. **YTA**", "YTA, and a very jealous AH at that lol. yikes.", "YTA for definitely not \"telling the truth\". Nothing in your thought process that you have explained here is the \" truth\". You are just wrong man. Being  uncomfortable with the mere existence of other languages in your surroundings isn't a personality either and you need a new one.", "YTA. She's your college roommate, not your instafriend. You'd like to bond with her, but she doesn't seem to be interested and had other things to do. She didn't pick living with you and now she has you judging her for her interests/abilities and how she manages her offtime? She's watching a movie and you call her pretentious because she's doing it in a language you don't understand. Too bad for you?\n\nYou're eavesdropping on conversations not meant for you and getting mad you can't do it properly because of a language barrier. She's talking to her friends. You are not her friend. You are her assigned roommate. And I think it's a little obvious why you don't have anyone else to talk to and want to latch onto her. Be friendly, but don't expect to be friends. You certainly won't be now that you called her names for knowing things you don't. Good job. Hope the rest of the year is fun.", "What is wrong with you? You have a roommate who enjoys speaking multiple languages. You don't, so you can't engage in the same types of activities she does. So what? Why does this make her boring? What make you think she needs to develop a personality? So she acts more like you do? \n\nDo you want your roommate to morph into an insecure, entitled child? \n\nYTA", "YTA she enjoys learning different languages. She could be telling the most interesting story in the world but you would be bored because you don't understand what shes saying. That doesn't make her boring its makes her multilingual and you someone who only learned english. Her passion isn't your passion that's not a flaw in her but you talking down to her because you stopped learning and she didn't is a personality flaw of yours.", "YTA. Hobbies make up quite some of our personality. You’re just angry you’re not involved in her life. Maybe she doesn’t want you to be?\nWith your *personality* that would be understandable.", "INFO: If learning a language “isn’t a personality,” what is? What do you spend your time doing? Is making stupid complaints on Reddit YOUR personality? Can you explain your reasoning as to why learning languages is faking a personality? It sounds like you’re angry that you can’t listen into her conversations. Have you tried like, asking her if she wants to watch Community or Law and Order or whatever English show you like? Or do you just see her watching a foreign show and get angry? Why would that make you angry?", "YTA\n\nShe's interested in languages. It's not her personality, it's what she likes. You could attempt to learn one of hte languages she knows. Or learn Portuguese with her. She doesn't owe it to you to just... bend to whatever you like. She's perfectly happy with her life and her friends as it is. She doesn't owe changing herself so you can \"bond\" in the way you want.\n\nYou want to be friends. You have to be like her/be friendly/have something relatable YOURSELF.", "You know that in some countries it's normal to speak more than one language?\nShe gets to watch more films, because she understands them, she can listen to more songs (besides, you don't need to understand songs to listen to them), she talks to people in other languages (maybe their native languages) because SHE CAN\nYou are just jealous and nosy... If you are so insecure, learn a new language yourself\nYTA", "YTA jealousy is not a good look on anybody. You need to live with this girl stop being an ass and apologize to her and tell her you felt left out because everything she seems to do is in another language and hope that she’ll do some stuff in English with you to bond.", "YTA\nBeing able to speak 3 languages and use movies and songs to get better is amazing not boring.\nShe is working on her skills.\nAnd believe me peaple wouldn't go as far as learning 3 languages just to fake a personality. \nAnd you are so rude to call her boring and fake. You said you wanna bond with her but why would you want that if you feel she is boring and fake?", "YTA. Let me guess, you only speak English?\n\nI'm Hungarian, English is my second language and since I'm moving to the Netherlands soon, I started learning Dutch.\n\nWhen I look up anything on the Internet be it articles, videos or anything really, I almost always do so in English, not because I'd want to flex on my peers who don't speak as well as I do but because it's just easier. I often chat with my also Hungarian partner in English because sometimes I feel like I can express myself better that way. No one has ever even dared to tell me that I'm faking my personality by speaking a language that not everyone understands around me because (shocker) I'm not!\n\nAlso knowing a language is a skill that needs to be maintained and many people do have a genuine interest in learning languages. \n\nAlso it's funny how I only hear such complaints from people whose native language is English and can't speak any other language.\n\nSokkal gazdagabb lehet az ember, ha egynél több nyelven tud beszélni! :)", "I can only speak English but I can still enjoy songs in other languages, watch movies with subtitles and not be a dick. YTA", "YTA. Sounds like you're jealous", "YTA You don't have much of a life of your own if you are fighting so hard to be included in hers. Sounds like she has friends and interests that don't include you, and you're jealous.\n\nCan't you make some friends of your own, is there some reason you want to be a part of her life this much? It sounds like she has a full life and doesn't need you to be a part of it. \n\nTake a hint. She doesn't want to bond with you, she doesn't want you to join in on her conversations with her friends. If they wanted you in the conversation, they would include you and speak a language you understand.\n\nIt sounds like you are an outsider looking in. Insulting her will not make you more likable.", "Jesus tap dancing Christ, not this shit again. \n\nHow many fake stories about obviously jealous monoglots are going to crop up on here? Is it a fad of some sort? “Omg my roommate/coworker/classmate/purple dildo model speaks multiple languages, isn’t she just the worst??”\n\nFfs get a better hobby.", "YTA - Stop making her college experience about you. It sounds like you didn’t pick your roommate and you can’t force her to conform to you. My freshman year roommate was Ethiopian, very different, we said hi, bye and slept in the same room, other than that we had our own friends and kept it cordial.", "YTA. You sound intimidated by her awesome linguistic skills. She sounds super well rounded watching different movies, hanging with friends, reading and learning new things and you sound incredibly jealous.", "YTA\n\nShe isn’t making it her whole personality, it sounds like she’s just existing enjoying multiple languages. Maybe she just… doesn’t want to be friends with you? \n\nThe fact that you said she shouldn’t learn another language bc she has no personality makes you the AH. Maybe she just doesn’t want to talk to you, dude.", "YTA\n\nI bet when you go for holidays abroad, you expect the locals to speak your language right?", "YTA I was like that, and over the years I learned six languages pretty well.  I’ve barely had to work a day in my life as a result of that and a willingness to go out on a limb sometimes.  Life’s been great and it was a smart smart choice.  You can’t stand that she’s speaking with her friends (HER friends, don’t you have any?) in another language or that you can’t understand things SHE is listening to or watching?  \n\nI’ve learned that Katie has some personality and drive.  You sound jealous.", "YTA", "INFO: In what way are you not the AH here,? Like what's your thought process as to why you're not?", "Can we stop deeming someone having an interest or a passion as it being their “whole personality”?  It’s up there with “rent-free” in terms of stupidity.\n\nYTA.", "YTA. She learns languages and uses them to expand her horizons. Experiences media from other places, makes friends. You sound like you are jealous or have an inferiority complex. I think the only new thing your roommate needs is a new roommate.", "YTA you sound jealous that she can learn new languages fast. Maybe pick up a book and start learning yourself? It won’t hurt you, in fact knowing multiple languages can push you *far* ahead in life. She seems to know that, how do you not?", "YTA but also I can't believe the I hate x solely because they speak another language post is back! How I've missed you!", "YTA. It sounds like she has a lot of friends, so she's not boring. It sounds like you're boring since you are so upset your roommate isn't entertaining you. Find an activity to keep yourself busy and you won't have time to stick your nose into other people's lives.", "Your parents raised an entitled and controlling brat. That would be you.\n\nYou are not entitled to tell other people what they have to do or what they need to do or how they should be.  You also are not entitled to decide what the \"truth\" is and 'splain it to everyone else. That kind of behavior is not honest or true. It's just plain rude.\n\nMind your own business and stop trying to gatekeep other people. I'm only doing it to you because you came here and asked me to.\n\nDo better. YTA.", "Yta room mate is literally out there just living life and you think they should stop and cater to you?", "Of course YTA!", "Erm, YTA.\n\nHow is it her whole personality that she watches or listens to things in the languages she can speak? Especially if you live in an area where there aren't a ton of speakers of a language, media is the best and easiest way to keep up your fluency in it. If you don't use it, you lose it!\n\nYou sound jealous and judgmental. If you truly want to \"bond\" with her over shared music, it being a different language wouldn't stop that. But you can always ask for music in the language(s) you do speak, and say you'd like to be able to understand it. There are ways to be empathetic about this sort of thing. Telling her she's faking a personality because she loves languages? Not it.", "YTA jealousy is not a good look on anybody. You need to live with this girl stop being an ass and apologize to her and tell her you felt left out because everything she seems to do is in another language and hope that she’ll do some stuff in English with you to bond.", "Every language you speak is a new person you become \n\nYTA", "YTA\n\nI don't see anything that suggests she's making the language her whole personality. She's just enjoying media in multiple languages.", "YTA. Also, I've literally never seen anyone say, \"Am I TA for telling the truth?!\" who *wasn't* TA.", "YTA quit trying to hold her back due to your bitterness and jealousy. You are a lousy friend and she deserves better", "Yta, no where there she makes it her personality you just sound insecure that she speaks 3 languages also you can 100% listen to music you don’t understand", "Yta, and it seems you’re just mad cause you’re too dumb to learn another language. Jealousy is ugly.", "The last sentence killed me - \"AITA for telling the truth?\".\nWhat truth? Those are your projections.\nQuestion prior to that - you are AH.\n\nYou are demonstrating your insecurities towards your roomate. And  your attempts at bonding are clearly lacking. \n\nYou want to bond with someone? Talk or try to participate in their hobbies. She watches foreign movie? \"Hey, this movie looks interesting. Could you put on subs so I could understand what it is about?\". Or offer her watch movie together in your native language. Make it a movie night while accomodating to both of your needs - one movie to your preference, another - to hers. Music? If lyrics are that meaningful to you - ask her nicely if she could translate it since you like the tune. If lyrics doesn't matter to you - why would you even mention it? You don't have to understand lyrics in order to enjoy the song.\nEven more - praise her for knowing so many languages and ask her if she could help you a bit to learn new one for you.\n\nDo not demean others but try to learn something that makes you better. YTA", "This is at least the third AITA I've seen (if not more) with a poster being upset and offended because their friend/roommate/co-worker has the audacity to speak more than one language, so either there is some creative writing happening, or a lot of people get weirdly threatened by multi-lingual people. OP, what exactly is the problem?  If you are feeling \"left out,\" telling your roommate that she is fake and boring is not the way to handle that.  Your roommate enjoys learning languages and engaging with other cultures.  Her friends obviously do, too.  It's not a fake personality, it's your roommate pursuing her own interests.  Part of growing up is understand that other people will have their own interests and that's fine.  If you want to be friends with your roommate, maybe try suggesting activities or things to watch together, instead of just getting angry that she's doing her own thing.  Also, consider that you can listen to her music without understanding the lyrics, or watch shows/movies with her if she is willing or able to put on subtitles.  Or, just accept that you won't necessarily be best buddies because you have different interests.  You don't have to be friends with your roommate, you just have to get along well enough to share a room.  \n\nAlso, PLEASE drop that \"telling the truth\" nonsense.  You are not telling the truth, you are giving your own very subjective and biased opinion.  You having a strong opinion about something doesn't make you right. \n\nAnyway, YTA.", "I’m gonna go ahead and assume the books you read, the friends you have, the music you listen to are all in your language. YTA. She’s not making it her whole personality. She’s just continuing to use the knowledge she has, if you don’t use languages the skill goes away. She likes languages. You sound a little bitter and jealous. Branch out and make your own friends. Calm down and stop being rude to your roommate, y’all have to live together for awhile", "YTA. 60% of the populations speaks two or more languages. Get over yourself", "Yes, YTA. You're absolutely TA. Jealousy isn't a good look on anyone", "OP wants to make america great again", "Why aren't you taking this opportunity to learn Spanish and German?\n\nFFS - that's an amazing resource you have there and it's, like, free!\n\nI'm sure she'd be thrilled to help you out with it.\n\nAmericans, by and large, are functionally illiterate in that they usually speak only one language (and that one, very poorly).\n\nGerman, by the way, is very easy for Americans to pick up, especially conversational German (High German is a little harder, but it can be learned once you get the pattern of it).\n\nSpanish is very useful as a large portion of the population (majority in some areas) speak Spanish (although different versions of it - I can struggle through with Mexican or PR Spanish, but Cuban Spanish is beyond me - too much idiom and it's generally spoken WAY too fast for me).\n\nYTA", "YTA. Insecure person who is jealous of his smart roomate and tried to bring her down to his level. \n\nHe could have told her of that he did not feel included. He could have tried to learn her language with her to have something common.\n\nBut nopes, he is going to demean her.", "You sound a bit jealous to me. Like you feel left out because your roommate can engage with people and media you don’t understand. Instead of building yourself up by learning another language, perhaps, you’d rather tear her down. In short, you’re just another hater.", "YTA this is very odd behavior but also you can just listen to music in another language or watch stuff with english subtitles if you would actually like to bond with her?", "Geesh, YTA.", "YTA", "YTA - you sound jealous of her", "YTA and seriously lame", "YTA- For obvious reasons that everyone stated. She watcheds the movies, listens to music, and talks in these different languages so that she uses it and doesn’t lose it. And because she likes to. Honestly, you have someone living with you that could teach you another language and help you to be bilingual, if she was willing to. That’s pretty cool. I’m from America and only speak English and I wish I would have put energy in to be bilingual. It’s cool as hell to be able to speak other languages. I suggest instead of judging, you start to learn and work on becoming more diverse yourself. Expand your mind and try to see things from her point of view.", "YTA, and a jealous one at that. If you want to be more involved in her conversations, tv or music, learn another language yourself, even asking her for help in learning another language would have been a  good way to bond. I imagine that option is probably gone now though.", "YTA- just because someone speaks/ learns other languages doesn’t mean it’s their whoooooole personality. You sound jealous that she can learn multiple languages", "YTA.  Have you never heard of a polyglot? AND YOU THINK SHE'S BORING? \n\nMassive \\*you\\* are the boring one... Maybe you should try and learn a new language. It might broaden your horizons.", "YTA, she’s cultured and you’re ignorant. Case closed", "YTA: Monolinguals are the worse! You could watch, but don't want to. You could listen but choose to be anti any music you grew up listening to.  Multilingual people are extraordinarily intelligent and our employment opportunities are much better and usually better compensated. Your personality ( and world view) needs to be expanded. You sound extremely narrow minded.", "YTA\n\nAs someone that speaks and studies a bunch of languages, you have no idea how ignorant this is. Not only it is hard to learn languages, but also to pick up their culture related interests/hobbies is admirable and should be supported. This is just pure jealousy.", "Why are there so many folks in this sub who are intimidated by smart, interesting, multilingual people? \n\nOP, Katie has friends and hobbies and interests. Her life sounds rich and vibrant. You, on the other hand sound like you have nothing better to do but to try to insinuate yourself into your roommates life, and get pissy when you’re not at the same level she is. \n\nShe’s your roommate, not your BFF. Go out and get yourself some friends of your own, and have them over. Watch your own shows. Listen to your own music. Learn how to cook amazing food, take dancing lessons, go volunteer at an animal shelter. Hell, maybe go learn a language! Lift yourself up, instead of bringing others down. \n\nYou’re not “telling the truth.” You’re jealous, and it’s really not a good look. YTA.", "She has friends, seems smart, listens to a variety of music from different parts of the world and wants to keep learning this fantastic stuff yet you claim she is boring?\n\nNot every 19 year old needs to party and hang out at a mall to be \"interesting\"\n\nMaybe your the boring one for not being as self exposed as the roomie is to things other then the basics. \n\nTry learning from her. Try asking her to teach you the basics of a language and you can bond over that.", "So if someone likes country music, reading Harry Potter, and watching Game of Thrones, is “speaking English” their entire personality?\n\nThe level of ignorance here is astounding. Each one of these languages has unique music, literature, television, etc. that she could like and you boil it down to “speaking Spanish” or “speaking German”.  YTA.", "INFO: have you ever considered learning another language yourself?", "INFO: Have you asked her to be more included with friends or to watch a show with you in English or with subtitles?", "YTA - I think you'd have a reasonable complaint if you're part of a conversation and she's speaking a language you don't understand, but you decided to be judgmental and insulting about it instead.\n\nImmersion is very common way of learning new languages and staying sharp on ones you already know. \n\nThere's nothing more boring than a person who's an asshole to someone just because they have different interests from yourself.", "YTA\nSpeaking multiple languages and enjoying global culture is just being an open minded human.\n\nI’m sorry she’s more advanced than you but you shouldn’t be bitter about it.", "What?\n\nSo you think she has no personality because she utilizes her language skills?\n\nDude, develop some common sense and realize this is a you problem. Your roomie is just living her life.\n\nYTA.", "Oh sweetie… YTA. Keep this kind of “truth telling” up, and you’ll be a really lonely A H to boot.", "YTA\nWhat is wrong with you? Why are you so personally offended by this? She is clearly passionate about learning languages. Do you understand how hard that is? You seem to be not only rude and narcissistic, but jealous and insecure as well.", "YTA  \n\nYou are an enormous AH    \n\nFirst, you are not friends - you're roommates.  \n\nSecond, it's not your business what her interests are.   You are not included in any of her conversations because you are not her friend.\n\nThird, why are you so invested in what she enjoys doing?   Why is this such a big deal for you?   Don't you have other things to do besides think about your roommate?    \n\nShe's not boring - you're boring.   You can't find anything else to do besides being critical of someone who has an interest in languages.\n\nLeave her alone.    \n\n>I might be an asshole because I told my roommate she needs a new personality because speaking a language ain’t one.  \n\nThis sentence is *so* telling.    What an idiot.", "Isn't this a repost/copy? I'm almost certain I've already read this AITA", "YTA. *sniffs air* do you smell that, OP??? Smells like jealousy and it doesn’t smell nice.", "Bitching about people you’re jealous of is also not a personality. YTA", "I'm gonna go with YTA for your actions. She does not push it in your face, she is just genuinely interested in it. What you said was very very rude. Languages are a hobby and skill just like drawing or music and she should be able to express it without judgement or insults\n\nBut I understand the feeling of being excluded if all people around you speak a different language. You need to communicate that! Ask her to translate or for her just to be more thoughtful and including you in the talks.", "I can easily see anyone feeling left out in your shoes, it's just better to notice if you don't feel included so you can try to get yourself included and not lash out. You could have done things like asking to learn new words or joking around saying hey Katie don't you speak english too? Because then I could join this conversation!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f19) am in my first year of college, living with a roommate, Katie (f19). Katie speaks three languages (English, German and Spanish) and she makes it her whole personality. \n\nWhenever I ask what she’s watching, she’s watching something in another language. So obviously I can’t watch it. She’s always listening to music on her headphones and when I tried to bond and listen to what’s she’s listening, it’s in another language again and I couldn’t stand it. \n\nHer friends all speak one of the languages she does and whenever I hear them, I can’t join the conversation because they mixing everything so I’m left out of their convo.\n\nThe other day, I saw she had a new book on her desk, Portuguese coursebook. I asked her about this and she said she’s taking private Portuguese classes starting February.\n\nI told her she has to let it go, that she needs to develop her personality because speaking a language isn’t a personality trait and she’s just boring.\n\nShe got really annoyed with me and told me I’m an asshole and to stop eavesdropping on her convos.\n\nI told her she’s boring and has to fake her personality.\n\nNow, she’s not speaking to me.\n\nMy friends are split, some agree with me and some agree with her.\n\nWho’s the asshole here? AITA for telling the truth?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA  \nAnd honestly, it is sad. Because if you are willing to listen and learn and take in media in other languages (through subtitles and conversation as well as just being present) literally the whole world opens up. So many wonderful new experiences that you closed yourself off to.", "YTA, not sure it’s your roommate that’s lacking a personality there.", "YTA\n\nLanguages are her hobby. You are just grumpy because you don't like her hobby.\n\n>Whenever I ask what she’s watching, she’s watching something in another language. So obviously I can’t watch it.\n\nHave you considered subtitles?\n\n> She’s always listening to music on her headphones and when I tried to bond and listen to what’s she’s listening, it’s in another language again and I couldn’t stand it.\n\nRubbish. I listen to loads of music in other languages that I don't understand. You don't need to know the language to listen to music.\n\n>I can’t join the conversation because they mixing everything so I’m left out of their convo  \n>  \n> I’m an asshole and to stop eavesdropping on her convos.\n\nYou weren't actually *in* the conversations? You are just upset because she is having a conversation with *other* people? Yeah YTA.\n\n>I told her she has to let it go, that she needs to develop her personality because speaking a language isn’t a personality trait and she’s just boring....  \nI told her she’s boring and has to fake her personality.\n\nMassive AH\n\n>Now, she’s not speaking to me.\n\nGood for her.", "YTA that’s her interest. Don’t be roommates with her next year.", "This can lead to a very good job as an interpreter. Ask her if you might join her", "YTA sorry you don’t have a marketable skill like your soon to be ex roommate successful translator for a private firm lmao", "YTA. A bitter jealous AH.", "How can your friends be split on this? YTA big time.", "YTA - so just admit that you are jealous that you can’t be included in her circle since that’s all I can see. \n\nThe girl likes to learn new languages and appreciates art in those languages (music, tv and movies). Just because you haven’t cultivated this, you bash her and try to bring her down like a kindergartener.", "YTA Why can't she learn new language? Why do you think she doesn't have personality just because she enjoys learning new things? Not only it's extremely good for her to have a hobby but it's going to come in handy when she search for a job in future. \n\nAnd if you want to spend time with her or with her friends you can just ask, and don't you have a subtitles where you from? I mean stupid reason not to watch something.", "Once heard a person state, \"a person who speaks one language is only one person.\"", "You have FOMO, and YTA. It’s not her job to make you feel included in the content she chooses to consume or the conversations and friendships she personally holds. Your lack of knowledge is not her problem.", "YTA. There is a theory that the language you speak determines the way you look at the world. She is working to expand her world and world views. Stop hating. If your feelings are hurt that you can’t join in, put some effort into learning another language.", "YTA. Being an asshole is not a good personality. Also being jealous and ignorant are not good personality traits. Sound like her personality is just fine and you’re the one that is lacking. Work on yourself.", "I hope she moves out lmao YTA! \n\nLeave her alone and that's dope she speaks many languages and honestly a goal in life for me", "YTA She is busy living her life and because you cannot get a foot in the door with them you are determined to tear them down. They are absolutely fine, but you are insecure and jealous. Get your own life.", "YTA\n\nYou sound horribly jealous of your roommate.", "Yta to begin with if you dont use a language you lose it. Just because your roommates doesnt mean you are besties. Stop worrying about what she is doing and find your own life and friends with similar interests or studies. Time to adult.", "YTA. She’s only boring to YOU. It won’t kill you to learn another language & you’ve got a roommate who knows 3 & working on a 4th! Why not ask her to help you learn one of the languages she knows or learn Portuguese along with her?", "YTA. Your roommate does not exist for your entertainment. She is a whole person. Maybe she just doesn’t like you? Bet you never thought of that. But considering the way you talk about her it’s the most logical conclusion to me…", "YTA and telling someone they're boring and need a new personality is a strange way to try to bond with them.", "YTA. You feel inferior to a woman who has a wide group of international friends, and lots of interests around her friends and the many languages they speak. Her language skills are not her 'whole personality'. She isn't boring. You just aren't as erudite as she is, and you can't find a point of connection, because you haven't developed your own personality as yet. \n\nYou're young. You have a lot of growing to do. Sometimes when you feel jealous of someone, it comes out like this. Recognise it, see it for what it is, and start to develop interests and friendships yourself. Once you are happier with your lot, you won't need to be spiteful to those who are out there already, living their best lives.", "YTA\n\nYou have no right to know what your roommate is saying, no right to understand what she's watching, and no right to understand the music she prefers.\n\nNowhere has she claimed that speaking languages is her personality - but she likes learning languages. That's OK - people are allowed to like things. You're just upset that she is what you describe as \"boring\".\n\nYou'd probably call me very boring, because I suspect you share none of my interests. I expect I'd find you very boring, because the impression I have from your post is that the things that you care about are all things I find pointless.\n\nThat's OK - you don't have to be best friends with your roommate, and you don't have to think that she's an interesting person. You just have to be civil, civilized roommates and coexist in a constructive and polite fashion.\n\nAnd you're being a massive asshole, so you fail here.\n\n(I just counted. My standard car journey playlist has songs in six different languages. I'm not fluent in most of those languages. That doesn't matter - I can still enjoy the song...)", "Sounds like if your roommate (who you share a common language with) wanted to be friends with you she’d make the effort to find things you have in common and chat to you in English about them. I think the issue is she isn’t interested in being your friend and so you’re blaming her interest in other languages and cultures. Find new friends and await the point where you no longer have to room with her. But don’t say her personality is boring just because she has chosen not to fully share it with you.", "YTA. You also sound jealous and ridiculous. Her speaking a language is not about her personality. She is actually developing skills that are marketable and can earn her money. She is expanding her horizons. You, on the other hand, are rather narrow minded. You need to grow up and educate yourself rather than remain ignorant to the world at large.", "YTA. Just because you don't have the capability to learn different languages, doesn't mean you're entitled to stop others from doing so. \n\nYeah, it sucks that you're feeling excluded, but maybe you should find friends that speak your language and share similar interests", "YTA; you have a jealous personality", "The only truth I see is jealousy and meanness. \n\nMaybe pick up a course book yourself and join the convo.\n\nYTA", "YTA. She speaks multiple languages, and how is this any of your business? And by the way, her personality is not “speaking multiple languages.” You are just resentful of her having skills that you do not.", "YTA if she wanted you to understand her she'd speak in a language you understand. Get a personality.", "Being able to speak more than one language is amazing not boring, seems to me like you’re jealous and you need to get over the fact that you only know one language and no one has to accommodate their lives/activities because you choose to be monolingual. Maybe learn a new language,is a lot more beneficial than you think.", "YTA. It sounds like she’s enjoying her life. The languages aren’t her personality. They’re her interest. If she’s interested in/passionate about languages, that’s great. If she has friends she can speak to in her alternate languages, good for her. You can enjoy music if you don’t understand the lyrics, but it sounds like she wears headphones. That’s considerate of her, by not imposing her music on you. What does it matter if she wants to watch movies in another language?\n\nIt sounds like the problem is that you’re feeling left out and frustrated. You’d like to build a friendship with your roommate, and her normal activities aren’t accessible to you. You haven’t been able to bond with her in that way.\n\nI suggest starting by apologizing to her for your comments. They were hurtful to her. \n\nThen, when you’re both in a calm frame of mind, talk to her about how you feel. That’s what the real problem is. Maybe she’ll appreciate that you want to build a friendship with her. Maybe you could watch foreign language movies with English subtitles. Maybe you could invite her to try something you’re interested in. Maybe you could come up with an activity you do together.\n\nAlso, keep in mind that not everything she does needs to involve you. If you want a friendship with her, cool, but she can have her own social life that doesn’t include you. You aren’t joined at the hip. You should also have your own social circle.\n\nI will say it’s rude to converse in a language that not everyone there can understand. Since language is her interest, and she has friends she enjoys speaking to in foreign languages, maybe they could start in English, chat with you for a few minutes, then they can settle in and do their own thing, speaking whatever language they want, and you would do your something else. You might technically be present and unable to understand the conversation, but at that point you’re not really involved. You’re sharing space because of your living arrangements, but what they’re doing isn’t meant to involve you. If you have a friend over, it doesn’t have to involve her.", "YTA.\n\nKatie is allowed to speak a language other than English. \n\nKatie is allowed to have friends that speak a language other than English. \n\nKatie is allowed to read books written in a language other than English. \n\nKatie is allowed to learn another language other than English. \n\nDo you see the pattern. \n\nKatie is your roommate - not your friend. You two obviously do not have things in common. Be civil until the end of the year and hopefully you get a roommate next year that you fit better with. \n\nUntil then, leave the poor girl alone.", "YTA, sounds entirely like you're jealous your roommate is more educated and motivated than you, and also that you're demanding someone be your friend just because you got bunked together. It's not great that she doesn't make any effort, but she has no obligation to you, and you're wildly immature for telling someone \"they need a personality\" when all you've done is whine and complain about how you're not getting attention. She isn't the problem. You are.", "I just want you to go ahead and read all that back to yourself. Now ask yourself, “do I sound unbelievably jealous and shallow?”", "YTA, and I feel sorry for you.", "YTA and insufferable.\n\nI’m a linguist and speaking several languages. Your roommate sounds awesome! You, on the other hand, not so much. \n\nI bet you’re gonna get really mad when you learn she probably DREAMS in those other languages too.", "YTA.\n\nShe likes languages and seems to come naturally for her to learn them. What languages do YOU speak ?\n\nI do agree that speaking a language is not a personality trait. That's just talking.\n\nLearning different languages give you access different people in their own languages and learning about their culture. It CAN make you a far more open person, more welcoming... a lot of things. Those are personality traits. You can access so much more info. You can do online courses that may not be available in your language. Yes, not all available knowledge is in English.\n\nI am writing this in English, language I started to learn about 30 years ago. But I could also reply in the same level of French, or Spanish, o my parent's regional language from Spain, Gallego.\n\nKnowing those languages have enabled me to build awesome relationships with amazing people who don't speak my \"default\" language. I was born and raised in a Spanish speaking country, but now live in Switzerland where... surprise, there are 3 fucking OFFICIAL languages. \n\nWhile I don't speak German, with my Spanish and some friends I'd be able to make it through in Italian. I live in the French area And, which i was lucky to study at school. And there's a ton of Portuguese people here, so whenever I come across some portuguese client at work who doesn't speak French yet, I just try my best in gallego and we get through to each other. It lights up their face to feel understood after struggling all day.\n\nNot sure if you're being AH or just closed-minded and ignorant. Go learn.... something.", "YTA.\n\nTell me you only speak English without telling me.\n\nFor any other person then people speaking English as first language listening to music in another language is the norm, because that is English.\n\nWhen you speak more then one language you need practice and you see tv show is the language because it is more enjoyable and make more senses.\n\nListening to other people convo is rude, so is joining in without begin asked. Code switching is normal between bilingual/trilingual deal with it.", "YTA. Speaking the truth? About what? That you feel insecure because your roommate is multilingual and you're not? That you need to be involved in everything she is because your personality trait is clinginess? Sheesh.", "YTA \n\nYour friend is a linguist and that’s a very beautiful trait.  Maybe download duolingo if you want to fit in with the conversation.", "INFO: What is Katie's major?\n\nWhether it's one (or more) of those languages, or even linguistics, or not, you're still TA.\n\nShe's not made learning languages her \"personality.\" It's literally an area of study, and it looks like she's using foreign media to help her learn them!", "YTA. It sounds like you’re jealous and resentful because you can’t participate in her activities.\n\nEDIT to say that it’s very ignorant of you to say you can’t watch something or listen to music because it’s not in a language you understand, toggle those subtitles on and look the lyrics up on Google.", "YTA. literally all these instances are her simply minding her business. it’s not like she’s shoving it in your face or anything like that. if you’re jealous just say that lmao.", "just say ur to stupid to a learn a second language. YTA", "YTA, if you really were interested in a friendship you would ask about her interest in other languages and even possibly try to learn one. \n\nInstead you choose to be AH. Not a good look to be honest.", "You two share a room and that’s where it ends. \n\nYTA", "Dang!  YTA", "Yta. You sound extremely small minded. You also sound like you need a hobby or something.", "YTA. Roommates don’t have to be friends. She’s not into stuff you are and vice versa. That’s ok. Let her do her thing and find some people who aren’t annoying linguists to hang out with.", "YTA. It's fine to only know how to speak one language, but don't go around telling other people to speak your language if you can't understand them.", "I don’t know if you’re necessarily “the asshole”, but dammit, she’s gonna open doors in the business world for herself. German and Portuguese are languages my wife is always looking for in her job. \n\nI can’t advise you either way on this except to say take advantage of her ability to learn these and try to sponge off of her. Include yourself as much as you can, ask questions, try to learn the languages. Recruiters are always looking for people that speak multiple languages. \n\nGood luck with your roommate. I hope you’re able to repair that relationship.", "YTA and you sound boring as fuck, ole \"I can't understand it >:(\"", "YTA and a jealous one at that.", "what truth? that she does what she likes (learning languages and using them) ?\n\nYTA. if you want to bond or interact, learn the languages instead of pulling this jealous, nasty behavior.", "YTA. If you’re feeling left out and want to be included, go about it in a kinder way.", "Did you really type \"my roommate listens to music on her earphones and I want her to stop\" and think you are not the a?\nYTA\nDu bist das A\nEres el O del C", "Awww C'est vraiment un gros problem pour tois? C'est correct, tu es un gros garcon.", "Language troll is back I see. YTA for the bait", "YTA just cuz you're roommates doesn't make anything about her any of your business at all. Stop eavesdropping.", "YTA for not giving up on this language troll bit. I'm tired of seeing the same story over and over again on this sub.", "Ahaha! You sound like such an awful loser. Just a boring person nobody wants to be around. Your roommate on the other hand sounds so interesting! Hope she gets away from you.", "YTA. Why are you so salty about someone studying languages?!\n\nWhy do you want to watch the same things as her all the time? Why do you want to butt in on her convos with her friends? Why does she have to entertain you? \n\nMaybe you’re the one that’s boring! Find something else to do with your time that isn’t bugging your roommate, and then you won’t mind!", "YTA and being a dick to your roommate in college isn't a personality either. \n\nYou're jealous that she can talk to people and you can't contribute because you don't speak the language.  Deal with that.", "YTA here. How would you know about her personality when you can't even communicate with her? She has friends who can communicate with her, and that seems normal.   Maybe you are not just an asshole but ignorant as well.", "NTA- she was being rude by replying to u in a language that you can’t understand and she most likely know that. idk why everyone’s calling u the asshole but dw no one on reddit is ever actually reasonable", "You're not an arse hole and nor is she. She's learning things that she enjoys but subsequently you feel left out because you can't join in with the socialising because of language barriers. You should apologise as it wasn't nice what you said but explain how you're feeling, isolated and left out and you would like to engage more with her.", "[removed]", "savage", "Neither is xenophobia", ">you could have asked her to turn on the subtitles\n\nI don't speak French, and very little Spanish, but I watch a lot of French and Spanish shows because they're amazing! Totally worth reading through.", "I'm so curious about what OP considers to be her own titillating personality traits. What does she do that apparently makes her so much more appealing than her roommate?", "YES!", "j e a l o u s y", "I feel similarly. I have a south Asian background, and it’s completely normal to watch shows in a different language, speak in different languages with family/friends etc. I think this could have been a moment for OP to explore out of her comfort zone rather than to put her roommate down for the interests she has. I also think OP just isn’t being mature enough to realize that her roommates interests have nothing to do with her feeling left out. Everyone is interested in different things. YTA", "Stopped reading when she said she obviously can't watch something in a foreign language. I guess she couldn't ask for subtitles like a normal person??? Or even strike up a conversation and try to learn something both about the roommate and the language of the flick? Maybe Netflix has it wrong and we don't need to watch shows from other countries.\n\nYTA.", "It’s been a while!", "My first thought was “Not this again” 🙄", "Yup", "There are a lot of people who only speak one language and trying to put down everyone around them who speak additional ones…\n\nOP YTA! If you really want bonding, why not join her language class?! Oh wait, that would require effort on your part.", "It was a bartender who would speak to customers in their native language and would sometimes speak in a foreign language to her coworker by accident. I think she spoke like 6 or 7 languages and OP was super bitter over it.", "This!!!", "🏅🏅🏅🏅🏅🏅🏅🏅🏅", "American here. One language. I agree. Use the opportunity!", "It's her roommate. :/", "She never did that in the post-", ">she was being rude by replying to u in a language that you can’t understand and she most likely know that.\n\nShe wasn't replying to the OP. She was just having a conversation with her friend. The OP was not a part of that conversation.\n\nI would agree with you if the roommate was hanging out with the OP and started speaking a different language, but expecting her to go english only while in the dorm room is ridiculous.", "I’ve reread this 3 times but I can’t find the part where she replied to OP in a language dhr can’t understand? Did I miss it, or can you point it out?\n\nBecause all I read is that the friend is enjoying her own content and her own friends, and OP seems to want to make it about her.", "Speaking about language do you read in the language you are writing? Because this is not in post.", "She literally said her roommate is faking her personality and called her boring because she enjoys speaking and learning multiple languages. She absolutely is the asshole", "Facts. While reading this all I thought was 'OP is really jealous of this person'", "Yep  that part was  arse-holey, I was being gentle  🙈", "YTA\n\nYou've been on here alot trying to make it out that speaking/knowing different languages is a bad thing, but each time you've been told your the AH and that you are coming across as completely jealous.\n\nAre you not bored of being told the same thing all the time\n\n\n>I told her she’s boring and has to fake her personality.\n\n>Now, she’s not speaking to me\n\nOh and come on, saying this, it's no wonder she doesnt want to speak to you anymore.\n\n\nIt's time to grow up and get over yourself", "YTA\n\nI don't think it's  the languages that bother you. It's the fact that Katie doesn't want to spend time with you. And I get that. One dreams of bonding with a college roommate and becoming best friends forever. It just doesn't always happen that way.\n\nAccept that she and you, for whatever reason, aren't going to be besties. Be cordial, and go your own way. And next year, get a new roommate. \n\nFor what it's worth, my daughter never bonded with her first roomie, either, and she was disappointed. But they were friendly, and she had better luck with later roomies.", "Yta\nYou are being incredibly rude to her for no reason other than you're jealous she's not including you in her life. Why don't you try to expand your own knowledge and learn a different language too, maybe then you will actually have something in common.", "Yes YTA. This was only said with the intent to hurt her feelings and it doesn’t help her, nor does it help you.", "YTA.\n\nWhen I read the title I figured she was constantly shoving her language skills in your face, or at least bringing it up constantly when it didn't make sense.\n\nBut the way you describe it, just sounds like she's living normally? Talking to friends? Watching shows and listening to music? \n\nYTA for shitting on something she enjoys.", "YTA.  so you aren't wrong that speaking languages doesn't make up a personality, but the way you described your jealousy and how you talk to her telling her what to do is a bit off to me.  You being annoyed that she listens to different music is a bit crazy.  I listen to music I cant understand all the time.  I love bands like BabyMetal and have no fucking clue what they are saying.  its about the music and melody.  If you had approached her like a mature adult you would have probably said something like \"hey, i have a hard time making friends and I was wondering if we could do more things together and watch an english movie this friday...\" that would have gone over alot better imo.", "YTA. Sounds like she has a great personality, you just don’t know it because you can’t understand what she says WHEN SHES NOT TALKING TO YOU. You’re obviously jealous and it’s not a good look.", "YTA and the one with a problem here.\n\n>Whenever I ask what she’s watching, she’s watching something in another language. So obviously I can’t watch it. She’s always listening to music on her headphones and when I tried to bond and listen to what’s she’s listening, it’s in another language again and I couldn’t stand it.\n\nSubtitles exist.  I've watched many a movie with subtitles.\n\nIt isn't her problem that you don't like music if it isn't \"in your language.\"\n\nHonestly, you sound a bit xenophobic.", "YTA / ESH - but mostly YTA  \n\n\nBeing weirdly accusatory that she has no personality because she's multilingual is a weird jab.  She obviously has friends and other interests.\n\nESH - ONLY because it seems that you had tried to put in some effort to be friendly with her.  Like, she could have offered to put subtitles on the movie she was watching so you could both watch - though she's not obligated to do this.  Though, at the same time, you could ASK her ABOUT what she's listening to regardless of it being in another language.  What kind of music is it?  German pop? Spanish rock?  \n\n\nYou don't have to know the words to enjoy it.  I adore Maneskin even though I don't know Italian.  Hell, I even love Celtic music even though I don't know Celtic!", "ESH.\n\nHer for constantly saying \"oh it's another language, you wouldn't like it\" whenever you ask about something, that is rude, she can share the name and you can look it up to see if you would like it or if there are subtitles for the shows/movies.\n\nYou for constantly needing to be included in her shows, music, and conversations, you are roommates not best friends, would it be nice if you guys were? Yes, but a roommate is not a guaranteed bestie.\n\nYou lean more into Y TA territory with your last line, she can make her languages her personality, it doesn't affect you at all, to me it doesn't sound like she does anyway, just because she listens to music or watches shows or (God forbid) have conversations in another language doesn't mean that she's made it her personality, if anything you've made it your personality to be in her business.", "YTA. Sounds like she's able to enjoy a wider range of media, and that's awesome. Did you ever ask to have English subtitles put on, if you actually wanted to watch something with her? Did you try listening to the music? You hardly need to understand the lyrics to enjoy music. There are so many great bands that aren't English centric. \n\nIf you're actively trying to hang out with her and her friends, that's the only one that feels exclusionary and not cool of your roommate, assuming they want you hanging out with them. When there are multiple languages between people hanging out, it's best to converse as much as possible in the most shared language. However, and I'm suspecting it's more like this, if they are just hanging out together and you're not really involved, they can speak whatever they are most comfortable with as it's not about you. \n\nMaybe you guys just don't vibe well together, and that's fine. Speaking multiple languages, consuming media in those languages, having friends that speak those languages, and learning yet another language are all awesome, and hardly the sign of someone \"making their language their entire personality\" or \"being boring\". \n\nUse this as an opportunity to grow up.", "YTA. She has a personality. And interests. And hobbies. And friends. You just aren't one of them, probably because you don't share interests, or hobbies, or even have shared friends. \n\nGo get some friends that you have something in common with. Join a club that you enjoy - you'll find people who share your interests.", "YTA. You're trying to shame your roommate for enjoying things you don't enjoy.  You can't control what other people like. Maybe it's time to find a new roommate who shares your interests? Or just let her enjoy what she wants. She has a personality, but you're so against her hobby/ future profession you just can't see it.", "Let me make sure I'm understanding this: A person, who you likely didn't know a year ago and was randomly assigned to live with you, has interests different than you which she is not imposing on you. And this apparently unacceptable reality is worthy of mockery and a complete lifestyle shift to accommodate your unreasonable need of being directly involved in aspects of her life she hasn't indicated she wants you involved in? \n\nYeah, YTA, big time.", "Hater.", "YTA. Xenophobia and bitter petty jealousy aren’t a personality.", "You’re a hater. Subtitles exist. Ask her to turn them on. Just because your world is small doesn’t mean everyone else’s is. I love music in Spanish, Korean and Hindi. My love of kpop is the reason i am learning Korean. College is supposed to be about expanding your horizons. You could be learning from your roommate but you’re choosing to be small minded and xenophobic af. Grow up. \n\nYTA.", "YTA. Stop trying to drag her down into the Basic crab bucket with you.", "YTA it's like you expect her to change or cater to YOUR interests. Friendship is a two-way street. Oh and just because you're roommates doesn't mean you have to be friends. You don't have to like all the same things and spend all your free time together. You DO however, need to be cordial as you are living in a shared space. \n\nDoesn't sound like your roommate asked for your opinion on her life or interests. How would you feel if the roles were reversed and she randomly pointed out how your music choices are lame, you never do anything besides eves drop and hang out in your room which makes you boring, and that being a college student isn't a personality?", "YTA. A roommate is not there to serve your needs. They are a person, a safe one, to live with. Your hatred of languages other than English is fascinating. Please go find some friends with no hobbies or interests as they would seem to suit you.", "I swear we’ve seen this same post before. YTA, you’re boring for refusing to learn any other languages or cultures, and you’re just jealous that you’re so vanilla and your roommate knows more than you. Also roommates doesn’t mean friends. She doesn’t have to be friends with you. And maybe if you weren’t so boring, she’d be more interested in being friends with you.", "YTA. Why is it so important that her personality fit your lifestyle? Not every roommate situation turns into a Besties For Life thing. Sounds like you're the one refusing to broaden your horizons. In short, don't tell your roommate what to do.", "I remember reading an AITA of a college student that was annoyed with their dormmate because they spoke other languages. Is this the same person? Doesn't matter, both are AH.\n\nIf you feel left out, say that you feel left out. Jesus. What happened to simple communication instead of insults? YTA OP", "YTA. Being vocal about not speaking a language isn’t a personality trait neither is being irritated with someone who does.", "Your final sentence is all that needs to be read to know the answer.  \nYour objective opinion (a shallow one at that) is somehow the truth???  \nYTA  \nAnd you're pathetic", "YTA. You do know that you can watch international TV and movies with subtitles", "You didn’t speak any truth. You’re obviously jealous and threatened that she’s tri-lingual while you can only speak one language. She’s not being fake. You’re just toxic.\n\nYTA for being rude because of your insecurities \nYTA for eavesdropping as well\n\nGet a life, OP", "oh what a sad person you are. Your roommate sounds rather interesting while you seem to be the jealous/judgy type. You did not speak the truth you just insulted her without any reason.\nGo out and find some hobbies.\n\nAlso subtitles are a thing and a lot of people enjoy listening to music that they can't understand", "How do you know she doesn't have a personality, if you can't understand what she is saying?\n\nINFO- what is her native language? Is English her 1st language?", "YTA. Why are you counting on your roommate to make you feel included and entertained?  Don't you have any friends of your own? ...oh, wait.", "YTA. It doesn't sound like she makes languages her personality, it sounds like she has a language talent and the interest to develop her abilities. Maybe you should give it a try?", "Its simple, YTA.", "How does OP know if roommate is boring if she only understands like 1/4 of what she says, watches, thinks?\n\nOP entirely YTA and this is the birth of xenophobia if you don't correct yourself.", "YTA. genuine question. why does it bother you? let the her do her own thing who gives a shit", "YTA. This isn’t any of your business. The fact that it annoys you isn’t enough to justify your unsolicited criticism.", "YTA. You're monolingual and you call her boring? 😂", "So let me get this straight.  She has friends, listens to music, watches TV/movies, reads books, and is learning another language.  But she's the one who somehow doesn't have a personality?\n\nOP, YTA.  You come off as very insecure, and a little jealous.  Work on that.", "[removed]", "YTA. Maybe you should learn another language.", "YTA 100% Not quite sure why you feel so entitled to tell her what she can and can't enjoy. \n\nGet over yourself and apologize. Maybe learn how to apologize in German to her.", "YTA. Just because she's interested in something you're not doesn't make her an asshole. But being jealous and bitter makes you one. This post reeked of *me, me, me*. All the things you described are just part of having an interest. She likes other languages, *of course* she's gonna explore music and books in those languages.\n\nI'm also genuinely confused on what part of her personality is fake? Does she not actually speak those languages? She does, so it's not fake. It's just an interest that you don't share.", "YTA. Language education isn't a personality, but in order for a language to really set in, the person has to immerse themselves in hearing and seeing the language every day or they lose it. I grew up with American Sign language and English, and keeping up with it is very important. Watching news with interpreters and watching them instead of relying on subtitles, etc so on. \n\nYour room mate is doing what she can to keep herself well-versed on languages that were not native languages to her. It means she has to listen and read and watch things that are in the languages she wants to keep herself fluent in. \n\nI will say that it is in poor social taste to change to a language that someone else doesn't know who is part of the same conversation or chatting circle, because it's disrespect and exclusion, and if that's what you're feeling, don't take it out on her desire to learn languages. Tell her how you feel when she switches to a language you do not know. If she doesn't want to stop doing that, then walk away from conversations when the language is changed. She'll get the point.", "YTA. Your roommate is doing things she enjoys. She’s not flaunting her (highly developed) language skills, she’s just existing. \n\nAlso, what is stopping you from enjoying media in other languages? You don’t need to know the language to enjoy a song. You can turn on the subtitles to enjoy a movie. \n\nHer friends are not required to accommodate you, as long as they’re cordial and respectful in your shared home. Go make your own friends. \n\nGerman, Spanish, and Portuguese are extremely common languages. Do you really spend your time avoiding these?", "Scientifically speaking you’re wrong. Because when you speak different languages you actually have different personality in every language you speak. It’s being studied and proven. Her enjoying the fact that she is a polyglot is no attack on you. I don’t see why you’re so angry. YTA", "YTA - you don't speak another language and you are putting her down because she does. \n\nShe doesn't need a new personality.  She needs a better roommate", "YTA. Yikes. How embarrassing for you.", "Soooooo jealous.  YTA for sure.", "YTA\n\nHow can you say she has no personality if you can't understand what she's saying?", "What all the others are saying. YTA", "YTA. \n\nHoly shite, Katie speaks three language, is learning a fourth, watches shows in different languages, listens to music from different countries (presumably), and has friends from different cultures.\n\nYou, on the other hand seem to have few interests and friends of your own, and try to leech onto Katie's. And you have the gall to call Katie 'boring'??\n\n&#x200B;\n\nAnd when did she make it her personality? She likes learning language, and enjoys entertainment from different countries/cultures. You are just mad you cannot take part in it.", "I can say YTA in 10+ languages. Nothing wrong in wanting to broaden your mind and skills. Let her learn whatever she wants to learn.", "Yta and you do realize subtitles are a thing for movies/ shows? Also I listen to German music and I don’t know the language at all", "YTA, because being mad at another person for being a polyglot is also not a personality trait.\n\nPlease use this as motivation to learn other things for yourself.", "YTA and u sound jealous as helllll lmfao. She’s an interesting person who’s actively expanding her knowledge and you’re mad you don’t have an ounce of her work ethic otherwise you wouldn’t be complaining over someone else’s choices to learn new languages", "There: she doesn't speak to you anymore. Problem solved, I guess.", "YTA. The reason she does all that is to practice and keep your brain up with the language. If it isn’t your native tongue, you could start to forget so many things. And by the way, it is really impressive that this girl can speak three languages fluently and wants to try for a fourth one.", "YTA lots of people listen to music and watch movies that are in different languages, in many cases they can’t speak said language, don’t be mad at her because she is able to follow along without subtitles. \n\nAlso you know what else isn’t a personality? Being a judgmental, nosey, jealous person. Just a heads up.\n\nGrow up, you are in college now so act like it.", "YTA.\nSpeaking only one language ( *cough*cough* English) is not a personality trait. Being mad that someone speak more than English is definitely ethnocentric and racist, especially when demanding her to stop and demeaning her for having more skills.", "YTA you’re incredibly jealous. Let it go or try to learn some languages yourself.", "YTA\n\nFor trying to force your values on someone who is becoming someone who can travel the globe and interact with peoples of different languages and different cultures.\n\nYou should be listening to the same music and watching the same TV shows because it will help you grow as a person.\n\nEmbrace this opportunity. Apologize to the roommate and try to mend things. Your life will be better for it.", "If her hobbies, and friends and taste in general don’t cater to you, that says more about you than it does about her. YTA. \n\nInstead of trying to bring someone down to your level, you missed the opportunity to rise up to hers. Maybe y’all could’ve bonded over her teaching you some cool phrases or something. It’s a pity you are petty.", "YTA. jealous much?", "YTA, sounds like you need a new personality that isn't being a jealous jerk", "YTA and none of what she’s doing is making it her personality. Like others have pointed out you just sound pathetic here.", "YTA.\n\nMy partner speaks several languages- not \"as a personality\", but because she's from a small country, and if she didn't, she'd still be there.\n\nAnd one thing has become very clear to me - languages are very much \"use it or lose it\". It's like a muscle that needs to be exercised.  So she will seek out podcasts & shows in various languages that she's otherwise lacking in exposure to.\n\nAnd I totally understand.  I passed French with an above-average grade 20 years ago, and my current level is somewhere around the first five pages of a tourist phrasebook.  I have entirely atrophied that \"muscle\", so I know she's not wrong.", "YTA. Time to branch out and not rely on your roommate as a form of entertainment. I wouldn’t be offended by the inability of your roommate to always include you. It’s common for roommates not to be the best of friends.", "You don’t have to be good friends with college roommates. Just cordial and respectful of boundaries and such. If you can’t hang with her and her group, then don’t. Get your own. But also- it seems you aren’t speaking up either. You could’ve asked the friend group if they’d speak in your language while hanging with you since you feel left out. And you can invite you roommate to watch a show in your language with you. Don’t be whiny if you aren’t putting in the effort.", "YTA. Sounds like this girl has more personality in her pinky nail than you have in your entire body. She’s under no obligation to conform to what you deem “acceptable” hobbies or interests. \n\nShe’ll likely experience more in her life because of these languages than you ever will. I suspect you know that, and are taking the only path you know and trying to bully her into submission. Seems like she’s smart enough to recognize the jealousy exploding off of you.", "YTA .\nYou're surprised she is mad at you after telling her she's boring and she has no personality? Huh, who would've thought?", "YTA, jealous much?", "YTA, for not speaking to her in one of the languages she's learning", "So... You want to bring her down to your level because you can't climb to hers?\n\n\nYTA. You should read more. And immerse yourself in other cultures. You might even develop a personality of your own, who knows.", "YTA, you sound really annoying with your narrow few. \nAlso, ich würde gerne deine Mitbewohnerin kennenlernen, sie klingt super!", "YTA lmaooo\nLearn a New language and leave her alone.", "YTA YTA YTA \nFor all the reason you stated above", "YTA.\n\nIf you really wanna bond, you’d ask for subtitles to watch together.\nYou can also listen to music without understanding the lyrics. I was giving my all listening to Spice Girls and BSB growing up and didn’t speak English.", "I'd rather be a polyglot than a jealous asshole. \n\nYTA.", "YTA. Your roommate does not need to be your friend. It's freshman year, in 5 months you'll be able to find your own roommate with similar likes and hobbies. Your current roommate sounds cool as hell.", "YTA. You’re jealous. Taking an interest in other cultures and their language is such a beautiful thing. It IS a hobby and an awesome one at that. It’s such a cool skill to learn and master an entire language. She sounds really smart and I can see why she has a lot of friends.", "YTA. It doesn’t look like she’s imposing any of her fondness of language on you but rather you are the one who is peeved by it. I’m inclined to think you are jealous that she speaks three languages and is interested in learning more, which shows commitment from her end to learn, upkeep and maintain her languages.", "YTA\n\nThis was posted an hour ago. I'm going to guess that she stopped paying attention to the responses at 57 minutes ago, when it became obvious that no one was on her side.", "YTA. \n\nAt least she speaks multiple languages, whereas your personality is apparently entirely based on trying to get your roommate to be your forced friend. \n\nFrom your post, we gather about her:\n\n1. She has friends. \n2. She speaks multiple languages and is interested in more of them.\n3. She listens to music.\n4. She watches TV.\n\nShe sounds lovely. \n\nOn the other hand, what we learn about you, from you:\n\n1. You cannot find ways to connect with the person you live with other than inserting yourself in to things she is already doing.\n2. You cannot listen to music in another language.\n3. You decide someone is boring when they don't cater to you. \n\nYou sound like das Arschloch, a pendejo, or more recently, a babaca.", "Is this another chapter in the Ivy saga? Like, OP realized we all knew she hated this Polish woman and is changing up the languages?", "[removed]", "Also, only listening to music in a language you can understand is really limiting and ultimately just dumb. There are sites with lyric translations for nearly every song out there, if you really want to know, but the music itself is universal", "Totally!  She sounds lovely and seems eager to share... \n\nThe irony is the ability speak and the love of learning languages IS technically a personality.  They have a name... Polygots! \n\n[https://en.wikipedia.org/wiki/List\\_of\\_polyglots](https://en.wikipedia.org/wiki/List_of_polyglots)", "This user reminds me of people telling me that I can't listen to BTS bc they sing in Korean and I can't understand it", "OP's roommate's friends who speak different languages: \\*exists\\*\n\nOP: \"I'm offended!\"", "Yeah, and you don't need to understand the lyrics to a song in order to like it. I don't know a language other than English and every single opener for Spy X Family slaps", "I agree and think OP is jealous of roommate, and I'm also getting the sense that OP is kind of obsessed with roommate in the Ingrid Goes West kind of way. Like roommate being closer to other people and connecting with other people in other languages locks OP out and OP can't stand it because OP wanted to get closer to roommate (\"trying to bond\" comment). There's a note of obsession in this post that the roommate herself may have sensed (\"stop eavesdropping\" comment) so OP reacts to that rejection by being an AH.", "Yep, it seems like the problem isn't with the roommate, but the fact that the roommate does stuff that OP doesn't/can't do. I know my first college roommate got crazy upset that our hobbies didn't mesh because she assumed we'd be \"besties 4 life\", but our personalities couldn't have been more different. I wonder if OP is the same and upset her roomie isn't a built in bestie. Or if she's just a boring child who needs to put others down to make herself feel better.", "OP obviously doesn't know how much interpreters make, or how knowing other languages increases your hireability for all sorts of jobs. Tough to really learn another language complete with slang if you're not consuming media in the language.", "I really wonder if OP thinks that her conversations with friends in a different language were just.. conversations about the language they are speaking. She says that's her whole personality, but then goes on to explain that she doesn't understand any of the things being said. Can you imagine someone watching a TV show in Spanish and thinking the whole time \"yeah, I understand this. That's awesome how much I understand that language. I'm going to keep watching this because I understand the words, not because I enjoy the show.\" It's such a weird take. \n\n&#x200B;\n\nBesides that.. even if it were true that she's only watching these shows or listening to these songs to learn the language because that's her idea of fun.. it would just mean that she enjoys learning new languages. No different than say.. learning to play music, or studying history. Let people enjoy the things they enjoy. No need to judge because it's hard to relate.", "This. OP, you just sound miserable and jealous. Your roommate seems to have her own interests and own friends, unlike you. Leave her alone.", "Not only jealous but also insecure and self-centered.\n\nSeriously knowing 3 languages is awesome and learning 4th can open a lot of doors for her.\n\nOP YTA. Not everything needs to be about you.", "Exactly. This post reeks of jealousy because it is clear that OP wants to be friends with her roommate, but OP does not yet have the social skills to learn how to build friendships. What if OP asked her roommate about how she came to learn the languages she’s learned? What if OP asks her about her goals for learning Portuguese? I bet this would start some good conversation in the language that OP understands and could possibly lead to something like a friendship. \n\nAlso, it is worth mentioning that not all roommates in uni become friends (especially freshman) because of different interests and different personalities. Learning a language is not a personality, but striving to put the time in to be able to communicate with people in different languages is admirable to say the least. \n\nYTA OP, but you’re young so take this as a learning lesson! Maybe making friends in college is hard, but spend more time out of the dorm exploring your own interests to find your community. Best of luck!", "Making being polylingual a whole personality would be making a big deal and pushing it in other's faces. Katie isn't doing this, she's learning, reading and watching other languages because she wants to expand her understanding of the world. OP is the one making something a whole personality by acting like the victim.\n\nIf OP wants to be friends with Katie she needs to actually say she wants to hang out and do something both can understand instead of what OP is already doing. It's obvious she's not compatible with Katie's language interests.", "Burrrrrrrrn. But no it’s very much true.", "I'm surprised OP even has friends with the way she's so desperately attempting to befriend the roommate.", "My advice to OP would be, \n\nLet the hate flow through you. Use your anger as motivation to learn languages. \"You accuse me of eavesdropping? I will learn your languages just to do what you accuse me of!\"\n\nAnd then after mastering different languages, you get to communicate with so many people from different cultures. You will acquire friends of different backgrounds.\n\nAnd then throw the hate away.", "Take my poor person's gold 🏅🏅🏅🏅", "I agree with you but that’s envy, not jealousy. I don’t understand why so many people mix the two things up.", "I actually chuckled when I read that… can’t decide if delusional or arrogant. YTA", "Also watching tv and listening to music is the best way to learn pronunciation", "I don't speak French but love  Francoise Hardy.", "Right! OP peeks in on what her roomies watching, listening to, reading...I get the wanting to bond, but what was OP offering?  Seems like she wanted to hang out with the classy, wordly, INTERESTING girl but was no where near her league.", "Jealousy isn't a good look on anyone.", "Sounds like OP is trying to glom into roommate - \"what are you watching? Can we watch together? What are you listening to? Can I listen?\" \n\nIf you need friends, fine. But maybe find someone with shared interests, instead of trying to get your roommate to change. \n\nPeople also don't have to do everything with their roommates. Sometimes roommates are just roommates.", "I will be happy to donate a quarter so OP can buy a clue.", "👏🏼 👏🏼", "I saw the title and was like”oh, this troll again?” too haha.", "Is it always something like \"so and so speaks more languages than I. AITA?\"", "I think it's usually a once a month thing.", "I knew I’d seen this before!", "Spanish Ivy?  Are these posts supposed to be funny?  I wish they could be more entertaining at the very least.  Maybe we should start offering plot suggestions.\n\nETA: YTA, same as last time.", "I don't think it's real, this or a variation of it appears once a month. Couple times have been speaking multiple languages, once was playing drums, another was liking anime. Sometimes it's copy paste, others they go through the *effort* of retyping, but it's always the same exact formula.", "This sounds like at least 4 stories that pop up and almost instantly get pulled down when everyone realizes it's a repeat.", "I think that person ended up stalking the girl and moved into a flat across from her.", "I have a friend from Ghana. He told me that when he goes there to visit his family, he loves the way his father approaches unknown people by stating the languages /dialects he speaks, and the person answers back with their own list. And then they go from there in whichever language they have in common. \n\nNot sure of this is an actual thing everywhere there, just an anecdote he told me impressed him the first time he went.", "It’s been posted on here before ! Right?", "Listening to music *on headphones* even.  She's being considerate, while being happy to share with OP when OP asks.  And OP does ask.  Then insults her.", "You're a bot account. \n\nBEGONE!", "Super pathetic.", "I totally agree! My husband and I are fluent in two languages each, with English being the overlap.  As such, I end up listening to a lot of Cantonese (his first language) music and love some of it!  Then we also have an eclectic mix of other music including Japanese and Italian, which neither of us speak, though I am learning Italian.", "I have thoroughly enjoyed some music I couldn't understand the lyrics to.", "TIL jealousy mixed with total lack of culture can result in a whole personality. And OP really \" not very smart\" to put it in a nice way to ask a place where post people are obviously, at least, bilingual.", "Classical music performances are often given in the language in which the composition was written. People still go to hear the music. Most operas have \"supertitles,\" which show translations of what is being sung.", "I have a few Spanish songs on my Spotify. I don't understand a word of them but the melodies kick ass", "I have been listening to a French duo called Bandit Bandit. Most of their songs are in French (obviously) and whilst I only have a basic grasp on what they are singing about they're amazing and I am still singing along.", "Republicans love to play Born in the USA at their events... people still think Kiss wants you to rock and roll all day and party every night when they just want you to rock and roll all day and part of every night so you can get a good night of sleep (this ones obviously a joke)\n\nknowing the language doesn't make you automatically understand the lyrics nor are lyrics the most important part of most music", "Sounds like she is the kind of person that declines watching a movie if it has subtitles.", "> Also, only listening to music in a language you can understand is really limiting and ultimately just dumb. \n\nThis, there are genre's I struggle with in certain languages, but there are still normally a few ear worms to enjoy.\n\nEdit: struggle with as in I find more difficulty in enjoying the music. I don't normally understand the lyrics but if I'm enjoying it I will check out if I can find a translation to read along with listening.", "As somebody listening to death metal a lot I totally agree.", "That's how I got into some of the bands I listen to now. I know very limited German and Spanish, and next to nothing of many other languages, but I love listening to groups like Rammstein and OMNIA.", "Heck, there's a videogame with a song that the lyrics are kinda Latin, but not quite, the gaming community has tried to translate it but definitely falling short a bit, but we have enough to get the general idea of what the song is about. No one cares, it's still a good song.", "I think I mostly listen to music in other languages these days, and never look up the lyrics. Sometimes the words just really ruin the music for me so I love listening to great tunes and not being distracted by shitty lyrics.", "Ikr? I listen to whatever sounds nice, and idc whether i can understand it or not. For me it's all about the feelings it gives me, and those trascend any sort of language barrier. In fact, i love not understanding the words, so i can focus better on the emotions of it!", "I was going to say the roommate just sounds like a linguist and there is absolutely nothing wrong with that. \n\nFrom Google a personality \"is the combination of characteristics or qualities that form an individual's distinctive character\"\n\nBeing a linguist or polygot are characteristics and or qualities of OPs roommate. There are also likely things OPs roommate has but due to OPs roommate expressing it in another language its lost on OP.\n\nPerhaps also OPs roommate finds OP boring or not her cup of tea and chooses not to speak English so OP can get a hint that she is not apart of the group.\n\nYou don't have to be friends with your roommate OP you just have to be respectful and cordial. \n\nYTA - you could have just asked the roommate to include you a bit more or talk it out a bit instead of insulting her.", "Same. If you haven’t seen it already - Black Butterflies on Netflix (which is in French) is great!", "I speak spanish and can mostly pickup some of what is being said in french, that plus the characters in movies help you understand what's going on in the film, I'm learning french now an love french movies and shows / music\n\n&#x200B;\n\nif you want a really good french thriller watch 13 tzameti, 125 rue montmarte or haute tension.", "I adore other languague films especially horror, i hate when they are dubbed because it loses something in english so ill sit there and watch with subtitles. Some japanease and korean are for real messed up vs american/British ones", "I don’t speak any Spanish but would watch telenovelas all the time in college. My schedule matched up with another girl on my dorm floor, and we would watch them together even though we had no idea what they were saying. It was funny trying to guess the plot.", "In a Uni History class, I asked a classmate to borrow their notes.  Sure, I was told.\n\nThey ended up not doing me much good--they were not in English(the language the course was being taught in).  \n\nI did not know the language.  I asked her about it.  She took notes in that language to help her practice it.  The process of converting lecture to that language and the practice of transcribing it.", ">I really wonder if OP thinks that her conversations with friends in a different language were just.. conversations about the language they are speaking. She says that's her whole personality, but then goes on to explain that she doesn't understand any of the things being said. Can you imagine someone watching a TV show in Spanish and thinking the whole time \"yeah, I understand this. That's awesome how much I understand that language. I'm going to keep watching this because I understand the words, not because I enjoy the show.\" It's such a weird take.\n\nOP is entirely self-centered, so she assumes everything exists entirely for her own perception. She can't speak Spanish, so she cannot imagine a Spanish movie having any merit to Spanish-speakers; it exists solely to confuse her.", "Now that's completely unfair....OP's \"Friends\" are split on whether or not their the AITA<wink>", "I don’t think this is xenophobia, that’s going a little far. It’s ignorant and selfish but I think this is more about being jealous about her roommates skills than hate", "Why’s this “xenophobia”?", "How is this xenophobia? Or are you just jumping to conclusions?  Nowhere in the OP post does she state where she is from or the roommate. For all you know at this point OP could be a POC that only speaks one language. While her roommate may be of German decent and learned German from her grandparents.  \n\nYTA, op.  Speaking additional languages is interesting and now with 4 makes her very much employable in many fields.", "Omg. This is not xenophobic. Stop throwing out words that don't remotely apply to the situation. OP is definitely TA, but nothing here even suggests xenophobia. Jesus. 🙄", "Nope, jealousy. OP doesn't want to speak four languages, she just bothered that her roommate can and she can't.", "ohh like you just like don't get it... like she has so much personality... like all of it... she listens to like the coolest music and wears like the coolest clothes... but like you just wouldn't get it... OP isn't just an entitled little brat like she has so much going on... \n\nit's not like the friends who agreed with her probably only did so because they didn't want to listen to her annoying japping anymore", "With an attitude like this you might need to bring her a truck full of quarters before she gets it.", "Seemed to ring a bell from past posts but went against my better judgement and commented as I'm pretty sure they are always TA!", "Ultra pathetic.", "I listen to a ton of Japanese music, while speaking barely any Japanese. Most songs I get around to checking the lyrics for, but I forget lol", "old university roommate got me into classical mongolian music back in the 70s... still have records to this day that i love to listen to... never understood a word of what they're singing about but very calming", "Me too.  Nirvana is one of may favorite bands.", "Yup, that was a self own", "Netflix has so many shows from France and Spain! It makes me so happy!", "What this sounds like to me is the room mate does not fit op’s personality preferences in room mates. \nOp you need to find your own circle of friends at school, not your room mates. YTA", "Maybe not hate, but I think there's some underlying xenophobia in the fact that she thinks that her roommate watching shows in another language and talking to friends in another language is somehow \"fake,\" as in \"unnatural,\" when in fact this girl is just existing. As if doing things not in English were somehow outside the norm.", ">I tried to bond and listen to what’s she’s listening, it’s in another language again and I couldn’t stand it.\n\nThis part sounds a bit xenophobic to me.", "I think she is hurt that she is excluded. It sounds like she wants a friend, not a roommate.", "It could be both, I think the two ideas are probably existing together here.", "Could be, not enough information either way. But certainly an a-hole.", "If just hearing a foreign language upsets OP this much, I think it's xenophobia.", "She literally can't stand something because it's in a language she doesn't understand. Subtitles exist for a reason.", "What exactly do you think xenophobia is?", "It literally is xenophobic. OP hates the shows and music because they’re in another language, by OPs admission. Xenophobia is hatred of something foreign. Call a spade a spade, I see xenophobia", "That’s envy. Jealousy is that feeling you feel when you’re scared to lose something or someone you “own” (ofc you can’t own a person but you know what I mean) to someone else. She’s envious that she has better skills.\n\nEdit I specified better", "Über pathetic", "Mega pathetic", "I’ve really gotten into Aimer lately. like you, I usually look up the translated lyrics to get a sense of the song and then usually remember the general idea of the song lol", "Yeah I listen to French, Spanish and Scandinavian music but barely speak my own mother tongue lol it's just fun to hear the melody and pitches as something new.", "Same. My two favourite song are Korean", "My friends and I LIVED, ATE AND BREATHED JPOP back in HS. Pretty sure it was the ONLY genre some of them listen to.  ONLY ONE of my friends was and is conversational skills in Japanese", "Same. I listen to Again by Yui a million times, belting out the song, and I have no idea what the hell she is singing LOL but it's a bop.", "Again by Yui (Fullmetal Alchemist Brotherhood Part 1 Intro) is a perfect example of a banger where you don't need to understand the words to enjoy the music.  Cruel Angel's Thesis for Neon Genesis Evangelion would be another, although the lyrics really bring it together for me.", "I watch so many shows in foreign languages, I'm probably too old to pick any of it up but they are so good! Why should I miss out on some of the most amazing supernatural or horror TV just because it's not in English, and don't even come at me with dubbed *shudder*. I watch everything subtitled anyway so I'm used to 'reading tv'.", "This. She’s your roommate not your friend. She has friends. Time to find your own.", "Instead of building yourself up by learning another language, perhaps, you’d rather tear her down.", "If you squint you can see the \"what are they saying about me when they talk in languages I don's speak\" between the lines of OP's post too.", "Also subtitles exist!!!\nLiterally if the show it's in another language she could ask to add English subtitles?? Also you can listen to music in other languages, you can search for translations \nMonolinguals...", "I mean I won’t listen to music I can’t understand, I like to listen to the words and understand their meaning, can’t do that in another language. I think it’s perfectly fair to not enjoy music that *may as well be* in gibberish. That doesn’t mean she hates people who speak German or Spanish it just means that to her it’s nonsense and that isn’t pleasant.", "She’s not saying music in another language is bad, she’s just saying that *she* can’t stand it. Not xenophobic.", "How so?  She is allowed to like or dislike something. There is a reason most people listen to music in their primary language and not in other languages. There is different styles of music are regional. It's all about taste. She doesn't like it. That's ok. That's not xenophobic.", "why? she isn't obligated to like everything that is in another language", "She sounds like those idiots that yell \"this is America, speak in English\"", "Yeh college can be a stressful time, and one can understand. Better ways to handle this though, and that's not by stopping someone from learning and enriching their life.", "What a terrible way to make a friend. Why can’t OP say something like “oh, I just watched x show, have you seen it?” “I’m going to go grab some food, do you want to come?” “I’ve been listening to x artist, are you a fan?” Instead of trying to force their friendship based on whatever the roommate is into? Roommates are not obligated to be your friends. Is it nice? Absolutely. Is it a requirement? No. Now that OP has called out her roommate over nothing, and made herself out to be one of the worst kinds of people, they probably won’t ever be friends. OP, YTA.", "I agree, and I also think what OP is trying to say is she feels her roommate is 1 dimensional in regards to languages are the only thing her life is about. That may or may not be a valid criticism, but ultimately it's the roommates choice if she wanted to be 1 dimensional. Sounds like it's a bad fit. But OP approached the situation incorrectly and does sound a jealous that she isn't getting attention or being included. But again there are better ways to go about this.", "This needs approx 10k more likes to unseat the original YTA. OP is feeling excluded and isolated in their own space and is trying to get the college experience they hoped for. That's not asshole behavior, they just landed on an asshole answer, which means they are still TA. \n\nOP, You and your roommate aren't a great fit. It doesn't mean she doesn't have a personality. It just means she doesn't want to hang out with you. It doesn't mean you don't have a personality either. Neither of you is bound to each other per shared 10x10 overpriced room. Just move along.\n\n\"You don't have to blow out other people's candles to make yours glow.\" - Ms. Donaldson, 8th grade health teacher, 1994, sage for all time", "Imo, it's probably neither. OP doesn't want to know new languages and she doesn't feel threatened by the idea of foreign languages existing, but she's certainly being an AH about someone else being interested in expanding their language set.", "Oh that's German OP won't like that", "Pathetic to infinity and beyond", "Giga-pathetic", "I love The Gazette, but with an exception of a few songs that are my favourites, I can't recall the lyrics. The general idea I can give that's true 99% of the time is \"sad and/or disturbing, possibly also disgusting\" lol", "Oh hell yeah, I remember when Jpop and Jrock overtook my high school lol, everyone had An Cafe and Miyavi posters. I'm probably one of the very few people who still listen to the genres a decade later, although I moved a bit to the heavier sounds as I grew up", "Like wasn’t La Casa de Papel or Squid Games very popular non English shows the past few years", "Depends. She doesn’t mention whether English is the OPs primary language or not. Or if the roommate’s friends have English as a first language or if they’re speaking someone else’s primary language. \nEither way it’s YTA, but she’d be even more TA if she’s not taking that into consideration.", "I, and most people I know, listen to music in languages we don't speak ALL the time", "Except the only thing you miss when listening to music in another language you don't speak is the poetry of the lyrics. The rhythm, melody, and harmonies are just as clear as when listening to music in a language you do understand.\n\nThen there is, at least for movies and TV shows, this thing called subtitles. OP could always ask if her roommate would mind turning them on so she can understand what's going on. This screams barely masked xenophobia to me.", "There's no reason to dislike it either then...especially if she has no idea what they're saying lol", "She can't watch movies either if it's in another language. Not liking something simply BECAUSE it's in another language is her goto. \n\nPlus, I never said she has to like everything that's in another language. Bad strawman attempt.", "Yeah, “I tried to see what she was watching” “I tried to listen to what she was listening to” “I can’t jump into a conversation she’s having with her friends because it’s not in English.” \n\nLike, do you want to be friends or stalk her…?", "Hyper-pathetic", "Tera-pathetic", "I'm sure there are some, but there is a reason you do not have radio stations in other languages outside dominant immigrant languages. The same could also be said for popular music. There are rare occurrences, but again it is not common.", "There are people who don't like subtitles because they have trouble reading (do you have barely masked hate for people with trouble reading?) Or can't read fast enough and also watch the show/movie. A good amount of foreign music is in different styles than what someone may enjoy. If you like rap is it bigoted to not like country music, or are your tastes different? Some people enjoy music FOR the lyrics/story telling. Are you now gatekeeping what music people like and why they like it? I personally have no interest in music that I don't understand or relate to. There are also styles I don't like. That doesn't make me xenophobic, it means I have different preferences than others may have. The OP may have similar preferences. To jump to xenophobia is a stretch without further information.", "Rhythm and melody are universal!", "She didn't say that she didn't like it because it was in the foreign language. She said it was in the foreign language and she couldn't stand it. But even if she doesn't like any music in the foreign language it isn't xenophobia, you people are trying to hard. I only listen to music in the languages that I know because lyrics matter. Without the understanding of them appreciation of the song can't be as high.", "Infinitely pathetic.", "That is simply not true. Teens listen to kpop nowadays and back in the 60s my grandma listened to english music all the time. \nHalf the world listened to the beatles while not being able to speak a single word of english.", "Re subtitles, if that was the issue, then sure, but when it's \"so obviously I can't watch that\" that is very different from \"I'm dyslexic and have trouble with subtitles\" or something.\n\nIt's not just \"not liking a thing\" that's the issue, but the how and why of it.", "I love listening to music in other cultures, language barrier doesn’t slow down my appreciation. To be honest, if I can understand the emotion of a song without knowing the lyrics, it just means it is good music. Additionally, most people that like opera are likely not fluent in the language used in most of the classics. This is very much subjective.", "She literally said she couldn’t stand it because it was in another language.", "Context clues are in the words.\n\n: fear and hatred of strangers or foreigners or of anything that is strange or foreign\n\nLiteral definition. Seems to fit.\n\nWhy couldn't she stand it? Are you suggesting it was some other reason?", "You are letting yourself down. I am only fluent in English. But I've listened to a lot of music sung in a different language and truly enjoyed it. And if it's something I really love, I can translate the lyrics online.", "lol\n\nEvery K-Pop fan in the world disagrees with you.", "Más patética", "I can’t understand lyrics in languages I do speak half the time. Audio processing is a bitch.", "This is why I enjoy opera music so much. It tells such a story even when you can't understand the language.", "some people are more about sound others about meaning. to me a song isn't worth it if I don't understand it. This isn't the same as \"xenophobia\".", "I don't see any fear or hatred? She just doesn't like it because she can't understand it.", "Reminds me of the scene in Tommy Boy when they’re crying while singing Eres Tu. 😆", "Despacito!", "Turbo pathetic", "YTA. Yikes, jealousy and bitterness is a disease. Hope you get well soon.", "Ayyy.... Been a minute since we saw the language troll around....\n\nYTA\nYou're the asshole\nAap gandu ho\nTu eres la gilipollas (forgive my Spanish if I messed up here)", "YTA\n\nYou're not \"telling the truth\". You're jealous. You're literally jealous that she has friendships and interests you can't horn in on uninvited. This sounds so much like logic men use to justify saying, \"well you're ugly anyway\" to women who reject them--it's insulting someone else to make you feel better about your shortcomings.\n\nSo maybe the uninteresting person is the person who only speaks one language and doesn't have a diverse group of friends from other countries.", "YTA, ur just boiling with jealousy", "YTA for being a shitposter", "YTA, for missing the hint.  Roommate apparently doesn't want to be friends.  It's sad, she's missing out on getting to know you and such, but she seems to have her own friends and interests that don't really overlap with yours.  You shouldn't have gone off on her, just settled into \"roommate cordiality\".", "YTA and you're boring. She speaks your language too, did you ever stop to think that she's simply choosing to converse with people she finds interesting and who share common interests with her? You sound obviously jealous and like you're the one who needs to work on your personality. If you were as cool or interesting as you think you are, you wouldn't be bothered that you aren't being included in their conversations because you'd have your own shit going on. Also, why can't you listen to music in other languages? Even if you don't understand the lyrics you can still find the melody, beat enjoyable. It's awesome that she speaks multiple language and that she has a passion for it and , few people are actually passionate about anything.", "YTA\n\nWTF.  You expect her to dumb herself down to make you feel better? \n\nAre you seriously expecting another person to no listen to music they like or books they read or learn a language they choose because of your own insecurities?", "YTA, and you're NOT \"telling the truth\": you're just a jealous, whiney, immature child.", "YTA, and obviously jealous as fuck that she has so many more opportunities to talk with people.\n\nI notice that you mention \\*her\\* friends, but not that YOU have any friends.  Being a whining blunt asshole can have that effect.", "YTA in every way.\n\nYour roommate hasn't made \"speaking as language\" her personality. She enjoys movies and music and books and friends, she just engages with those things *in multiple languages*. Seriously, what is wrong with you? Is it envy that she is a polyglot and you're not? That she is smarter than you and has more friends?\n\nI just want to summarize your claim: you can't speak multiple languages. You listen to music in one language. You watch movies in one language. You read books in one language. You speak to people in one language. Your roommate can do all of those things that you can do but in multiple languages. And you claim she's the boring one?", "You are jealous, all I’ve read is normal for someone who likes foreign languages, or is invested in developing themselves….. learn a foreign language too so you can expand yourself.", "YTA. Her life doesn't revolve around you she's literally just doing what she wants to be doing.", "You’re American aren’t you?", "Duolingo is a great place to start learning a language.  I’ve been learning French for over a year.  Instead of showing your jealous side why don’t you apprendre à parler une autre langueagr.  Vous pouvez demander à votre colocataire de vous aider which could serve as a bonding experience instead of driving her away by informing her that she needs to stop something she obviously enjoys and is good at.  \n\nYTA.", "YTA. You seem like a person who didn't watch Parasite because it wasn't in English", "YOU ARE A JEALOUS ASSHOLE! YTA", "Yeah, OP sounds like an absolute hater. It would be one thing if OP and roommate had mutual friends and they all spoke the language and left her out. It's an entirely different thing that OP feels \"left out\" of roommate talking to HER friends, watching movies that SHE likes, and listening to music SHE enjoys. If she wasn't so riddled with jealousy, she could have suggested that she and roommate find movies/music/other things that they both enjoy and start bonding over those.", "Also super controlling. Why is OP critiquing her roommates hobbies, friends and musical tastes and thinking she has a right to demand she changes. They're roommates not life partners this girl doesn't have to include OP in her conversations or movie nights.", "She's also intelligent, determined, and educated if she can learn three, going on four, languages.", "It’s so sad. OP really wants cool hobbies and friends to chat with about shared interests but can’t bring themself to either develop any of their own or adapt to their surroundings.", "*and apparently can't read subtitles", "Spouting cliches is OP's personality.", "Ya OP sounds super entitled tbh. Is the roommate refusing to turn on subtitles for the shows? Did OP even try to listen to the music to see if it was a beat she enjoyed? She is more focused on being jealous than trying to branch out. And I say this as an English speaker who watches shows and listens to music in other languages.", "Yup. OP should probably go out and make some friends of her own or pick up a few hobbies instead of fixating on and insulting the person who is forced to share a room with her.", "\"Turn on the subtitles\" \n\nExactly this!  I watch a ton of shows and movies in languages I don't speak, dubs are usually piss-poor voice acting and I hate when lip movements don't match what I am hearing. Subtitles are great!", "Or she could start to learn a language as well.", "I agree, there’s a lot you could’ve done before blowing up. I get it, I had a roommate that was just one personality for 3 years. Its really not that bad. Why should your opinion be the only one that matters? Maybe she could help you learn a language, you can still ask her what is happening in the books she’s reading, who her favorite non-English artists are, or just straight up be like “hey, my dude, I feel like we could use some communication, I really want to get to know you, but I don’t speak any other languages. Is there some middle ground we can have?”", "Totally agree!! I unfortunately am a victim of the American education system so I only speak a tiny bit of Spanish from what I retained from my high school classes. I still love to watch foreign films and TV shows, subtitles make it easy to enjoy media from all over the world. I also really enjoy some music in other languages even though I can’t understand what they’re saying. I love dancehall/reggaeton/Latin pop/Latin rap, I can’t understand a damn word but I can still shake my ass!!! Lately I’ve been listening to Japanese disco/city pop from the 70s and 80s, again I have no idea what they are saying but that doesn’t change the fact that the music is groovy as hell. OP is jealous or feeling inferior or something, it’s awesome that her roommate can speak so many languages. I WISH I could speak many languages but unfortunately I am a product of the society that OP seems to buy into. \n\nShame on you, OP. YTA.", "Has OP said anything to indicate that this is a roommate by choice because I get the assigned dorm-mates vibe from the post.  If that's the case and this was basically a stranger she was assigned to share a room with it's also honestly a bit creepy that she seems to take such an interest and gets personally offended.  Like showing up to a party uninvited and complaining about the food, just tacky and a bit creepy.", "Wonder what deep and interesting traits OP has about her character?", "Annnnnddddd.... having an expectation of only watching shows of interest to both people is not a reasonable expectation for roommates. Things like discussing main TV use/time can be. Making sure folks can watch stuff in their room on their laptops should be part of living with a roommie. It's a great coincidence when it does work out.", "That phrase alone makes her the asshole. Someone needs to pull their head out of their ass.", "Everybody knows that insults only count if you don’t actually believe them!", "Yes, jealousy is the first thing that came to my mind. This post must be from an American because we don’t as a rule learn fluency in more than one language, but most other countries do as a part of their education. Instead of being jealous, maybe focus on some positive aspects of your own personality instead of being so insecure that you have to lash out at someone for absolutely no reason. YTA", "Wait, does ~~Ivy~~ Katie also work in a café and date a guy named Mark?", "If I had awards, they'd be yours. But here's a couple clapping emojis. 👏👏👏", "I snorted at work over this, now my coworkers are worried (I snort laughed and had coke Zero go up my nose, my computer still works so it should be fine) A+ comment.", "The kicker is she believes she told her the “truth”.", "It may well be OP's entire personality, though. And it's not a good look.", "Huge YTA here. I did a whole research paper in college about the cognitive advantages of bilingualism. There is some really interesting stuff. I learned a second language at 19. OP should do the same and open her eyes.", "It's like she expects her roommate to be her best friend and is angry that she isn't fitting her view of what uni should be. It's so bonkers.", "Ironically, learning English has indeed become part of my personality, as the language has introduced me to new media (or helped me appreciate them in ways dubs and subtitles could not) and led me to develop new interests. It has even allowed me to form and express thoughts that do not translate into my native language.", "Sadly, it sounds like OP is just mad that this woman and her friends aren't interested in engaging with her. Which, isn't too shocking.....", "_\"I told her she has to let it go, that she needs to develop her personality because speaking a language isn’t a personality trait and she’s just boring.\"_\n\nI love how OP is the one snapping that the roommate has no personality and is boring, yet she is the one who is seemingly desperate for friends..... The roommate is minding her own business, paying OP dust, listening to her music/watching shows, and hanging out with her diverse group of friends while OP just sits around, stewing that her roommate and her friends don't invite her to hang out....", "Green is not a creative color.", "I was a Kpop stan in HS and loved some Japanese artist too. Music isn’t good just bc you understand the lyrics.", "I unfortunately am monolingual (can understand malay and that’s about it), but that doesn’t stop me from listening and watching things in other languages. I love listening to Latin music and kpop because it’s fun and beautiful to hear songs in other languages. I watch kdramas and European shows and movies with subtitles because, again I enjoy hearing things in other languages. I think if I really tried I could definitely pick up words and phrases but for now I just like being immersed in other cultures. OP sounds so closed off and boring. You could’ve definitely bonded by asking her about her interest in other languages and cultures but your roommate definitely won’t want to do that anymore. YTA", "New to the Reddit community! How do you tell it's the same person? The profile only shows one post and no comments, isn't named throwaway, but y'all seem to be certain it's the same person.", "Even better just turn on subtitles and Google lyrics! OP should join in on the fun not try to ruin it.", "It's that time of the month for the \"jealous troll\" again", "This was my first thought too, given the age. Maybe shitty family who taught her that in the real world anything but English is an aberration, and this is how reality looks to her.", "pathetiq", "I'm European. I used to listen to the radio all the time when I was little. They played songs in English, Spanish, Swedish, Russian, Ukrainian, German, God knows what else. \n\nNone of those languages was my native language. I didn't give a shit and always sang my heart out despite not understanding anything. \n\nFinding out later in life that some people look down on music in another language because ThEy Can'T uNdeRstanD it was a big fat slap in the face. Now I'm an aduly and still can't comprehend how limited and ignorant it is.", "Seriously, I can barely speak anything outside of English... but I *love* JPop (Utada Hikaru, Mika Nakashima, Daichi Miura, Chihiro Onitsuka, and Ayumi Hamasaki are some of my favorite artists of all-time), listen to some KPop (really just BoA and Rain right now), and enjoy music in Spanish (Shakira, Enrique Iglesias, Laura Pausini), Italian (Lara Fabian) and French (Céline Dion, Anggun). Among others. Enya's another one, sings in multiple languages, and I adore her music. And that's just naming a few off the top of my head.\n\nYou don't have to necessarily understand it to know if it sounds good to you. Plenty of people across the world enjoy music in languages they don't speak.", "Right??? Some of my favorite music is German, and even though I have some basics of the language down, I’m far from fluent. That doesn’t stop me from enjoying a good song, AND I get to learn more German words while I listen! It’s a win-win!", "Exactly. I mean, who listens to music that's not in their mother tongue, except for, I don't know, literally every single person in the world who wasn't born in an Anglophone country? The laziness and entitlement really annoy me.", "No.", "Agreed. I bellydance but don't speak Arabic, so have a lot of songs I don't understand on my iPod. Same for Scandinavian fiddle playing, pagan metal, etc. \n\nOP, WHY does this bother you so much? Are you feeling left out or thinking your roommate is shoving you aside on purpose? Maybe look for clubs or activities or meet ups that fit your interests more. My freshman year I got saddled with terrible roommates but made friends elsewhere in the dorm. \n\nI study languages for fun, but that also opens up a lot of cultural activities and appreciation beyond the music of the words themselves.", "And well... lots of pop songs lyrics are not that deep. Doesn't matter if it's in Estonian or Spanish if I like the melody.", "Glad I’m not the only one who immediately went there", "That’s what I thought, too!", "My brain jumped to “multiple languages bad” and now I remember Ivy!", "What kind of French shows do you watch? Genre preferences? I might have some recommandations", "Shoot, half the time, I can really tell what singers are saying *in English* in their songs, so why care if I can't tell what singers from other countries are saying? Good music is good music, whatever the language.", "por qué no los dos?\n\nOh sorry, I wouldn’t want OP to think I don’t have a personality! I meant “Why not both?”", "Very much so. Some people can't tell the difference between their opinion and the truth.", "Also entitled. There’s no reason OP should be weighing in on her roommate’s interests, or to criticize her choice of entertainment. She doesn’t need to be a part of the roommate’s conversations with friends. OP wants to be friends, but her roommate is under no obligation to change herself to meet OP’s specifications. How very presumptuous.", "The first time I finished a novel not in English, I was very proud of the fact I had done it whilst also feeling it was a mediocre book. There is an intellectual satisfaction. \n\nBut once fluent that wears off. Its then just enjoying the different perspective other cultures bring.", "Exactly! Based on the title, I assumed OP's roommate would constantly brag about the languages she speaks and that's why OP got super annoyed and said that.\n\nBut no, OP's roommate is just living her life. Speaking to friends, watching shows, listening to music. \n\nOP's just annoyed because OP can't understand or join in. This post reeks of jealousy. Certain parts also felt xenophobic to me. \n\nLike....as a bilingual, I watch shows in different languages, and I also speak to different people in different languages. I listen to English, Spanish, Korean, Turkish and Arabic music. I'm planning on studying and learning a new language in university. Literally how is that 'making languages my entire personality' and how is it 'boring'? It's the exact opposite, really.\n\nYTA OP.", "I’m semi-fluent in Spanish, learned as an adult, but also have really bad ADD. And once in a while when my coworkers are talking and telling stories I find myself thinking, “I understood that completely! Wow! I remember when I couldn’t do that. I have (almost) two whole languages inside my one head. How does a person even do that? How does it work? Where do they both even fit in there?…”\nAnd the next thing I know I realize I’ve missed a whole minute or so of whatever they were saying because I was so goddamn distracted by my own bilingualism.\n\nMaybe that’s what OP thinks her roommate is doing? It’s definitely not what I’m supposed to be doing when I’m listening to people.\n\nOh also, YTA OP", "If you don’t use it you lose it as far as languages are concerned. The roommate is doing the right things by attempting to immerse herself in different ways of the languages.", "yeah... YTA... I think she just feels left out and is using young people communication which doesnt solve anything. Maybe just ask, \"hey when we watch TV together can we watch English?\" Or when you get home and she is already watching something then she adds English subtitles. As for her having convos with her friends and studying her languages... uhhh learning languages is time consuming and she is allowed to have conversations with her friends that you aren't a part of.. even in English.. I think try to branch out outside of your randomly assigned roommate, and dont take her interests in other languages as something personal or something to dislike. Bc honestly its pretty cool! Now go find your own cool and yall can be cool together", "What a great assessment!", "Exactly. Just because she's her room mate doesn't mean she has to be *friends* with OP and is obligated to include her in her social life anyway.", "Since OP mentioned that Katie's friends speak one of the languages she knows, it sounds like Katie enjoys making friends from a variety of backgrounds and cultures", ">watching other languages because she wants to expand her understanding of the world\n\nThis! If you speak the language, it makes sense to watch movies in their original form. A lot of the nuance is lost in translation. This could be wordplay that doesn't translate, but it's also about contextual clues that get lost - for example, you can't really translate Japanese movies to English without losing a lot of context, because the way language conveys social standing works very differently in these two cultures.", "Exactly! The only one making Katie's knowledge of languages a personality is OP. Katie is just living her life.  OP is deeply invested in something that, frankly, doesn't concern her.", "Do you know what xenophobia is? You can’t just throw around buzzwords.", "When I was supposed to be studying for my  certificate of proficiency, I binged movies with English subtitles on, instead. Needless to say that I passed the vocabulary section (definitely my least favorite thing to study) of the exam with flying colors 😅", "Absolutely! I’m a native English speaker who studied French and other languages. I lived in France for awhile and I’m a French teacher now. Speaking French is part of my daily life. It’s become part of my personality. I’ve made friends and discovered music and other media because of it. \n\nWhat’s that quote—“he who only learns one language only lives one life? Learn multiple languages, live multiple lives” or something like that.", "A friend of mine was looking for interpreters for a specific language. The amount of money they were offering per hour was mind blowing. I was like “screw this! Where do I learn that language? Sign me up!”", "Also, how can they know anything about roommates personality when they have no idea what’s being said?", "It’s the infamous ivy saga in which it always revolves around someone telling off a roommate or coworker for speaking another language and acting like they’re bragging about just by speaking it. There’s a sun dedicated to it! r/TheSpanishIvySaga", "When you see the same basic story posted multiple times.  I've seen this person post about going to a friend's dinner party and all the books on her bookshelf were in other languages.  The author of that post also called the person pretentious.\n\nWait til you see the guy who posts about inviting a girl to study in his dorm room.", "We need to set up a go-fund-me!", "Maybe I’m old. Ok, I’m old. But I don’t see what the eejits get out of the same old post over and over again 🤷🏼‍♀️", "Awwwww, my boyfriend’s first languages are Cantonese and Mandarin and I’m learning Spanish and Japanese but we both speak English with each other:) his mom listens to a lot of audiobooks in Mandarin that i end up enjoying because the language sounds cool, and I’ve made him listen to the songs that I like in Spanish and Japanese :) I love seeing other relationships similar to ours :)", "Shit, when Despacito was big, it topped the U.S. Billboard Hot 100 for 16 weeks. I'm sure there were plenty of people mixed in there happily listening without really knowing any Spanish.", "Which video game, cause this sounds vaguely familiar?", "One thing I love about opera, though, is that their gestures, music, and the \"production\" tend to tell a story itself without needing to know the language. I guess the same goes for dance but less relevant than something with lyrics.", "true. some people dont like subtitles though, and thats okay. just dont get mad at your roommate for not using them lol", "I find it really funny when I look up the lyrics and the translation clears up nothing, because it's just nonsense sang to some really good music lmao. Mostly have that experience with metal", "German not French, but *Dark* is one of the best shows Netflix has ever hosted.", "You really need to develop a personality. That language thing is super boring. I couldn’t read your comment, it was foreign and I couldn’t stand it.", "This seems like a useful learning tool, although possibly she could have told you when you asked to borrow them that they were in another language she had no reason to think you spoke.", "I'm just imagining them having a whole conversation...   \n\n\nRoommate:  Yo hablo español\n\nHer friend: Ah, muy buena!\n\nRoommate:  Hablas español?\n\nFriend: Si! Tambien hablo español.  \nRoommate: Guau! \n\nFriend: Esta es una gran conversación.", "Right! Seems that way. Everything OP recounted speaks of someone doing what you must do to learn a language: dedicated self study through immersion (via books, music, tv shows, and movies) and holding conversation often in the language with others. I really hope OP can learn how socialize and make friends. It seems terrible to live through the more than likely false narrative that someone doesn’t like you or is intentionally being mean to you just by the fact that they are living their life and being a student.", "I haven't seen it, but I've heard that the English subtitles on Squidgame aren't as good as a more nuanced translation or understanding of the original Korean dialogue.\n\nI used to read a manga series years ago, and the volumes would at the end, or the start if you try to read it by western convention, have cultural translation for references, traditions and other things (such as the significance of certain buildings). The volumes would also have at the start the honorifics and what they meant, as the English versions didn't omit them from the text. Cultural background can change how you interpret a storyline, such as the relationship between Tidus and Jecht in Final Fantasy X.", "I feel that this is a generous interpretation given we don't know the roommate's background. And even if it is just a hobby, and even if the OP is just jealous, it still presents as xenophobic. \"I don't like that you do shit in non-English even when it has nothing to do with me\" is never not gonna read at least a bit xenophobic lol", "It's definitely xenophobia. When I hear a friend is learning a new language, my first impulse is to look for ways to also learn that language. I never do, because of time and the fact I get distracted far too easily, but it still speaks to OPs internal thoughts that her first impulse to a new language is 'ew'.", "Being irate at other people speaking foreign languages is absolutely xenophobia.", "Hard to say without further details but op’s post gives off a whiff of anti-intellectualism. \n\nOp, YTA. Get your own friends. Your roommate isn’t there to cater to your needs.", "Being unable to stand music in languages other than English sounds pretty xenophobic to me. (Though maybe that's a typo and OP meant she can't understand it?)\n\nEdited to add judgment: YTA, OP.", "UT announcer voice:  MONSTER PATHETIC", "Thanks for sharing :) I enjoy seeing similar relationships too; they seem few and far between!", "And let's not forget how big Gangam Style was despite the vast majority of people outside of Korea having no idea what it was about.", "Octopath Traveler", "Dark really was that good, yes. It broke my brain trying to track who was who.", "Going to put that on my watch list. I just started Kleo (also German).", "I just finished watching it and it was utterly fantastic. Headache-inducing and so complicated that I'd regularly have to pause it and have a bit of a think but so, so good!", "I should know that there’s nothing more interesting than knowing English. RIP", "\"Foreigners!?\" - Waiting 😅😅", "They can discuss about the verbs. It's never ending fun!", "OP also sounds immature. Telling people language isn't a personality trait and that they are boring is simply obnoxious and she's old enough to know better.", "Sounds to me like OP watched too many movies where you get an instant for-life bond with your roommate, though of course OP would be the natural leader of that \"friendship\". Now she's pissed her roommate has her own friends and her own interests, and doesn't care about OP at all.", "Sounds like to me OP might have  a bit of a control  issue as well. One can set boundaries, but you don’t get to tell others what they can and cannot do.", "I watch stuff in lamguages I don't understand all the time. There's this thing called subtitles.", "Yep. Seems like OP is the boring one and she’s projecting.", "HEY, English only please, OP doesn't want that boring foreign language shit.", "Äußerst pathetisch.", "Super patético", "I mostly listen to Antti Martikainen and his music has no lyrics, but it's like the best soundtrack to life ever, especially when you feel down lol\n\nEdit: out of any Scandinavian/Nordic musicians, obviously", "About 25% of my playlist is songs I know from anime openings. I rarely bother with translations. Rolling Star by YUI is also really good and it was of course an opening to Bleach", "I got into JPop back around my high school years (like in 2002... god, I'm so old) and haven't stopped since.", "I made the mistake of looking it up dang it.. I couldn’t figure out if I was forgetting who was who or if we hadn’t yet been told who was who. I realized too late that it’s mostly the second.", "/u/Signasedf is a bot that stole part of a comment from /u/CommanderInQuief (lol) here: /r/AmItheAsshole/comments/10q5qq2/aita_for_telling_my_roommate_that_speaking_a/j6o5h4x/", "OP's the pendeja.", "That’s a lot easier said than done. Chances are that OP’s roommate has an ear for languages; it’s super hard to learn a new language as an adult.", "Why English, this isn't England, these people should learn proper American!", "Yeah, I don't think we need to ask OP what country they are in.... I notice OP does not mention, say, the roommate's major. Which is probably some form of linguistics. Katie also probably will be lining up some awesome travel and getting to know folks from around the world while in college as OP stews in resentment and judgement. \n\nHow exhausting OP sounds. I'm guessing her friends are probably not \"split\" about the issue, it's just half do not want to deal with telling her she is being ridiculous and seems to be confusing a roommate arrangement with life at home or hanging out with friends.", "Yeah, it’s definitely one way to push her away and ensure the roommate will never like her.", "Main character syndrome.", "Pathetisch", "Äh?\n\nYeah, that's a word. For real.", "I love the Hu, they sing in Mongolian.", "What's really funny is that I've been listening to Bleach openings/endings (and some of the music the voice actors sing, [this one)](https://youtu.be/oSWKVBzcnoI) today. Decided I was going to start watching it again but wasn't ready to sit and watch full episodes so I threw on the playlist in the meanwhile.\n\nThe Japanese language is comforting for me since I lived in Japan until I was 3. I don't *remember* it but it still made a deep impression on me.", "It’s actually not that difficult, people just don’t dedicate enough time to it or study in the right way. Learning a language as an adult is hard if use just Duolingo but if you have the right resources and can pay for a course or tutor it’s not hard, it’s not easy either but definitely not half as difficult as people make it seem, especially if you learn a language similar to the one or ones you already know (like she’s doing with Spanish and Portuguese)", "Alice in borderland and dark were popular too. I avoid watching non English movies dubbed in English, the voice actors don't express the characters' feelings as well as the original actors.", "I'm a huge fan of foreign cinema. I'm allllllll about subs.", "Damn straight learn Navajo!", "Can confirm. Used to work in retail and once the pin-pad (for paying with card) was set to Spanish… costumer was *extremely* confused, I looked, saw it was in Spanish, chuckled and switched it to English - customer said “well I only speak American, and they should too”. Xenophobic people really say plainly stupid things with massive confidence.", "**Murcan, don’t be so ignorant.", "The idea of OP not being able to get into music because of the language is laughable to me... most people from her age range have at least a few anime or kpop tracks in their playlist, not to mention how popular reggaeton is.", "Ugh I loved Dark it was really good. But yeah I watched it with subs instead because of that same reason", "You need a running playbook for Dark!", "God please let her Roomie learn Navajo code talking next", "Uncountable infinity pathetic.", "Navajo is really difficult to learn.", "oh no... you used another language... now poor OP can't understand what you said... don't you have a personality? now she'll feel left out again.\n\n\n\n\n\n/s just in case", "Extrem erbärmlich", "WHAT DOES THAT MEAN SPEAKO ENGLISH"]}