{"id": 8851, "submission_id": "10qpje1", "title": "AITA for not wanting to help out my MIL financially?", "selftext": "So, my [27F] boyfriend is in prison. He comes from a low income background and his parents have always struggled for money, so ever since he went in, I have been supporting him financially, working two jobs and going into debt. He owes a small amount of restitution for his crime, which means out of any money deposited in his commissary account, 70% gets automatically taken away to pay for it. So basically for every $100 I send he gets $30.\n\nHe is expecting his stimulus check, which would cover the full amount of restitution that he owes, but his mom has asked him to give it to her as they are several months behind on rent and she is worried about losing the house.\n\nAm I the asshole for telling him he should not give it to her? If his restitution was paid off, it would ease a huge financial burden off me since I wouldn’t have to send in x3 the money that he needs. I understand she’s struggling, but she was never a good parent, and her getting that check would cost ME thousands more dollars down the line.\n\nETA: Thanks everyone for your advice. Upon reflection, it does feel like his mom is trying to take advantage of me. She has asked me for money several times in the last few months (which I have said no to) even though she knows I am already struggling to pay off my CC debt from helping out her son. I offered to help her set up a savings account but she never took me up on it. She just wants a handout. If my bf does end up giving her the check, I will have to support him emotionally but not financially, because I never signed up to support an entire family.", "created_utc": 1675244930, "permalink": "/r/AmItheAsshole/comments/10qpje1/aita_for_not_wanting_to_help_out_my_mil/", "score": 966, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My boyfriend is accusing me of being heartless for asking him not to give his money to his mom and having them risk being evicted but I feel like it’s unfair to expect me to keep picking up the slack.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. But kinda for paying your bfs restitution. Why put that on yourself? You didn't do the crime. He did. You two aren't married so you are not accountable for it. I'm more concerned about that than his mother tbh. You are struggling, taking two jobs, and paying for what sounds like a loser (sorry, not sorry).", "Is he worth it? Going into debt, paying his bills, supporting his family? If you told me he was your husband and you had kids with the guy, sure. \n\nAnyway...if this is the life you're choosing, then I'd go with giving his mum the cheque. Why? Because if she loses the house...guess who becomes a bigger burden? She does.", "NTA. Let me be 100% clear on this. It's *his* check. It needs to go towards *his* debt. If he has the funds to pay his restitution, then *that is the first thing that needs to be paid*. There *is* no stimulus check. That money has already been spent. By your partner. Who is *in prison*, leaving you to provide for everyone, including his family.\n\nIt's a horrendous thing, but poverty/low income, begets poverty/low income. Those who have a little give it to those with none, and when those with none get a little, they give it to others with none. An endless cycle where those who climb out are seen as selfish because they won't give.\n\nDo not join the cycle. Do whatever you need to do for you. If your bf wanted to take care of his mother *he should have made sure he was around to take care of her and not leaching off you and making you party to his punishment*. It sucks so much, but if your MIL ends up homeless? That is *not* your fault.\n\nWatch out though. If your bf thinks you made his mother homeless and blames you for this, he might rely on you for money and dump you once he's out for his \"mummy\". He's not around. Look out for you, none of them will.", "NTA. Don't ever go into debt in order to prevent OTHER people from going into debt.", "NTA. But let's be serious. Drop the dude. You are putting yourself into debt.", "NTA Maybe I'm even more selfish than you, but I don't see why you are taking on all this financial burden. Maybe if you were 47 and had children with this man, I could understand why you feel responsible for his debts. Or if he was using it as you expected to pay off his debt so he can have a clean start and build a future with you. But he's a criminal, and his mother should figure out her own solutions rather than expecting you to support her. \n\nYou don't need to take on this financial burden. If he's sending your money to his mother, you don't have any guarantee that this is for your future together as a couple, so maybe you need to put your own financial security first.", "OP you are holding some good cards here. Time to play them.\n\nGuessing that YOU are the only reason your man's commissary has been funded -- your work, your support. It costs you a buck to get 30 cents into his hands. Like it or not, you've INVESTED in feeding him AND chipping away at his restitution. Without you, he'd have nothing and would have made no progress, because nobody else is paying in, right?\n\nAnd you've gone into DEBT doing this, right? \n\nNow there's a chance for you two to get out from under that crippling 70% toll, and get his restitution paid off with his own money. So that if you help him with commissary in future, 100% of what you send actually gets into his hands. Massive improvement!\n\nBut his mama knows about that cheque, somehow, and wants it for her household. Because she's in DEBT too, she says.\n\nMeantime YOU just do not know:\n\n* whether that household is actually behind in rent, utilities or whatever\n* WHY they're behind (like, what has their money been spent on? commissary for Sonny, I think not)\n* what efforts every person in that household has made, to pay their rent, manage their money, and not get evicted\n* what benefits or resources are available to that household that haven't yet been tapped (like...what are they doing with THEIR stimulus cheques?)\n\nYou know NONE of this information. Bet your man doesn't either. So you can't decide if this is a case of true need greater than your own, or a brazen shakedown.\n\nIf they're gonna use you two as a Bank, they need to provide full and truthful disclosure of all their finances. Do you think that's likely to happen, OP? Would you be comfortable refereeing that discussion between Mama and Sonny?\n\nAlternately, would you feel okay about saying to your man \"*If you give her your cheque, I will stop paying into your commissary...and start paying off my debt I incurred for you. BTW, you owe me $\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ for the full payments I've made for your comfort and support, to date.*\"\n\nNTA for thinking twice. Sometimes a drowning person doesn't just want a lifejacket... they want *your* lifejacket.", "NTA, but honestly, the only real control you have over this is whether you keep paying this stuff, which you aren't at all obligated to do. While it sucks that he needs help and I'm not going to opine on whether he deserves the jail time or the financial struggles, you're not personally responsible for helping him now or continuing to help him later, whether he deserves the help or not. Drawing a firm line around what conditions you are and are not willing to keep funding him through is worth doing for his sake and yours. \"I can support you, but I won't support your family\" is a completely valid line to draw.", "Why are you still with him? From your comments it seems like this will be your life from here on now. I would ask him to keep his cheque to pay off his debts and then just stop everything. He is not a person to build a future with where you will always have to pick up his slack.", "NTA.. honestly your boyfriend is lucky you’re even helping pay his commissary and restitution.", "NTA I can understand why he want to support her but in the end it isn't your responsibility to keep him afloat and setting that boundary also helps you.\n\nWhat would happen if you break up?You go in the Red don't ever see the money getting returned and need to worry how to come by.\n\nIt sucks but you also need to take care of yourself,and don't work as piggybank", "NTA for your concerns, but frankly it may be time to cut off your financial support of him. Right now you are enabling him to give that check to his mom. If he had to choose between giving her the money and having that as his only spending money,  he might be thinking differently.", "Am I the only one wondering about the stimulus check? In the past few years because of the pandemic, the federal government sent out stimulus checks to a lot of people, but that program is over. How is a guy in prison getting a stimulus check? How much is it?", "NTA tbh. But you may wanna stay off the subject and see what he decides to do, and you get to decide from there if he's worth the trouble too.", "NAH For voicing opinion but his money and he can do what he wants.  Perhaps stop supporting him with commissary to the detriment of your own life and paying his restitution.", "ESH. The only thing you control is how much money you give your boyfriend. It’s not your job to pay his bills & it’s not up to you what he does with his stimulus check. \n\nI think you’re being taken for a ride here. You’re working 2 jobs & going into debt to pay your boyfriend’s debts. Your boyfriend. Not your husband or even your fiancé. What’s he doing for you? Will he ever pay you back? Your best move would be to stop sending money  & see what happens to your relationship then.  In any case, only send the money you can afford & stop working 2 jobs & going into debt to help someone who sounds like he cheated or stole from someone else and ended up in prison for it.", "YTA for telling another adult what to do with his money. Now I, an adult, will tell you what to do with yours. Ironic. \n\nStop paying his legal and moral obligation for restitution. How in the world will he have any consequences if you make restitution? \n\nIf I may say so, funding his commissary account is second priority behind YOUR financial security. Two jobs and you’re still going in debt? He gets “three hots and a cot” by law. He doesn’t need your money. His stimulus check can cover toothpaste and such. \n\nHe has more of an obligation to pinch pennies and help his mother than you do.\n\nPlease, OP, respect yourself enough to be independent and debt free.", "NTA - One of the best pieces of advice I was ever given is to never make decisions for someone, but to be very clear on your own limitations - this means not pandering and making sacrifices for someone else's decisions. \n\nCurrently, you are effectively paying back his restitution for him.  This is putting you under financial stress.  He now has the money to pay it back himself.  Therefore you no longer will pay for it. If he wants to help his mother, he should be the one to suffer the consequences of it, not you.   Otherwise of course he is going to help his mother, he won't be loosing anything. \n\nCalculate how much commissary he would need each week if there was no restitution, and say you will pay that.  Then the decision of what to do with his money is his, and you are no longer under financial distress. If he has an issue with this dump his ass.", "NTA\n\nI think you are being so supportive and generous doing all of this extra work to earn the money you are not able to use to help yourself out of your situation. \n\nI personally think you should stop supporting either of them. They are both adults and need to be able to sort their own situations out. An idea or your partners stimulus check if half for him and half to his mother which at least reduces both issues. However, she obviously needs some sort of support to help her with her financial situation.", "NTA.  You cannot give money to another household in a responsible way if your household has basic needs that are not being met.\n\nMIL should work two jobs and go into debt to pay her housing, just like you have been doing to support your husband.", "YTA ESH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, my [27F] boyfriend is in prison. He comes from a low income background and his parents have always struggled for money, so ever since I went in, I have been supporting him financially, working two jobs and going into debt. He owes a small amount of restitution for his crime, which means out of any money deposited in his commissary account, 70% gets automatically taken away to pay for it. So basically for every $100 I send he gets $30.\n\nHe is expecting his stimulus check, which would cover the full amount of restitution that he owes, but his mom has asked him to give it to her as they are several months behind on rent and she is worried about losing the house.\n\nAm I the asshole for telling him he should not give it to her? If his restitution was paid off, it would ease a huge financial burden off me since I wouldn’t have to send in x3 the money that he needs. I understand she’s struggling, but she was never a good parent, and her getting that check would cost ME thousands more dollars down the line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA. I have no idea why you're sending him money but just be clear with your bf that if he will send that money to her mother, you would stop supporting him. Be firm on that because you are already in debt.", "OK if they automatically take 70% of anything deposited in his account what makes your BF think they won't take 70% of his cheque?  They don't really send a cheque do they?  Even if he did get a cheque it would need to be deposited and then see first question.\n\nAlso have they said that prisoners will also get a cheque?  There are often exclusions in these things.\n\nPerhaps everyone should wait until he actually has the money before spending it.\n\nNTA OP but I think you should seriously reconsider going into debt and only send what you can afford after your own bills are paid.", "NTA.  I’ve read your edit and I really hope you stick to it.", "NTA. Not your place to pay BF restitution. When he gets out, he gets a job and does that. If you stop paying will he dump you? If he's willing to give his mom a check. That pretty much shows what your future with him would be like.", "If he's your boyfriend, she's not your MIL", "NTA, let me ask you this. Would you go to prison for him? It's his crime, his restitution. Stop paying his debt for him, it's part of his sentence. Either way, stop paying for his actions. Use the cheque to pay of debt. If he gives it to his mom then that tells you all you need to know.", "Trust me I am not paying it bc I want to, the state takes it out of any money I send him. And yeah I could stop sending him any money but if you knew how bleak the conditions were in there, there’s no way he can make it without supplementing his food and clothes with commissary.", "HE is worth it to me. His family isn’t. I don’t even like them. His mom is a bigot and a religious fanatic.", "That’s so well put, thank you!", "Facts. I think the scary thing here is that she’s saying they might get evicted.", "Honestly, I am a little worried about the precedent that it would set. I don’t see his parents ever being in a good place financially, and it’s gonna be hard for us to build our wealth if we’re constantly being guilt tripped into helping them.", "Wow thank you. I am going to use all of these points next time I speak to him about it because you have put into words everything I was worrying about.", "And think about this angle too: He's using taxpayers' money to pay restitution for a crime against the peace and dignity of society. Not his money. Taxpayers'money. Apparently he hasn't heard the pop yet.", "He still hasn’t received his, it got lost in the mail a couple times due to him transferring prisons.", "Yes, this is great! I’m not good with numbers but I will take some time with him to work out how much sending him money is costing me.", "I don't know what he did and frankly that doesn't matter here. The fact is that the restitution is a form of punishment. You are undertaking your bfs punishment, and for what? He wants to circumvent the system by sending his tax money, which is already spent (as someone below already stated this should be going towards the restitution as all his money is being garnished in order to pay for it. So this should as well to follow that logic) to go towards his mother?\n\nYou don't owe him a thing in there. The fact that you are says great things about you. But you are working yourself harder than normal just for things to be more pleasant in there for him.  IDC about him. I care that you are going out of your way, picking up jobs to take care of him, even when he's the one that got himself in trouble.", "Maybe don't send him any more money, then. It's sad but he isn't your responsibility.", "He's in those bleak accommodations because of his illegal activities. When he's released he's going to have a tough time finding employment so you will be supporting him financially then as well. You need to take care of yourself and pay off your debt. Stop sending him money and start saving for yourself.", "Ya it’s called prison. Move on.", "But are you worth it to him? It would be unfair of him to give away money that otherwise would make things easier for both him and you. Is he at least grateful for what you are doing for him?", "Then unless he's ready to cut off his parents trust me they aren't ever going away.", "You’re going into debt to pay your boyfriend’s debt, not his parents’ debt. The parents aren’t the problem. Your boyfriend is free to send his money to other people because you are paying your boyfriend’s bills.", "That's not your problem and neither is your bf's restitution..NTA but don't be a doormat to him or that family..I hope your bf plans on paying you back when he gets out", "You're supporting your deadbeat criminal boyfriend, you're never going to build wealth, your whole life is going to be like this because this is the life you want to live.", "I think the thing that has to pop here is OP's illusion that the problem is the mom wanting the stimulus money. OP is in so deep that they can't see their real problem is that they're sending money they can't afford to spend to someone in prison. I read that mom is trying to get OP to support her, too. I wonder where mom got that idea? Mom and the son see OP as an easy mark, and they're both trying to get as much money as they can out of OP.  The son is no better than the mom, but OP has too much invested to let themself see that.", "Are you sure it wasn't already taken for his restitution by the government? Usually restitution is court ordered and a lien placed on all financial transactions of the guilty party.  That's why they take from his commissary account. \n\nHe told you that they take 70% of the money you send him......did it ever occur to you to call the prison and see if that is the truth? Why would they give him 30% if he still owes?", "Yes, he’s very grateful and he works hard in prison tailoring clothes for other inmates to try and ease the burden on me.", "Tbh I have a feeling he would do it even if I wasn’t helping him and it meant he had to go hungry just because his mom knows how to guilt trip him.", "You may wanna stay off the subject and see what he decides to do,", "He’s not going hungry, he has food given to him in jail.  He won’t get extras or good food, but he will not starve.  You are setting yourself on fire to keep others warm.  You will soon burn out.", "NTA but girl get some standards for yourself.", "NTA. Ditch the loser and the loser family.", "NTA but why don’t you just get rid of the idiot bf in prison. Kill two birds with one stone and you can focus on yourself instead of paying for someone else’s crime. No man is worth that", "NTA. \n\nIt is a better financial decision for him to pay off the restitution with the check, because then he is debt free and every dollar you send him is a dollar he can use. That's just math, not in any way an emotional issue. \n\nIf his mother is behind on rent, one check isn't going to fix the situation. It is what we call \"throwing good money after bad.\" For example, if my friend lost their job and is starting a new one next month so is short on cash, I'm happy to pay their rent, because next month they will be good to go. If my friend simply cannot afford their rent on their salary, then me paying their rent one month only delays the problem, because next month they will be in the same position. The check is wasted on his mother, who will still be financially strapped with no long term solutions. \n\nTell your boyfriend very kindly that you cannot keep financially supporting him in this way, and the reason you had been is because it was supposed to be short term, until the check came to clear his debt. That you have already done enough for him, and that you cannot do more, so it is his choice what he does with the check, but you can't contribute the way you have been. \n\nAnd then, get your own finances together. Put yourself and your future first, no money ever to his mother, and decide if putting money in to this man is worth it. I'm not saying that because he is in prison, I'm saying that because you are 27 and already dealing with debt that isn't yours and putting your own financial health at risk. Don't you want to go on vacation? Upgrade your car or your mattress? What are your future aspirations and how does staying in this relationship help you get there? What's going to happen when he gets out, and how does his future align with what you want? Put.Yourself.First.", "NTA\n\nBut if you stay with  him be prepared to always be supporting him, in and out of prison, and supporting his entire family. Once you start this path it will not stop until you leave them. Even then they will still be calling you because they knew you are an easy mark at this point. This is coming from a place of having dealt with this for years thanks to a younger sibling who has been in your shoes. Even now, 5+ years after being deported their significant other is STILL calling asking for $$. Not as frequently now but damn.", "NTA but I think you are gullible. What an earth are you doing? Unless you directly benefitted from\nthe said crime or are directly involved you should not be paying anything. Neither he or his Mum are your responsibility and you are clearly being used. You only have one life and at 27 years old is this the life you want for yourself going forward?", "You never signed up to support an adult male in jail for a crime he committed. Nope. His actions come with consequences, it is not your responsibility to make his life any easier by paying his restitution.\n\nThe only one who you are responsible for is yourself. The only one whose actions you are responsible for are yours.", "NTA there’s no guarantee that would even prevent eviction. They could just get behind the next month and get evicted anyway. Sounds like the family collectively makes bad decisions, and you’re limping yourself in there by giving an inmate money for his restitution. You are bearing his legal consequences. And getting nothing in return, save for some sweet meaningless words.", "NTA and girl, what the hell are you doing? Supporting a man in prison whose mom is a leech?   You aren't married to this man and you aren't even getting any dick and I'm betting you are young.  \n\n Ever heard of don't set yourself on fire to keep someone warm? If not, think about it and carefully consider your option to get the hell out of this.", "Everyone is thinking it, but you don’t need this in your life. Go out there, get on with being successful on your own. Don’t be taken advantage of. This is a fork in the road. What sort of life do you want? Meet someone who can be mutually supportive.", "I don't know if he has a golden penis or what but you sound like you're throwing your life away on a convict and his loser family.  You're the asshole for doing that to yourself.  I don't know if you've convinced yourself that you're so deeply in love that this is what you must do, but maybe you need to talk to a counselor to figure out why you value yourself so low.  Stop sending money and see how committed he is to you versus you being his sugar mama.", "You didn't mention country, so I'm guessing the US.\n\nIf this \"stimulus\" or more likely, tax return is from the government, typically, the courts will intercept that also to pay for restitution. So the whole discussion is probably moot.\n\nI know this because my brother vandalized a house when he was a young teen. He didn't see a full paycheck or a tax return for about 20 years.\n\nIf you want a good future for yourself, you should probably find it with a different partner. Your boyfriend and his family seem like the type that will just continue to drag you down to their level. There is a reason he is in jail, and he is paying restitution because he financially (and possible physically) damaged an innocent person. Why would you be with the guy? Good luck.", "Bro break up with him wtf are you doing.", "The plan would be for them to take 100% of the check. It would cover the full amount he owes, so after that, anything deposited into his account he would get in full. So it would save me 70%.", "Thank you so much for your kind and compassionate answer.", "Then maybe he shouldn’t have committed the crime if he didn’t want to pay the time\n\nKudos to him for getting you to saddle his debts and punishment, plus taking care of his mom all while working yourself to the bone and going into debt\n\nTell us, how will he make this up to you? How will this impact his ability to get a job after or will he be leeching off you for the foreseeable future??", "It’s prison. The conditions are supposed to be bleak. It’s a *punishment*", "You’re 27 years old. \n\nYou are wasting away your life chaining yourself to a criminal. Now you want to support his family too? Come on. What’s next? His sister? His grandmother? His cousin’s kids need braces? His other cousin is pregnant and needs a crib? Where are you going to draw the line???", "build wealth.  that's cute.", "You will never build wealth with this man. He is a felon, which will significantly restrict all of his earnings in the future.  He has additionally learned poor financial lessons from his family. You will never climb out of the hole he has dug.  Do you love him enough to sacrifice all of your future stability for him?  Because that's what you're doing. And imo, no love is worth sacrificing yourself.", "NAH For voicing opinion but his money and he can do what he wants.", "No because I have been helping him call the IRS to chase it down and the letters come to my house. And I know they take 50% for restitution and 30% for court fees because I have read the CDCR title 15 section about restitution.", "The burden that *HE* put on you", "YTA - for paying his restitution. Sort of defeating the whole purpose of him having to pay for his crime if he can con someone else into paying it for him. \n\nGet away from this family!!!!", "Wtf is wrong with people these days. You are being used and abused. You are so NTA that you are TA by allowing people to behave like this. Why in the earth would you be responsible to give your bf money in prison for a crime you didn’t commit. Grow up and have some self respect.", "YTA…why are you paying for what your boyfriend did?  Let alone giving his mother money.  I sure hope that when your boyfriend gets out, he helps you pay off all of your debt that you incurred while trying to help him.  Also, if you have to amass debt to help him, stop.  He is a big boy.  He will figure it out.", "NTA - How long were y’all together BEFORE he became incarcerated? How long has he been locked up and when is his expected release date? \n\nI’m just wondering if we are looking at a grand total of $500 or $5000 or more. It doesn’t matter to me for a judgement, I just want you to reflect on how much money you are sending this man. How much money are you spending on phone calls, texts, and/or video chats monthly as well?\n\nAlso if you choose to send him money, you should save the exact same amount in a savings account that no one else knows about. If your budget allows $100, put $50 in savings and send him $50. I have a horrible feeling that you will need this emergency fund for yourself one day.", "Here's an idea--contact this bf and tell him some story (a plausible one) about how you can't send him money anymore. See what he says.\n\nGoing by what in my religion is called \"the intelligence of the meeting\" (meaning the opinions everyone has in this thread), he will test you at first. Then, seeing that his bank has closed, he will ghost you.\n\nI'm sorry if this is harsh, but you're simply being used by a criminal and his grasping mom.\n\nWorse--you will never be free of them. Grifters who meet a helpless victim never stop trying their cons on him or her. Never.", "ESH\n\nI'd easily change my answer if he cared as much about you as you do for him but the fact you are even having this conversation about the stimulus check and he isn't putting your needs first like you are for him is a no go. \n\nLike why is it ok for you to go into debt for him yet he won't do the one thing that will make your life easier and show you the same consideration\n\nYou are enabling him by not making him take the full responsibility for HIS crime. \n\nIf he doesn't 100% pay off what he owes with that money then you will never be his first choice in your relationship.\n\nThis quote fits here\n\n\"Givers have to set limits because takers rarely do\"\n\n   \n                                                           ~Henry Ford~", "This is the type of life you want for yourself?", "Why is it legal for you to pay someone else’s fines? Isn’t the whole point that the person who committed the crime pays? How is he going to learn anything if you are paying his fines for him?", "Girl, save yourself first. You can’t go into debt to help him. Be smart about it, if he loves you, he wouldn’t want you to mess up your life for him.", "NTA. It's his restitution and he should be the one paying it. You have no obligation to his mother", "NTA. \n\nBut I also think that you need to take a step back and seriously evaluate wtf you're doing with this dude. Don't you think you probably deserve better than this nonsense?", "NTA and she's not your MIL, she's currently your BF's mom", "Seriously think about ending this relationship and moving forward on your own. Hoping the best for you!", "NTA but why are you going into debt to put money in his commissary?! Isn’t that what work detail is for? Stop setting yourself on fire to keep him warm.", "Ok first NTA, he is your boyfriend,  not your husband, but even if he was its still not on you to keep his family afloat. Because of my nature I'm trying to figure out what kind of odd ass crime would have a restitution of 1-3k, but that's neither here nor there. Smart money would say assault. But here very soon you should take a deep look into your life and what is good for you. Your a Saint for sticking by him as you have been. But is this person someone u can build with? Is whatever landed him there an anomaly that won't happen again? Some people don't change, and if there is a chance he keeps imploding his life and visiting prison.....it will be hard to build anything real with him.", "NTA for what you're asking judgment on but YTA for paying for your boyfriend's own problems. You shouldn't have to financially support your boyfriend in jail and help him fix his mistakes. That's his responsibility.", "ESH. \n\nYou suck for staying with a jailbird and supporting him financially. Your boyfriend sucks for being a jailbird...and your boyfriend's mother sucks for being a leech.", "NTA. And not only is his mom taking advantage, so is he. Girl - grow a set and realize you can do better. He messed up and YOU are footing the bill? That’s absurd.", "YTA, you are borrowing money to support your BF. The rest of the post is just bla -bla -bla.", "Why on Earth are you paying restitution for somebody else? did you commit the crime? Not your responsibility stop it. And honestly his family asking for the money that's wrong too. Here comes time when you need to look out for yourself. ESH.", "I'm sorry, are you telling me that people in prison got stimulus checks?!", "So your money goes mostly to restitution and his money goes to his mom? NTA. That’s not right. Let his stimulus pay off his restitution, then any money you send goes to him. Let his mom figure out how to support herself. You don’t need to support them all and go into debt doing it.", "NTA - I won't get into how cruel the prison system is, or any of the other social issues tied up in your question.\n\nYou're absolutely not an asshole. But can you get other support for his mom? Beyond his check, are there other community services such free legal advice, supportive housing, loan forgiveness programs you can connect her with? \n\nThe reddit loves to see things as cut and dry but the truth here is there is no 100% good option. You are in a desperate situation, your bf is in a desperate situation, and his mom is in a desperate situation. Do what you can to help her, without hurting yourself.", "Man, women be out here just accepting anything.", "NTA, but.\n\nI hope you can see why people are reacting the way they are here.\n\nWe don't know the full story. I want to urge you to share the full story with a close friend or family member and get a sounding board as-to-if you should stay in this relationship. It is a very reasonable question.", "NTA but I think you are making this more complicated than it needs to be. You don't *need* to send him more money than you can comfortably afford, especially since you're not even supporting him with it but effectively paying off his restitution. There are plenty of people in jail/prison who aren't getting any money from outside, and although it makes their time harder, they survive.\n\nDecide what you can comfortably afford to send and tell him you'll be sending that much. Then, he can decide what he wants to do with any other monies he may have access to. \n\nThat said, I don't think keeping his mother in the family home would be a frivolous use of money, it's just unfair for you to be asked to pick up the slack. Let him make his own hard choices.", "He may not be able to send his mother the tax money. Most states automatically confiscate tax refunds be they federal or state.", "NTA but not very smart either.", "NTA but if he does give her the check, I'd break it off with him and stop sending him ANY money.", "Also the dude might have written an old girlfriend with a sob story and then s collecting from her too.", "There has been a couple times already where I was not able to send any money. He simply told me not to worry and to focus on myself, and he stretched out the food he had till I was able to send more.", "Because legally that's not what's happening. He's being given money and it's being garnished.", "That is how the corrections system works in California. I am not “paying his fine”, I am sending him money, and the state intercepts 70% of it.", "Hi,\n\nYou're kind hearted but possibly naive.\nOften times in my family, when people were going to be evicted it was a long term issue.\nThey were either not working or spending all income in wrong places and when they needed help, they acted like it was only one time.\nBut they would be making poor choices forever and needed your help every month of every year while saying just this once, I will pay you back, it's not my fault.\n\nSometimes unfortunate things come up like someone loses their job or has a huge medical bill to pay and they can't make next month's rent but that's something you can assess by knowing their life style and behaviors.\n\nWhen you lose a job and can't make rent, you job hunt non stop and accept any job, regardless of how much you dislike it.\n\nI bet you can relate to this because you're working two jobs, sacrificing your wants, your sleep, your health, your needs.\n\nIf you expect this of yourself then expect it from others.\n\nIf they cannot because of physical or mental health issues, then they have to live within their means by downsizing, getting roommates or moving into a care home.\n\nCan they not pay rent just this month or every month? \nWhy can't they pay?\nWhat else are they paying for?\n\nYou will be their free money for life, not to get a leg up but so they can continue lazing about and doing as they please.\n\nI recommend you work one job and send your boyfriend only what you can budget, if that's only $50 a month and he only sees $5, then that's all you have.\n\nNothing stopping his family from working and helping him.\nNothing stopping him from using what money he receives more wisely.\n\nHe did the crime, this is his consequence to pay, he isn't going to starve.\n\nHe also isn't going to learn a lesson if you pay his restitution because if he goes back in, he expects you'll pay it again.\n\nIf I was in prison, I would not allow my boyfriend to work two jobs to pay for me and would not allow them to pay a dime to my family.\n\nIf you make healthy choices and work hard or do the bare minimum and work any basic job, you deserve to keep your earnings to help yourself get ahead.\n\nAlso reading your comment that he could use his cheque to pay off 100% of his restitution but wants to give it to his mom would mean I would 100% cut him off from any of my money.\n\nHe doesn't care because none of this affects him, either way, he expects you to pay 100% of his restitution and commissary needs.\nHe is 100% using you and would rather see you in debt, no future stability, overworked and sick.\n\nI expect if you were in prison, you would recieve nothing.\n\nYou deserve 100% better.", "And?", "My best friend was like you, put money on her mans books stayed loyal all through his sentence. \n\nWhen he got out he stole her car and went to a bunch of parties upstate where he cheated on her. \n\nDon't waste your time, love.", "It's supposed to be bleak.  It's prison, ffs.  Stop paying for his crimes.  You're worried that his mom is trying to take advantage of you?  He's the one that is actually taking advantage of you.  Wise up and move on.", "Jail/prison sucks trust me I know I've been there.  But you can absolutely survive without getting money on your books and commisary.\n\nY t a to yourself but NTA at all for what you asked.", "Stop sending him money he can get an in jail job for commissary. It is still not your responsibility. You are hurting yourself and your future by doing any of this.", "Edited to add: NTA\n\nWhat state? I work in a prison (CAVEAT: I KNOW THAT EVERY PRISON AND EVERY STATE IS DIFFERENT) and if I had a dollar for every time one of the inmates complained about how cruel and inhumane the place is, I could buy a new car, cash, and I've only been there a couple of years. OF COURSE they're going to whine about how awful it is. They can't go buy the latest fashion jeans and kicks. They can't drive through McD's. They can't come and go as they please. They can't get drugs and alcohol and sex. (I'm not saying everyone in there wants nothing but these things. But having free access to them sure makes life.... easier? More fun? I'd be bummed if i wanted a drink and couldn't have one. And I rarely drink.)\n\nBut they are provided 3 balanced (if not super delicious) meals. They are provided clothing, albeit not expensive or fashionable. They are provided recreation time and jobs (Yes, they aren't paid much... they are working to pay for housing and feeding themselves.). \n\nDid you know they can buy TV's and tablets, and music players? If not, common areas often have TV's, cards, games, etc. \n\nOP: you're enabling him. Sure, send him money.  Make his life a little easier. But girl, he committed a crime, and you're going without so be can... what? Buy oatmeal pies from commissary? It sounds like he's the one in prison, but you're the one suffering. He wants you to give that check to his mom because he knows that you're still going to break your back to give to him and give to her. Let him suffer the consequences of what he did, and maybe he will turn his life around and get out of prison and contribute to your household instead of ... being in prison. \n\nI AM NOT TRYING TO BE A JERK. I'm not trying to bash anyone. I'm trying to tell you that YOU are taking the brunt of his punishment, and that's not fair to yourself.", "OP, people are being really judgemental without even knowing what your bf did. I don't think you're wrong for trying to add a little comfort to the life of someone you love. Prison sucks either way, a few bucks for the commissary isn't gonna make him think \"this is great I love crimes\" ffs.", "Except that a lot of prisoners do survive with nothing, or very little, in the way of outside funds. \n\nYour heart is in the right place, but this is still an unfair and unreasonable burden for you to take on.", "Sorry but I’m laughing at the idea that you’re going to build wealth. \n\nThis is as good as it gets. \n\nHe’s going to be an even bigger drain on your resources when he gets out and you have to fully support him. I bet he gets you pregnant immediately to solidify his free ride. You’ll be working 2 or 3 jobs when he gets out and he will give away your formula money to his mom so you have to work even harder. When he gets a feeling that you’re getting fed up and close to leaving, there will be another birth control failure. \n\nThis is a cliche for a reason.", "He is in prison , you will never have wealth, give up on that concept if you stay with him.", "The precedent is set. This is a well established pattern with him and his parents, and is not going to change based on his current thinking and responses you described. \n\nIf you continue supporting him and stay with him, he will continue to expect you to support him and his family. If you want to build wealth or financial stability, your path forward is to leave him and his family on their own and find someone who actually has goals and behavior patterns compatible with yours. \n\n(And, this is before even considering his felony, which means he will have to work many times harder for the same results as a non felon. There's just no way he's going to overcome the disadvantages of being a felon while his patents are also draining him and everyone he has access to dry.)", "I can see by your replies that posters are just whistling down the wind. You won't listen and you won't change until you break down in the harness. Sad, but there it is.", "Tell him you will be reducing what you deposit by 70% once the check is deposited. If he wants to give his mom the money that's his choice but he will have to make due with less money in his commissary account.", "That’s an awful lot of money. You’re the same age as my daughter. I’d hate to think of her supporting a boyfriend financially in that way. What would happen if you stopped sending the money?", "So 70% of your money is going straight to the state and paying for his fine?", "I don't believe most Redditors truly understand the poor conditions people who are incarcerated have to endure. \nUnlivable in many cases. My cousin was incarcerated and I would not wish his treatment on my worst enemy. \nIt would be hard to see someone you care for in this situation and not do whatever possible to help.", "Your not wrong. But OP shouldnt be putting themselves in debt to provide for their bf either.", "Thank you 😭😭😭", "this is probably the best solution yeah", "Sure, not wading into that debate. Just sad to see the comments saying \"well he shouldn't have done a crime\" and \"yeah prison is supposed to suck\".", "You shouldn't be paying the consequences for his crime.\nThat's the whole point of prison, he's not supposed to be enjoying it.\n\nI hate to say it, but I can see you making excuses for him for many years to come.", "50+30 is 80. Let him play for his own crimes.", "Exactly this. There are absolutely people in prison who don't have anyone to send them commissary funds, and they get by. Don't get me wrong, I do have sympathy for the thousands of people who are part of the school to prison pipeline and take issue with how our prisons are run as essentially legal slavery. That being said, it's also not in the prisons' interest to starve its slave labor. He will get what he needs, even if it is just barely.\n\nAt the end of the day, there is no commitment here, OP. This is not your husband. As a convicted felon, I'll tell you right now you are likely going to be doing Exactly what you're doing now, supporting him AND his family, for the rest of your life if you do choose to stay and become his wife. You need to really take a hard look at what your life is like now. You should seriously consider what his crime was and whether or not he made the bed he's in and will crawl back into the same when he's released. Some prisoners reform, and some do not. Just make sure you're looking at your future before you spend your present burning out for someone else.", "I wish I had an award for you. Exactly and well said. He's not going hungry unless he chooses to.", "Sorry, meant 20.", "Omg RUN from him and his family! ASAP! \n\nHas he saved your life or done something so big for you that made you forever indebted to him? Or has he been wrongfully convicted? (Thinking of the movie Atonement) \n\nIf neither is the case, please leave him. Seriously. Love is not the answer here. You will find many more amazing men who are not criminals and can support themselves financially.", "Your boyfriend is lucky to have you. He's not lucky to have his mother and to have been brainwashed by her. His mother is an asshole who puts herself first.\n\nMaybe put yourself first now since you're the only one who will.", "YTA for treating him like he should be at camp cupcake. 🤦🏾‍♀️", "Why tf are you paying for anything of his? She is not your MIL you two are not married. Cut your losses", "As someone who just lost nearly $100k due to a crappy boyfriend…take it from me, you’ll regret ruining your finances to help a deadbeat. They continue to take and take and take, and when you become the mean girlfriend who insists they be responsible, they find a side piece just as scummy as he is and tell you “you’re just not fun anymore and she does drugs with me”. Good times.", "Honestly do whatever you want the only asshole thing you could do is bring a child into this shithole scene so try not to", ">\"....So basically for every $100 I send he gets $30....\"\n\nLess actually. the fees are insane.", "Definitely NTA. You may love your boyfriend but if you want what is best for him you should establish this boundary too. It is simply not realistic for them to rely on you or anyone else. Please take care of yourself. If I were you, I would no longer send him money and work on paying my debts (which are actually his debts but still). So, you would still be doing something for him. It is not like you are wealthy and holding back - and even if you were, that would still be a valid thing (and possibly the right thing) to do. There are many comments here with great advice, I wish you the best. Please look after yourself. You are not responsible for other people. Do not let anyone guilt you. If your boyfriend loves you and wants the best for you, he will understand that you are overworked as it is.", "NTA about your question but you are shouldering too much as a girlfriend. Drop this and get on with your life, this multilayer hot mess is not something you deserve.", "Nta but what the hell are you getting from this relationship besides stress and debt? Not even dick!? I mean I can send you some letters and you can send me money too!", "NTA but why tf are you going into debt to pay his debt? And in what backass country do you live that he needs your assistance but 70% get's taken away? That doesn't sound like a civilized country", "NTA- why on earth are you working yourself to death paying off someone else’s debt? And debt that is literally a form of legal punishment none the less? You are being taken advantage of by a lot of people here. Sweetheart please stop wasting so much of your time and hard earned money you are putting *yourself* in debt to pay of some losers criminal fees.", "Restitution is what he has to pay to his victim.  Doing  so and the hardship it imposed on him is important in making him realize that damaging others will cost him.  It is a deterrent to his criminal behavior.  You should not pay it for him.", "NTA: but is a situation I like to call a “get out”. Unless his mom is disabled she should take initiative and figure it out herself and is she putting money in his commissary? If he was the bread winner they should have made a plan for the future. He’s being spoiled rn. He has a bed and food he can survive without some money. I’m so serious you acting like he’s gonna die from starvation in there.", "Stop supporting this family.  He’s not your husband.", "NTA for not helping her out, but Y-T-A for helping him.  He committed the crime and he should be working off the restitution, not you.  Depending on where you are, that stimulus check may go directly to the government for disbursal or he may not get it at all since he is a convicted criminal.  Don’t count it until it is received.", "She will never. But I love him/s 🙄 she's in too deep. She's dreaming of the wealth they'll build together once he's out of prison 😆 those rose colored glasses are strong.", "it seems like thousands of dollars which is odd. Maybe it's a refund and not a stimulus thing (if he was not in prison and worked last year).", "With two jobs et al it reads more like slavery considering she's paying his debt to society, buying him treats and getting SFA in return. This is financial abuse.", "That is in no way your problem", "Yea you’ll build wealth when he gets out since everyone knows there are abundant legal, lucrative job opportunities for felons. /s", "This is the best it is going to get with him. You will never build wealth together.", "Please do, seriously, ask a friend for help if you can't do it yourself. We don't hear much about financial abuse but it's a very real thing and your story qualifies. If you live somewhere where healthcare is available unlike the US possibly you could speak with a social worker or the like and figure out why you are prepared to do so very much for him or his family for zero returns whatsoever. NTA but I'm worried for you as many others are on here clearly are too.", ">HE is worth it to me\n\nExplain his worth. Just keep in mind I don't believe \"love is enough\". You can love lots of people without hitching your wagon to their trains. What is he really bringing to the table that enhances your life? Also, it appears that he's the \"marry me, marry my family\" type of person so you will absolutely be supporting her even when he gets out.\n\nI just don't get this. He's being in your life has brought you nothing but misery. You can love him, let him go and build a life for yourself.", "actually 50%. You said it was 50 for restitution and 30% for fees. Those fees won't go away.", "You are paying his fine. He will not pay you back.", "So you are paying his fine. Not sending him anything is also possible.", "You know he gets fed three meals a day in prison, right? He doesn’t need to stretch out his food. You’re paying his restitution and for his extras and I wouldn’t be surprised if he’s got a few honeys on the side doing the same thing.", "Of course he did, because of the promise of money in the future. Just say \"I can't send any more money\" and then just don't. Get yourself solid first. I mean, how close are you to losing everything? Lets say you lose one job or, god forbid, get hurt and can't work for a while? Are you going to be okay? Who would take care of you?", "To quote the reasoning why most European countries have better prison systems \"the punishment is to take their freedom, torture is illegal\"", "I mean, That's all well and good but he's getting enough money to pay off the restitution that the OP is \\*currently\\* paying and is telling her to not use it for that. Instead he wants \\*her\\* to continue paying it off and letting the OP suffer. the OP is being an AH to themselves.", "Indeed. Given everything we know about the justice system in the US (from murderous, incompetent cops,  through a court system stacked against poor offenders, to a prison system that is essentially legalised slavery), I am amazed at how many people are falling back on lazy tropes about prison and its inmates here. Holy shit, guys.\n\nThere was a good BORU post today illustrating how rich people get to stay far away from prison for far from minor crimes. Let's not pretend anything about this set-up is just or fair.", "It doesn't get better.  It gets WORSE.", "Yes, but he's choosing to give his mom a big check because he knows OP will send more money.", "> I would not wish his treatment on my worst enemy\n\nI don't know, there are horrific people that probably deserve that treatment, but yes we are very close to, if not already, violating the \"cruel and unusual\" guarantees in the law.", "Maybe he shouldn't have gotten himself in that situation in the first place. Don't do the crime if you can't do the time. It's not a country club, it's a punishment.", "Exactly was going to post something similar. Most people here have no idea how absolutely horrible conditions are with no commissary. You don’t even get deodorant; in many places no soap even. And then people treat you like shit because you stink.", "Yes, exactly. Though I'm resigned more than surprised.", "Are you even certain you’re the only woman he’s conned into paying for his crimes, prisoners have been know to keep multiple partners to fund them while inside.", "INFO: Why are you sending him money? How long is he in for?\n\nIf you must keep helping him, definitely cut it by 70% (that's not on you), AND end the time you'll be helping him to the amount the restitution would have covered. Don't keep sending money when he would've paid it off had he stuck to the plan he had with you (unless you promised to keep sending until he is out...hope not).", "I hear that and to clarify, I do not agree with him giving his check to his mom.  The point of my comment was in regard to supporting someone's commissary, which many people take issue with in general on this post.", "I would simply share that  public data shows that only about 30% of the incarcerated population have been sentenced for murder/rape/manslaughter, which I'm assuming you are referring to as those \"deserving\" of this treatment, which I personally would disagree with. \nOur prison system has far crossed the line of \"cruel and unusual\" punishment.\nAnd again, they are supposed to be \"correctional\" facilities, aka rehabilitative facilities. Not abuse centers.", "Interestingly enough, our family used to say our cousin was at the country club when he wasn't at family events due to his incarceration.\nAlso, people make mistakes. Even terrible mistakes. For many reasons. That should not default to a life threatening punishment.\nIsn't the point to be rehabilitative, to reintegrate people into society?", "He should definitely stop to leech of OP but there are very few crimes that deserve the torture people get in American prisons", "There's a difference between rehabilitation and coddling. I have an Uncle retired from the federal prison service, you'd be amazed at what inmates have access to. Female inmates have a visiting esthetician. That's not acceptable for someone being punished for crimes. Would be different if it were a vocational program, but it's not, it's a service they get access to.", "The treatment in American prisons is light years ahead of most other countries prisons. Try doing time in Mexico or the Middle East. It's a whole different type of barbaric", "“Female inmates have a visiting esthetician.”\n\nLmfao NO THEY DO NOT", "Ok, copaganda", "Grow up. Daddy Bernie isn't going to be able to save you for the rest of your life. Move our of mommy's basement and do something with your life, loser", "NTA - also, you aren't married so you don't have a MIL. At some point you might want to sit down and figure out what is best for you. It sounds like you are in a very bad situation but it might be self inflicted. He is gaslighting you by saying you are heartless while you are supporting him. You should tell him you would be brainless to support his family.", "INFO: My ex-BIL was behind on child support so his stimulus check was redirected to pay some of his arrears. Are you sure he's going to get his stimulus? And if he does, how does it get deposited?", "how long were you guys together prior to his incarceration?", "NTA But you are being one to yourself by letting yourself get used like that from your bf. Stop paying for his crime and protect your wellbeing.", "WTF why are YOU the one sucking up and struggling to pay restitution on a crime you didn't commit?  It's clear his whole family sees you as the piggy bank.  \n\nI hope he's worth it.   \n\nNTA but a sucker.", "Take this advice for what it’s worth: Stop paying for your boyfriend’s mistakes. You’re not married and you have no obligation to him to do so. He needs to figure his own shit out, because the more you help him the more he’s going to rely on you. You definitely don’t sound like the type of woman who allows her man to walk all over her, but that’s what he’s doing. Maybe just my two cents, but I also speak from experience.", "Info: how good is the D that you aren’t walking away from this?", "NTA but you're something else... Stop paying for his crime by stopping sending him money and pay off your own debts!", "The amount of people I've known and seen (particularly on Judge Judy lol don't judge me) that pay for someone else's crime like they're parole fees, bail, restitution astounds me. It's part of why some people don't learn. They're never held truly accountable. \n\nAnd then for him to want to use his stimulus check to fund his mom who cant get her own shit together? When you're having to work 2 jobs? No. He better not. He better use it to pay YOU back what you've put in and then pay the rest off himself. He isnt learning anything, OP. He also needs to tell his mom to back off and stop asking you for help. \n\nAlso if it were me, I'd rethink being with someone like this. He fucked up and is letting you take care of it and I guarentee when he is out he won't pay you back. And you also need to stop being so kind and helpful and start looking out for yourself. You're struggling to pay off CC. Ruined credit will set you back so far and you don't deserve that. You sound like a hard worker, working 2 jobs. What about you? What about your life? Your wants, needs, comforts? \n\nWhen was the last time you were able to do something for yourself instead of worrying about a guy who couldn't behave and landed in jail and worrying about money and debt? When was the last time you were able to do something for yourself? You deserve more. A lot more. \n\n\nConditions in jail arent supposed to be a resort, OP. He is in there because he chose to. He doesnt like that the food sucks? That the outfits arent comfy? Then maybe he should get his act together. He is in there because he messed up. Whatever he did wrong, he KNEW what could happen. Who cares if he doesnt have money on his books. stop it. Seriously. stop running your life, credit, sanity into the ground for him. stop letting him make you feel bad for his choices that he WILLINGLY made.", "This is why you don’t take on this man’s debts.\nIf he goes back in prison - and statistically speaking that’s an at least reasonable possibility - then what? You’re back in the same hole…with no $$$.", "You don’t know what the crime is. People can be falsely accused or locked up for really small crimes because of strict laws. I don’t know what race OP’s boyfriend is, but it’s also important to remember these laws are often specifically targeted against people of color and that they are disproportionately incarcerated and punished. The same often goes for people in lower socioeconomic standing.\n\nAnd the fact of the matter is, we hear horror stories all the time about how bad prison conditions are. OP is sending her boyfriend money because she cares about him and has decided that it’s appropriate for her to do so. Without it, it’s very unlikely that he would have access to basic hygiene products, which is obviously very bad for his health. So she’s sending him that money and they take 70% of it. That sucks. But I think blaming. OP when we don’t know the nuances of the situation is unfair.", "I about threw my phone and screeched. \"Sometimes a drowning person doesnt just want a lifejacket, they want your lifejacket\". Bejdkdlalwnfkwknzbciejwne. (Only proper way to describe my feelings lol). Yes. Yes. Million times over.", "YOU might get evicted if you keep spending money on them but they don’t seem to care about that.", "and what happens when that check runs out? Will she be able to pay her rent or did you just kick the can down the road a bit?", "You are paying it because you want to.  And that's okay, you don't have to defend how you spend your own money.\n\nI know what the conditions are like in prison, but he could survive without the commissary.  Many do.  You just don't want him to go without the little luxuries.\n\nBut don't set yourself on fire to keep him warm.", "Have you never done anything illegal? Jay walking is illegal. Using weed, in many places, is illegal. Pirating a movie, speeding, underage drinking, gambling, sharing streaming accounts with people who don’t live under the same roof as you? All illegal.\n\nDo you believe every single person who’s done any of these things should go to jail? And if you do, do you think that because of their crimes, they shouldn’t have access to things like deodorant or tooth paste? Proper nutrition?\n\nConditions in prison are known to be inhumane and bleak. Earning money in prison, from what I understand, ranges from difficult to near-impossible. I’m not saying I know what I would do in OP’s situation. But you are coming down incredibly harshly on OP and her partner without the full story.", "He's paying restitution therefore he stole something not belonging to him. He's doing time because it was a significant sum of money. OP is working two jobs and racking up credit cards because of her boyfriends actions. Why should his legal troubles put her into debt? I'm telling her to value herself. You're minimizing his crime. All offences you listed do not warrant hefty jail terms. You'd get a fine and slap on tye wrist. In some instances charges would be dropped.", "And this is the stupid ass attitude that gets us the highest recidivism rate in the free world.  If you aren't planning on locking someone up forever you have a vested interest in making sure that they come out an adjusted/agreeable human, or you have to dramatically increase the certainty of being caught for crime - certainty of being caught is what deters rather than harshness of prison/sentence length.\n\n&#x200B;\n\nYour stance feels right, sounds right and emotionally makes sense.  The trouble is, the facts suggest that following your opinion is the cause of the current crim justice shit show.", "Oh, he’s hungry. He’s not technically starving, but he’s really fucking hungry. \n\nSome states are better than others but they keep you *hungry.*", ">Isn't the point to be rehabilitative, to reintegrate people into society?  \n\n\nNot in the USofA it isn't.", "Theoretically yes, but practically, no, you are correct.", "Jesus you’re not worth a velvet painting of a whale getting it on with a dolphin.", "Not being the most horrible in the world doesn't negate being horrible", "Who's Bernie?\nI own my own home.\nI see you, troll.", "Why are you with someone in prison?  You need better life goals.", "Restitution is about your boyfriend paying back for harm he caused. You struggling and paying that makes you kinda an ass hole. NTA for not paying for mil", "NTA: For starters, that is NOT your MIL. Second, this will NOT be one-time help, and the amount of money it would take to reverse a possible eviction would require a 3rd job on your part. Third, if you do this, it will open a floodgate of requests for other things they think you should pay for. That check belongs to him, go ahead and let HIM settle his restitution and YOU stop paying for it. Also: You’re doing wife level duties for a man you’re not married to. What happens if he gets out and decides to break up with you? You’re absolutely right- you did NOT sign up to support an entire family and if unfortunate things happen to them because they made a series of poor financial decisions, that is NOT your cross to bear.\n\nAlso: What, exactly, do YOU get out of this relationship? It’s very clear what you are GIVING of yourself but what benefit do you get?", "I’m sorry for his parents but you are one supporting him if anyone should get help it’s you. Why are you supporting him btw.. and why would you continue if he gives what money he gets to his mom..", "Why are paying for your boyfriend again? Tell your boyfriend every penny he gets from you should be considered a loan. That will be paid back. STOP paying.", "Girl why", "Nta", "Maybe just... don't? Don't do any of this. Don't pay *his* restitution, don't bother yourself about his mom or his stimulus check.\n\nYou can always just nope out of any relationship, and this seems like the time to do so. Everyone wants to take advantage of you and there's nothing for you in return.\n\nHaving loved someone doesn't make you responsible for them forever. You can care and close your wallet to these games.", "Whew! That last statement is EVERYTHING!", "He may have been incarcerated during the pandemic and been eligible from previous years’ income.", "Here's some [deets](https://interrogatingjustice.org/prisons/prisoners-stimulus-checks/). \n\nRight now, it's not Stimulus payments but Recovery Rebate Credits.  People who didn't get the Stimulus can qualify for the RRC.  If BF didn't get any of the three payments, then he could get the RRC.\n\nMind you, he may might not get the check, if he owes a non-tax Federal debt.  It'll get offset.", "The state doesn't care they just want their money so either it comes from the inmate, relatives, gofundme, whomever.", "Unfortunate? Yes. But not your sleigh, not your reindeer.", "Because she's been slacking on rent/in a situation she, as a grown adult, hasn't seen fit to dig herself out of on her own and has seemingly relied on her son/you to try to get her out of it. This isn't one month of being in a hole. This is months of being in a hole. And if they get evicted, that's on them. Not you. Again, love yourself. All of your stress currently is related to financial shit that this person in jail and his family is hoisting on you. Think about that.", "If he was falsely accused OP would have mentioned it. Also, it's a huge leap to assume that the OP's boyfriend is a POC and is being unfairly punished. Fact of the matter is, her boyfriend did something bad enough to land himself in prison, and OP is working herself half to death to support him and is also overtaking his punishment.", "Not sure why this is getting downvotes", "But that means you are voluntarily paying his restitution because you’re not required to send him money. Hopefully when he gets out he will repay you everything he’s gotten from you.", "It's a prison and he's been ordered to pay restitution for a crime he committed and was found guilty of. It's supposed to be bleak. This isn't a vacation. Maybe you not giving him bailouts and running yourself ragged will actually drive home the severity of the situation he's gotten himself into and there won't be recidivism. Why are you paying for his shit? That's like giving him money that goes to child support for a child that's not yours. \n\nLove yourself, honey.", "Ya you and your deadbeat bf and his single mom will always be poor at this rate. You think you can build wealth with one salary between 3 adults ?", "OP, you're probably not going to build wealth. He presumably has a criminal record now. And who's to say that it stays at this crime and that he won't just commit some other crime once he's free.", ">You're kind hearted but ~~possibly~~ naive.\n\nFtfy", "I’m not assuming OP’s boyfriend is a POC. I said in the comment that I did NOT know his race. I was pointing out that that is true and something to keep in mind because it is information we do not know.", "I expected it to. It’s pretty anti-prison and that’s a stance a lot of people are hesitant to support.", "Yeah I used to be like that till my brother was wrongfully charged. He's still fighting it in court but there's not enough evidence either way, cops even had their body cameras off so even his defense lawyer is preparing him for the worst. It really opened my eyes to how easy it is to get fucked over by the system.", "[removed]", "Stealing property and sharing your Netflix password is not equivalent.", ">gambling, sharing streaming accounts with people who don’t live under the same roof as you? All illegal.\n\nNot illegal, at least not in the US.\n\nSome of the other things are either misdemeanors (pay a fine) and some of them are civil offenses (can't go to jail for that.)\n\nThe rest is just bullshit that doesn't apply to OP, are prisons awful? Sure and if OP wants to quit one of her jobs to push for prison reform she should. Did OP even indicate her partner is innocent? No because she knows he isn't. What she shouldn't be doing is throwing her life away for someone who will never be able to pay her back or be an equal partner.", "Remember that he's the sole reason you have to shoulder that burden in the first place OP. He decided to commit that crime.", "I’m really sorry. That sucks. I’m thinking good thoughts for you, your brother, and your family.", "I didn’t assume the guy was innocent. I stated that we had no idea what the context for his being in jail was and  relayed possibilities. “This thing is possible” is a different statement than “this thing is true”.", "My nephew killed someone when he drove under the influence on wrong side of the road, currently waiting for his trial, one of my cousins goes to visit him and told our youngest sister to send out mass text to family members asking for us to write him and put money for him to get extra stuff. All of us except for our cousin and youngest sister said \"Hell No.\"", "All I’m trying to do is have empathy. For both of them. Like it’s clear OP wants.", "They might not be comparable crimes, but that does them legal. I was responding to the commenter’s first sentence.", "There isn’t much of a way around it until the restitution is paid off since the money automatically comes out of whatever anyone deposits in the account and his work in prison, which she says he works hard at, is likely paid pennies an hour. She can’t help him get basic things like soap or toothpaste without depositing.", "There was nothing in the post that even hinted that he might not deserve the punishment he has received. You are bringing up extremely unlikely scenarios either to spark an argument or to feign moral superiority. Either way, it is not relevant to the question at hand. \n\nThat is why people are down voting you.", "I'm sorry if this comes off harshly.\n\nDriving under the influence is a choice, and I have little empathy for those that so choose to do so, nervermind someone that has taken another person.\n\nI would have very little empathy or respect for your nephew,and would not put any effort into writing or sending money because that would be   \n \"reducing\" his punishment.", "Some of the people that \"deserve it\" aren't even in prison. Our prison system is broken. It's run by the gangs, it doesn't do anything to rehabilitate. Its kind of a failure, but yes there are some people that deserve to spend some amount of time being miserable. \n\nEspecially when you make choices that make other people suffer. Your presence on the earth is a net negative. You don't get to go off and live a fulfilled life while everyone you hurt and their families have to pick up the pieces and deal with the damage you wrought.", "I have empathy for OP because she's killing herself working to pay bills for her convict bf.  The reason prison food sucks is because they don't want people to be comfortable there. Inmates get clothes, toiletries, internet access, food, shelter, and alot more than homeless and struggling people with food insecurities recieve.  Money for commissary is for special foods and postage or extra items the inmate want.", "This can all differ greatly depending on what prison you're talking about. Maybe some have adequate toiletries? But a lot of places are barely a toothbrush and soap. \n\nHuman beings deserve decent food. If prison was so much better than being homeless or food insecure, you'd have a lot more people *trying* to get into it. 🤷‍♀️", "Is this man worth it? Like he’s a felon? NTA but I would take a look at your future with him", "Info: like do you have a kid or something? Like what are you doing wasting your life on this. Sorry not sorry but damn girl fucking dip.", "NTA. Don't give the mother leech anything. If she's that bad off, she can always get public assistance in the form of food stamps, section 8 housing, etc.", "NTA. OP - you sound like a good person, with a big heart. But please don't put yourself on fire to keep someone else warm.", "NTA", "NTA But she also isn't your MIL. You're not married to this guy.", "NTA but you are a clown for going into debt for your prison boyfriend.", "Well….you don’t HAVE to support him financially do you? The guys family are leeches, he’s dumb enough to give them his cheque, and you’re left holding the draining finances. You can leave. You can dump him. You can walk away. Think hard about this. I’m not trying to be an a** but if this is your present, what’s your future going to be like?", "NTA, but it sounds as though you are being taken advantage of, I might be ogeranalyzing but please be careful", "Speaking of cycles, strong likelihood he ends up in prison again based on statistics. Of course you have not mentioned how long or for what he is in for, but it will be incredibly difficult for him to find anything but low paying work as a felon, which is why so many of them re-offend and end up in prison again. So you have however long is left on his sentence, then you will likely be supporting him when he is out as well.\n\nNot sure what someone who is in prison brings to the table, but hey, guess he must say all the right things and make you feel good or he’s using you…", "New fave saying🥇", "OP I have been in your shoes. Stop. Just stop. You don't need to be supporting him. He did a crime. HE gets to be punished for it. YOU don't need to be paying his commissary. He will be fed and his basic necessities taken care of. Him and his family will suck you dry.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA For the title but definitely the AH for what you're doing to yourself, you're 27 and killing yourself with 2 jobs to support a criminal who will never be able to support you. Ignoring recidivism he's a felon now and the odds of him ever holding a job that can support you or even share the load in california are next to zero. Move on, you didn't commit a crime he did so why suffer?", "Dump him. You can do better.", "Why are you being such a doormat? Take care of yourself first. Chances are he's where he's at for a real reason. A relationship is 2 fold, not just you paying for everything! I've heard it said in this thread, how do you know he hasn't got other side chicks sending him money? Don't bother answering, because you'll just make sad excuses.\nStart holding your head up high and taking care of you, then you'll have a story worth listening to. I pray for an update like that. As far as building wealth together, pffffttt, not with this one honey!", "NTA. You need to have that discussion with him. Tell him I am doing all that I can and even more, and I'm also going into debt. If you get that stimulus, you need to pay off your restitution because I can't keep going like this. Help me because I've been helping you. \n\nIf he still gives it to his mom, walk away. He's not showing you that you are his priority. He can't do much for you in prison, but he can do this.", "Nta but it’s just a BF. Why are you slaving away for him ?", "You shouldn’t be paying your BF’s restitution. That’s his burden and penalty not yours.", "You would only be the AH to yourself if you send that check to his mom. It needs to go to the restitution and then if you want to throw him $20/week, ok then. \n\nConserve your money, put it into a savings account that no one knows about. Pay down your bills. \n\nListen, he’s being nice now, but he’s likely to get out, go straight back to his old habits, and screw you over. \n\nYes, maybe he sees a life with you but trust me — don’t let him move in with you. Let him show you that he’s changed. Don’t let him sweet talk you into letting him move in with you. He needs to go live with mom, get a job, show you that he’s walking the straight and narrow. \n\nOnly then you may have a future. Just remember, if you listen to most convicts, there are no guilty people in prison. \n\n(Yes, there are innocent people who were railroaded, but from my experience, every single person I know that went to prison deserved their sentence.)", "Exactly. Been there, done that. Smartest thing I ever did was to boot him out. So both he and the one he was cheating on me with went to jail, he spent a year “back home” and she spent some time in county. Birds of a feather and all that. \n\nMy life is great. His probably sucks. But he didn’t manage to drag me down with him. 😉", "That is true. It all depends but she didn’t say he was innocent.", "TBH I didn't invent that phrase. I saw it somewhere on Reddit... and did my own screech of recognition ;-)", "Please also keep in mind that right now he has the structure of prison in his life - it's awful and destructive in a lot of ways, but it protects him from a lot of realities of life on the outside, and most likely some personal demons too. He might be manipulating you or he might be sincerely trying to build a life for you guys to enjoy together - but at this point he can't really hope to imagine how that would work, or what it would take to do it. Add the constant rejection for jobs, etc., money and family worries and the stress of re-entering society once he gets out - he'd have to be superhuman to get through all that in one piece and not take all that extra frustration out on you somehow. If nothing else, he won't have the energy to be a partner. And at that point he'll need more expectations like a hole in the head. Please just do the math, and make as informed a decision as possible about whether to continue being his girlfriend.", "That’s exactly what happened with my SIL. She finally escaped after the 3rd “oopsie baby” after he cheated again and had been happily unemployed for years", "I thought I was in another world. I’m pretty sure they feed you in prison. Why does he need money in prison?", "Wh y would he go hungry? The prison feed him food", "<Circus closes. Monkeys, thrown out of work, turn to vice>", "30% is not a small portion. Also, what is your point? That those are the only bad crimes?? Nothing else is worthy of prison? Armed robbery, violent assault, CP, theft, drug dealing (I'm not talking about pot, I'm talking about shit like heroin and fentanyl that kills thousands) etc... \n\nSure, but they're also intended to be punishment. I feel like that's what a lot of people forget. Prison is supposed to punish you for the crime.", "My mom used to tell me that she knew people who would do petty crimes and get locked up for a week. Because “3 hots and a cot”\n\nAlso the military’s food is “not suitable for prison consumption” says so right on the packaging.  So food in prison can’t be worse than shipfood.", "NTA- but he doesn’t need money. He can work in prison! You shouldn’t have to pay his restitution and certainly not his mothers bills", "Is this really worth it??\n\nI watched my aunt deal with being in a relationship like this. She’s 45 now (17-44, hubby was killed) and still (financially) dealing with the repercussions of it. She loves her kids, but would’ve gotten out it if she got a redo.", "NTA", "NTA.  \nHoly hell, she should be happy you're helping out her son; you're not even married.   \nDo what you need to do for you. You're not helping anyone if you wind up buried in debt.", "And the whole amount, not the $30 he actually receives.", "First time offenders don’t usually get prison time. He’s probably a repeat offender", "But would it matter what he’s in for? He should pay his own restitution", "I don't see your response as harsh, myself,  most of my siblings, my son, nieces, nephews are furious with our DUI nephew, his selfishness caused an innocent man to die. I say selfishness because his father (my brother) warned him he wouldn't be able to handle the roughneck lifestyle he admired, nephew was boss of his crew that worked in drilling oilfields, some of the crew on off time would hang out in bars, drinking hard, doing drugs and nephew wanted to be like them, he did join them and became addicted to drugs, alcohol and his life spiraled. Wife with two daughters walked out because he was a mean abusive drunk, he lost his job, vehicles, his house. And this has been his life for almost 20 years.\n\nMajority of our family refuses to write him or send him money, I refuse too, it would take a novel to say all the things my nephew has done, I feel sorrow for the family of his victim but do not reach out to them because I am related to the asshole who killed their loved one.", "Do you know the Tracy Chapman song \"Fast Car\"?  That is the most optimistic description of your future if you kill yourself trying to support this convict boyfriend.  He should be working to earn any extra money he wants.  He should be paying his restitution.  Not you.  But he figures you are an easy mark.  He'll keep you on a string as long as he's getting supported by you.  ESH, because you are being a patsy", "NYA\n\nAnd be careful. This entire family has leeched onto you and will take you for everything you have. No matter how much you give it will never be enough.", "BF owes restitution, and that should be the first place any extra money goes.\n\nNTA.", "NTA. \n\nI've read your edit, so my comment is based on that. Please tell him that if he gives her the check, you'll stop depositing money into his account. That way, he'll know the consequences before he gives it to her, in case that influences his decision, and it won't be a surprise if you stop sending him money.", "She’s grown, she can sort that out. There are resources for people like her and losing her housing would be symptom of a long term problem with spending and money \n\nYou do realise you’re being used for money, he’s likely got multiple women he’s talking to on the inside or he’s immediately going to dump you once it’s inconvenient.", "Came here to find this comment! I also work in a prison and I don’t know how many times while reviewing calls or just over hearing them while doing rounds I’ve heard how bad they have it. In my DOC they have access to all you’ve mentioned. If they don’t have money coming in they still get soap, toothbrush, deodorant and toothpaste. All of their basic needs are provided for at no cost to the I/I’s ( incarcerated individuals). It’s inmate mentality to whine to their loved ones so they can get money sent in they are always the victim when they are incarcerated no matter what is happening. The meals we serve at our institution and from where I’ve been across the state aren’t terrible I mean they have their good and bad days but still 2 hot meals guaranteed a day. \n\nNTA I’m not saying your BF does but in my experience you probably aren’t the only person on the outside he has conned into sending in money.", "So you are going into debt/not paying off your own credit cards to support a man in jail. Who, once he gets out, will likely continue to let his mom guilt trip him. Girl, run. You will be paying for this family until you die."]}