{"id": 8875, "submission_id": "10qtwft", "title": "AITA for not wanting to change my last name?", "selftext": "My husband (34M) and I (32F) got married recently and I have been putting off changing my name. While we were engaged I never brought it up to him that I might not want to, which I probably should have, but still was on the fence about whether I wanted to or not. After we were married I asked him if he was ok with me not changing my name. He is not.  He can’t give me any reasons that he wants me to other than “tradition” and “it was the expectation going in to this”.  I think it’s very antiquated, considering the origins of women changing their name because of transition of property from their family’s to their husband’s home, belongings, etc.  It’s 2023, we have a house together, that we bought before we got married, I pay half the bills, and division of housework is also pretty well split. Not like I’m moving into his house and using all of his stuff.  Also, I built my career and earned my degrees with my current name and I feel like changing my identity is restarting building my reputation in the industry to an extent. Lastly, it’s just a huge PITA to change your name and why should I waste my time when I don’t see a point. \n\nAnyway, he is very adamant that I change my name because of above stated reasons and says that I just want everything my way and I’m not willing to compromise, citing that he has to wear a ring and doesn’t want to. My stance is that wearing a ring is more important because it shows pride in your marriage to everyone you come across, the only people that would know my name didn’t change are those that I interact with professionally, and they all know I’m married.  \n\nAlso, he is not willing to take my name at all. \n\nSo yeah please let me know who’s the asshole here.\n\nEDIT: I didn’t say anything to him because I legitimately thought he wouldn’t care. I’m very surprised by this out of him and it seems out of character. We’ve been together for 5+ years I knew what I was buying.", "created_utc": 1675255654, "permalink": "/r/AmItheAsshole/comments/10qtwft/aita_for_not_wanting_to_change_my_last_name/", "score": 56, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My husband (34M) and I (32F) got married recently and I have been putting off changing my name. While we were engaged I never brought it up to him that I might not want to, which I probably should have, but still was on the fence about whether I wanted to or not. After we were married I asked him if he was ok with me not changing my name. He is not.  He can’t give me any reasons that he wants me to other than “tradition” and “it was the expectation going in to this”.  I think it’s very antiquated, considering the origins of women changing their name because of transition of property from their family’s to their husband’s home, belongings, etc.  It’s 2023, we have a house together, that we bought before we got married, I pay half the bills, and division of housework is also pretty well split. Not like I’m moving into his house and using all of his stuff.  Also, I built my career and earned my degrees with my current name and I feel like changing my identity is restarting building my reputation in the industry to an extent. Lastly, it’s just a huge PITA to change your name and why should I waste my time when I don’t see a point. \n\nAnyway, he is very adamant that I change my name because of above stated reasons and says that I just want everything my way and I’m not willing to compromise, citing that he has to wear a ring and doesn’t want to. My stance is that wearing a ring is more important because it shows pride in your marriage to everyone you come across, the only people that would know my name didn’t change are those that I interact with professionally, and they all know I’m married.  \n\nAlso, he is not willing to take my name at all. \n\nSo yeah please let me know who’s the asshole here.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "> I built my career and earned my degrees with my current name\n\nTHIS. Your husband didn’t earn these degrees, YOU did. NTA. It’s one thing for him to **want** you to change your name, it’s another to **expect it**. Ask your antiquated husband to list the reasons why HE wouldn’t change his last name to yours (tradition is off the table). \n>\nDo NOT legally change your name, especially for work. It’s very easy to use both or either name outside of work anyway.", "NTA\n\nYour last name is entirely your decision. Wearing his wedding ring is his decision and wearing your wedding ring is your decision. \n\nYes,  changing your last name is tradition, as is beating your wife, having a mistress,  and a dowry.", "NTA.\n\nWhy would he have expected you to change your name? Some do, some don't. Some entire cultures do not. Why would you have to discuss it before marriage? If it was so important to him, he could have brought it up.\n\nChange your name, don't change your name. Your choice.\n\nThe ring thing, though. Pride in a marriage? Really? That should be an individual choice. If he doesn't want to wear a ring, he shouldn't have to. Plenty of people are happily married/proud of their marriage and don't wear rings.", "NTA But also, let him not wear his ring if he doesn't want to. Bim, argument dissolved.", "NTA. I 100% agree with you. You earned your degrees and made a name for yourself. You shouldn't have to change your name  because of tradition - a stupid one at that.", "His compromise is \" give in to my expectations\"...\n\nIn what reality is that a compromise?\n\nNta\nMaybe consider hyphens", "NTA. Don’t change your name. He can’t force you too. But best of luck in this marriage", "NTA. So his argument is tradition and yours is loss of identity and reputation, bureaucracy and equality. You don’t need a reason to say no but all of yours are incredibly valid and his is basically what, he’ll feel unmanly or something? \n\nThere is no compromise here unless both of you change your name to something else. Don’t cave. If it was that important to him he should have checked ahead of time instead of assuming you’d agree to this patriarchal bs.", "NTA. I changed my name when I got married 30 years ago. When we divorced after 15 years, I took back my birth name. I was astounded by how this restored a sense of personal identity to me that I hadn’t realized was missing. It’s a tradition that dates back to a time when women went from being the property of their father to being the property of their husband and ignores the personhood of the woman herself.", "NTA. It’s up to the person. I personally was very relieved when my wife wanted to keep her name. I wanted to start our marriage as equal partners, and her giving up her name of 30+ years, didn’t feel equal and fair.\n\nI think the litmus test is if he’s willing to change his name, so you have matching hyphenated (or completely new) names. If not, then dude is just on some dumb patriarchal bullshit.", "NTA. It IS antiquated, and it needs to stop being the default assumption. If he doesn't want to wear a ring, he doesn't have to, and taking a ring off and on is a hell of a lot easier than legally changing your name, it's not even remotely comparable. IMO, the only \"compromise\" would be if you both hyphenate, which he isn't willing to do. And even if the bills/housework/etc WAS totally different, you still wouldn't have to change your name.", "NTA. It is, and should be, your choice. \n\nMy wife and I discussed this before we got married. She took my name because she wanted to. \n\nIn hindsight, you should have brought this up prior to the wedding.", "NTA. I am in the same boat. I married in 2018 and still have not and will not change my name. I married for the first time in my 30's and was already very established. Men think its so easy just to erase and change everything!", "Nta; definitely a conversation you should have had before you married. He sounds sexist.", "NTA. He \\*married\\* you—he didn’t \\*buy\\* you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband (34M) and I (32F) got married recently and I have been putting off changing my name. While we were engaged I never brought it up to him that I might not want to, which I probably should have, but still was on the fence about whether I wanted to or not. After we were married I asked him if he was ok with me not changing my name. He is not.  He can’t give me any reasons that he wants me to other than “tradition” and “it was the expectation going in to this”.  I think it’s very antiquated, considering the origins of women changing their name because of transition of property from their family’s to their husband’s home, belongings, etc.  It’s 2023, we have a house together, that we bought before we got married, I pay half the bills, and division of housework is also pretty well split. Not like I’m moving into his house and using all of his stuff.  Also, I built my career and earned my degrees with my current name and I feel like changing my identity is restarting building my reputation in the industry to an extent. Lastly, it’s just a huge PITA to change your name and why should I waste my time when I don’t see a point. \n\nAnyway, he is very adamant that I change my name because of above stated reasons and says that I just want everything my way and I’m not willing to compromise, citing that he has to wear a ring and doesn’t want to. My stance is that wearing a ring is more important because it shows pride in your marriage to everyone you come across, the only people that would know my name didn’t change are those that I interact with professionally, and they all know I’m married.  \n\nAlso, he is not willing to take my name at all. \n\nSo yeah please let me know who’s the asshole here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, why do you need another name you've already got one and the degrees and everything is totally reasonable. \nBut there's also other ways to show devotion to marriage other than a ring, he could wear it on a necklace instead.", "\n\nNTA it is old fashioned yes, but to each their own. \nHe is acting very odd about it though \n\nMy brother and his wife hyphenated their last names. They are both very family people, and so neither wanted the other to give up the name.", "NTA\n\nAny reason is enough but you have a perfectly valid one for keeping your name. This tradition needs to die. You both wear rings to signify your union. He gets to be a Mr. Whatever til the day he dies.", "ESH, how was this not discussed before marriage? On both your parts. I would say your husband is slightly more the AH just because you were on the fence and he clearly had a strong opinion on this and should have brought it up instead of assuming.", "NTA, what if you guys divorce later? Are you going to change back? It is you have to do all the paperwork to change your name on driver's license, and professional license. Easy for him to demand. Don't do it.", "NTA. And I wonder how things are going to be if you two have children. Figure this out now and save problems in the future", "It is a pain to change your name. And it serves no purpose. NTA", "If he is so adamant, maybe y'all should BOTH change your last names to something with a fancy hyphen. Then maybe he'll realize what a huge pain it is to legally change it on everything.", "Most women with credentials with their maiden name keep that name to use on a professional level but many also use their husband's name for everything else, it's a possible compromise (and a great way to separate professional and private life). Hyphenating your name is another option. Those are really the only ways to \"compromise\" that I can think of (bar him changing his name to yours), his idea that compromise means him getting exactly what he wants is a bit worrying. But then, so is your deliberate avoidance of the subject before the wedding, you can't really expect us to believe you didn't know he would have this expectation, it may be antiquated, but it's still the default. \n\nNTA but you guys really need to work on communication.", "NTA\n\nIt would have been better if you thought this through before the wedding,  because he feels you’re changing the deal. But that doesn’t change the fact that it’s your name to do with as you choose.   \nSomeone will remind you that you can hyphenate. But you don’t have to. It’s your name. Do what you want.", "NTA. But he shouldn't have to wear a ring if he doesn't want to. I hate wearing rings and my wife doesn't care because she knows its not a ring that keeps someone faithful.", "ESH for not discussing this beforehand.... if you live in a Western country it is mostly traditional that you share a family name (not necessarily just the husbands) so for you to not communicate your decision and for him to just assume you will change your name is equally stupid. Your points are totally valid and your husband should respect your decision or try and find a compromise that suits you both if possible. You are totally fine for not wanting to change it, but as I said for your lack of communication you are both AHs to each other. The insisting he wears a ring seems a bit hypocritical to me, but you should figure that out between yourselves and find a compromise you can both live with.", "INFO: When you sign the marriage certificate, you have to indicate what your married name is going to be. This doesn't actually change your name, but shows intent to.\n\nDid you indicate that you were taking his last name on the marriage certificate and are changing your mind after?", "NTA. I would never change my name if I got married. \n\nI would maybe consider hyphenating, if he did it as well. \n\nHope you manage to resolve this with your husband.", "If my wife had not wanted to take my last name, I would not have made a big deal of it, nor tried to make her feel bad in any way. But it would have totally crushed me and I would have felt rejected. I would just struggle to keep it to myself. Looks like your hubby has decided against that route. NTA but I have no idea what would be good advice here.", "NAH\n\nThis should have been discussed in depth before the wedding. \nI gladly took my husband's last name, not because of tradition or ownership but out of love for the man. I am still very proud of my family name & all it represents", "Esh this is textbook example. Of assume makes an ass of you and me", "ESH. You don't need to change your name but you also can't force him to wear his ring if he doesn't want to. The last band, the rings, those are symbols of marriage but they do not make a marriage", "INFO if you decide to have children whose last name will they have?  Will it bother you if they have his? Will it bother you if teachers call you Mrs husband last name and you have to correct them?", "ESH. This should have been established at some point before you were both married. Now, you are both TA. Him, for being unwilling to compromise. You, for not communicating your reservations *before* he married you.", "I'll tell you why this is an ESH situation. And it's not because you should have to change your name because you shouldn't (and my wife didn't).\n\n1. You want him to respect your prefences but you don't respect his. I know lots of guys who are great husbands but don't like wearing their wedding rings and they are not forced to.\n2. If you knew it was a big deal to him then you should have been clear with him BEFORE you were married, not after.\n3. The first two are about you, but this one is about him. He sucks too - he should have been clear with you before marriage. On top of that it doesn't sound like he's even tried to understand your perspective.", "ESH because it wasn’t discussed properly beforehand. You withheld and he assumed. What about your future children? He is probably concerned for that too. Perhaps you’d be less of an AH if you assure him the kids will carry the family name, however, I can guarantee you will then have a problem with having a different name than your kids! Just so you’re aware, I built a career, as a writer, based off my maiden name. I still use it for my career. Additionally, what I did was I dropped my legal middle name and changed it to my maiden name and took my husbands surname. So rather than Name Flower Maiden, I’m Name Maiden Surname. \n\nI didn’t lose anything that was known to others, and my surname is not hyphenated. It was a great decision in my opinion. My parents were a bit offended because I dropped my given middle name but only a bit and they got over it very quickly. \n\n\nEdit: punctuation", "NTA. Yes, you absolutely should have communicated this. But he also should have communicated his expectations, which he did not.\n\nHe isn't offering any compromise so in my view, he is being the AH. Wearing a wedding ring is not a compromise and has nothing to do with either of your surnames.", "NTA \n\nThis easily could have been n a h, but this part seals the deal for me:\n\n>He can’t give me any reasons that he wants me to other than “tradition” and “it was the expectation going in to this”.", "NTA for not wanting to change your last name. But YTA for expecting him to wear a ring. Not everyone likes wearing rings. My dad couldn’t wear one because of his job and didn’t like taking it on or off for fear of loosing it or it being stolen out of his locker at work. Everyone who knew my father knew he was married and had great pride in his marriage.", "You're NTA. If he had a decent reason (\"it's easier if we have kids\" is the reason I changed my name but that was all me), you would probably at least listen or not be confused and on reddit. \n\nIf sharing a name is important he can take yours if you want. You have a life outside of his name.", "INFO: You do know you can change your name privately and continue to go be the same name professionally?\n\nYou definitely don’t have to change it if you don’t want to. But he shouldn’t have to wear a ring if he doesn’t want to.\n\nIf you intent to have children you should also discuss what last name they would have, communication is always better than not talking about something.", "Honestly I'll say ESH\n\nBoth of you have such strong opinion on what the other should do/think, but none of you ever discussed about this important administrative process prior to the marriage. \n\nThat marriage is having a good start", "She totally knew how he would feel and that is why she kept it a secret. I think he should refuse to wear his wedding ring, pride my ass! It's all about her having control.", "ESH for not talking about this before marriage, honestly. i think he’s a dick for demanding you change your name, but you NEED to bring that up before the wedding", "NTA for not wanting to change your name.  I have a hunch that YTA for making it a surprise after the fact.  I find it very hard to believe you never spoke of it by accident.  Sounds intentional and like a bit of a gotcha.\n\nIt's your name that's clearly a bigger deal.  But maybe consider your husband's surprise.  Just know that he's probably going to be shamed by his buddies.  This is clearly small potatoes to having to change your name but.  Maybe just think about that when thinking about why he's upset.  Maybe try to find some kind of middle ground?", "YTA. Not for not wanting to take his last name. \nBut for not talking about this before marriage. I think the idea of a woman taking a man's name by default is bs, and I live for the day when it's no longer standard. That day has not come. \n\nThere are communities that think if a woman doesn't take her husband's name, then it means she doesn't actually want the marriage. Which is BS, but if you've ever had to confront a deeply rooted cultural belief, then you should know that it takes time, a lot of self reflection, and space to figure it out.", "YTA\n\nAnd the ONLY reason you are one is because you knew your husband wanted you to take his name and instead of you being upfront about being \"conflicted\" (let's be honest, you weren't, but we can pretend you were), you kept it from him because you knew this would probably affect your relationship. You weren't honest and if you cant' be honest about something this simple, how will your husband continue to trust you", "Yta. You should've said something before you guys were married so he could decide if that something he was ok with.", "NAH\n\nYou claim that you assumed it’s ok to keep your married name.  I have a hard time believing that because the entire wedding process typically includes a lot of comments about names: “Oh, three days until you are Mrs Smith” etc.  I don’t believe this literally never came up.  But giving you the benefit of the doubt, you assumed he wouldn’t care.  Meanwhile he assumed you would change your name.\n\nI do think the burden to bring this up ahead of time was slightly more yours than his - if only because his assumption you would take his name is partly based on the fact that the vast majority of women do  - at least in the US.  While no part of me thinks he had any right at all to tell you what you have to do, name wise, I think it would have been far better to bring this up ahead of time and let him adjust his thinking before marriage.  In fairness, though, if this is a big deal to him, he also could have brought it up.\n\nSo NAH but perhaps a lesson learned.  Women struggle with identity and with gender roles throughout their adult lives.  I hope you will discuss all kinds of potential issues in the future.  \n\nDon’t change your name if you don’t want to.  Names are an important part of identify, and you are the only one who cam decide to change it.  Do, however, acknowledge his disappointment and don’t shame him for feeling blindsided.  Also, neither of you has to wear a wedding ring if you don’t want to.  I hardly ever wear mine (the diamond band was a mistake, it catches on things, gets gunned up when I need dough or garden, etc).", "YTA. It's fine if you don't want to change it. But you should have discussed this with him beforehand. It sounds like you thought about talking to him about it before getting married, but purposely chose NOT to bring it up. That is an AH move", "NAH, it’s your name at the end of the day. But he isn’t an AH either…. why did you even ask him if he is ok with it, if it doesn’t matter to you anyway, and if you’re going to do what you want? He told you his expectation when you asked, you can’t blame him for having an opinion just because you don’t like it.", "YTA. You didn't say anything because you knew he would want you to. You waited until after you were married to bring it up. I get the reasons why not, but ultimately it's not a huge deal, and it's on you for not mentioning it when it's common practice.", "YTA for purposefully not communicating this to your husband prior to getting married. This is traditional and if you felt differently about tradition then you should have let him know. The reasons for not changing don't matter because you didn't communicate it to him beforehand. That's the real issue. If this is how you handle important situations I'd probably be upset too. It shows that you don't find his opinion important and you don't care about his feelings. Also, I do think you're overthinking and overreacting to changing your name. Not saying you should change it but that you are overthinking it. We do live in the 21st century but that doesn't mean all traditions have the same meaning they did hundreds of years ago. To say women that change their name do it because they're somebody's property is very antiquated of you.", "Soft YTA Many men, even those who are by no means considered traditional, would feel that this is a rejection on a fundamental level. In our culture, it is what's normally done. Aside from the reasons why it started, taking your husband's name is still a declaration to the world that you are one family. That's why this is really something that should be worked out before you get married, since it can be so emotional.\n\nIt is a PITA to change your name, but it does make a lot of things easier. Wherever you go people will assume your last name is the same as your husband's anyway. When you have children together, it makes it much easier if you all have the same name and people won't question your relationship to your child.\n\nWhat I did was keep my last name as my middle name so if I happened to come across a situation where I forgot to change my name on something it was easy to show I was really me. That also helped keep some name continuity on degrees or certificates I've received. I also kept my maiden name for professional purposes. It all worked out pretty seamlessly by allowing me to keep my professional identity consistent while making my husband happy about having the same name in our personal life. Maybe you could work out a similar compromise?", "Why not suggest to him that you both take a new last name? You’ll have to get a court order, but it’s doable. I considered doing this when I got married (I wasn’t in love with my last name and didn’t like his much, either).\n\nNTA for not wanting to change your name, though. You have a valid reason (not that you need a reason).", "ESH is the only answer that applies here.", "INFO: How did you not know you're husband is sexist before you married him? Imagine trying to force him to have a circumcision because that's what you expected?\n\nThis is NOT an AITA situation, this is a shit my husband is a patriarchal sexist situation. Good luck.\n\nETA when I told my partner I have a problem with taking a man's surname (also worked in academia, got my master's and was working towards PhD studies), he suffer we hyphenate our surname and *both* change out names to that. We also gave our kiddo our hyphenated name. Not saying everyone likes hyphenation, but my partner cared more about me than an antiquated and sexist tradition.", "ESH. You both have total double standards. \n\nDon't you realise that a ring can be seen as a sign of ownership, in the same way as changing your name can be?\n\nHe doesn't want to wear a ring, but you think he should because he should be proud to be married. He thinks you should change your name for the same reason.\n\nWhy don't you agree that he doesn't need to wear a ring and you don't have to change your name? Win win.", "Hyphenate? I did for mine, felt odd to lose my original surname after having it for so many years.", "NTA.  Changing names is the biggest pain the ass I've ever been through.  I've been there and done it.   Remarried in 2014 and hubby said, he's alright with keeping my maiden name.  Signed the certificate with hyphenated name, therefore, I can change if and when I'm ready.  Degree, military records, SS, & credit is all in maiden name.  Men don't understand the freaking hassle to change all this individually through each agency and bureau.", "NTA", "NTA. Your name, your choice. That said, my sister who was in your situation opted to hyphenate her name when she had kids so they could have the same last name, because it makes lots of things easier. If you're planning to have kids you might hyphenate it just to save the argument.", ">says that I just want everything my way and I’m not willing to compromise\n\nTell him you want him to change his name to yours. Oh, he doesn't like that? Well, the compromise is that you both keep your current names.\n\nYou're NTA at all and you list a lot of reasons, but even \"I don't want *MY* name to change\" would trump his \"I want *YOUR* name to change\".\n\nYou're also NTA for not bringing it up before, but admittedly you might have made life a bit easier for yourself seeing this red flag before marriage.", "NTA. This is your choice to make, not your husband's. He doesn't own you. You were not given to him. You are a person and an adult. He is being extremely disrespectful of you. He should be able to understand that just because something is \"tradition\" doesn't mean it is right for everyone or even a good idea.", "NTA do NOT change your name!! hes being wildly sexist omfg no why would you change it. you already have a name!! one you used to build your career and earn your degrees. there is zero reason to change it other than sexism. i’d be rethinking the marriage tbh but if you stay do not let him push shit like on you.", "NTA\n\nIt is totally common for women to keep their work name and married name separate.", "NTA - you probably should have discussed this ahead of time, but that does not override the fact that you just don't want to. It is your name and you don't want to lose it. That should be enough for him.", "NTA. He shouldn’t have assumed you would. He should have discussed his expectations with you. You shouldn’t change your name if you don’t want to.", "NTA\n\nWhy do people still insist on these mideavel ways. \"Tradition\" does not translate to \"good\". More often it translates to \"they didn't know better back then\".\n\nTell him you are doing your part by wearing your wedding ring.", "I loathe “this is they way it’s always been done” as a justification for anything. \n\nESH because you all should have had this discussion before you exchanged vows.\n\nMy husband said if I didn’t change my name I’d lose a half a carat. Lol. I didn’t really care either way so I changed my name. I’m also pretty sure he was kidding.", "NTA - please explain to him how involved the process for changing your name would be. You have to report to every government agency, every financial institution, and probably anywhere you would have a license with your maiden name. And you have to do it in the right order.", "Call his bluff. Ask him if he doesn't think wearing a ring is important to show pride in a marriage then he doesn't have to wear one. And when he removes his ring, also stop wearing yours too. See how pissed off he gets. I'm petty like that.\n\nAlso NTA on the name thing.", "YTA.\n\nYes I know it's your name and your decision to make, etc etc. That's not why you're the asshole - it's because you didn't tell him before getting married and let him go on thinking that you would change your name - which, despite how often this topic comes up on Aita, the default still is that the woman would change her name.\n\nAlso I don't really see how the ring thing is any different.", "NTA because it is very outdated to have to change your last name and you are your own person. He shouldn't force his sexist views on you in this respect. However, you should also not force him to wear a ring, which is also just a tradition. You do not have to show that you're proud to be married by changing your last name, he does not have to show it by wearing a ring.", "NTA.  There is no rule that says you need to change your last name.  He could have married his sister.  She has the same last name!", "NTA. But this is why premarital counseling should really be more important to people. There are lots of “little things” that might actually be big problems in a relationship. By “its tradition” did he actually mean he’d always envisioned a Mrs. Husband on his arm and now he has to readjust his perspective of what that sounds like? Like I said, NTA, but the time to have that conversation was when you first started wondering if you wanted to change your name- when you could listen to his opinions and feelings and then make a decision that took that into consideration- even if it was still not what he wanted. That goes for future potential problems that might arise too. Being married is living both your own lives AND your lives together. It takes a lot of compromise and you can’t do that when you don’t even leave space to hear the other persons input.", "INFO: Did he express his expectation before marriage? \n\nIf yes, then E S H. You because lying by omission is not okay. He because it’s not a fair expectation and absolutely outdated and your reasons outweigh his by far, as other have explained much better then I could. Plus I would be interested what he means by “compromise”; let me guess, he is one of the people that use the word as a euphemism for “my way or the highway”. \n\nIf you both avoided the topic and he just expected you to take his name because “traditions” then N T A.", "NTA this dude should change his name to match yours if he thinks y’all should have the same last name. Anyone who pressures others into doing stuff they don’t want to do for no other reason than “tradition” is a complete tool. If he had the expectation for you to change such a huge aspect of your identity that’s on him.", "This! 100%", "This was my thought too. NTA over not wanting to change her name. but she is the Ah for requiring him to wear a ring. I’m surprised more people aren’t mentioning the ring thing.", "Shouldn’t she have brought this up before the wedding? What if this is a huge deal breaker for him and he was unaware until after? You can’t call him an asshole for expecting something she refused to communicate.", "Nah, the hyphenated name thing is stupid, too.\n\nWhy should a woman be burdened with a hyphenated name because her husband is an ass?", "Yeah.. husband sound sexist af", "Things you should speak about….", "This is the way. Legally keep your name, but socially use husband's name. \n\nHe is a dick for insisting though. For sure a convo before marriage was warranted here. You just assumed he wouldn't care \n\nNTA, but work on that communication!", "She’s a bit of an AH for insisting he wears a ring when he doesn’t want to.\n\nEverything else in your comment I agree with 100%.", "This might not be true depending on where OP lives. It’s not the case in my country.", "I was not aware of this, but our marriage certificate has my maiden name. Thanks for the info though", "You don’t have to. You CAN. And it makes the name change process more streamlined. But plenty of people change it afterwards.", "This isn't true. My certificate is my legal name only.", "Not where I got married.", "We don’t want to have children so it’s out of the question, but I wouldn’t be bothered if we did and they had his last name. I don’t have any qualms with his family, I don’t mind being called “Mrs. [husband last name]”, I’ve even changed my name to his last name as mine on my social media accounts already. I don’t have a problem with having his last name socially, I just like my name and family, and have other professional reasons for not wanting to change my name.", "This is not true. I didn’t keep it from him because I knew it would affect our relationship. I legitimately thought he wouldn’t care and I’m very surprised he does. Yeah I admit I should have said something sooner but I didn’t think it would matter so I didn’t. That’s all it is.", "He did not", "100% She wants him to wear the ring so everyone knows he's married. Its total double standards.", "If it was such a huge deal breaker for him then I guess he should have brought it up. If she is anything like me it would have never crossed my mind", "You can be an asshole for your deal breakers if they are sexist. The only compelling reason OP should have brought it up before was so that she could avoid marrying a sexist.", "Well I'm going NTA then.  Something that probably should have been discussed before hand but it's your decision.", "I wasn’t not honest either, it’s not something we ever even discussed.", "Oh well then absolutely NTA. He can’t just go around and expect this of you without even asking. Wrong century. Sure you could’ve talked about it but as you are the one that doesn’t want any changes it’s not your responsibility, the one that expects sacrifices / changes is in charge of initiating the conversation. The audacity…\n\nI might be petty but honestly at this point I wouldn’t give in out of principle.", "But she literally said she thought about it and didn’t bring it up. And it’s such an expected thing that it should be brought up if she didn’t want to do it and allow him to make the decision. These are things you communicate about before getting married. We have no idea if he would have gone through with the wedding or if he would have come to terms with it but she removed his ability to do so by not communicating it with him. I just don’t see how her refusing to communicate in the relationship doesn’t also make her an asshole. She’s not an asshole for not wanting to do it.", "I'm not sure where you live but in the US it is completely bog standard to retain your maiden name. Having a serious preference for your wife taking your name is pretty rare.", "\"In the US, most women adopt their husband’s family name when they get married – around 70%, according to one of the largest data analyses in recent years.\" - BBC Article from 2020 (https://www.bbc.com/worklife/article/20200921-why-do-women-still-change-their-names) I agree that OP is completely justified in wanting to keep her maiden name, I just want to point out that if anything is the standard, then it is the woman changing her last name.", "I honestly had no idea. I can't think of any couple in my children's generation that actually changed their names but maybe I'm hanging out in the wrong circles 😂"]}