{"id": 8905, "submission_id": "10rdttk", "title": "AITA for not allowing my ex to see our infant daughter because of what she did?", "selftext": "Hi. I’m 19m and a single dad to a five week old baby. I’m gonna get right into this. \n\nMy ex (20f) and I had been dating for five months when she got pregnant. We stayed together and five weeks ago our daughter was born. She was so precious and it was instant love I felt for her. \n\nI took paternity leave and things were going good until my uncle passed away when our daughter was a few old. The funeral was three hours away. We talked about it and agreed that I would go, stay for the funeral, and then drive back. So I did this. For reference baby girl was eleven days old. \n\nWhen I got back her car was gone. I head inside and hear baby girl crying. I walked into the nursery and found my daughter with a soaking wet (I’m talking entire outfit was soaked including through her swaddle blanket), poopy diaper, huge diaper rash.  \n\nI got her right into a bath to get her cleaned up, took pictures of the rash to show the doc because my mom has told me that I’d have this mystery rash that would clear up right before a doc visit, and then made her a bottle. She typically has 4oz of formula. She had six before sleeping again. \n\nI then tried calling my now ex. When she didn’t answer after four tries I started calling her friends. Finally one of them answered. They had just gotten out of a spa!!! She had spent five fing hours at the spa (that is a forty minute drive in good traffic from our place) getting who knows what done (I was seeing red and didn’t care, still dont). Friend handed the phone over to gf and I asked/yelled why she left our daughter home alone. She said that she didn’t think it would be a big deal because all she does is sleep anyway. \n\nI told her to come and get her stuff. All of it would be on the porch and that I didn’t want to see her again. She tried to call me again and ring the doorbell but I didn’t answer. \n\nA report was made and she’s being made to take parenting classes after she claimed to be overwhelmed. I am working with a child support/custody lawyer but that date isn’t till next month. \n\nToday her mom called me and said I needed to forgive her because every new mom makes small mistakes and it’s ok because she turned out alright. That I’m an ass because I’m keeping a newborn baby from her mom. I told her that there was no way I was going to let her have access to her again. Then hung up the phone. \n\nMy friend mentioned that it wouldn’t hurt anything if I let her visit while I’m around but I don’t think that would be a good thing as I’m still on the verge of losing my cool with this. \n\nAITA for not letting my ex see our newborn daughter?", "created_utc": 1675304162, "permalink": "/r/AmItheAsshole/comments/10rdttk/aita_for_not_allowing_my_ex_to_see_our_infant/", "score": 104, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m not letting my ex back into our lives because she left our baby unattended. Her mom and sisters are calling me an asshole. I’m wondering if I am.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\n*LEAVING A NEWBORN ALONE FOR 5 HOURS IS NOT A SMALL MISTAKE, WTF?!*", "Hey so cool story, I worked in an infant room in a few daycares, and guess how often you check on an infant in those rooms, even if it is sleeping? Every. Five. Minutes. And infants aren’t even allowed at the daycare until they are six weeks old. What she did is unconscionable. Stay the course dude; keep that baby away from her. NTA.", "NTA! That is not a small mistake! That could have killed your baby. What if the baby was place somewhere she could have rolled off of or got too cold? What if you had not gotten back as early and your ex hand stayed out longer? That is neglect and abuse, you did the right thing. Be the parent your baby needs and keep that idiot away from your daughter. If she did this when baby is only 11 days old, imagine what she will do when the baby is a little older.", "NTA. That’s not a small mistake. \nI do think though it may be worth offering supervised visits for the child’s sake.", " NTA. Your baby girl could have died. Good for you for being a good dad.", "NTA. A good father", "Every mom makes *small* mistakes. Very few moms abandon their newborn alone for hours upon hours of girl time. Those who do should lose custody of their infants. Documenting and calling police was the right thing to do. Carry on, daddy.", "NTA\n\nShe was overwhelmed, so she went to a spa? Without finding a babysitter? Yeah, right. Your ex has rocks in her head.\n\nYour friend's suggestion for supervised visits isn't a bad idea, but only if you can keep calm when you see your ex. You might allow such visits if you have a trusted adult (for example, maybe your mom) there to supervise the visit. Good luck with the custody case.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi. I’m 19m and a single dad to a five week old baby. I’m gonna get right into this. \n\nMy ex (20f) and I had been dating for five months when she got pregnant. We stayed together and five weeks ago our daughter was born. She was so precious and it was instant love I felt for her. \n\nI took paternity leave and things were going good until my uncle passed away when our daughter was a few old. The funeral was three hours away. We talked about it and agreed that I would go, stay for the funeral, and then drive back. So I did this. For reference baby girl was eleven days old. \n\nWhen I got back her car was gone. I head inside and hear baby girl crying. I walked into the nursery and found my daughter with a soaking wet (I’m talking entire outfit was soaked including through her swaddle blanket), poopy diaper, huge diaper rash.  \n\nI got her right into a bath to get her cleaned up, took pictures of the rash to show the doc because my mom has told me that I’d have this mystery rash that would clear up right before a doc visit, and then made her a bottle. She typically has 4oz of formula. She had six before sleeping again. \n\nI then tried calling my now ex. When she didn’t answer after four tries I started calling her friends. Finally one of them answered. They had just gotten out of a spa!!! She had spent five fing hours at the spa (that is a forty minute drive in good traffic from our place) getting who knows what done (I was seeing red and didn’t care, still dont). Friend handed the phone over to gf and I asked/yelled why she left our daughter home alone. She said that she didn’t think it would be a big deal because all she does is sleep anyway. \n\nI told her to come and get her stuff. All of it would be on the porch and that I didn’t want to see her again. She tried to call me again and ring the doorbell but I didn’t answer. \n\nA report was made and she’s being made to take parenting classes after she claimed to be overwhelmed. I am working with a child support/custody lawyer but that date isn’t till next month. \n\nToday her mom called me and said I needed to forgive her because every new mom makes small mistakes and it’s ok because she turned out alright. That I’m an ass because I’m keeping a newborn baby from her mom. I told her that there was no way I was going to let her have access to her again. Then hung up the phone. \n\nMy friend mentioned that it wouldn’t hurt anything if I let her visit while I’m around but I don’t think that would be a good thing as I’m still on the verge of losing my cool with this. \n\nAITA for not letting my ex see our newborn daughter?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. That's not a small mistake, it's neglect. She made the decision to leave a baby not even a fortnight old alone for nearly six hours so she could do a spa day and rationalised it as being all good because babies sleep all the time. She also made herself not contactable. Part of the conditions for her getting any access needs to be that she's checked for post partum and if this is the case seeing a therapist for it.\n\nYou're clearly on the ball, even getting photographic evidence of the diaper rash.", "Oh man. Nta and i wish my ex was a quarter of the dad you seem to be becoming at a really young age. You're only hope is document everything. EVERYTHING that happens between you 3. Every word of every conversation. Every single thing you possibly can. To protect yourself and get the legal system on your side. Because i promise you, it's not on your side. You aren't mom. Courts want kids with mom first, so you need irrefutable proof that she's unfit. This will not be fast or easy or clean. Buckle up my dude, your life just got real.", "NTA but do nothing without discussing with your lawyer.  You don't want to make a decision that would negatively impact your custody rights.  (And that could include refusing to let her see the baby.)", "NTA. This was not a small mistake: this was a conscious and deliberate choice. Leaving an infant alone for 5 hours is unconscionable. If she was overwhelmed, she needed to ask for help, not abandon her child alone. Honestly, the fact that she went out for 5 hours and didn't understand what she did wrong would indicate that she doesn't have the moral fiber to be a parent.\n\nI wouldn't let her mother sway you either - if she doesn't understand why her daughter shouldn't be taking care of a baby, then you don't need to be listening to her.", "NTA", "This was not a small mistake. She left an *11 day old* infant alone and unattended for hours. She is an active danger to the baby and you keep her far away from that child until you get an explicit court order that tells you otherwise. \n\nNTA", "NTA she left your infant daughter alone for over 6 hours? who in their right mind would ever do that most brand new parents i know are scared to leave the room let alone the entire house", "NTA\n\nWhat she did was not a \"small mistake.\" She abandoned a newborn for many hours, leaving the baby unfed, soaking wet and without comfort as it cried.  What if the poor baby had vomited and choked? This is child abuse.\n\nYou did everything right. Good luck to you in getting full custody, and raising a wonderful daughter.", "NTA. That isn't a small mistake. But, that said, she is still your baby's mother. So it would be good to be on amicable terms with supervised visits for the emotional wellbeing of your child. You're a good father for defending your little girl. No one in their right mind would tell you that you're wrong for that.\n\nIt's likely she's experiencing post partum depression, so don't write her off entirely just yet unless this is in line with her usual behavior. If she's normally responsible, she may genuinely need your help to get help right now.", "NTA your baby could’ve died and she would be in prison. What a heartless irresponsible dumbass she has no business being around that baby", "NTA. I think her custody is best left decided through the court at this point. What she did isn’t a “small mistake” it’s actually horrifying. \n\nShe also may be suffering from PPA or PPD so it’s best to let professionals handle this situation.", "NTA and absolutely absolutely absolutely not.  It's inexcusable.  You're doing the right thing to protect your baby.", "NTA. If she was having a mental health crisis, then that needs to be addressed. If she wasn’t, then she should not have access to your child until courts make a decision. That isn’t like “getting used to parenthood” even young children would know you can’t leave a baby alone!", "NTA! This is not a small mistake. This is something that could result in criminal charges! See I fully understand I would not be a fit parent, therefor I never became one. Nor did I ever have to terminate a pregnancy. People really need to take bringing LIVES into this world seriously. I cannot even fathom how she could do this and how her own MOTHER is making excuses for her! BUT - makes you wonder where she learned this negligent behaviour from!", "NTA you need to get 100 percent custody and go no contact with her", "NTA. This was not a “small mistake.” This was straight up neglect. When I had my daughter my “small mistakes” were not burping her long enough, changing her diaper when I thought she was done pooping only to get pooped on mid change, not moving up a diaper size soon enough resulting in way too many blow outs, getting stuck in traffic and not being able to feed her soon enough making her cranky. All parenting has a learning curve. Leaving a baby unattended for 5+ hours is UNACCEPTABLE. I would have gone nuclear too. Keep your distance. This might be PPD but that doesn’t mean you should give in. She doesn’t get visitation until she’s done the work to get better. \n\nPPD is serious and I know a ton of moms struggle with the challenges of being a new mom, but this is extreme, and your reaction needs to be equally as extreme until you know she’s ok.", "NTA. That’s not a small mistake, but cover your ass legally.", "NTA. Yes every parent makes small mistakes. This is not a small mistake. This is a premeditated 6 hour visit to an effing SPA to pamper yourself while your newborn is traumatised.\n\nComplete and utter negligence. You are absolutely doing the right thing, do not back down.", "Someone who would do this to such a young baby doesn't deserve any sympathy from anyone. Don't know what her mom is smoking saying that stuff but that was NOT a small mistake. Do what you need to buddy, you're doing the right thing here. NTA", "NTA. But please, do give her the chance to learn from this grow. Children need their mothers too.", "NTA. but- you need to be working with a lawyer about this. you don't want to inadvertently do something wrong/illegal, and screw up your chances at custody. the system isn't known to be very kind/sympathetic to men.", "Op do not communicate with her or her family unless it’s through written communication. \nPlease take notes of everything including this information.\nBut be aware that those parenting classes are for her to regain time with the baby. In what capacity will be up to a judge. If this happens you need to try and make those supervised visits if possible. \nNta and I’m sorry you had to go through this", "ESH\n\nYour ex is an AH for what she did - as others have commented its not a small mistake to leave an 11 day old baby for hours.\n\nBut you suck right now and your friend is right and you should allow your ex to see your and hers daughter and show that you're at least trying to be accommodating - and I suspect your attorney may agree with your friend as it would probably look good for you when you go to court", "NTA. You are protecting your child. You are doing everything right. Keep doing what you are doing.", "The most obvious NTA ever. Take up advice in a different subreddit", "NTA and document EVERYTHING. Every communication. Every visit. Every third party communication (family, friends etc) and file for custody. \n\n>They had just gotten out of a spa!!! She had spent five fing hours at the spa (that is a forty minute drive in good traffic from our place) getting who knows what done (I was seeing red and didn’t care, still dont). Friend handed the phone over to gf and I asked/yelled why she left our daughter home alone. She said that she didn’t think it would be a big deal because all she does is sleep anyway. \n\nThat's not reasonable for an adolescent to think that's ok. At 20, if she doesn't get how bad that is, she can't be trusted.", "NTA \nA small mistake is not fastening a diaper properly. That egg donor (because she does not deserve to be called a mother) left her new born baby alone to have a spa day. Fuck her and her mother.\n\nKeep that baby safe.", "Holy shit NTA. I was a new mom once. Just 3 years older than her. I suffered from debilitating postpartum depression and later postpartum psychosis. But I knew you don’t leave a newborn alone in the house.", "That’s not a small mistake, that is pure disgusting child neglect. NTA I hope you get full custody", "This is so far above Reddits pay grade...", "NTA. That baby is not safe with her.", "NTA. Can I just say leaving a baby alone for that long is not a “small” mistake. That is neglect. I wouldn’t let her anywhere need the kid unless forced to by the courts. I hope the courts don’t let her be alone with the baby again anytime soon. I’m so sorry you are going through this!\n\nAnd I don’t care about her age. Honestly my 7 year old wouldn’t be that irresponsible.", "NTA! Omg! Your poor daughter! She’s a terrible mother! This isn’t a mistake, this is FIVE hours alone! Do not leave your daughter with her alone ever again.", "NTA. You did and are doing all of the right things. You are a good dad. However, I would keep documentation of any texts/emails fro her or her friends and family. And just simply don’t answer the phone or door. Just ignore until court. I am so so mad on your behalf.", "You’re a mature young man sir. NTA, transfer all your contributed funds to a new bank tomorrow. Call a lawyer today. Get a police report today. \n\nI wouldn’t even go to a neighbors door to borrow something if I had a child that young. Nor would my wife. 5 hour spa trip? GTFAH. Spa is about you, being a parent is about them, this won’t last.", "Nta. Make sure you have all legal grounds covered.", "NTA - 5 hours is not a mistake. 5 hours for a 5 week old baby is child neglect. There were options if she was feeling overwhelmed. You did the right thing. When you seek out custody, try for supervised visits. You’re going to be a great dad.\n\nEdit: Sorry, she was 11 days old. That’s even worse.", ">every new mom makes small mistakes\n\nAhem. Leaving a newborn unsupervised for 5h, just to get to the spa is NOT a small mistakes. What in the world was she thinking about ?!  \n\nNTA. And maybe report this to the authorities in charge of such matter.", "NTA \n\nThis is not a “small mistake”, your ex neglected her baby and left her alone for HOURS. This is completely inexcusable and she’s lucky her daughter only ended up with a rash. Document everything, contact a lawyer and file for full custody", "NTA. Being a new mom is hard and overwhelming and I'm sure she's not at her best but abandoning an infant is absolutely not ok. She needs to do the work (classes, therapy, whatever it is that she needs) and show progress FIRST and then ask very, very, very nicely for another chance at having a relationship with your daughter.", "NTA- your ex is a danger to your daughter. Do NOT trust her again. She knew better, a ten year old knows not to leave a baby by themselves. The kiddos they just get harder as they grow up. If she's doing this to your child now, in the most vulnerable age, imagine what she'll do to the child when they're more independent.", "Don't cave to it. If she's capable of leaving an 11 day old baby home alone, who the hell knows what else she will do. She needs help and keep her away from the baby. Nta and good luck", "NTA\n\nThat \"small mistake\" is something that would probably have resulted in your daughter being removed by the CPS if anyone other than you had found her home alone.  \n\nAs you're already going down the legal route I would just let that play out and let the courts decide on visitation.", "Holy shit NTA, leaving an eleven-day old baby for over five hours?!? Something much worse could’ve happened, and I’m glad nothing did", "NTA but this isn't going to go the way you think if you keep denying access. CPS is involved, which overrides family court and CPS is not going to go with \"she can never see her child again.\" They will give her supervised and eventually unsupervised visits and possibly even 50/50 after her parenting classes. Reunification is the goal, not keeping the child completely away from a parent. \n\nYou would probably fair better in court and have a better chance of getting supervised for a longer period of time if you allowed supervised visits without needing the court to force you. Then you have established supervised for now.", "NTA for now.  What happened is a safety issue and you're 100% right to ensure she is not alone with the baby until she can be safely alone with the baby.  I get that you're angry and fear for your own temper, but at some point, your ex should still get to see your daughter, even if in the presence of a qualified supervisor.  She is her daughter too.", "NTA.  Seems like your ex is not even trying tk get custody.  This is probably for the best", "NTA.\n\nAt a minimum, she needs to go through those parenting classes and be medically assessed to see if there are issues like PPD going on that need to be addressed, and unless ordered by the court or your attorney advises you to act differently, it seems reasonable to refuse any visitation until those have been completed.", "NTA hopefully parenting classes will help or if she actually has some severe form of post partum depression she will get help. I can certainly understand you not wanting to be around her. Your reaction is normal. Unfortunately I do think you need to give some access to the baby. A court will make you anyway. Unless you are afraid she is going to take the baby away if given access, I suggest asking someone you trust to supervise the visit. Definitely document every little interaction.  Good luck.", "Omg, you know what can happen to an infant in that amount of time! A lot! The baby could have rolled over, suffocated, fell down, so many things! The hunger thing alone! Your supposed to feed them every 3 hrs for a reason! They are growing! Your nta- but yea, the gf needs to go. She could have called anyone to babysit - like her mom, but no, she left an infant home alone.", "NTA  You're 100% right that what your ex did was serious and she should not be trusted alone with your daughter.\n\nBUT\n\nKind of an AH for not even allowing supervised visits.  \nFind a way to cool yourself enough to let your daughter have supervised visits with her mom, especially while she's an infant.  Do you have someone (one of your parents?) nearby who you would trust to supervise, either with you, or in your place?  Is there a someone within the court system who can mediate this?  If not, get yourself to be civil.  You can do it.", "NTA. That's never okay.", "What the fuck? You daughter could have died!  You are absolutely right. \n\nIf she wants to visit, there are usually supervised visitation centers you can go to, where a social worker is present.", "NTA. That was irresponsible & I can see why you don’t trust her near your kid but please get legal backup. Courts are huge on having both parents in the kid’s life & accuse parents of parental alienation a lot when they are trying to keep their kid’s safe. You need an agreement in black & white & might need to agree to supervised contact so prepare yourself.", "She didn't made \"a small mistake\". She knowingly abandoned her child for hours. This was not a mistake. She knew what she was doing.\n\nNTA. The only person that can decide if she is fits to see her daughter is a judge. In the meantime, protect your sweet child, and keep her away. The incubator's feelings are irrelevant here.", "NTA. Your ex left a new baby alone for hours to go to a spa. She should have only supervised visitation if any is granted. \n\nAnd if supervised visitation is granted, make sure her mother is not the supervising person.", "NTA.   keep that .........(I'm sure you can fill in the words I'm  thinking)  away from your child.\nI'd tell everyone I know what she did", "OP - in the future if you EVER come across a situation where you are seeing actual child abuse (abandonment counts) like this immediately call the police. Start a paper trail, now because you’ll need it later if her behavior continues to show she deserves court ordered adjustments made to custody/visitation.", "NTA...you are putting that baby first. Something your ex and her mom are not. \"She was overwhelmed?\" BS.", "NTA.  And secure good legal representation.  That baby could easily have been not with us anymore.", "\"her mom called me and said I needed to forgive her because every new mom makes small mistakes and it’s ok because she turned out alright. \"\n\nWhat??? How is that a small mistake?\n\nNTA.  That baby is lucky to have you.", "Absolutely not the fucking asshole and file a police report. Get a paper trail now and go for full custody. I don’t give a fuck how overwhelmed she was, leaving a newborn home alone for hours is abhorrent at best and criminal at worst.", "NTA. Everyone agrees your girlfriend was extremely irresponsible. I’m wondering, did she not have a single friend of hers step up and say, “you can’t leave your baby alone?” I definitely would not leave the baby alone with her. It sounds like no one in her support group is very bright nor responsible. Not gf, not her mom, not her friends.", "Not only don't let her visit but also don't let her get anywhere near your daughter.  You will have no way of getting her from her until the court paperwork has been filed and there's a custody order in place the court.  She could quite literally pick her up and walk away and there's NOTHING you can do physically or legally without getting charged yourself.", "NTA\n\nThis was not a small mistake. \n\nWork with a lawyer for full placement and custody and for your ex to have supervised visits with the baby.", "NTA stay strong and dont allow her around your daughter. She could be dead now. Remember that. 5 hours in the spa 40 mins each way. That minimum 7 hours she thought she could leave a baby alone. The most I would do is baby monitor on my hip in my garden. What she did is pure evil. Fight with everything you have. If you had not returned your child could be dead. How many times has she pulled this shit? You were gone a few days. I'm scared for your child", "Same here, long time daycare worker. It was every 5 minutes for young babies and still 15 minutes for over 6 months where I worked. Do not let her anywhere near that baby, get a good lawyer, fight for custody. It's absolutely insane and abusive what she did. Glad to hear that baby has you. NTA, not even close.", "What if there was a fire?", "And a doctors visit the next day. Thankfully a little but paste and she’s all good. It has cleared up now.", "OP seriously needs to see this. Document EVERY SINGLE THING. Your ex is neglectful and should not have even partial custody. \n\nYou are doing all the right things, and you're an amazing father, especially for being so young. Keep at it and find a support system.\n\nI'm so sorry for the loss of your uncle and everything that is now happening. Good luck with your daughter!", "Omg, yes, I didn’t even think of that! OP, please take that advice about the lawyer", ">It's likely she's experiencing post partum depression\n\nWe don't know this and heading off to the spa with friends doesn't suggest it.", "Great callout here regarding her potentially having PPA or PPD. That was my first thought reading this post. \n\nShe not only needs parenting classes but also needs to probably seek help too if being overwhelmed is causing her to neglect her baby in such a way.", "No person in any other circumstance would get the sympathy the wife is getting. She’s obviously the AH, and it might actually be insulting to people going through problems to say she is, and just isn’t a selfish ah", "I'm not sure how teachable someone who thinks leaving a baby unattended for several hours so they can have a spa day is acceptable is", "Wtf? No. This is more than a small mistake that first-time parents make when they don’t know better. EVERYONE knows better than to abandon a newborn for an entire day!!!", "Nope. \n\nWhat children need is a parent who will be present and won’t put them in danger. You’re just as bad as MIL for trivializing child neglect", "She left her *5 week old* daughter home alone for FIVE FUCKING HOURS! She has no right to see that poor baby. She should be charged with child neglect imo", "Nah, no way. Anyone that’s had an infant knows that physically leaving an 11 day old baby alone for five hours is a life or death situation. That’s unforgivable.", "Actions have consequences...\n\nIf he sucks for protecting his kid from the would-be murderer. Then I think you've got your priorities fucked up.", "This!! No one with a bone of nurturing or common sense would ever leave a newborn like that. Follow thru with the attorney, try for full custody. With supervised visitation if you want to give her an opportunity. This is not a matter of being too young and not knowing, this is a matter of neglect, self centeredness and pure idiocity. Reference…mom for 38 years, gramma, nanny since retirement and pregnant with first child at 17.", "He's not asking you to be his lawyer", "The baby was 11 days old at the time this happened.", "She made herself difficult to contact, she had to be reached through one of her friends. When you have kids and you're not around them, you make sure you can be reached unless it's absolutely impossible.", "Wtf is up with that mom? Why didn’t she babysit if she knows so much??\n\nOnce OP (hopefully) gets custody, he needs to unass himself from all these dangerous nuts.", "Yes make sure her mother is not the supervisor. I have a friends ex MIL would be the supervisor and wasn’t supposed to allow the ex near the kids if he had been drinking. Turns out she had been letting him not only with the kids unsupervised while claiming she was there, but she put the kids in a car with him driving knowing he was drunk. He got in an accident, kids were ok, and it all came out. It was a nightmare.", "If you don't have one then get a doorbell camera to record her or her mother trying to convince you in person to go easy on her.", "Make sure you keep pictures, doc visit summaries etc to prove your case in court. I think this sub is rooting for you 100%", "You’re a good dad.", "Truthfully this doesn't sound like PPA or PPD. This isn't a woman who's depressed. This is a woman who wanted to go out and have a good time with her friends", "Right? This was a deliberate choice. She didn’t express any remorse when OP called her out, she acted totally justified. I’d love to know what she told the friend. Did she lie and say she had a babysitter, or did she straight up admit to abandoning her baby?\n\nThis was a serious act of child abuse.", "Realistically she will be given the chance by a judge. If she wants it.", "Yeah leaving an 11 day old baby alone for 6 hours is reckless endangerment and child abuse. \nKid could very well have died.", "Oh. It says 5 weeks in the beginning. He found out about his uncle’s death when she was 11 days old. I could have misinterpreted it.", "And records of trying to reach her on that day, the call history.", "She's acting like a 20yo who hasn't had a baby less than a fortnight ago. If she wants any custody of their daughter she needs to accept the free spirit she's acting like isn't who she is.", "Maybe, but once this gets to court she will be evaluated because leaving an infant at home for hours and not telling anyone is a red flag for mental instability", "Maybe, that's really bad though, I'm not sure a judge would be comfortable letting the child alone with her. If anything she might be able to get supervised visitation for quite some time.", "I’m sure she will but I hope she has a shred of self-awareness and can admit that she doesn’t actually want to be a parent.", "I know someone that broke their kids legs an infant. All they had to do was take parenting classes to get their kids back. Is it right nope but our system is messed up."]}