{"id": 8961, "submission_id": "10rykb3", "title": "AITA for being angry with my mum for trying to set me up with my professor?", "selftext": "My (22F) mum wants me to get married. For context: my dad passed away a long time ago and I’m an only child. She’s always asking me if I’ve met someone yet, or if I have my eye on anyone in particular, and the answer is always a resounding no. I *do* want to get married and have kids eventually, but not now. Not when I’m still so young, still figuring out who I am and what my place in the world is; I am nowhere near ready to be a wife, let alone a mother to another human being entirely dependent on me. When I try to communicate these feelings to my mum, her response is always along the lines of “I won’t be here forever, I want to see you settled and to meet my grandkids before I go.” This ends up making me feel selfish, guilty, and as though I’m letting her down somehow.\n\nMy mum often tries to take things into her own hands by introducing me to her friend’s sons, or by trying to make me sign up to various dating apps etc. My last straw was this week:\n\nI’m currently doing a Masters degree and one of my professors is the same ethnic background as me - we’re both Arab. I found this super exciting because the uni I’m studying at is not very ethnically diverse, especially in terms of staff, and so having an Arab professor who specialises in the field(s) that I’m interested in was so cool to me and I of course immediately told my mum about it. As an immigrant who isn’t used to representation in academic spaces, she also found it super exciting and was very proud that I was being taught by him. But then she asked me how old he is, if he’s goodlooking…and you can probably see where this is going. I didn’t know whether to start hysterically laughing or screaming.\n\nI told her *no*, you are not going to play matchmaker right now. This is my *professor* and I’m not interested. She didn’t listen. She kept trying to convince me that it was “meant to be”. She looked like she was already planning the wedding in her head. I love her so much, literally more than anything in the world, but I couldn’t take it anymore and I told her she was making me regret telling her. He’s my professor and that’s weird enough, but even if he wasn’t my professor, he isn’t my type, he’s too old for me and I’m *not ready to marry anyone right now* regardless. Her response was the same “I won’t be here forever” rant but this time with “you can’t be so picky otherwise you’ll never get married” sprinkled on top. I just hung up.\n\nI know my mum’s intentions are pure, so I feel unjustified in my anger, yet I can’t help feeling it. AITA for upsetting her/possibly overreacting to the situation.", "created_utc": 1675366425, "permalink": "/r/AmItheAsshole/comments/10rykb3/aita_for_being_angry_with_my_mum_for_trying_to/", "score": 632, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My mum has pure intentions and is just looking out for me by doing what she thinks is best. It may come off as though I’m throwing that back in her face by reacting the way I do.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "This is YOUR life and you have your choices to make. Not to mention, you have good morals because you and your professor hooking up can cause some major issues for you both.\n\nNTA", "NTA. Pushing you towards marriage and kids you are not ready to fulfill her fantasy of you married and grandkids is selfish of her. What would she do if you and/or you possible future husband struggled with fertility? What would happen if you were gay/lesbian and wanted to marry a woman?", "NTA  Mom needs to stay in her lane. You have every right to be irritated.  I hope she's not the type to go behind your back and email this guy trying to set something up.  As a professor, his contact information is going to be available on the university's website, so you may want to give him a warning.\n\nFirst, it would be completely inappropriate for a professor and his student to have a relationship, and your mom needs to understand that.  \n\nSecond, laws of attraction. She can't force an attraction between 2 people. It's one thing to introduce you to others, but then she needs to back off.\n\nThird,  you said you're not ready for a relationship. Period.\n\n And the whole 'I won't be here forever.' That's so manipulative.  No one is given forever. I could get hit by a bus this afternoon!", "You're not overreacting. As someone with a similar mom, the countless self-crusades this woman has decided to put herself on is exhausting. \n\nAnd it will never end. You will meet someone, and she will push marriage, then kids, then more kids and so on. \n\nEven though I have sat my mom down several times to speak to her about her pushy and aggressive nature, she still on occasion brings up the next steps in my relationship. \n\nGood luck, NTA.", "NTA \n\nEw, students dating profs is so gross (at least in modern Western culture), bc so often it’s about abuse of the student by the prof. Have you told your mother above that?", "NTA. \n\nYour mother is a typical example of what toxic parents do, ie guilt tripping you to get what she wants. \n\nShe doesn’t respect you or your ability to make your own decisions and you have done ABSOLUTELY the right thing by expressing your boundary to her. \n\nAt the extreme end, people have low contact with toxic parents for a reason!", "I think you need to take a break from your relationship with your mother. This behavior has crossed lines from just inappropriate to actually disturbing.\n\nNTA", "NTA\n\nAnd I know it's hard. Sorry you're dealing with this!\n\nNot because I think it would work in your case, but just because it's a funny story I never get to tell, and it's a similar situation:\n\nOne of my neighbors, her daughter was 26, at the time which, here, in modern times is barely out of college, practically still a child... but where my neighbor is from, being 26 and unmarried, well you're already a spinster or something, lol.\n\nAnyway the 26 year old came over one day (I wasn't there, they separately told me about it later, both venting) and says like,\n\n\"Mom, I really want to get married asap! But I have a problem and I need your help!\"\n\nAnd ofc, this is mom's dream, right? So she's super excited to fix *whatever it is* and help her daughter hurry up and *get a man*.\n\nSo her daughter goes \"my friends keep trying to set me up on dates, and it gives me really bad anxiety. So bad that I can't go on the dates! And then the anxiety is so bad, I don't even want to get married, sometimes I feel like that for *weeks*!\" then before her mom can open her mouth to reply daughter says \"how do I tell them to stop setting me up so I can start dating?!\"\n\nShe's figuring, of course, whatever mom says to tell her friends, she can tell that to her mom instead, and mom will get the point.\n\nAnd then her mom says,\n\n\"Tell them your mother will be finding your husband, so they can stay out of it!\"\n\nAnd of course at this point, daughter's plans are dust, and mother has obviously won, right?\n\nBut daughter gets real for a minute and says \"but mom, I get that anxiety *more* when it's you setting the dates up!\"\n\nWhich I thought was brilliant. But her mom immediately launches into \"I? I give you anxiety? I who am your mother? Who has always been there for you? I?\" and goes all melodramatic, can't believe what a disrespectful child, on and on.\n\nThey are both certain the other is unreasonable, and like to complain about the conversation to anyone who will listen.\n\nWhen mom tells the story she swears that she could *see* the malice in her daughter's eyes, she was trying to send her to an early grave and so on.\n\nDaughter tells it now and laughs, but she used to be so very sad and frustrated.\n\nShe's 29 now, and happily engaged, (to a guy she met on a dating app!) and has a baby on the way a few months after the wedding, though her mother doesn't know she's pregnant yet, lol. \n\nMother and daughter are both happy, for now. \n\nAnyway, best of luck, hopefully you find a way to stop your mom's meddling in your love life, without damaging the relationship <3", "NTA. And you are very justified in your anger, pretty soon you're going to be adding resentment. Actions like this are what lead to LC or NC situations. You need to speak at length to your mother and get her to back off. Failing that speak to another relative. Edit to change father to another relative. My apologies.", "NTA. She's crossing boundaries and you're justified in how you feel. My sister in law tried playing matchmaker with me and after the second woman ghosted me, twice by the way, I told her no more.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (22F) mum wants me to get married. For context: my dad passed away a long time ago and I’m an only child. She’s always asking me if I’ve met someone yet, or if I have my eye on anyone in particular, and the answer is always a resounding no. I *do* want to get married and have kids eventually, but not now. Not when I’m still so young, still figuring out who I am and what my place in the world is; I am nowhere near ready to be a wife, let alone a mother to another human being entirely dependent on me. When I try to communicate these feelings to my mum, her response is always along the lines of “I won’t be here forever, I want to see you settled and to meet my grandkids before I go.” This ends up making me feel selfish, guilty, and as though I’m letting her down somehow.\n\nMy mum often tries to take things into her own hands by introducing me to her friend’s sons, or by trying to make me sign up to various dating apps etc. My last straw was this week:\n\nI’m currently doing a Masters degree and one of my professors is the same ethnic background as me - we’re both Arab. I found this super exciting because the uni I’m studying at is not very ethnically diverse, especially in terms of staff, and so having an Arab professor who specialises in the field(s) that I’m interested in was so cool to me and I of course immediately told my mum about it. As an immigrant who isn’t used to representation in academic spaces, she also found it super exciting and was very proud that I was being taught by him. But then she asked me how old he is, if he’s goodlooking…and you can probably see where this is going. I didn’t know whether to start hysterically laughing or screaming.\n\nI told her *no*, you are not going to play matchmaker right now. This is my *professor* and I’m not interested. She didn’t listen. She kept trying to convince me that it was “meant to be”. She looked like she was already planning the wedding in her head. I love her so much, literally more than anything in the world, but I couldn’t take it anymore and I told her she was making me regret telling her. He’s my professor and that’s weird enough, but even if he wasn’t my professor, he isn’t my type, he’s too old for me and I’m *not ready to marry anyone right now* regardless. Her response was the same “I won’t be here forever” rant but this time with “you can’t be so picky otherwise you’ll never get married” sprinkled on top. I just hung up.\n\nI know my mum’s intentions are pure, so I feel unjustified in my anger, yet I can’t help feeling it. AITA for upsetting her/possibly overreacting to the situation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You mom would benefit from learning boundaries. She probably won’t anytime soon, but her unfair expectations of you are a reflection of how her love unhealthily manifests as control.", "NTA.\n\nOp, set boundaries or do as she says. These are your two options, and the winner is pretty obvious. I know it sucks, but it will only get worse if you don't do something. Honestly, I wouldn't be surprised if your mum approached the professor directly. So you may want to set boundaries before something ridiculous happens.", "NTA. \n\n\" When I try to communicate these feelings to my mum, her response is always along the lines of “I won’t be here forever, I want to see you settled and to meet my grandkids before I go.” ***This ends up making me feel selfish, guilty, and as though I’m letting her down somehow.***\"\n\nI know you love your mother, shes your mother, but this is called manipulation. So, you're not over reacting. You need to have a serious sit down with your mother so you can discuss with her how this leaves you feling. She'll either understand because she's your mother and she loves you, or she won't because her beliefs are more important to her than your feelings. That doesn't make your mother a bad person, it just is what it is.  At that point you will have a difficult decision to make.", "Some people are trainable. So train her to understand that when she brings up marriage, you end the call/walk away. She will eventually learn to associate her intrusive actions with being left alone.", "Well, even if he was interested 1) Creepy, and 2) he could lose his job. Tell Mom he’d be unemployed and see if that changes things.\n\nNTA.\n\nI know what it’s like when a parent tries to run your life for you and it’s incredibly annoying, not least because at your age, you’re just trying to figure those things out for yourself anyway. \n\nI guess the next time she starts with the whole, “I won’t be here forever,” you can always shrug and say, “oh, well.”", "Arab family so what do you think would happen if she were gay/lesbian? Lmao", "Her father passed away along time ago.", "Move to another country where your sexuality won't threaten your life.", "I am a college professor. Even if your mother tried to set you up (don't leave your syllabus or anything with his contact information where she can access it), he would have to say no. Most schools have very strict rules that prohibit faculty from dating students. It's something that could get him fired. And even if he was allowed to date you, what matters is that you are an adult and it is your choice, not hers. But I think that if and when you have kids, she's going to try to control how you raise them. It's important to set boundaries now. NTA", "NTA\n\nMy dad started nonsense like this out of the blue one day and I may or may not have burned my bridge with him and his family during a function when he attempted to embarrass me in front of everyone by crying he'll never get grandkids. Hello! I'm disabled and I have fertility issues. \n\nI would forewarn your professor, however, on the possibility of getting an email from her with this nonsense due to his contact being public.", "NTA. Ew.", "NTA. The professor may be married and have children of his own. Your mother needs to find something to do with her spare time, instead of trying to make a match for you.", "Omg you're only 22!! I bet he's a lot older! Screw that! Your mom's crazy, just eww! So unethical and inappropriate! NTA", "Sorry (not sorry) but your mum’s intentions are not “pure” they are entirely selfish. She wants to see you married & give her grandchildren - all about what she wants. Give yourself some space from her and concentrate on what you want. Take it from this old bird, time invested in yourself is never wasted.", "You need to have a come to Jesus with mom. You need to sit her down at a neutral time and set some hard boundaries that you will follow up on. “Mom, I love you, and I love that you want the world for me. But your incessant drive to participate in finding me a husband makes me not want to tell you things and makes me sad. I don’t want to feel sad when I see you. Please will you agree to stop bringing this topic up? If you don’t I will have to start taking my own action to get you to stop. If you continue to bring this up, then every time I will simply get up and leave. I really don’t want to do that, so you understand how this is hurting me? Will you agree to not bring it up anymore?", "Ask her if she'd be fine if he was unemployed, because dating a student of his sounds like an excellent way to get fired as a professor lmao. NTA", "OP outright says her ethnicity isn’t common at her university AND that her mom’s an immigrant, you’re reading what you want to read", "Sounds like your mum needs to be fixed up with someone. There must be a tinder for seniors app out there. \n\nOr join a club, play cards, knit, bowl, do puzzles, learn to salsa dance, volunteer, whatever to get herself out there to redirect that \"my daughter must get married and give me children\" energy to something more positive.", "Her intentions AREN’T pure. NTA", "NTA but also your mom wants this professor to lose his damn job. Fraternizing with students is grounds for breaking tenure.", ">I know my mum’s intentions are pure\n\n\nI'll never quite understand how people defend their parent's obvious sexism and abuse with \"they meant well\". \n\n\n\nHow exactly does she mean well by this. \n\n\nYou've told her what you want, she ignores this. That already makes her actions unfriendly. She's not taking your wishes into account, only hers. \n\n\nOn top of that her wishes are super sexist and patriarchal. She wants you coupled with a man, any man, even if he's way older and literally your teacher. \n\n\n> so I feel unjustified in my anger\n\nI mean I'm not saying ditch your own mother, but you're not unjustified in your anger. Be angry! This is something you can be angry about!\n\n\n\n>AITA for upsetting her/possibly overreacting to the situation\n\n\nNonsense, it's not like you're hounding *her*. She's the one doing this.", "Mention that you could get kicked out of your Masters program if you bave a relationship with your professor.  Aslo just lie and say he is married.  Then go LC for a bit.", "NTA your mum has mental problems tbh", "NTA, trying to push you onto you professor is a good way to completely sabotage your degree and get him fired for misconduct.\n\nAlso she needs to stop meddling in your love life.", "NTA you obviously love your mother but her behavior with you finding a man is intrusive , and unhealthy. It’s understandable\nYou’d feel angry.  Please tell her  that she is hurting you by insisting your value is finding a man.  That if she wants to contribute to your happiness she needs to start by respecting your boundaries and your wants  in your life . \n\nIn any case I’m sorry for the loss of her husband and your father.", "NTA. It's your life, not hers. If she wants a baby around that bad, she can find herself a new husband and get pregnant again. How dare she try to pressure you.", "Tell your mother that a relationship between student and professor would destroy both your careers as in most places it's ethically looked down upon and there are policies in place to prevent it. It is literally career suicide for most people. Ask your mum if she wants you to have a poor husband who lost his job and destroyed his career by pursuing a student.\n\nI think you should be able to say \"mum, I don't like being forced into relationships when I'm not ready\" but obviously your mother is too far gone, she doesn't care what you want. So you have to give her something to care about- like your future husband's ability to provide", "NTA this isn’t Romeo and Juliet era you’re allowed to start dating and marry whoever you like", "NTA. Your mother' s intentions are not pure. She is selfish. She does not respect you as an adult. When you get married she will push you to have children when you have a child she push for another child and so on. Tell her in no uncertain terms to stop or your relationship wil be seriously damaged. Most universities have policies regarding professors dating their students. He could lose his job.", "Pretty sure it could cost the prof his job (or at least a lot of stress) if it was even hinted that he might be \"taking advantage\" of his younger female students. If he isn't interested, it could end up with YOU being sanctioned for harrassment, or at least severely damage your image and relationship with the staff and students in the class. Imagine having your mum on campus trying to force the two of together. She needs to get her own life and let you have yours. NTA", "NTA\n\nDating your professor will damage your academic reputation.  It could possibly also damage your professional reputation.  Sadly she may not understand that OR she may not care because she wants you married and pregnant.\n\nYou are young.  You are absolutely correct in wanting to wait.\n\nIt's possible she's lonely.  Is there any club/meetups in your area that may interest her?  Maybe go with her a few times, and encourage her to make friends/take up new hobbies.", "nta but stop telling her anything. put her on an info diet and change topics or hang up when she brings up boys/men/marriage.\n\nif she starts guilting you then ask her \"why are you sick?\" or go \"if you still have the energy to talk about this, then you have the energy to live long enough for me to be ready\"", "Oh for the love of Pete. This is ridiculous - NTA. \n\nAs for your mother: her behavior doesn’t deserve a response other than a one-time warning along the lines of “I’m not interested in discussing this with you and will leave the conversation if you continue.” Then follow it up by politely removing yourself (sounds like you have done that - good work). **Consistency matters when teaching others how to treat you.**\n\nRemember that your mother could have chosen to have children earlier (to increase her odds of living long enough to see her kids’ potential marriage and grandkids), take even better care of her health than she has (same reason), have more children (to increase her odds of having a child who would want to marry / reproduce), remarry someone with children and grandchildren already, adopt a grandchild (to get the grandparent experience independent of other autonomous people’s choices while also helping society) etc. She made the decisions that were right for her, and you will do the same. Your uterus is not her property, and it’s painfully reductive of her to assume that any racially or culturally similar male you meet will be an appropriate partner.", "Badgering her daughter to have sex with the nearest male for babies against the daughter’s protests is not what I’d call “pure” intentions, OP. \n\n\nYou’re trying to build a life for yourself—why is she so against it? NTA but be careful, it doesn’t sound like she actually wants what is best for you, just what she thinks is best, whether it actually is or not.", "NTA.", "NTA.  Is she trying to ruin the man's career and possibly yours?", "NTA. Her intentions aren’t really that pure. She’s stomping every boundary you set about this. You need to shut this down. Anytime she brings it up, leave or hang up the phone.", "NTA, your mom may have good intentions, but that could be very damaging for your professor.  He could lose his job, as well as his reputation.  Please tell your mom this, and maybe she will back off.  She may also be projecting some of her own stuff onto you to.", "Sorry to break it to you but your mom's intentions are NOT pure. She is not listening when you tell her your needs, plans or decisions. She wants a grandchild because its important to HER, not because she is a actively supporting your life and believes getting married and having children ASAP is in your best interest. You have repeatedly told her no, and she keeps pushing. Stop feeling guilty. You have a right to make your own life choices. ONLY you should decide who and when to marry, and (with your partner) when and how to have kids, etc. Because YOU are going to be living with those decisions (literally, in the same house) for YEARS. Your mother will not be looking after your home or husband or kids YOU WILL. Put your foot down now because her pushing (marriage, house, kids, what else will she try to dictate?) will never end until you do. You are NTA but you need to stop this cycle.", "NTA. You should probably mention that what she is pushing on you is a serious ethics violation that could get him fired and you kicked out of most colleges. Also that most people aren't ready to marry at 22; you'll be fine.", "The question you need to ask her is which is more important to her.\n\nSeeing you married?\n\nOr seeing you happy?\n\nNeither excludes the other, but which is her actual priority?\n\nNTA", "Fourth, what if the professor is already married and the OP's mom ruins his marriage..", "Nta, you definitely SHOULD be picky about the person you will be spending the rest of your life with! Your mother doesn't have to care because all she sees is the end result being grandchildren, but she won't have to be the one who lives with him. If her only requirements are that he's male, makes money and is the same religion as you, then I wouldn't want her planning my future if I were you. That's an extremely low bar for something that won't affect her.", ">I know my mum’s intentions are pure\n\nNo, they're not.\n\nYour mum's intentions are incredibly selfish. All she cares about is \"me, me, ME\": what **she** wants for you (marriage with a husband), what **she** wants for herself (grandkids).\n\nNotice how she never advocates for what **you** want??? Doesn't support you in living your life and achieving your dreams in **your** way???\n\nPlease stop making excuses for her selfish, overbearing behavior. Your anger **is** justified. You are NTA.\n\nTell her that marriage and kids are no longer a valid topic, and that any time she mentions them, you are going to walk away / hang up the phone. Then stick to it. Walk Away. Hang Up. Every. Single. Time. It's the only way you are going to train her to leave you alone and let you live your life *your* way.", "NTA.  It sounds like you have a pretty good understanding of what you want in your life right now.  Part of the problem with your mom is the \"I won't be around forever\" feeling she has.  She wants to see you dating, married and with kids and may be afraid time is slipping away.  Don't be pushed into doing things just to soothe her anxiety.", "In the academic world, it's generally frowned upon for professors to date their students. Lots of male academics haven't got that message yet though. I know you're not interested, but don't let your mother near this fellow - she could lead him to have expectations which could impact badly on your study and career.  And don't let her persuade you you're being 'picky'! Hold firm, you're definitely NTA!", "NTA\n\nI'm a professor. If a student came on to me, it would not only put me in an extremely awkward position, but would be something that could hurt the student's future at the university. Even if you weren't reprimanded, it will strain your relationships with the faculty who are responsible for recommendation letters, mentoring your thesis, etc. And that's assuming your professor is a good person who wouldn't take advantage of the situation. Honestly, the fact that your mom would even suggest what could be a very bad relationship situation for you worries me. It sounds like she doesn't just want you to find *the guy*, she wants you with *any guy*. \n\nTwenty two is very young to get married, and you should not feel guilty about that. Even if you were 42, you still wouldn't owe your mother marriage or grandkids.", "NTA. You didn't say anything mean or hurtful to your mother, and quite frankly your mother's behavior is a bit ridiculous. She may mean well, but she needs to realize that it's your life and not hers.\n\nBut on the flip side, she isn't necessarily doing you any harm either. When clicking this thread, I assumed your mother had gotten in contact with said professor. So just try to remain respectful.\n\nFrom my experience as a 29 year old male. I've always been kind of quiet, intrapersonal, and just downright ugly and awkward if I am being honest. So I knew from a young age that I never wanted to get married or have kids. Up until I was about 25, it would upset my Mom if it ever came up in conversation. I'm sure it still upsets her now to a degree, but outside of some polite remarks like \"there is someone out there for you\" comments, I think she has accepted my life decisions finally.", "NTA. Tell your mom that you love her, but she’s damaging your relationship by trying to pressure you into marriage. Tell her the topic is closed. If she brings it up, hang up, leave, etc. until she gets the message and backs off.", "> This ends up making me feel selfish, guilty…\n\n*She* is the selfish one and *she* should feel guilty for guilt tripping you about life changing decisions that are not her business.\n\nNTA", "Can we also talk about the fact that dating a professor is a huge code violation at many schools, and cause him to get fired and you to be expelled? \n\nEven if you were interested in him, he was interested in you, and everything was perfect, it’s unlikely that he would be willing to risk his career.\n\nYour mother meddling could still create some risks to his job.", "Op needs to put her mom on a timeout and info diet. If you don't want to cut her off, tell her you won't be talking about your love life anymore. If she does, hang up every time she does and then mute her calls for a while.\n\nShe sounds like OP is just her incubator and not her daughter, a real person.", "I mean technically it's not against the rules or anything but it is frowned upon.  /Ross", "And OP is the one stuck - STUCK - with those decisions. Having a child is for life. And it is not fair to anyone - OP, future husband, kids - to just marry to make mom happy \"before she goes\".", "Bingo", "they're also implying that non-islamic countries aren't actively hostile towards queer folk lol", "Your mother's insinstence on this is for her not you... What do you mean by \"[her] intentions are pure\"?", "NTA. \n\nMy mom is EXACTLY like this and it drives me bonkers. Granted, I’m 31 but she has been at this since I’m 22. Why is it so hard to fathom that this isn’t 1955, you have other priorities and goals for your life that don’t include men AND you have PLENTY OF TIME to meet someone!", "NTA. She’s guilt tripping you for not doing things on her schedule. You’ve asked her to stop but she hasn’t. Sounds like you need to set some firm boundaries here. “Mom, I love you and I know your heart is in the right place, but I need you to stop pressuring me to get married and have kids when I’m not ready. If you cannot respect me enough to do that, then I won’t be spending as much time with you because I need to focus on my studies” or something to that effect.", "NTA. Your mom needs some therapy. She needs a pet to obsess over. Or a hobbie.", "Turn it around on her. Ask who she is dating and when she’s getting married and why hasn’t she provided you siblings yet. \n\nAlso, leave your professor alone - dating you would be a violation of everything he is supposed to stand for as a teacher and might get him fired. \n\nNTA", "NTA. She's seriously manipulating you. You're in charge of your own life and when you marry. Set boundaries and ask her to stop this, and then hold her to them. You might need to consider going NC or LC.", "NTA but I would’ve told her that he’s married with kids to get her off your back.", "This!! I hope she doesn’t do anything because she could seriously put his job and his reputation in jeopardy. On top of that, people may well lose respect for you too if they thought you’d slept your way to a good grade. You’re NTA for being adamant about saying no. If she keeps pressuring you, maybe mention (if you haven’t already) that a relationship between you and your professor would be a detriment to both of you as working professionals anywhere near academia. I know that’s not the only issue here, but it might be one she’s most apt to listen to.", " \n\nIt doesn't seem like he really wants the best for you, whatever he thinks is best or not.", "NTA- And you have to make it clear to her that he would likely get fired if he dated a student, and even if he wouldn't it would be wildly unethical, so even if you had liked him, he'd be a wrong 'un if he had a relationship with you!", "NTA\n\nI saw someone write about this technique in another aita post: Tell her that every time she mentions marriage, you won't visit her for a week (or whatever time period you think is suitable). Next time she mentions it, it'll be two weeks. Then three etc. And stick to it.", "NTA, and I am sure your university has rules against professors dating students. Tell your mom that even if you were interested it would be a no-go because he would get fired.", "NTA\n\nYour Mum's intentions are not pure. She is a massive AH for putting pressure on you.\n\nYou do not exist to gratify your mother's desire. \n\nBringing children into the world is a huge responsibility. And you have NO responsibility to provide grandchildren for your mother.\n\nShe needs to get a life and let you lead yours.", "You'll hate to do this but she's trampling on your boundaries. You can't control her, just what you tell her so you need to put her on an information diet. \nI recommend you also tell her it's bordering on harassment and you don't want to talk to her as much anymore because of it.", "OPNTA it is okay to not do as your parents want you to do it is ok", "She is the asshole", "The road to hell is paved with good intentions.\nNta", "NTA\n\nAsk her why she wants to you marry an unemployed person. She'll say \"but he's not unemployed!\", and you say \"he will be if he has a relationship with a student as it break his employers policies\".", "I just want to add on to this. It is very good of you to not want to get involved with your professor; however, depending on how desperate your mom is, you may want to have a frank talk with him about it. It might be bad if your mom called him up to try and get him on board. Even a little head up to say your mom is relationship crazy might help establish boundaries. Otherwise, you might find yourself in a situation where your mom manipulates your professor, which could be terrible for your future.", "I mean have you seen whats going down in the US nevermind whats going on in Europe right now?", "NTA, and I think you need to start to realise that you're mother's intentions are not pure, they are selfish. It is not pure for a mother to want to have her child torpedo their entire life trajectory for her own benefit.", "NTA. Does your mother's rush to get you married and pregnant, even to your teacher, stem from her wanting to look for a man herself, or is it still the conditioning that women must have husbands and babies to be validated?", "NTA Her intentions aren't pure they're bathed in misogyny in that somehow you a soon to be highly educated woman just can't possibly live your life without a husband to support you. You're right that your too young, don't even think about a serous relationship until at least 25, find out who you are before you try to find a partner.", "You are only 22 why is she rushing you, does she feel she has no purpose in life if she is not mothering someone? hence her insisting you get married and give her grandkids (because that's always a good reason to procreate lol). Have you considered introducing her to community activities or women's groups that could take up a chunk of her time and stop her from obsessing over what you do with your life? It might get her off your case a little bit. NTA", "NTA and it is past time to put your mother on an information diet. Tell her that if she continues to try and pressure you (because lets face it, your mother has grandbaby fever and you are her only way to get them), you'll be going low contact. If she continues to try and pressure you, you'll put her in time out for a week and then each time in the same conversation, add another week where you won't be contacting her at all. And reinforce the point by saying that you won't invite her to your wedding when it happens or let her know your children because she keeps pushing you into something that you are not ready for. Tell her you know it is coming from a place of love and concern, but it is causing more harm to her relationship with you than she realises."]}