{"id": 9024, "submission_id": "10skso7", "title": "AITA for wanting my husband to say I am an author?", "selftext": "My husband and I have been together for 15 years. We were talking about an other AITA post \"the pilot\". And it came to me mentionning that I would be proud when he introduce me, or talk about me that he says I'm a government employee, BUT also an author. To be clear, I am 31, I wrote 7 books and 6 of them are published. I have 4 publishers in Canada. I sometimes do book fairs and presentations. And have a check once a year for each book. Anyway, my husband said that I am not an author, because I do not do that for a living. And that he would be upset if someone said they were and later on learned it was just a hobby. I am wrong?", "created_utc": 1675432285, "permalink": "/r/AmItheAsshole/comments/10skso7/aita_for_wanting_my_husband_to_say_i_am_an_author/", "score": 144, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I wrote and published books, it it concidered being an author? (2) asking my partner to mention it when he present me to people.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Lots of creative people need a job that pays the bills. You’re published so you are very much an author. If I dated someone who had 6 published books that would absolutely be something I would tell others about them and it’s pretty darn sad that your husband doesn’t want to brag about that aspect of who you are.\n\nNTA", "NTA. You wrote *seven* books? Has he ever written any books? No? Then he can stfu. So many people under value artists because they think \"anyone can do it.\" Not everyone can write, and not everyone can even *finish* a book. He's being dismissive and disrespectful of your achievements", "NTA\n\nYou want to know what it takes to be called a writer?\n\nWriting - no matter how little, how big, how much, if it's published or not.  If you write, you're a writer.", "NTA\n\nSeven books is awesome! Let alone six published!\n\nYou are an author, even if they weren’t yet published you’d still be an author - because you write books.\n\nThis whole thing of unless it’s your primary source of income it doesn’t count is total bs.\n\nSuper rad that you can accomplish this and have a job as well.", "NTA, frankly I think him saying he would be upset if a published author said they were an author and he later found out they had another means of income is a weird take on it.", "You’re an author. More important, you’re a published writer. Why is your husband belittling you?", "If you’ve been published you’re an author. Can people go buy your books? You’re an author. I don’t get why some people are so hung up on things like this.\n\nStart your own Wikipedia page and list yourself as an author on it. If people google you they can see it right there to make your husband feel better. Problem solved.\n\nNTA.", "NTA, you’ve published, you got paid for it, definitely an author. If anyone says you’re not, send them a link to buy your book.", "NTA. Does your husband enjoy any of the fruits of your labor($$$)? DH sounds jealous.", "NTA. Gosh, it's not a hobby if you're been publishing.\n\n\"You don't do it for a living\"??? Wow. Maybe if a certain husband supported his author spouse, maybe the books will have a bigger audience and will give bigger royalties. Idk.\n\nHe's probably insecure. But that's just my opinion.", "It's not a hobby if you are getting paid and you consider yourself an author.  I think your husband clearly has some insecurities about your success.  In his shoes I would be bragging about you to anyone who would listen.  NTA.", "NTA. People don't always list all their careers when they have multiple just the one they are best known for or most want to be known for. Think of all the actor/model/writer/singer/dancer's there are or people working two jobs because the first one doesn't quite cover all their expenses. You get to pick what you want to list your main career as.", "NTA - you were an author before your first book was published, and it is really troubling that your husband is so unsupportive. He needs to shift his mindset - because it is clearly impacting how you view yourself. Why is he doing this? Is primary financial support his only metric? I am sensing this as a red flag or controlling thing, but not sure if I'm over-interpreting.\n\nMy younger son is a musician and video producer, but his primary income comes from being a producer at our local news station. That is what funds his passion, but what fuels his fire is music and cinematography. I would never introduce him as anything else ... because I support WHO HE IS.", "NTA. So I read the post about the pilot guy. He didn't even have a pilot license let alone actual fly time. He didn't do anything that would be necessary to actually be considered a pilot. Literally just read expensive books and flew virtually. \nYou on the other hand have written 7 whole ass books. That requires so much time and commitment. Most importantly, you finished. On top of that, you had six books published. You've done everything necessary to be considered an author so I say you are one and your husband can get over himself.", "NTA\n\nfirst, yu've been published and paid, that makes it professional.\n\nsecond, *most* authors don't earn enough to make it their full time work.  For every Stephen King, there's 79933772245923 others making enough to put a bit aside for a rainy day from their published work.", "NTA. Published writer=author. You’re an author. You always will be an author even if you never write again. The title has nothing to do with whether or not it’s your full-time job.", "NTA, I think the moment you get a book or piece of writing published you’re an author, having done it 6 times over and being well known enough to be at book fairs definitely cements it. Besides that, this isn’t one of those things where a nurse claims to be a doctor or a student claims to be a doctor etc where there could be real consequences to giving someone a title you don’t think they’ve earned. Even if we give your husband the most unbelievable level of benefit of the doubt, and that he truly holds that standard, (which he doesn’t.) there is 0 downside to giving your wife a compliment she may or may not have earned. Couples do that all the time, when my girl wants to butter me up she starts talking about how big and strong I am, is that, strictly speaking 100% true? No I’m not a strong man or anything, but it makes me chortle and that’s enough for her to want to say it. That should be your husband’s feeling, “even if I genuinely don’t think this is technically true, I want to say it because it’ll make my wife smile.” The fact that he’s not even close to that is a bit alarming.", "NTA.\n\nYou’re an author. I am just getting close to finishing my first book so 7 sounds incredible!! Congrats on your success!\n\nThe average writer makes 10000-20000 dollars a year. Yes, the New York Times best sellers are comfortably living off their book money but a very large chunk of published writers are out here working day jobs because they’re not making enough to pay the bills without it.", "**NTA**\n\nAnd honestly, as a former literary agent, my eyebrows are currently somewhere up in my hairline and I'm seriously side-eyeing your husband because I don't think he understands how any of this works. You are the very realest of the real kind of published author there is, my dear, and you should be incredibly proud of yourself, because what you've accomplished is rare, not easy, and a big deal.\n\nYou need to explain to your husband that with the VERY rare exception of a SMALL HANDFUL of international bestsellers, the vast majority of even the most accomplished authors in this day and age have day jobs. The traditional publishing industry has been hit HARD thanks to everything from Amazon undermining it (long story), the tidal wave that is easy self-publishing (don't even get me started), and the biggest publishers all devouring each other and turning into mega-conglomerates that have destroyed competition. If you're not Stephen King, Margaret Atwood or the like, and already have an established audience of literally MILLIONS, you have a day job, because you CANNOT earn a living just selling books. And most of their money comes from selling TV and movie rights and adaptations.\n\nMy point is, again: you are absolutely, 100% a professional author, the realest of the real. You have been traditionally published, your manuscripts selected by editors at publishing houses, contracts were signed, and your books published, marketed, and distributed in stores. There is absolutely nothing substantive that differentiates you from a Margaret Atwood or a Stephen King other than perhaps sales numbers. One of my dear friends is an acclaimed author whose book was recently shortlisted for one of the top literary awards here in Canada and she has an Etsy shop on the side, LOL. Many of my clients were teachers (I represented mostly children's authors and illustrators), or worked as freelance editors themselves! \n\nYou are NTA for wanting your husband to acknowledge that you are an author, because THAT IS WHAT YOU ARE, by any objective measure. He's just . . . wrong. And you can take that from a longtime former publishing professional.", "NTA. You’re literally a published author who is paid for their books.  You’re clearly an author. You should be proud. A supportive husband would be proud of that. \n\nHow is this even a question for your husband??? It’s not at all like the “pilot” who had never had a flying lesson or ever flown a plane. There are pilots who don’t fly planes for a living, and they are still pilots, but they actually do fly planes.", "NTA for now refusing to say it. On face value I get where he is initially coming from. I refer to my wife as a therapist because that's a current job, not as an actress because that's what she was when she was younger and I always felt that was a side job. But if she asked me to refer to her as that, I would absolutely do that which is what your husband should.\n\nOnce again. I don't think your husband initially did anything wrong. He referred to you as the main job he sees you do everyday. But once you made your request he should have then followed that instead of being dismissive.", "NTA but out of curiosity what’s the genre? Is it something he’s embarrassed about and therefore doesn’t want to mention it?", "Almost all authors do not make enough money to live on. They have a job to provide a roof and food and cover the costs of their writing career. \n\nAs an author of 6 published books, especially as these are published by recognised publishing houses (you get a royalty check from them) and not vanity publishers (where you pay to have the book published) then I would class you as an author.\n\nYour husband should be proud of your success. And it IS a success.\n\nNTA", "Almost no authors make enough to live on solely from their book sales, so ... Your husband can stfu about you not making a living means you're not an author.\n\nYou wrote SEVEN books. That is seriously impressive. That's not just a lil side hobby, that's dedication to your work of BEING AN AUTHOR.", "NTA. If you’re published a book, you’re an author. If you earn money from it, you’re a professional author. If you also work for the government, you’re a professional author and government employee.", "he doesn't seem to respect you very much.\n\nI wrote on the side for awhile, content for start ups on the internet, as they tried to direct traffic to their fledgling sites.   LOVED that first check, cus it meant I was a PROFESSIONAL WRITER.           You are 100% NTA.      And congrats on your writing success!!!", "NTA. And I sure hope he’s not benefiting from your book money!", "NTA. I hate this idea that in order be something creative; a musician, an author, a painter, etc. You have to be able to support yourself from that income. \n\nI am a singer and cabaret host. I get paid to do this work (and it is work). Can I support myself solely from this job? No. Does that lessen the value of that work? No. Honestly, even if I didn't get paid, I would still consider myself a singer. \n\nYou have written, published, and been paid for your work. Therefore, you are an author. You are also something else. You are also many other elses. People contain multitudes dammit!", "NTA, it's not a hobby if you're getting paid, it's a second job. I wouldn't spend any of that money on him until he learns to respect your accomplishments! Six published books! SIX!", "Hell. I've been writing ONE book for SEVEN years and am proud. You're actually PUBLISHED. You have every right to be called an author! NTA", "NTA, how many books do you have to write to be considered an author? If he can’t stomach calling you an author (insert eye roll here), he can introduce you as a government employee who has published 7 books.", "Info - so you are asking him to say you are a government and employee and an author, and he will only mention that you are a government employee because that is your main source of income?", "You are a government employee and a published author. Be proud of it.", "Boo, if you are published then you are an author. 6 BOOKS - Good for you!!!\n\nNTA.", "The difference between you and The Pilot is that by virtue of you being published (and fairly successfully, i assume), you have actual experience on the job. The Pilot had never flown a plane beyond simulations. It might be a different conversation if you’d not been published or hadn’t actually written anything beyond a few notes on paper. \n\nNTA. I’m sorry your husband is undervaluing your accomplishments.", "NTA.  If you get paid for something, you're doing it professionally.\n\nYou're a published, represented author with a second job.", "NTA. You were an author the moment you wrote your first book!! But you’ve written seven? Six of which have been published? Lady, don’t dismiss your achievements, much less let your husband do so! You have every right to the title!", "NAH.\n\nI don't know, I'd find it weird honestly.  I have a friend who has published 3 books.  So not as many as you, but also, not nothing.  He has done book signings and things like that.  That said, he works in marketing as his career, even if he has made money (not a ton, but some) from writing.  If he started demanding that I refer to him as an author and not what he actually does with his time, I'd probably do it, but would also think he was being a bit overbearing about it.  \n\nSimilarly, I know a guy who on occasion does gigs as a voice actor.  But, his job is in sales.  If he started demanding thats how I refer to him, I'd find it odd", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I have been together for 15 years. We were talking about an other AITA post \"the pilot\". And it came to me mentionning that I would be proud when he introduce me, or talk about me that he says I'm a government employee, BUT also an author. To be clear, I am 31, I wrote 7 books and 6 of them are published. I have 4 publishers in Canada. I sometimes do book fairs and presentations. And have a check once a year for each book. Anyway, my husband said that I am not an author, because I do not do that for a living. And that he would be upset if someone said they were and later on learned it was just a hobby. I am wrong?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I have a friend who does videography for his local town and various projects in the area. He also has a job at Amazon for the rest of his income and the health insurance. I would not consider him an \"Amazon warehouse employee\", I would consider him a videographer.", "NTA but your husband is.\n\nFrom the Oxford English dictionary\n\nauthor\n/ˈɔːθə/\nLearn to pronounce\nnoun\na writer of a book, article, or document.\n\nLiterally you are a 6 times published author. Your husband is wrong. You can be 2 or more things at once and most authors and other creative people will work at least part time in a paid position. You didnt stop being a daughter when you became a wife and you don't stop being an author because you are employed in a paying position as well.", "Idc all y’all opinions don’t matter only mines cuz BHM you feel me imma say 🗣️:NTA BECAUSE I FW HOW YOU ARE MAKING IT OUT IN LIFE BY PUBLISHING BOOKS, THIS IS SOMETHING YOU CAN LOOK BACK ON JN THE FUTURE WHEN YOY ARE A MILLIONAIRE", "NTA\n\nYou are an author, and your husband is a petty AH.", "So the difference between professional and amateur is if you get paid. Your books are professionally published and you get paid so yes you are an author.", "NTA, sounds like he's jealous. Anyone who has had something published has the right to call themselves that, be proud of your accomplishments! Congratulations on your success.", "NTA I'd you write, your an author. You've published 6 books, so you're definitely an author.", "NTA, but your husband sounds like to God of gatekeeping.", "The \"pilot\" had never flown a plane. He was NOT a pilot and was one of the biggest AHs I've seen on this website. You, on the other hand, have actually published 6 books, so you ARE an author. NTA.", "NTA", "Listen, you're a musician even if you only play music non-professionally.  It works the same way for writing.", "NTA. You wrote books that supply a salary. It is not like the pilot post where you read about writing books….you actually wrote them.", "NTA but honestly your husband sounds a little (or a lot) envious of your success.   FYI if you've published 7 books and get yearly royalty checks it's not \"just a hobby\".", "NTA \n\nEven if it is a hobby, it’s a hobby that got you published and recognized! If he tried to down play it, just hype yourself up! “Oh she only writes as a hobby” “Yeah! In my spare time i published 6 books, I don’t have a lot of free time for my “hobby” but I sure am glad 6 of my works have been published. My hobby comes with 6 checks a year for each of my books. It’s crazy that a hobby could be so profitable!” Be OBNOXIOUS. There’s nothing wrong with hobbies btw, it means you have the time to create something YOU love. But in any case you are an author and if he won’t say it, I will. I am so very proud of you! Good luck in all your future endeavors and publications!", "NTA.  You've had 6 books published, and you make money off of them, even if it isn't your main job.  You are an author.  Lots of people who write (and get published) also have day jobs, because it can be very difficult for authors to make a living.", "NTA \n\nI’m pretty sure most artists need “day job”. Doesn’t make their art any less real. \n\nCongrats btw - that’s an incredible achievement and very few people get there.", "NTA. My husband brought me flowers and took me out to eat to celebrate the first time I was published. I always had another job too. Being a partner in life means you are proud of the other person's achievements. You have a husband, but I don't think you have a partner.", "NTA Hobby writers don't have 6 published books, what an incredibly belittling comment.  \n\nThe obsurdity of his position is that you a published author work a 2nd day job for your families benefit and instead of being happy he is married to such a driven women he degrades your art to \"just a hobby\".", "NTA. If you are published, you are an author. To give you some perspective, I am a singer. It's not my main occupation, but back when i had more free time I used to be one of 15 paid singers in the chorus for my city's philharmonic orchestra. My husband loves to brag that he's married to a professional singer, lol. Your husband should be your biggest fan and hype person!!!", "NTA. You know who shouldn't be introduced as an author? Me, who's only published fanfiction. But you know who **fucking earned** being called an author? YOU, who's literally a published author (btw, seven books is *amazing*, congratulations!!).\n\nWhy is your husband so petty? It's not like you published like, a short story in your high school newspaper, you published books, real books.\n\nConsider my mind properly blown lol, what's the deal with your husband??", "Nta.\nYou're published.  You make money off them. People can be and do more than one thing. \nYou ARE an author. By any and all standards.", "Nta, and tbh if your husband told people how many books you write they'd literally laugh at the fact he doesnt consider an author. Not every author only just writes books. Plenty of them have other careers  this isnt uncommon.", "NTA and your husband is living in la-la land. VERY VERY VERY few authors make their living solely from writing, they pretty much all have other gigs. I wonder, does he think TS Eliot was an author? Or just a banking clerk?", "Run this by him. Imagine someone who has two jobs. One as a Personal trainer, one as a server. They get paid for both, but they get more money and hours from their server job.   \n\n\nDoes that mean they're not actually a Personal Trainer? or... Is it possible that more than one thing can be true at a time?   \n\n\nYou're both a government employee AND an Author.", "NTA. \n\nYou are not wrong. You are an author. \n\nAlso, it is 1000% okay, and reasonable, to be proud of it.\n\nYour husband sounds jealous, disrespectful towards you and/or vexatiously narrow-minded. I hope he's got some good qualities somewhere.", "Late to the party, but when presenting someone in a social situation, lead with tidbits that will make for interesting conversation, ie - OP is a published author! (nta)", "YTA \n\n1. Its normally what your current main income and occupation (except in settings where the main reason you are there is because of your writing)\n\n2. Its usually normal in social situations to only mention one thing, not everything.  \"This Ari, she is a employee, author, wife, daughter, grand-child, 3rd cousin, lover of fine cheeses and a critic of World-War 2 movies\"\n\n3. If you were write a book about someone introducing them it would be weird to include both \"insurance agent and painter\" as the verbal introduction.\n\n4. Don't dictate his actions.  As long as they are truthful and reasonably socially acceptable, then he has to want to do it.  What he actually feels who you are is more important than your pride thing (\"I would be proud\")/how you think others think about you.", "Info:  what kind of income are you making from your books/writing?  Are we talking a few hundred a year? Few thousand? Tens of thousands?\n\nPretty much feel as though your NTA here but I am curious.  If it’s only a few hundred or thousand how about a comprise.  “My wife does X for the government but she’s also an aspiring writer.  In fact she has 6 books published already”.", "Maybe this post will change that? I wish he would brag too. Thanks you for your comments.", "Thank you! I agree. I am a modest person and I am shy about it, but am also proud of my achievements. The fact that its label as a \" hobby\" makes me feel like I didn't do anything. It feels great to hear this.", "Exactly - spend any time on booktok, bookstagram, etc and you will find loads of authors who are incredibly supportive of the mindset shift to calling yourself an author.", "That's true, it could be an alternative. Thanks!", "Right? Most published authors have other jobs. This is such a weird take.", "Honestly, I don't know. But it breaks my heart. Because I feel like I will never be an \"author\" in his eyes.", "Yes, we usually put that extra money on something we want. Or just groceries. To be fair though, he does make 3 times what I make. I don't think its jealousy, its more insecurity I think. Thanks for your comment!", "Thank you! I appreciate your comment. 💜", "I do think its an insecurity issue. We will need to address it. Its so nice to hear a story of a proud parent like you!", "I don't make that much unfotunatly. Royalties in canada is 10 %. And I write french books, so my target is lower. Congrats on you almost done book!", "Do you represent french authors by any chance? I loved everything you wrote! Really, thank you for you comment. 💜", "I agree. Thanks!", "Not at all. They are fantasy for teenagers. And not small books either. They are from 150 pages to 399 pages each.", "He does respect me. After reading most of the comments, I do think its an insecurity issue that we will need to address. The first check is indeed always nice! Even if Im mostly writing for myself.", "I like that alternative a lot!", "Yes, I was simply telling him that when he talks about me, he can mention that I work for the government, but also an author. He will mention only the government because of money basis.", "This is the reason why I asked him to mention my main job and also being an author. Like you said, it would be odd to refer someone as only voice actor or author if they are not doing it full time.", "Thanks, I will also share this with my husband. I am sure he will be happy that at least one person agrees with him.", "You can't be \"aspiring\" to be a writer when you've been published six times. \n\nThe aspirations have been met, objectively.", "\"Aspiring writers\" are people who haven't been published. She's a published author.", "I would say around 2000 per year. Probably 5000 if I do book fairs that year. What you said in cotation is exatly what I would like.", "Sp everyone with two jobs just had the other cause its a hobby, definitely not cause most people can't make ends meet. ... your hubs is wild with his logic.", "If you get paid for it, it isn't a hobby. \n\nYour husband sounds jealous. Nta.", "I know a NYT best selling author. He had a day job until he retired. He’s written loads of books. You are an author!", "I feel you. I'm also an author who doesn't do it for a living, the first time I was published was in high school. It very much *is* something to be proud of, even just finishing a book is a massive achievement! Then the process of publishing is like sending your baby who you've spent months and likely years on off to the wolves to get picked apart by someone whose job is to look at everything critically. And after that, you got approved, not once, but *six times*! That's an incredible feat most authors can't accomplish. You should be very proud of yourself and your achievements", "What a fantastic achievement!  It's not easy getting published and get paid for it.  \n\nYou have every right to call yourself a published author.", "Look, you are an author and you are NTA for wanting your husband to acknowledge your other career and accomplishments. But... you are not a modest person; not wanting to seem like a bragging by mentioning your books and asking your husband to do it instead isn't how modesty works.", "No. No. No. I have 30 books published in the US and a lot of award nominations. I made six figures before I retired, but from my day job. “Auth-ing” is what you do when you’re at book fairs, singing books, bring on panels, holding a drink. Writing is what you do when you put yourself in your chair, fill up those screens, revise, swear, pray and send it off. ANY of that deserves respect. Achieving six published books isn’t just respectable but enviable. And you are only 31! That is tremendous. I don’t know why your husband is being so withholding but it seems to me that you are allowing him too much power over how you feel. Does he respect you for anything else? Does he respect himself? I am partnered and when I went through an awful dry spell, he was not only in my corner, he led and encouraged me until I started writing again. I won’t conceal that dealing with a spouse turned author can be trying. You’re worth it. I beg you to take charge of your own self respect.", "Please see my comment. He is wrong. Objectively wrong. And I don't know whether it's because he's jealous or just ignorant, but as a former publishing professional here in Canada, I can assure you that you have every right to be upset at his pettiness.", "Awww... 🥰 Anyway, don't let his comment get you down. Keep writing as long as you're happy with it.", "Well average always means there’s someone making less…point is you’re published and people have paid to read your books. You’re an author! And French definitely makes for a smaller audience. And thank you! Also I’m in Canada too so thanks for the heads up about royalties!", "It does seem like a security issue.    initial read made it sound like he didn't think your 7 novels were a big deal.   Sorry if I came off too judgmental.  \n\non reddit, of all places...    :)", "To give him the benefit of the doubt, he sounds like maybe a rigid, black and white type thinker(maybe engineer type?), so I can kind of see his logic of answering that way because that is your main source of income. \nHowever, especially in this day and age, lots of people have side hustles, and you is actually really cool and interesting. NTA. \nIt isn’t “just a hobby” If you get paid for it. It’s a job, and a cool one at that. \n\nWould it be that hard to say, “my wife is a government employee and writes books as a side gig?”", "Corrected myself in an another reply.  Maybe “aspiring full time writer” is another option but that sounds clunky.", "I mean, I’m not saying OP isn’t an author, but being ***published*** these days isn’t as big a deal as you are making it out to be. With the advent of self publishing and other publishing mediums, most anyone can be a published author these days. \n\nDoesn’t mean anyone can be a ***quality*** author, but anyone can be on none the less.", "Ok then she’s a “burgeoning writer” \n\nPoint is she’s not making her living from it yet. So to say she’s a writer when explaining what she does for work or a living wouldn’t be accurate.  \n\nHowever that doesn’t mean you don’t mention it or refuse to mention it like husband is.  She is a writer, she just also works for the government until such a time when she can focus on her writing full time. \n\nI wish her success", "Yea then What you asking for is totally acceptable. Your husband should be proud of your accomplishments.  \n\nNTA", "Exactly this. I’m also a musician, and maybe the top 5% of musicians don’t also have a “day job”. That doesn’t make them any less of a musican. Same with you, OP. You’ve had seven (!) books published that generate income. You are absolutely an author, and congratulations on your success!", "💜", "You are 100 % right. I need to be more proud of what I did and still do. I also won one award, and was nominated for three other ones. I often forget that. 30 books is amazing! Good for you! I hope to there at some point.", "It might be different for english publishers, but the norm for french one is 10 %.", "Close, he works in IT security. 🤣 Thank you for your comment.", "Quite a few actual canonical authors didn’t make a living out of writing. Daniel Defoe, Henry Fielding, Samuel Richardson, Jane Austen, non of them supported themselves full time through writing. And they were quite successful.", "The awards count. It is also an honor just to be nominated! List your accomplishments. The person whose pride and respect matter most is YOU.", "The next time this comes up tell him that he should respect the fact that you continue to get paid for this so you are in fact an author."]}