{"id": 9089, "submission_id": "10taopr", "title": "WIBTA If I sued my mom over my stolen college fund?", "selftext": "Backstory:\nMy parents got divorced when I was around 11. Around the same time my mom was in a car accident and had won a fairly large settlement on top of my grandpa passing away right in the middle of it. So she was left with a fairly large chunk of money.\n\nDuring their divorce, my mom constantly kept me and my siblings in the loop of everything and made my dad look like the villain in the situation despite my mom cheating being the reason for the separation. And when you’re young, you want to believe your parents have your best interests in heart. My dad paid over $300 weekly in child support for my siblings and I, and when I decided at 20 I wanted to move in with my dad she stopped talking to me for a while since she would fully lose all child support.\n\nPart of the divorce agreement was that my dad would not ask for any of the money from the settlement as long as $40,000 of it went into a college fund for me, since at the time my siblings had no interest to pursue college. Everything was arranged, the divorce papers were signed, and my mom gloated about how much money I would have for school. And on top of that my siblings and I had $10,000 each as an inheritance from my grandfathers will for us to use when we turned 18.\n\nA few years later she had fully renovated my grandfathers house that we moved into, we had a new car, went on a 7 night Disney cruise followed by a stay at a Deluxe Disney hotel. We were fairly happy, and I was a sophomore in high school excited to start looking at colleges, when my mom informed me she spent my entire college fund and inheritance on everything above.\n\nI. Was. Floored.\n\nThe first thing I had done was tell my dad, who became so angry he immediately contacted his own lawyer and take my mom back to court to figure out a way to make that money back. At this point, we lived paycheck to paycheck and heavily relied on the child support to afford living.\n\nSo she was served the court papers and they went in front of a judge, where my mom was given a slap on the wrist since it was determined she didn’t make enough money to pay back the $40,000 college fund.\n\nThroughout my entire childhood my mom was emotionally abusive towards me and my siblings. She manipulated us to be at each other’s throats constantly and was very narcissistic. She continued to get worse during my childhood and my anxiety and depression was crippling. It took moving to a different state to realize how harmful she was in my childhood and to see clearly how much she messed me up, and I went no contact almost a year ago.\n\nMy dad is about to retire and made it known to me that according to his divorce agreement my mom gets a good chunk of his pension, which got my gears turning.\n\nWould I be able to take my mom to court over the college fund again, but this time to try to use his pension to replenish my funds? Even if that means I’m screwing my mom out of $1,000+ a month for my dads work.", "created_utc": 1675501353, "permalink": "/r/AmItheAsshole/comments/10taopr/wibta_if_i_sued_my_mom_over_my_stolen_college_fund/", "score": 273, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am actively looking at suing my own mother for the money that was promised to me in her divorce agreement, knowing that she is owed and has been expecting the pension money.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "#Speak to a lawyer", "NTA. Parents that spend money that isn't theirs like your mother did disgusts me. It would've been different if you or one of your siblings had a medical emergency that required funds but that's not the case here.", "NTA, but you need legal advice ASAP because to my knowledge, this isn’t something you can do on your father’s behalf; he would have to sue her.", "NTA but I don't know if it will work. Technically speaking, since she violated the divorce agreement, things should be brought to court to be rediscussed. Since she will now get 1000$ extra money a month, she will have the money to to pay back the 40000$ college fund but I don't know how these things work", "You’re asking a legal question, and this is not really the proper forum for that. Plus you don’t give enough information for us to even answer this question. For example, what state are you in? My guess is, the statute of limitations has expired on any claim you might have had to that $40,000. Both you and your dad should consult a lawyer to see what can be done. And no, you would not be an AH to pursue a legal remedy here.", "You would be NTA but I’m mostly concerned about the chances of you winning. You’re in the right and I’m sorry you were betrayed.", "NTA. Speak to a lawyer to see if it can be done. Your mother is a thief, plain and simple.", "Don't know where I stand on this one.  Except the settlement was for an accident the mother was in, and it was the mother's father. So it was really hers to spend however?", "NTA. But having learned the hard way: sometimes getting your rightful sum of money costs more than the money you are getting for it. In attorney fees, but also in the 2 years of negativity of the fighting. (Well my case cost 2 years anyway. It was supposed to take 2 months).", "NTA-your mom should be ashamed of herself, but she isn't.  Sue away, and get what's yours.", "YWNBTA however that's just my opinion on would you be an asshole for suing. Even if i did think y.w.b.t..a I would not think that if all you did was just talk to a lawyer and got all the documentation to see if you actually have a case because it's what is in writing matters, not what you were told. Beyond my opinion that you would not be the asshole this is a question for a lawyer not reddit.", "NTA wow mum had everything a divorcee would want. Divorce with child support $, settlement $, inheritance $, pension $. This was a plan in the making a long time ago. Didn't include you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackstory:\nMy parents got divorced when I was around 11. Around the same time my mom was in a car accident and had won a fairly large settlement on top of my grandpa passing away right in the middle of it. So she was left with a fairly large chunk of money.\n\nDuring their divorce, my mom constantly kept me and my siblings in the loop of everything and made my dad look like the villain in the situation despite my mom cheating being the reason for the separation. And when you’re young, you want to believe your parents have your best interests in heart. My dad paid over $300 weekly in child support for my siblings and I, and when I decided at 20 I wanted to move in with my dad she stopped talking to me for a while since she would fully lose all child support.\n\nPart of the divorce agreement was that my dad would not ask for any of the money from the settlement as long as $40,000 of it went into a college fund for me, since at the time my siblings had no interest to pursue college. Everything was arranged, the divorce papers were signed, and my mom gloated about how much money I would have for school. And on top of that my siblings and I had $10,000 each as an inheritance from my grandfathers will for us to use when we turned 18.\n\nA few years later she had fully renovated my grandfathers house that we moved into, we had a new car, went on a 7 night Disney cruise followed by a stay at a Deluxe Disney hotel. We were fairly happy, and I was a sophomore in high school excited to start looking at colleges, when my mom informed me she spent my entire college fund and inheritance on everything above.\n\nI. Was. Floored.\n\nThe first thing I had done was tell my dad, who became so angry he immediately contacted his own lawyer and take my mom back to court to figure out a way to make that money back. At this point, we lived paycheck to paycheck and heavily relied on the child support to afford living.\n\nSo she was served the court papers and they went in front of a judge, where my mom was given a slap on the wrist since it was determined she didn’t make enough money to pay back the $40,000 college fund.\n\nThroughout my entire childhood my mom was emotionally abusive towards me and my siblings. She manipulated us to be at each other’s throats constantly and was very narcissistic. She continued to get worse during my childhood and my anxiety and depression was crippling. It took moving to a different state to realize how harmful she was in my childhood and to see clearly how much she messed me up, and I went no contact almost a year ago.\n\nMy dad is about to retire and made it known to me that according to his divorce agreement my mom gets a good chunk of his pension, which got my gears turning.\n\nWould I be able to take my mom to court over the college fund again, but this time to try to use his pension to replenish my funds? Even if that means I’m screwing my mom out of $1,000+ a month for my dads work.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- yeah- college isn’t cheap. I would seriously consider this too.", "NTA.  That money wasn’t hers to blow.  Having said that, I suspect you don’t have a cause of action here.  Your father might.  You’d definitely need to see a lawyer to know for certain.", "NTA. Sue her selfish, cheating ass. You don't owe her anything.", "NTA\nBut will it work? IDK", "NTA..Get legal advice and find out because no way should she get that pension money after stealing from her own kid.. plus she didn't stick to the terms of the divorce so wouldn't that go against her trying to claim other things that where part of the divorce? You dad needs to speak to his lawyer as soon as he can..", "You mom stole 50k from you and the courts do nothing? And men get shit on for having privilege", "Honestly this is the only advice that matters here.\n\nNTA for doing what you have to OP! Good luck!", "THIS start the wheels turning now and get the money back! NTA", "But it was hers?", "I think that's a legal question -- since it was received while they were married, did it become part of the marital estate that then had to be split between the husband and wife?  I don't know.  From the description of the prior court proceeding, it sounds like the answer *might* be yes, but maybe it was just that the mother had agreed in the divorce settlement that the money would be set aside, and then violated that agreement by spending it all.", "The $40,000 was Op's for a college fund according to the divorce agreement", "It seems unlikely considering they seem to have been separated when she was in the accident. But it all depends on a hundred legal factors.", "It is a legal question because the OP is being told that this is the case, it might not be.", "Inheritance is not considered marital property so that would never of been decided and it they were separated whilst she was in the incident and the settlement was for her injury and the effect it had in her life, OPs father would not be entitled to any of that either so I honestly don’t know what OPs going on about.", "Not to mention the 10k he inherited", "So the OP's father said. Is that true though?", "First, these all seem like questions that could vary by jurisdiction.  E.g., not all jurisdictions necessarily use date of separation rather than date of divorce (or date divorce proceedings are initiated or date of a formal decree of legal separation, etc.).  In most US jurisdictions personal injury compensation would be separate property, but that's also not necessarily universal.  In some jurisdictions, even inheritance can become part of the marital estate if it's commingled, although I don't think that's at issue here.\n\nSecond, even if the settlement isn't marital property, it sounds like those assets were (at least based on OP's understanding) explicitly addressed in the settlement, and the mother agreed that they would be set aside for a particular purpose.  If that agreement is binding, then it may not matter whether it was marital property.  Doesn't necessarily give OP a right of action (as it might if it created a trust or something) but those are all actual legal questions whose answers aren't immediately obvious.", "Yes.", "I believe both parents admitted this. Op's mom gloated about the sweet college fund she set up for her kid and the father agreed to not ask for funds from the accident settlement but only on the condition of the $40,000 college fund set aside.", "The OP didn't say she gloated about setting up a college fund for the OP. Just that she'd have money for education. Two very different things.", "This is not a question for AITA, but for an attorney.", "NTA But is it legally viable? You need a lawyer, not reddit.", "NTA. Speak to a lawyer though.", "The pension would be off limits more than likely, it's the equivalent of a beneficiary designation.  What they agreed to or forced to in court is between them. She gets part of his pension and if in the US and married for at least 10 years entitled to social security as well if he died. Yes it sucks but that's the way it is. You already tried to sue and lost. Trying again for the pension will be different day, same result.", "NTA but your father already tried to sue her and it went nowhere. You need a lawyer to find out if it can go anywhere if you try. To me it seems like a huge waste of time, money, and energy and you really should let it go. Just cut your mother off. Maybe try therapy to deal with your anger. \n\nMy childhood stocks and savings (college fund w/e) were drained by my bio father when I was young too, so I get the resentment but I’m telling you that staying mad forever about it is only hurting you.", "1) sue, win or lose she'll probably hate you for it.\n\n2) take the loss and just cut her out of your life, yes the lost funds suck but it's the higher ground.", "Above my pay grade but talk to a lawyer. Your mom is TA in how she has treated her kids.", "This is above Reddit's Paygrade. You need to speak to a lawyer", "Need a lawyer.  Probably the family law attorney your father used or a QDRO lawyer who does this type of post divorce retirement division.", "You need legal advice urgently. No idea about your jurisdiction, but statutory limitation periods often start from the moment you became aware your mother stole the money.", "You would have an issue with res adjudicata and possibly SOL. But I would consult a lawyer in your area.", "Stop posting online and contact an actual lawyer and don't solicit advice from reddit assholes lol", "By the sounds of it your mom is a piece of work and you are NTA, but I will also say: $300/week in child support with multiple kids is *nothing,* especially when those kids are teens. Teens are pricey. She was probably spending that in food costs alone.", "Is it in writing the 40K was to go into a college fund for you? If so, consult a lawyer. If mom owns grandpa's house that she renovated it's asset.", "NTA but this post hardly belongs on this sub. This is a legal issue. One way I would go about this is to have your dad withhold any pension payment from your mom so she's the one who needs to file with a judge. Then he can explain why he did it, for your benefit. But that's not a AITAH question", "NTA. Do it. Actions have consequences.", "Talk to a lawyer. First thing. Don't say a word to your mom. Take this down. Delete any record of this that could tip your mom off. And call a lawyer. NTA.", "NTA\n\n&#x200B;\n\nGo for it!", "NTA, your mom literally stole $50k+ from you without even telling you and spent it on a huge vacation instead of letting you go to college. If anything, she deserves to go to jail on top of going into debt to pay back every single penny.", "nta, but dude how did you not see this coming? I promise you I mean that gently.", "NTA agree talk to a lawyer as should your dad also report it yo the police if needed, she stole from you, she broke a legal Contract.", "This and good luck!", "This. We can't say if you can sue or not, it's above our paygrade\n\nAbsolute NTA if you do it and leave your abuser penniless on the street though", "You already tried to sue and lost.", "Why do people always use 'take the higher ground ' or 'be the bigger person' to justify letting others treat you like crap? I have no idea legally if suing mom would be worth it, but OP should certainly pursue that option if a lawyer determines it is. The relationship is already destroyed.", "Didn't lose. The judge just recognised mum didn't have the assets to pay back. Now she will.", "Im not saying they should take that route, those are two noticeable options that OP has. Both have their good and bad of them. It's up to what OP thinks is best. Obviously a lawyer would probably have better insight on this than a bunch of nobody's on Reddit.", "She had a fully renovated house though?", "If the divorce agreement wasn't legally binding, OP's father wouldn't have been able to take OP's mom to court over violating the agreement. That she got only a slap on the wrist is besides the point, because even getting that slap on the wrist means she was in the wrong. She owes OP that money and OP would not be wrong to sue. \n\n\nOP, NTA.", "> So she was served the court papers and they went in front of a judge, where my mom was given a slap on the wrist since it was determined she didn’t make enough money to pay back the $40,000 college fund.\n\nSo you didn't read the OP at all and now you're just playing devil's advocate for OP's shitty mother."]}