{"id": 9114, "submission_id": "10tgsnn", "title": "AITA for not saying “I love you” to my 8y/o sister?", "selftext": "\nI (F25) grew up without a dad. He was in the picture until I was about 6-7 years old, after that MIA for the next 10 years. I grew up with my mom (mentally unstable but doesn’t admit it). I had pretty hard childhood, sometimes nothing to eat, sometimes we even lived without electricity. When I turned 16 I left home, got my first job and my own apartment. \nMy dad contacted me in 2015 and I agreed to meet him. I wouldn’t say that we discussed our issues, we rather concentrated on the present and the future. \nAfter few months of talking to him (we live in different states) he announced that he is having a baby with his girlfriend. I had no problem with that, technically it is my half-sister (8 y/o) but I take her as my real sister. We don’t meet often but when we do I am very happy to see her, I also get along very well with her mother, I’d say even better than with my dad. But in no way I take her as my stepmom since I’m already a grown up. \nEver since my sister was little she said “I love you” very often to close family. Whereas I have never said it to anyone, except my boyfriend and even then it took me a long time. So I’m not used to say it to anyone else, I just don’t feel comfortable. My dad gets mad every time my sister says “I love you” and I don’t say anything back. I am mad at him since I didn’t have the childhood and environment where I could have said it and mean it from the bottom of the heart, I just didn’t have (and still don’t) that kind of relationship with my parents. In my eyes it’s their fault that I had the childhood that I had and I don’t think I could say “I love you” since they don’t deserve it. \nSo AITA for not saying “I love you” to my sister?", "created_utc": 1675518465, "permalink": "/r/AmItheAsshole/comments/10tgsnn/aita_for_not_saying_i_love_you_to_my_8yo_sister/", "score": 35, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I can not say “I love you” to my little sister since I had a childhood where I never heard or said it. I simply feel that my parents don’t deserve to hear it and since I have never said it, I can not make myself to say it to my little sister who has nothing to do with my childhood and upbringing. I feel like I am mad at my sister but she’s too young to understand.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH, but I hope you will be able to tell her one day. For both your sakes.", "NTA - your father cannot be mad for something partly caused by his actions unfortunately. \n\nMaybe you’ll learn to say It to your little sister one day.", "NTA. This is your own emotional journey and I’m so sorry your parents have failed to give you the proper love and affection you need. Take all the time you need.", "NTA. Forcing you (because that's essentially what he's trying to accomplish by getting angry) to express feelings is boundary crossing behaviour on the side of your dad. It would have been boundary crossing even if he would have been the best father in the world.", "Only AH is your dad.", "NTA. But I think you do love your little sister. Maybe you can come up with a code word/phrase that she knows means **I love you** or a response to her like “Same, little sister”. Your dad needs to stay out of it.", "Sounds rough and completely understandable. Ultimately the root cause is your parents and it's not your fault. NTA", "this so so rough, I’m so sorry for what you’ve been through. You’re absolutely NTA. I really hope that you can one day feel good about sharing your love with more people in your life who are important to you, like your little sister 💕 it takes time, but you can get there if you want to", "NTA. You are entitled to your feelings.", "NTA.  You can't be forced to say things you don't feel comfortable saying.  Your father needs to back off.", "NTA. You should tell your dad that it is not something you say very offer due to your childhood and that it will take time for you to say it to your sister.", "You don't owe her this. It would be nice if your family had that relationship, but you don't.\n\nNTA at all, this sucks, you are not comfortable with this, so that's the end of it.", "\nIt sounds like you’re withholding your love to punish your sister, a child, to get to your father. To clarify, if you’re not feeling love towards her, that’s one thing, but you say you consider her your sister and love her. You just won’t say it so that your father feels bad about how he and your mom damaged you. Your relationship with your parents is not the same as your relationship with your sister and you’re making it the same. \n\nInfo: do you love her but aren’t saying it, or do you just not love her? \n\nAlso, I 100% understand complex dad shit, I haven’t spoken to mine in years, but I would never withhold my love from my sibs.", "YTA you're an adult now that can think for yourself. Your parents may have messed up your childhood, but you're going to mess up your future if you keep acting however you want and just blame them for it. It took me too long to learn that blaming my parents for the things they did wrong does absolutely nothing to help me. Recognize their mistakes and be better.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI (F25) grew up without a dad. He was in the picture until I was about 6-7 years old, after that MIA for the next 10 years. I grew up with my mom (mentally unstable but doesn’t admit it). I had pretty hard childhood, sometimes nothing to eat, sometimes we even lived without electricity. When I turned 16 I left home, got my first job and my own apartment. \nMy dad contacted me in 2015 and I agreed to meet him. I wouldn’t say that we discussed our issues, we rather concentrated on the present and the future. \nAfter few months of talking to him (we live in different states) he announced that he is getting a baby with his girlfriend. I had no problem with that, technically it is my half-sister (8 y/o) but I take her as my real sister. We don’t meet often but when we do I am very happy to see her, I also get along very well with her mother, I’d say even better than with my dad. But in no way I take her as my stepmom since I’m already a grown up. \nEver since my sister was little she said “I love you” very often to close family. Whereas I have never said it to anyone, except my boyfriend and even then it took me a long time. So I’m not used to say it to anyone else, I just don’t feel comfortable. My dad gets mad every time my sister says “I love you” and I don’t say anything back. I am mad at him since I didn’t have the childhood and environment where I could have said it and mean it from the bottom of the heart, I just didn’t have (and still don’t) that kind of relationship with my parents. In my eyes it’s their fault that I had the childhood that I had and I don’t think I could say “I love you” since they don’t deserve it. \nSo AITA for not saying “I love you” to my sister?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA: if you just struggle with the actual words “I love you”, have you tried going around the issue with things like “you’re my favorite little girl in the world” or even just showing her you care with a hug? I mean, my extended family (not my parents, I mean uncles, aunties and grandparents) has rarely ever said the words to me, but even as a little girl I never doubted that the love was there. \nStill, have a calm conversation with your dad about this issue when neither of your tempers are fired up: if you’re in each other’s lives enough for him to have noticed you don’t use the words, he needs to know why.", "NTA - and he needs to be more understanding, instead of conveniently forgetting he’s part of the reason you don’t feel comfortable. Instead of being mad, he can sit down with you and have a conversation. People are raised differently, she’s being raised to express that and you weren’t.", "NTA as long as you communicate that to her. One of my parents was like you, used it sparingly, while the other said it every single time they could. Now as an adult I realize that actions and services were their way of saying \"I love you\", but to a little kid, affirmation is important, so it made me feel sad that one wouldn't say it. If you tell your sister, for example, that you find it hard to use words but you show love in what you do, meeting her, playing with her, etc, she'll be able to understand it better. Fuck your dad, this is your comfort level and your sibling.", "yes, but to be honest OP does seems like someone that love her sister from what its described here (: don't worry, she can feel it. your dad being mad its probably his own projecting based on your guys experience.\n\nhope you eventually see yourself able to say it back to her tho! the first step its always the hardest!"]}