{"id": 9120, "submission_id": "10tjdwf", "title": "AITA for not wanting to go to a mental health ward?", "selftext": "My son (15) has a friend who is currently in inpatient mental health treatment. Even though the patients are underage, visitors under 18 aren't allowed, for whatever reason. My son asked me to go visit for him and give his friend some comics, a letter and a pizza. Apparently the food there is bad, but you can bring outside food to visits and patients can eat it during the visit.\n\nThe thing is, I don't want to go. His parents go and see him most days, and I'm sure they bring snacks. I told my son I could give them the comics and letter to give him. He said no, because he doesn't trust them not to read his letter. Well, I really don't want to go to the hospital. I just don't feel comfortable.\n\nMy son said I'm being a judgemental asshole, but I'm not judging his friend, I just don't want to go. I don't even know what I would say to him. Would I just sit in silence and watch him eat pizza? I told him to ask his dad, but my husband works weird hours and would only be able to go on the weekends, and apparently the parents always go on weekends.\n\nMy son is really disappointed in me and angry at me, but don't I have the right to have boundaries? He told me that I was lying when I said he can ask me for anything. He can ask, but this is one request I don't think I can fulfill.\n\nUpdate: I read everyone's comments and a handful actually had productive feedback or information. Based on one person's idea I will schedule a time to go when my son isn't busy and then facetime him in the visiting area. He and his friend will get to have a (mostly) private \"face to face\" chat, his friend will get to enjoy his pizza and he'll get his letter and comics. It'll be pretty much a visit between them, and I'll just be the chauffer, basically. Thank you to the people who responded in good faith and actually read the post before commenting, as few of you as there were.", "created_utc": 1675525437, "permalink": "/r/AmItheAsshole/comments/10tjdwf/aita_for_not_wanting_to_go_to_a_mental_health_ward/", "score": 996, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My son asked me to visit his friend for him, but I won't do it. My son says it's really important to him and he really needs me to do this, but I'm prioritizing my feelings over his.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "If you don't know your son's friend well I don't think being uncomfortable with this request makes you an asshole, however I do think you're overthinking it. You don't actually have to stay and chat to the boy, you can just swing by to drop off the letter etc. and say you are sorry you can't stay but (son) wanted him to have these. \n\nIf you think you should stay for a bit you could ask your son to give you a few questions to ask his friend that he wants to know the answer to - like how is he doing, is there anything else he would like, etc. \n\nYou should also have a chat with the friend's parents first to check it's OK to bring pizza and comics to their son. It would be a bit odd for a (presumably) middle aged woman to be bringing pizza into a mental health ward to give to a teenage boy without giving the parents a heads up first. Depending what he's in for maybe they wouldn't be appropriate either, best to check.", "YTA\n\nYour son is not allowed to go and comfort his friend, he is asking you, his parent to go in his place and you're allowing your own discomfort to stop you.\n\n> Well, I really don't want to go to the hospital. I just don't feel comfortable.\n\nYou're a parent, doing things that aren't comfortable is in the job description.", "> Would I just sit in silence and watch him eat pizza?\n\nHmm.  Have you considered talking to him like a regular person and also eating pizza with him?\n\nYTA.", "I can sympathize with feeling uncomfortable, but it's not like you have to hang out and watch him eat pizza. Take the stuff, say, \"Hi, \\[son\\] wanted me to bring these things to you and wishes he could've come himself.\" Ask if he wants you to tell son anything. Leave. Your son is physically incapable of doing something that's very important to him and has turned to you. This is a chance for you to show you love your son by doing a fairly small favor.", "YTA\n\nYou're an adult, sometimes doing the right thing as an adult means doing something uncomfortable. Your boundaries are not good boundaries here - they are about a fear of people who need mental health treatment or the treatment setting, AND are getting that appropriate treatment. That is not something that should be stigmatized.", "If it was my child asking me to go, I would do it for him… if i sit in silence with the kid so what, atleast he will know his friend cares about him that much to ask his parent to go for him.  You do know this friend right? \n\ni mean if you never met him that probably is a different story but I am assuming hes been over your house, hangs out with your son and you have been in his presence before", "Soft YTA. I hate hospitals and clinics. I can sense their pain and I feel it deep down and it kills me.\n\nIf my child had a friend in such a place and wasn’t able to visit, uncomfortable or not I would do it to make sure their friend was ok since they can’t. I would put up with the discomfort to make sure my child knew their friend was ok.\n\nI do understand your reasoning and desire but this is about something bigger than you.", "YTA.\n\n\"You can ask me for anything, but the joke's on you because I won't actually *do* anything you ask for because I just don't feel like it. Even though it's a an incredibly trivial favor that you're asking out of kindness to a friend in need.\"\n\nIf you continue behaving this way, in a few years you will be wondering why your son doesn't trust you when you \"haven't ever done anything to him\".", "YTA. Aside from the acute moment -- your son's friend is in need, all you have to do is drop off some comics, a pizza, a letter, and say, \"Hey, my son is thinking about you, he wanted me to bring these for you, since he can't do that himself\" -- your son will always remember this, that when his friend was vulnerable and you were in a position to help, you just couldn't be bothered.", "Your own child feels helpless to help their friend. Start there. \n\nYou can’t do anything without talking to the kid’s parents anyway. You may need their permission for the facility, and on top of that, I would be furious if any adult visited my kid in an inpatient facility without my permission. And the kid might not even want you there. See how your child can connect with their friend while they’re in treatment.\n\nThis isn’t an AITA situation. I’m actually a little disturbed that you’re here instead of a parenting or mental health sub.", "YTA.\n\nBut I can't really tell what you mean by being uncomfortable. You seem to cite things that are controllable. You can eat pizza with the friend. Suck it up and ask about hobbies. You can make it clear that you're just dropping off stuff on behalf of your son and sending regards.\n\nIf you don't like mental care facilities as a whole, then I think you ought push having your husband go. He may have odd hours, but this isn't insurmountable. \n\nOr how about another trusted adult who aren't the kid's parents. \n\nYour son doesn't have any other recourse. His good friend is separated from him. You can help him know how his friend is doing (even say that friend is alert or pleased by the gifts). Tell your son he ate the pizza happily. Whatever. \n\nYou are the person he asks to help him. Would you help your son? \n\nAnd let's say it's your son who's at the facility. Would you visit?", "NAH\n\nYou offered to give these things to his parents to take in when they see him, you didn’t dismiss your son’s wishes to support his friend. His disappointment is understandable because he feels powerless to help, and can’t go in to see him himself. But I feel that his solution of you going in his place is inappropriate, and putting you (and potentially his friend) in an uncomfortable position.\n\nI would be very uncomfortable if someone’s parent showed up at my impatient facility and wanted to see me. This friend is in a vulnerable place at the moment and might not anyone besides his parents/family visiting him. (as his friends can’t) It certainly isn’t a normal thing to do, and you being uncomfortable in that environment would probably make it awkward even if he was ok with parents of friends visiting. I’m sure his parents bringing along the gifts from your son would mean the world to this kid and nothing else is necessary. He needs space to heal.\n\nI’m surprised by how many Y T A judgements there are because if I were in his friend’s position I would not be comfortable with my friend’s parent showing up in this context, even if it was my best friend’s parent. You offered to send along his gifts and best wishes but ultimately you shouldn’t have to go and visit this friend.", "Just drop the items off and leave. Say it's from you son. You don't need to stay or hold a conversation.", "YTA\n\nWay to show your son that you are fair weather support to others. I get that you don't like the idea of doing all this for your personal comfort. But we are talking about a kid here who could use any and all support right now. Do it for him. Do it to show your son that he can count on you. Do it because it's a small sacrifice with big moral implications. You can do it. Choose to show up for these boys.", "YTA.\n\nThis is important to your son and you won't do it because \"I don't want to go.\"\n\nSuck it up.\n\n(It would be different if you had a prior traumatic experience of something. But this is no excuse).", "Nah.  It’s a nice thing that your son is thinking of his friend.  I don’t think it would be a big deal to drop off the letter, comics, and pizza and tell him your son is thinking of him.  You don’t need to sit with him, just drop it off.  But you need to check with this kids parents first.  They are the ones in touch with his doctors.  There are restrictions on visitors in mental health facilities and things you can bring in.  You can’t just waltz in.  It is a very controlled environment for the safety of the patients.", "YTA. When kids are having a hard time, a good rule of thumb is to treat them the way you would hope another adult would treat your child in the same situation. Would you want the parents of a caring friend to visit your child if he was alone and scared? Would you want your child to know he hadn't been forgotten by his friends? Your child is scared for his friend and wants him to feel loved. He sounds like a kind, compassionate kid. You can help both your child and his friend by putting away your own discomfort for 30 minutes and spending time with a child.", "Get over yourself YTA", "YTA, you don't even have to stay, you can just drop shit off. Yeah, hospitals suck. It sucks even more to *be in one* like your kid's friend. You can deal for five minutes.", "YTA.\n\nYou literally only have to drop it off and leave.\n\nThis poor boy is on a mental health ward do you think he won't want to feel supported by his friends because his parents visit?", "YTA - I agree with your son - I’m disappointed in you", "YTA. This could mean the world to his friend.", "YTA. Your son can’t see his friend, and just wants to be there for him. You can suck up a little discomfort and be there for him in this really difficult time. He can’t communicate with his friend in crisis, I think you can understand how that feels. To ignore that over some discomfort is selfish and childish, and I’m sure is rooted in some shit views on mental health wards. \n\nI’m sure Reddit is going to disagree with me, so let me just say this… this is one of those “in the real world people would think you’re an asshole” situations.", "YTA.\nSometimes doing the right thing is difficult. This is one of those times.", "Yikes. Against the grain but I’m going NTA. Everyone here is seemingly not taking in account that most in patient psych wards don’t allow visitors unless the parents ok it. Typically when the child is admitted, the parents have to sign paperwork stating who is able to visit and the psych ward isn’t allowed to deviate from that list due to HIPPA regulations. Some might have different regulations for visitors, or allow people not listed to visit with the parents but it’s dependent on the facility. If nothing else, he may be able to call and talk to his friend as there’s usually a time when the patients can receive calls. Some clinics read any letters that are taken to the patient or sent from the patient, and some may even discuss the contents with the parents. OP, your son is allowed to ask, and you’re allowed to say no for whatever reason. You should definitely explain your reasoning to him instead of “because I said so”, that can cause your son to lose trust in you. The best option I can give is to call the friend’s parents and speak with them about any courses you can take to help your son reach out to his friend and let him know he cares and misses him.", "NTA. \n\nHis parents are going. You are not said friend’s parents and don’t have an obligation to go. If you are really close with said friend and treated him like your own when he was growing up, that maaay be a different story, but I would still run it by his parents before going. \n\nNot to mention that you going by yourself may be crossing a line, especially as an adult that is not his parent. \n\nTell the parents your son’s concerns about opening the letter and have them assure him they won’t betray his confidence. \n\nYou may even consider telling a white lie for his ease of mind, saying that only his family can go. \n\nBut no matter your reason for not feeling comfortable in going, the fact remains that you don’t feel comfortable going. NTA", "YTA. You’re son wants to see his sick friend in the hospital. Be a supportive parent and take him. Sure it will be awkward but you’ll get over it.", "NTA. You have no business passing secret letters to a teen in an inpatient mental health facility. Or visiting. Kid you don’t have a relationship with under those circumstances. I understand your son is upset, but this situation is above his, and your, pay scale.", "NTA no one should have to go into a mental treatment facility if they are not comfortable.  I freak out being behind locked doors. My psyc rotation was hell.", "NTA- I feel like this is crossing a line a bit. I would feel weird asking the parents of my son’s friend to visit their child in an inpatient facility. Also, for the safety of the child, the staff will likely read whatever letter your son wants to give him anyway. I think you just need to explain to your son that his friend needs to focus on his treatment and it sounds like his parents haven’t just abandoned him there.", "YTA, but it makes sense.  I wouldn't want to either.  It's an uncomfortable situation on its own, let alone having to hang out with a stranger, let ALONE it being a KID stranger.  It's an emotionally taxing situation I would also avoid.\n\nBut consider this: you don't have to stay.  If your kid asked you to drop something out at a friend's house, could you do that?  The hospital is more intense, and it feels socially wrong to just be in and out, but that IS a very real option (and, I believe, the most appropriate one.)\n\nYou could bring the things, stop in, give them to the kid, and have a greeting and get will wish prepared.  Just share hellos and well wishes and leave.  Something along the lines of \"Hey, I'm xyz's mom.  He asked me to deliver these.  I don't know what you're going through, but I want you to know that xyz, and our family, are here for you if you need anything.  Now I have to head to [work or other time sensitive exucse], so I'll be heading out.  Enjoy the pizza!\"  15 in and out max, and a lot of that would be travel time.\n\nUltimately, your child asked you to do this because he feels overwhelmingly powerless right now, and however you've raised him so far has led him to trust you as someone on his team that he can rely on for his most important, sensitive issues.  If you reject this, given how important it is to him, it may permanently damage this relationship and how he trusts in general.\n\nKeep in mind that this is probably about a lot more than a hospital visit.  If the friend is in the ward, there's a very high chance it's because they almost killed themselves.  To your kid, his friend is fighting for his life against something your kid has NO power to help with.  It's agonizing, it's terrifying.  These treats may seem to matter little, but for your kid, it's the only way he can try to protect or heal his friend.  If you deny that and insist on leaving him powerless, that will hurt him a lot more than I think you know.", "NAH.  \n\nThis is more one of those things that doesn’t have a strong moral factor.  \n\nThe implications are more about what kind of person you want your son to see you as.\n\nA parent who can be trusted and counted on to go beyond what is expected and be supportive.  Or a parent who wouldn’t bring his friend a comic and a letter because they didn’t want to.", "NAH. As a person with mental issues, I don't want to go anywhere near hospitals period. You 'not wanting to' seems like there might be something to unpack there but I don't blame people for not wanting to be in those places. They have an aura of sickness and death", "A lot of people are calling you the *sshole.  I don’t think you are.  First, my experience being in mental health facilities has been to only let certain of my immediate family in.  They find it disturbing to the other patients when a constant stream of people are visiting.  I also disagree with many of these people saying they would do this to make your son happy.  That is why we have so many entitled young people.  I don’t understand why you have to give into every demand or request your child gives you. It is healthier to raise him to understand he can’t gets what ever he wants.  \n\nI think it very easy for people to say you should go and give this kid emotional support.  It’s easy to type when you’re not in the situation.  It’s nice to believe that but the reality of it is not what they think.  You WILL not be able to bring these things and it is doubtful the facility will even give you access.  Again, I have been in a few different ones and people have to be allowed to visit the patient.  You NEED to ask the parents to give the comic books and letter for their son to receive them.  A teenager understanding may not reflect the actual ability to achieve this . \n\nAgain, it’s nice to want to immediately support this patient no matter the circumstances but every pne of you really don’t care about what is appropriate for the patient.  From a very educated experience dealing with mental health issues, you all really don’t understand that this is not a simple issue.  Please care more about what this patient is going through!  Please care about him as a living person and not a character in your savior fantasy.  Sorry to harsh but you all really don’t understand the any of the actual issues about this situation.  \n\nNta", "YTA. Your son wnts to be tjhere for a friend but is not allowed and you deny him that simple favor? With what are really uncomfortable? Ask yourself if you'd think the same if it was a normal hospital and he had a broken leg. That boy is awesomely brave for being there and getting help. And you seem to judge him and other patients for that. Maybw subconsciously but it's definitely something you might think about. Because it's a huge possibility you habe someone with a mental illness like depression in your family. And might not even know. That's a statistic.", "NAH.  He wants to support his friend and you feel it is crossing a boundary.  Both of you can be right at the same time.  There's a difference between being able to ask for anything and getting anything you ask for; but that is not a discussion to have with him right now.  Tell him you love him, are proud of him for wanting to support his friend, and that when his friend is released you will be happy to bring him over there.  He's really angry about the situation.  This is the time to take one for the team and accept his misguided anger.", "NTA, you’re not a utility for your son to use whenever he wants.  You have the right to feel uncomfortable about doing something.  Mental health hospitals can have a very distressing atmosphere which affect some people more than others.  Tell your son your disappointed in HIM for being so intolerant and demanding.", "Your role as his parent is to be engaged in his care, so if you refuse to go to the unit to do that, then YWBTA. That said, in this case it sounds like your son is just asking you to just bring shit in for him and a friend -- not seeing much therapeutic benefit to that. Talk to your son and his team, you should all communicate together here.", "NTA. The facility likely has rules that a random adult or family friend can’t just visit. If you do they would want to read anything you bring. He’s not expecting you to smuggle it in, right..? Best bet is to bring him with you to drop off the pizza and comic and maybe the letter. No visit required.", "INFO: why don't you want to go?", "YTA\n\nYeeeeesh! Have you no sympathy or empathy?? Do you think that kid wants to be in the hospital?", "If you won't go, you are telling your child that mental health care is icky and shameful and that the mentally ill are not worth your support. If that's the message you are willing to give your child YTA. \n\nIf you have a specific reason to be frightened of a mentally ill child eating pizza, you need some support to address this. I'm unsure what to recommend as therapy is a form of mental health care", "YTA. I was expecting there to be some deep trauma related to mental health facilities. Nope, just “I don’t want to,” I can’t imagine refusing to do something so important to my child over some mild discomfort.", "NTA. Going against the common opinion here. Yeah it sucks for that kid but if you don't want to go then you don't have to go you shouldn't be forced to do something you don't want.", "YTA - if it was your son in the ward would you want his friends’ parents to do this small favor?", "Yta", "Wait who’s the parent here??? YTA", "YTA. And you should be tremendously, endlessly, unspeakably proud of your son. He gets it. What a doll he is.", "NTA...Parents are allowed to be uncomfortable and to refuse overstepping their boundaries...but at the same time your son is worried about his friend whom he cannot visit. Your decision might make a dent in your relationship with your son.", "YTA. It's sad that you're not supporting your son who is worried about his friend.\n\n>I don't even know what I would say to him.\n\nHello, [friend]. [Son] can't come to visit you but wanted to make sure you know that he's thinking about you and hopes you're feeling better really soon. He wanted you to enjoy this pizza. Here's a letter from [son] and some comic books for when you have free time. \n\nIt doesn't have to be a long, drawn-out visit.\n\nIt's really as simple as that. Your son will never forget your kindness and his friend probably won't either.", "When I was in college I was in a serious relationship with someone that got dx with BPD while we were dating. They were hospitalized for several days and I visited every day. It was a very emotional time in general and the other patients were in various types of distress. It can be unnerving to witness that. Hopefully, in the almost 30 years since, hospital care has improved but Idk.  Mental health issues are still heavily stigmatized. I can get why you would be uncomfortable, especially if this is a friend you don’t know well or haven’t met. \n\nYou need to get past your discomfort. Your kid needs you to do this. I have teenagers and I haven’t completely forgotten what it was like to be a teen. He will never forget it if you let him down here. For one thing, you don’t know what he himself may be struggling with. What if he ended up needing some mental health care himself? He sees how you react to his friend’s situation. That will dictate whether he feels safe bringing his own problems to you. You’re sending a message whether you intend to or not. He needs to know you have his back no matter what. He feels like you are breaking a promise to him and that will be hard to come back from. \n\nAs far as what to talk about, just treat him like any other kid. You probably won’t even be allowed to stay that long. And he probably doesn’t want to hang out with you. He’s 15. You’re cringe, on God. Say hi, commiserate about the crappy hospital food, ask if he wants you to tell your son anything, wish him well, leave. It doesn’t have to be hard. I doubt he wants to discuss his reasons for being there or his mental health or anything deep. Just be a bright spot in his day.  \n\nYou should also find out from the hospital what their policies are about gifts. It’s possible staff will read the letter first. There are also rules about what mental health professionals can or should share with parents, but idk what they are in this situation. Your son should be aware that this letter might not be private even if you deliver it. \n\nIf you really, truly cannot bring yourself to do this, find someone that can. Your mom or sibling or trusted friend. You need to make this happen for your son. YTA if you don’t.", "YTA.\n\nBring a book or play a game inon your phone so the kid can get some enjoyable food.", "NTA.  I can't believe all the YTAs!  Not only would it be super awkward, especially if you don't know the child well, but most mental health facilities are SUPER strict about who they allow to visit.  For example, one of my best friends of 30+ years was recently admitted into one and I couldn't even call them; only their partner and their mother could.\n\nI'd give the items to the kid's parents to deliver.", "YTA. \"Hey (sons name) isnt allowed to visit but he wanted me to brimg you some stuff and let you know he thinking of you. Any message you want me to tell him?\" And thats literally it. Then you can just leave.", "YTA\n\n>He said no, because he doesn't trust them not to read his letter.\n\nYour son trust you and he is asking you to do something important for him. Please don't ruin that. It is simple task but I'm sure if you won't do that for him he will remember it. That gonna stain your relationship.", "NAH - if you do not know the boy, it is very awquard. \n\nAnd may be strange enough that it will not help the patient. \nI get that he does not want the letter read, but that may not be helped anyway. \n\nYour son can ask, but asking is not getting. \nHe will have to be patient that is hard for anyone, especially at 15", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son (15) has a friend who is currently in inpatient mental health treatment. Even though the patients are underage, visitors under 18 aren't allowed, for whatever reason. My son asked me to go visit for him and give his friend some comics, a letter and a pizza. Apparently the food there is bad, but you can bring outside food to visits and patients can eat it during the visit.\n\nThe thing is, I don't want to go. His parents go and see him most days, and I'm sure they bring snacks. I told my son I could give them the comics and letter to give him. He said no, because he doesn't trust them not to read his letter. Well, I really don't want to go to the hospital. I just don't feel comfortable.\n\nMy son said I'm being a judgemental asshole, but I'm not judging his friend, I just don't want to go. I don't even know what I would say to him. Would I just sit in silence and watch him eat pizza? I told him to ask his dad, but my husband works weird hours and would only be able to go on the weekends, and apparently the parents always go on weekends.\n\nMy son is really disappointed in me and angry at me, but don't I have the right to have boundaries? He told me that I was lying when I said he can ask me for anything. He can ask, but this is one request I don't think I can fulfill.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: WHY do you not want to go? The reason matters. You need a good reason and you need to explain it to your son. If you don’t have one or you dont share why you’re not going, you’re the AH. \n\nExample of a good reason: you were hospitalized against your will in a mental hospital and abused there. \n\nExample of a bad reason: you would feel awkward.", "I think the way it's framed is a YTA situation, he's not asking you for a long visit here he's asking you to help him out with something he can't do alone. It's a really nice gesture, I'd think as a parent you'd want to encourage that. It might make you uncomfortable but it can be a short visit. \n\nIt also doesn't hurt to just check and see if you're even allowed to go see him. Aside from the age restriction, a lot of inpatient wards have approved visitor lists and you won't be able to get in if not approved. You might want to call and ask if you can drop off a care package on behalf of your son even.", "INFO: Are you already approved to visit this kid? I worked inpatient adolescence and any non family members had to be approved by guardian before visiting. \n\nI will say that those off unit visits were some of the best times for clients they get away for the unit and are able to social with friends/family while not being observed constantly. It was heartbreaking the kids that didn’t ever have any visitors. A few times we would do a staff visit just so they could have that experience everyone else got. \n\nIn regards to snack check in with the unit/parents first. My program didn’t allow any caffeine even in sodas, no metal pop cans, no metal eating utensils, glass ect.", "YTA, Welcome to parenthood bucko, you sometimes got to do stuff you're uncomfortable with.", "YTA if you don't go, and I can say with 100% certainty that this will be a defining moment for your relationship with your son. There are some things that even if you end up able to forgive, you can never forget and it changes the nature of the relationship entirely. He will always remember that you put being \"uncomfortable\" over trying to help his friend in a terrible situation. This clearly means a lot to him. What if you were in the hospital and had no one come visit because \"hospitals make them uncomfortable\"? I bet you'd feel pretty shitty.", "Wow. Way to be phobic about mental health. Can you imagine if his friend had cancer, and you “just didn’t feel comfortable” around chemo patients? YTA and so, so gross. It boggles my mind that there are wonderful people in the world who are struggling to conceive or adopt, while someone like you already has a kid.", "Man up you big baby and be there for your son. YTA", "YTA. Suck it up and do what's best for your son. We all do shit we don't want to do for the people we love, here's your turn.", "YTA and a selfish and self-indulgent one at that.", "YTA", "How you got such an empathetic kid is astounding to me. YTA.", "YTA. I hope this same attitude doesn’t keep your son from visiting you in the nursing home, but if it does you have only yourself to blame since that is what you taught him.", "NTA.  OP, please consider driving your son to the facility.  Have him accompany you into the facility and wait in the lobby while you see his friend.  Don't take a pizza there maybe dietary restrictions.  Tell you son's friend you he's not allowed to visit and he's in the lobby.  You're dropping off a few things for your son. You hope he recovers and you wish him well.", "NTA\n\nI agree with many here that going would be the best thing to do, and it’s what I would do, but despite what others think you ARE allowed to have your boundaries over your comfort. I would challenge you to think really deeply about this though. You are choosing to prioritize your comfort over your son’s very clear request for your help in something incredibly important and personal to him. Who knows what’s in his letter, but it’s important enough that he’s trusting you with it, and doesn’t trust his friends parents with it. That’s a big ass deal. So I’d ask you just HOW uncomfortable with the hospital are you, really? Enough to be cool with you son feeling a bit betrayed by you?\n\nYou’re allowed to have that boundary, but know that our boundaries have very real costs, and this one may have real consequences for the trust your son has in you.", "YTA - Fortunately your son is a better person than you.", "YTA", "YTA your son is probably going through a difficult time and he’s asking for your support. Sometimes we have to do things we’re not keen on doing for the people we love.", "If you don’t know what to say, why not arrange to have your son on video call so he can talk to his friend?  Hospitals can be lonely places and having people visit and connections outside can help make a difference in treatment.", "YTA\n\nI definitely understand being uncomfortable, my bf spent time in a mental health ward and visiting him was stressful. \n\nBut I think you have an opportunity to show your son that you take mental health seriously, in particular men's mental health. Your son already sounds like a empathetic person, you would do him a great service to nurture that.", "YTA. Your discomfort is valid but the very least you could do is drop off the stuff and let friend know your son is thinking of him.", "YTA suck it up for your son. I did a stint in the psych ward when I was young and it was super hard and emotional. The only thing that made it bearable was visitors. Just talk to him, for god sakes he’s a human not a vegetable.", "Doing things that aren't comfortable is a solid 95% of being a parent lol", "Saying the word \"Boundaries!\" doesn't magically make you not an AH.", "It’s not in a parent’s job description. Not if being uncomfortable is a legitimate concern. This is an extreme example to get the point across, but a lot of people would see red flags if a man was alone with a child that he doesn’t know when no one else is around. I’m sure this violates some sort of logical fallacy, but the OP doesn’t have an obligation to go to the psych ward for any reason. \n\nShe can applaud her son for being concerned about his friend and having the emotional intelligence to know that said friend is in a tough spot, but that doesn’t mean she ignores her own legitimate concerns.", "Or just drop the stuff and leave. Son wants the things to be brought. Hand them over, say “kid asked me to bring this, he’s thinking about you, bye!”", "I wouldn’t even hesitate. Wouldn’t be my first choice of how to spend an hour or two of my day, but if a kid was in need, I would do it. If my kid was in need of doing something to help, but it was outside of their control, I would do it. I would bring something that was just from me, too. And I would offer a mom hug. \n\nI can imagine all the ways this might feel uncomfortable or scary, especially because mental health is so stigmatized. I beg the question: OP, if this friend had a something hospital confining like cancer or something, and your kid asked you to do the same, would you do it?", "People on this sub think they can act any way they want as long as they say the word \"Boundaries!\"", "Also it's not like OP has to sit in silence. Just leave the stuff and excuse themselves. Or tell then news about OPs son if the kid asks.", ">  Also, for the safety of the child, the staff will likely read whatever letter your son wants to give him anyway. \n\nEven if that's true, it's very different having some random staffer read it than his friend's parents.", "Those aren't the issues being raised. OP, TA, isn't saying they _can't_ do this because of rules or a bigger picture their kid can't see. OP is TA because they're saying they _won't_ do this small thing, dropping off a few things that their kid isn't allowed to drop off because OP _doesn't want to_. There's a world's difference there. \n\nOP isn't willing to try to drop off something, a TINY ask, because they're not \"comfortable\" going to a hospital. You want to talk about entitled?", "OP won't support their child and his sick friend because they don't want to be bored or feel awkward. This isn't a frivolous request, and OP's reasons are selfish and juvenile. They can suck it up to support their child.", "“Crossing a boundary” it’s walking into a hospital dear lord.", "That is a very good point.  You have a really great perspective.  I think this is a very helpful comment.", "That’s a great idea.  None of us know the patient’s situation.  If the doctor thinks it would be helpful, that sounds like a great solution.  I don’t know the budget of this psych facility, they are usually under staffed and leads to a lack of caring to the best interests of the patients.  I speak from personal experience as a patient of various psych wards. I really like your idea!  With all the technology we have, that would simple.  We have absolutely no access to our phones but they should allow that.  It is barely any work to unlock the cabinet.  I would love for that be instituted!", "Unless there's some really big reason why OP doesn't want to go, is stopping by a psych ward to drop some stuff off really that big of a deal? The son isn't asking OP to be there for hours and make friends, but to do a delivery. A psych ward is not a place to be scared of.\n\nIf OP left something big out, maybe, but as stated what's the big deal? It's a safe location and the son just wants to have someone close to them show they care.", "What legitimate concern? \n\nI'm sorry, but \"the people in the mental health ward give me the ick\" vibe is not a concern. \n\nYou are aware that a vast majority of people in the psych ward are young and struggling with suicidal ideation, and maybe receiving a letter and care package from their friend that can't visit them could aid in their recovery?  \n\nAt the bare minimum the things can be left at the nurses station. Wow, what amazing solutions just a small amount of critical thinking can accomplish. \n\nYou and OP just oooooze mental health phobia. Jesus.", ">red flags if a man was alone with a child that he doesn’t know when no one else is around.\n\nBut OP won't be alone...it's a mental health ward. And you refer to OP as \"she,\" so it's not a man being alone with a child he doesn't know.", "The most difficult of quests, surely this mighty task of dropping off a pizza and a letter shall only be accomplished by the mightiest of heros! Surely the sire must consider the humanity of taking on such a harrowing journey!", "Perhaps, but depending on what’s in the letter it will be reported to the parents anyway. It concerns me a bit that OPs son is being somewhat secretive about the letter. Having worked in this environment before, this visit probably wouldn’t have been approved as INP treatment is pretty intense and generally visitors are limited to immediate family.", "I understand the issue of her simply not wanting to go.  Thanks for reminding me.  I think it is a valid reason.  The reason I wrote my comment is because so many people are saying she can just do this supposedly easy thing.  It really is a lack of trying to understand the reality of what the her son is asking and how it affects his friend.  He seems to be a sweet boy and a very caring friend, commenters are focused too much on that .  I wanted to explain that they need to think about how this would probably affect the patient.  Her just not wanting to do this doesn’t matter. The commenters need to stop and think about the all the issues.  It’s easy to type a well intended comment but they sound angry without understanding the complexity of the actual situation.  She really can’t do what they are telling her to do.  I wanted to help people understand that.  I have been dealing with mental health issues my entire life and my experiences in several different faculties can be helpful to people over simplifying the situation. They need to understand her son’s request maybe more damaging than helping.  I know that aspect of the story is not the main focus at all.  But a lot of people are reacting to the patient’s situation instead of focusing on her reasons. \n\nShe is asking for opinions and she is getting people’s perspectives.  She may sound selfish but asking for advice.  I think people are ignoring that.  That is a thing that shows she does care and is willing to handle this situation better.  Or help change her perspective.  She put herself out there and that should be respected.  I know Reddit is not the best place to get good advice and for people to comment anything they want.   I don’t care about this thread really, it just bothers me that people are over simplifying the situation. I just wanted to give my experience and hope people reflect on it.\n\nI really appreciate your comment and it gave me pause to think.  Thanks for reminding me about that important aspect of the story.  It is the main issue at hand. I really do feel my comment is valid.  I just want people to respect and consider the patient as well.  These comments hit home to me and some comments annoy me.  That’s all.", "The person that most needs support in this situation is the kid in the MH hospital.  They clearly have a lot going on to be admitted in patient.  The last thing they need is  to have to deal with their friend's uncomfortable mom staring at them in the ward.  If OP is not comfortable and cannot be a positive support to that child, she is correct in not going.", "Where does OP say that people in the mental health ward give her the “ick”..? You’re putting words in her mouth. Read the post again without trying to demonize her and show me where it says that. I’ll wait", "I'm all for supporting people with mental health problems, and breaking the stigma and prejudice, I have a mental illness myself and I've been met with quite a bit of hostility and people thinking that I'm dangerous for some reason, but I wouldn't be comfortable going to visit a child that I don't know, a child who might not be comfortable with strangers", "Again, making an extreme and generalized example to say that some things are just not appropriate. I’m not saying that OP is going to be alone with the child. What I am saying is that it still might be inappropriate for reasons not clear in the post.", "But it might be UNCOMFORTABLE for OP. Because I am sure that the 15 year old that ended up as a psych inpatient is having the time of his life.", "I gotra disagree.  It seems normal to me for any teen, especially one who is in a mental health ward and may have some issues at home, to be worried about their parents hearing them talk about it.  A lot of parents get very defensive when their kid has complaints about them- one of my close friends was raised in a household with strict \"you are never allowed to talk to people about what happens at home\" rules.  If her parents found out she'd, say, confided in a friend that she had gotten into an argument wirh her mom, and any of the family found out, they would all gang up on her for \"snitching.\"\n\nHospital staff are generally well trained to tell whether or not a parent needs to be notified of the contents in a letter, and probably won't do anything if the letter mentions normal family trouble.  But a parent might get defensive and start a fight about \"why did you tell your friend I was mean, I'm not mean!!!\"", "Is it really so hard to drop some stuff off and tell him what his friend is up to? I'm sure he'd like to know. It doesn't have to be a long visit.", "Can you think of another reason? Serious question", "I guess I just don't understand the current thinking where some people assume that anything an adult does with any unrelated minor has the hint of inappropriateness. It seems like she'd be doing the kid and her son a great kindness.", "\"My mom wants me to go visit her at the old folk's home, but I just don't want to! I don't feel comfortable!\"", "What would make it inappropriate? He's just asking her to bring his friend a small care package while he's in the hospital because he's unable to do it himself.", "Well, it would certainly be uncomfortable and children MUST learn that their feelings do not matter. What kind of parent is she if she can’t teach her child such an important lesson? /s", "Have you ever been in patient?  I work in the field.  Every visitor is hard. People go in patient to get away from stress because they are unsafe. OPs family drama has no place there.", "Literally my original comment", "What? This post is even dumber than mine", "But I guess sure. This post has some merit lol. I hate old folks too. So mean and judgmental", "But OP doesn't have to bring drama. They're the adult here; they can drop off pizza and letters and say something nice for a few minutes before going...", "There will be no drama if OP doesn't create drama.", "OP is no man and she wouldn't be alone with him. So that's bullshit", "Oh dear. Read the whole comment thread", "I did. And I can find no specific reason that would apply here. Please feel free to correct me", "I’m good. Thanks tho", "Geezus Christ, I’m so sick of adult age people behaving younger than the children they chose to have.", "Unless there's some outstanding circumstance regarding past trauma with hospitals or something similar, not feeling comfortable is a terrible excuse to not do it. YTA. \n\nIt's incredibly tone deaf for you to whine that a short visit to the hospital \"makes me uncomfortable\" when this kid is stuck there 24/7 with his every move being watched. Having this kind of support from the outside when you're in the hospital is HUGE, especially when it's a mental health facility. Put on your big girl pants, stop being selfish and make this kids day just a little less shitty.", "YTA\n\nThe kid doesn't want to be there either, especially since your son can't visit.  Being in a ward at that age feels like a lifetime.  If any of my friends' parents came by in their place it would've made a world of a difference.  But none of them did.  You could do it one time, for both your son and his friend.", "Please forgive me for making an assumption like this, but if you can not offer another reason then I think you may be subconsciously repulsed by your son's friend or by mental health patients for some reason. Please think about why you are uncomfortable about going to drop items off at a mental hospital and consider the outcome if you go vs if you decide not to.   \nIf you don't go, you will most likely drive a wedge between you and your son as he will see you as someone unreliable or at least someone who does not prioritize him in a time of need. Also, he may go on to believe that you judge his mentally ill friend even if you insist that you do not. Perhaps you can see if your husband can help you with this.", "YTA. Just bring the stuff to the hospital and give it to the front desk. You don't have to go in to the \"ward.\"", "Oh this is going to bite you in the ass some day when you are in a care center recovering from something and your son doesn’t feel like helping you feel loved and cared for through visits and gifts. \n\nYTA", "YTA- Please put yourself in this kid’s shoes. He needs all the support he can get right now. Your discomfort of an hour or so is nothing compared to what he is going through.", "NTA \n\nThis isn't your responsibility. Sure, wanting to help is kind, but this actually crosses a border.  Regardless of your uncomfort (which is valid) and as someone who has been in a psych ward before, you can't actually go visit unless it's with the kids' parents (or they (the parents) give permission to them (the hospital)that you are an allowed visitor). Psych wards for people under 18 y/o don't usually allow non parents/children to go visit.  They're very strict about visitors for the paitients safety. \n\nYour son is worried about his friends' parents reading the letter ? Well, the nurses station will 100% open and read it (if you ask them not to, they will hand it back upon you leaving), they willl also open and read any mail delivered through the post office. They will  thumb through the comics, and if they are deemed, \"inappropriate\" will be given back to you upon leaving. And bringing a whole pizza, also, a no go. Snacks are one thing where you eat them during the visit, but a whole damn pizza will quickly be nixed. \n\nA lot of people here have never visited or even been in an inpatient psych unit, and it shows.", "YTA\n\nYour son issued a cry for help. \n\nHis friend is in the mental health ward and he cannot trust anyone else not to read his private personal communications. You told your son he could trust you with private, personal needs, and he just learned he can't.\n\nYou don't know what's in that letter or why your son can't trust his friends parents. And frankly, at their age, you don't have a right to know unless/until he trusts you enough to tell you.\n\nWhat I'm saying is, your son feels this letter is a *need*. The pizza is extra. The letter is, to him at least, a need. And you're refusing based on a want. Which is why this:\n\n>until he trusts you enough to tell you.\n\nis unlikely to happen, ever, if you don't take his friend the letter.\n\nIf you can't go because of some actual phobia or trauma or something, it's important that you communicate that (even if without details) to your child. \n\nYou're the adult here.", "YTA. You're very selfish. You clearly lied when you said he could ask your anything. You don't even have to stay that long. Just give him the gifts and talk to him for a few minutes. Now your son knows he can't depend on you because you're selfish and refuse to keep your word.", "YTA \nConsider YOUR SONS mental health here", "Leave the stuff at the front desk for him. YTA", "YTA, and your son is displaying a lot more maturity and compassion than you are right now. I don't know if you're \"uncomfortable\" with hospitals in general or \"uncomfortable\" with people who have mental illness, but, either way, you need to get over it. Life isn't always comfortable, and it's a good, loving thing your son wants to do--please support him.", "So, your 15-year-old son's friend is in inpatient mental health treatment. Even though the patients are underage, visitors under 18 aren't allowed. Your son wants you to go visit for him and give his friend some comics, a letter and a pizza. you don't want to go. The food there is bad, but you can bring outside food to visits and patients can eat it during the visit?", "YTA. this was a very easy test of how good a person you are- will you make yourself briefly uncomfortable in order to help someone vulnerable and in need? will you put your son's needs before your own, as a parent should? \n\nyou said no. you value your comfort more than your son's faith in you, and his concern for his friend. you can say \"oh but its my boundary\" all you want. you had an opportunity to do something extremely easy to help someone who needed your help. your son is right to be disappointed and angry. you have shown him that your kindness ends at the exact moment you think you'll be uncomfortable. it's sad.", "Be an adult and support your son. He was specific in what he asked for. Just do it. Soon he will be gone. He has asked for your help to support his friend. You can do that.", "I'm not sure what to vote here. I don't love your reasoning, but you probably couldn't do what he's asking anyway. I've been on the ward enough times to know that you have to be on a visitor list, which you're probably not, and there's no way to leave things at the desk to be delivered to him. \n\nI guess I'll go with YTA because of *why* you refused, but not because you refused in general. \n\nBtw, he can probably slide that letter in by hiding it in a comic book and not mentioning it to the parents. At most, it'd pop if the staff search for contraband, but even that's not super likely, and they'd probably just check it for, again, contraband and pass it along.", "Well I agree with not going because the kid is a minor and the parents should be aware of who’s coming and going. But your reasoning comes off as you don’t want to be around somebody who is struggling.", "I'm not sure your son is being realistic about the parent of a friend being allowed to bring food and an unread letter to a child in a mental hospital.  I find it very unlikely that this is permissible.  I'm sure your son means well, but I don't think this can happen.  \n\nBest case scenario would be your son phoning his friend's parents, saying he'd like to send some pizza, comics, and a letter to his friend, and see if they're willing to take it to him.  But your son should know, from the get-go, that the letter will probably be read by the parents and/or the hospital staff because, sorry, this is the responsible thing to do to protect his friend no matter how well meaning your son and the letter may be.", "YTA. As someone who has spent time in in patient psychiatric care this isn't One Flew Over the Cuckoos nest. These people aren't \"crazy\" most of them are just depressed. Threy aren't bouncing off the walls, nobody is going to throw an air conditioner through a window. Get over yourself and do this for your son so that he can do it for his friend.", "Who is the adult", "YTA.  You probably watch too much damn TV.  The friend isn't going to be some drooling catatonic who is looking for some weapon with which to attack you.\n\nIt isn't really isn't that different than visiting any of wing of the hospital.  What would you say to the friend if he were recovering from having his appendix removed? That's what you should say to him now.  You don't have to spend the day with him.  Take him the pizza.  Eat a slice or two with him.  Take a few minutes and talk about things that he and your son can do when he gets out.\n\nYou are being a judgmental asshole.  Your son is a good friend: an understanding friend.  He must have gotten those traits from his dad.", "You don't need to sleep there or anything its just a quick trip and you leave YTA", "Massive YTA", "If his friend were in the hospital for a broken leg or a tonsillectomy would you go to visit him?\n\nIf your answer is yes but you just don't want to visit a psych facility then yes, Y T A. If the answer is still no and you just feel weird visiting someone else's kid in the hospital then no, N T A. Is there any stigma about mental health involved?\n\nEither way you should talk to your son about boundaries, not only your own but his, his friend's, and the friend's parents. What's in the letter he doesn't want them to read? What makes him think they'll read it? Why does he not want them to? What do you and he think about that? What are his biggest worries for his friend? How is he coping with this situation and his own mental health? There's a lot of opportunities here. Talk with him and maybe you can help him negotiate with friend's parents to send the comics and pizza and, if needed, be open about any concerns r/t a letter. Or maybe you'll feel more comfortable about visiting yourself.", "I don't think you're being an AH on this.And your son can ask you anything, but that is not a promise your answers will always be in his favor so that he gets what he wants. That's manipulative BS!  \nWhen kids are in mental health facilities, the usual standard is that only the parents of the child are allowed to visit, so it is not likely the parent of a friend would be allowed either.  NTA", "YTA\nI hate hospitals as well as the next person. Heck I’ve even been a patient in a psych ward before. And I’ll tell you it is a lonely place to be. That kid is lonely and is there for a reason. I would take the uncomfortable feeling to make a kid feel a little better. Let him know his friend is thinking about him and cares about him. Your son may be the only friend who was thinking about him and wanted to be there. Your son could be the reason that his friend doesn’t take his own life for all we know. I wouldn’t hesitate for a moment. Let him know you and your son are thinking about him and that if he needs anything you’re both there for him. It’s not weird- as the parent of his friend. Ask him if he needs anything else. Talk to him about his plans for when he gets out, talk to him about what he does there during the day and have a slice with him. You’re the adult, you can do it. There is such a stigma around mental health and this is a great example. Break the stigma. Just because someone is having a hard time mentally doesn’t mean they shouldn’t be treated the same as those who don’t. This is the opportunity to be an excellent example for your son.", "As someone who spent a few days in adult inpatient psych I can't imagine how lonely it would be as a child. You should be proud of your son so being so thoughtful and you should encourage him to continue to be so by abiding by his reasonable request. \n\nMy heart breaks for your son, he must be so disappointed by your reaction. \n\nAlso obviously YTA. I hope as you get older you don't expect any favours from him.\n\nAlso yes the food is TERRIBLE and painfully repetitive if you're there for long enough.", "I don’t think the facility would allow a non-related adult to visit a minor; that is something you should find out narrow going—however, if that wet my child in the facility, I would not want random adults visiting him/her. Seems weird. And o doubt your son should be sending letters to the friend that his parents and the staff wouldn’t approve of (I’m assuming that is why your son doesn’t just mail the letter). NTA", "INFO: are you able to explain your discomfort, to us--but most importantly--to your son? Are you envisioning some sort of \"One Flew Over The Cuckoo's Nest\" scenario? Do you feel unsafe for a specific reason? From where I sit, it certainly SEEMS like Y T A, but I'd be interested to know if there's some specific pre-existing trauma for you.", "Have you met your son's friend before? I'm sure you have, your son wouldn't ask if you hadn't. If you haven't I can see how you could be uncomfortable. what would be the harm of being uncomfortable for a 35 minutes to help your son communicate with another boy the same age?\n\n\nI would almost bet those feelings won't last once you are physically there. You might find yourself more comfortable than you thought. Hopefully having a chat with your sons friend, sharing pizza, and luckily.. having some laughs.\nI'd probably talk to the friend's parents first to let them know so thay everyone is informed if you do decide to go. I'm sure his friend would really appreciate it too.\n\nI hope you do.\n\n\nI don't think you're an asshole, maybe a little but I get you feel uncomfortable and I would probably be too since hospitals suck ass and the anxiety of not knowing what to expect if U had never been in that environment. If you know this boy and even if you don't you have an obligation to your son to get his message to his friend, get to know him with the lure of pizza.", "NTA- there will be plenty of time to catch up give gifts and support after they get out definitely not in the wrong here does the place have a client phone?  If it does maybe look up the number and your son can call them?  I've been hospitalized before the nurses usually confiscate cell phones and only allow them during certain times, if they provide a client phone your son could just call and ask for them when groups aren't running which could be a pretty small window but still worth a shot.", "NTA, if your sons friend is in hospital for any reason he is there to HEAL, not to eat junk food with strangers!\n\nAll these people saying that being a parent means doing things you are uncomfortable with, I absolutely agree. If your son was in a mental health ward, and you didn't visit him, YWBTA. If your son was able to visit his friend, and asked you to accompany him, YWBTA. But you are not responsible for visiting his friend without him, especially as his parents are already visiting him regularly.\n\nThe real question here is, why does your son not want his friends parents to read what is in the letter?", "NAH. As a teenager I was in the psych ward and the only people who were allowed to visit me were parents and siblings. I understand your son’s concerns and I get you being uncomfortable but no one is the asshole.", "Reasons for discomfort aside. We know the son cannot visit but can the parent of a friend? My 15 was recently hospitalized several months ago for mental health concerns and that was absolutely not allowed. Only family members I wrote on to a list were allowed and only 1 visit was allowed a day and they were only allowing one visitor at a time then. So if dad went I could not that day. Even phone calls had to be approved by parents because of the sensitive nature of the hospitalization. \nI don’t think there is enough information to say for certain OP is or is not TA.", "Right? I'd have been so touched if a friend's parent came to check on me and give me stuff.\n\nOP, YTA for worrying more about a few minutes of discomfort than your kid's friend's mental health. You aren't obligated, but your reasonings definitely make you an AH", "At least OP referred to it as mental health ward and not an insane asylum.  My guess is that OP watches a lot of TV and thinks that a psych ward is just like in the Batman movies.", "Exactly!\n\nOr you just go over and say: \"Hey Buddy, how are you doing? My son sends you this: Pizza, letter, stuff. Do you need anything else? Can I get you something from the Cafeteria maybe? I have to head into work now or have a doctors appointment, so I can't stay, but do enjoy your pizza. My son says the food is rotten in here. Anyway, hope you'll be having an ok day. Do get well soon!\"", "I already posted my comment, but I think I identify more with your answer than my own, lol.\n\nI mean I stand by what I said, but... yeah, there's a lot of \"not my paygrade\" under the surface here. Or, heck, even *on* the surface!", "And also, the mental health ward may be a locked and restricted ward and they have limits for the safety of the patient.", "I agree that she can have those kind of boundaries, but that might not be the issue.\n\nIn the end this will cause issues with her son, because she has some kind of personal problem with mental hospitals and/or the kid.\n\nI think the main topic here should be to understand why she does not want to be in the hospital, is it because of past experiences, untreated mental health, or just because it's too much hassle for her. I find it very weird she does not mention even a hint of why, meaning that she knows it's not a good reason to not go. \n\nIf we are very objective there are only a few reasons were not going should be justified, all others are just petty and should not be used as reasons to put boundaries.", "I worked on inpatient wards during grad school (both adult and child) - I can tell you that back then, there was zero chance the parent of a friend of child who was inpatient would be allowed to visit. The staff absolutely would not allow a letter to be given to someone inpatient without having 1) read it and 2) getting parental approval. Communication with the outside is strictly limited in order for therapeutic reasons (you don’t want someone triggering the patient). There is big difference between medical hospitalization and mental health hospitalization, especially with minors. I’m going with NTA.", "This is how we wound up with a pet tarantula. I hate that thing, but it is teaching him responsibility.", "And it's weird she does not mention why it's such a big issue to go to the hospital.\n\nEven if it was because of a past experience or her own mental health problems, she can give a hint.\n\nI believe she does not mention anything because she knows her reasons might not be good enough to justify not going.", "When my mom died one of my childhood best friends was living in another state so her mom who still lived near us came over with a casserole to express her condolences. Over ten years ago now and I will never forget that kindness during one of the worst times of my life.", "> It’s not in a parent’s job description. \n\nThis is exactly the kind of thing someone says when they think “housing and feeding” their kids is the extent of a parent’s responsibilities.", "I didn’t want to assume all had the same rules as the one we went to, but I absolutely believe you. Most those children are in very bad shape and protected for a reason. And as a parent of a child with health problems like that I didn’t want to jump the gun from my biases", "It depends on the unit.  I've visited hospitals where family friends were allowed to visit; even teens.  I've visited wards where it was family only and the visits were in a common area.  Others let you hang out in the patient's room.  Some let you bring in food, books, and games.  Every place is a little different.  And all of my examples are both adolescent and adult units.\n\nIf what OP wrote is accurate about visits, food, etc., then I think they're the AH.", "Honestly probably a good pet for that. In spring I just grab the biggest toad I can find with the kid and we put her in a sunken window we have. This toad then becomes the new honorary Toadally Kyle of the year. I make sure he's fed and spoiled & he helps keep the bugs out. The toad gets the year of its life in safety from predators then we release it in fall.\n\nI get to avoid tarantulas too lol.", "I sense a side quest. Quickly, abandon all other quests in favor!\n\n...unless it's in a psych ward. OP must not have enough experience to enter the area.", "Show me where there is a legitimate concern\n\nno it's fine, I'll wait. \n\nAgain, uh, there isn't one. Because you can walk in, drop the stuff off at the nurses station and go home. So yeah, I get that impression after reading the post multiple times and you're not changing my mind because this is a valid solution. \n\nThank you for attending my TED talk.", "You don't have to talk to him. \n\nDo I need a mega phone so everyone in the back can hear me?\n\nYou can leave things at the nurses station\n\nMagical", "!!! - there are wild pokemon lurking in the tall grass, check with professor oak about your getting your own pokemon", "That's not automatically true. OP states the patient can eat the food while someone else is there with him. Beyond that we don't know if he can take food back to his room or not.", "Except it was literally said that the patients \"can eat the food DURING the visits\" which means you'd have to be in there with him, which might make him extremely uncomfortable with the visitor being a stranger. Do you have any idea how vulnerable and insecure one feels in a situation like that?", "I swear everyone over here picking the most moot argument. \n\nFuck the pizza man, jesus christ. Take the letter, the most important part.", "Seriously, everyone is stuck on pizza. \n\nThat's nice dear, but you don't eat letters and comic books, so maybe leave the pizza at home and take the rest so you can leave it AT THE NURSES STATION\n\n&#x200B;\n\nI can't even. What other crisis needs to be solved while I'm here?", "Well, if feeling uncomfortable means it's OK not to do something...then, hey, why not? I think sometimes it's fine to point out that it's OK to be uncomfortable. That's life. You sometimes do things you don't like or even hate to show love for the people you care about.", "Rofl. I wasn't aware you were OP's child and thus in a position to dictate what was important to OP's son and what wasn't.", "You DID read that the son DIDN'T want the letters left at the nurse's station, right? Or did that escape your attention?", "Using my logical thinking skills here ... what would constitute as important; Pizza, reading material, or a hand written letter. Well, if I'm not comfortable sitting down with someone while they eat, then maybe, quite possibly the pizza could be forfeit in this situation.\n\nI've spent a few days in the mental health ward after surviving a suicide attempt, so I can tell you, between the three, the kid doesn't give a shit about pizza.", "Did you read the post? It says he doesn't want it sent with the boys parents. Good lord. Or diD ThAt eScaPE YOurE aTtentIOn, please.", "I wasn't aware that having had an experience with something once enabled you to speak on behalf of everyone else's experience. That's amazing, you must be the only person in the world with that ability. \n\nIn my experiences, people very much appreciate the ability to sit down and have a normal meal instead of whatever crap the cafeteria is serving. But obviously you know best since youve been there once and can speak for everyone.", "First of all, you would need to ask the kids parents if that’s even possible. My guess is that visitors need approval before given visiting access.\n\nBut that aside, *why* does this make you uncomfortable? That’s extremely important. Would you even feel able to talk to the other parents?\n\nI think if this an general sense of discomfort, and it’s something you’re allowed to do, then it’s worth pushing through for the sake of your child and for the sake of another struggling kid. You should have the tools by now to process discomfort due to prioritizing something more important. If you’re not close to his friend you don’t even have to stay, just deliver the things and say your son is thinking of him.\n\nUntil you give a reason, even a general one, there’s not enough info to judge.", "If you have time to ask silly questions on the internet, you have time to learn empathy from your son, who is an effing boss. YTA.", "YTA\n\nYour son is an incredibly thoughtful and caring young man. This is instincts and behavior you should want to reward, not blot out.\n\nSeriously, do you want him to visit you and bring snacks in the retirement home? Remember your birthdays? Write nice letters to Aunt so and so when she's down? Then support him in doing this.", "NTA. I’m guessing most of the people saying you are the AH don’t understand going to the hospital is not like meeting someone at the mall or coffee shop. There are rules, including whether or not the patient can have visitors or receive certain items from the outside. First, you shouldn’t be forced into going somewhere you are uncomfortable with. I’ve made that mistake and regret it. Second, at the very least, you and your son need to discuss any potential plans with the parents and get their permission. Third, your son’s letter may not be permitted - whatever its contents, it may go against rules. This is not a simple “hey, let’s go visit friend to cheer him up.” It’s a lot more complicated than that.", "YTA. Your son is showing empathy and compassion for someone else. Take a cue from him and do the same", "Info: Why don't you want to go?\n\nHave you ever spent time in inpatient care OP? I needed to for a few days a couple years ago. It's not what's depicted in the media. It's quiet, there's socialization time, there's group therapy. People who go into inpatient care are at the lowest of low points in their life. Being that depressed is the hardest thing I've ever been through. Life is hard enough as it is, throw the mental health issues on top and it's even harder. The people there aren't bad people, they're just going through a bad time. Your kid wants to comfort his friend but can't. He's asking you instead. Please go if you can. You don't have to stay for long. But his friend would appreciate it.", "YTA - Unless you had some sort of trauma of your own associated with a mental health ward which you’ve neglected to mention, you’re a HUGE AH. Your son seems to have plenty of empathy and truly cares for his friend. It’s quite possible you wouldn’t even have to sit right there with them. But even if you did, treat your son’s friend with kindness and respect. Let them hold the conversation. \n\nThis is a big deal and the fact that your 15 year old is ready and willing to be there for his friend is something you should be incredibly proud and supportive of.\n\nEdit: I didn’t read carefully enough. I see now that your son can’t go at all, even if you are there. Still, I think a quick visit just to say hello, let him know your son wishes he could be there with him and wanted you to deliver some food he enjoys, is not a big ask. Again, unless there is some personal trauma which would truly make it a hardship for you, I find it really rude that you aren’t supporting your son. There is so much stigma around mental health, even in 2023. \n\nI remember, over 15 years ago my father got a knock on the door after dinner and asked if their son (12) could stay at our house for the night. Our neighbors explained that they had to take his older brother (15) for inpatient mental health care and they had no where to bring the younger brother. No further questions asked, no rebuttal, just an, “Absolutely”. My mother got home and my father said, “Bobby (name changed for privacy) is staying with us for the night.” \n\nI’m so grateful my parents were both so willing to help them in a time of need. They didn’t know Bobby very well. They didn’t really know the parents terribly well either. But it was clear that they needed help. It’s crazy to me that despite the fact that your son is setting an excellent example for YOU, you’re still not willing to rise to the occasion.", "I'm not going to judge you, here. I'm going to give you some perspective from someone who's visited my sister in these places. These places are terrifying to the people inside. Some of the patients are WAY worse than the person you're visiting. Just people talking to things that aren't there, violent screaming and outbursts, workers that have gone numb to it, and only do something when the patient does something that disrupts THEMSELVES, all day, and all night. It's terrifying to the patients that aren't as far gone, and for a CHILD, poor baby. Mental illness can happen to anyone, at anytime, including YOUR child. This can happen to YOU. \n\nTo take away the mystery of being a visitor, I walked in, gave my ID, got my picture taken, everything I brought was searched. It was like I was visiting someone in prison. Some of them WERE criminally insane, so, that would do it. All my belongings were put in a locker. When my name was called, I went to a room where my sister joined me. We chat, she eats the snacks, time's up, I leave. Everything is locked tight, so no interaction with the more gone patients. It's not so bad.\n\nI'm actually surprised they'd let you bring outside food, I'd call and ask, but if you CAN, you SHOULD. If you're worried about what to talk about, talk about normal shit. Keep it light. Bring books, shit can get boring in there, too.\n\nPlease do it. You're son will think your a super hero and the child will think you're an angel, they'd be correct. It won't be any more than 30 minutes to make memories for a lifetime. This is an opportunity, take it. DM me if you're still nervous or have any questions. You can do it!!", "NAH - it’s close but honestly I wouldn’t go hang out with a random 15 year old on the psych ward either. Would his parents even be okay with that? I do get your sons position though.", "I think you should talk to his parents. This child is a minor and that trumps everything and his parents have the final say. I say this as a Mom and I would feel a certain way if another kid wanted to pass a letter to my child in a fragile mental state that he was afraid of me seeing. To me that is a red flag. You have no idea why your sons friend is in there and if that letter would have a positive or negative effect because he wants to hide it. His friend has mental health issues and I would be concerned as the mother of his friend if there was anything that would trigger my child’s mental state. It’s the secrecy that concerns me. What if that letter says something that would harm his friends mental state? You have no idea of knowing. \n\nI would speak to the parents and ask if you can hand over a pizza, comics, and letter to them for their child. It is up to them as his legal guardians to determine the next steps.", "YTA you don’t have to stay. Drop off the stuff, say hello and be kind to him for a quick 5 minute visit and leave.", "I'm going against top comment and say NTA, and here's why: unless you know why this kid is in treatment, you don't know if snacks and this type of food is allowed. Also, I'm assuming you don't know what's in your son's letter. I understand why he doesn't want to give it to the parents and his concerns, but sometimes kids are in treatment due to situations with other kids. \n\nY T A for feeling uncomfortable, prioritizing your feelinfs over his, and stigmatizing mental health, but NTA overall because it's a bad idea to go around parents in a medical situation like this.", "YTA. He’s not allowed to go comfort his friend and he asked you for a small favor. The poor kid is probably uncomfortable being in the ward, too.", "FYI: most hospitals (especially pediatric ones) have visitor lists with limits on how many individuals may be on the list. If you don’t speak to the other kid’s parents to be added to the approved visitor list you may not even be let in the door. \n\nI say NAH because the thought is there from your son, I understand your discomfort; but also you may not even be allowed in so this could be a lot of arguing for no reason.", "YTA \n\nNo one enjoys visits of that kind.  We do them because they matter so much to the recipients, and in this case to your son!", "NTA. Being a parent doesn’t erase one’s humanity. She has a boundary here and y’all are demanding reasons for her not going to the hospital. Maybe she doesn’t know exactly why but she’s uncomfortable. Do you want her to go sit with a child in a mental health treatment facility and make him even more uncomfortable? That would be a mistake. Leave her alone.", "INFO: why don’t you want to go to the hospital? You know you would be doing a great service to your son and his friend if you went. What is it that is preventing you from going, is it a specific trauma, or is it just that they seem a bit creepy to you? And as others have pointed out - you might not even be allowed to go. Have you checked with the hospital?", "NAH... for mom not saying yes to visiting someone else's kid who they don't know/aren't close with. \n\nThis is definitely the teenager writing this trying to justify being pissed at their parent. And teenager, you're wrong, sorry. \n\nSeriously mom is not at all the AH. \n\nSo what would i say to mom: \n\nGiving the letter and comics to parents is literally the only option here. You, as a random adult, can't show up and bring gifts and meet with a random teenager WITHOUT THEIR PARENTS APPROVAL! And many facilities are only offering in person visits to literal family members because of COVID. \n\nAny letter will absolutely be read by staff because that is the literal safety rule. They will browse ALL materials brought in for content. Seriously. Those are the minimal safety rules. If the letter is sealed, they will literally open it. \n\nYour teen is trying to do the right thing here and i applaud that, but your teen does not understand what health facility rules ARE and how innappropriate it would be for you to show up as a random adult and try to see a kid in a mental health facility who you don't know. And NEVER would that be allowed to happen without parental permission. NEVER. Even dropping of gifts or items without getting an okay from this kids actual guardians. \n\nYou offered a reasonable compromise. I'm sorry your teenager doesn't understand. \n\nAnd teenager: \n\nI'm sorry you think the world is simpler than it is. It isn't. Your mom isn't an AH. You Dad isn't an AH. This just isn't a thing.", "You'd go, say \"Hi X! As you know \\[son\\] can't come because of the rules here, but he wanted you to drop some things off. Hope you feel better soon and I'll see you around!\" you absolute joke of a person. What do you think might happen, you'll catch Mental Health? You can make your son's friend feel a lot better and give up an hour of your time, and perhaps learn how to be less self-centred?", "I’ve been in a psychiatric ward and I don’t blame you for not wanting to go. I’ve both been the visitor and the patient and to be completely honest, neither are a joy. I get that visiting is uncomfortable, and the effort to go should be made if you’re a part of that person’s support network but it doesn’t sound like you are. I think passing things onto the parents is a good compromise. Could the letter not be passed along in a sealed envelope? \nNTA", "I mean you have a 15 year old son, what do you talk to him about? Maybe start with something similar… sport..video games…hobbies. Or as others say, you could drop the stuff off and go.\n\nYou should be proud that your son wants to connect and help his friend,I am sure there are some teenagers who wouldn’t want to. Also if you went one time it might give his parents a break from going ( not necessarily for hours but might give them an hour or so)", "Honestly, ESH just because there seems to be a lot of expectations on either end. this is coming from someone who has been through the system themselves- it’s a hard environment and not to be taken lightly. i think having him seal the letter & giving the items to his parents might be safest. also, as a pt, i would have felt weird if one of my friends parents showed up to the institution i was staying in, no matter how well meaning it was.", "Has anyone considered the possibility that the \"treatment facility\" is a conversion clinic, and that the letter OP's son is being so private about is a love letter?", "No judgment.  Is your wife unavailable to take your son ?", "YTA Why do you not want to go? It feels weird? You value... not having to endure feeling awkward more than your son? Your son's not asking you to be tortured for him -- I would think you would value your son enough to do this for him.", "NTA, give the comics and stuff to that kids parents and they can take it. More importantly what is in the letter that he’s ashamed of?? If it’s a mental health ward and a minor he prob doesn’t get letters until they’ve been vetted anyways.", "NTA. He is there to get treatment, not have tons of visitors. Stays in those places aren’t long, he can give him the stuff when he gets out or like\nYou offered you could give it to the parents.", "I'm not going to make a judgment, but I have been in a psych facility. They would not accept outside food. That's pretty standard. On the pediatric side, I would be surprised if they let you visit without his parents' consent, and even then, they may not. When I was in, I could have my spouse and could have had my parents if they lived close enough. The friend should have phone privileges, however, unless he is very unstable, and he could reach out to your son. Getting a letter may trigger some of his issues, so again, it may not even be permitted. Before this issue comes between you and your son, you should reach out to the other child's parents to see if what your son wants is even possible.", "What the actual fuck is up with all the Y T A votes? Do any of you realize how strict visitation is? She wouldn't be allowed to visit. In an adolescent ward it's family only, and that doesn't include minor siblings. No girlfriends or boyfriends, none of that. I question the food being allowed. When my SD was hospitalized she was allowed a blanket and under garments. The bra had to be wire free.\n\nI vote NAH, your kid is stressed out. I'd also question if they are secretly dating as well, but that just might be my Spidey senses tingling.", "I saw your update about FaceTiming, but when my kid was in a mental hospital, we had to lock our phones and everything in a locker before we could visit. You might want to make sure the FaceTime is allowed before promising it.", "\"I'm sorry son, but your emotional health isn't worth an hour of my time.\"\n\nYTA", "NTA. Are we even sure parents would be ok with another adult visiting their kid in the psych ward?\n\nI wouldn’t be comfortable visiting someone else’s child who is under commitment. Yikes.", "Please go. Your son cares so much. Institutions are not the stuff of movies. As your son becomes an adult  he will look back at this time.", "This isn’t really a boundary. This is I’m asked to do something I don’t want to and i don’t like it. \n\nA boundary would be I will not associate with this child because they are mean/hurtful/disrespectful I am doing this to protect myself or others. \n\nBoundaries need reasons. I don’t wanna isn’t a good reason. \n\nYTA go do this for your son. You don’t have to stay very long.", "YTA. And also missing an opportunity to really connect with your son who cares about his friend. Just make it a quick drop off “oh hey so and so! Brought ya some pizza cause my son was thinking of you. Here’s a letter and some comics from him. Enjoy!” And then leave? Unless he wants to chat for a minute. What do you think is gonna happen at the hospital? It’s just a hospital.", "YTA\n\nYour also teaching your son how you feel about mental health and people who have to go to these hospitals as in patients .... Do you think that will make him comfortable talking to you if he has a problem in the future?", "YTA.", "Nope... Like nope... I get a teenager wrote this post. But no random adult should agree to bring random stuff to a different teenager in a psyche ward without a)expecting all content including that letter to be reviewed by staff b)talking to the parents and getting parental approval c)no.. this is an adult. They don't need to visit to watch a teenager eat food and read comics. That's not a thing. Dropping of gifts sure. Passing along gifts, sure. But that's what was offered. \n\nTeen's heart is in the right place... But that letter will be read the comics will be reviewed all for safety reasons... And parent can pass that shit along... But probs should not randomly visit a teenager they don't know.\n\nSimilarly no random adult who is not on a pre-approved list is going to be able to see a minor in a facility. It's not happening.", "Right? I wasn't comfortable when I woke up to a toddler vomiting on me but I was a parent and parenting is uncomfortable sometimes.", "Also, this isn't about \"boundaries\". It's about \"but I don't wanna!!\" OP is failing both her son and his ill friend. \n\n\"I don't even know what to say to him\". You say, \"I'm really sorry you're in this position. I hope you have all the support you need - my son is right there for you and would be here if he could, but the rules won't allow him. Is there anything you need? Are they being helpful? How are your parents dealing with you being in here? Is there anything we can do you for you and your family?\" YOU KNOW, YOU SAY SUPPORTIVE THINGS ONE SAYS WHEN VISITING SICK PEOPLE. (Sorry for yelling, but, seriously!!)\n\nYTA.", "You’re teaching your son not to do things that inconvenience him, don’t benefit him personally, or test his personal courage. Do you think that makes you mom of the year?\n\nOf course he’s upset and disappointed in you. You’re not doing a fairly simple favor for him even though it clearly matters a lot to him (a *letter?* Seriously?), with no reasonable explanation for your failure.\n\nYTA", "It doesn't sound like the parent knows this kid at all.", "Agreed. At minimum, OP should talk to the parents first.", "I'm wondering if OP's son is thinking OP would not visit if he was a patient there.", "Adult psych wards operate differently than adolescent psych wards. Only immediate family or parent approved visitors. My stepson wasn't even allowed to see his sister since he was a minor. It is highly unlikely that OP would even be allowed to drop things off 🙄", "To scramble this a little, I feel like being a parent should be about doing a solid (favour) for your kid when they're underage. If they get drunk and throw up on a bus, you should go drive and pick them up (true story, did happen to me) because they didn't choose you for a parent but you chose to have them for a child. You don't have to do everything they ask (obviously), but you should help them out when they really need you.", "“I don’t think there is enough information to say for certain OP is or is not TA.”\n\nThere isn’t enough information to say whether OP would be allowed to visit.\n\nThere is absolutely enough information to say that OP is TA.", "I know! This isn’t even a boundary. She just doesn’t want to. A boundary need to be well defined with a well defined reason.", "Agreed. Some people have trauma related to it or can have anxiety attacks from it. Your blood pressure going up in hospitals/around doctors happens so often it's been labeled \"white coat syndrome\".\n\nIf it's a legitimate reason it'd be mentioned. Just not like hospitals isn't enough since yeah she can absolutely just go, drop everything off, communicate her regards and leave.\n\nOr suck it up and fiddle on her phone while he eats pizza. Like what's the big deal?", "These are all very good points. The OP would be much better off researching what is/isn’t allowed and whether a visit from her is even a good idea for her son’s friend rather than telling him she just doesn’t want to go.", "Same goes for the child/ adolescent psychiatric wards in my hospital. It was parents/guardians only.", "Oh..... Oh no..... OP is neither mighty, nor a hero. \n\nThey might get *UNCOMFY*!", "From his sunken window, it's _Toadally Kyle!_", "You would rather her teach her child that once you become a parent your own feelings no longer matter? For whatever her reasons, she is not comfortable visiting someone else's child in a MH hospital.  Why is \"no\" not a complete sentence anymore?  There's nothing to indicate she was rude to her child or harsh.  Just that she said no.", "It was her reason for not going -- that she would be \"uncomfortable\" without giving any reason why that would be.  Her son wants to do a kind thing for a friend and needs her help, but she is wrapped up in anticipated discomfort.  The son has good reason to be disappointed in OP.\n\nNow, if OP couldn't visit because of regulations, that is a separate issue.", "YTA, the least you could do is reach out to the kids parents to pass along the kindness your son is trying to provide his friend!", "Pretty good solution OP.  🫡", "It's not clear enough to answer. \n\nIs just a mild discomfort? Some kind of anxiety?\n\nI know people that will go to a really bad place if they went to a mental health ward. is this the case for you? \n\nI don't give a judgment, but you really need to think why this is bothering you.", "YTA your son is asking for help with something he literally is not allowed to do himself. his friend is in a hard place and he just really wants to support and be there for him. he can only do that through you currently. Would it really be that difficult to put on a smile and converse with the kid, even if it’s just for your son?", "NTA. I’m glad you have a solution to the problem but in all honesty I don’t see how you could be TA. If you’re uncomfortable in the situation so be it. That whole thing about being a parent meaning you have to sacrifice your comfort goes as far as sacrificing sleep and having to stand up for your child. But this situation does not fall in the same category. People are allowed to be uncomfortable in situations like this and your son needs to know not to push you like that.  Very disrespectful.", "I can understand why you don't want to go. Being someone's parent and sitting there awkwardly not knowing the kid very well is awkward as hell and that's even if mental institution isn't involved. \n\nBut unfortunately given the situation, I think you're gonna be guilted into it since your son really wants to go and isn't allowed and you're it for the option. \n\nI might suggest talking to the kid's parents about the whole situation, though.", "YTA majorly.  Is there a reason for this?  Boundaries are one thing but unless you have a reason, it seems random and like you don't like psychiatric hospitals. He isn't asking for much.  \n\nI am glad you found a partial solution but you have some bridges to mend.  Mental health disorders don't go away and this may happen again. Being uncomfortable isnt a good reason", "If his parents go most days then why don’t you coordinate for you and your son to meet them in the parking lot of the facility beforehand and give them the things your son wants you to pass along?", "NTA\nWill you provide an update, please. Good luck to everyone involved.", "yeah, YTA. i would also feel uncomfortable and i personally have medical trauma just to add to the discomfort, and i wouldnt like it, but i would go. let the kid eat some pizza and think about his friend. maybe ask your kid if he maybe has some subjects you could talk about with him/questions he may have for him, maybe even a YouTube video he'd like to show him if the hospital allows phones during visits. dropping the stuff off and leaving is also a good option. maybe comfort this 15 year old whos in a crisis. lots of options, yet the one you chose was to let both your son and his friend down in a time of need, because the alternative wouldve been \"uncomfortable\" for you.", "I worked at an inpatient facility for a while and you couldn't visit or even call patients without a password the parents picked out. I can't imagine it's much different there.", "Your son is a better person than you and it's not even close.", "YTA in a huge way.  Your son is 100% right in seeing this as proof that he can't trust your word unconditionally.  I  do see in your edit that you are going to see about visiting and face timing,  which is great but it's not going to undo the damage already done", "And the update really makes OP seem like an AH, while they did arrive at a very reasonable compromise based on suggestions, somehow they seem pissed at the comments they received on this forum.  If they wanted advice and not judgement, maybe should not have posted on a forum directed towards providing judgement based on limited facts🙄", "Unless she has past trauma and issues where going there could trigger her. No one has to go anywhere for someone if it makes them uncomfortable.", "Only 95%?", "Idk, I didn't read it as her being judgemental that he's in a mental health ward, more like it feels like a private and intimate setting and she just doesn't know this boy like that. She mentions not knowing what they would talk about or do, I can understand not wanting to be your son's proxy for a one on one conversation with his best friend. It also might be really out of her way and take up a lot of her time to do something she finds to be deeply awkward, which makes her want to do it even less because it will be a lot of time feeling awkward instead of only a moment of awkwardness.\n\nBased on the edit, it seems like the thing that makes her comfortable with the new plan is that her son will be entertaining his friend during this one-on-one meeting and she won't have to come up with conversation; she doesn't seem to have a problem going to the hospital or the mental health ward.", "I’m not sure I’d feel comfortable visiting an underaged patient without their parents’ consent either. As an adult, I’d feel weird. This is provided the parents are involved in his life but it sounds like they are. I think it’s NAH, son isn’t TA for asking and parent isn’t TA for feeling uncomfortable at the idea.", "I'm going to start referring to myself as Toadally Kyle now. It's much better than just plain Kyle.", "Are you allowed to visit without his parent’s permission? Since he’s a minor would the hospital have a list of approved guests?", "YTA. I did read the whole post, and it was still judgemental.  I’m astonished.  Every time I think we are moving towards a better understanding and de-stigmatising mental health issues, I see things like this.  I want to believe that you just don’t want to be bothered, but your explanation is dripping with disgust.  Glad you’re going to take him, but please educate yourself about this.", "I’m not going to weigh in on whether or not YTA, because you’re entitled to your boundaries and I can understand not wanting to go. I think you’re doing a good thing by going in though. Your son’s friend is going to remember your kindness and efforts probably for the rest of his life. It sounds like a wonderful idea to FaceTime. Your son’s friend likely feels very afraid and stigmatized and your kindness and acceptance can actually help him heal in a way.", "Really glad you came to this conclusion. It is a good example to your child.  They do what they see their parents do.", "YTA.\n\nAt the end of the day, this isn't actually about you. It's about supporting your son.\n\n\"I don't want to\" is a good enough answer most of the time, but not when it comes to supporting your own children.", "It is vet difficult to go to a place that you feel uncomfortable in, but after reading your update, I am happy to see that you will make that visit. You are helping both your son and his friend by doing so. Good job!!", "NTA. I disagree with all the posts saying it's part of being a parent. No, no, it's not. Sometimes, the answer to things is no, and that does not change just because your child asked.", "Yeah. I'm really surprised (well.... not too surprised) at the responses here. Soooo many reason why OP would not want to be involved in this and many ways, other having a parent intercede, that the OPs child could still interact with the friend. NTA. OP is allowed to have boundaries.", "I don't have kids but I've told my dogs to stop putting their penis in their brother's ear enough times to know kids are going to be even more uncomfortable.", "That sounds very strict. It will definitely vary per hospital. When I was a child in inpatient I had several of my parents' friends visit. It could be anyone on an approved list.", "Shit I’d do this for a kid I’d never met or heard of if I was asked. I know what it’s like to have severe mental illness as a teenager and it fucking sucks. It’s ostracizing and discouraging and miserable.", "Or op could have some nice gentle small talk. This idea that she would just be sitting there watching him eat pizza is so wildly ridiculous. Like, this person is friends with their son, striking up simple conversation shouldn’t seem to hard to comprehend- it’s literally common curiosity given their relationship to each other…", "They told me rules became more strict in 2020 for obvious reasons. No clue what it was like before that, as that was our first time there.", "Every single time I go see my doctor, whom I adore, my pulse skyrockets. My resting heart rate is already high but it jumps like I’m running a marathon even though I haven’t been legitimately afraid of doctors since I was a kid. But that pretty much only happens when I’m there for me. If I’m in a hospital or Dr office for someone else, no problem. But I wouldn’t be surprised if some people can’t even look at a hospital without panic.", "My doctor thinks I have high BP because it's high every time I see the doctor. \n\nI'm like no it's normal, I swear. Funnily enough, I see my cardiologist over telehealth and my BP is fine then.", "I used to visit my daughter’s best friend in pediatrics as she’s suffering from sickle cell disease and she has shitty parents. The ward was not authorized to kids under 15. It has never been an issue as I felt really bad for this poor girl who was suffering so much. I became with her grand mother (who is as great as the parents are shitty) and some nurses and was able to “smuggle” my daughter and some other friends to visit thanks to them. \nAs long as you don’t interfere in family life or medical treatment and just provide authorized food, school work and gift from friends, there is no issue for me. I always kept my opinions to myself, even when the grandma shared with me that she was disappointed by her son and DIL (the grandmother was visiting almost everyday and bringing meals). \nDiscussing with the nurse made me understand how difficult it was for the children and why it was good for them to get visitors and news from their friends.\nNote that she was so often at the hospital that the 1st time, when I ended up in the ER because I was lost in the hospital, they knew who she was with just her first name! It made me so sad for her.", "I have no idea where all the ridiculous YTA people are coming from, and I'm probably gonna get downvoted for this, but NAH. I've been through one of those facilities as a minor before so I know firsthand how much it sucks to be in there.\n\nThat being said it is not your kid. I get that your son wants to help his friend and isn't able so he's asking you to do it for him, but that's not your kid and you have no obligation to do so. Screw all the \"uncomfortable\" nonsense. Yeah it'd be nice if you went, but not going in there doesn't make you an AH, it just means you don't feel a responsibility to a kid that isn't yours (which you have every right to feel). If he was in rehab or juvie or a mental health facility like he is now, you'd be right to feel compassion for the kid but to feel a responsibility to help take care of him? Nah, get out of here with that. I get your son's feeling of anger, he feels powerless when he wants to help his friend and thinks that you should do it because he wants you to. But that's not how the world works.\n\nOffer your son a day/weekend to spend with his friend when he's released. It'd be easier for your son to support his friend when it's in a familiar environment and not done by proxy.\n\nI hope your son's friend is able to get the help he needs. It sounds like he already has a good support system with your son.", "I saw your edit and I think it's amazing that you are going to do that for your son. I hope his friend is doing ok and getting whatever help he needs. Your son has a good heart for doing that for his friend too, it proves to his friend that no matter what happens your son has his back and will not abandon him in a time like this.", "NAH- There is no way you are getting on that ward without prior consent from the parents and the son's treatment team. Everything you bring will be searched and checked. Likely no comics if they have staples. Your son's heart is in the right place but there are rules for these types of situations. It's for the patients protection.", "NTA\n\nI don't understand why you would be. People are allowed to have boundaries. It is good of you to go anyway, but you shouldn't feel obligated to do that. Sorry you're getting such negative feedback.", "I worked in an IRTS (intensive residential treatment support) program for adolescents. They only allowed immediate family members on the unit and had an extensive search process when gifts were going into the program. The comics would probably get flagged because they have staples in them. The facility would need to notify the friends parents about the visit. There is no “privacy” in a psych ward, so if the son isn’t comfortable with the parents reading his letter, he best be prepared for when the treatment team is doing so. It’s wild to me that OP’s son actually thinks that they’d let his mom in to see a friend without it being an issue.\n\nA nice thing for OP to do would be to call the family and invite them to dinner once their child is discharged from the hospital. It’s not appropriate for her to show up to visit the son’s friend on his behalf.", "It's called White Coat Hypertension. It can be serious and lead to increased heart disease. Have you ever told your doctor that it's only when you are at the office?", "The letter could result in trauma. It will be read by the staff anyways. And still has little to no chance of getting on the ward as a non family member.", "NTA", "YTA", "I’m glad about your update, it wasn’t nice the fact you completely discounted it without even trying to find a way you’d be happy with. You could have even just gone to the main desk at the entrance to the wards/hospital and hand things over for patients, just give their name and ward. I think it’s more about your son being able to find out how his friend really is as well as the friend knowing your sons trying to be there for him.   \nWhat normally happens when you actually  visit is you pre book your visit and sign in at the entrance before being buzzed in and escorted to a private visiting room. He will then be brought into it and you can both sit and talk privately. It’s unusual for you to be allowed to mingle in the wards common room with other patients. You are normally given an hour but can leave sooner whenever you want. Just treat him normally and like you would treat your own son or want others to treat him in this situation.  Depending on what stage he is in his treatment they may give him permission to go outside the ward with you, if you’re ok with that, just to the buildings cafe or gardens. Which might make the time pass easier but they’d only do it if they think he’s ready and it’s safe and if you felt comfortable with it.", "NTA. Your son is being a little unreasonable here. I think it’s great he cares so much for his friend and wants to make sure he has a treat. But he needs to respect you, as well, and your not wanting to go isn’t “judging” his friend. Perhaps your son could ask the friend’s parents to take the letter/comics, as you suggested, as well as your son asking them if they’d mind bringing a pizza from him and giving them the money for it? (I haven’t been in a mental ward, but I have been in the hospital a lot from babyhood and having my mom come in with a treat and saying “this is from x friend” was still pretty special)", "You were the A, and I’m glad you reconsidered and figured out a solution.", "damn as a kid who was in a mental hospital a bunch due too, n abusive home life I wish I had a friend want to visit me, you visiting him for your son in his place can legit make his day and be the 1 good thing out of a shitty event. Also WHO CARES WHAT YOU DONT LIKE youre a parent congrats maybe you shouldn't of had a kid if you're gonna put yourself first", "i actually just left a position at a mental health facility, specifically dealing with a child an adolescent unit. honestly, those places suck. but its because of the way administration handles things. you'll probably feel extremely uncomfortable getting through, but once you see the kid, you *should* be in a place with people that care. i cant speak for every facility though, this is just my experience. feel free to DM me if you have any specific questions. i loved my job there, but couldnt handle the admin.", "I think your son doesn’t understand that you aren’t judging his friend, but maybe some of the other patients there, I think FaceTime on your phone and just letting them talk in there is a great idea because they can see each other and you won’t have to do much. NTA", "Former mental health admin here.  First, I'm pretty sure you can't visit without the parent's consent.  Secondly, the staff is not going to be thrilled about you hooking up this kid and your son without some oversight.  \n\nI won't jump to YTA but I think your behavior needs some explanation.  Are you afraid of mental hospitals?  The people in them?  Are you worried about the relationship your son has with the hospitalized young man?  \n\nIf none of the above are true, I think you might be the AH.  This kid is obviously close to your son and your son wants to do him a kindness and his barrier to this is....you?  Tsk tsk.", "i mean, he’s not a regular person if he’s there lmao", "Finally, someone who has actually put thought into whether the parent can even get inside the facility or not...", "How do you think this kids parents would feel if some adult they may or may not know went to visit there child without them knowing. I think you should at least ask the kids parents if it would be ok for you to visit and bring him some things from your son. You don’t need to tell them it’s a letter. I know I wouldn’t feel all that comfortable with it.", "You're the asshole", "I'm glad you worked it out. I came to say YTA, because your son trusted you enough to ask for this, and you jeopardized that, but now you worked it out. \n\nGood for you! I'm glad your son's trust wasn't misplaced.", "Being able to see the friend is good for your son’s mental health too", "Put on your adult pants and go. And then talk with your therapist why you didn’t want to go. No judgement.", "Responding only to the update: if the facility your son's friend is in has similar rules to the one I work at, you won't be allowed to use your phone during the visit. Personal electronics aren't allowed due to privacy issues for the other patients. So keep that in mind.", "I remember when my brother was in a psych ward.  I went everyday for a month (it was a 2 hour drive, 1 hour there, 1 hour back).  I wanted him to know he wasn't alone with his struggles (he had suicidal ideation).\n\nHe got better but then he got worse and lost his battle with his mental health and was successful in his endeavor to end his suffering.  But any little connection you can have with the outside world makes them feel like this isn't a sole battle but an actual war that he can win.\n\nI think the age restriction is for safety reasons.\n\nI am glad that you reconsidered (and doing a FaceTime thing between the boys).  This young man will not forget it and be eternally grateful.  And I understand that it is uncomfortable but it is for the betterment of the patient not the visitor.\n\nNo one is the asshole in this situation.", "But she is not the parent of the nutjob", "I have to disagree with you here.  We obviously don’t know how uncomfortable OP is, whether just some mild anxiety and annoyance or if it’s crippling.  If it’s what I can imagine, it’s probably pretty bad.\n\nI have diagnosed OCD, I am literally just some bad episodes away from being one of those patients getting treated, and I absolutely without question do not blame OP for not wanting to go.  If you don’t handle the environment well it can be extremely unsettling.  It’s not all unicorns and roses in many of those wards, they can be very depressing and for some very scary, such as myself.  I have been to the one in my city for work (not as a patient), and just walking up to the door was panic attack inducing for me.  No one wants to be there.  I was very lucky they didn’t ask me to go out on the patient floor or I would have quit on the spot.\n\nThis would be akin to asking someone with claustrophobia to take a tool to the plumber in the crawlspace.  Ask someone else to do it.  Another family member? Uncle/Aunt? There are alternatives here, why does OP have to be the messenger?", "Yes, visiting is inappropriate.", "First realistic answer I’ve seen, thank you!  Some people just don’t handle this well.", "Wouldn't OP need the parents permission to visit since the kid is a minor? They would never just let someone who claims to be the father of a friend meet a patient or give them things.", "Many places have a policy of retaking BP several minutes later if it is high due to the prevalence of this phenomenon. Ask your doctor/nurse if they can retake it in a bit.", "NTA. NAH. I understand where your kid is coming from. I wish you would just suck it up. But you have the absolute right to say no, mean no, and not owe anyone an explanation period. You are an adult in charge of your life and screw the judgmental AH calling you one.", "I like the update. She actually listened.", "NTA lol\n\nwhy msut you go visit your son's friend, regardless of whether they were instituionalized or not. that makes no sense at all. and why would you keep stuff from the son's friend's parents anyway. that doesnt sound at all conducive for someone with mental health issues.", "Are you 100% sure you are even allowed to visit? I used to work at our local hospital and the psych ward was really particular about who could visit, especially the children’s ward. They also have strict visitation rules and guidelines and phones weren’t allowed. Please make sure you can actually get into visit him before telling them both ok. While I do understand not all hospitals have the same guidelines you really need to make sure. That way if you need his parents permission you can get it before hand."]}