{"id": 9203, "submission_id": "10ufqnv", "title": "AITA for spending an hour in the bathroom so I'd miss church", "selftext": "As the title says I spend about an hour in the bathroom just so I don't have to go to church. My father is a pastor and since I was little it was what was taught and drilled into me.\n\nNow that I'm older I just don't want to go anymore, things have happened to kind of make me want to distance myself and figure things out for me. I've vocalize how I don't want to go to my dad many times but each time it turns into him yelling at me about how I need to read my Bible and how I need this and brings up \"mistakes\" I've made. Or he'll go off on a rant about how I'm selfish and ungrateful because I don't want to do this one thing but want him to do things for me even tho he \"legally\" doesn't have to. When he says that he usually lists things like feed my siblings and I, taking us to school, stuff like that. And I mean yea he doesn't have to do that he could of not had us or given us up but since he didn't, we'll then yes legally he has to feed us. I'm 20 so I've been trying to buy my own groceries and do my own thing but even then he goes off at me about how we're a family and I can't buy food for only myself. \n\nBut anyway this morning I made sure to try and take forever in the bathroom so he'd just leave me so I didn't have to go to church, he yelled at me and went on one of his rants and eventually I was dragged to church all while he called me ungrateful and selfish\n\nA few edits: I know I'm a legal adult, I know I could just go to the bank and do this and that. The thing is I can't, when I leave the house I have to ask permission and let my parents know where I'm going.\n\nI tried to get my license as soon as I turned 16, my dad wouldn't allow it, still doesn't I've been learning and trying to drive but everytime I try to schedule the test he shuts it down and says I'm not ready. So to go to the bank I'd have to catch the bus, I have a bus pass that he again has access and puts exact money on so when I say I'm going here he puts the exact amount needed and if it comes up short or not right I'm busted.\n\nI haven't mentioned my mo, she's in the picture still married and live together but she's much worse. I'm terrified of my mom, I'd rather try to work things out with my dad than her.\n\nI also have 2 younger siblings that I basically parent, I can see they get treated better than I was/am but I just can't leave them.", "created_utc": 1675612520, "permalink": "/r/AmItheAsshole/comments/10ufqnv/aita_for_spending_an_hour_in_the_bathroom_so_id/", "score": 399, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I see how I can be at asshole for spending an hour in the bathroom just to slow everyone down instead of going about it all in a more mature way\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA… you need to find a way to get your own place and move out. This man is manipulative and using religion to push you around. What he is doing is not very Christian. He is a religious narcissist. He won’t change, only get worse. I think he is the one that needs church, not as a pastor either. He is an awful person hiding behind God.", "NTA--What he is doing is financial abuse. Do you have family you can go stay with? Can you stay in a dorm? I would change all your banking info. You are 20 and legally an adult and he is stealing from you. You may want to let him know and what would his parish think of him?\n\nYou are going to have to make a break at some point. Hide money, deny him money and if he is abusive with you call the cops!", "NTA. Save up your money and move out as soon as you can regardless of what your dad says.", "NTA. Can you move out?", "NTA.  Move out. Get a roommate if necessary.", "NTA. I’ve always believed that a person should be able to make their own religious choices. I understand he feels strongly about the whole thing being a pastor and all but he’s going about it in the biggest dick way possible", "I did this as a teen, but to get out of Sunday school. My dad wasn't a pastor though.  NTA. You said he \"does things for you\". Not feeding and educating your child are forms of child abuse. Your dad isn't a good person for this. He is the bare minimum. Things like trips, lessons to follow your dream, college funds; those are things parents don't have to do, but if they can make happen ate things to be grateful for.\nBest advice, the Bible is easy to cherry pick for what you want. Example: the prodigal son story. Son goes off to do his own thing, dad welcomes him back with open arms. Apparently the Bible wants children to spread their wings and fly and dad should just happy if you come back\nEsit: NTA", "You are over 18. Open a new account at a bank he doesn’t use and don’t put his name on the account. Direct deposit your paycheck and your scholarship money to that account.  If you can gather all your identification documents (birth certificate, passport, diploma etc). If he has them somewhere inaccessible to you then you can get official replacements from the city where you were born… Line up your ducks so you can be ready to make your move.", "NTA, it’s your life and your choice to be religious, forcing religion is just wrong.", "Dude, that's what the bathroom at church is for. By leaving the service and using the restroom there, you cut how long you have to stay in service. Make sure to take the scenic route back.", "NTA\n\nPlease add your age for context, if you’re 18 vs 12 it’s a big diff.\n\nJust have a frank convo with them", "NTA. You're 20, no one can force you to go to church, you're an adult. You need to open a bank account he can't access, stop giving him your pay checks and get it into your own account and find a room to rent.\n\nHe has NO right to your money, if he wants to discuss REASONABLE rent then fine but he can't just take half of your money. He's financially abusing you so he can keep control of you.\n\nFund somewhere to stay, get your finances sorted to be accessible by you only, pack a bag and roll out. You're an adult, you're allowed to be free!", "NTA\n\nMy father wasn't a pastor, but was just as devoted to churchgoing, and just as determined to see my soul saved in the manner he deemed appropriate. You won't be free to make your own choices until you are out from under his control. As long as you live in his house, you are under his control. Until you are able to leave, perhaps a good book and a back pew will help keep him happy.", "No NTA but you need to get out of that situation. It honestly sounds abusive. You might have to quietly make your plans to move out because if he finds out that you are planning on moving out someone like your father might just kick you out preemptively. I would get my independence and then go no contact on him.", "NTA: Find a room for rent or friends/coworkers/classmates to rent an apartment with. You need to get your own life. Every college has a financial aid office and there’s websites to apply for scholarships, grants and student loans. I bring up college, because you want a career (nursing, teaching, engineering, IT), that you can make enough money to support yourself on. The idea is to be independent. You’re getting there, by buying your own groceries and stuff. I would highly recommend getting your own cellphone, if you’re on your dad’s plan, so he can track you with incoming and outgoing calls. The more free you are of this, the clearer your mind will be to sort things out. Being Christian isn’t a bad thing. I’m just worried about the friction between you and your dad. This could turn violent. 2-1-1 is a number for local community resources. Best of luck to you!", "NTA! You are a 20-year-old ADULT and he is treating you this way? He is abusive. I hope you are able to move out soon!", "just ask the little pastor, why venerate a god who thinks that every newborn is a sinner? much justice, such wow.\n\nreligion is just delusions for the weak.\n\n&#x200B;\n\nyou\\_'re 20, move out, go no contact and just leave that useless cultist behind\n\n&#x200B;\n\n(oh and as he tries to make rules about children, he is legally obligated to pay for them etc., alas who expects common sense from a cultist, eh..)", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAs the title says I spend about an hour in the bathroom just so I don't have to go to church. My father is a pastor and since I was little it was what was taught and drilled into me.\n\nNow that I'm older I just don't want to go anymore, things have happened to kind of make me want to distance myself and figure things out for me. I've vocalize how I don't want to go to my dad many times but each time it turns into him yelling at me about how I need to read my Bible and how I need this and brings up \"mistakes\" I've made. Or he'll go off on a rant about how I'm selfish and ungrateful because I don't want to do this one thing but want him to do things for me even tho he \"legally\" doesn't have to. When he says that he usually lists things like feed my siblings and I, taking us to school, stuff like that. And I mean yea he doesn't have to do that he could of not had us or given us up but since he didn't, we'll then yes legally he has to feed us. I'm 20 so I've been trying to buy my own groceries and do my own thing but even then he goes off at me about how we're a family and I can't buy food for only myself. \n\nBut anyway this morning I made sure to try and take forever in the bathroom so he'd just leave me so I didn't have to go to church, he yelled at me and went on one of his rants and eventually I was dragged to church all while he called me ungrateful and selfish.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I hope you find a way out soon.", "NTA especially considering your other comments and edits paint a very concerning picture of your home life. I would agree with other commenters that you are being controlled/abused. \n\n> So to go to the bank I'd have to catch the bus, I have a bus pass that he again has access and puts exact money on so when I say I'm going here he puts the exact amount needed and if it comes up short or not right I'm busted.\n\nIs there a way to pay for a trip using cash or some other form of payment? \n\n> I tried to get my license as soon as I turned 16, my dad wouldn't allow it, still doesn't I've been learning and trying to drive but everytime I try to schedule the test he shuts it down and says I'm not ready. \n\nI hope you realize this a lie and he’ll never let you be “ready”. \n\n> I also have 2 younger siblings that I basically parent, I can see they get treated better than I was/am but I just can't leave them.\n\nHow old are they? Do you have any concerns about their safety?", "NTA.  Your father is abusing you.  A 20-year-old should be free to leave the house.  \n\nThis sucks, but it's a good idea to start making an escape plan.   When you go to the grocery store and buy food, what are you using?  If you're using a card, you should start getting cash back and hiding it, ideally some place outside your home.  \n\nIf you're ever alone, and if you have access to the internet, go into an incognito window and go here:  https://chat.thehotline.us  This is the National Domestic Abuse Hotline.  You *are* being abused.  Preventing an adult from leaving the house is abuse; controlling their finances is abuse. The  hotline can give you advice about escaping.\n\nYou'll see when you go to that link that they have tools so that you can immediately shut down the window if he comes in.\n\ne: Your college may well have resources for students who are being abused.  Look at the college webpage under something like \"abuse resources\" or \"student support\" or \"dean of students\".", "OP, this is heartbreaking. I'm so sorry. \n\nEveryone's advice about getting your own bank account and moving out is solid, and those are the things you'll eventually need to do. But right now you are dealing with the emotional effects of the abuse, so I beg you to reach out to the college counseling at school and explain the situation. They may have resources they can connect you to, and you'll at least have support other than your boyfriend. You may be able to get connected to a buddy/peer counselor who can do things like go to the bank with you etc. There might be housing financing or other programs you qualify for. You need community for this. NTA", "NTA. You are being abused. Run away. Pack a bag of essentials and go stay with a friend or coworker or acquaintance. Never discuss the details beforehand via text because I am 100% certain your abusive family has access to your digital devices. It's time to go, now, right now, no guilt do not look back drop everything and leave.", "This is a domestic violence situation. Your father is using coercive control to intimidate and abuse you. Try to find an organisation in your area that helps people leave violent situations. Although you are an adult, I would argue that you are a vulnerable person as a result of many years of abuse, financial abuse, parentification and learned helplessness. \n\nNTA", "You have bigger problems than going to church. You're being kept prisoner. Get outside help please.", "Nta", "You are being financially and emotionally abused. There is help out there for you.", "INFO: Does your college have a counseling center or guidance counselor or mental health office? Make an appointment, tell your dad it's so they can help you plan out classes for next semester, or skip one of your scheduled classes if you have to. \n\nYou're being abused and you need help to escape from the situation. Talk to someone. \n\nIf you have a professor that you trust, talk to them. \n\nTell your parents you aren't feeling well and go to a doctor, then when you're alone with the doctor, explain the situation. \n\nSay you need to go to the library to get a book for class, or to meet up with a study group. Use a library computer to contact a domestic abuse hotline. Ask a librarian if they have a phone you can use to call a local shelter. \n\nI hope you're able to get out of there as soon as possible so you can start to live your own life.", "NTA. I just read your update. If you can look for helplines you can contact. Maybe contact a social worker who can help you (not all of them are for child services.) It sounds like you are in a cult and are basically being held against your will. If you have a friend, ask for help from them.", "NTA. Be openly rebellious! Be bold. What's the worst that could happen? Kick you out?\n\n\nI understand that you need a place to live but your father will continue to sabotage you until your spirit is smashed into the ground.  Gtfo!", "Seeing the comments here kind of annoys me. \"Youre an adult just move out\" \"Get your shit together and just leave\" \"He's not ALLOWED to take your money you're an adult!!! You're an adult just leave!!!\"  \n\n\nDo none of you realise what abuse does to someone? Do none of you realise what kind of shit OP can get into if they try to resist and stand up for themselves? They are being ABUSED and have been abused for years.  \n\n\nOP i truly hope you can escape that situation. Try to call an abuse hotline for the area you live in. Maybe try to find where the nearest homeless shelter (if they're around) is and get them to help you get out and away from that house. Try to do anything you can to escape. You are not alone and there will be people out there that can help you.", "NTA. I am so sorry to read your story. You are being abused, financially and in other ways. Does your college have a counsellor that you could speak to in confidence to begin to explore how you could get out of this situation? A counsellor should normally keep your conversations absolutely confidential unless they though your were going to harm somebody; and they will know agencies which support women trying to escape abusive situations. \n\nIt sounds like that feels overwhelming at the moment but I wish you well in finding a way to escape. The way you are being treated is not OK and absolutely not Christian in any way.", "YTA for your passive-aggressive attempts to avoid church. Spending an hour in the bathroom is just childish and it didn't even work.", "NTA\n\nPlease only take this advice if you feel physically safe and have no fear of being tossed out of the house.\n\nDo you do confession? Does your church offer it for after the service? GO TO IT. If your dad objects, even for time constraints, speak loudly as if you are amazed. 'YOU DON'T WANT ME TO GO TO CONFESSION? WHY? WHY DON'T YOU WANT ME TO CONFESS MY SINS? OH, A GAME IS ON? WHY NOT LET ME GO TO CONFESSION AND PICK ME UP LATER? OR I CAN GET AN UBER. I THOUGH WHEN YOU TOLD ME I HAD NO CHOICE TO GO TO CHURCH, I WOULD HAVE TIME TO REFLECT, I DIDN'T KNOW IT WAS JUST FOR SHOW!\"\n\nIf you can talk to someone, explain the situation in as few words as you can. That you feel your relationship with religion is private, and you feel awkward being forced, and hoped you could get an authority to intervene and lead a discussion, without screaming and demands.", "I don't have any fily to stay with, they all have the same mindset and it would just be like me moving into the same situations just a different house. He cut me off from making my own friends in high-school so I literally have one friend and that's my boyfriend. I would have tried to stay with him but he's currently on a year long deployment. When I was younger I used to hide all my money in my room, under floor boards, any nook I could find but then my mom would do room sweeps and just take it all", "I said this in another comment but I just financially can't. He takes portions of my paychecks and he takes more than half of the free grant money my college gives me and put it in accounts I can't access (about $3000 checks each semester)", "I've been trying to move out since I was 18, I'm 20 rn. He takes parts of my paychecks and my college gives me checks for about $3000 and he takes half and then takes half of the half he gives me and puts into accounts I don't have access to. If I could move out I would but it's just not possible for me at the moment", "I'm 20  I've been trying to have a convo about it since high-school but they've all ended with him yelling at me about how I need the bible", "I know hiding out in the bathroom is childish. But everytime I try to have a conversation about me not wanting to go it ends with him yelling at me and saying how I need church and the Bible and lists off things he counts as \"mistakes or sins.\" For example a sin he's listed before was how I asked a question about the Bible and how free will is an illusion, or like when I was assaulted and abused by my ex and according to him I was at fault", "OP goes to their father's church.  That won't work.", "Okay, you know what? I would call a domestic abuse hotline because you clearly are being abused, even if it's not by a partner, and you need a plan to move out safely. They are experts at helping people who have been isolated figure out what to do.", "Does your boyfriend have a family outside of your father's community that he gets on well with? Could he ask them to help you out on his behalf?", "Okay. Also. Go to the bursar or whatever the correct office is at your college. Talk to them about this. It is possible you could do things the old-fashioned way and pick up a check at their office which you will then deposit in the new bank account you're going to make at a bank he doesn't know about.\n\nAlso talk to your school's housing office, see if they have any options for you.", " It's illegal for him to take your college money. You need to report him for the fraud he's committing, at a minimum!  Stop giving him access to your paychecks, and just cut him off. You're an adult now. Stop letting him take advantage of you.", "Set up your own bank account, with only your name on it, at a different bank than the one your father uses.\n\nThen get your pay set up to direct-deposit to that account.\n\nAlso, go to the financial aide department at your college, and tell them what your father is doing, and ask for ways that you can get your money to have it pay directly to the college for your tuition, or automatically deposited in a bank account in only your name.  \n\nYou might also want to get a PO box at your local post office, and have your official mail delivered there. Particularly things related to finances.   Because if your father is taking your college financial aide, I'm suspecting that your mail is delivered to his house, and he takes it and reads it without your permission, deposits the checks into a shared account then transfers money from the account you share with him to his private account whenever he wants. There might also be PO boxes you can rent on your college campus, which would be convenient for getting your mail discreetly.  \n\nAlso, where is your mother in this picture?  Do you have any trusted aunts or uncles who might help you, perhaps with a temporary place to stay once you have control of your pay, so you can save up for an apartment deposit?", "That's something the college can help with.  He is committing fraud.    Go to whoever manages student loans and tell them this: he is taking half your student loan for himself, and ask them how to stop that.", "NTA. I think in your case I would take out students loans and use them to rent a room somewhere. Your mental health is important. I know in this day and age folks just can't move out like they used to with cost of living being so high. If you had the 6000 a year your dad takes from you plus your full paycheck you might be able to share a rented room with someone. I don't believe normally into going into unnecessary debt but you need to get away from your dad. He isn't necessarily a bad person but he is used to controlling and browbeating and manipulating the masses. And you have a strong independent mind. He just wants the performance of you attending his church not that you are religious. Visit the financial aid office at your school and see what is available to you. Until then maybe say you want to spend Sunday in Bible study and contemplation at home. He shouldn't have a problem with that. Maybe get a second job where you can work on Sundays. Hang in there!", "Tell the college what he is doing.", "If you're in the US it's illegal for him to take your Pell grant money.", "Do you an ID and the ability to physically go to the bank? Go to the bank and talk to the ppl there ask if you can move the money to new accounts he isn't on. If no open a new account and at least work checks go there, but school should only need you for where the grant checks end up. Also he will be mad, try and find friend who will let you crash for a while.", "You do realize that you are legally an adult, right? Go to the bank and have his name taken off of all your accounts. If he’s the primary account holder, then withdraw as much as they will allow and put it in a bank account that is in your name only. Then confront your father and tell him that you will report him to the cops if he doesn’t return every last dime that he has taken from you. Do not turn your checks over to him. Get them direct deposited at work directly into a new bank account that only you have access to.", "You need to stop giving him access to your money. You’re an adult and you are NOT responsible for him or his bills.", "NTA, save up your money in a different account, and MAKE SURE that he is unable to access them. Also, move out ASAP. Do you have any relatives that might  take you in? If you do, move in with them. Leave that sucker behind.", "You're 20 and hiding in the bathroom.  That's not normal.  Why can't you move out so you don't have to deal with this bs?", "Your father is a monster.   You are not responsible for being abused.", "You have no choice - you have to figure out how to take control of your own money, and you have to use that money to get yourself out of that house. Even if it takes 6 roommates and a personal loan, *get out of there*. He will never relinquish control over you willingly, you are going to have to take it from him.", "Here’s the US hotline: https://www.thehotline.org/", "This is what I was thinking. At 20 it's like they are being held hostage.", "My boyfriends family lives an hour away from me, I also don't have contact with them and because my boyfriend is on deployment our contact is very limited. I also don't want to add further stress on him.", "No, OP needs to move their accounts out of that bank entirely.  Too many times, the parent has been able to persuade the existing bank to give them access to a child's (even a legal adult) account.", "I know that, but by the time I realized how much access he had it was pretty much too late. He has all my bank information, he's on all tge documents it's at a point where I can't even access my own accounts. Passwords have been changed and I just can't get in, I have no clue how much money is on my card and when I run out I have to go to him and ask him to move my money around so I can have spending money", "The other comment is right, you're an adult and need to just bite down and do it.\n\n...and I also know that sounds impossible to you at the moment. What your father has been doing has a name. It's financial abuse.\n\nA lot of people won't recognize it, because he's not (as far as you've said) running up bills in your name or destroying your credit, but his actions *do* still fall under the categories of \"Economic Exploitation\" (wherein you have no access to your money, or to the majority of it) and \"Coerced Debt\" (wherein he deliberately forces you to remain financially dependent on him).\n\nPeople who practice this type of abuse deliberately brainwash their victims into believing they cannot get out of the situation.\n\nThis isn't true. You can get out of it. But it is going to be very hard. And first you have to accept that you will have to do some things which *seem* like they will put you in a worse situation. But they will help in the long run.\n\nAnd you have to understand that you can't help your siblings if you can't help yourself. You can't pull them out of the water while you're drowning.\n\nYou need to do a lot, so I'll give you a bit of a checklist:\n\nGet any documentation you have. If you have to get it from your father, say someone in an office at your college asked for it or something but get all your documents you're able to get. This includes identity documents and banking paperwork, as well as any school records you can access. DON'T worry if you can't get them all. It will make things harder, but you CAN get out, even if you have none of them.\n\nTake those, and a few clothes/personal items, and contact a domestic violence or emergency shelter line. Get out of the house before taking any other steps.\n\nStay at the center you find on the call, or with friends while you contact your bursar's office. Tell them that your father has been taking your college funds. This is illegal. They will help you file a report with the school and one with the police department. In some cases, they may replace the funds you didn't receive, but at the least, no further funds will go to your father.\n\nPeople for the domestic violence line can help you get what evidence you need for the bank, to get your money out/get your father off of your accounts/etc. \n\nDon't be afraid to explain the situation. People are going to want to help you. \n\nOnce you've done this, speak with the counseling office at your college, and let them know what's happened and where you are staying. Ask for help finding on/off campus housing within your budget.\n\nDo NOT accept any calls or invitations from your parents. I'm not saying you have to go no contact as a permanent decision, but you will need to do so until you are stable. This is because he will try to gaslight you and make you believe you're doing something wrong.\n\nYou are not doing anything wrong. Your father is breaking the laws, and preventing an adult from getting an education and any form of financial security. Is this how a father acts? Read the story of the prodigal son. Even if you were making mistakes, wouldn't a good father let you make your own mistakes? Remind yourself of this when he tries to contact you, or when you start to doubt yourself.\n\nIf you need to, it's also okay to contact united way, who have a list of resources to help in your area. They might have a way to help with food and utilities and even rent while you are transitioning!", "You’re 20 years old, not 12. Go to the bank and figure it all out. Take responsibility for your finances and your future.", "You need to open a new bank account with a completely different bank, and have all your paychecks direct deposit to the new bank, and same with the money from college. \nAlso, go to your current bank with your ID, and get bank statements so you know what's in there. Find out if his name is on your accounts. If it's not, then have them reset passwords etc, so he can't access it anymore", "go to the bank and tell them all this. they can help you and maybe even reclaim your money.", "As long as your name is on the account and you have an ID, you can do your banking at the bank without need of passwords. Shoot, you could change the passwords yourself. But you're likely better off making new accounts and, possibly, depending on your safety, transferring money from the old accounts.\n\nTell them, also, that your father is likely to try to access your account against your wishes and see if there's any extra security precautions they can take in case he calls pretending to be you or whatever.", "Your father is financially exploiting you. Open up your own bank account, before you move out. Your dad sounds very controlling, in an unhealthy way.", "Get a lawyer and press charges.", "You are NTA. \n\nIt really sounds like you are in a cult like I grew up in. The men are in charge, they guilt you with Bible taken out of context, you can only go to Christian college so you are stuck making poverty level wages and can't escape the control.\n\nI highly recommend a book \"combatting cult mind control\" by Steve Hassan. I don't know if you have a way to get it without your dad or mom seeing it, (would a hard copy be better that you can hide or a download but if they check your phone they might find the download?) but it helps explain the mind control techniques that they used to brainwash us growing up. \n\nIf you have a community college nearby, I would talk with a financial counselor there to see what you could do for a major that could increase your income so you can get out of this situation. Even a faster technical course to start out with. You could check your local unemployment office. Sometimes they are connected with training programs that could get you started. \n\nDo you have any nonreligious family that could make space for you so you could move in with them? \n\nIt's really hard to see others in this situation. There were some Facebook groups that I was in for people who had left my religious group. Those were really helpful early on to see that many struggled with the same things I did.\n\nEdit. I saw more comments. Talk with your college. This might be a police matter what he is doing with your money. \n\nThis is a resource for those who have gone through spiritual abuse. \nhttps://vashtiinitiative.org/personal-stories", "NTA you deserve a life.", "NTA, but none of this is going to get better until you move out.\n\nYou don't go to church for your father: you go to church for yourself. If you're not getting anything out of it, there's no reason to go, but also there's never going to be a way to articulate this that your father would accept, so never mind that.\n\nHave you talked to your parents about getting a job so you can afford to move out? You'll have to disobey them if they tell you you're not allowed to get one, but it is just barely possible they might be up for it.\n\nEDIT: I saw some of your responses elsewhere and you should definitely not tell your parents about your job. You also need to open a new bank account AT A BANK YOUR PARENTS DO NOT KNOW ABOUT so you can start saving money.", "NTA. Forget about the church part for a moment. This is abuse. Look up financial abuse, that’s what this is. And parentification abuse by making you raise younger siblings. As an adult, he cannot take your money like this, both paychecks and grant money, unless you let him. Talk to someone at college, they may be able to help. Get a new account at a bank or credit union. Maybe the college has an on site credit union. You need to learn to drive. I can’t stress that enough. That’s another abuse tool to control you. Get a PO Box near college, so you can get mail without his surveillance. They’re cheap. Start squirreling cash into your account. Divert your pay into the new account. Ask around for roommates at school. At any rate, make a plan to get TF out of that house!", "Do you have a person who can help you? Sometimes having someone go to the bank with you and support you making those changes can be a huge help. A teacher maybe or trusted neighbor?", "You need to grow up and get out. Wtf with needing to ask permission???? You are 20. Get a flat. Stop taking calls from them. Grow a pair", "Nta", "Change your bank take out all of the money and put it in a different bank company. Then move into a different place.", "NTA. As a fellow PK (fundamentalist Baptist), I am sorry for how they treat you. I am 61 and still am dealing with the mental abuse I experienced. I agree with others that you are being abused. Find some help ASAP.", "I came here expecting to read a funny story about skipping church. OP, I  wish you the best and hope you get away from your family. [Domestic Violence Support Line](http://thehotline.org ) would be a good place to start and you can text them if you can't call.", "EDITED because I jumped in before reading the replies--sorry!  \n\nNTA.\n\nI say this as a devout Christian:\n\nYour father is the kind of shepherd who is no good for the sheep.\n\nYour father is the kind of parent who gives his children a stone when they ask for bread.\n\nYour father has a millstone in his future.\n\nYour father is a pastor, but he is also a criminal.  He has stolen money from your college and from you.  It is time for justice to be done.\n\nReport him.  I realize that this is frightening, but *you are old enough to lead soldiers into battle.*  You can *do this.*\n\nAnd take hold of your power as an adult.  You can go to your bank or credit union and inform them that you wish to establish an independent account and put your money into it--though I advise choosing a new-to-you financial institution instead so your father can't bamboozle a teller into letting him at your money on the grounds that surely it was supposed to be joint, look, he banks there too, blah blah blah.  You can have your paychecks directly deposited into your new account.  \n\nYou can endure the stomachaches, racing heart, sweating palms, and mental spiraling of going against his will.  It will probably make you feel sick at first, but it gets easier.   Anyway, who died and made  *him* God?", "i..wow.. i thought my parents were bad. I mean church isn't that bad, but i totally understand where ur coming from. nta", "You need to open a new banking account, only you can access. Then you need to have your paychecks go directly into that.", "I can't it would just make it worse, I've tried leaving before, I couldn't leave the house for a month and had everything taken, everything I could use to contact people and my job and anything that would allow me to have fun. I lost my job and spent months having to ask him for everything. I've just gotten it all back I work 2 jobs and I'm in college with scholarships and I can't lose it all again. Homeless shelters aren't an option for me in my city they're worse than things are here. My only main option and goal is to wait for my boyfriend to get back and we plan to move in together.", "There’s also emotional manipulation and play, using the well-being of OP’s younger siblings to get her to stay of her own volition.", "I had that mentality before, in the end it was worse than being kicked out. I wish he'd just kick me out but he would never do that. The last time I actually tried to be rebellious and do me I was punished, I couldn't leave the house for a month, at the time I had a full time job. No phone, no TV, no communication, nothing that I would enjoy like my hobbies. I ended up losing my job and was unemployed for months having to ask him for every penny. I can't lose my jobs, I can't lose my scholarships, I can't lose the things I've rebuilt.", "The only person I have is my boyfriend who is on a year long deployment, I was forced to go to cyber school in high school so I had to stay in the house 24/7 and wasn't able to branch out and make friends, even in middle cool I wasn't allowed to hang out with friends unless my dad knew all their parents and he was there to supervise, over time my friends got sick of my dad being there all the time and they just stopped wanting to hang out with me. Everyone in my neighborhood looks up to my dad, I like in a rougher neighborhood so even the drug dealers know him so if I were to ever even try to hypothetically buy anything from them they'd tell me no, that's how much everyone looks up to my family", "As you're at college, I would see what kind of advisors and health staff they can provide. They may be able to set you up with accommodation with other students. Not sure what services US colleges have, but you may be able to be signposted to mental health staff, financial advisors and maybe other help. I know my uni was able to do hardship loans/grants for people in tight spots. \n\nI'd say look at what the college has first, as anything they provide will generally be tailored to students, but if they don't offer a lot you may need to look elsewhere. If you have a tutor, it might be wise to give them a headsup if shit's going to go down, so they can help if you need extended deadlines.", "That's not legal.\nGo to a college counselor and tell them what's going on.\n\nYou have to be an advocate for yourself or what nothing will change.\n\nGood luck.", "Wait HOLD UP.  I didn't read this before I posted.\n\nHe is stealing from the college.  Report report report!!!!!!!!!", "You’re an adult, he can’t ground you. He held you prisoner and is holding consequences of rebellion as a deterrent to keep you in line. Please contact the abuse helpline.", "I know it must be scary, but you are the only person who can get yourself out of this situation. You are being abused. Please contact professionals in your area so that they can help you create an exit plan. It isn’t fair that your family is doing this to you, and it isn’t fair that you have to fix it when you aren’t the problem. But unfortunately, it won’t get better if nothing changes.", "In the Bible there are the ten commandments which tell you not to steal. I think your father needs the Bible.", "If you're in the UK, talk to your Student Union (not sure what the set up is elsewhere in the world). They'll be able to signpost or refer you directly to people who can help. If you have a tutor/professor who's responsible for your pastoral welfare, talk to them *as well.* The more people in the loop on this, the better. Build yourself a Team to help you move on and build a life for yourself, not your dad.", "Their father is financially abusing them. OP doesn’t have access to their own money. It can be really hard to escape situations like this. OP should definitely get out as soon as possible.", "This is specifically the time for him to help you. One minute call to you where you say \"I need to leave my family and community and need shelter somewhere else. Can I stay with your family? Please give them my phone number.\" And then he calls his family in one minute and gives your phone number and sends them to pick you up asap. That's what a boyfriend is for. If you cannot go to your partner at this time then you are failing yourself.", "It's hard and scary to set boundaries with an abusive or controlling parent.  At some point you have to decide that you are worth it.  You deserve safety and autonomy as much as your younger siblings that you want to protect.\n\nGet your accounts sorted out.  Get your independence. Your parents will either get better or worse in response, but you have to set boundaries unless you're okay with being treated this way eternally.  Hiding in the bathroom isn't setting a boundary or standing up for yourself as an adult.  It's a child's survival tactic.  It's what you do when you *can't* escape, but you can get away.  You have options.", "This needs to be top comment.\n\nYou addressed OPs road blocks in a way that actually takes into account their reality as they have explained it to us.\n\nOP it's not just financial abuse, your parents are abusing you in so many ways, and thus your siblings too.\n\nPerhaps there are domestic violence resources on campus?\n\nNot sure where you are but many schools have counseling services available for students. \n\nThese are the people who can help you start to unwind the trap your father has woven.\n\nThere is no religion or family relationship that makes what your parents are doing ok.\n\nThe only person who can save you is you.\n\nMany of the blocks you noted can slowly be worked around.\n\nI've found w banking and identity documents, if I go to them and ask something like \"My parents opened this account when I was young. What identification documents did they provide?\" You are now an adult those are your documents. Getting copies back can help you get to acquiring the originals.\n\nYour dad runs you ragged, takes your money by force and convinces you that you have no power or options. \n\nThe way you get back your power is one tiny step at a time.\n\nLook at school for counseling services. Make sure they know you are in jeopardy-bc you are.\n\nThe school also has identity documents. \n\nGet counseling services to help you reclaim them w/o informing your father or doing anything to catch his attention.\n\nYou aren't helpless. It takes time. Your parents are lying to you and keeping you trapped for their benefit.", "Honestly you guys need to stop acting like going against an abusive situation in an absuive home is easy. It is not", "NTA.  Wow.   This is all wrong on so many levels.   You are a hostage in your home.  The only way to change this situation is to figure out a way to leave.  But you are gonna have to keep your plans secret until you have all your ducks in a row and then just leave with no warning.   Similar to a woman leaving an Abusive spouse (which I have done).  First you need a job.  Then you need a place to live.  Then you leave with no warning.  It’s not easy and took me months to plan but it was totally worth it.", "Consider contacting a crisis shelter- this is financial, emotional and mental abuse. Sorry OP, NTA", "NTA \nYou are a woman right? The eldest daughter? the parentification and the whole controling behaviour makes me think that.\n\nDon't take his abuse. \n\nFake obedience while working on the low on ways to get out. \n\nWhat errand can you run that is close to the bank? \nSteal a few minutes here and there.\n\nIs there a library you can visit? Possibly search for options/resources that could help you?\n\nYou said you try to buy your own groceries. How do you earn the money? And please stop buying groceries and instead save it.\n\nYou are not ungrateful for trying to be independent, that is the national way of living. A parent 's job is to nurture their offsprings and help them become dependable and independent adults. A christian parent should act like the father of the prodigal son or like Mariam , the mother of Jesus. Abuse is not compatible with a christian heart.\n\nLastly, you didn't ask, but get educated on the vagus nerve and start excercises to stimulate it, so that you start supporting your nervous system.", "You need to get out, what the actual fuck is this shit.", "NTA. Please get out of there. Apply for a job (remote or with housing provided), get direct deposit. Gather your docs (ssn, birth certificate, etc) and get out of that house.", "You are a f*cking 🐱", "Church blows, NTA.  I was forced to go for the first 25 years of my life, do what you gotta do to get out of it.", "Since you let him to do what he want, he will do it. Stand up for yourself, if xou dont do anything things wouldbe be better like in tv shows. And since you are a legally adult, why ypu still behave like a 12yrs old child. They cant take your money, they cant do anything to you what is aganist your will.", "NTA, look up domestic abuse centers in your area. Call them and explain that you are being held against your will (you are) and that you are undergoing religious, financial, and physical abuse (you are.) Take their advice, get away and never tell your parents where you are.", "This is beyond AITA. They are holding an adult HOSTAGE. you need to call the police", "NTA obviously... your dad is holding you hostage. I'm not sure what to say. It's unfortunately tough to do anything about it. Your legal options against your family are limited by the fact that you can't afford moving out much less a lawyer. Even if you aren't letting yourself be emotionally blackmailed anymore he still got financial power over you. People at your stage in life are usually dependent on the support of their family to start their own life but since your parents are actively working to prevent you from emancipating yourself it's very difficult. I think your parents aren't prepared for any outcome other than you submitting to their ideology and they will either force you to stay or abandon you. \n\nSo what you can do is talk to an expert for advice. There must be a group that supports victims of domestic abuse in your area. You got to figure out a plan to get out of that house permanently and if possible get your siblings out too. Maybe a local support group can help you with that.", "NTA. \n\nBut your an adult. Stop saying you can't. Because you can. \n\nYour refusing to leave because your scared of what will happen, how your parents will react, how will you live and get by, and make it. \n\nYou go to a homeless shelter. You ask for help. You talk to friends. You talk school counselors or social workers for help. \n\nYou do what needs to be done to get out of there. \n\nYou can't keep staying there and expecting your life to get better. \n\nIf you want your life to change and have the freedoms you were denied then your going to have to leave, move on and make things better. \n\nYour siblings are fine, they will be fine. You on the other hand need to leave. \n\nPack up what you can, and need and then leave. See if you can stay at a friend's house or go to the homelssshelter. \n\nAnything is better than where you are currently. \n\nNothing is going to get better if YOU dont force a change.", "You need to find a way to move out as soon as possible.   Even if you have to apply for rental assistance and get food at the local food bank, that’s preferable to living in a house with people you fear.", "You are an adult. Act like it.", "Ok... As I'm a IDGAF person, that's what I would do : going to church and HURLING during his sermon or whatever what's going on, That I want to be FEE, that he's NOT a good guy, that you don't have access to your own money, etc...\n\nYes. I'd do that.\n\nWould his reaction be nuclear ? Yes. But... SET YOU FREE !", "NTA you say you can’t leave without them knowing. \n\nBut you can get on here without them know so you have access to the internet and presumably a phone? \n\nContact the police and tell them you are being held against your will by people withholding your vital/personal papers. They will come and help you retrieve said papers and make sure you are safe to leave and probably drop you of at a crisis center.", "I am worried about what she's NOT telling us.  Why does her mom terrify her?  What else is her father doing to her?", "OP at the very least see if your school has counseling/legal advice resources. Even if you don’t feel ready to take immediate action they can help you explore your long term prospects and tell you what small steps you can take. Very literally all you need is someone on the outside to know what’s going on and to be by your side when you’re ready to make the first move.", "You are getting good advice, you need to listen. \n\nThings in shelters may be worse, but your father is committing fraud and stealing from you, along with I'm assuming abuse. If you are working, you can stay in a shelter and find a share house or very small apartment. It doesn't have to be a permanent solution, but it's better than being abused. And please, for the love of all things, get your own bank account. \n\nPack your stuff, grab all your important documents, any evidence of him stealing money, and run in the middle of the night (they'll be asleep and it will be the easiest time to leave).", "If you are in college go to student affairs and tell them what is happening. Ask for help getting out.  Tell them about the finamcial abuse and how dad and mom are taking your money. If they can get you to a domestic violence shelter go.  Domestic Violence/ Abuse Shelters can help you with legal assistance. Once you ate out  ypu can report the conditions of your home to child protection services. If you are ever going to be in a place to help your siblings you have to get free first.  Your first step has to be to get out. Good luck.OP.", "Run. Find someone you can confide in in the church and run. Literally a single mom, a decon, ANYONE. You are being controlled, manipulated, and ABUSED. NTA. Oh how I want to take you in and help you.", "Personally, I got out of church as a child by threatening to play with myself in the pew. Probably wouldn't make the same threat as an adult who can feel shame lol.\n\nMaybe point out to your dad that he is only serving to damage your relationship with religious institutions in general by attempting to so strongly force it.", "NTA, please seek help", "The office of the Dean of Students is another good place to ask for help. There's often something called a \"student advocate\" or something similar who can help you navigate the university system to get the help you need.", "There’s no good reason to go to church if you don’t want to", "Your allowing this to happen the longer you keep silent. You need to talk to a counselor at school. You need to see if a counselor can help report your dad for fraud to the police. \n\nYou need to stop being quiet. You need to get loud, and get some freaking help. \n\nStop saying you can't. \n\nYou can and you need to. \n\nYour father is illegialy stealing from you. Report him for fraud. \n\nDont let your family manipulate and guilt trip you. They are stealing from you, you need to get help and get your money back. \n\nIts time for you to ask for help and get out, and get ALL of YOUR money back. \n\nReport your dad for fraud.", "Report him for theft and fraud of your college money and see if your employer can do direct deposit into a new bank account you open that your father does not know about.", "Open up another account. Don’t tell him. Have your checks deposited in there. \n\nOP you need to get out. It’s not going to get any better. You’re dad can’t hold you hostage forever. Find out if there’s a DV shelter. Get the police involved if you have to. Pack a few things and go to the police station and tell them what’s going on. Also press charges against him because stealing money is illegal.\nNTA", "OP, this is incredibly concerning. I echo what most people are saying on here. You ARE being abused, and I'm really sorry you're going through this. The situation you're in is not okay, and you can get out of it, but you have to advocate for yourself. Please please tell someone outside of your family/church. See if they have counseling services at your school. You can call a domestic violence hotline or a women's center. I know it's hard, but it won't get any better unless you take steps to help yourself discreetly. Another thought, since your dad is so religious, do you really think he'll let you move in with your bf before getting married?", "If I were you, I would rather live in a shelter than continue to allow your father to get away from stealing from you. Hes stolen thousands of dollars from you. \n\nHe's abusing you. You need to talk to someone and get help. \n\nStop saying you can't. \n\nYES YOU CAN.", "Just so you know:  he isn't stealing half your money.  He is stealing three-quarters of your money.  That half of the half is never coming back to you.\n\nHe's lying.", "How could he prevent you from leaving the house? Did he literally lock you in? \n\nPlease don’t rely on your boyfriend to be a way out. A lot of people that young don’t return and want to continue their relationship or they get involved with someone else. \n\nWhen you talk to a domestic abuse hotline they will walk you through making a plan to leave safely and permanently. You don’t have to do that till you’re ready. But you should know how to leave permanently because the time may come when you have no choice. Women in your situation often find themselves in forced marriages or types of human trafficking situations - not sex work but being forced to work with no choice or access to money or friends. \n\nPlease try to talk to someone at your school in a counseling role. NTA", "Stay in school and don't come back.  If you're desperate enough, join the military...\n\nThe point you have options. Colleges have counselors, make an appointment. See one. Make a plan. You can do this!", "Stop acting like he grounded you. \n\nYOUR A FREAKING ADULT. \n\nHE HELD YOU PRISONER. \n\nHE ILLEGAILLY HELS YOU AGAINST YOUR WILL. \n\nYou need to run to the police and ask for help. This is way beyond waiting for bf to get back into town. \n\nYou need to run now.", "You're 20. Even just walking out of the house to go for a walk Sunday morning would be a better solution. Locking yourself in the bathroom didn't avoid the yelling - leaving the situation completely would.", "That's fine. But pouting in the bathroom about it is still childish.", "Please reread OP's posts.  OP's father isn't allowing them the money to take the bus unless he knows exactly where they're going, and he punishes them if they come back without exactly the right change.   It's not as easy as \"he can't ground you\".\n\nContacting a helpline is absolutely right.", "Nothing you are saying is applicable to the situation the OP in in.", "This comment needs to be higher", "OP is an abuse victim, and confined to the house.  It's not as easy as \"taking responsibility\" when OP isn't allowed to leave the house without permission.", "NTA\n\nYou are being abused. You are essentially a prisoner in your own home because your money is being stolen and your freedom is being curtailed. You are a legal adult and just before your next payment for anything you need to open a new bank account, direct all the money in there, and escape.\n\nJust because you’re not being physically abused doesn’t mean that you aren’t being actually abused. You need to escape - Since you are posting here on Reddit I assume you have access to the Internet. Start looking up support systems and help lines for people escaping cults – even if it looks like mainstream religion because it says christian on the outside  this behaviour is exactly the same as any cult you might read about in the newspaper.", "NTA. But you do need to leave somehow. Do you have a job? Sounds like your parents are holding you hostage by not allowing you to do stuff. You’re not responsible  for your siblings.", "NTA, of course. \n\nOP, commenters have given you a lot of advice about how to improve your situation — advice you haven’t asked for and don’t seem to be ready to act on. I hope you will at least go to your school’s counseling center and talk to someone, and also check out the domestic violence hotline. That might help you get to the point where you’re ready to take some action.  You can also revisit this thread from time to time and think about whether you’re ready to try anything suggested here. \n\nIn the world of domestic violence counseling there is something called “safety planning.”  A good domestic violence counselor will meet you where you are (figuratively) and won’t push you to move before you’re ready — but they can help you get safer whether or not you decide to leave. I also encourage you to think about a plan that doesn’t depend on your boyfriend helping you. I hope he comes home safe and well and your future relationship is everything you dream it will be, but there are no guarantees in life.", "NTA, you are being abused! You mentioned not knowing how to escape. I suggest storing away any bit of cash you can in the meantime. Put it in something he would never use — stuff like an empty detergent box. And be sure to find your legal documents and hide those too. Call a shelter and ask if they have a social worker who can help, or if someone can pick you up. There are many apps meant to help victims of abuse too. \n\nPlease update when you have something to share, I hope you make it out!", "If you are in the United States, walk to a nearby library. Libraries are designated safe spaces. Tell them you are in an abusive household, and ask for information on how to get out. The front desk will know what to do. \n\nSource: Outreach volunteer with my local library for 10 years.", "You are not the asshole and, frankly, are being abused. \n\nBut you seem to have no options. For the time being, I'd suggest you just make your life easier and go to church. Yes it will suck. \n\nHave you tried meditation? It is amazing and you can practice while at church so you are not\n\nAnd get out of your parent's house as soon as you can.", "NTA - this is abuse and this church sounds like a cult. I have religious trauma and wouldnt want to go to church either because of the flash backs and all. Are you able to get out?", "NTA. Your dad is an abusive controlling dick. You are in a rough spot here OP and need out ASAP.\n\nI know it seems like you are trapped, but the trick is going to be working around the blocks. It will be hard and take time to get it all set up. \n\nFirst we need to get you a new email. Incognito mode will be your best friend here. Even better if you use a device he doesn't have access to. Maybe the local library computer or even a coworkers phone.\n\nSecond. We need a way to hide any new mail you get. A PO box would be best.  Since you work, your coworkers or even a manager may be able to help you. (I would say speak to your fellow students, but your dad strikes me as the kind of asshole to have you do online schooling to keep you isolated) You have to do some recon to see who doesn't think the sun shines out your families ass. I would recommend finding an atheist. They will be your best bet. Once you do give them a lowdown. Tell them you need help getting out. See if they would be willing to get a PO box you can use as new spot for your mail. Assure them you will pay them back once you are out. Also ask if you can store things at their home to keep safe. The idea here is to use their home address to sidestep your family. Maybe even let you stay for a couple days on your big escape if you need too.\n\nOnce you have the PO box now you can get a new bank account set up. Chime is online and only needs an email, social security number, ID and residential address. You don't have to have the mail sent there. You can use the PO as the shipping address for all your mail. The idea is to create an account your father doesn't know about. Once it's set up you can now start the escape. Request a replacement copy of social security card. You can do this online. I believe you can do the same with your birth certificate. Store those with the trusted coworker or even at work if you can. Have it all sent to the PO box. (If your work offers you a locker for your personal stuff that is).\n\nIf you can't stay with a coworker, get a list of womens shelters if you can. I know you said the homeless shelters are bad, but keep them in mind. If nothing else you can use them a last resort. You may need a fallback spot if it's gets bad. You could also check to see if anyone is looking for a roommate. Your might have to explain your situation,but it could help temporarly until you get the leech cut off. \n\nNow the hardest part is going to be cutting him from your money. You may have to do it in all one or two days if possible. Tell your supervisor you need to change your direct deposit info immediately due to theft. I would do this at the beginning of a pay period. It will give you time set up your final escape before he notices . Go to your financial aid office. Either borrow money from a coworker for the bus or see if one of them can give you a ride. You make have to call in sick to work to free up the time. Let them know about the theft of your grant money by your father. Tell them that you need to have the checks mailed to the new PO box or set up for direct deposit. See what options they might have to recoup the money he has already stolen.\n\nOnce this is all set up and you get your money at your new account, just leave. Factory reset your phone (if you have one) to disable any trackers. Take your laptop (again if you have one).  I would say go to the banks you're using now, but I'm guessing the accounts are are in his name and you're just an authorized user. You may have to take that money already in there as a loss. \n\nThis is going to take time. Maybe even months or even a year. At lot of it is going to be keeping your head down and pretending to go along with the program. Let him think he has broken you. But inside your mind that's what he can't control. \n\nYou could even do some of this and wait till your boyfriend gets back so that you can cut daddy dearest all out at once. But honestly I wouldn't wait that long. Too easy for things to go bad. Your BF may have his deployment extended, you may lose your jobs due to your fathers sabotage, or since he strikes me as this type have you get married to someone in the church before your BF gets back so you can't get away. \n\nThis isn't a perfect escape plan and honestly I can only guess based on what you've told us here. But I hope at the least it can give some ideas and inspiration on where to start.  Best of luck OP.", "Call the police this is abuse CPS as well", "NTA but you need to take action.\n\n1. Next time you are at college, go to the bursars office and tell them your father is taking your grant money and not letting you have access to it. Tell them he refuses to let you get your drivers license or have bus fare unless he approves the trip so you are trapped at home. Tell them you are terrified of your mother and need to escape the house. Ask them to help you about the money and refer you to a counselor for the domestic abuse.\n\n2. Time to reach out to your boyfriend and see if his family can come and take you away and give you a place until you get one your feet. You are of age and no one can stop you.\n\n3. In the meantime, act as compliant as you can re going to church etc. so the situation does not escalate further.\n\nGood luck!", "NTA- you father sounds like everything a good Christian isn’t.  You need to get help to get out of your abusive situation.", "*Abused. OP is being abused.", "OP is abused. Grow a heart.", "OP is being abused. There is no “growing a pair” and “getting a flat.” OP *can’t* at the moment.", "Your dad is financially abusing you. That money is yours not his.", "Report this ASAP", "The next time you get paid, go straight to a bank different from the one your father uses and open an account. Then always deposit your check into your account before you go home. Same thing with your college money.\n\nYou have to get out. And nothing is going to change unless you MAKE it change. I feel for you.", "ok stop him doing that, do it today.\n\nyou need to open an account that he has no access to.\n\nand if you have no transportation to go to a bank, and it's a 3 hour walk away, then you need to walk for 3 hours and go do it.", "Open an account online with a bank and get your checks deposited there. Your father shouldn't have access to that money", "File a police report what he is doing is stealing", "If you're in the US, there are multiple online banks that you can open accounts with without being in person.", "Call. The. Police. Please. Say you are being held against your will and abused, because you are. Tell your coworkers. Tell your professors. TELL EVERYONE. I understand that's hard and scary. But you have to. Unless your boyfriend is coming back in a matter of months. We're just all afraid your father will escalate or try to move or something. You're nowhere near the asshole, but you desperately need help. You're not alone, I promise you.", "This right here\nAnd with how to get out from what I heard from an other Redditer is leave when they are not home let the cops know you are an adult trying to leave a bad family situation because if your parents do try to report you as missing", "Open a new account. Put your money there and do not ever give him access.", "So maybe the money he’s already stolen from you is out of your reach, but from this minute onward, you can have control as long as you take it. The next time you are paid, go to a different bank and open an account in your name only. Then either get your employer to do direct deposit with your checks, or if you receive a physical check from them, just always stop at your new bank on the way home and deposit your money. \n\nYou’re going to have to take action to make things change. I’m sorry you have such an overbearing and financially abusive father, but…you are 20. It is high time for you to take control of your life.", "I’d like to add that they should get to the bank, open a new account, get a debit card for that account, and have you paychecks directly deposited in that account"]}