{"id": 9246, "submission_id": "10uuwx8", "title": "AITA for telling my daughter to learn some social skills and make friends her own age?", "selftext": "I have a 19 year old daughter, Samantha. Samantha doesn't have many friends. She rarely leaves the house except for school or work and never brings people over. She never stays late at school or tries to talk to anybody either. Part of it is because all she talks about is kids (she loves kids, works with kids, and is in school to work with kids), her dog, musicals, and baking. \n\nMy other kids are the exact opposite. I'd get into arguments with them because they were never at home but at least they had social lives, friends, and boyfriends. Sure they got into trouble but I'd rather that than Samantha never going out or talking to anybody. \n\nSamantha is in a math class with a professor that encourages the kids to work together and talk to each other. I thought this would be great for Samantha and I was stoked when she said that she and some other people started a study group. Then she told me about the group. There's her, another 19 year old girl, a 30 year old man, a 35 year old woman, and a 45 year old woman. The worst part is that she mostly only talks to the 35 and 45 year olds. \n\nWe just went to a graduation party for a girl that's exactly like Samantha. The girl didn't know anybody at the party except for her sister and looked miserable the entire time. She talked to two people at the party, a girl close to her age who works a similar job to her and has a pet so they talked about work (kids) and their pets, and a woman 15 years older than her who has a job very similar to what Samantha wants to do and all they talked about was school and that future job.\n\nWhen we were driving home, we were talking about how sad it is that the graduate didn't know anyone at her own party, how she doesn't have any social skills, and that she's going to have a hard time finding a job because she doesn't know how to talk to people. Samantha stayed quiet and I told her if she doesn't figure out how to talk to people and start talking to kids her own age she's going to end up exactly like the graduate. \n\nShe didn't say anything in the car but when we got home she packed a bag, got in the car, and went to my MIL's house. My MIL has always coddled her and told her there's nothing wrong with her when she's asked and has gone so far as to yell at me, kick me out of her house, and even threaten to take me to court for money that my husband and I borrowed but never paid back when I did say that there probably is something wrong with her if she doesn't know how to talk to people like a normal person. My MIL also blames me and my other kids for Samantha being the way she is. Samantha used to tell everyone everything when she was younger and we used to make fun of her for it. Samantha's friends also preferred to hang out with my older daughter when she brought her friends over but it's not my fault that her friends found my older daughter more interesting. \n\nAITA for telling her to learn social skills and talk to people?", "created_utc": 1675649889, "permalink": "/r/AmItheAsshole/comments/10uuwx8/aita_for_telling_my_daughter_to_learn_some_social/", "score": 315, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I told Samantha that if she doesn't learn to talk to people and make some friends, she'll end up like a girl that we were just speaking poorly of.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "What a miserable parent she has. Samantha sounds great and like she has a healthy number of interest. Glad she has her grandmother on her side. She surely needs some adult in her life to be a decent human being. YTA", ">Samantha used to tell everyone everything when she was younger and we used to make fun of her for it\n\nYou are very much an asshole.", "At the end you literally showed that it’s quite literally your fault for her being more quiet/reserved. What you say or do to your kids affects them greatly at a young age, making fun of her when she talked a lot as a kid is the reason she talks less now. Also she is able to communicate, some young people just find it easier to talk to adults because they’re usually more mature. Just because she isn’t going out a lot like her siblings doesn’t mean there’s anything wrong with her. I understand your worried for your kids social skills but she’s seen talking to people and working with them in that math group. \n\nYTA", "YTA. Why are you trying to micromanage your daughter's social life? It sounds like she's talking to people just fine. She gets to decide who she's friends with, not you.\n\nAnd it sounds like you've been TA her entire life. You belittled your own child for talking, and now you're mad that she isn't a social butterfly? WTF is wrong with you.\n\nDon't be surprised when she finally decides to cut you out of her life. You deserve it.", "so your parenting methods when she was a child made her fear being open and socializing, and you want to continue criticizing the small amount of socializing she's comfortable with as a result of your earlier parenting.... I think I summed that up right.\n\nIf you keep talking to her like that you're going to be the one to blame for her quiet social life, not her. and hey, she might prefer to not be the life of the party. i never was. \n\nand another thing: she'll never get a job is she can't talk to people her own age? in what world is her employer also going to be a 19 year old girl? she seems to do just fine talking to older adults about her work. seems to me you're just mad that she's not as social as you want her to be. get knotted. \n\nYTA.", "Yta.  You basically said she needs to stop being who she is our she'll be a failure.  Way to invalidate your kid.", "YTA, for years my parents did the same thing to me because I was not as social as my brother. They said the same thing you are saying and my brother is the one in dead end job stuck with his few friends in a small town, while I'm thriving in my career in the big city with friends who are like family.", "YTA. You are the shining example of mental abuse to a child. This girl is going to have years of therapy to go through because you have taught her she isn't good enough.", "YTA\n\nYou’re telling your daughter that she needs to stop being an introvert and become an extrovert because you like extroverts better.", "YTA. You're sitting here wondering why your daughter struggles to communicate with people while also saying you used to make fun of her for openly communicating. And not just you, apparently the whole family did since you said \"we.\" Not only that, apparently she can easily converse with people older than her, which already shows that she has social skills and can talk to people. Your daughter may not relate to people her age, and that's fine, but it seems like you're pushing her to be more like your other children when she is simply her own person. That has to have been so disheartening to hear her own father say she's going to endure hardship simply for being more introverted, and an introversion created by her own family for continually making her the butt of jokes growing up. I suggest being kind and trying to understand and communicate with her more, rather than pushing her away by pointing out things that \\*could\\* happen. Definitely apologize, and not just for this instance. I would strongly suggest apologizing for what you and your family have done in the past as well. A good, deep conversation.", "This just got steadily worse the more I read it. YTA.", "“Samantha used to tell everyone everything and we made fun of her for it”. OMG YTA. Your daughter is exactly who you taught her to be and now you want her to unlearn the lesson?!?! You are an AH. Something tells me her childhood was a nightmare. Get a clue. You’ll be lucky to have a relationship with her into adulthood. I personally hope she never looks back.", "YTA. You told your daughter that she’s a failure because she is who she is. But because she does t check your list of what a human should be you decided to shame her. Of course YTA. What else would you be? The hero??", "YTA. LET HER BE HERSELF. Geeze.", "YTA. I was just like your daughter and guess what? I have a great job and a great home and I'm happy. And I still don't talk to many people or socialize much at all. \n\nThere's more than one way to be happy and successful stop being so narrow minded.", "Pretty sure I’ve seen some version of this story so many times on here. \n\nYTA for that", "Not once to you say if Samantha is happy or not.  Maybe, just maybe, she likes her life the way it is.  Yes, YTA.  Accept her the way she is.", ">Samantha used to tell everyone everything when she was younger and we used to make fun of her for it\n\nSounds like we know what caused her to be introverted. Do you even hear yourself?", "YTA - as someone who has adhd/ is autistic research shows that we are shunned by our peers as they sense something off in minutes. \n\nEven if your kid has neither, it might be nothing she is doing and I have an excellent job and I get on just fine. I spend most of my time in my house and my best pal is like 15years older than me. Maybe she just has an old soul. You shouldn’t make her feel like she is inadequate because she isn’t living up to your expectations of what is normal and social. \n\nWhat even is ‘normal’?! *You* think your daughter is lacking but if she’s happy leave her alone. She should just be able to be herself and be supported by you, the way you talk about your daughter is kind of depressing.", "YTA. Your daughter struggles to make friends and you degrade her for the friends she has made. Shame isn’t a good parenting tool, from one parent to another.", "YTA. You have a daughter who is an introvert and an old soul. There’s nothing wrong w/ her except for your micromanaging. She’ll find her way in life.", "YTA\n\nsome people have trouble with social skills. she’s probably already aware of that. you are comparing her to someone who by your standards isn’t doing well, and in doing that you are belittling her, even if you think you’re helping or trying to give advice. also, she’s an adult. let her live.", "YTA X1000\n\nThe more I read sends me farther down my pit of despair for Samantha", "I feel bad for your daughter, for being criticized by her parent no matter what she does. I wouldn't be surprised if she felt unsupported and unloved. Of course she went somewhere she feels supported. I hope you're paying for her current or future therapist. \n\nYTA", "YTA.  Thank God she has someplace to go to get away from your toxicity.", "And the award for Shitty Mom Of The Year goes to.......you, OP. You're not even an AH. You're just awful.", "YTA, obviously. It sounds like you've been bullying your own child her entire life.", "YTA! \nYou openly said that your family used to \"make fun of her\", and now that you're getting the TA verdict, it's now \" We were teasing her.\"\nAlso: \nWhat's up with you and your husband not paying back the money you owe your mil?", "Wonder what the daughters's story is like, most likely very different.", "YTA! You and your family belittled and teased her for speaking. She’s 19! Being able to talk to people of different ages is a skill that will serve her in the real world. Who cares if her friends are older or younger? I have friends that are 20 years older than me or 10-15 years younger than me. Get over yourself. I hope your daughter goes low contact or no contact just to get away from your and family’s toxicity. Thank goodness she has her grandmother…oh…and pay your mil back!", "YTA - both for making fun of your daughter and pressuring her to live up to your short-sighted expectations. Your older daughter who stole her friends likely has a dramatic personality disorder and total lack of boundaries (she couldn’t stand not to be the center of attention and stole the younger daughters friends). You people suck.", "YTA. Yikes. You describe literally bullying your child. There are far better ways to try and encourage your kid to make friends. Making fun of them is a good way to make sure they cut off contact and frankly I think your daughter is better off having no contact if you constantly belittle her.", "YTA - I'm like Samantha even as an adult and you're right, I'm lonely and struggle to make friends. Know who was the cause of that? My mother. Know who also criticized me and asked why I can't just \"be normal like other girls\"? My mother. Did it ever occur to you she has social anxiety because you criticize and degrade people openly in front of her so she wonders if other people talk about her like that too?", "YTA", "You’re cruel. Poor Samantha. YTA.", "YTA, dont be surprised when she moves out and goes LC/NC with you lol. That will be youre reward for your \"parenting\" style.", "YTA - I think Samantha would be a lot more social if she wasn’t criticised for her likes.\n\nSeriously, the stuff you’ve said she talks about is the kinda stuff I hear and *enjoy listening to* at work, and I’m around the same age as your daughter. She sounds like she’s doing fine, stop projecting what you’ll find as sad onto her.", "Lmao what a wild info dump at the end.\n\nYTA, you bullied your daughter", "OMG, what did I just read?!?! YTA, I’m surprised that you have to even ask.", "Ouch Samantha sounds just like me…I used to be super outgoing until people started criticizing how or what I talked about. So I just stopped talking. \n\nYou admit yourself that you guys would make fun of her for being outgoing, how did you expect that to turn out? Her *own family* made fun of how she socialized, so she stopped. \n\nThis is all *your* fault. YTA.", "YTA\n\nWhat I just read was “My daughter doesn’t communicate the way I THINK she should communicate so I’m going to put her down for it”\n\nDon’t be surprised when she makes her way in the world and leaves you completely behind. If she can communicate with a 30 year old she can communicate to an employer why they should higher her. Everyone has their own social and work communication skills and frankly yours are lacking for publicly bad mouthing your own child. Jeez you’re a crappy parent!", "You remind me a lot of my own mother. She was a loud, dominating extrovert and I am the opposite. She was always pushing me to be everything I am not and making me feel bad about who I am. Sounds like you are exactly the same as to your daughter. Tbh, you hardly sound like you like her at all. Don’t be shocked when she ends up going low/no contact with you and realizes that she can make a found family that loves and excepts her. You’ll honestly deserve it.\n\nYTA.", "You were an awful parent to her, an awful person to your MIL and now you want her to fix herself to be more like you think she should be instead of accepting her for who she is? Yes, YTA.", "So, after you have pretty much destroyed your own child's self esteem, you come here for what? Sympathy?\nYou know, to be hurt by strangers is painful but to be destroyed by family is grievous. I have now forgiven my mother for doing a similar thing to me but ever so often that section of tape plays in my head. It is not a good feeling and I'm in my 60s.\nWhat you have done is truly cruel, IMHO, and you need some help dealing with issues about you that you may be ignoring. Please, get some and stop what you're doing to this young lady. \nWhy are you making negative determinations about your child? You sound like such fun...", "YTA.  When I was a teenager, I didn’t like other teenagers.  I couldn’t relate to them as it all felt very superficial.  I enjoyed spending time with adults and learning from them.  There’s absolutely nothing wrong with the path she is on.  She will figure HER life out her own way.  Stop making her feel bad for being who she is!  Not everyone is a social butterfly and you admit that when she was young, she WAS a chatty and social girl.  YOU took that away from her by making fun of her?!  This comments probably stuck.  She can’t do anything right in your eyes.  She’s social, she gets teased, she’s NOT social, she gets teased. Sounds like you just enjoy tormenting your own child.  It’s no wonder she left to go somewhere she felt supported.", "YTA- support your daughter and get off her back. You are a terrible mother.", "YTA. I was your daughter and now I’m happy and successful with a great career and home. Everyone doesn’t have to be a social butterfly. Also you are terrible for making fun of your daughter.", "YTA. How in earth did you type that whole thing out and not realize that you’re an ass?  Your daughter has hobbies, and is in school. She has interests. Has she said that she wants friends? Has she complained about being lonely? Because the only complaining I see her is you complaining that she’s not social enough for your arbitrary liking. It’s her life. If she is happy and content, then thank your stars that she is safe, content, and healthy. And for the record, what an earth is wrong with liking musicals? Does that make musical fans weird? Have you considered seeing if she would like to do some part of community theater? It doesn’t have to be on the stage, she can work backstage, and do sets or lighting or even hand out progress. Maybe she will make friends with people who share similar interests. Good grief.", "Have you ever thought for a second that maybe just maybe that she’s happy with her life? Maybe she loves having conversations with her elder peers, maybe she’s a introvert who likes her me-time, maybe she’s her own fucking person who’s not like your other kids. Jesus Christ get outta your head. What you said was rude and uncalled for. Yes as a parent you want your kids to be the life of the party and to have those experiences but you can’t force her, talk her into or make it seem like something is wrong with her just bc she isn’t doing “typical” teen things and a social butterfly. Sincerely, a naturally introverted teenager. YTA.", "🤣 YTA. I'm sorry, you're looking down at your daughter for not having \"social skills\" when your parenting skills are horrid? She learned her social skills from you, an adult who invalidated and made fun of her... Seemingly her whole life. She doesn't talk because you taught her that it's better to keep to herself. She doesn't bring friends around because of you. She talks to adults that give her validation and listen to her. I'm glad she has MIL to stay with, and I hope she stays there for her own sake.", "You’ve proven something I’ve always said: when someone has decided they don’t like you, there’s nothing you can do to ever change their mind. You didn’t like the way she was when she was young and talked too much. You don’t like the way she is now, reticent and selective in whom she opens up to. Why don’t you just be honest and admit you just don’t like her. At least the good news is she’s 19 so you won’t be seeing much of her for long. Huge YTA", "Yta. You're a bully and have no empathy.", "YTA. You created the problem by teasing Samantha and allowing your other kids to do the same. When what you should've done is defend her and punish her siblings accordingly for being such bullies. Now all you can do is complain about the problem that you created. So do the rest of the world a favor and shut your trap.", "YTA. Your daughter sounds like my daughter who is 19 and has Asperger’s and is an introvert. She doesn’t have friends but she is happy. She prefers not to be bullied and criticized by her parents though (I’ve had to work with her dad on this). I try to enjoy who she actually is rather than telling her all the ways she doesn’t “measure up” to some sort of arbitrary standard. My daughter is smart and is going to college and will figure out her career path even if she only talks about her favorite subjects and doesn’t have friends. \n\nYour daughter probably talked a lot about her interests when she was little (as people with Asperger’s do). As a younger child my daughter would tell me I didn’t even have to listen to her but she just really needed to talk about these things so I would let her chatter on and on because I loved her.\n\nETA: My daughter has developed more social skills, just later than others. She asks questions and notices things in books and comments on them. My daughter is actually very entertaining sometimes and people enjoy her humor and her insights. She has many talents and it would be so sad if I closed my eyes to her amazing qualities just because she didn’t do things that neurotypical people tend to do. She is our third child (out of four) and she is worthy of our respect and love, even if she chooses to opt out of many things.", "you know that quote “a daughters first bully is her mother” ? ya, that really applies here. yta. sounds like you’ve been the ah her entire life.", "YTA. You made fun of your kid for her social skills and now you’re upset because she’s not doing it anymore", "I’ll sum up your post. \nYou don’t understand your child and you don’t care to. You bullied her and she changed and now you bully her more. Awesome parenting, well done. \nYTA.", "Omg, YTA. Your entire post reeks of AH. There is nothing wrong with your daughter. You say there is just because she’s not the person you think she should be. But everything about your post tells us that she’s more than okay as long as she’s nothing like you. I wish I could say more about what I think of you, but the rules won’t allow it.", "Sometimes there is a post on AITA where the OP is so awful and so clearly TA that I can’t believe they’re for real. This is one of them. On the tiny sliver of a chance that you are for real - YTA. Not everyone is like you. To be successful you do not need to be “chatty”. Accept your daughter for who she is, and at the very least stop bullying her along with her siblings, even if you can’t love her. If what you say is true, you are a terrible mother. Get therapy and maybe Samantha will agree to see you after she leaves home.", "I realize this isn’t the biggest problem here, but it sounds like she’s great at speaking to and working with adults that are a good bit older than her. I would imagine that would be a huge bonus when she begins her career, not a detriment like you said. I doubt her boss will be a girl the same age as her", "what the hell\n\ntelling your child they will be a failure is a great way to motivate them.\n\nYTA", "Wow. “Samantha used to tell everyone everything when she was younger and we used to make fun of her for it”. Here we go. There’s the root cause of the problem. She USED to be social and outgoing apparently but y’all made fun of her. It’s not too hard to extrapolate from there that YOU GUYS are the reason she shut down. Now you’re shitting on her for being introverted. Your MIL is right to blame you guys, but especially you. You were the adult here, and you not only allowed them to make fun of your daughter, you were essentially the ringleader by making fun of her as well!! The information about your MIL is irrelevant, how on earth does your terrible relationship with your MIL relate to the situation at hand? She’s not taking your daughter’s side because she’s biased against you. Being an introvert is not going to prevent your daughter from getting a job. You sound like a terrible parent, and you’ve definitely made Samantha the scapegoat of the family. Of course YTA.", "YTA. You’re a bad mom. Period. Full stop. First you bullied her as a young child. And now you’re calling her a “failure” because she’s now too introverted to socialize with people her age. If she’s happy and productive that should make you happy. Quite frankly I’m shocked she’s able to be happy with a miserable human such as yourself as her family. I pray she’s soon able to cut contact with you.", "YTA, thank goodness for the MIL. \n\nYou're a bully to your own child. Shame on you.\n\nNot to mention a thief.  Pay your damn debts already.", "Yeah YTA. When I went to college I pretty much went to class and then home or to the library to study alone. I usually didn’t try to make friends with people I had class with or anything really. Why? Because I’m introverted. Going to class and interacting with people when needed was enough to drain my social battery and I looked forward to going home all the time for some alone time. Luckily my dad is similar and understands this. My mom is very extroverted but rather than criticize me for not being very social she just made sure I was happy (which I am). Also the chances are your daughter has fine social skills and will be fine", "YTA.  She is an adult and can be friends with whoever she chooses.", "YTA\n\n>Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\n\nThis would actively discourage her from speaking. You shamed your daughter from being social.\n\n>but it's not my fault that her friends found my older daughter more interesting.\n\nYour daughter is well rounded and able to have conversations with a variety of people. She deserve support and encouragement and you offer shame, bullying, and belittlement. This makes you a giant AH and I am so glad your MIL is there for your daughter. Her having an alternative personality and life to what you wanted doesn't mean she isn't socially inept. It just means you have more to learn about and love of your daughter.", "YTA", "YTA. I was like this for a while and I’m sure I would have stayed this way if my parents had said literally anything about it. But guess what? Instead of bullying me into changing, they supported me until I felt comfortable enough to branch out more. Your kid will learn her own way in the world and figure it out. You obviously don’t have enough trust in your kid and it’s making her insecure which is only reinforcing her inability to socialize. If you showed trust in your daughter she would eventually feel trusted and comfortable with herself. Undermining her will never force her to make positive change. ytaaaa.", "YTA. When she was young you made fun of her. Now, you try and tell her how she should communicate and who she should talk to. I urge you to stop for a second and think about your daughters happiness. Not job prospects or conformity, but happiness. You are harming her mental health.", "YTA, and you're also wrong. I was belittled as a child for my attempts at socialization, and I became much like your daughter. 1, I have never had trouble finding, getting, or keeping a job. 2, once I was out from under the thumb of people who bullied me and constantly compared me to others (and of course found me lacking) I had little trouble being social and making as many friends as I need. Stop trying to force your daughter into the box of personality you feel she needs, get off her case, and let her grow and develop on her own. If it doesn't hurt too bad, try even being supportive before she goes NC.\n\nETA: My mother threw me a party similar to what you described. It isn't about celebrating the graduate. It's about celebrating how great mommy (or daddy) did raising a graduate. Having no one there known by the person the party was supposed to honor is on the organizer, not the honoree.", "Wow. Sounds like you disapprove of everything your daughter does. Sorry to hear that you have a happy kid in college who knows what she likes and enjoys. Glad she had the sense to take herself off after that nice chat.", "Holy crap YTA!  Maybe she doesn’t bring people over because she has no emotional safety or support in her own home and every aspect of her life is being micromanaged including her job, interests, career aspirations, and fact that her older sister is openly supported in having no boundaries.  This is pure and simple bullying and emotional abuse.  Hopefully she finds an amazing therapist since it’s quite clear you don’t even like your own kid.  Hopefully she can stay with MIL and have a safe home to grow into herself and who SHE is and wants to be.  She’s not your doll!", "YTA!! You sound like an awful mother. Also the fact that your mad your MIL was going to die you for MONEY YOU OWE her it’s the funniest thing.. liken how dare she ask for the MONEY you took and never paid back.. I wish she would have. \nI’m glad your daughter has her grandma!! I hope she moves in with her and cuts you guys off her life..", "Your kid has found the two social groups least likely to judge her; kids and older adults with more worldly experience.   \n\"My kid's an introvert that avoids people. Also, she used to share her passions and we made fun of her for it.\"  Yeah. Way to go, there. You inflicted emotional abuse and bullied your kid. Your job is to protect her from that story of thing not inflict it.   \nYou are a bad parent and you should be embarrassed. Your MiL is right. Hopefully, your kid will move there.\nYTA.", "Oh. My. God. OP, YTA. Leave your kid alone. She is an adult who can make her own decisions and it’s up to her if she wants to start talking to people. And no wonder why she doesn’t do as such,because you mentioned in your post that when she told people everything you all made fun of her. Poor thing probably has the mindset that she cannot be open freely without thinking she’s gonna get poked fun of for it. \n\nFurthermore, she CAN get a job without talking to people. I would know because I got one and I really didn’t talk at all, communication was done via email or paperwork. Also, what if your daughter has selective mutism? Although it’s rare in adults. Your whole post gives off that she only talks to a few people and to them only. You need to leave her alone and let her do her own thing, period", "YTA, you bullied her for being extroverted and are now bullying her for being introverted. \n\nYour ADULT daughters social life isn’t your business.", "You are a pathetic excuse for a parent. Don't be surprised when she cuts all contact with you", "Wow. You borrowed money that you never paid back. You not only made fun of her when she was a child but let your other children make fun of her. And now you’ve made it clear to her just how much you dislike her because she isn’t your definition of normal. Your MIL isn’t coddling your daughter. She loves her for who she is. Leave her with your MIL so she can live in a home where she feels secure and loved. You may love her but you certainly don’t like her, and you and your lack of parenting skills have already done irreparable harm. And pay back the damn money you owe. Do at least one honorable thing in your life. YTA \n\nEDIT: How does one basically make a list of all the trashy things they have done and still wonder if the are an asshole?", "Your a terrible mother. YTA", "YTA and you're also her first bully.", "YTA. You're the reason she doesn't talk to other people much. The way I see it, she just doesn't want to waste energy talking to people who are not even genuinely interested and who ridicule her for having different interests from theirs. \n\n\"Part of it is because all she talks about is kids (she loves kids, works with kids, and is in school to work with kids), her dog, musicals, and baking.\"\n\n\" Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\"", "YTA. \n\nYou think it is sad that other girl hardly knew anyone at her own graduation party? Did it occur to you to wonder who put together the guest list for the party? Not the graduate, I bet. \n\nAnd when you make the guest list for Samantha's graduation party, you won't deem the 35 and 45 year old friends worthy of an invitation. Because you don't approve of Samantha or her friends. \n\nGoodnight. Just, goodnight.", "Are you seriously upset that your daughter hasn’t peaked at her age while your other kids have? YTA.", "yta wtf is ur problem? who cares if she doesn't socialize", "Yta, my heart is breaking for your sweet girl. At least her grandma is there for her.", "You remind me of my mom. I don’t speak to my mom.", "So she goes to college, has a job, and has no issue interacting with other people... they're just not the people you want her to interact with. She's 19 talking about her interests with people willing to listen to her. And by the way you described her interests I'm guessing you don't give her a supportive ear. Maybe what's really bothering you is that these other adults might be the supportive parenting type she's not getting.\n\nYTA", "YTA. you’re not a parent you’re a bully that raised other bullies. You had your kids make fun of another and then you dare to act like you did the right thing.  She seems to be able to talk to people. She just doesn’t want to talk to the people that mocked her. Sounds understandable. Also she’s an adult now and doesn’t want to talk to children like you. Grow up.", "YTA\n\nYou're a terrible parent, and the best thing your daughter could do is cut all contact with you. I hope she finds people of ANY AGE who are kind and considerate toward her. Better she have a bunch of older friends who like her for who she is than a parent who shits all over her for basically no reason. Seriously, your lack of self-awareness and kindness is really pathetic.", "YTA. This is YOUR fault. You bullied her into silence and now you bully her for her reaction to the bullying. If you thought there was an issue, you would have got her professional help. Clearly all you do is make fun of her for what you think iswrong with her", "YTA. You should consider that it’s possible for others to be happy in a way that is different than how you are happy. It sounds like you think having a limited social life and friends from an older age group would be a miserable way to live, and that’s fine. I don’t think I would be happy that way either. But it doesn’t mean Samantha can’t be happy that way. I know seeing another girl that reminds you of her at a party concerned you, but 1) that girl might have had a great time but is introverted and 2) Samantha can still be a happy, successful, and fulfilled adult without enjoying large parties. Besides, if you start acting like you are on her team and give her a safe place to be social without fear of failure (home with her family), she may be better equipped to reach out to others one day.", "YTA, jeez the way you talk about your daughter is awful, and then you casually bring up how you used to bully her? Your MIL is amazing, glad your daughter has at least one good relative, because the rest of you suck.", "Yta. Geez I was just like this. I couldn't relate to my age group because I was more mature and an introvert. Now I can relate to mature persons my age. Sounds like this poor girl has been through alot with you. You should be ashamed.", "YTA. Back off. She talks to adults. This is a good life skill. Quit micromanaging her and wrecking her confidence", "Do you have any idea how horribly you're coming across? It sounds like you shamed your daughter for being herself from a young age. You sound a lot like my ex-mom. I refer to her as an ex mom because she is no longer family to me. I'm glad your daughter has a safe place away from you!\n\nYTA!", "YTA\n\nShe seems fine.  She had no issue with getting rid of you. .\n\nIt seems like you are upset because she doesn't want to be like you.  She doesn't want to be who you feel she should be. \n\nShe is realizing she doesn't really need you. You aren't a plus in her life. \n\nOnce you are out of her life. She will really start to shine. \n\n\n\n\nExtra @$$hole points for being a deadbeat and thinking you are a superior person that can advise anyone.", "One in a way, I was like samantha, and instead of my mom saying what you said, SHE WAS SUPPORTIVE AND LET ME TALK ABOUT EVERYTHING AND ANYTHING I WAS INSTEADED IN!!!! You're not your basically telling her she's is/will be a failure because YOU'RE NOT LETTING HER TALK! Two, there is nothing wrong with talking to someone older about what she is going to face in the workforce she chose......YTA I hope you read and I mean, read every comment you can that offers advice. It's time to listen to Samantha and not blame/call her a failure. If anything, you're the failure for not encouraging her with her interests. Also \"I didn't belittle her for talking. We used to tease her because she didn't have a filter.\" Is just as bad if not worse that is why she can't talk to people cause if her family made fun of her than Strangers will as well.", "Oh my goodness what a terrible parent you are.\n\nMy middle child is an introvert.\n\nHe also is a kind, loving, intelligent human being.\n\nHe did not feel comfortable talking to people until he was in his mid 20’s.  It took moving to a small community and slowly over 5 years moving into jobs where he had to interact with the public.\n\nThere is absolutely nothing wrong with your daughter.  Sadly she has horrible parents.\n\nThankfully her grandmother loves her as she is.", "YTA. You literally by your admission bullied your previously outgoing daughter into being a hermit and now you don’t like the consequences of your own actions. She’s found people who are welcoming and who make her feel safe opening up and you’re throwing a hissy fit because they’re who you approve of. Too bad. \n\nShe is very lucky to have her grandmother who supports her. I hope for your daughter’s sake she leaves and never looks back. \n\nAlso, FWIW, being able to network effectively with older professionals at a young age is a huge advantage in the workplace. She’s going to have no problems getting a job and will likely climb the career ladder more rapidly than her peers.", "She doesn't have a socializing issue. If she can talk to other people whose ages range from her age group to older, she can communicate and socialize just fine.\n\n>Samantha used to tell everyone everything when she was younger and we used to make fun of her for it. \n\nWhy are you surprised that she doesn't talk to you?\n\n>it's not my fault that her friends found my older daughter more interesting.\n\nDo you even like your daughter? \n\nShe doesn't have a problem socializing. This is more a you're TA problem.", "YTA\n\nSo are most high schoolers. I understand why you daughter doesn't like socializing with them.", "You ATA for seeing that your child has issues and not doing anything earlier, not getting testing for possible Autism or other neuro spicy differences, not putting them in social skills classes way earlier or helping them.", "How much you wanna bet she is going to do LC", "YTA. This reminds me of the dynamic I had with my mom a bit, and I was so self conscious all the time I didn’t really grow into myself until I moved across the country. You are the problem here", "Let me guess, OP, you peaked in high school?\n\nYTA", "YTA. Samantha sounds like an old soul whose social skills are just fine with people who are interesting to her. Why should she be forced to socialize with people with whom she doesn’t share much in common other than her chronological age?", "She’s going to go NC with you and you’ll deserve it. YTA.", "YTA. As someone in my early 20s most of the people i enjoy interacting with are in their 30s-40s+. Its never been an issue.", "YTA. Making fun of your kid for talking about their interests is bullying behavior. Now you want her to be comfortable talking to people her age, when her parents and siblings made it clear that wasn't safe?", "There’s no way this is real. If it is, you’re the one who has no social skills at all or any knowledge of what the real world is.", "YTA. \n\nIf you think it takes the social skills you’re referring to get a job, you’re sorely mistaken. Introverts would all be homeless. Not only are you an AH but you have a grossly terrible take about how the hiring market works. Not every job requires the “social skills” you refer to.", "YTA, yes.\n\nYou haven't said anything to indicate that your daughter is unhappy, just that you don't appreciate her.\n\nPlus, it was rude and insensitive of you to criticize the party host in front of your daughter like that.", "Parents can be your worst bully. YTA", ">Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\n\nNow you're mad at her for not talking much. And you don't see the connection?  You prefer your kid who gets in trouble over your kid who doesn't, just because Samantha is an introvert, but one who can talk to a wide variety of people. YTA isn't strong enough here.  You have constantly told her you don't like who she is, because she's not talkative enough for you. Or she doesn't talk to the right people, according to you. Or she doesn't talk about topics you find interesting.   I don't see how you could write out that whole post, with all the shitty things you've said to your daughter, and then had to ask if you were the AH.\n\nYou know what? I'm an introvert, like your daughter. I have a great paying job. I have friends my own age, some who are older by 10 or more years, and some who are younger by 10 or more years.  That's called well-rounded, in my book. You should try it. Your daughter clearly has.  And my \"social skills\" certainly don't include treating my kid like shit just because her personality is different than mine.", "YTA. Leave your daughter alone and pay your MIL back her money.", "YTA. Like, seriously, you're horrible.", "YTA you made fun of her when she opened up and now wonder why she won't open up to strangers when family acted like that", "YTA don't back on here asking why your lid has chosen to go NC with you. I personally hope she makes that decision sooner rather than later. You are awful", "YTA.  You were cruel to her as a child so she learned it wasn't safe to br open around you and now you're continuing to bully her.  You sound vile", "YTA this is what happens when the “Mean Girls” grow up and have kids.", "I cannot express how big of an AH you are. I'm so sorry Samantha doesn't have parents that support her and criticizes her friends. What a judgemental piece of work you are.", "YTA. I don’t know what else to say. I feel sad for Samantha…at least your MIL is ferociously in her corner and I’m glad that Samantha has your MIL in her life.", "YTA. She is interacting with people who have similar interests as she does. She interacted with people at the party who share her interests. You’re basically a bully because her interests aren’t yours. You picked on her as a child. You pick on her as a teen. How can you even fathom that you are anything other than a complete AH.", "YTA. You really can't miss an oportunity to demean her, can you? You bullied your child into closing herself off and feel no remorse. Do you even love her?", "My daughter used to talk to anybody about anything and we made fun of her for it. Now she won't talk to anybody about anything, why is she like this?\n\nYTA.", "Here’s something you don’t read a lot on Reddit…. Thank God for your MIL! You’re not only an unkind and uncaring person …. You’re treatment of your daughter is abusive. She actually had CPTSD… it comes from childhood abuse. I’m a survivor of people like you. When she cuts you out of her life, rightfully so, and you wonder why? Reread this! \nYTA!!! How sad you don’t appreciate this kind, intelligent and wonderful person that you somehow helped raise. Well actually you repeatedly put her down. I hope she continues to thrive in spite of you.", "Oh boy, my favorite kinds of post. So your daughter  is well behaved and never breaks curfew or causes arguments with you, always has her work done on time, was responsible enough to organize a study group with other students, and you're bad because she doesn't waste time on useless socialization? If people don't enjoy the things she wants to talk about, why should she bother with them? She should find people who share her interests - which she obviously has! *You* just don't approve of them because of some weird backwards reason.\n\n>all they talked about was school and that future job\n\nAre you freaking kidding me? a 19 year old who already knows what she wants to do and is passionate about it is a blessing, and you're complaining?\n\n>Samantha used to tell everyone everything when she was younger and we used to make fun of her for it\n\nWas \"everything\" talking about her interests? Fun fact, kids can tell when their parents don't like them, and you obviously don't like yours. YTA.\n\nAlso, I have to ask, and maybe this is a name sharing thing - does your daughter *actually* like being called Samantha? Because I've known quite a few in my life and they almost always go by Sam (sometimes Sammy). And maybe yours *does* like being called Samantha, but you also seem like someone who wouldn't respect her preferred name.", "YTA\n\ndude. \"Oh, she's definitely autistic.\" \"We made fun of her\" \"we were trying to teach her to have a filter\"\n\nI just can't with you. You bullied your autistic daughter and she scampered to the one adult who doesn't literally bully her when she had finally had enough\nSHOCKING\nEven if she isn't on the spectrum you're still an asshole.", "YTA i am not going to type out what I think about making fun of the youngest child and bullying her in the house… Did you guys do this around her friends too? Because if you did that’s why they stopped being Sam friend. \n\nMy husband has maybe one friend his age oh wait hi that’s me. And the rest are older the great thing about that they have a lot of connections and helped him find a better job and a more stable one at that. \n\nAgain YTA", "Hey there Parent of the Year, you know what your comment history is telling me? You’re a bad parent.\n\nBelittling and bullying your daughter for not “having a filter” is not positive corrections. Your daughter, who looked to you for safety and support and guidance as a child, actually had their first bully in you. You wonder why she doesn’t speak up, well it started at home. With you. Your mother in law is right in the fact there is nothing wrong with your daughter, and everything is wrong with you.\n\nSome introspection would do you good. \n\nOh, and YTA.", "YTA for not supporting your introverted daughter and threatening her with a life of loneliness you cannot be sure she will have. Maybe she will come out of her shell, maybe she will find other friends like her as she ages. You’ll probably never hear about it because she will have stopped talking to you if you don’t apologize. \n\nAlso, you used to make fun of her as a kid? For talking too much, oversharing? I guess there’s no pleasing you, and this is probably why your daughter has shut down. \n\nGreat job stunting your kid’s social development, then lashing out at her for your bad behavior. \n\nAlso, pay your MIL back. God.", "Samantha is clearly autistic or similarly neurodivergent, which is not a bad thing. But you’re an AH of a parent for so many reasons.\n\nYou may be thinking, “you can’t possibly know my girl is autistic/ND! You don’t know her like *I* do” but you’re wrong.  Because I was exactly like her.\n\nI’m 35 now, autistic, I don’t talk a lot to other people I don’t know, I prefer to speak about my main interests and hobbies, and when I was little I got made fun of for talking about the things I loved to the point where I stopped talking to most people.  It was a shit existence to feel like you shouldn’t talk at all because you’re just a joke to others. Shame on you for ever teaching your daughter she can’t be herself!! Making fun of her may have just been “all in good fun teasing” to you, but you literally never examined how doing that made her shut down wanting to talk to about literally anything???\n\nShe’s perfectly fine the way she is! She can be successful in life in her way! I also know this because I am also successful in life despite what others might have thought when I was quiet and “weird” and “shy”. \n\nYou need a serious wake up call. Do some gd research about people who aren’t “normal” like “you” and apologize for ever being so disrespectful to your daughter for being herself.\n\nYTA in every conceivable way!", "Any chance she’s on the autism spectrum?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a 19 year old daughter, Samantha. Samantha doesn't have many friends. She rarely leaves the house except for school or work and never brings people over. She never stays late at school or tries to talk to anybody either. Part of it is because all she talks about is kids (she loves kids, works with kids, and is in school to work with kids), her dog, musicals, and baking. \n\nMy other kids are the exact opposite. I'd get into arguments with them because they were never at home but at least they had social lives, friends, and boyfriends. Sure they got into trouble but I'd rather that than Samantha never going out or talking to anybody. \n\nSamantha is in a math class with a professor that encourages the kids to work together and talk to each other. I thought this would be great for Samantha and I was stoked when she said that she and some other people started a study group. Then she told me about the group. There's her, another 19 year old girl, a 30 year old man, a 35 year old woman, and a 45 year old woman. The worst part is that she mostly only talks to the 35 and 45 year olds. \n\nWe just went to a graduation party for a girl that's exactly like Samantha. The girl didn't know anybody at the party except for her sister and looked miserable the entire time. She talked to two people at the party, a girl close to her age who works a similar job to her and has a pet so they talked about work (kids) and their pets, and a woman 15 years older than her who has a job very similar to what Samantha wants to do and all they talked about was school and that future job.\n\nWhen we were driving home, we were talking about how sad it is that the graduate didn't know anyone at her own party, how she doesn't have any social skills, and that she's going to have a hard time finding a job because she doesn't know how to talk to people. Samantha stayed quiet and I told her if she doesn't figure out how to talk to people and start talking to kids her own age she's going to end up exactly like the graduate. \n\nShe didn't say anything in the car but when we got home she packed a bag, got in the car, and went to my MIL's house. My MIL has always coddled her and told her there's nothing wrong with her when she's asked and has gone so far as to yell at me, kick me out of her house, and even threaten to take me to court for money that my husband and I borrowed but never paid back when I did say that there probably is something wrong with her if she doesn't know how to talk to people like a normal person. My MIL also blames me and my other kids for Samantha being the way she is. Samantha used to tell everyone everything when she was younger and we used to make fun of her for it. Samantha's friends also preferred to hang out with my older daughter when she brought her friends over but it's not my fault that her friends found my older daughter more interesting. \n\nAITA for telling her to learn social skills and talk to people?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Dear God, it feels like my parents could’ve written this. Just know you’re the asshole and it’s hard to gain those social skills especially when it is made clear to you every single day of your life that the things you’re comfortable talking about are cringe wrong boring, or uninteresting to everyone around you. I’m almost 30 and I still don’t have those skills YTA\n\nEdit - a word that iPhone text to speech got wrong and adding more context", "Obviously YTA.", "YTA", "Why did you post here if you refuse to accept judgment?", "Well isn't that kind of your fault?", "YTA, your daughter is clearly neurodivergent but that doesn't mean she's going to be a failure. It sounds like she has hobbies, goals for the future, and drive to achieve those things, and you're... unhappy that she didn't have sex and drink underage? Because it's not 'normal'? \n\nGood God, you need to take a good hard look at yourself and ask yourself if you want to have a relationship with your daughter as she grows up and becomes an adult? Because I can imagine her going no contact with you in her 20s", "YTA. I was 26 (33 now) when I started at my current job and have been working with the same people for 7 years. They are some of my closest friends. All of them are 50-60 years old. Who cares how old your friends are. I also have friends 10 years younger than me. Its not bothering anyone how old her friends are and its not your business. Age doesn’t matter with someone you connect with.", "YTA and a crap parent to her. You want her to be something she's not. She sounds like a beautiful woman who also happens to be an introvert. Introverted doesn't mean incapable of speaking or socializing. In fact, we're quite good at it, but only with people we choose to socialize with.\n\nAlso, thank you to whoever said that the reason the young lady at the party was sad wasn't that she had no friends but likely that she was begin forced to celebrate in a way that wasn't appealing to her. I hate big groups, and I suspect most of the people at that party were her parent's people.\n\nI wish your daughter all the luck in the world, especially with a parent like you.", "YTA. I hate parents like you. Treat her like an individual, not as a reflection as you or the other kids. You admit you and her siblings would make fun of her? How do you live with yourself? Perhaps she’s quiet because she is sick of getting shit on? Respect who she is, embrace her traits as her individual self. JFC, you’re a disgrace and I’m glad she has your MIL in her corner, because obviously her immediate family doesn’t. Shame on you and her siblings. Dickheads.", "YTA, and a dick to boot. Way to make your child feel like she CAN'T talk to anyone.", "YTA on so many levels. Please do your daughter a favor and stay away from her, forever.", "YTA. Clearly she can’t talk to you anymore and stays quiet for her own safety or sanity.  How much favoritism was shown to the other kids? I’d back off if you actually want to have her in your life in the future. Maybe even apologize for constantly criticizing her entire personality.", "Yta there's nothing wrong with her. I feel bad the girl who graduated was just the excuse her parents used to throw themselves a party.", "YTA\n\nYour child is an introvert. No amount of haranguing or threatening is going to change that. You're being unnecessarily cruel, and you are establishing in her mind that you think of her as \"broken\" or \"lesser\" because she doesn't have the social skills you apparently value more than her self-image or comfort.\n\nYou are not behaving like a parent that loves their child. And I know you'll read that and immediately think \"but I'm telling her this because I love her and want her to succeed!\" and I want you to understand this: your premise is flawed, because success does not at all hinge upon social skills, and the way you're making her feel isn't something a loving parent would do.", "Wow. YTA. Expect no contact after adulthood. Thankfully you have other perfect kids who conform, right? /s", "Omfg what kind of horrible parent are you??? There's nothing wrong with being an introvert. Do you know that quiet people can get jobs too?\n\nYTA", "YTA. Your example of the sad graduate is because of parents like you. It was the graduate’s parents’ fault for inviting a bunch of strangers to their child’s graduation party! Why not do whatever the graduate wants to do to celebrate?!? Oh because they also feel the need to force awkward social interactions on their child, kinda like you.", "Have you ever considered Samantha’s an introvert? Or possibly just shy? Or simply more mature and therefore doesn’t have much in common with people her own age? Or maybe people her age are mean therefore she’s more comfortable around older adults? Have you also ever considered maybe she’s this way because you mocked and bullied her for apparently talking too much as a kid so now she tries to stay silent and be out of the way as much as she could only to still be mocked and criticized even when she does that now? You most likely had a part to play in this and now you’re clueless as to why she’s the way she is.\n\nAlso, Samantha seems like a nice girl and someone I’d get along with considering I’m the same way. I also am rather quiet, introverted and feel more comfortable around actual adults than people my age but I’m not some freak nor am I not able to get a job over it.\n\nBtw, I’ve never seen a mom prefer for their child to go out and get into trouble like the rest of their kids do. Most parents actually wish they had a responsible, life-focused child like yours.\n\nYTA.", "YTA. Gee I wonder why she has zero confidence interacting with other people. I mean, if her own parents are so awful to her, how can she trust anyone else.", "I don’t know how well your social skills is, but the way you talk to your daughter is just terrible. \nYTA.", "YTA. Why do you think your daughter has no social skills?  Because you didn't teach her any, that's why!  And having lots of friends is nice, but it is not something everyone wants. As for you, you are mad at your MIL because you borrowed money and didn't pay her back and she threatened to take you to court?", "...... I can't", "YTA. First of all- does she truly seem to have depression or just unhappy with her lifestyle? If the answer is no, if she is fine and content- then OP frankly let her live her life.\n\nWhen I was a young girl, I was quite shy and my parents pushed me a lot out of that. Much to my dismay- then all of the sudden they chided me and berated me all the time for how little of a filter I had. \n\nOP you can't have it both ways and shit. We all have flaws as people but frankly, your daughter sounds like she goes against the grain. But she is perfectly happy with that! She might not relate to other people her age but she clearly doesn't have trouble socializing with others. There are plenty of people who have friends but the ages vary. It's really not that big of a deal. She might be shy or even awkward in your eyes- but maybe just be happy that your daughter- IS HER OWN PERSON. Leave her be.", "YTA", "YTA\n\nI can relate to this. My mom made me feel so self conscious and that there was something wrong with me.\n\nSurprise, surprise - I turned into a completely normal adult with great friends. Just because she isn’t a social butterfly, doesn’t mean she’s a failure to launch. I found my tribe later in life - a lot of people do.", "YTA. The way you are approaching Samantha not talking to other people and not having a lot of friends sound like it’s negative and like you’re criticizing her rather than try to be helpful. I am 28F and one of my closest friends is 50F. We have what we affectionately refer to as an honorary aunt/niece relationship. My parents know her and see how good an influence she is on me. Sometimes people gravitate towards people older than them because they are more mature or have similar interests. Not everyone socializes or forms friendships the same way. I have friends in other states that I talk to every day via text or twitter but I don’t seem them irl a lot because we live in different places. They are the best friends I have ever had. My mom also wishes I were more social and had more friends close by but she never makes me feel like crap about it and she doesn’t approach with a tone of negativity and like something is wrong with me. Tbh your daughter sounds like someone I would her a long very well with because I also love musicals and animals.", "you sound EXACTLY like my parent. guess who i do not talk to any longer??!? \n\nyour MIL is a saint and should take your judgmental a** to court", "So lemme get this straight. You and your family bullied and ridiculed your daughter when she was younger for being herself. As a result, she became withdrawn and self-conscious, so now you bully and ridicule her for that.\n\nAnd it sounds like you also stole money from your MIL(?)\n\nYT huge A.", "Not being able to socialize with teenagers is a problem she will quickly grow out of. It should take less than 2 years by my count.\n\nWhen I was a kid, I begged to sit at the adult table. I hated the lack of interesting conversations at the kids table. Other kids and some family members made fun of me for preferring the company of adults. Guess what? At 42, no one has a problem with me preferring the company of adults to teenagers. Your daughter will, hopefully, be an adult for many, many years.\n\nHopefully she will also stop talking to boring and dumb people who don’t have her best interests at heart.\n\nYTA.", "YTA big time. you are asking her to change who she is. you make her feel like who she is isn’t enough. god this is just so beyond me dude.", "YTA\n\nYou abused your daughter. You are still abusing your daughter.", "… dang, you’re a mean parent", "YTA. Tell me you hate your child without telling me you hate your child", "So you bullied her into being like this, then are continuing to bully her now that she has people she can talk to with the same professional interest? YTA and I pray she cuts you out of her life soon.", "YTA and you can’t be serious. This is way too on the nose YTA to possibly be real.", "INFO: What the fuck is wrong with you? \n\nShe was social as a child, and you made fun of her for it. Now she’s older and is still social, just not to the degree you’d like or with people you approve of, and you’re shaming her for it? And you’re surprised when she dips out to go stay with a supportive loving family member? You do realize she will likely go no contact with you and your toxic family once she moves out, right?", "YTA. You sound like a terrible mother frankly. Glad Samantha got away from you.", "YTA. Wow. Your daughter is an introvert and you’ve been berating her and making fun of her since she was a kid? No wonder she doesn’t want to live with you anymore. I think your MIL has a pretty good sense as to what’s going on.", "YTA plus pay your MIL back! Damn!\n\nIt is hard to know if the way you treated her when young caused her to retreat into herself, or if she might be on the spectrum. Or maybe, she is just socially awkward. Instead of berating and shaming her, have you ever considered having her tested? Or maybe just praising her for everything she is doing right?", "YTA  You shut her down as a child in the cruelest way possible, by mocking her, rather than actually explaining there's a time and place for certain topics because she \"didn't have a filter\". She IS talking to people, just not who or the way YOU want her to. If she is autistic then you failed her every single step of the way. even if she wasn't officially diagnosed you had your suspicions yet did nothing to provide accomodations for her. \n\nLeave your daughter alone, she won't just suddenly become who you \"think\" she should be. She's going to continue to be herself and she'll do it with or without you.", "She clearly needs help to learn those social skills.", "“…she loves kids, works with kids, and is in school to work with kids, her dog, musicals, and baking.\n\n“The worst part is that she mostly only talks to the 35 and 45 year olds.”\n\n“so they talked about work (kids) and their pets, and a woman 15 years older than her who has a job very similar to what Samantha wants to do and all they talked about was school and that future job.”\n\nSounds like your daughter is suffering from being a kind mature lady for her age with an old soul.  She’s going to be the type of young colleague that people my age would call “a breath of fresh air”. YTA.  I think she’s going to be fine.", "YTA and you should admit to your child that there's nothing wrong with them, the person who has giant issues and shouldn't be listened to is you.", "YTA, and a shitty parent. Samantha is an introvert, and you’re not. Get over it and grow the fuck up. She will go low or no contact with your cruel ass, and you will deserve it.", "YTA\nDo you even like your daughter? You just sound like you dont like her personality because she's different than you tbh.", "Wow YTA for this kid’s entire life. Just because you don’t understand her doesn’t mean she’s failing at life. Start accepting who she is or risk losing her", "YTA! You’re the parent! You should have been teaching her these skills the entire time! Or getting her a therapist who could help her out! Ffs", "YTA. I like Samantha. I’d rather be friends with her than you. She seems like a sweet and genuine person. You seem like a bully and a waste of time.", "This can't be real.", "ooh my time has come\n\ni'm just like samantha! i skipped some grades, and since elementary school i've had difficulty relating to kids my age and their interests. i didn't go to my HS graduation. i've never had a boyfriend or anyone that i considered friends since middle school. growing up i got bullied for this. from your post it seems samantha experienced similar bullying (except it was coming from you!)\n\nfor the longest time, i too thought that there was \"something wrong with me.\" it was like there was some kind of divide, an invisible wall, that isolated me from others. as much as i tried to \"get on their level\", discuss their favorite topics, and act relatable, it was like i was mimicking behaviors i'd observed rather than displaying them myself. it felt forced and uncomfortable, and others noticed and shunned me for it. when i would have sleepovers in elementary and middle school i would go talk to the parents while the other kids grouped up. often i felt more in tune with their conversations than those of the kids...but that couldn't be right! so i kept trying, desperately hoping that one day something would click and i would be just like everyone else.\n\nMy mom, unlike you, always accepted me for who i was, and was the only person in my life that did so. During those sleepovers she would welcome me into her conversations, and buy me books and games to stoke my special interests. she was the antithesis to the voice in my head telling me for years that i was fundamentally broken, but often it wasn't enough.\n\n\"She will be a failure if she doesn't change. She's not going to be able to get a job if she can't talk to people.\" Yep, that's your comment, and i had internalized every bit of it back then. it was an awful feeling- the one thing i wanted so desperately to fix about myself was the thing that was going to hold me back!\n\nthen i started college and everything changed...well, everything but me. i didn't suddenly relate to the other kids-but i started pursuing a career in research. in my coworkers i found people, albeit much older, that i could share my interest with and felt comfortable doing so! even though some of those communication barriers i've always felt remained, they accepted me in spite of that and made me feel valued. over the past few years i've met more and more who did the same, and that helped me undo some of the damage that those bullies had wrought. now that i was one of the adults i'd once related to, not being ostracized was a surprising but wonderful feeling.\n\ncontrary to being a failure, i'm graduating college at 18 and continuing my research as i apply to medical and graduate school. it turned out that i was never what was broken, it was the narrow lenses through which others constantly viewed me. sometimes i want to scream it to my past self from the rooftops- hey!! you were never the problem!!\n\nyta", ">Samantha used to tell everyone everything when she was younger and we used to make fun of her for it\n\nAh yes, if it isn’t the consequences of your own actions. YTA", "Wow sounds like your kid’s mom is a real piece of work.  YTA", "I was an only child of an only child, raised by my grandparents. I was around older people for most of my life. In first grade I would hang out with the sixth graders because I was reading past the sixth grade level. I didn’t have many friends in high school that were in my grade. I’m 58 years old and I think I turned out just fine.\n\nI’m so glad she has her grandmother who understands. From your comments it sounds like you really don’t care what anyone thinks unless they agree with you. Well, here’s yet another you can ignore. YTA.", "This is your actual daughter ?? You are horrific is this even real? Grow the eff up and maybe read up on this - there is a ton of info out there about it -and it’s not like you’re helping her by your actions. You’re a terrible parent for 1) her to change who she is 2) giving her zero support - your MIL is not “coddling her” she’s listening to her and making her feel heard / understood YTA", ">Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\n\nYTA, you probably did contribute to how she is", "YTA… nothing is wrong with your daughter. You should spend more time appreciating who she is as a person and less time trying to change her into a version you want her to be. She sounds like an amazing and unique human just the way she is.\n\nAlso for all you know it’s not that she’s lacking social skills but rather lacking self-confidence because you keep trying to change her.", "YTA, why do you hate your child so much?", "YTA. Maybe she’s in the spectrum and there’s nothing wrong with that. She loves what she loves & talks to people who shares those interests. She passionate about that why can’t you look past the negative?", "YTA i feel so bad for your child, you have torn her self esteem apart for years and continue to do so", "YTA. You are a massive ahole and a failure as a parent. Sounds like she’s introverted, not like she can’t talk to people. You even admitted you guys use to make fun of her. Her lack of social skills likely is your fault. Hop off your high horse and accept your daughter how she is. News flash, I am the same way your daughter is. I have 1 friend and I’m doing fine the way I am. But I don’t talk to my mother who made fun of me for talking a lot as a kid so I guess enjoy not speaking to Samantha when she finally gets sick of you telling her she is a failure because of who she is and trying to make her change.", "Someday she will find her people and will be just fine. Then she’ll probably never call you again cuz you’re toxic AF. YTA.", "Do people read over what they wrote before clicking submit? If OP had done this, it would have been blindingly obvious they are YTA. Good god you’re an awful parent.", "You the AH, what makes you think those of her age are interesting to her? Her interests are SO different from others and she's walking her own path. She knows what she likes while 7/10 of 19 year olds are running like a headless chicken. \n\nYou're so clueless not to see a beautiful young woman who is learning how to communicate, gain knowledge, ask advice from those who are in the field she wants to be in. Also those who are in that age range MAY BE INTERVIEWING HER. She is getting confidence and she is building it from ground up, no thanks to you AH.", "Wtf? YTA entirely, what's wrong with you ? First of all are you really telling us that you shamed your daughter for being herself when she was little? Not only that you  allowed your other children to do so as well.... \nEvery kid is different, different likes and dislikes etc. There is nothing wrong with your daughter being the way she is, most parents would want a daughter that dedicated to his work and studies. As a parent I could understand the part about worrying about her not socializing with people her age but there was no need to humiliate her for that. She does have social skills and does socialize with people, it just doesn't seem to be people you like because of some kind of ageism....YTa and you're going to be lucky if your daughter speaks to you ever again... Btw when you borrow something you have to return it...", "I'm neuro divergent and a lot like your daughter. I didn't have many friends growing up, I preferred talking to parents instead of kids my age. I was even homeschooled and an only child for the most part. I still ended up with a good career. \n\nSomething tells me you look for things to criticize your daughter for. If she's open, you don't like it. If she's quiet, you don't like it. Look at yourself and figure out why you feel gratification when bullying your daughter and why you allow others in the family to bully her as well. YTA", "Yta. You could have addressed your concern with kindness", "You telling her to change or she’s going to fail at life is 100% worse for her than staying the way she is, accepting herself, and figuring out what works for her. And it sounds like she knows what she wants to do and the kind of people she wants to be around. \n\nStop trying to change her, stop making her feel like there is something wrong with her, and accept her for who she is.\n\nYou’re 1000% the AH.", "YTA - because she has social skills and talks to people. You sound exhausting.", "YTA \n\nI’m sure you’ll put your social skills to good use when you’re rotting in a retirement home.", ">AITA for telling her to learn social skills\n\nYTA was that not up to you,  the parent?", "Samantha sounds amazing! Interesting, focused, well-rounded, social, and strong by pretty much anyone's standard but yours, despite being bullied by you and your other children! Hopefully, Samantha will be able to stay at her grandmother's home long-term and get a reprieve from the constant toxicity in her \"home.\" How exhausting it must be to be so miserable and judgmental.\n\n100% YTA", "YTA. \n\nwow i feel bad for your daughter. And the fact that you even have to ask if you’re the asshole just makes you seem more of a horrible parent.", "YTA. Good luck having a real relationship with her. I’m a lot like your daughter and I wouldn’t want to go back to a parent like you.", "You’re an abusive parent. Obviously YTA.", "YTA. Why are you treating her like she is 12? Some people go through life differently. When I was a freshman in high school, I didn't have many friends and didn't go out a lot. Well then I grew more mature and slowly expanded my friend circle. My mom said it was on me to figure out how to improve my social life. You need to be more hands off with her. Let her make friends with people she works with. You did the worst thing possible and now she will probably not want to talk to you much more.", "YTA for several reasons:\n  1. Borrowing money and not paying it back.\n2. Making fun of your daughter. “Samantha used to tell everyone everything when she was younger and we used to make fun of her for it”. Is it any wonder she doesn’t talk to you?? You made it so she doesn’t feel confident/comfortable talking to you/others. \n3. Clearly favoring your other kids because they are “more interesting/had more social lives/boyfriends”. Wow. You clearly have no appreciation for who your daughter is.", "Gr8 b8 m8", "Yta. Read this. Word for word. Out loud.", "YTA..\n\nYou are supposed to support and nurture, not ridicule and mock. Your daughter is going to cut you out of her life and it will only yourself that you have to blame. That was a crule thing to do on the ride home from the grad party...wow...have you no heart?", "YTA \n\n \n\nI hope your MIL wins.  You ridiculed your own child as a disciplinary method? How horrific! I trust your MIL to use the money she wins on Samantha's therapy.", "you: \"why daughter not go out and make friends!\"  \ndaughter: goes out and makes friends with people older than her  \nyou: \"no not like that!\"  \n\n\nYTA.", "YTA... your daughter deserves better", "Sounds like your daughter could be autistic which makes yta", "YTA", "This has got to be a troll post - karma-farming?    \n\n\n>Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\n\nWhat loving parent does this to her child?     \n\n\nOP holds up her other kids as paragons... and wants Samantha to be more like them.. she says \n\n>Samantha's friends also preferred to hang out with my older daughter when she brought her friends over but it's not my fault that her friends found my older daughter more interesting.\n\nShe didn't really care what her daughter was going through, she just admired her older daughter's ability to attract attention.     \n\n\nShe admits she never paid her MIL back...\n\n>and even threaten to take me to court for money that my husband and I borrowed but never paid back\n\n&#x200B;\n\nShe also doesn't realize \"normal\" is a spectrum.  She believes everything outside of what she dictates is normal is abnormal...   \n\n\n>when I did say that there probably is something wrong with her if she doesn't know how to talk to people like a normal person. \n\n  \nAnd yet - OP needs Reddit to tell her if she's the AH or not...   \n\n\nOP I think this one is going to be more unanimous than most - YTA.", "YTA. If you can't be bothered to *help her learn* \"social skills\", then stop badgering and insulting her about it.", "Tell your daughter to come back home and pack up the rest of her stuff and take it to MIL’s house. \n\nYTA", "I think you should start following the introvert subreddit. Don’t post or comment, just read. There are so many people on there whose biggest problem isn’t a lack of social skills but obnoxious parents who are constantly trying to change them.", "This is an excellent parenting lesson in something people call “consequences”. A consequence is when there is an effect (traditionally negative) that happens to you as a result of an action you took. For example, bullying your child at a young age for socializing resulted in a child that is scared of socializing! Funny how that works! \n\nYTA.", "YTA.\n\nYou are her mom, if you want her to improve herself, you should help her to do so. All you did was put her down and make her feel bad. Don't you think she'd like to have more friends if she could figure out how? Your job, as her mother, is to help her figure out some ways to make more friends. Such a useless mother you are.", "yta. sounds like someone who doesn’t understand anyone who acts differently from themselves.", "She might be going through shit", "What the fuck is this shit? \"AITA for belittling my daughter in her youth to the point where she becomes asocial, and continuing to belittle her for not having any friends, including to her face and on this post?\" \n\n>It's not my fault that her friends found my older daughter more interesting.\n\nAre you fucking joking?  YTA", "YTA. Re-read you own post out loud to someone, slowly.", ">Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\n\nAre you my mother? She complains even now at age 36 that I wasn't as social as I was as a kid yet refuses to acknowledge the facts that she\n\n* Made fun of everything I took an interest in.\n* Made fun of the fact I was willing to talk to people.\n* Told me REPEATEDLY to shut the hell up about the things I took an interest in.\n* Told me REPEATEDLY that people were not interested in the same things I was and I was boring those people so leave them alone.\n* Bitched about the fact as a teen I became withdrawn.\n* Complains now that I barely talk about anything to her anymore and is surprised when someone goes 'Oh did you know App did this and got X?' and then gets upset with me all over again because she was the last person to find out.\n\nYTA. YTA hands down. Please leave her alone. The favoritism of your older daughter reeks. Oh her friends hung out with her older sister because she's *so much more interesting.* Gee. Did you subtly push her friends to hang out with her older sister because **YOU CONSTANTLY MADE FUN OF HER SOCIALIZING IN FRONT OF THEM?** Christ almighty. You're iceskating with golf shoes OP.", "[removed]", "YTA. So you turned your daughter into an introvert by bullying her for being a normal exuberant child. And now you are bullying your daughter for being an introvert. YOU are the one that needs to learn some social skills, and stop turning your childrens relationship with you into a contest. She has no issue socializing with people, just not people you want her to socialize with. \n\nNews flash, not everyone looking for a job is looking for an expanded social network. Most people go to their jobs to make money to survive.\n\nAnd based on your 'her friends would rather hang out with her older sister when they come over'... I wonder why she has such issues talking to people her age. And at 19, she has a better chance of working with people in their 30s-40s than a room full of teenagers/lower 20yo.", "YTA. There is nothing wrong with being introverted and not getting along with people your own age *when you are a literal teenager*. How is it that you, a grown adult, don't understand that? Your daughter deserves an apology.", "I’m no doctor and obviously cannot make any judgment with legitimate analysis here but as someone that worked with children with autism. It sounds like she may be slightly on the spectrum, you criticizing her for the way she chooses to live is really shitty as a parent. Even if she’s not on the spectrum it’s still very shitty of you. If it’s so bad your MIL has literally threatened you because of how you treat her I’m assuming it’s because of very poor behavior of yours and the siblings. I understand wanting your child to succeed but this is not how you go about it. YTA", "YTA\nThat poor child.  You bullied her into shutting down when she was young, and now you're bullying her because she isn't some chatty, vacuous teen.\n\nI hope she moves in with her grandmother where she can be appreciated for herself and away from the abuse you're heaping on her.", "YTA\nYou belittled her when she did talk and now she’s more reserved and you belittle her for that? And by the sounds of it she’s happy to engage with adults who share her interests, just not to bring loads of people home. Which given how you treat her doesn’t surprise me - “hey friend, would you like to come to my house and watch my parents tear me down?” doesn’t sound fun.\nThe fact that your definition of ‘coddling’ is telling her that there’s nothing wrong with who she is says a lot - other people would call that ‘love and support’.\n\nYour daughter may face some barriers by being relatively introverted in a world that caters to extroverts, but I’m sure she’ll flourish away from your criticism. And hey, it could be worse - at least she isn’t the type of AH to borrow money off people and then refuse to pay it back.", "Fastest way to get out in a nursing home", "You need therapy\nYTA", "Fake", "YTA. \nNot everybody has to be “like you”. Not everybody has to fit a mold. People can be introverted and keep a small circle of friends. And even if she is ND, or autistic, that isn’t a PROBLEM? Autistic or ND people are not worse than, or flawed, or anything of the sort. Stop acting as if they are. \nYou literally admit to mocking her as a child. You are a horrible parent and person. \nHope you’re prepared for her to go NC in a few years and have a successful life that suits HER and HER NEEDS.", "congrats, OP, you (and your other children) bullied your daughter as a child and almost certainly left her with crippling social anxiety. no wonder she doesn't want to be around you\n\nYTA.", "YTA obviously. Your daughter sounds wonderful and you don't deserve her love. \n\nAlso YTA for not paying back a loan. I hope your MIL sues you.", "Have you ever considered your daughter may be autistic and have trouble recognizing social cues? I would maybe talk to a doctor to get her tested, women are often diagnosed much later in life. Therapy could help her. And honestly, could help you be able to help her. Grating on her like you do is only going to make things worse.", "YTA\n\nShe has social skills. She gets along just fine with people who treat her with respect. Why don’t you try that?", "What is wrong with you? She is your child, not you. Who she is and her personality-you don’t get to dictate. Jfc work on yourself before you try to give your daughter any advice.", "Omg- as a parent my heart broke reading this. The way you speak about and treat your daughter is cold and cruel. Thank goodness she has your MIL. YTA to infinity.", "God you are such an AH. Probably the biggest one I’ve seen all week. YTA through and through. Do you not like your daughter or something? My mom has five kids. Three of us are outgoing, plenty of friends etc but one of us is antisocial, and the other prefers to be by themselves. My parents never encourage us to be like one another nor do they compare us to each other. Get it together lady.", "YTA - in so many ways. You used to laugh at her for over sharing and now criticize her for keeping to herself, AH. You think she won’t get a job unless she speaks to people her own age….ummm I wasn’t aware that 17yr olds are hiring people nowadays, I think the fact that she can related to older people will actually help her in the workforce and life. You sound vindictive, judgemental, cruel and like just a truly awful parent. Leave your daughter alone, but I bet she will leave you behind and go NC and live a perfectly happy life being who she wants to be and finding her own family to accept her. Also, pay your MiL back the money you owe her", "I don’t think the op did this with absolute malice. I think maybe went about it the complete wrong way, but I’m gonna go against the grain and say maybe slight nta for wanting the best for the daughter. It’s hard to see your kid struggle and maybe they both need to learn how to interact in a constructive way?? Idk.", "YTA for your inability to help your child find the balance between oversharing and being reclusive and getting the rest of the family to pile on be and shit her down (how to tell a child that them and their contributions don't matter in one way lesson), for telling your child to socialise more and when she does tell her that's not doing it right (be friends with just the right people, not friends with people outside your age group) and being a general bully. You might as well just be super truthful and say that you don't like her, and you prefer your other be children who are borderline criminals/antisocial jerks of some description (always out and got into trouble but preferable to Sam being home all of the time). Your daughter should stay with your be MIL because she can continue to develop as a person with encouragement, and you are not good for her peace of mind.", "Holy shit! You better believe YTA. She sounds like a sweet introvert who can hold her own in conversations with people with whom she shares interests, Just because you don't like the topics doesn't mean Samantha and her friends shouldn't engage. YTA.", "Your last sentence dealt the final blow and killed me after being slowly murdered throughout the entire post. Yes… the best way to teach someone social skills is totally to tell them “learn some social skills and talk to people” /s. \n\nAnd don’t think we missed that quick sentence glossing over the money you STOLE from your MIL and are dismissing. \n\nIf anyone needs to learn social awareness it is YOU. You are acting grossly and immorally and I applaud your daughter - who certainly DOES show that she has the ability to socialize, just not to your perceived expectations - for getting up and walking out. She has a shiny spine and you… well, you exhibit a lot of narcissistic personality disorder tendencies with your concern of how her ‘failure’ reflects on you, and your lack of awareness of the impact of your actions. \n\nIt sounds like you do not have the emotional breadth yourself to be judging at all, my friend. \n\nHowever I humbly do. YTA", "YTA. You can’t accept your child for who she is. If her own parent can’t accept her, how is she going to accept herself. Through lots of therapy would be my guess. I hope you foot the bill for said therapy.", "This post could easily have been written about me. Although my parents loved me deeply I wasn’t exactly a social butterfly.  Now Im in my 60’s, quite successful and have a handful of friends that I can call no matter the reason or time. \nYou are taking all that away from her. \nYTA", "YTA. You could teach her how to socialize rather than just expecting her to understand. Also, it’s clear she just doesn’t like socializing with most people.", "This has to be a joke lol", "YTA. You made fun of your daughter every time she talked as a kid. She more than likely didn’t like that and so stopped talking. Now you make fun of her and bully her even more because she doesn’t talk about things you find interesting. It sounds like she has a lot of things to talk about, but they are just things you and your family don’t care to listen about. \n\nSincerely, a horse girl who got the same exact treatment because “all she talks about is horses” 🙄", "YTA. She sounds like a wonderful girl, you simply don't like who she is.", "YTA. As an autistic woman, I’d like to give you the worlds biggest middle finger (to put it nicely) on behalf of all of us introverts. We think people like YOU are the sad ones. You should be completely ashamed of yourself.  \n\nETA your daughter deserves *SO* much better than this. I am genuinely hurt for her. What a fucked up way to “love” your child.", "YTA. There is NOTHING wrong with being an introvert. You're just mad not everyone thinks the same way you do.", "YTA, don't be surprised if your daughter goes LC or NC with you when she can. You sound like a terrible, unsupportive mother, leave her the fuck alone", "YTA. You’re an ignorant AH. Your daughter is an introvert surrounded by intolerant, unloving extroverts. From your post you think she is weird because she has interests that are strange (unvalued) to you. I pray she gets away from you and your judgmental family and finds her own life. FYI, from her interests, she sounds very intelligent. And she feels more comfortable around people older than she is because they have brains and allow her to be herself (unlike you, your family and her age-group peers).", "Yta.... if your daughter is happy with her life and achieving her goals for what SHE wants to do. Why are you so bitter about HER life. Leave your daughter alone. In fact, you and her siblings sins as if they need to leave her alone. I'm glad she has her grandma to stand up for her!", "You're not AN asshole. I would see myself as the same way as her, as in not socializing much outside of school/work. At almost 30, I HOPE she does get more social. I'm good with coworkers and all, but once work is over, all to myself. No kids, no girlfriend, don't live with my family, obviously. Just solo. No dating in like 5 years despite always wanting to, talking to women, and using apps. Wake up, work [is fun-ish cause even though I think I'm a quiet introvert, my adhd displays the exact opposite], then go back home. It is what it is", "I refuse to believe you actually think you’re not the AH…. All your comments prove it even more… I’m an outgoing person who works with kids and I enjoy talking to people older than me too. I’m a homebody and it seems like she is too. There’s nothing wrong with how she is and YTA for making it seem like there is.", "YTA… and not a very good mother. Do her a favor and leave her alone. And pay your MIL the money you owe her you spoiled little brat.", "YTA. You are the biggest problem in Samantha’s life, you absolute garbage parent.", "YTA you all sound stuck up. There’s no rule about what age people have to be to talk to them. How exactly is talking about work or future jobs not the ‘right thing’ to talk about? It wasn’t even your conversation! Good grief.\n\nAnd btw, being able to talk to people of any age isn’t a bad thing.", "Yeah, OP, YTA.\n\nYou're such an asshole that I keep wondering if this post was actually written by Samantha herself so that she could experience people being on her side. Either way, Samantha's mom is an asshole.", "YTA.  It’s called being an introvert.  Not everyone needs to be outgoing.   Why would you shame her for her being her.  Embrace who she is.  Apologize and work on you not being an AH", "YTA. She found a group of people to study with. It sounds like the beginning of the show Community. When you're an adult, age doesn't really matter when you're making friends.", "YTA. I also get along much better with people way older than me. I just turned 24 and my best friend on this planet is in her mid 50's. I dated one of her sons when we were 16 and I call her Mom now. I didn't start opening up socially until I got my first job and met people older than me. My dad spent YEARS telling me this would happen. As in, he knew what kind of person I was and that I wasn't like most of the other kids my age, and was SUPPORTIVE and REASSURING that I'd find my people.", "YTA your kid could not say LEAVE ME ALONE any more clearly. You’re mean, you’re hyper-critical, you *way* overestimate your ability to read a situation, and you owe your kid an apology after which you should SHUT YOUR PIE HOLE unless she asks you for advice (which I can’t foresee happening, you’ve been mean her whole life apparently)", "YTA.  Goodness, do you even like your daughter?  Allow her to be herself.  Speak to her about whether she’s happy or not.  If she’s happy, back off.  If not, offer therapy if she wants.  But stop treating her like a defective person.", "No wonder she doesn't talk to you. You made fun of her. And now you're surprised .hope  she's not the one you're planning on taking care of you in your old age. YTA", "YTA. Man I wish people would stop treating introverts like we’re diseased.", "Lol OP is asking reddit. A place where most of us don't socialize and live in our bubble. You're NTA.", "Poor Samantha", "My son never socialized either. Was very quiet & had very few friends, but no close friends. He went to college & didn’t like most of his class, but he made some really close friends, has a long time girlfriend he lives with, a great career. I just accepted it would happen when he found the right people. And it did! He’s incredibly happy. \n\nMy daughter is very outgoing & the people she got on best in college were almost twice her age because she didn’t like the attitudes & behavior of the students her own age. \n\nYou really messed up. You need to apologize to your daughter. YTA big time!!!", "YTA if this is real, but I don’t believe this is real, but if this is real you are a gaping asshole.", "YTA. You told her that you don't like who she is and that she needs to change. Accept who she is if you want to have a relationship with her.", ">My MIL also blames me and my other kids for Samantha being the way she is. Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\n\nYou caused this problem. If she isn't comfortable talking to people her own age, then so be it. She can talk to whoever she wants to. YTA", "Your criticism is extremely damaging to your daughter's self-esteem. There is nothing wrong with her. She is normal, just not your normal. \nShe identifies with mature adults, people who treat her with respect. \nYou can't empathize with her, so you assume that she is defective. You're wrong. She is pursuing a worthwhile degree and has a bright future ahead of her. Her personality will probably help her in the future because she will come across as intelligent and well-spoken.\nYour MIL understands her much better than you do. Hopefully, her love will be enough to overcome the damage you have done. MIL understands you pretty well, too.\n\nYTA.", "YTA\n\nIs your daughter unhappy and desires many friendships? Or are you projecting your own desires onto her? \n\nShe sounds like an introvert. And what seems to be making her unhappy is not that she doesn’t have enough friends, but that you keep telling her there’s something wrong with her and that she needs to change. \n\nThere’s a fiction novel that I recommend extroverted parents of introverts read. It’s called ‘Not Enough’ by Mia Hoddell. It’s chronicles the struggle of an introverted young adult slowly realising that she needs to go no contact with her extroverted mother, because constant berating that she needs to make more friends, be more social, improve her social skills, made her realise that she could never be enough for her mother. That she was happier being herself and not being told that she needed to change. \n\nPlease reconsider your stance. Support her. Don’t try and change her.", "YTA I would hate to have you as a parent,YOUR the reason she doesn’t socialize with anyone anymore, you made fun of her as a child and don’t realize that it caused her to be like this now? What makes you think she would want to tell you anything? Or anyone anything? She’s scared she’ll get made fun of again, good on her for leaving and good on your mil for noticing what you couldn’t.", "YTA. Actually talking to older people is more valuable. That's who she is going to be working with when she graduates. I've always preferred older people. Still do.  She'll find her tribe. You just need to butt out and let her find them on her own terms.", "YTA!! There is nothing wrong with your daughter talking to people twice their age. Most of the people i know are twice my age. The amount of opportunities and life lessons I’ve learned and got from them is astounding.\nI would rather talk to someone older who had to got through the hardship and trouble and give me advice on how to do better than go through hardship just as bad, but at least with someone my age.", "She probably talks to older women because she never had a good mom. You're the one who needs to change, your daughter will be fine.", "YTA.  Quit asking her to be someone she is not.  I wouldn't be concerned that she only talks to adults way older than her.  Folks 18-21 do not always \"explore the world\" in healthy ways, and its not a problem if your daughter wants to avoid all the nonsense (getting drunk or high, etc).   Changing someone only works if they want to change (you make no mention if your daughter is in fact bothered by her situation), and its helpful if others suggest specific ways in which people could do things differently. . . .. . . right now you're effectively telling her \"change\" without being at all specific about what \"social skills\" you want her to develop.  For example, telling her that relaxing and remembering that drinking one adult beverage here and there with other young adults won't kill her and you won't be judgmental and throw her out.", "Yta. And not a nice person.", "YTA big time. She used to be talkative, you made fun of her, and now you don’t understand why she is reluctant to talk? How can you be so foolish and irresponsible? You have very much made her this way. You sound rude, mean-spirited and hateful. Shame on you.\nP.S. pay back the money you borrowed from your MIL!", "YTA- while I'm not very similar to your daughter, you sound very similar to my dad with your misplaced worry and judgement. You wouldn't believe who I stopped talking to once they wouldn't apologize to me for the way they treated me! (:", "You might want to learn some social skills yourself. Perhaps you can find some empathy while you're at it.", "My god-YTA.", "Lol, you think she'll have a hard time finding a job because of this? You sound like someone who doesn't have a job. You can definitely get good career advice and options from people older than you, and Samantha seems to be able to talk to people just fine. You just seem to have some stuck-up notion that she will get so many benefits from socializing with people her own age when meaningful friendships can happen between anyone. You sound quite narrow-minded.\n\nYTA. It sounds like you teased her for being outgoing when she was younger, and now you're giving her shit for being the opposite.", "100% YTA.\n\nThe only social skills she’ll need for work is the ability to discuss work with coworkers/managers and work with the kids, which you yourself said she likes to talk about. I’m an engineer and can say that a large portion of people in the STEM field are the same way. Also, it’s seems that basically, you’re just upset that she likes talking about her interests and doesn’t have much to say about other things. \n\nLastly, not even related to your daughter, but let’s not skip over that you’re making fun of a girl and using her as an example of failure when she doesn’t know anyone at the party meant to celebrate her graduation. It’s pretty obvious that whoever set up the party only invited people they wanted to show off to. Imagine how awkward that is, having a party in your honor as an adult, but only knowing your sister, and apparently being watch by a judgmental AH the whole time. \n\nI really love that even after you tried to make yourself look good in your post, it’s so so obvious that you are the AH and way too entitled.", "... really? \n\nIf you're not full of it, YTA", "YTA OP!! Your a busybody and think you're always right! I'm glad she has her grandma. It's funny how you refer to her as MIL instead of her grandma.", "JFC.  YTA.  So many things wrong here.\n\n1) where or how do you think children learn socialization? From their parents!  If she was having trouble making friends or relating to kids her own age, you should have been actively helping her do that as she was growing.  Playdates where you help teach her how to interact.  Sports teams where you are there to guide her when she gets awkward.  This stuff is learnt...it comes easier for some kids but others need guidance.  So this squarely lays on your shoulders.\n\n2) Goes with number 1--she could be neurodivergent.  Again, squarely your responsibility to figure it out and provide the guidance and support she needs.\n\n3) she sounds awesome and the skillset of being able to get along with people of various ages and generations and easily interact with them will help her incredibly well as she moves into the professional world.  I have friends who are 86.  I am nowhere near 86.  I am in the corporate world.  From my very early days in my career, I was never shy or scared to go speak to the CEOs (of some very major companies).  I attribute this to the fact that I never saw age--so no one was intimidating to me.\n\n4) that skillset will also allow her to have a much broader world view.  Depending on where you are in your life you have such different perspectives and there is sooooo much to learn from people of various ages and generations and experiences and backgrounds.  That perspective and input is invaluable.  Not everyone has the ability to relate to an 56 year old when they are 19.  That is an incredibly skill set and one that will enrich her world.\n\nShe sounds amazing.  You should be uplifting this gem of a child you have not shitting all over her.  I encourage you to reflect on the comments here and make it right.", "I’m so glad she got out of your house. More power to Samantha. YTA", "Honestly, you suck. Your daughter is fine and she’s better off not being around your toxicity. There is nothing wrong with her and she will be amazing and you will wonder what happened because she no longer talks to you or wants to see you, but fortunately you have this post to remind you of what a sucky parent you are. Just in case - YTA BIG TIME!", "YTA. What is her not being as social as you think she should be harming her? She sounds like she's happy with what she does. You're the one comparing her to your other kids, your 'normal', and implying that she's somehow wrong and needs to fix herself. She's happy. From one introvert here, we work a little differently. We revitalize in private. We have the things we're happy to do and we do them. Forcing someone to do or be something they aren't is pretty presumptuous of you. Is she happy? Healthy? Then what's the problem? \n\nThe rest of what you said about your MIL is unimportant, but you seem to be thinking her opinion doesn't count because she's holding a loan you know you owe over your head and that's wrong to you somehow. You and your husband borrowed money and never paid it back. I'd be mad too.\n\n\"We bullied my child and think that's perfectly valid and it's not MY fault as a shitty mom that her attempts at friends were sniped by my older cooler kids because clearly this one's defective.\"\n\nDo you even like your kid? Sounds like that's a no.", "YTA. Your poor daughter.", "YTA. What horrible parenting. Your MIL is right.", "As some who doesn’t leave my house and my best friend is a party guy, YTA real friends won’t give a shit", "The more I read this, the angrier it makes me. Your daughter used to talk. Until you turned against her. You turned your home into a hell for her. Home is supposed to be safe. This whole post is just another sad reminder that sometimes, not only is home not safe, it can be the worst place for a kid, especially one that doesnt seem to fit in.", "I relate so much to Samantha. I was an outgoing kid that got mocked and slowly pushed into a far more introverted space. I have few friends and very solo interests. I still ended up happily married with a great job in a social field. Just because she’s not succeeding your way doesn’t mean she can’t or won’t succeed, it might just look different from what you imagined for her. Better to be a happy weirdo than a depressed loner who’s convinced they can’t fit in, though! YTA", "YTA. I'm an introvert and I'm fucking sick of this shit, to be honest. I'm fucking sick of being treated like I'm defective by people like you, and I'm sure Samantha feels the same way.\n\nThere are strengths of both introversion and extroversion, but extroversion is treated as normal and introversion is treated as a failure or a sickness. There are jobs and situations more suitable to introverts, and introverts can thrive if they're not forced into situations more suitable for extroverts. It's like trying to fit a round peg into a square hole.\n\nWhat you're doing is telling your daughter that who she fundamentally is as a person is not good enough for you. That is incredibly hurtful and damaging. How do you not understand that? Or do you understand that and just not care?\n\nThe fact that you'd rather your kids get into trouble than keep to themselves speaks volumes about your character, and not in a positive way.\n\nAnd for what it's worth, I love kids, dogs, and musicals, and although I can't bake, I enjoy eating baked goods and watching the Great British Baking Show, so I think Samantha sounds awesome.", "YTA\n\nThis whole post man, especially the last parts... why do you hate her so much? You made fun of her, you let your daughter bully her and now you say she's going to be a failure? Is there anything she does that doesn't make you angry or hateful? Damn poor girl...", "YTA. You sound insufferable. Your daughter was social and more outgoing when she was younger, and you made fun of her for it. Now she’s quiet and keeps to herself, and you consider her abnormal. You are the parent, and you have failed your child miserably.", "YEAH YTA. \n\nNews flash, a ton of friends doesn’t = happiness. You are literally telling your daughter that she must be a miserable human being because how she spends her time is surrounded by other people the same way you or her siblings like to be. \n\nI don’t want friends. I don’t like it. I have 2, they live in different states right now and that’s fine with me.  \n\nI grew up faking how I dressed, what hobbies I had, music- movies- and shows I liked, even my favorite color just to have lots of friends because that’s what everyone said was normal. The second I moved away and deleted my social medias slowly drifting away it was the biggest relief not having to pretend to be interested in all these things just to fulfill this idea that **I must have lots of other females around me, who are copycat versions of eachother,  to be happy**", "YTA, it doesn’t take much reading between the lines to understand Samantha is your Scapegoat. Just how awful you’ve been to your daughter we can only guess at, but that her grandmother has yelled at you and kicked you out of her house for it says enough. I hope Samantha escapes you soon.", "YTA \n\n>Samantha used to tell everyone everything when she was younger and we used to make fun of her for it. Samantha's friends also preferred to hang out with my older daughter when she brought her friends over but it's not my fault that her friends found my older daughter more interesting.\n\nso you bullied her (and let her siblings bully her) for being talkative and now you want to complain when she's quiet and reserved? what is wrong with you?", "YTA why do you need justification or validation for something that clearly makes you a terrible parent. If you actually care if your daughter has issues with something like social anxiety then you shouldn't constantly demean her like you apparently did her entire childhood yet you wonder why she is the she is? You are acting more of a child than your own child not just that but you're literally bullying her and her friends for no other reason than you don't like how old they are and that is petty and pathetic.", "Yta fyi in case you haven't figured it out yet", "YTA. Doesn’t sound like you really know your daughter either. I bet she’s amazing but you have your head up your @$$ and can’t see that.", "You ma’am ATH from the first sentence to the last. You are the problem and not your daughter. I’m just glad she has a safe place to fall after you keep pushing her down, more like running her over. She is blessed to have her grandmother.", "YTA. You belittle your daughter and that’s wrong.", "YTA. There is nothing wrong with being an introvert! Guess what? At 19, all I did was school and work too. I came home and played video games when I wasn't studying. I didn't go out of my way to socialise because I am an introvert and that kind of stuff wasn't enjoyable for me. And yet I've had a number of jobs and I've been with my current partner for a decade now. I even have 2 kids with him! People need to stop equating being an extrovert with success and being an introvert with \"lacking social skills.\" Clearly my social skills have been good enough. But if you don't stop pushing your daughter to be someone she's not, you'll never find out what her social skills can get her because she will go NC. Heck, it might already be too late. Oh, and granny's right: there is nothing wrong with her. She just isn't you.", "Yep YTA\n\nWhy do you dislike your own daughter so much?", "YTA.\n\nHow do you get on here and complain about your daughter's interests and that she's reserved then turn around and say, \"Maybe her being so reserved is my fault because the rest of the family and I teased her\"? \n\nSeriously, the whole thing turns into some douchey monologue at the end. The audacity.", "something seems fishy. either you’re the biggest, stupidest asshole in the world or this aint real.", "YTA. Stop being a judgemental AH. Just because you think that’s what should be done, doesn’t mean it’s right. Let her live her life.", "So... you bullied her into silence and avoidance of people, you blame her for not being interesting enough for the friends she used to have, and now you are trying to frighten her out of being the person you cultivated her to be? Is there ANY parental accountability in that twisted mind of yours? YTA", "YTA.  Samantha sounds a lot like me, and I was finally diagnosed with Non-verbal learning disorder in my mid-30s.  My mother hasn't really accepted that diagnosis and goes out of her way to try and push me into situations where I'm uncomfortable.  Luckily for me, my dad puts her in her place and tells her to knock it off.  My mom did a lot of damage to my confidence when I was growing up and is continuing that trend despite knowing that I *can't* learn those social skills she thinks I should know by now because *that part of my brain didn't develop properly.*  It isn't my fault, but she still tries to blame me for not trying hard enough.\n\nEven if your daughter doesn't have NVLD *you* did a lot of damage to her while she was growing up.  She's afraid to interact with people because *you* made fun of her.  This is your fault.", "Yta and you obviously hate your kid.", "Is this for real? You're treating your daughter like shit and isolating her even further, and from her own family! What the hell.\n\nAnd your MIL doesn't like you because you borrowed money and never paid it back and also treat your daughter like shit? No shit! \n.\nYour daughter will be fine in life - she has goals, ambition and interpersonal skills. She obviously talks to people just fine, but she is selective about it. She is clearly intelligent by choosing not to talk to you. Don't be surprised if your daughter eventually goes no contact with you.\n\nYTA", "So because her interests don’t line up with her peers, or yours, she’s going to be a social failure? At least she has her grandmother on her side, because you certainly aren’t. The reason your daughter is so upset (and why your MIL treats you the way she does) is because you are fucking it up. Encourage your daughter in her interests and enable her to be happy, not to be a social butterfly that likes parties. She’s not like your other kids and I’m guessing not a lot like you, or you would be able to emphasize with her better. Take a second to look at your actions and words from her point of view, and maybe you will realize what you did. YTA.", "YTA - I hope you're prepared for a life without her because she's going to cut you out.", "YTA, do you even like her? It sounds like you're her worst enemy tbh. You don't speak highly of her at all, not loving or concerned, just judgmental. There are plenty of people in this world that will like her and want to be her friend for who she is. Don't be a dick. Learn to be a better parent to this poor girl.", "YTA.... for this story and just in general by the sounds of it 🤷🏼‍♀️", "> Samantha doesn’t have many friends.\n\n> My other kids are the exact opposite. I’d get into arguments with them because they were never at home\n\n> Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\n\nSounds like your kids—and especially Samantha—can’t please you no matter what they do, so they might as well do what makes them happy.\n\nYTA. She’s a grown woman. She’s doing what fulfils her. Just because she isn’t you, and what makes you happy doesn’t make her happy, doesn’t mean that she’s suffering as a result. Butt out.", "Here we have a strange specimen, because YTA from the past present and probably the future", "YTA. Jeez. Actually, I'm pretty sure you know YTA. And your other kids are also Team YTA. You're all bullies.", "Yep, you be an ah. !00%\n\n1 you favoritism you kids\n\n2 everyone different just cause she doesn't socialized the way you do, doesn't make it wrong.\n\n3, your point of views are horrible. You legit put your daughter down and see no wrong in it.\n\n4, in what field is everyone the same age group when working? So she get along better with older generation.  Like did you bang your head and woke up in lala land?????\n\n5 i really feel bad for your child. YOU USED TO MAKE FUN OF HER. THE F\\*CK IS WRONG WITH YOU!!!!", "Nobody wants their daughter to become a cat-lady but you definitely could’ve handled it better. If your daughter is 19 with no social skills part of that blame is on you. You’re supposed to teach your kids to be social at a young age, and if you did and she still chooses to stay a recluse then that’s just who she is YTA for not understanding who your daughter is.", "It always astounds me how some parents can be so cruel to their children and oblivious to their needs. \n\n> used to tell everyone everything when she was younger and we used to make fun of her for it.\n\n> Samantha's friends also preferred to hang out with my older daughter when she brought her friends over but it's not my fault that her friends found my older daughter more interesting. \n\nWTF?!\n\n> My MIL has always coddled her and told her there's nothing wrong with her\n\nThere is certainly nothing wrong with Samantha, but the same can't be said about OP\n\nYTA", "So if or anyone else is not like you then she's wrong. YTA and a narcissist.", "I’m a lot like your daughter and I find it easier to get on with older people. I’ve got on just fine. YTA.", "Yta hey there’s this thing called ✨social anxiety✨", "YTA. It’s so obvious you’re jealous of something about your daughter and have spent her whole life bullying her and encouraging your family and any friends she made to do the same. you even said in your post that you made fun of her when she was a kid. What a piece of work you are, and a bad mom.", "> Samantha used to tell everyone everything when she was younger and we used to make fun of her for it.\n\n> She rarely leaves the house except for school or work and never brings people over. She never stays late at school or tries to talk to anybody either.\n\nWell, well, well. If it isn't the consequences of your own actions.\n\n\nYTA", "me when im a miserable ... YTA", "YTA. Leave her alone not everyone should be exactly the same.", "YTA, a bully and a bad parent. There is nothing wrong with being an introvert and having few friends. There is something wrong with bullying your own child and comparing her to her siblings and making her feel consistently unloved.", "YTA. I never had friends my age at that age. Mostly older people. \n\nIt wasn’t til I hit around 27 that I started making friends. And I now have friends that are so special to me. \n\nFriendships happen at different ages and times in your life. Some get them as kids. Others when they’re my age. \n\nPlus you basically told her she’s broken. She’s really hurt by you, and has every right considering you’re supposed to be the go to person and supportive of her.", "Yeah thank god for the Grandma. Sounds like she gets her.", "I hope grandma sues OP to get that money back because OP is trash since no matter what Samantha does & do, OP will always mistreat her. YTA and I hope Samantha moves out soon so then next complain out of OP's writing / mouth is how she knows nothing about Samantha anymore.", "She's into her work with kids, musicals, dogs and baking. She sounds lovely & like the only decent person in the family (aside from MIL) given the rest are bullies.", "OP complaining about the effect when being part of the cause.", "I'm choosing to believe this is bait, because no one can possibly write all that out and *not* realize they're in the wrong. Usually there's some denial in these types of situations. Like, \"Oh, her siblings used to tease her a little bit, but that's just siblings being siblings,\"  not straight up, \"Yeah, we all used to make fun of her as a child.\" Has to be bait—I need to keep some faith in humanity.", "Yes, op YTA", "[deleted]", "Yup. My mom constantly told me to shut up when I was a kid. \n\nGuess who quit talking? And my shitty mother was just as bad as this one. \"Why don't you go out? Why don't you have friends?\" Hmm I wonder.", "Yup. Chronic invalidation is one of the most damaging forms of emotional abuse. Ask me how I know 🙃", "She will be a failure if she doesn't change. She's not going to be able to get a job if she can't talk to people.", "That sounds about right. Your brother hit his peak in high school. I’ve heard of that. It happens a lot.", "And not good enough no matter what she does! She tried talking and being social, she got mocked and bullied by her siblings and parents. Now she’s quiet because they taught her she had to be and is somehow a failure for not wanting to socialize when she was taught that social behaviour would be punished. \n\nOP, YTA. She is able to communicate and she’s going to make friends fine once she’s away from you.", "She was an extrovert, OP made fun of her for it until she stopped.", "After admitting that she used to bully her own child for being extroverted in the first place...", "This. You were kinder than I was to OP", "I’m also autistic and didn’t have a filter when I was younger. I can’t imagine what it would be like if my own parents made fun of me for that. As an adult I also am a lot more introverted. OP you need to apologize immediately, there is nothing wrong with your daughter, she just didn’t turn out like you were hoping and that is not a problem. She’s a whole person and can be friends with who she wants. This might shock you but not everyone is the exact same. YTA here, a huge one.", "My first thought was that the daughter sounds autistic. It also sounds like she’s got some people in her corner and will find her own tribe, although I very much doubt her parents will be in it.", "I'm autistic and while I've always been quite talkative, I preferred talking to adults/kids older than me. And yes, I'm introverted, I have few friends but quality over quantity here for me.", ">as someone who has adhd/ is autistic research shows that we are shunned by our peers as they sense something off in minutes.\n\nI'm not diagnosed with anything but I suspect I'm autistic or some other variety of neurodivergent. I've been dealing with this shit my entire life. I just had a major incident regarding this earlier today. The way I am works for me and hurts no one, but because it's not what most people deem \"normal,\" I get treated like shit. I'm fucking sick of it. It doesn't make me change. It just makes me feel defective.", "I know! I wish I had the confidence to talk to someone 35/40 when I was 19 with that level of ease about shared mutual topics! Job interviews would have been so much easier.", "love how she dropped in that she and her dumbass husband stole money from her MIL and so didn’t see anything wrong with that?", ">“My daughter doesn’t communicate the way I THINK she should communicate so I’m going to put her down for it”\n\n\"*even though I'm a bully and a mooch who other family members have cut off already*\"\n\nhad to add a bit...", "This was my first thought, there have literally been studies which show that children who socialize with *different* age groups do better in the workplace, like wth", "Perhaps she is neurodivergent. Perhaps she’s simply an inverted person who was constantly made fun of by a family that forces her to fit certain expectations.", "Speaking as an introvert, being an introvert is not an \"issue \" that needs to be fixed or diagnosed. I also have had it suggested that I could be be autistic because I am an introvert and it's frankly insulting.", "Speaking as a fellow neurodivergent person, help her with what? What exactly is the problem with her getting along better with people who are older than her?", "Happy 🎂 day!", "I’m not autistic and I don’t talk to a lot of people or care too, most of my friends were always older and that’s how I preferred it. Not all people who don’t talk to people or don’t want to are autistic… I don’t think we should go around diagnosing people with no merit….", "Oh and you big Ole bully you're the reason she doesn't talk around you and anyone like you", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I’d hang out with Samantha. She can come over with baked goods to play with my dog and watch musicals!", "People getting mad at reactions (short-term or long-term) reactions they caused will never fail to astound me.", "yeah no way its not. This should be on quora or something lol", "Mmm, no, it's there. The last paragraph.", "Sounds like we had the same kind of mother.  Those are my moms words exactly.  All that complaining made things worse, not better.", "Went through something similar as well, my older brother would constantly tell me I spoke for too long and laughed at me, now I always feel guilty and pause in my sentences because of him. I wish people realised how their words and actions could affect young ones no matter how small the situation seems", "You were never good enough and your parents didn't love you?", "Is there actually a term for such a thing? Um, asking for a “friend” 🥲", "Except she can talk to people.  You made special note of the fact she's good at conversing with older people.  Like say, the kind of people who are hiring managers?", "Do you even like your kid? The hell is the matter with you?", "You're the failure. Just start coming to terms with it. You're not a mother, you're an egg donor who likes to bully kids. Now that your child is an adult she can get free of you.", "she’s an adult. she can make her own decisions without you", "Lol my guy, I work in tech with the same “issues” your daughter has and I’d bet money that I make at least 2x your income. You’re just an asshole.", "but she clearly CAN talk to people, you're just upset because she's not talking to the people you want her to talk to. you're bullying your daughter and if you don't stop pressuring her and making her feel like there's something wrong with her she is probably going to start talking to people even LESS", "Well you’re a failure if you had to borrow money from your MIL, and you are such a failure that you never even bothered to pay it back, and you’re such a failure of a parent that you’re actively proud of making fun of a child, destroying her extroverted personality because of it, and now telling your daughter who is just content existing and enjoying what she enjoys that she’s going to be a failure because of it? So you bully her for being chatty, now you’re bullying her for not being chatty enough. Like, you’re such a failure at social skills you’re asking strangers on the internet if you’re an AH for repeatedly bullying your teenage daughter?? Thank god she has your MIL, who clearly isn’t a failure like you and can be a decent and responsible human being. \n\nI’m sure your daughter will do far better than you. Stop bullying your own child. YTA.", "But she is talking to people.  Just not people you want her to talk to.  Heck her job interviews will likely be with older people.  I talk less around my family, and when I was at school, because people didn’t get me.  At work, once I’m comfortable with people I’m chatty, oh and I’m successful so YTA majorly.", "In your post you said she has a job…. So…..", "You’re a failure as a parent. Get a fucking grip. My mother was just like you. I’m the only child, so guess who’s going to die alone in a nursing home?", "There are plenty of jobs that value skills *other* than conversation. And there are plenty of employed introverts. We're actually damned good employees because we focus on our work instead of idle chatter.", "She will find people she can relate to, people who don’t make fun of her for sharing her ideas and experiences, people who won’t try to force her to be something she doesn’t want to be, people who actually try to understand her. Oh, like her grandmother and her classmates. I bet her older classmates might be taking on parental roles, too, letting her know that there are others like her grandmother who will support and advocate for her.\n\nYTA. Why should she feel like a social butterfly when OP tore up her wings when she was younger and, along with the rest of her family, criticized and teased her when she would try to share everything with them. You just lost your daughter, OP, and going NC is in her best interest.\n\nEdit to add: and she will be able to find a job—common ground is the work environment. They will discuss work things.", "Every employed introvert on the planet would like a word with you.", "Hello, I'm exactly like your daughter, with the name and everything. Consider this a wakeup call from.... twelve years in the future. I have a wife, friends I love, and almost zero contact with my family. Get over yourself or you'll be the one she won't be talking to. YTA.", "Sounds like she talks to people just fine.  You just don't like who she's talking to (older adults rather than other 19 year olds). Not every job requires you to be a social butterfly (most don't in fact).  Luckily she has MIL in her corner so she'll find her way.  You're trying to force her to be someone she isn't instead of empowering her strengths.  YTA.", "I'm actually just like her and I make a killing. 27, big house, I go on vacations, found a guy that accepts me and loves me for who I am, I have 12 chickens and hundreds of books. I found a job I'm great at and I'm social as needed but I am who I am. Which is quiet. I've got a few people in my life I'm comfortable opening up to and the rest I'm just polite to. I also always clicked with older students when I was in college. They were more serious about the work than the young kids and they had real applications to the world with it.\n\nShe's going to be fine. Quiet and socially inept are very different things bud.", "Hey OP what’s your job?", "I couldn’t interact with people my own age in high school, I had friends younger than me or older than me.  When I got into the real world I found out it didn’t matter how old the person is, what matters is common interests,  most of my friends are at least ten years younger than me or ten years older than me.  I have a few in my own age bracket.  But most of them are not.  \n\nMy best friend, I’m closer in age to her parents.  I could literally be her mother.  But she is my best friend and I met her through work.  She moved away for school and is married and in a different country now, but she’s still my best friend, my peanut and my “adopted kid” all at the same time.  \n\nI get along so well with the 20 somethings at my work, the sixty somethings and everyone in between because while I may joke about me being old and then being kids, I take them as they are and I find common ground to talk about, books, anime, pets…\n\nAge ain’t nothing but a number.", "YTA. If you’ve treated her like this her whole life, invalidating who she is because she’s not a clone of her siblings, it’s a wonder she put up with it this long, and good for her for finally walking out. \n\nWhat narrow world do you live in that you don’t see that she’s perfectly able to hold conversations with adults who share her interests—and likely who don’t dismiss what interests her as not being good enough the way you did in your post?", "Shes a better human being than you. Plus she will get a great job and thrive. You on the other hand..suck.", "I was also a really quiet, introverted girl who rarely went out and didn’t have much of a social circle. I always identified more with my professors than my peers, and also had parents who were concerned I wasn’t being social enough. I’m now a manager at a national nonprofit, where my job is literally to form and maintain relationships with people across the country, for which I’m paid reasonably well. She’ll be fine, and you need to be more supportive of your kid.", "The fact that you could ever consider your daughter a failure makes me so sad. Failure is for things not people. I am diagnosed with anxiety and my parents were worried about me getting a job but I have now had multiple jobs and the one I’m at I’ve been at for 7 years. Jobs are great place to learn social skills. As long as your daughter is willing to learn which it sounds like she is then I think she will be fine.", "She’s talking to people just fine. They just don’t happen to be her age.", "😂😂😂😂\n\nMeanwhile, my husband is pulling in 6 figures while spending 90% of his waking life silent.", "She won't be a failure, even if what you say is true, she'll just have to find her niche.\n\nAnd if she has no social skills whatsoever (which I doubt, not everybody likes being the center of the party), that means YOU FAILED HER. Not surprising really, since apparently you bullied her, encouraged your other children to do so too, compared her negatively to her siblings; and even now, your plan to 'help her' is make her feel inadequate, lacking and not worthy.", "The only failure is you as a mother.", "You're failing her as a parent for putting that notion into her head. YTA", "Idk sounds like she knows how to talk to adults. Other 19/20 year olds aren’t going to be the ones interviewing her and offering her jobs.", "why do people like you have children if they clearly are going to hate them. i dont get it", "Lots of introverts turn out successful. *You* can talk to people, but the things you say are stupid and mean, so…", "No-you are the one who has failed. You failed your daughter. You bully her, tell her there’s something wrong with her, make snarky comments about other people her age, and somehow expect her to just take it? You act like a high school mean girl bullying your own child. Shame on you. You are too old to be behaving like this. \n\nNot everyone is an extrovert, and that’s okay. I can see why MIL has issues with you- you talk a big game about success and failure for someone who can’t pay back the money they owe. Focus on your own issues instead of bullying your daughter. \n\nDo better. This behavior is atrocious. YTA", "Well apparently she does love to talk about…kids. And working with kids is what she wants to do for a living. I imagine that passion will come through in job interviews, and she’ll be just fine as far as that goes. \n\nSamantha sounds a lot like me in many ways. There is absolutely nothing wrong with being an introvert, but there is something wrong with not accepting your children for who they are! And saying she’ll be a “failure” if she doesn’t change? Just yikes. \n\nAnd…she used to be more talkative when she was child, and you made fun of her for it?? Sounds like she just can’t please you no matter what she does.\n\nYTA. So much.", "Ans you're going to be a failure of a parent if you keep judging your daughter for being an introvert.", "Actually it seems like she’s just more mature than you will ever be. I hope she goes no contact with you.", "Well you’re certainly right about that. I mean, look at you, you’re refusing to change and let your child  be happy and look at you. A failure of a parent.", "JFC, do you even love your daughter? The way you speak about her is vile. Also, she's clearly traumatized by being made fun of BY HER FAMILY for talking, so now she's quiet and introverted. Yuck to you.", "Only failure I see is you. YTA 200%.", "Yta. Samantha deserves better. You are awful and I hope for her sake she cuts you guys off completely and your MIL takes you guys to court and uses that money Samantha. Bully.", "The only failure here is you, as a parent. YTA", "You are a failure. In every sense.", "Don't be surprised if she cuts all contact with you in the future.", "Wrong. She'll be a failure as long as she stays under your roof.", "That's not even remotely true and I don't know who told you that. But they lied. And yta. At least she does have a family member willing to realize that being different doesn't mean they will be exiled. You're the one pushing her away.", "Just because she chooses not to put herself in social situations doesn’t mean she isn’t capable of being in them. YTA", "She sounds exactly like me when I was her age.  I am now a registered nurse, I do contract and travel nursing so I make really good money doing it.  You sound like awful parents.  I’m glad she has somewhere safe to go where she isn’t treated like garbage.", "You are so gross.  The internet is telling you are the AH, and here you are still insisting you're right.  I hope you groomed your other children to love you and take the sh*t you shovel because Sam will most likely be NC soon.", "Projection. YTA.", "Your child isn't a failure, but you certainly have given her a great example of what a failure looks like. You should be ashamed of yourself.", "You should send this post to MIL, just so MIL knows that you'll never change, and that Samantha will do much better at her place. \n\nBesides, you get to now only have children who stay out of home and get into trouble, just like what you wanted.", "I hope she goes NC with you. She deserves a parent who actually supports her child. YTA. Obviously", "if she's a failure then I guess the apple doesn't fall far from the tree. what an asshole you are", "Wow....just wow\n\nAnd you're the failure.", "Nope. She can talk to people. She talks to a wider variety of people than you want her to. I was always like your daughter. I am very successful in my career. I just joked that my annual work goal was difficult because there’s only one senior person to me in my organization and I don’t want to move to Big HQ.   \n\n\nI‘m glad she went to your MIL. You need to pay back the money and try not to be such an AH.", "There are plenty of jobs for people who aren't super social. I'm not a social butterfly myself, but I (27m) have a good-paying job with plenty of room for career growth and raises in the future. I didn't get it via knowing anybody special, either. I work from home 4 days a week. Your daughter will have plenty of options if she searches diligently.\n\nYou also mention she likes kids. If she can get along with kids, that could mean she could be a great teacher, a child psychiatrist, all sorts of kid-focused careers. Rather than trying to change your daughter to fit whatever mold you want her to fit, have you considered helping her out with finding a path that is conducive to her personality type and personal interests?", "[removed]", "“She’s not going to be able to get a job” but she was “hired on the spot”…", "She does talk to people. You just don't like who she talks to. You're pissed because she's not like your other kids. You don't even like her. Let her go so she can be happy. Away from you and that toxic place you call a home.", "She can though? You said she became friendly with people in her study group who were 35-40. Guess who’d be interviewing her for a job? Someone in that age range. \n\nYou’re a terrible parent. You’re the one who needs to learn here, not Samantha.", "Your an asshole. You make fun of her for talking to much as a kid then you judge her and berate her for not talking now. She won't be a failure but your a failure as a parent.", "Wait a second. She was outgoing but you and your other kids made fun of her which made her change her entire personality. Now, you want her to change again? Why don’t you just say that you don’t like her and be done with it? You and your other kids are assholes. No doubt. YTA.", "I managed to get a job and *i* barely talk to people. Just because you don’t talk to people doesn’t mean you would bomb an interview", "I can't say what I want to say here, but know I'm thinking it. You literally bullied your kid, made her feel like shit, let your other kids bully her, and now you're mad that she's not some social butterfly so you're calling her a failure.\n\nYou are a *horrible* parent.", "You’re the failure. Is it possible she is autistic and socializing is hard? Also, I’m a full ass adult who has a small circle and I’m successful in my career. Stop projecting your nonsense.", "You don't like her very much, do you?", "I think that this kind of change is common in autistic people, and the reason is that kids in general have no filter and talk about whatever they find interesting to whoever is willing to listen, while later in life there is a lot of social stuff to figure out before you even open your mouth, so better spare that energy.", "Yeah I think that too from the description, and finding my own tribe and people I can be myself with was really important. I can mask and put effort to be more normal but it is tiring, what’s the point in having friends if you can’t be yourself and have a good time?! \n\nJust masking to seem normal to fit in with peers when you’ll feel lonelier in company isn’t gonna make her feel better even if it will make her mum feel less uncomfortable.", "Same. She sounds like she may be neuro divergent. Growing up, I spent so much energy masking and trying to fit in, only to still have have no real friends. The only thing that made me better was my mom NEVER  made me feel bad about being weird or having odd habits. Your daughter just needs someone to be in her corner, to make her feel like she could find her way.\n\nYou failed. You failed as a parent and as a human being. \n\nShe will carry this fear and anxiety with her for the rest of her life, and she will always have a wholly negative association when dealing with you. \n\nYou may well have lost your daughter, and you're too busy trying to get us to agree with you to even consider the consequences of your \"parenting\". \n\nYTA, OP. And I hope your finds this, so she get some of the support you never offered her", "I’m not saying there is issues getting along with only older people. I have 3 kids who are autistic, but learning how to hold a conversation, how to learn basic talking back and forth, asking appropriate questions in conversation, learning not to infodump on everyone, what conversational information is ok for different friendship circles, those are all things that my kids have had to be taught, in order to maintain friendships, and not scare other kids.", "Thank you!  Happy 🎂 day to you too!", "OP, reaping what they sowed: Well this sucks. What the fuck.", "Yeah, my dad constantly chewed me out for being a chatterbox when I was little. Now I barely know how to have conversations with people. What’s small talk?", "I'm in my late 20s and I get along better with 50 to 80 year olds than I do with people my own age.", "Exactly that’s what got me 😂 She sounds like someone who gets along with the exact type of people who would be in a position to get her a good job\n\nAlso, not job related, but if she wants to be one, she sounds like she would also make a great mother because OP said she likes working with kids.", "She says they used to make fun of her, so apparently not. And apparently she doesn’t realize how that could be part of the issue.", "I think it’s pretty obvious that she doesn’t. Seriously, fuck OP.", "She can talk to people just fine. You think a 19 year old who can confidently talk to older people about her interests and studies as an equal will have trouble finding work?\n\nWhat she can’t do is pretend, and what she doesn’t wan tot do anymore is be around people who belittle her for being herself.\n\nBTW, not that it’s likely going to be necessary, but the problem with that party wasn’t the girl being celebrated, it was that she was forced to celebrate in way she didn’t want. Don’t give your daughter a party without confirming with whom and how she wants to celebrate.", "I don't know how to give awards... but you deserve all the best ones!!!", "I was at the interview. She basically smiled and nodded the entire time and was hired on the spot.", "Yo, saaaaaaaaaaame. She does say she doesn't want to go to a nursing home, and that's fair. It'd probably cost the same amount to just hire a nurse to take care of her until she dies. Either way, I probably won't be there", "*Why should she feel like a social butterfly when OP tore up her wings*\n\nThat’s beautiful, and so so accurate.", "I'm the principal at a private elementary school.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "it sounds to me like those were habits when she was a young child, and obviously aren't an issue anymore as even OP admits she can hold conversations. they just don't like who she converses with. it sounds like she's just introverted and gravitates towards more mature social circles.", "This! I bet she was pressured into the party by her family—and, of course, her parents’ nearest and dearest friends were invited. It seems like OP and her daughter weren’t even really close to the poor, tortured soul.", "DNR", "I feel sorry for your students. You’re awful.", "Good god. You should know better than to treat your daughter this way if you work with kids all day. YTA", "For real?! Does OP also tell the students that they will be worthless, too?", "And you demean her education and career choice to work with kids.\n\nBtw. Read the book \"Quiet\" and \"The Introvert Advantage.\"", "You should absolutely not be around any children.", "Jfc you should not be in charge of kids unless you know how to actually interact with them without scarring them. You think your *daughter* is the socially inept one?", "NOOOOOOOO!!!!!!!!!!!!!!!!!!!!!! How heartbreaking!", "Whoa… OP is a school principal who moonlights as a tutor on weekends. I had assumed OP is unemployed because she can’t pay her MIL back. Now it sounds like she refuses to pay her MIL back. Wow. . . Not exactly kind to your relatives, are you?", "I seriously hope you’re lying because based on everything you’ve stated in this post/ this comment section, you shouldn’t be in any sort of authoritative position when it comes to children/young adults.", "I can't imagine a school having a bully as a pricipal..."]}