{"id": 9260, "submission_id": "10v3fh8", "title": "AITA for telling my son and grandson they should leave?", "selftext": "My oldest son, Ethan is getting married to his fiancee, Leah soon. The both have kids from their previous marriages, my son has Mia(15) and Leah has Jake(16). I also have another son, Henry who has Samuel(17) \n\nEthan and Leah decided to bring Jake this christmas to introduce him to our family. He warned us that Jake's dad was abusive and he has had a very hard life, he might say rude things. Ethan asked us to please just ignore his attitude and we agreed. \n\nIt was worse than he said. Jake was rude the entire time, saying things to make everyone upset. We didn't say anything  but Henry and Sam looked really pissed. \n\nI don't know what exactly happened but Jake said something to Sam which made Henry extremely mad. He stood up and said he won't stay here and let his son be bullied and said either Jake has to go or they will. Mia said if we ask Jake to go she will go with him. \n\nI told Henry that I'm sorry but I'm not kicking Jake and Mia out so if he really can't stay then he needs to be the one to leave. \n\nHe called me an asshole and took Sam and left \n\nWe haven't talked since then and he is expecting an apology", "created_utc": 1675679564, "permalink": "/r/AmItheAsshole/comments/10v3fh8/aita_for_telling_my_son_and_grandson_they_should/", "score": 47, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My son asked me to kick my future GS out because he was being extremely rude to them. I might be an asshole because I asked my son and GS to leave instead\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA as someone who grew up in an abusive home, it's not an excuse to treat people like shit. You kicked your son and grandson out to avoid kicking out the person actually causing the problem. I wouldn't come back.", "So you’re choosing a 16 year old rude child (as said so by his mom and almost step dad , your son) over your own son and grandson?!\n\nDealing with trauma doesn’t mean you get to be a dick, if this is how their first meeting turned out, you’re in for a hell of a ride. Good luck!", "We know which son you favor. YTA for ever agreeing to let Jake be rude without consequences.", "YTA.\n\nHaving a dick for her father is not an excuse for being a dick to everybody.", "YTA.  One son causes a huge problem in your family.  You kick the other son out.  WTF", "YTA\n\nIf you let Jake be an asshole, he will stay an asshole. The only way maladjusted children can grow up to be well adjusted adults is *if someone adjusts them.*", "YTA. Are you going to bend and shape your whole world around this kid for the rest of your life? Great way to build a serial killer.", "YTA \nYou guys are enabling his behavior. This kid is obviously in pain and should get help. Both in form og boundaries, not accepting that behavior and mental help from a professional. Ignoring the behavior is ignoring his scream for help and ignoring the harm he causes others", "YTA\n\nAlthough I applaud you for treating your future daughter in law and grandson as members of the family, having a tough upbringing does not excuse someone’s actions. You are not even sure what Jake said to Sam. It was bad enough that your own son was offended enough to ask him to leave. Jake does not get to say whatever he wants to other people without consequences. He needs to learn this now. What if he says things to someone on the street or an authority figure? The outcome would not be favorable.", "YTA and I hope they never come back.", "YTA. You let your son and grandson be hurt in your home, then you really stuck the knife in with your response to it. Your other son saying to just ignore jakes bad behaviour is helping nobody.", "YTA\n\n\"I don't know what exactly happened\"\n\nWhy did you not ASK? How can you make a decision without even knowing what happened. \n\nYou're upset because he gave you an ultimatum but so did Mia? It's so obvious you're playing favourites.\n\nYou should have asked your Son to take Jake home. He likely needs counseling, not to be enabled", "I would be interested in why your granddaughter is so keen to stay with her soon to be step brother. Especially considering their ages. \n\nAnd I’m inclined to say YTA/ESH. It doesn’t matter that this kid is going to be family soon. Is he getting help for his behaviour?  Or is everyone just going “oh it’s just the way he is” and lets him behave this way to other people? If it’s allowed to continue without consequence, it’s not going to change, and he’s going to continue treating everyone around him terribly. For his entire life. And you will alienate your other son and grandchild.", "YTA.   You can kiss goodbye family gatherings", "YTA. Jake's past is no excuse to trample all over others. He is old enough to be told his behavior is unacceptable. Instead, you pushed out his victims, your own family members, in favor of accommodating a teenage bully who will grow up and become exactly like his father if he isn't stopped.", "YTA on this one.  I would sit down with jake and tell him how I expect him to behave in my home.   Jake might respond to some positive expectations guidance, he may not, the point is that you lay down a framework for expected behaviors and consequences.  u/CausticAutist is on point here, I have similar experiences, and this isn't an excuse.", "Hard YTA. Guest or family,  rude gets the boot. There is zero reason to ever ask or expect anyone to tolerate rude or abusive behavior. And the fact that you supported the rude behavior is all sorts of fucked up.", "INFO : what did Jake say?  It’s really hard for us to pass judgement here without actually knowing what was said.", "INFO:\nIs Jake in therapy? \n\nIs ignoring his acting out part of a therapeutic plan for Jake?\n\nHow long has your son been with Leah?\n\nWhen you say you were told to ignore his comments, was Henry present? Did either Leah or Ethan explain WHY they were handling it this way to Henry?", "YTA.  You allowed a child in your home to be verbally abused, the sided with the abuser. \n\nNot only did you turn your back on innocent family - You reiterated that this behavior is ok to Sam, which, in turn, validates the abuse he suffered. \n\nYou did neither child a favor.", "YTA\n\nEthan Jake and Mia got together to bully Henry and Samuel out of the family and you joined in.\n\nYou succeeded. Henry and Sam left and only now do you ask if you are an asshole.", "ESH except Henry and Sam.\n\nYou had prior warning so should have warned everyone involved, you ounished Sam and Henry for being bullied. \n\nBut jake isn't your child to parent and abuse isn't an excuse to then abuse other people. Mia needs to take responsibility get her son into therapy and stop expecting people to pander to her sons bullying.\n\n If he can't behave then he shouldn't be welcome, she has had years to broach this behaviour", "YTA. You’ll be lucky if Henry and Sam will come to future family gathering and not decide to go low contact with y’all.", "YTA for choosing a stupid kid that you don't even know, over your family", "[deleted]", "YTA. Good for your son for standing up for his child. Now your grandson knows if it’s a choice between him and being able to post about your good deed and how you saved this new child, you will not choose him. You should call and apologize before you have to spend every holiday with this new kid. Next time there won’t be a punching bag for him, other than you. No one is going to come around to your way of thinking. This is ‘protect the funny uncle’ territory.", "YTA and you’ll lose out on time with your other son and grandson.  Your son, his fiancé and you are all making excuses for Jake to be an AH. Of course the one Jake is bullying doesn’t want to be around him. You basically told Jake, that in your house he can don and say whatever he wants to anyone and won’t get punished, and if someone has a problem with that they can leave. Do you think that’s helping anyone in this situations. You are not a good parent and an even worse grandparent. As soon and Mia has her say, you basically telling Sam that he doesn’t matter, but Jake and Mia sure do. Your really messed up even asking for a judgment.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy oldest son, Ethan is getting married to his fiancee, Leah soon. The both have kids from their previous marriages, my son has Mia(15) and Leah has Jake(16). I also have another son, Henry who has Samuel(17) \n\nEthan and Leah decided to bring Jake this christmas to introduce him to our family. He warned us that Jake's dad was abusive and he has had a very hard life, he might say rude things. Ethan asked us to please just ignore his attitude and we agreed. \n\nIt was worse than he said. Jake was rude the entire time, saying things to make everyone upset. We didn't say anything  but Henry and Sam looked really pissed. \n\nI don't know what exactly happened but Jake said something to Sam which made Henry extremely mad. He stood up and said he won't stay here and let his son be bullied and said either Jake has to go or they will. Mia said if we ask Jake to go she will go with him. \n\nI told Henry that I'm sorry but I'm not kicking Jake and Mia out so if he really can't stay then he needs to be the one to leave. \n\nHe called me an asshole and took Sam and left \n\nWe haven't talked since then and he is expecting an apology\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. But honestly I'd be having a talk with Ethan to make sure nothing's going on between Mia and Jake.", "NTA. Henry put out an ultimatum, and you called him on it. It sounds like someone should have checked the rude behavior, but there probably could have been a better way to resolve things other than saying, \"Either they leave or we will leave!!\"", "This is just how he is and he will be a part of our family soon. kicking him out is not going to help him", "He is going to be my grandson too. Sure I don't feel the same way about him that I feel about Sam or Mia but he never had a family and all they wanted was to show him how a \"normal family\" looks like. I don't think kicking him out would help him", "He has consequences. Ethan just made it clear the it's not my job to decide what those consequences are and let us know what we should expect", "No? He chose to give me an ultimatum", "Mia is nice to him and he is nice to Mia\n\nIt doesn't need a genius in order to find out what he needs in order to get adjusted", "I don't know. Only Jake Mia Henry snd Sam heard him. The first 2 claim he didn't say anything, the other 2 aren't talking to me", "He is nice to Mia\n\nWho is Ben?", "OP made it clear nothing was going to be done about it. She agreed no one would do anything even before it started. Even in the comments she's saying \"that's just how he is.\" Henry did the only thing he could do in that situation.", "Making excuses for him and letting him get away with shit isn't going to help him either. Your son and grandson are already part of the family, you didn't have a problem kicking them out.", "But you are on a fast track to lose the rest of your family by allowing someone to be abusive.\n\nYou are allowing  bad behaviour with no consequences.\n\nI would've walked away with no hesitation and I wouldn't come back knowing that you  would allow others to be abused by excusing their behaviour", "Saying 'this is just how he is' is the #1 classic abuser/narcissist apologist excuse.  He's been abused so he is very much at risk of becoming an abuser himself, and it is the duty of the adults in his life to pull him away from the abuser and ***teach him healthy boundaries and proper interactions***. Right now you, your son and his fiancée are failing him and the rest of your family by using the abuse experienced as an excuse rather than an explanation. TELL. HIM. OFF. AND. CORRECT. HIM.  He's going to learn that you will accept rudeness and will escalate, possibly to abuse. Now is the time to draw a line, not 10 years in the future when he hits you or your son.\n\nIf you want to lose a son and grandson in favour of someone who isn't yet part of the family, then you're right on track. And yes, YTA. For failing to stand up for your family; and for failing to see that this isn't an 'aww shucks he's just like that' situation but an 'oh god this kid needs to be reined in' situation. \n\nAbuse is tragic and it ruins lives. But you're allowing it to fester and are looking the other way while it ruins more relationships. TELL. THE. BOY. OFF. I guarantee you that you won't break him in doing so.", "And how is kicking out the other members of your family who stood up for themselves going to help him or the overall family bonds? YTA", "Oh so now you make excuses for his behavior? He’s never gonna change so everyone has to deal with It? Grow up. The world doesn’t work like that. I’d go NC If i we’re them.", "And tell me exactly what good is letting him stay going to  do?", "But it will imply to your other grandson that his feelings don't matter because you've replaced him with a bully. Jake did something wrong and should be punished or he will never learn the correct way to behave. Being a victim of abuse doesn't give you the right to be an AH to others, that is what therapy is for.", "So, in the future when his girlfriend confides that he's being abusive to her are they going to tell her: 'that's just how he is, leaving him is not going to help him.' ? Ignoring his behavior isn't going to help him either, and subjecting one of your grandchildren to a Christmas full of abuse without handing out consequences for shitty behavior is sending a clear message to both of them. And that message isn't good.", " but it sure helps everyone else. Also it actually might help him realize there are consequences to his actions.", "Normal families don’t sit around twiddling their thumbs while bullies terrorize others at the dinner table. Normal healthy families would make it clear we treat each other respectfully and politely", "\n\n> but he never had a family and all they wanted was to show him how a \"normal family\" looks like. \n\nOh look, yet another excuse. Also, is this *really* what you want your future grandson to think a \"normal family\" looks like? They will just let someone be abusive and when people have a problem with the abuse they will be told to leave if they don't like it.", "This is where you are wrong.\n\nGive this kid a cause to change his attitude and behavior *as soon as possible*, or he likely won't. People are only understanding of \"he had a rough upbringing\" for so long. Excusing a 16-year-old is easier than a 26-year-old, and unless he learns social behavior he is going to be *very* lonely.\n\nKicking him out, *with a clear explanation as to what he did wrong*, will absolutely help him.", "*Sure I don’t feel the same way about him that I feel about Sam or Mia* no you obviously care more for him. YTA and will be lucky if the other grandson ever talks to you again for letting him get bullied in your own home from a stranger that regardless if he will eventually be family or not. The only thing you are showing the bully is that it is ok to treat other people like his dad treated him.", "The point is you should have responded that you will not agree to allow Jake to be rude in your home. You should have told your son that a possible consequence is they will be asked to leave. \n\nAgain, I point out that we all know Ethan is your favorite. You don’t even seem interested in what Jake was saying to Sam. You keep telling people that Henry is the one who decided to leave so it isn’t on you, but reread your post title. “AITA for telling my son and grandson they should leave?”", "Well, then Ethan is an enabler, and an asshole, too.\n\nJust agreeing to dance to the pipe of an asshole does not absolve you from being an asshole.", "If it’s you house, you absolutely have the right to choose the consequence, which is to ask them to leave. So what if Mia leaves too? That’s her choice. You chose to allow your grandson to be bullied. You alienated your son and grandson to appease your DIL and her bully son.", "It is your home,  you have absolute say over who stays and who goes. You chose poorly.", "Good for him, and good for him protecting his child. It’s a shame that you didn’t protect your grandchild from a bully.", "Hardly a 'choice' when his son is being abused. He did what you should have done and stuck up for the victim", "Somebody had to lay the smack down.  That should have been the patriarch of the family.  But you dropped the ball.  Your son's ultimatum was simply trying to prompt you to do what you should have done already.  But you didn't take the hint.  So you screwed up, twice.", "He's just asking you to do the right thing. You're clearly not interested in learning from this. If I was your son, I also would not speak to you. I also had a grandmother like you and went no contact at 18. Enjoy that. It's certainly predestined.", "You can start with not accepting \"he had a rough past, so he is a bit of an asshole to everyone, just ignore it\"\n\nI had a rough past, and I was a bit of an asshole to everyone, but thankfully it wasn't accepted. I had cause to be a better person, and with some hard work and introspection, I'm now much less of an asshole.\n\nIf I had just been enabled by everyone, I'd likely be a much bigger asshole **and never done anything about it.**\n\nStill YTA. More so for doubling down.", "He is nice to Mia by bullying her inlaws and alienating her family?? That's how he's nice to her? Do you hear yourself??", "It doesn't need you or your family bending over, jesus grow a spine, you're not only an asshole playing favourites but now you are doubling down when people call you out \"genius\"", "Wanna know how to get badly behaved children and teenagers to be nice to you?\n\nHAVE IRONCLAD BOUNDARIES. \n\nI have some of the worst behaved students at my school stop and give me hugs because they know I love them enough to stand up to them.", "So what does that say about your struggle since you missed the mark completely?", "You do understand that you’ll probably lose your son and grandson over this, especially if you allow this sort of thing to continue in your home? It’s ok to habe boundaries in your home, but apparently you don’t. \n\nIt sounds like your soon to be DIL’s son is growing up to be verbally abusive to others. That’s ok with you? It’s ok with you to sit by and allow others to be abused in your home? And then you kick the victim, your own grandson, out??\n\nIf my child were being abused by anyone anywhere, I would remove my child and not allow my child back into that situation.", "Meant Samuel. Sorry, knew it was something Old Testamenty.\n\n\nPoint is, if Jake was being rude to everybody and cruel to any of your grandkids, I don’t see why you would make the non-rude people on the receiving end of his toxicity leave.", "Yeah I think the pre-arrangement between Ethan and OP set this whole thing up for failure since everybody’s hands were tied and there was no way for a healthy anything to unfold…\n\nEthan had already got a side deal with OP to turn a blind eye. It’s not clear whether he had given Henry and Samual any warning or gotten their pre-agreement to just quietly take it.", "I'm not making excuses for him I just don't think it's my job to punish him.\n\nI didn't kick them out they said they wanted to leave and I chose to let them", "He got plenty of consequences from her mom snd stepdad", "☝️☝️☝️", "I doubt that “smack down” is the right attitude to any of this, but it does seem like Ethan and OP basically prearranged not to do *anything* about Jake’s terrible behavior, and then they let Henry and his kid just walk unsuspecting into this mess", "Doubling? More like x1000000. Idk why op wrote in when they won’t take the rulings haha.", "\"That's just how he is\"\n\n\"His dad was abusive and he had a hard life, so he might say rude things.\"\n\nThese **are** excuses. \n\n>I didn't kick them out they said they wanted to leave and I chose to let them\n\nThat's what you tell yourself to feel better about what you did. You absolutely kicked them out by refusing to do anything about the situation. Henry needed to get his son out of the toxic environment, which required one of them to leave. You chose for the person being bullied to leave. That's on you.", "So you're sending Jake a message it's OK to be as abusive as his father?  I don't think that's going to help anyone, especially Jake.", "Refusing to allow him into your home and bully your family isn't ounishing him that's natural consequences.\n\nHe's being rewarded by you all for being an abuser.", "“I chose to let them”\n\nI mean…you didn’t have a choice. If they wanted to leave that’s their right. YTA. I grew up on an abusive home and it made me way more empathetic, not cruel. You are allowing your loved ones to be abused in your home and excusing it. \n\nIs Mia the golden grandchild? It seemed like her threatening to leave is what made you choose the bully.", "What a way to say Ethan is the favorite without saying Ethan is the favorite. \n\nYTA", "Hahahaha, sure, technically you are correct. \n\nYou gave them the choice:\n\n- either suck up the bulling from my other guests while i sit here on my ass and watch you beeing treated like shit by one of them and don't do anything about it\n- or leave\n\nGood thing for you is, you started with 2 grandkids and now you ended up with two grandkids, only that now one of them is extremly rude. Oh and you lost a son. But whatever, right? \n\nYTA", "This was information was left out of the original post although I’m not sure if it would change my vote. Although, he should have had consequences, the fact that he was not corrected or acknowledged in public is also a factor. Some people will say worse and worse things if they are trying to get attention (needs aren’t being met so they say something more shocking and more shocking until acknowledged).", "What specific consequences? Did he have to apologize to his victim(s)?", "Oh boy. “This is just how he is.” Classic enablement of bullies.", "Ps.  My brother was abusive and everyone ignored his behavior at my expense.  Took years of therapy to undo the damage.  It's your home, you set the rules or someone suffers.  YTA."]}