{"id": 9386, "submission_id": "10wbgg7", "title": "WIBTA for denying an employee time off?", "selftext": "My subordinate, \"Jane\", has been taking a lot of time recently to go with her daughter to medical appointments. Her daughter is 2 years old.  Her spouse doesn't take the time because he makes more, so they prioritize his job, and even though he's a lawyer who could work from home he's distracted by the kids if he does that.\n\nSubordinate \"Mary\" has been responsible for picking up Jane's slack when she's out or just distracted and recently Mary expressed frustration and feelings of burnout because Jane is so flaky lately. We are super short-handed so it's not an option to use someone else. \n\nJane requested a week off from work because her daughter will be getting glasses for the first time.  There's no way to grant that without severely overloading Mary again and my thought is to deny Jane's request with a compromise she can have the actual day of the optometrist off.  I figure her husband can watch their daughter and call if there's an issue with the glasses. It's not like glasses are a major surgery and Jane definitely won't have a doctor's note for FMLA saying that sitting a home for a week is necessary", "created_utc": 1675800010, "permalink": "/r/AmItheAsshole/comments/10wbgg7/wibta_for_denying_an_employee_time_off/", "score": 51, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be TA for not letting Jane force Mary to cover her shift/duties because she wants to be home for a week after her daughter gets glasses\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Seems more like an issue for an HR department.  If you don't have that, look up any relevant policies you have or the local labor laws.\n\nThis isn't necessarily an AITA question.", "INFO:\n\n1- When you say \" a lot of time recently\" for medical appointments, what exactly does that mean? Missing a shift once or twice a week? Leaving early every afternoon? etc\n\n2- Is there more to the glasses appointment than we know about? For example, is this a time of trying them out to see if they're the correct prescription/fit and making adjustments to them accordingly over a period of a few days? My kid didn't get glasses until elementary school, so I'm not familiar with the process for toddlers\n\nETA: Forgot to add sorry, but YWBTA. Mary feeling overworked is on the managers for failing to schedule enough people, not on the employees who need to take time off for life. It's not your business what people do when they're not at work.  My info request was more meant to make you think about the way you see this issue.", "You need to have a time off policy and stick to it equally for everyone.\n\nIf you have time off available and no one else is already off, great, time approved.  \n\nIf you’re out of time off, and/or too many others are already scheduled off, sorry, request denied.\n\nWhy she wants to take off or what her husband does is irrelevant.  Don’t get involved with those details.", "NTA:  But hey parents with toddlers with glasses let me know if I'm wrong. \n\nNo one needs a week of because their child is getting glasses", "Info: The only question that matters is, does Jane have the hours to take the week off? \n\nIt's not her problem that you're short-staffed. It's not her problem that this means *you* are overworking Mary. It rather sounds like there should be more people hired to fix this issue. It's a management issue. \n\nAlso, taking time off for medical reasons is not being flaky. If my two year old needed frequent medical attention I'd be taking that time off as well. Now I don't know if you need a week for glasses, but I get the feeling that it's not all that's going on.", "Why would she need a whole week off? \n\nNTA to deny the time but E S H here because Jane is taking advantage and Mary is getting the short end of the stick (she's not the A H ) but at no point does it seem like you have spoken to Jane or redistributed work in a more fair way. Why don't you bear some of that load? or Why not have Jane do more when she is and give Mary less work? There is a way to make this more fair to Mary without her being burned out.", "INFO: do you have hiring power? Because at the end of the day, the issue is that the business \"super short-handed.\" If you had enough staff, this wouldn't overburden a single person. \n\nI don't know what challenges her 2 year old may have. It sounds like she has a *lot* of appointments and may have some other things going on, so I'm not going to judge her wanting time off to take care of her kid.", "First, strike Jane's home-life from your mind. She could be a single mother or have a dozen hostages helping her with childcare, but it doesn't matter. The focus is on her worklife balance, and your role in that as her superior. \n\nIf Jane has so much responsibility that the system begins to fail when she is absent, then you are understaffed. No one person should have the ability to cause another to be overworked. This is a failure point of one, far too vulnerable. \n\nEither the work / product is highly important and sensitive to disruption, in which case Mary should not be expected to compensate alone, or it is not highly important or sensitive, in which case Mary shouldn't have to \"pick up the slack.\"\n\nIf the work is highly important, then Jane should operate within the limits of her PTO as outlined in her handbook. As long as the rules are followed, and you are operating in good faith, you are NTA. If the works is not highly important, then there's no reason not to be maximally lenient with Jane and YWBTA for unnecessarily enforcing a rule which harms her disproportionately.\n\nEither way, it sounds like the team needs additional staff so as not to be vulnerable to predictable and reasonable disruption. If those with the decision to bring on more staff are unwilling, then the Jane/Mary situation should be leveraged as severely as possible to highlight the point.", "Info: Is this vacation time she's using? Unpaid time off? Paid sick days (unlimited or limited number?) I feel like that's important", "Crazy, but not unexpected that all these comments are jumping down your throat. \n\nWho the actual fuck needs a WEEK off for glasses???  Jane is skipping out on work and making excuses. I would have a conversation with her and let her know that she can't keep doing this and needs to start finding alternative plans. Most jobs anyways have a limit to PTO and it's clearly affecting the company \n\nOP, NTA (although stop using the word \"subordinate\")", "Is she using PTO for this time off, or is she just requesting the week off?", "When she quits, who will pick up your workload? You should push for more resources although this will be challenging. For some reason, employers don't think it is acceptable to consider annual leave, sickness and emergencies when working out the resources required.", "Info: Is Jane going over her allotted time off? If so, then an empathetic to Jane N T A. But if she hasn't gone over her time off, then Y T A because what she does during her time off is technically not your business.", "INFO:\n\n- How much time off has she taken and how much has others, including you taken off?", "YTA if she is entitled to time off you better be giving her that time off or else you open yourself to a law suit, but if she continuously takes signifigant time off it is your right as an employer to fire and replace her", "Depends. Does Jane still has enough days in her holiday entitlement that would allow a week off? It’s up to her what she does with them, and as long as Mary is in the office I don’t see why you’d say no. Presumably when Mary goes off on holiday, Jane will cover.", "Maybe I’m missing something but I feel like 1 day off is more than enough for getting glasses. Assuming there’s no associated surgery or medical procedure or something.\n\nEspecially in consideration of Mary, I say NAH unless Jane produces some evidence illustrating why a full week is needed. She’s allowed to ask, but you have multiple factors to consider. \n\nBut yeah please stop calling them subordinates.", "Based on the title, I was going to say YTA. After reading it, while I think the word subordinate is a but condescending, I don't think YTA. A week off for glasses seems extreme. I got glasses very young I don't think there was ever some sort of buffer period where my parents were around me 24/7 while I got used to them. That's the only stretch I could even think of as to why someone could possibly request that much time off.", "If Mary has expressed concern about the need to pick up the slack, you would certainly be TA if that did not factor in your decision. Sounds like you are concerned for her wellbeing, and the wider team dynamic in general.\n\nWith the reason you gave for the request off, NTA. Time for the husband to start chipping in.", "Need more info. Does your company have a PTO policy? Is she going over it? or still is within it? Have you talked to HR?", "NTA. If you can't let her take that much time off, just tell her it's not possible and if she needs more flexibility, she should get another job (or can she go to part time?). It frankly sounds like she's taking advantage.", "What the husband does or doesn't do is immaterial and, frankly, none of your business. Also: working from home as an attorney is different from other jobs. You can't just drop off a zoom conference with the court because the toddler needs attention.\n\nIf Jane has the vacation time, she should be allowed to take it.\n\nIf she doesn't - if she's used it all up, or if she's asking for extra time to deal with all these medical issues - it would be good of you to try and come up with a solution (like having her take one day, or allowing her to work from home for a time). But you also need to come up with some way to make this right for Mary.\n\nYWBTA for flatly denying the request, but there are lots of potential compromises here.", "If she has the pto then yta. If not then Nta. If mary is overworked then that’s on you, not Jane.", "ESH for assuming a lawyer can just work from home.   Also assuming her husband can just take off.  Lawyers often have meetings they can't just change around last minute\n\nIs Jane using time off as she is given?  Is there a way she can work earlier or later to make up for time off?  If she's going over a paid time off policy, then yeah maybe it's time to review the paid time off policy and stick to it.", "INFO: how many hours a week is Jane responsible for working?", "You’re not required to approve time off, and the business needs come before the employees requests. Also ain’t no way a glasses appointment takes a week, but why did she feel the need to explain why she was requesting the time off. It isn’t a requirement to specify reason for the time off request as far as I’m aware. People always feel the need to overshare details when calling off and taking time off. Is she calling out the proper way with enough notice? If not you need to start documenting and holding her accountable. But you can’t just deny he her time off indefinitely. When the other employee takes time off who picks up the slack? The other employee also has the ability to use their time off and sick days.", "INFO: Is Jane taking PTO for these appointments and does she have the time available to cover the week off that she wants?", "NTA... I worked in optical for 10 years. In that time, I have \\*never\\* met a patient who needed more than a day or two off, and in those cases, it was because they needed surgery. More often, just getting an eye exam, and picking out frames would be a half day affair, at worst.", "INFO - Does she have enough PTO days? \nDenying it for the reasons you provided would make you an AH. Doesn't matter if she needs time off to watch paint dry. Her reasons are not relevant if she is entitled to have a certain amount of time off. I would assume Mary gets vacation too and this lady covers for her when she is gone.", "YTA.  If one person missing work \"severely\" overloads another employee that means you have not hired enough people.", "nta\n\nwho the hell takes a whole week off just because your child gets glasses? a day? sure, a week? no way.\n\njust makes me think whether she even wants to work at all and is using her kid as excuse to get time off. she doesnt sound like a desirable employee at all.", "YTA -\n\nAs an employer, your employees don't owe you any explanation for why they are taking time off other than it's personal or medical or vacation or whatever. You are entitled to categories.\n\nYou also don't get to decide what defines those categories - that is for HR, the doctor, and the state/federal government.\n\nIf you are are short staffed you do not get to short change your employees rights.\n\n&#x200B;\n\nHire more workers.", "A supervisor or manager has the right to decline time off requests if there isn't coverage.  Check with HR to see what the policies are.\n\n\nESH because it's none of your business why she wants to use her PTO. She could be watching her favorite soap opera.\n\n\nNone of your business.  If there is only one back up, then you need to hire more staff. If she is going over her vacation time, then you need to discuss that.\n\n\nMary shouldn't be overworked just because the company is too lazy to find enough employees.  One person being off shouldn't be this hard to figure out.", "Talk to HR.  We're a rather nasty lot on AitA.", "I’ve never heard of anyone ever taking time off because their child is getting glasses. That’s literally a 1 or 2 hour outing depending on how many tests are done by the optometrist. I get the sense something else is going on here and more info is needed.", "How long have you been her boss for? I ask because 3 weeks ago you mentioned you had not long moved jobs.", "INFO: what is your leave policy?", "All these replies from the commies as expected aside, there isn't enough info here.\n\nFirst, Jane's home life has nothing to do with this. I don't care if her husband was Elon Musk. She works for you and that's all that matters. If she has PTO, you should probably grant it and tell Mary she has PTO too and you'd hope that she would want hers to be granted as well.\n\nIf she doesn't and she is always calling in late and leaving early and taking time off, maybe it's time for a conversation about moving her to part-ish time. Let her know you see her struggling and the company struggling and you want to make things right for both and ask her if there is a better schedule that has less hours where she can be more reliable and less stressed at work. Then you'll need to hire someone or pick up the slack yourself to make things work better.", "I read \"my subordinate\" and Stopped reading, ye you would be.", "YTA, for a few reasons.\n\n1. Be a little more respectful of your employees, lose the term \"subordinate\" and don't ever use it again.\n2. If your employee has the time available, how it's used is none of your business.  \n3. If Mary will be overloaded because Jane takes time off, you are operating too lean and you either need to pick up some of the slack yourself or hire another person.", "NTA Mary doesn’t deserve to suffer at work because of someone else’s personal home life choices, it’s extremely unprofessional", "NTA  wow Jane is really taking advantage of medical leave.  I would not grant that time and I would inform her that she's on shaky ground with her job.", "YTA. You’re basing your logic on a lot of assumptions for Jane. You have no idea about the husbands involvement.", "YTA.\n\nWhy are you so understaffed that one person needing to miss shifts is overloading other employees? Why aren’t you advocating for more employees instead of overloading others? Why aren’t YOU helping Mary with the workload?", "YTA if you deny it without having a conversation with her about the big picture. About things like what work needs to be done, about her PTO, about FMLA, and so on.", "YTA. This is why my company instituted a policy where you don't give a reason for requesting time off. What you think is a reasonable reason to take a day off may be different from others. She has time to take, she can use it. That being said, you do have to take the needs of your business into consideration when approving requests. People are inevitably going to take a week's vacation so what are your plans for coverage? It sounds like you are just deciding to not do anything about it and just plan to heap all Jane's work on Mary. Not cool.", "Deny it. 1 wk for glasses is stupid. Her coworker shouldn't have to suffer", "YTA  \n\n\nif you are understaffed hire more people instead of denying people the freedom of taking time off", "Sorry YTA. As a manager, you should know that your employees are allowed to use their time off. Yes, you need to consider the business requirements (for example, peak times, other leave requests, etc) but she does not need to tell you what the leave is for. She gave you that information as a courtesy.\nAdditionally, what happens when Mary gets time off? Does the additional workload just go to Jane? If so, then it’s just part of the deal, if not then why is that? \nHave you actually spoken to Jane about her recent absences and the effects on the team?", "YTA because you shouldn’t be short staffed in a situation where one of your employees needs time off. Also if they are prioritizing the spouses job because he earns more you are probably paying low. So yes, YTA.", "YTA - you don’t have to overload Mary. You chose to. YOU could also help out and pick up the slack.", "YTA you don’t get to say what their household dynamic should be, and you don’t get to deem what is important to her and her family. When I put my time request in, it’s me telling them I will NOT be in so you’re better off just accepting it. My life comes first, good for Jane! You need to do better as a boss. Maybe speak to her in private about the matter before just outright denying it.", "YTA. As an employer it’s your job to be able to handle staff not being there for some time without causing a burnout for other colleagues. What would you do if Jane fell ill and simply *couldnt* work? That’s on Mary again? \nPeople need to be able to take their vacation days. And it’s your job to plan ahead so you can responsibly handle being a staff member short.\n\nMary is overworked because of your inability to properly staff the place. Not because Jane takes time off that she’s entitled to.", "Of course YTA. Jane is--and should be--entitled to any time off she's earned.\n\nIf your workload is so stacked to the brim that it doesn't accommodate for any employee PTO, then that's a failure of planning on your part.", "YTA for referring to them as subordinates. I wouldn’t want to work for you 🙄 however a week for glasses is extremely excessive", "YTA, if one person missing work means one other person gets stuck with double duties instead of responsibilities being shared around, you don't have enough staff. It shouldn't be on Mary alone to cover for Jane.", "Yta. Hire more people or change the deadlines to work with both employees workload (esp janes). \n\nHer personal life decisions are not of concern.   Moms and dads have a lot to juggle but should be able to figure out flexibility between meeting work obligations and home obligations.  It may mean working more flexible hours to manage the work as compared to transferring work to another employee to cover.  What will you do when Mary inevitably quits?", "NTA,", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy subordinate, \"Jane\", has been taking a lot of time recently to go with her daughter to medical appointments. Her daughter is 2 years old.  Her spouse doesn't take the time because he makes more, so they prioritize his job, and even though he's a lawyer who could work from home he's distracted by the kids if he does that.\n\nSubordinate \"Mary\" has been responsible for picking up Jane's slack when she's out or just distracted and recently Mary expressed frustration and feelings of burnout because Jane is so flaky lately. We are super short-handed so it's not an option to use someone else. \n\nJane requested a week off from work because her daughter will be getting glasses for the first time.  There's no way to grant that without severely overloading Mary again and my thought is to deny Jane's request with a compromise she can have the actual day of the optometrist off.  I figure her husband can watch their daughter and call if there's an issue with the glasses. It's not like glasses are a major surgery and Jane definitely won't have a doctor's note for FMLA saying that sitting a home for a week is necessary\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "This is above Reddit's paygrade. You need to consult with HR or whoever handles the legalities of human resources to ensure you aren't overstepping laws or policies related to PTO, and also hire more staff so that \"Mary\" isn't constantly overloaded during these times (because at some point she will get too tired and stressed and look elsewhere for employment and then you'll really be shorthanded).", "Oh honey, you got a big storm coming", "INFO: Do you have the power to hire additional staff? Because if so...", "I feel like… did my boss write this? At my job, almost the same situation. I am the Mary and it is killing me. NTA", "I’m going against the grain here and saying NTA. \n\nThere’s a business to run and employees are expected to be there for that to happen. Sounds like you need to sit down with Jane and tell her that you are counting on her to work when she’s scheduled and if she can’t do that then you need to considering finding someone who can.", "Depends if Jane has the PTO to cover the time off.  If she does, it is none of the company's business what she does or how she uses it.  Also, it kind of sounds like the department may not be properly staffed.\n\nThat said, perhaps a talk with Jane about her hours and time is in order if it is affecting her performance.\n\nThis isn't cut and dry but YTA if she has earned the time off.", "YTA although I agree, that a week off for glasses is insane, it doesn’t matter, if she has sick time to use she doesn’t need to justify using it. That’s one of her benefits from working, so why should she feel bed for using one of her benefits? Would you ever feel bad about cashing your paycheck? Sick leave is just as much a benefit you are entitled to use as your paycheck is. You are the AH for not hiring enough people to cover people’s sick time.", "YTA.\n\nIf Jane has leave time, she should be able to use it however she feels.  If she cannot handle her own workload that's a separate issue and should be addressed as such.\n\nIt is odd that she needs a week off for glasses, but you said the child is 2?  It's possible there is more than just one appointment.  It's also possible that Jane is overwhelmed with motherhood and working full time.\n\nIt is also possible that she's just one of those people who simply doesn't want to work, and who is using all of this as an excuse to get out of work.  You'll never know unless you try out some options other than \"dump everything on Mary.\"\n\nINFO: Is this a white collar job? Have you communicated with Jane on options? Are there deliverables that are due at certain times?  What is the push to put work on Mary?  Is it because things are due at a certain time?  If so, is there any way that Jane can do some teleworking?\n\nYou seem to be viewing this in a very narrow-minded way.  You can only see one solution.  \n\n\nEDIT: typo.", "When my 18 no old got glasses the whole thing took an hour or so. Really not a big deal (that was a separate appointment from when we went to the eye doctor to get the diagnosis and prescription).", "From the fact that she’s regularly taking time off for appointments for the toddler, sounds like the kid might have more going on, health wise? In which case, it might not just be as simple as “small child gets glasses.”", "No one needs to tell anyone what valid use of one's PTO is.", "Yeah, if she’s salary and has PTO you have to let her use it, it’s not her fault if you’re understaffed without her during that time.\n\nHowever if she is hourly and just asking for unpaid time off… *an entire week off of work* to get her daughter’s glasses seems excessive. That seems like a task that would take maybe a day or two at the most? \n\nIf it’s the latter and she’s an hourly employee who is no longer covering her share of the hours and causing strain on your other employees, a request for an entire week off would have me weighing the pros and cons of just bumping her down to part time or letting her go and finding someone else who wants to work regular hours. \n\nMaybe a part time or flex role somewhere else is more appropriate for her daughter’s medical needs.", "This. This is the only right question to be asked.", "Have my upvote for the “dozen hostages helping with childcare.” (Also your sensible comment, but mostly for making me laugh).", "If my job contract states that I have so much PTO that I am entitled to use, then I will use it.\n\nI don't care if I am sitting and watching paint dry on a wall, shitty hiring practices is not my fault.", "Came here to say this.", "I don’t have kids so idk, but I know small kids get those glasses that look like swim goggles- maybe it takes a week to convince them not to rip them off every 5 minutes?", "This. If she has the allocation and wants to use it, it ain’t your business what she uses it for. YTA. \n\nWho knows, you could even not be TA to Mary and pick up some of the additional slack if you’re so worried about her.", "Heck, I have a kid with glasses (got her first pair at 18 months) and I never took more than a few hours off. Glasses don’t require an entire day off. I would say if she is going over her PTO allotment you need to get her to fill out FMLA paperwork. If the doctor doesn’t recommend her taking a week off then she doesn’t get it.", "I think denying a request for a week off because a child is getting glasses is fair. I mean day one you get the glasses.......what's the other 4 days for?", "Lawyers have a lot more flexibility than you think.", "Depends what country OP is in. Here you are entitled to the leave you have accrued but the employer can decide when you take it and rejecting a request because it will leave them short staffed is completely reasonable, as long as Jane is allowed to take the leave at some point during the holiday year.", "Did you miss the part where the kid is 2?", "She didn't say she is using PTO.  She said she is requesting a week off, pretty sure this is a relevant distinction.", "Im starting to get a good feeling that Jane doesnt want to disclose further information to her boss because lets face it hes already on Reddit posting about her. \n\nIm guessing that HR and the FMLA people know the actual situation.", "Was it really necessary to bring politics into it?  The rest of your points are good ones, but are marred by your interjection of politics.", "Exactly this. This needs to be the top comment. You don’t refer to your team members as “subordinates”. While technically correct, that's demeaning to both your employees and your organization.\n\nA football coach doesn’t call their team members “subordinates”. Neither should you OP. This says a lot about how you treat them.\n\nAnd if she has the PTO give her the damn time off. She doesn’t need to explain anything to you.", "You're assuming Jane hasn't straight up told him the husband won't take time off.", "Same. As the manager, are you doing anything to help Mary out while Jane is on PTO? When my staff are out for any given reason, I step in to pick up the slack.", "You don't have to give a reason for pto.  It doesn't matter what she is doing.  It is her time off.  She can watch paint dry if she wants.", "Many workplaces approve PTO only if business continuity is not adversely impacted. If Mary can't/won't cover for Jane, and Jane can't find a suitable backup, managers can (arguably: should) deny the request.", "You need to have enough employees so they can all take weeks off for foolish reasons?", "Because he does not have a job to do, is possibly picking up slack, or is experiencing a hefty workload?", "Does it says she's using her PTO?", "It's an FMLA so she needs documentation that this time off is necessary. Which it's not", "No.", "I wondered about that too... when I get glasses for myself or my teenaged kid, it's an appointment that takes maybe 30 minutes... but I don't know if the process is more complicated for a kid that little.", "If they have the vacation or personal days available to take off....then how they spend it is none of the bosses business.", "Vacation. You get to use your PTO. Why do people think that they have any right to know how PTO is used?", "It depends on the area of law and where they are in the hierarchy of their firm. Does a partner have some flexibility? Maybe. But a junior associate in a busy practice? They are at the beck and call of senior lawyers and are working all of the possible hours. \"No\" is not a permissible answer to \"Can you take on more work?\" \n\nSource: been there, worked those 80-hour weeks.", "Not sure how that matters.", "But you can't assume.  Maybe he has client meetings that day, or a partner meeting or a court case, or has to prepare for a case.  You can't ASSume that he can always just work from home and make any appointment.", "Still doesn't require a week off for glasses", "First, if there isn't pto. Technically, op can deny the request. Its just unpaid leave\n\n\nThe subordinate could be terminated.  I don't think op gave a great overview of the situation.  And every company has to provide some sort of benefits in regards to time off. If you continuesly miss work, they can be let go.", "Is it? Most people need to request the time off, even if it comes from their PTO allowance.", "You’re assuming that I’m assuming about an assumption!", "PTO is part of the package. If you can't let your people use their PTO, your business isn't very good .", "PTO and FMLA are two very different things", "Also, small businesses exist. The company I work employs two people including the owner. I have a lot of flexibility but I can’t take off work whenever I feel like it, I have to coordinate with my boss to make sure at least one of us can attend meetings and such. It was a mess when my dad and her mom died at almost the same time, but we made it work!", "If they have the PTO coming to them, you don't get to say what is foolish.", "No, you need enough employees so if one is not available workload can evenly distribute between the remaining ones. People can leave anytime and if that happening jeopardizes your company, you are not staffed correctly.", "OP wouldn't worry about saying no if she wasn't.", "If she has documentation and it meets the criteria than it does.\n\nNeither you nor her boss gets to decide what qualifies for FMLA.\n\n(Spoiler alert: caring for a family member does qualify. And you have no idea what else may be going on that she needs to care for this child with for a week. Maybe she doesn't want to disclose to her boss, considering he clearly came and posted on Reddit.)", "Where does it says she's using PTO?", "Yes, completely agree.  I think jusgement hinges on whether employee is using accumulated sick time/PTO, or just trying to take days off for whatever excuse she can find.  A week off for her child to get glasses is extremely excessive and makes me suspicious.", "But it's still not clear whether employee is actually using PTO, or is just taking advantage of an accommodating small business by taking a week off for a task that can be completed in less than a day.", "Hahaha indeed.", "This!!", "Agreed, everyone in here like \"send her across own to the HR building\". In a lot of small business the Owner is the scheduler and the HR department.", "I don't know why everyone in here is assuming she even has any. She's seems like she uses more than she has. I agree that if you have PTO you should be able to take it, but it doesn't mean taking a week of for you r kid getting glasses isn't foolish. And lets say she does have PTO but this week will uses it up, what is your answer next time when she needs it for some other thing?", "I think the opposite, if it was PTO there wouldn't be a question. \n\nHe's worried he's a bad guy for telling someone with a sick child they can't take any more days off because they lack PTO.  \n\nThat's why he feel like an AH because he wish he he could give her the day off but she used so many days already that it's just not feasible. \n\nSee how he can worry about it without it being about her using PTO", "Of course he would. If he grants her unpaid leave then Mary is overworked and burnt out. That’s an issue.", "Well yeah caring for a family member qualifies...that's the whole point of an FMLA lol fucking stupid \n\nWatching your kid wear glasses for a week isn't gonna get approved but if it's really a med thing then Jane should have no problem at all getting documentation to take the whole week off! I think OP's attempt to compromise is completely reasonable and expected. It sounds like Jane is just taking advantage", "Where does it say she isn't?", "For sure. I do think it's none of ops business why, though. The only concern is coverage, and if they have the time accumulated. You can be denied if there isn't coverage.  Also, if you get denied and you take time anyway, you could also be terminated.\n\n\nThe employee sounds flaky.  But I also would like to know what other medical leave they took. Op makes it sound casual. What if there was a cancer diagnosis or something to that affect. Op isn't exactly being 100 percent forth coming.", "Ahh you’re right, just re-read the bit about not having a doctor’s note at the end, which she wouldn’t need if it were a PTO request.", "Hahaha", "Easy, if she didn't have any PTO, he wouldn't worry about being TA. \n\nUse a little common sense", "Then he is using this subreddit to make himself feel better.", "You're the one saying she is as if it's a fact.", "Isn't that what everyone here does? \n\nThey feel they did nothing wrong and come here to see if they are right.......to feel better about themselves.", "He wouldn't worry about being TA of she weren't.", "You already said that and I responded. \n\n\nStill disagree with you though. \n\nLife has more than one situation that can lead people to the same results . It's not just the one you think", "He'd also answer a question or two. He hasn't", "Nope also again not every situation here is black and white. \n\nA lot of people on reddit post on their lunch break and come back to the results later. Why not just admit you may be wrong and you're just guessing here lol"]}