{"id": 9419, "submission_id": "10wenb8", "title": "AITA Girlfriend keeps taking Oreos and putting them in pickle jar", "selftext": "I (22m) have been with my girlfriend (32f) for about 6 months now, and at the beginning of our relationship I noticed when making us sandwiches that her pickle jar had what looked like, copious amounts of pepper? Didn’t think much of it till we moved in together a week ago, and there were OREOS IN MY PICKLE JAR!!! I wouldn’t be mad if she had her own separate jar of pickles for this but she’s ruined the household pickles!!! I told her that was disgusting and she literally didn’t think about anybody else who may have wanted a regular damn pickle. She claims it’s ok because I never noticed until I actually saw it. I don’t want soggy Oreos in my pickles and now she’s refusing to speak to me because she says I overreacted by telling her she wasn’t considerate, AITA\n\nEdit: to answer some questions, I bought all the groceries, and even told her I’d get an extra jar if she requested, she thinks I’m overreacting since I didn’t notice until I actually SAW the Oreos. As to why she does it, she said she just “likes the sweet, salty, & sour mixture” which I get but like maybe use a Tupperware dish and serve it as you go", "created_utc": 1675807532, "permalink": "/r/AmItheAsshole/comments/10wenb8/aita_girlfriend_keeps_taking_oreos_and_putting/", "score": 147, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Should I just break up with her while we’re not that deep in, or am I genuinely being the asshole cause I didn’t notice til I saw?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Congrats on the new baby, OP!!", "NTA\n\nNot saying she is a serial killer.  But I am saying this WOULD completely fit into a serial killer's profile.\n\nAlso, just buy 2 pickle jars.  Label them \"normal people pickles\" and \"other pickles\"\n\nAnd if she is hung up on you calling her inconsiderate butt inconsiderate, ask her to define the word.  I'm thinking she doesn't know what it means,  just that it's \"bad\". Lol", "…does she eat the Oreos?", "INFO - Why?", "The fuck did I just read?", "Well this is an interesting scenario…\nINFO: Who is buying the pickles? Who’s money is this coming out of?\n\nEdit: Well that is a 100% NTA. Your money, your pickles, and your oreo-pickle-loving-girlfriend…hopefully you can get out of this pickle :P", "This is so confusing. Why is she making pickeled oreo’s? Until we have an answer to that i can not make a judgement.", "NTA. Incidentally, your girlfriend is from a different planet.", "NTA, but what the heck. A week in and she is already ruining food… this is going to go south quicker than water in the Mississippi River.", "She's a fucking psycho.\n\nGet out now.", "No one's going to mention that insane age gap?? Get out OP", "NTA but girlfriend may legitimately be a serial killer.", "NTA, especially since she eats the pickled Oreos 😭\n\nYour girlfriend may be a serial killer, or an alien in a human skin suit. Please watch your back.", "NTA - You are not the a**hole in this situation. Your girlfriend was wrong to put Oreos in the pickle jar without considering how it would affect you and other people in the household. It's understandable that you were upset and it's perfectly reasonable to express your feelings to her.", "The pickles on top of this unorthodox age gap is like 🚩", "From an outsider looking in, I'd say you dodged a bullet and all is well. I mean, if she were putting pickles in the oreo jar, I'd say run for the hills to be sure because that would just be weird.", "This is really not something worth arguing about. Just buy separate pickles, damn.", "NAH, but I'm seriously about to hurl from the idea of pickled Oreos.  I can't stand oreos, but love pickles.  Those poor pickles!", "NTA that is gross. If you're going to do something weird with food you don't then serve it to people without telling them. And get a separate jar. Icky", "nta but oh my god how did she even discover this", "…I am concerned…", "I have both Oreos and pickle juice and am wondering to what level I should believe this isn't to make me try it.", "I don't believe you\n\nThis is a made up story", "Sorry but that is gross. NTA-she claims it's ok but isn't buying the pickles???", "What....... What did I just read??", "NTA, but for the love of holy pickles, get her another jar of pickles without her having to ask you. Problem's solved.", "Who on this sweet green earth puts oreos in pickles? You're allowed to not want oreos in your pickles! If she wants them, she brings her own jar. NTA", "NTA.  Tell her to buy her own pickles and Oreos.", "The real question is how did she come up with this “mix” and just how many other idiosyncrasies does she have? Have you met her family? Extended family? Do they eat slugs for breakfast? Keep bodies buried in the basement or maybe the backyard? These are the things you should be concerned about.", "Um? She might be pregnant OP. NAH.", "Is she from the Delta? They gave us Kool-ickles, and this Oreo situation seems related. \n\nNTA, but y’all just need separate jars of pickles. \n\n(Koolickles: https://www.seriouseats.com/how-to-make-koolickles-kool-aid-pickles-memphis-tennessee)", "You need to RUN\n\nAlso NTA", "It’s just pickles …. Buy another jar…", "YTA for refusing to try pickled Oreos. \nr/brandnewsentence", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (22m) have been with my girlfriend (32f) for about 6 months now, and at the beginning of our relationship I noticed when making us sandwiches that her pickle jar had what looked like, copious amounts of pepper? Didn’t think much of it till we moved in together a week ago, and there were OREOS IN MY PICKLE JAR!!! I wouldn’t be mad if she had her own separate jar of pickles for this but she’s ruined the household pickles!!! I told her that was disgusting and she literally didn’t think about anybody else who may have wanted a regular damn pickle. She claims it’s ok because I never noticed until I actually saw it. I don’t want soggy Oreos in my pickles and now she’s refusing to speak to me because she says I overreacted by telling her she wasn’t considerate, AITA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "One does not mix pickles and Oreos. Oreos can be dunked in milk. Pickles can be put on sandwiches, hamburgers, barbecue, hey even saltine crackers with peanut butter on top with a sliced dill pickle is quite yummy on occasion but that is about the extent of it. No  Oreos in a pickle jar. I get nauseas just seeing those eggs in the pickle jar.", "What in the good lord. NTA. Let her buy her own jar of pickles and ban her from putting cookies in yours.", "My sister was almost disowned for putting pickles in the family jar of Jiff, NTA if she wants to have her vinegar crème cookies she can use her own jar.", "WTF kinda batshit crazy. \n\nNTA\n\nRun dude lol. This is whole different level insane", "nta. run.", "Dude you are not the AH at all. You’ve thought of so many compromises. Another jar for her, using a separate Tupperware for them…I tend to ride on the petty train regularly and being mad over someone not wanting my oreos in the pickles is even over the top for me lol", "NTA.  \nAnd it sounds like something a synth would do.", "NTA, how gross and weird!", "NTA. My man, I **love** pickles. Like, I eat them nearly every night straight up. I also like Oreos! But Oreos IN the pickle jar/bag/juice. Nope. Nope to the nopetty nope nope!", "I am going to have nightmares now.", "NTA. She’s an alien.", "Uh... NTA, but is she pregnant?", "That's what came to my mind when I saw the Oreos in the pickles. Our first child my wife was a fiend for pickles now she can't stand them lol", "Haha my first thought as well. OP better pick up some pregnancy tests while they’re getting more pickles lol", "This would be a mistake. He must label her jar “Serial killer pickles” so she knows he’s onto her.", "I love how this story starts out with little red flags before getting to the giant one.\n\nDecade + age gap 🚩\n\nMoving in together after a few months 🚩🚩\n\nOREOS IN THE PICKLE JAR 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "I’m leaning toward alien pretending to be human.", "Yes😭", "I would get sick watching her eat the Oreos. First of all, the look of it…then the smell…🤢🤢🤢😩😬🤢🤢", "This cracked me up!! 😂", "Am I the asshole cause I wanna try pickled oreos?", "You could say that this is a real pickle…", "The way OP has phrased it leads me to believe she's using oreos to season store bought pickles rather than making pickled oreos.", "Not sure I believe this tale, but I loved \"this is going to go south quicker than water in the Mississippi\"", "I don’t see how anyone could argue with this answer. \n\nNTA because it’s just soooo wrong and that she is insisting on doing it and refuses to get a second jar.", "Every person I've ever met who had a thing for pickle juice turned out to be a batshit crazy psycho person. \n\nRun.", "'may'", "Are you kidding? She was wrong to put then in the jar without considering how it would affect the people of Reddit.\n\nI may never sleep again.", "Yeah, he lost me when he said she eats the pickled Oreos. Just, how? Those things disintegrate in liquid pretty quickly.", "BARF", "Lol, I wasn’t a pickle girl but I loved olives.  Especially with rocky road ice cream.  I wouldn’t dream of eating this now😅", "My first thought, too.", "No, because then he’s going to be in the pickle jar next to the soggy Oreos", "this comment the one!! the age gap I was like I mean you never know but the relationship timeline has me so shooketh", "Look at his post history. His gf is his co-worker", "What's the purpose of the Oreos being in there. NTA btw", "Don’t the Oreos disintegrate in the pickle juice?", "How how HOW did you NOT know this before??????", "She's pregnant isn't she?", "AITA because I DONT want pickled oreos", "Apparently she exalts the Oreos 😭", "Why does that sound so much worse than her dipping the Oreos in the pickle juice.", "There’s no running now. She’s definitely a serial killer.", "This subreddit sees some crazy stories. But this one? May set a record for number of readers traumatized.", "And we all know which part of him…", "I’m not sure other than she likes the taste😭", "Dipping sounds preferable to marinating to me but I can't think of another way oreos would appear as a \"copious amount of pepper\" \n\nAs someone who doesn't eat pickles but makes them for other people, I don't yuck others yums but the fact that gf wont admit how unusual this is the most horrifying part to me.", "So you're dating someone significantly older, move in together after just a few months, and it turns out she's a psycho? \n\n\nRun. Learn from this and RUN.", "How long has she been doing this? Who taught her that this was okay?!", "Get another jar of pickles then?", "Serious question: how do you kiss her after learning this?", "Does she leave the Oreos in the jar? If so how long? Or just pulling out the jar and using it like a glass of milk to dip? Does she drink the Oreo crumble pickle juice when the jar is out of pickles?? I need answers man.\n\nOh and NTA, get a second dipping jar", "I maybe downvoted here, but when the gender gap is the opposite way, there at least 10 to 20 comments mentioning grooming and manipulation etc. Now 3 people mentioned it. OP, NTA also.", "Do it for Science.", "Omg I just *wooshed* right over the ages etc to get to the pickle travesty.\n\nOP run, you now know why every man 23 and up has noped out; *they saw the jar* 😨", "Damn, and I thought my lemon concentrate squeezed over ice cream was weird, but that's a whole new level of depraved.", "Honestly I forgot OP even existed once I got to the Oreos part. She must be stopped at all costs", "Tbh that doesn’t even sound bad"]}