{"id": 9456, "submission_id": "10x3y2e", "title": "AITA for letting my cousin ‘starve’?", "selftext": " A lot of emotions are overwhelming me right now so I'll try to keep it simple and to the point.\n\nMy(m27) cousin(f29), lets call her “Sue” is an ‘artist’. By that I mean she has a Bachelor in Fine Arts. Ever since high school her dream has been to become a world renowned artist akin to Picasso, Dali and whatnot. Honestly, she doesn’t have what it takes to be on that level. \n\nThing is she refuses to work in an industry where her skills would be needed, the most work she’s ever done is as a cashier in retail. Forever hoping she’s gonna “hit it big” with one of her artworks.\n\nNow I always felt bad for Sue. Her mother made a lot of poor financial decisions and her piece of shit father walked out. My parents, grandparents, aunts and uncles helped them out financially from time to time. But their attitude towards my aunt was always “she did it with her own hands”. \n\nOur family members were extremely pissed  that Sue chose to pursue fine arts. They all grew up during communism and see this sort of degree as a waste of time. They essentially stopped giving them any form of financial aid.\n\nI never stopped. About 5 years ago my friends and I got really interested in DnD. Essentially I talked to Sue and told her I'd give her a monthly sum of money and in exchange she’d draw stuff for my DnD campaigns. She was reluctant at first saying “her art is not for this sort of simple things” but I think her mother convinced her to take the deal.\n\nInitially things were working out. I’d pay her every month and she’d send the drawings on time. But as time went she began being more and more off deadline. I'd always pay her on time, but she'd be weeks then months late. Last commission was for 10 artworks for a new campaign. She's essentially ghosted me for 4 months about it meanwhile I've still been paying her. \n\n  \nI had to delay the start 4 time and it really pissed me off, because at this point, it's about me letting down my friends. So I cancelled the January payment. She couldn’t even be bothered to contact me immediately. Only 8 days later she angrily calls me asking why she has no money in her bank account.\n\nAt the time I was tired and her attitude pissed me off so i gave it to her straight. I told her how she should be thankful for what I'm doing for her, instead she bites the hand that feeds her. How instead of dreaming she’ll make it big, she use her skills to look for a real job.  I told her to stop being a leech of her family. And of course that she won’t see a dime from me until she finishes those damned drawings, and after our deal is off.\n\nThen my aunt called me and cryingly begged me to send Sue the payment otherwise she'll have to starve for the month.\n\nI don’t really have anyone to talk to about this. I know for a fact my family members would just encourage me to stop helping them. And my wife’s attitude towards this problem is along the lines of ‘we can afford it so just help her’.", "created_utc": 1675874167, "permalink": "/r/AmItheAsshole/comments/10x3y2e/aita_for_letting_my_cousin_starve/", "score": 431, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) what action you took that should be judged: i stopped giving sue money and told her some harsh words\n\n(2) why that action might make you the asshole; apperently  sue will 'starve' without the money\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She agreed to create art for payment... like an artist does. If she either feels DnD is beneath her or cannot keep up with her commitments, then that's her problem.", "NTA.\n\nShe‘s responsible for herself! She needs to grow up and learn what being an adult means.", "NTA.\n\nIf i don't show up/ don't do my job at work I don't get paid. This is life. \n\nYou've been MORE than generous. You won't be responsible for her supposed \"starvation\", she is responsible for her own life, choices and money.", "NTA, obviously. How on earth has this cousin managed to convince you that it is somehow your responsibility to just give her money for nothing?", "NTA. If she needs the money that badly, she should start working on those commissions.", "NTA. You made an agreement, she didn't keep up her end of the bargain, why should you keep yours?", "NTA. You're not doing your cousin any favors by continuing to pay her for doing nothing.\n\nI've been a working artist for many years, and most people like me never achieve what your cousin is dreaming of. Continuing to wait for it while doing nothing to generate regular income is not going to work. Most artists never have that one piece that hits and makes them famous, and have to learn to create many streams of revenue in order to keep themselves going. So, for me, that means selling original work, but also selling image sheets, teaching classes, ad revenue from two of my four web sites, running a Patreon and a Substack, building my following on social media, having designs available on print on demand sites, books on Amazon---whatever I can think of to bring a few bucks in.\n\nYour cousin needs some hustle. Withdrawing your support might light a fire under her butt, which is what she's going to need to make it as a working artist.", "NTA and you're really not helping her. She needs to figure out how she's going to make her way in this world. How does she want to use her skills and what kind of work would she like to do UNTIL the time she's discovered as a great artist.", "NTA. Sometimes we need a slap of reality. But if your wife thinks you should help, then get her a gift card for a grocery store. She won't starve, and she can also buy toiletries.", "NTA\n\nYou had a deal, and she did not follow through on her end for months. Therefore, she doesn’t get paid.\n\nShe is an adult, and NOT YOUR RESPONSIBILITY! You owe her and your aunt absolutely nothing. Every decision/choice people make has a consequence. It is not on you to suffer the consequence of the choices they made…no matter how much money you make.", "NTA. just cut contact with these assholes", "NTA. You commissioned her artwork and she failed to produce it. You don’t need to send her money. Don’t support someone who isn’t taking initiative and borderline mooching", "NTA she needs to grow up, how has she lasted to 29 leaching off everyone? Does she even have a job? what does she do all day?", "NTA, she's an adult, she needs to start behaving like one", "NTA.  You are being played.  Your cousin needs to grow up.  She needed to hear what you said.  Hopefully your being honest with her instead of enabling her bad behavior by giving her money for essentially nothing can help her do that.", "Not the a-hole, you gave her so many chances by still giving her money even when she didn't do the drawings.", "NTA - you’re not a charity, do the work or don’t get paid", "NTA she's honestly just being a leech and leeches don't deserve getting paid!", "NTA, you support her with a rather easy and reliable commission. If she is not able to deliver on time and with quality, it is her fault for not receiving the money. As you already mentioned: Do not bite the hand that feeds you. \n\nSeems like she needs to learn it the hard way.", "NTA, as other said cut contact. If you really care, you could give her money for the month so she doesn't starve but tell her its the last one. That way she at least has a month to figure something out. But I would not necessarily feel the need to do that.", "NTA you were paying her to create something for you so if she doesn’t deliver than she shouldn’t get paid. Unless she can show you a piece of work that’s almost complete then I don’t think you owe her anything. I don’t think giving her more money just because you have the money to give us a good idea. She’s already taking advantage of the fact you kept paying her even when she didn’t give you what you wanted so this point she’s just expecting you to pay her. Don’t do it", "NTA \n\nYou gave her work to do and she still didn't do it. You paid her for 4 months and she didn't do any work at all. \n\nI know a few people who have \"made it\" as artists. One works for Disney in animation. The other owns a studio in Hawaii. They both worked so hard to get where they are. They both took these kinds of small jobs to improve their skill and give them something for a resumé. \n\nBesides the two people that I know who made it as artists, I know at least 10 others that didn't make it, but are able to still get paid doing exactly the kind of thing that you are paying her to do. A few are also now tattoo artists. \n\nShe will not starve. She can get a job like the rest of the population.", "If she does \"starve\" then that's on her, not you.\n\nThe view or rule to give people money of \"You/we can afford it\" does not fly with me.\n\nI have a monthly donation to a couple of non-profits that help those people to help themselves because I want to, because I want to help others in those kind of situations, because those groups fit my values and because (and yes) I can afford it.  \n\nI don't give money out to individuals that is why I give money to those groups to help those individuals.\n\nIf your aunt does not want Sue to starve then she can feed Sue.  You are not obligated to enable Sue's \"lifestyle\" just because you can afford it.  She is a grown woman.  This is her choice.", "NTA \n\nI don’t pay my employees when they aren’t working, neither should you, even if she’s family. \n\nIf she needs money, she can get a different job.", "NTA. You’re holding up your end of the bargain but she isn’t, not cool. She is 29. She needs to reprioritize some things it seems.", "NTA. This is akin to if she just stopped showing up at the office and still demanded to be paid. If there are circumstances causing her to miss deadlines, she should be communicating those to you, just like she would call a regular boss and explain a work absence.", "NTA\n\nShe's older than you are. She won't \"starve\" because you didn't pay her for the work she didn't do. She'll either mooch off someone else, or grow up and do some work or she'll go to a food bank. It ain't that serious.\n\nAnd your aunt is literally asking you to give up on your agreement, and just pay your cousin's bills in perpetuity.\n\nMy solution would be to put a price on each type of artwork, and pay for each individually, after she does them, until she gets her crap together.", "NTA. No work done = no payment. Easy as that.\n\nYour aunt is trying to guilt you because she is a leech just like her daughter, and it's easier to cry on the phone than find an actual job and start being a real adult. Time to cut that shitshow off.", "NTA, she's a lazy dreamer.  You have done more than enough.   If she's ever going to survive. She needs a dose of reality.   Anyone who sends her money for nothing is an enabler.", "NTA and man I'd love to have a monthly commission. That was a generous offer and she essentially didn't show up for work, you don't owe her an allowance.", "NTA. While I don't understand the 'artistic temperament '/starving in a garrett etc. That's her choice and, whether you can afford it or not, at 29, she needs to accept the consequences of her decisions.\n\nYour DnD artwork may not be the sort of art she wants to do, fair enough, but she can't take payment for work she doesn't want to do so isn't doing.\n\nTbh, I think she's a cheeky mare and you have supported her long enough. I assume she didn't graduate last week so she has had some time to earn some money from her art but isn't. When my boys were younger, they and all their friends wanted to be professional footballers, yeah, that didn't happen! If wishes were horses and all that......", "NTA - The unfortunate reality is that most artists will never reach the recognition that Picasso, Dali, or Van Gogh had unless they are genuinely a prodigy. Even then it's partially up to chance that they'll be found among the millions and millions of other artists trying to achieve the same dream.\n\nBecoming a sensation isn't often something that happens overnight, so the reality is that she should continue making art, and lots of it, if she hopes to make it a living some day. And there are plenty of practical routes that artists can use to make a living that don't require selling paintings for millions of dollars. One such avenue is what you've described, making art for games. Another could be making art for picture books, or simply selling their prints on etsy.\n\nThe bottom line is that if she doesn't want to make art for \"simple\" things, then she won't be able to support herself or practice her skill enough to make it to the fame she wants to achieve.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n A lot of emotions are overwhelming me right now so I'll try to keep it simple and to the point.\n\nMy(m27) cousin(f29), lets call her “Sue” is an ‘artist’. By that I mean she has a Bachelor in Fine Arts. Ever since high school her dream has been to become a world renowned artist akin to Picasso, Dali and whatnot. Honestly, she doesn’t have what it takes to be on that level. \n\nThing is she refuses to work in an industry where her skills would be needed, the most work she’s ever done is as a cashier in retail. Forever hoping she’s gonna “hit it big” with one of her artworks.\n\nNow I always felt bad for Sue. Her mother made a lot of poor financial decisions and her piece of shit father walked out. My parents, grandparents, aunts and uncles helped them out financially from time to time. But their attitude towards my aunt was always “she did it with her own hands”. \n\nOur family members were extremely pissed  that Sue chose to pursue fine arts. They all grew up during communism and see this sort of degree as a waste of time. They essentially stopped giving them any form of financial aid.\n\nI never stopped. About 5 years ago my friends and I got really interested in DnD. Essentially I talked to Sue and told her I'd give her a monthly sum of money and in exchange she’d draw stuff for my DnD campaigns. She was reluctant at first saying “her art is not for this sort of simple things” but I think her mother convinced her to take the deal.\n\nInitially things were working out. I’d pay her every month and she’d send the drawings on time. But as time went she began being more and more off deadline. I'd always pay her on time, but she'd be weeks then months late. Last commission was for 10 artworks for a new campaign. She's essentially ghosted me for 4 months about it meanwhile I've still been paying her. \n\n  \nI had to delay the start 4 time and it really pissed me off, because at this point, it's about me letting down my friends. So I cancelled the January payment. She couldn’t even be bothered to contact me immediately. Only 8 days later she angrily calls me asking why she has no money in her bank account.\n\nAt the time I was tired and her attitude pissed me off so i gave it to her straight. I told her how she should be thankful for what I'm doing for her, instead she bites the hand that feeds her. How instead of dreaming she’ll make it big, she use her skills to look for a real job.  I told her to stop being a leech of her family. And of course that she won’t see a dime from me until she finishes those damned drawings, and after our deal is off.\n\nThen my aunt called me and cryingly begged me to send Sue the payment otherwise she'll have to starve for the month.\n\nI don’t really have anyone to talk to about this. I know for a fact my family members would just encourage me to stop helping them. And my wife’s attitude towards this problem is along the lines of ‘we can afford it so just help her’.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta.", "NTA, She knows the deal and is basically stealing at this point.  It's funny how she was too busy to get back to you for FOUR MONTHS when she owed you work, but can contact you straight away when she doesn't get the money!>  \n\n\nShe gets money for drawings and hasn't done any in months, what did she THINK would happen?. If she didn't show up at work for 3 weeks out of a month would she be screaming at her boss for not being paid for the work she didn't do?. No , because she knows she is in the wrong and trying to use your good nature against you.", "Sounds like there could be some drug issues with the artist known as Sue. This situation is right off of that show Intervention. It's time to get the family together and have a sit-down with Ms Rembrandt. Even if she's not into drugs, the family sit-down might help her get focused on her future. If she's one of those people who simply doesn't want to work, then I hope she's attractive. Someone will probably come along and take care of her in that case. If she's dog ugly like me, she's gonna have to work. You, sir, are NTA. Quite the opposite,  you are the hero. She just doesn't know it yet.", "NTA.\n\nYou've been helping Sue financially for 5 years, and made an agreement with her to pay her for artwork.  Instead of being grateful, Sue slacked off, missed deadlines, and stopped contacting you regularly.  You were right to stop paying her, and for demanding she complete the work she promised to do.\n\nBut for goodness sake, please don't start paying her again.  You're only enabling her to do nothing.  Whether or not you can afford to help Sue financially isn't the issue.\n\nAnd yes, she did need to hear that she should get off her a$$ and get a job.  There are lots of artists who work a full time job while pursuing their art.  They also actively do things to continue learning, and get their work out there by entering shows, going to fine art festivals, etc.\n\nThere's no harm in pursuing a fine arts degree, so stop denigrating that choice.  The choice not to pursue the kind of work to support herself is another matter though.", "NTA: Perhaps she thinks the ‘starving’ part of ‘starving artist’ was metaphorical? Let’s go ask Van Gogh.", "NTA.  You are enabling her by paying for a job she is not completing.  Business and family should stay separate.  She is your cousin, but she is also providing a service for you that she has been paid for.", "NTA. You hired her for a job that she is choosing not to do. This is life and the sooner she learns to take responsibility for her own life and choices, the better off she will be. Continuing to baby her will only delay her growing up, and the longer it takes for that to happen, the more likely it is to never happen.", "ESH. \n\nYou're completely within your rights to withhold payment for a service that has not been completed. However, your comments about (and towards her) make you sound like a judgemental jerk with a superiority complex. Retail workers and artists are as valuable to society as you are.", "ESH. Your cousin for not respecting your business agreement and expecting you to pay for the commissioned artwork when she is sending it late. And yourself for not respecting her career choice and industry.\n\nIt sounds like your family's prejudice of art degree's being a \"waste of time\" has also rubbed off on you too \"use her skills to look for a real job\". There was a right way to handle your situation; unfortunately, the way you chose wasn't great by getting personal with your insults. Don't get me wrong, your cousin sounds very entitled and you buying her artwork was kind. But you also sound like you have a superiority complex about the situation \"she bites the hand that feeds her\".", "YTA: Even if you don't want to give her food directly you should help give her the resources she needs her cousin. Introduce her to the food bank, drive her to sign up for food stamps. Help her to help herself. You've obviously never been in that situation or you would understand what its like to be in her shoes.", "YTA by controlling her financially. You don't even tell the context of the payment, maybe that was clearly insufficient for the time spent.\nEven if she \"made poor financial\" choices, you should have helped her differently.", "NTA\n\nINFO: do you know if you're her Only form of income? Do you know if she has some mental illness issues going on ie depression etc? Any chance she's got an addiction ie drugs/drinking?\n\n If you are you are paying her incredibly well for her campaign art - and yes I'm sure you're paying above&beyond so you can  'help'.  If you're only or main source of income to the point of 'starving' without your help she needs to start cranking out that art for you.  She may be dealing with depression or some other sort of issue that might make dealing with life extremely difficult BUT if that is the case - it is still her responsibility to let YOU (and her mother) know whats going on.  It's been her responsibility to complete her (possibly ONLY) paying job, and to contact you if there are problems.  \n\nIf money isn't an issue with you&wife - Sue still needs to complete what she owes you, you can decide to continue to buy/help her but it would be completely fair to change the rules to Pay on Delivery.  You didn't sign up to be her caretaker, you found a real way to be able to give her an income while doing Art, and it's actually Art you depend on for your team.", "NTA - this is ridiculous- almost 30 years old and doesn’t have a job! And the one she did have she refused to do. Sorry but the entitlement is wild, I wouldn’t give her any more money. At some point she has to be become an adult and become responsible for herself and I don’t think you are doing her any favors here by delaying that.", "NTA", "NTA\n\nPlease stop enabling your cousin. Her past is unfortunate. But she (& her mother) has spent many years exploiting your generosity and that of your other family members. You aren't helping them by allowing Sue to live off of someone else's efforts. Her entitled attitude is reason enough to cut off the gravy train.", "NTA - Cut contact", "You're NTA for anything except saying she doesn't have the talent. That may be true, but not your place to say tbh. But yeah, sounds like she's going through her money because she is fully dependant on you. Stop coddling her, she will only starve if she doesn't get a job. This is the wake up call she needs, don't give in", "NTA. Being the only sane person in a family of enablers is difficult, I feel for you. She and her mother both need a reality check.", "NTA, and as someone else said, you really aren’t helping her, just delaying her reckoning with reality.  I have a very dear friend who is an artist who has been able to support themselves on their art in recent years but before that worked for a greeting card company to pay bills for many years.  It’s what artists do - they work at something else until their art becomes a viable revenue stream.  Your cousin needs to learn that.  Plus - being paid for work you didn’t do is theft - you should never pay someone for work they don’t do.", "NTA. Sue needs to grow up", "NTA. Decisions have consequences. She's not helpless.", "NTA and your cousin has no idea how the art market works.\n\nMost artists did commissions before becoming famous, a lot of them just got famous after their deaths.", "NTA\n\nShe now gets to live the starving artist lifestyle. It will force her to either take art and commissions seriously OR look for a change in career.\n\nBut she needs to change. You don’t have to subsidize her", "NTA.  She did not deliver her artwork as agreed.  If she's really on the verge of starvation, you can buy her some groceries.  But, since she went to college she should already know how to survive on ramen and bologna.", "NTA- The best way would be to pay her half the money and then the rest, after the job is completed. You were being really nice, OP and Sue took it for granted.", "NTA. I have a BFA as well. The actual genuis in my class doesn't sustain herself solely from her artwork, she works at a gallery as well. None of my professors made a living solely from their artwork, that's why they taught. You have been very generous in your support; most of us don't have relatives to be patrons for us.", "Seems like Sue could have idk, done work for money like the rest of us? \n\nClearly you were offering her work that's overpaid so she wouldn't have to feel like a leech, but she is a leech.", "NTA she Chose to do this, or rather to Not do anything, she can deal with it.", "NTA she is failing to deliver what she promised.", "NTA you should not have been paying without art in hand once she started being late.", "NTA-  tell your aunt that once her daughter finishes the commissions she already agreed to do, took payment for and are already months late, only THEN will you send her the January payment and that will be the last payment she will see from you.  No drawings?  No final payment. \nWin-win.  You get drawings that are well overdue and she gets her final payment to which will end the agreement.\nSue needs to grow up and take accountability for her own actions and her own life.", "NTA\n\nYour cousin feels entitled to your money and doesn't respect you. \n\nChoose to respect yourself.", "You paid her for drawings. No drawings, no pay. Tell them that if they ask again, you'll sue her for payment for services not rendered (no, it wouldn't really be worth it to do that, but they don't know that). NTA", "NTA She is taking advantage and her mom is being manipulative. You owe nothing for services not rendered.", "NTA in the real world if you don't work you don't get paid. and if you constantly missing deadlines you get fired. she thought you wouldn't fire her because she's family", "NTA Unless you are so rich that you plan on being a Patron Of The Arts you can keep your hard earned cash and she can actually start working to earn some cash.", "ESH\n\nYou're right to not pay her for work she isn't completing\n\nBut its her life. You don't control it or have any more say in than what she allows. You don't have to support it, but attacking her because you don't agree with her choices makes YTA", "YTA\n Went through history. Landlord and the true leech", "Info: what % of her monthly budget is the stipend from you? If it's significant and you know it, Y-T-A for not giving her advance notice to figure things out (like saying this is the last payment: or saying if you don't get the drawings by X, next month's stipend won't be paid, etc.) \nHer not delivering  put you in a tough spot and was an AH move; you are doing the same to her, making you also AH.", "Exactly, she was given so much leniency for the one consistent art job she had. Also, the aunt is more than free to help Sue out instead of guilt-tripping OP.", "I'm not an artist.  Am I wrong in assuming that most artists base their work on things that happen in their lives?  If so, then it seems like it would be beneficial to her to get out and experience life. Including the parts that suck, like working a retail job.", "This", "I don't think the aunt is bad, I think she's just stuck with a daughter who refuses to work and so she's panicking. That said, I think going hungry for a month might be a great motivator for change.", "Van Gogh didn’t even get to enjoy his fame and frequently had to choose between food and paint.", ">Retail workers and artists are as valuable to society as you are.\n\nOPs cousin is neither, she is a leech which has no value to society.", ">And yourself for not respecting her career choice and industry.  \n>  \n>\"use her skills to look for a real job\"\n\nI've abbreviated like an hours worth of conversation in the post due to the character limit. I'll admit, initially I didn't think much of her career choice because i didn't know any better. But over time I educated my self. What i meant by a real job was something in the industry. I dont know since i'm not an expert but surley there are career options no? Like comic book assistants, or illustrators for design companies, or an assistant on an animation tv series, or storyboarder. Like an actual job where she can apply the skills she learned during her university years? She lives in the US I refuse to belive there arent  better options than just painting whatever you want and hoping some wacko pays millions of dollars for it?\n\n&#x200B;\n\n> \"she bites the hand that feeds her\"\n\nshe called me and insulted me about the missing money. I'm the only one in the family who showed her any support and she verbally treated me like I was just living atm. it hurt.", "This. She's a flake, for sure, but that doesn't make the degree worthless, as if the only valuable degree is one that makes a person prosper financially. And ALSO, an art degree isn't necessarily a poor financial choice; by age 25 my daughter was making six figures with her BFA. OP sounds so self important and smug.", "Didja read far enough to see he refused to raise rents or leave people homeless during hard times?", "I have a piece in the Library of Congress permanent collection that was inspired by something I observed at the grocery store, with no life-sucking retail job necessary, \n\nBut if OP's cousin can't hustle up a living from her creative skills, something has to pay the rent. For many of us, that thought is where the hustle comes from: if I don't find a way to earn another $100/week from my various revenue streams, or from a new one, I might have to get a \"real job\" \\*shudder\\*", "She's enabling her", "It's her kid. If she is so worried she can buy her food. Or encourage her to get on food stamps. Or encourage her to get a job and live within her means", "NTA -  Her degree is worthless given that she is doing absolutely nothing with it. A hammer is of no value if you leave it in the toolbox and cry because the nails are not pounding themselves into the wood. She's doing nothing at all to try to help herself, just mooching off others.", "Nta if she feels like DnD art is below her, and doesn't want to do it then she doesn't get paid.\n\nRefusing to do any but a very specific style or genre makes her an idiot. Not pursuing the fine arts.  There are plenty of people who make a solid living doing DnD art or fan art or, heck, furry art!", "NTA.\n\nI think you need to reframe this.  You were not giving Sue \"financial aid\".  You were paying her to create artwork for you DnD campaigns. She did not deliver her art as promised, so you did not pay her.  Also, you are not \"starving\" her - she is choosing to \"starve\" herself by not completing a job.", "Send her a modest-sized gift card for one of the grocery stores in her immediate area.  (If it was me, I'd be also including the addresses of local food pantries, but I'm petty that way.)  \n\n\nPlenty of later-famous artists have had day jobs. (My favorite was Jackson Pollock, who was a museum security guard. )  You can also find trust fund babies who not only had talent, but real drive, such as Salvador Dali -- it's the determination that pays off in the end.", "Maybe your aunt should have raised her daughter to be more responsible. You're free to make whatever choice will make you happy, but you can't expect others to support you forever. \n\nYou hired her to do a job. She didn't do the job. In what other industry do you pay for a product or service you don't actually receive? \n\nNTA. Cut her off.", "NTA… your cousin knows most famous artists weren’t famous while they were alive, right? A few of them had wealthy patrons that housed them and covered supplies and food but they were expected to provide art usually of the patron or their families on a regular basis, and that was during the renaissance. Basically all artists after the 1800s came from wealthy families, had another job and the art was more of a hobby, or were fucking poor their whole lives.", "NTA. You basically became her patron and she wasn’t fulfilling her end of the arrangement. Would a month in advance warning have been nice? But then you also might have gotten crap from your aunt for the “threat”. Is your aunt not capable of working herself? Are they still living together? \n\nIt sounds like it’s sink or swim time for your aunt and cousin.", "Any future deals should be a piece meal, I receive art, I pay for art, not paying ahead or regardless of art.\n\nEdit to add NTA\n\nEtA: also you could help her this month and warn her that there will be no payment next month, it probably feels sudden as previously you'd pay her anyway. But you certainly arnt obligated to pay anything.", "NTA", "I am a cow.\n\nYou need to ask for a refund for the work not done.  Send her a message stating you have paid X a month for Y months and have not received the agreed artwork, as such you want the money back. \n\nNot to necessarily get it from her but because if she pulled this trick on a 'proper' client not a family member they would sure as hell want their money back due to lack of service provided and she could end up in more shit than just a missing payment.", "NTA.  You pay for a service, and you don't receive it, the pay stops. As for your wife, she needs a wakeup call.  Whether you can afford it or not does not matter.  You would be enabling this deadbeat woman just as everyone seems to have been doing all these years.  It's past time to put a stop to it.", "NTA\n\nIf your aunt wants, she can help her. Forget what your wife said - you paid for services to be rendered and aren't getting those services met. If you continue, you are just an enabler.", "NTA. It wasn't even her who called you. If you feel like it, offer her to talk once more... If she has real problems making ends meet she will agree. If you want to go on helping her (and of course you don't have to, you never had to, but you consider it and you wife thinks like \"‘we can afford it so just help her\")\n\nAnd then make a plan with her. She needs to grow up. You give her a commission, you agree on the money, how much paid upfront and how much at delivery, you set deadlines and write into the contract what happens when she is not on time (and what happens when you are not on time with payments - not that this will happen, but just to have a normal contract) ... No more regular payments for sometimes work, real contracted work. If she agrees and does her part and others want to use her services you can recommend her... If she doesn't take it you can assume that she found another source of income and isn't starving.\n\nThat's of course nothing you have to do, because you don't owe her anything, it's just something you might want to consider if you want to go on supporting her, but don't want to be exploited by her.", "NTA. You were paying her for services that she wasn't providing. You wouldn't continue to pay a plumber who hadn't turned up for work repeatedly with no good reason, being family doesn't give her a pass. You were basically providing charity that she's come to rely on, by cutting her off you'll help her in the long run.", "NTA you are not her atm.", "What DnD?", "NTA You gave her ample time. You gave ample warning. Even the greats had patrons who supported them as your doing. If she is too high on her own farts  then looks like she's gonna have to figure it out for herself. Fa,fo.", "NTA, she wants to be an artist so you're treating her like an artist. You were acting as her benefactor, providing her an income which allowed her to pursue art, so long as she creates some pieces of art for you. She has failed to produce the art, so you're pulling your funding. No one pays an artist for a commission not received.", "NTA. So no again, and send her a list of local food banks.", "NTA, your cousin needs to grow up and deal with the fact that her career strategy is effectively the same as buying a lottery ticket every week as an investment. She’s had too many ‘special snowflake’ conversations with someone in her life and bought into the propaganda. Actually being a starving artist is not in the least ‘romantic’.\n\nReal working artists only get and stay employed by doing the work and damn few are drawing what they want to draw. \n\nI knew an amazing artist on DA a decade ago who as an art student in animation had a side gig for extra cash by drawing to order and selling prints of her work on DA. Mostly furry porn, custom game characters and some really weird fetish manga. It paid. She gave it up after graduating and getting a real job in animation and said she was glad to ditch the creeper crap. Some of her customers were unsettling and the stuff they asked for is why the term ‘brain bleach’ was coined.\n\nOne of my favourite authors described this attitude in the wannabe author type this way: \n“They don’t want to write, they want to have written and become famous so they don’t have to write.”", "NTA. Quit giving her money you’re just enabling her.  She can wipe her own ass", "You’re very kind. And she’s taking advantage of you. It’s time she gets real with life. NTA.", "NTA She broke her part of your agreement so why would you pay her?", "NTA You paid her for art and she didn't deliver.", "Nta I'd stop doing business with her.", "Another working with family post today.  I’m sorry you are in this situation.  Working with / for family is always difficult.  When you do, you should be prepared to just gift whatever it is or walk away.  The best advice is to enjoy family as family and not as business partners of any kind.  You are not at fault and NTA.", "If she wants a meal, invite her over for dinner. But by no means should you keep paying that leech. NTA", "NTA - Did she give a reason why she was being so late, etc. with everything?  Not that it would change the fact she was late mind you, but I was curious.  In any case, you did nothing wrong, she was using you as a handout.", "NTA.", "NTA", "NTA you tried to help her, you had an agreement and she didn't uphold her end, why on earth would you continue to pay her if she wasn't providing the art as per your agreement? If you REALLY want to be generous you can tell her when she gets you your commissioned stuff you'll make a final payment to her for January but either way you should end the arrangement.", "Your cousin sounds like that pretentious, disdainful half-wit type, that turns so many people off of fine art and the art world in general. \n\nStop giving her money and let her experience what happens when you refuse to work for a living. Starvation is usually a good motivator. \n\nNTA", "NTA. You gave her an opportunity to earn through her art. IDK why she decided to ditch the responsibility.", "You can lead a horse(?not sure which animal it was tbh) to water, but you can't make it drink. She wants to be an artist,  and you gave her art commissions. If she doesn't have a real job, what has she been doing for the last four months. Forget paying her you would be well within your rights to ask for a refund/ sure her for failing to deliver. And if she says she did get a job that's taking her time,  well then they must be paying her so she can't be starving.", "NTA. She agreed to do art in exchange for money. If she doesn’t produce art, she doesn’t get money. It really is that simple. And she won’t starve ; there are these wonderful things called food pantries that provide the indigent, even idiotic ones, with free food. It’s high time she learned to fend for herself if she isn’t willing to follow through on contracts.", "NTA\n\nIt sounds like you have already paid her for things she hasn't given you, so you have no reason to give her more money.", "NTA. Why on earth would you ever give this woman money? She’s two years older than you! I can’t imagine my little cousin giving me an ‘allowance,’ even when we’re all older, no matter what financial situation either of us are in", "NTA. Sure, someone will be the next Dali or Picasso. But they didn't start out being \"the Dali\" or \"the Picasso\". They did comissions--and many of the most famous pieces of art are commissions. In order to be an artist, you have to build your portfolio, and guess what--that means taking commissions. She's not going to get museums and galleries knocking down her door if she has nothing to show them. They're definitely not gonna take her on if the best commission deal she's ever gotten, she fucked up by not providing her end of the deal.\n\nStop paying her. I promise, you can find many artists just as good as her who would love to be paid for monthly commissions for DND campaigns.\n\nOn the one hand, I do think you should help her because no one should starve. But I also understand why you don't want to and the reasons you shouldnt. You had a deal. If she wants to be an artist, she needs to learn how that if she doesn't hold up her end of the deal, she starves. She had a great chance and she blew it.\n\nIf you do help her, don't just hand her cash. Instead, buy her groceries yourself or drive her to a food bank.", "Nah, you are not responsible for taking care of another grown adult that isn't your wife or child. \nI actually think that by giving her money when she doesn't work for it enables her and does her a disservice because it doesn't force her to grow. \nPlease don't cave in to these manipulations. You are making the right call. If she wanted to make money she would.", "Btw she won’t starve her aunt can feed her.", "ESH \n\nIt’s pretty clear that so many people don’t really understand how liberal arts have changed and is literally a major pillar in the structure of our society. So for you thinking this is somehow a degree that’s “lesser” really shows you don’t understand how the arts have had an impact on the world which is the first that makes you an AH, but also, how rude do you have to be to literally tell someone they don’t have what it takes when it’s pretty obvious you don’t know what it takes because you see that degree as less deserving. That makes you the AH alone. \n\nShe’s an AH for not sticking to her agreement and entitled for thinking she is owed money when she isn’t doing the work. \n\nBut the reality is, your entire family is both ignorant and AH if you view the arts as less than. Really say it with your whole chest that you have 0 understanding of how important the arts actually are to society.", "NTA and don't get sucked into this drama - your aunt included. She's almost 30. \n\nSay you're broke too lol. \"Sue\" can find a man to support her.", "Seriously, she did what every famous artist pre-20th c. did: found a patron who'd pay her bed n butter to create art. Then she decides she doesn't want to make art for her patron, so the patron lets her go. You give no service you get no goods.", "Plenty of famous big name artists had day jobs where they did art for money. Like drawing the picture of the rib eye for the weekly supermarket flyer kind of work.", "The big names in the art world didn't start out where they could pick and choose commissions without fear of going without. Artists have gone unappreciated in their lifetime only becoming famous posthumously like Van Gogh. Being a great artist who is recognised as such may be Sue's dream, but she's not making her reality work.", "leeches don't deserve getting paid!", "OP engaged her for her services as an artist, she didn't deliver. Family relation doesn't matter, this was a business transaction she didn't follow through on because she deemed it as beneath her.", "Social media can be a great way to promote and get commissions for work.", "Artists who create works and share them with the world, who put in the energy and time and work - they are fantastic. \n\nArtists who do not make art when they have an agreement to do so that they willingly entered into are frauds. If I bought a painting, a vacuum cleaner, a car, or a shirt and never got what I paid for after a reasonable period of time, I would cancel the funds. OP has every right to do so and is NTA.", "Boo hoo. “Controlling her financially?” You mean, not paying her for failing to hold up her end of a business arrangement?", "Did you completely miss the part where dear cousin chose not to complete the job she was commissioned for because it's beneath her skills? No point helping people who don't want to help themselves.", "[removed]", "Exactly! And it's a way to get paid to build your portfolio. OP's cousin really missed out.", "Don’t support someone who isn’t taking initiative.", "And like, OP's cousin has other family members who are willing to give her money. So why does OP need to keep paying for an incomplete commission?", "I used to know an artist who earned spending money on the side while studying animation. She took online commissions for pretty much anything that paid. A lot of it was furry porn. She turned down some really gross stuff, too traumatic, and the customers could be very creepy.", "this. she is an artist that hasn't contributed anything meaningful. OP gave her an opportunity to contribute in exchange for money, but she just wanted the handout. it would be equivalent to paying a relative for some handyman work around the house even if it isn't their profession", "**Bad bot!** Partial comment stolen from /u/mroffthestreet01234, original [here](https://www.reddit.com/r/AmItheAsshole/comments/10x3y2e/comment/j7q779l/).", "Hey maybe she should reroll, too bad she’s lacking Inspiration.", "I'm pretty sure that OP isn't American so it wouldn't be food stamps although there's probably some similar local program."]}