{"id": 9479, "submission_id": "10x7oir", "title": "AITA for telling my husband that bringing his daughter to live here was a mistake?", "selftext": "From the day we met, one of my husband's primary goals was to bring his daughter Lidia to live with him here in America so she could have a better life and have an actual family with some level of stability and structure. Lidia wanted to come live with us when she was little, but once she was about 15, her tune changed. We thought that it was because she was getting old enough to where her mother's (lack of) rules and structure was less scary and more to her benefit, so we pressed on. He finally won last spring shortly after she turned 17, and we brought her home shortly after.\n\nIt's been a disaster. She doesn't want to be here. She doesn't know anyone here besides her father. There's a huge language barrier, so she can't really talk to us, let alone make friends here. Those would be big enough issues on their own, but it's nothing compared to the practical issues.\n\nShe's supposed to have dual citizenship, but that either doesn't mean anything or it works differently than any advice we've gotten. Back in her home country, she was a senior in high school, and had already been accepted to several universities. She had some kind of driver's license. Here in America, all of that is meaningless. We can't get her even a learner's permit because her \"paperwork isn't right\". What's happening with school though...\n\nWe had heard that the credit transfer would be behind, but every school we've talked to would put her as a sophomore at best. This not only means that she can't graduate this year, but she'd be in high school until she's **20(?!)**.\n\nShe could get a GED, but that's looked down on by colleges here. We've looked into online, but the online options are viewed about the same or worse than a GED. If we were millionaires, we could just donate to some school to just give her a degree, but we aren't.\n\nSo by moving here, instead of graduating this year and going to college, she has to be in high school into her 20s or she can't go to college at all. \n\nThere is an option of sending her back home to live with her mother's friends to just graduate and get it over with and then come back. She'd have to make sure she was back in class there before April, but she'd only have a semester to make up so she could feasibly graduate on time. A high school degree from her home country would equal out, so she could go to college here with no issue.\n\nMy husband won't hear it. He thinks she'll run away and never come back. He's adamant that there has to be another option and that everyone is just \"going off of emotion\". 20 schools, 3 lawyers, and tens of thousands of dollars later, I don't think so. I think this might be the only option and that we're running out of time to take advantage of it. As much as I also want her here and want her in this family, this is the wrong time and we shouldn't have pressed for her to come here in the first place. We've been arguing for days over this, and time is running out.", "created_utc": 1675883118, "permalink": "/r/AmItheAsshole/comments/10x7oir/aita_for_telling_my_husband_that_bringing_his/", "score": 365, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I all-but told my husband that his 10+ year fight to get custody of his daughter was a mistake and that she shouldn't be living with him after all because it's messing up her ability to get an education.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nHer tune changed at 15 because she'd established a life, and was looking forward to a future. And that future included living in a country where she speaks the language, graduating on time with the classmates she's done her schooling with, and going to a university which teaches in her native tongue.\n\nAlso, when she turns 18, neither you or your husband will have any control over her. She can return to her native country and establish her life there if that's what she wants. Your husband isn't even working off any form of logic here, he just wants to feel that he \"won.\"", "I think you are between a rock and a hard place. If anyone is \"going off emotion\" it's your husband. What does his daughter want to do? She's nearly an adult and he won't be able to keep her here once she is 18. He could be completely ruining their relationship and your financial stability  by insisting she stay. NTA good luck - pretty sure this isn't going to play out well.", "Honestly, in this case NTA. She is old enough to choose where she wants to be. Your husband is the one working off emotion.", "Awww! I feel so bad for her! It’s HARD to give up the only life you’ve ever known and come to somewhere where it’s made difficult to even function in society. Poor girl! It’s best to let her go home and take care of herself and her needs.. then come back if she chooses. He’s holding her emotionally hostage for his own sake… \n\nYou’re correct in saying he’s going off emotion and not what’s really going on. Ask him if he’s enjoying watching his daughter be so unhappy?! It’s not fair to her! \n\nNTA by the way.", "NTA daughter didn’t want to move here, she doesn’t have a great grasp of the language(which she would pick up but this way is cruel), and this has royally screwed her education. That’s just all cruel and sad.\n\nRead that she wants to go home - help her get there. This has to be awful for her.", "NTA. She was better off at home. She could have finished HS, get her driving license. Then she could have come to the US. I suggest you agree with your husband to talk to her and ask her if she wants to go back home, finish high school and do her thing. Also let her know she’s always welcome to come back.", "NTA. In a year she could just get some money sent to her, hop on a plane, and go back to the other country assuming he isn't hiding her passport. Or she could just stop going to school and do nothing.", "INFO: Is there any way she can do online learning via a school in her former country in order to graduate?\n\nLook this girl is going to run at 18 and she should. I’m super worried about your husband withholding her passport and other documents to trap her. \n\nIf he’s reading this, this isn’t love OP’s husband, you’ve taken your daughter from where she was thriving and had a future to a place where she can’t graduate high school.\n\nYou want a relationship with your daughter? Let me lay it out in practicality instead of emotion.\n\nSupporting her in graduating from high school in her native school and allowing her to attend University. \n\nLook into University exchange programs in the U.S. and encourage her to apply, work on dual citizenship then. \n\nSupport her in her future and she’ll want you in her life. Legally she will not be a child much longer and when she turns 18, I hope she gets to an embassy to go home. \n\nYou have a prisoner not a daughter. You’ve uprooted her entire life for what you wanted not what was best. \n\nBecause she was thriving in school, driving, and early acceptance into universities. This was never about giving your daughter a better life and more about what you wanted. \n\nShe’s not a doll and you’re playing monster, not parent. \n\nShe’ll run and never come back because you have made it clear that she’s a prisoner. \n\nThere is not safety for her in your house and again she isn’t a doll she’s a separate human being.", "NTA - Has anyone actually asked stepdaughter what she wants? (Does anyone care?) \n\nShe's 17 and basically was completely uprooted in her transition years into adulthood, high school to college, etc. \n\nIf her desire is to return to her home country, your husband has to allow it. He's afraid she might run away??? Does he think he has her captured now? \n\nMakes more sense to revisit a move to American after she's done with her education and can go exploring more.", "NTA. Moving has hindered her academics and could potentially have a long term impact on her career prospects. She doesn’t want to be there. It would be in her best interest to return to her home country. You could rephrase it as you know her husband wants her there and you’re fine with her being there but moving her at 17 has been harmful to her.", "Your partner is astonishingly selfish. NTA", "NTA She would be taking a big step backward at this point by living with you. You should send her back to her her original country to finish high school and attend college. If she is a dual citizen there's no reason she can't come back later. And if she doesn't want to, it's up to her. There's nothing the father can do once she's 18. She will resent him and it will damage their relationship if she feels he is holder her back and damaging her life by keeping her in the US.", "info: What does she want? She is legally an adult I assume?\n\nIf she can't navigate the language to socialize I don't see how she could attend university anyway?\n\nETA forgot to vote NTA, although I'm not sure saying it was a mistake is necessarily productive, I don't blame you for feeling its a mistake and trying to find the best way out of it for the daughter", "NTA, it makes no sense that the year credits don't transfer but the High school degree, I'm sorry for her that must be stressful, but seems like he is to blame for that and that could have been easily prepared by looking onto school transfer way before she arrived, she is old enough to be able to make that choice and it seems to be what's best for you, his selfish dream of having her in the US is making him do stupid stuff as forcing her to come to early at the worst timing possible. Stuff like that need to be prepared.", "Ask Lidia. Surely she is best placed to know what she wants to do?\n\nIf she wants to go back to her mom, her dad has to listen to her.", "Nta her tune charged at 15 bc she realized that her dad was taking years, maybe a decade, to actually bring her over. In the mean time she's an established human being with a life. \n\nShe was already *17* why in the world would he pull her from her last year if high school instead of waiting and then she could do college in the US?", "NTA. She wants to go home, she’s old enough to decide that for herself. Your reasoning is sound and you’re not trying to exclude her from your family, you just want her to have the best chance in life. Your husband is being selfish", "NTA he wrecked her life and her future and for what? I genuinely don't understand why he fought so hard to take her away from her home and her opportunities.", "NTA. \n\nI’m sorry but this is an entire disaster, that your husband caused, because he was so blinded by the “American dream” that he railroaded any sort of reasonable planning, research, or listening to his own child and I assume her mothers objections. \n\nWelcome to America, our healthcare and immigration policies stink, your going to be demoted in school, which is embarrassing but considering you can’t speak the language college is postponed perhaps indefinitely, no driving for you, and enjoy having no friends. But hey! We can eat dinner together every night! And you might end up being the only high school senior who can legally drink at your senior prom! Isn’t this awesome?!", "I would say NTA but also, this is a matter between your husband and his daughter. \n\nThat said, I would suggest that you all pump the breaks on sorting out her citizenship if there's a strong likelihood that she may go back. IANAL, but all my ex-pat friends pay double taxes on their income. If she becomes a US citizen, only to return immediately, it could be a serious burden to have to pay taxes to a country to which she feels no connection.", "NTA - Your husband has noble intentions, but his plan simply can’t be implemented.  He has to let her go home or he’s going to ruin his relationship with her. \n\nShe will just leave when she turns 18 and will resent him for this the rest of her life.", "Just throwing out another option.  \n\nShe gets her GED and go to community for 2 years than go to a 4 year college", "ESH- except the daughter.\n\nAll of these terrible outcomes should have been thought through before this girl got uprooted. Especially since it has taken so long for her to get there. There could have been professionals who could help sort the issues she may have to face. Schools should have been looked into. Someone to help with language issues, emotional issues from being completely isolated, etc.\n\nDad is acting more like this is a personal agenda then anything about his daughter.\n\nYou both had plenty of time to prepare but it sounds like you didn't. I feel bad for this girl.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFrom the day we met, one of my husband's primary goals was to bring his daughter Lidia to live with him here in America so she could have a better life and have an actual family with some level of stability and structure. Lidia wanted to come live with us when she was little, but once she was about 15, her tune changed. We thought that it was because she was getting old enough to where her mother's (lack of) rules and structure was less scary and more to her benefit, so we pressed on. He finally won last spring shortly after she turned 17, and we brought her home shortly after.\n\nIt's been a disaster. She doesn't want to be here. She doesn't know anyone here besides her father. There's a huge language barrier, so she can't really talk to us, let alone make friends here. Those would be big enough issues on their own, but it's nothing compared to the practical issues.\n\nShe's supposed to have dual citizenship, but that either doesn't mean anything or it works differently than any advice we've gotten. Back in her home country, she was a senior in high school, and had already been accepted to several universities. She had some kind of driver's license. Here in America, all of that is meaningless. We can't get her even a learner's permit because her \"paperwork isn't right\". What's happening with school though...\n\nWe had heard that the credit transfer would be behind, but every school we've talked to would put her as a sophomore at best. This not only means that she can't graduate this year, but she'd be in high school until she's **20(?!)**.\n\nShe could get a GED, but that's looked down on by colleges here. We've looked into online, but the online options are viewed about the same or worse than a GED. If we were millionaires, we could just donate to some school to just give her a degree, but we aren't.\n\nSo by moving here, instead of graduating this year and going to college, she has to be in high school into her 20s or she can't go to college at all. \n\nThere is an option of sending her back home to live with her mother's friends to just graduate and get it over with and then come back. She'd have to make sure she was back in class there before April, but she'd only have a semester to make up so she could feasibly graduate on time. A high school degree from her home country would equal out, so she could go to college here with no issue.\n\nMy husband won't hear it. He thinks she'll run away and never come back. He's adamant that there has to be another option and that everyone is just \"going off of emotion\". 20 schools, 3 lawyers, and tens of thousands of dollars later, I don't think so. I think this might be the only option and that we're running out of time to take advantage of it. As much as I also want her here and want her in this family, this is the wrong time and we shouldn't have pressed for her to come here in the first place. We've been arguing for days over this, and time is running out.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I came here when I was 14, and as with any major change, it’s really hard. What makes it worse for teenagers, is that they have no perspective, so they feel that this “hellish existence “ will last forever…and ever…forever… I’m sure that she felt that socially she was at a certain point in the pyramid at her school, so starting from scratch will be worse. \n\nShe should perhaps spend the summer in an intensive ESL course, where she’ll meet people in the same situation, and no, her education will not suffer if she keeps up. Many immigrants get low scores in English but higher ones in Math, and colleges will know that she just got here, and look at her life experience etc, as a positive. \n\nIn the meantime, why don’t you guys do what’s done to kids: put index cards on things and their names in both English and her language? Use Google translate to talk, to get her and keep her engaged? Put some questions like “Where is”, “I feel”, “ I want”, “I need”, and use them in conversation, but reversing the languages at times?\n\nI got to the U.S.in 8th grade. The valedictorian from our class was a girl who had come from Peru 3 years before. I asked her secret, and she said that she read the paper/books out loud: this way, she improved her pronunciation, and tricked her brain into thinking that she spoke English at the NYTimes level.", "Your thinking on the GED is not necessarily accurate and you might want to revisit that idea. A ton of community colleges gladly accept GEDs and truthfully once you get her into some community GED and ESL classes I would be willing to bet she begins to make some friends and build her own life up. You also NEED to speak with an immigration lawyer about her paperwork,  assuming her father is an American citizen she absolutely is too regardless of where she was born,  lived,  and mothers citizenship status. That isn't a matter of opinion or judgment its immigration law 101.", "YTA. It's not for you to interject your opinion. It's between them.", "I am unsure, and tone of your message makes it sound, or I should say, leads me to the conclusion that you never really wanted her to arrive. And that you haven’t really tried to break the language barrier. I mean you had plenty of time to prepare. Your husband should have done advance preparation too. You could’ve made an effort to learn her language before she arrived. It’s been years right? … so what have you really done to help her? Just getting rid of her is not the answer. But you didn’t think it would ever really happen (her arrival) and now you just want her to leave. \n\nBut you need to remember that she is your husbands daughter. Never try to step in between Your spouse and their child. It will not end well for you if you continue. See how you can help and if her going home is the best thing for everybody, so be it … \n\nHowever, if getting her into college here is feasible, then there’s nothing wrong with that either. I think you’re just bent out of shape that she finally arrived. Am I wrong? ESH", "YTA if she wants to stay, but there is another option if she learns english.  She gets her GED and then start taking courses at a local community or state college and getting good grades.  They will let her in eventually.  If she wants to go to a better school, she can build up some good grades and then try to transfer.  People do it all the time.\n\nI'd recommend focusing on her English literacy.  If she can't learn the language she will be unlikely to have a good life here.  I can't learn another language myself.  I took two years of French in HS too.  Not my thing and I have an MS in a hard science.", "The real issue is that she would have to get re-enrolled before her 18th birthday to finish school there, so going back after age 18 doesn't help her as much.", "She wants to go home.", "The language thing gets me. There seems to be this great concern over college for OPs husband, but if she can’t speak English well, can she read / write it at a college freshman level? Or more so, does she even Want To?", "No, they don't have that option.\n\nThe worst part is how much of a timer this is on. In her home country, someone can be in their version of high school past age 18 as an active student, but can't enroll once they're 18.", "She's still 17 until April. She does speak English, just not super well.", "We did. Most places couldn't give us detailed answers because we had a lot less documentation, but some gave us similar answers. He (both of us reall) read anything vague as meaning that there were definitely other options and it couldn't *possibly* be that dire. Spoiler: it is.", "Colleges can accept whatever high school diplomas they want, and traditionally do accept diplomas from outside the US.", "Adding to this as another option I did (although it's clear daughter is miserable and does NOT want to be here).\n\n  \nI \"dropped out\" of high school when I was 16 to compete across the US trying to qualify for the Olympics. \n\nFor my last two years of HS, I packed myself up with Community College courses (including summer, including online). Sometimes you're just awarded the HS Diploma. I did my GED and those community college courses counted towards college credits. I CLEPed out of English 101 when I was 16, and I took the ACT instead of SATs because the way the standardized tests are designed, I realized my SAT scores would be way too low but I got REALLY high percentile with the ACT. Adding that in combination with the community college where I made President's List once and Dean's List twice, I transferred to a great school (...where I only survived one semester--academic probation for a C and the rest were Bs... not joking, didn't know that was possible), transferred to another state school, barely missed cum laude because of .1. I had one semester off after graduation and went to grad school and got my MFAW, but at a school that didn't recognize/accept the GRE because although I signed up, I never went to take the exam because I kept failing s those standardized tests. Would narrow the multiple choice down to two... then choose incorrectly.\n\n&#x200B;\n\nThere ARE options.\n\nTHAT SAID, I hope your husband listens to his daughter, truly. This is a horrendous situation.", "So basically your husband is willing to screw over her entire future so that he feels like he won whatever this extensive custody battle was about.", "Then NTA, she doesn't want to be here and he needs to accept that.", "This poor kid. You're really stuck in a tough situation, OP. NTA\n\nCan she go home to finish school and come back later? Maybe for a job or grad program?", "Based on OPs other comments, no she doesn’t want to even be in the US.", "Depending on what state you are in, you may be able to \"homeschool\" her to a HS diploma that colleges would accept. \n\nTry asking on some homeschool facebook groups for your town/county/state.", "I'm sorry because I'm sure her dad meant the best for her, but she's within a couple months of legally being allowed to leave if she wants so its hard to see how forcing her to stay would work.", "The bigger problem is going to be her lack of ability in English. She's going to pay tens of thousands of dollars for remedial classes because of the language barriers.", "In my thought process, I see them independently (language and location) \n\nSome people enjoy learning different languages, even if they don’t want to live in a country that predominantly speaks such. Other people either are not good with it, have no interest, or absolutely hate doing such. \n\nEither way, this poor girl being shipped all over the world is so sad to me. Especially since it wasn’t that her primary caregiver died, or an entire family work transfer, but just because the father decided “this is better”", "Your husband knows that if she goes back, she'll probably never come to live in the US again. Why would she? Her life is there. If she had come here at 5 or 8 or even 12 years old, it would have been different.\n\nIf she was forced to come here by the courts, she's going to feel immense resentment and will leave at 18 anyway.\n\nNTA.", "ESH.  Why on earth did you not realize the schooling would not be accepted?  How could anyone be so dense to think someone 16-18 years old would want to uproot themselves, change schools and move to a country where they do not even speak the language?  You both are for not figuring this out and for not taking her at her word that she did not want to come.  You two have ruined her life.  N-T-A about sending her back.  Your husband is a terrible father and completely self-centered.", "NTA. Your husband is fucking over his daughter. My ex's sister aged out of HS (the day she turned 20 she isn't allowed in public school anymore) and then failed her GED 8x bc she didn't get science and knew NO history. They weren't from America either. Such a waste. Give her a chance in her primary country, with a language she knows. She'll at best be a gas station attendant until she's 30 if she stays here.", ">She's supposed to have dual citizenship, but that either doesn't mean anything or it works differently than any advice we've gotten.\n\nCitizenship just means you can live in either place as a citizen. It has nothing whatsoever to do with school records / credits or driving/etc.\n\nNTA - if she'd rather be back home he shouldn't be forcing it", "NTA but your husband is and as soon as she is old enough to get away from him she is gonna run an cut contact", "If she did start as a sophomore she would have a higher gpa by the time she graduated and be able to get into a better school", "NTA She needs to go back and at least get her high school diploma. She doesn’t want to be here and if your husband forces her anymore, she will hate him and run away the moment she could.", "Nta, your husband is screwing up his daughter's life, if she didn't resent him then she'd surely resent his ass now.", "NTA so dear old ‘dad’ would rather humiliate and cripple his daughters future than let her have influence on Her own life?", "He is willing to ruin her life for his ego. He doesn't want backpedal and say to his ex that his child is better off there. But it isn't about him or the mother. It is sbout the daughter, her happiness and her future. \n\nShe should finish school in her old country and maybe she can go in a college where you live? \n\nBut with his way he will just make her resent her. Maybe book an emergency family therapy season. If he hears it from someone else and how the daughter feels in a guided surrounding...\n\nNTA", "> He thinks she'll run away and never come back.\n\nINFO: - \"He thinks she'll run away and never come back.\"\n\nRun away from where?  Run away from your home, so he feels some need to control her closely to prevent that?  Run away from her Mom's place, and if so, why?", "I’m an English language teacher in an international school. To put the language learning aspect in perspective, if she has little to no English, she’s looking at 2+ years before achieving fluency in conversational English, and 7+years for academic fluency. She can go to university before achieving full proficiency, but it will still take her years to achieve the proficiency to graduate school and get to university.", "NTA, as long as you support her return if she wants to do so. \n\nUnfortunately, the high school degree won't get her into college without English proficiency. She needs to be studying English and preparing for the TOEFL or SAT.", "Why doesn't your husband speak her  language? He doesn't have a language in common with his own kid?", "Send her back home right now to protect her from your husband. The both of you have already caused enough damage to this young lady.", "He does, the rest of us don't.", "Why would dual citizenship mean that educational milestones are equivalent? Dual citizenship means she has the rights of a citizen in each country. It doesn't have educational equivalency connotations.", "NTA - why did it take til she was basically an adult to get custody? That's incredibly counterintuitive even if you weren't in completely different country with entirely different logistics and language/cultural barriers. Ask him if forcing her through what I'd classify as a legal kidnapping for the remainder of her youth was worth losing a relationship with her forever in the next couple years. He's just set back the trajectory of her entire life, for what? So he can say he won custody of a practical adult? I can't get over the fact that he got custody just in time for it to literally not even be worth anything. That's seriously pathetic.", "You're NTA. It was a huge mistake forcing her to leave her home country to live in a foreign place where she doesn't speak the language very well, does not know or wish to know anyone, and is being put back a few years in school. This doesn't sound like it was done out of her or concern for her, but rather just to be the winner.\n\nI feel for Lidia. 17 is a tough enough age without having your life reordered just to feel like a pawn or a trophy child.", "ESH why the heck couldn’t you have found these things out Beforehand?", "NTA. Don’t say anything g else. Leave your husband to ruin her life and her to hate him and not you. Poor girl. Life ruined by a manipulative dad.", "NTA", "Info what does she want?   She should be the one driving the decision here, she is practically an adult", "NTA. \n\nHonestly, I would find an interpreter and tell your stepkid that you want to help her get back to her country. But you neither of you can tell your husband. Ask her what you can do to help her get back to her family and do it. \n\nIt might be wrong to lie, but it will be far better for her in the long run to go home than to stay there and let your husband ruin her life. \n\nOnce she's safely back in her country you should rethink this felationship. Especially if he's willing to ruin a child's whole future just so he can claim that he \"won\" some imaginary contest. \n\nHelp her get back home any way you can and fast, ignoring your husband's wants.", "Yeah. I have friends that adopted a baby from Guatemala. They discovered when he was 14 that the paperwork never went through and he wasn't a citizen. What a f--- mess.", "He needs to realize that he has less than a year left until she turns 18 and if he is determined to screw her over until then that is all the time he is ever going to have with her because she will justifiably hate him, and she will leave and not come back as soon as she is able.  Would he rather have a few months with her or a lifetime?", "Then do whatever you need to do to help her get home. Then divorce this jerk. \n\nYour husband doesn't just get to ruin her life because he wants to control her. \n\nIts not good to lie, but this is one instance when lying is far better. When your saving her and saving her future. \n\nI dont know why he's pushing so hard to keep her in America, but he doesn't sound like he has good intentions. Im betting she feels like a prisoner in your home. \n\nHelp her get home and fast.", "Buy her a plane ticket and put her on a plane Op. Send her to her mom.\n\nDon’t let your husband ruin her future. She had a life at home, goals and was on her way to being an adult. In the US, nothing. \n\nNTA", "You’re NTA but your husband sure as hell is. Tens of THOUSANDS of dollars and he STILL won’t listen to reason? Arrange for her to go back, behind your husband’s back if you have to. You’ll be saving a young woman a lot of heartache and wasted time.", "Dad seems really controlling. She want to go and would do so much better there, but none of that seems to matter to him.", "Has anyone actually asked the daughter what she wants?", "Moving to a whole new life at 17 is different than moving when you are 4 or 5. I can understand her problem.  If she is to stay, I would recommend talking to the admissions officer at a state university. Explain the situation and discuss the option of her being admitted with a GED. Many state universities will make concessions to enroll students of diversity.", "NTA. What does he think is going to happen when she turns 18 and can legally tell him to go screw?  \nYour husband is doing this to spite his ex wife. That's the only thing I can think of. He doesn't care about Lidia, that's for certain. This is epic tantrum on his part, and the damage he's doing is irrelevant to him.", "NTA. Has anyone asked this girl what she wants? At 17, she's entitled to make decisions about her own life. With guidance, for sure, but ultimately, the decision should be hers. Y W B T A if you allowed your husband to keep pushing his agenda ahead of his daughter's wellbeing.", "NTA but your husband is", "Can you give her a homeschool diploma? As long as she has enough credits to meet the state standards. Sophia.com is fast and has the major subjects. The credits would be dual credit and she could transfer in to a state university as a sophomore with 24 hours. Another idea is to have her take dual credit classes at a community college. I would think  outside the box. It's way easier to get her into college than a get a degree from a local high school.", "YTA -or rather, your controlling husband is. Of course she e3eds to go home and decide what SHE wants to do. Poor young woman. This is abusive.", "NTA. He uprooted his daughter and basically ruined her future right at the tail end of being a minor before becoming an adult. She had everything set up in her home country to succeed and he decided he didn’t care what she wanted. What he did was cruel. He didn’t even bother to spend the last 17 years learning the language she speaks. \n\nWhat a terrible situation you’re in, I’m so sorry OP. I hope he comes to his senses soon.", "Has anyone asked what she wanted?", "And think you guys need to talk with her about it and let her decide what options she wants to take. If she has buy in on the plan then maybe she’ll be happier. I mean that is why all this has meaning right? Her Dad is the one operating on emotion only.  NTA", "Your husband is deeply cruel to do this to his daughter. I doubt she will forgive him if he doesn’t fix it before her birthday.", "NTA. She’s old enough to decide for herself. He will never see her again if he tries to force her.", "NTA\n\nShe doesn’t want to be in a new country at one of the MOST significant times in her formative years. She deserves to be where she wants. \n\nHusband is MAJOR A-Hole for dragging her here against her will.", "Pleasenrepirt him to CPS.", "Per OP she wants to go home.", "Then do what you can and send her back", "Of course she does.", "I don't know where to begin. You and your husband are so clueless about language, education, rospects, meeting the complex rules of travel between countries. And her interests and needs. Please do your best to remedy this horror story asap, before an educator, neighbour or socialmworker acts.", "This. This right here.\n\nDo not ignore this. She IS her own person, with her own mind, despite his determination to see her only as a reflection of himself, and she WILL hate him and he WILL lose her. This incident has only *exposed* it, it's a problem regardless, and the outcome is *inevitable*. You cannot fix it. You probably cannot even delay it. This was in motion before you got here, and you need to get out of the way, or be crushed.\n\nHe's not rational or reasonable. And that's REALLY important for you to absorb. This man believes he needs to be in control, and cannot accept when he's not, even up to the bitter end, even when it gains him nothing and could cost him everything.", "Why would she?", "Literally no, because she was adamant about not wanting to come and nobody listened.", "You sound really empathetic and caring for her. So please don’t take offense at this. \n\nIn addition to all the other mess of school, driving, friends, etc this has caused, she is living with you, who as kind and nice and concerned as you sound, cannot even talk to her. \n\nI mean, getting a stepparent at any age is challenging, but I don’t know how much she even knows you and you two can’t even really communicate?\n\nI hope your husband listens to you. And I hope one day you and her can form a nice bond because you seem to be the only one here in the US that is truly thinking of her best interests.", "I know. The daughter is at a huge loss. Staying in high school until she's 20 will be a waste of 3-4 years, combined with the language barrier and lack of social life is bound to make her feel lonely as ever. OP's husband should get over his ego and do what's best for the kid even if it means sending her back. NTA", "\"He's adamant that there has to be another option and that everyone is just \"going off of emotion\"\".  \n  Your husband is the one going off of emotion.  What he's doing is absolutely not  in his daughter's best interest... academically, socially, personally... it's entirely for HIMSELF.  Your stepdaughter will suffer because of his selfishness, but probably not for long... only as long as it takes to get the heck away from him and go back to her home country (and good luck with her ever wanting anything to do with him again afterwards.)  \n\n\nYou're NTA.  Your stepdaughter... is entirely a victim here, and your husband is being a world class AH to his own daughter.", "NTA she’s old enough to figure out where she wants to stay and she does not want to stay with your husband and you and you’re forcing her. What do you think is gonna happen when she turns 18 she’s got a run.", "First of all your wrong about the GED. She can still get into a good college. At the very least she can for sure do community college for a few years then transfer for a full time program. However NTA I think your approach is logical", "NTA", "If you are in the US, I don't think the universities here are worth it anymore.  For example, in Europe, you can go to medical school and law school right after high school, but in the US, you need a bachelor's and then you can go to get your MD or JD.  It's not just that; university education has seriously declined in the past 20 years, especially in the past 10.  And it's very expensive.  And I say this as someone who loves learning.    \n\n\nSomeone needs to have a heart to heart with the girl to figure out what SHE wants to do.  Maybe an unbiased, respected third party like a counselor or a priest.  That way, this person can make sure your husband hears what she's saying.", "As soon as she’s 18 she’ll be gone anyway and will never speak to her father again for screwing up her life.", "You're NTA, but your husband is. Tell him if he doesn't want to lose his daughter forever, let her go back to get her high school diploma. You and your husband can emphasize later that getting college degree in the US will be more beneficial for her wherever she wants to spend her life, thus making it clear that if later she wants to go back to her home country, she can, and employers there might find her US degree attractive. If during her college years she finds living in the US is better, then I'm sure your husband will be very happy.\n\nThis is all with assumption that your husband will finance her education and that he didn't work so hard to get custody just to kick her out when she's 18", "She is absolutely miserable here. Someone needs to take what SHE wants into account. Especially since she is practically grown. 18 is considered an adult in the US. Let her go back home.\nEdited to add NTA.", "NTA I read you comment of “she wants to go home” he needs to let her this poor girl shouldn’t be uprooted and life destroyed like this for “a better life” what is better for her?", "Nta. That is so stupid. Here in America also, I work with the afghan refugees and so many of the kids haven’t gone to school or did very little and they got put in the grades that correlate to their ages but get extra help with ESL and other staff to get them caught up.", "Then you need to do the decent thing and give her the money to buy a plane ticket.", "It was a mistake. Quite frankly, all of this paperwork stuff (highschool, college applications, etc) should have been taken into consideration before she got to the US. \nYour husband is literally ruining her future out of spite? Ego? Power trip?\n\nShe is 17? If she has any intelligence, she will save money and buy a plane ticket back the second she is 18 and just lose one year and a half of her life instead of 3 or 4 or more. \n\nPoor girl.", "i would've been *pissed* if I had been uprooted and moved to a different town in the middle of high school. I cannot even imagine how furious I would've been if I got dragged to a different country with a language barrier and all my college plans vaporized, for no good reason.", "And what are the odds of that happening? He has made it very clearly that the only thing that he cares about himself... his feelings, his victory in the legal custody fight, him, him, him.  He doesn't actually seem to care at all about his daughter."]}