{"id": 949, "submission_id": "ykisbm", "title": "AITA for spending £500+ for 2 nights at the hotel instead of giving it to my friend?", "selftext": "I (f29) am going to my first big concert later this month. It’s in London and I’ll admit, as a true crime junkie, I’m having some anxiety going to a big city on my own (I’ve never been to London before) but since I understand it’s not healthy, I’m not going to miss out on the experience.\n\nBecause of that, I decided that I will go (I’m going on my own) but I will save money to book a hotel that’s close to where h w concert is so I don’t have to travel around London at night on my own. I thought it was a great solution although painful when it came to paying.\n\nFor obvious reasons, the concert was postponed for ages and I was able to save up for the trip. And I booked my hotel a month ago, spending approx. £500 for 2 nights stay. It’s expensive, I’ll admit but I saved up for a while so I can enjoy something as safely as possible.\n\nI was talking to my friend (f31) today and she asked when I’m going and we had a chat and she asked me how much the hotel is as she wanted to go to London next year. So I told her and and said I saved up for a while for it.\n\nShe freaked! She told me she couldn’t believe how insensitive I was, how when she asked me to lent her money I refused (she still owes me over £2k, I wasn’t going to lent her more) and she’s struggling as a single mum and I’m a shitty friend when all this time I was sitting on this money that could’ve help her out (she wanted a new phone because she dropped hers on a night out and it cracked). \n\nI said that I’m sorry but she still owes me money and that I worked hard to afford this. She kicked me out of her house and now have been telling people what a shitty friend I am.\n\nAm I really the asshole here?", "created_utc": 1667425944, "permalink": "/r/AmItheAsshole/comments/ykisbm/aita_for_spending_500_for_2_nights_at_the_hotel/", "score": 33, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > What may make me an asshole is that I spend outrageous amount of money on a hotel when I refused to lent money to my friend.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "First off, per capita many cities are safer than rural assuming you stay out of the bad neighborhoods.\n\nNTA, she is a grifter.  Cut her off and demand the money she owes you.  DO NOT give that girl another cent.", "NTA. Let’s break this down - you have lent your friend money, which they have not repaid. \n\nSeperately, you have saved your money up to enjoy something. That’s fine. Does your friend never spend money on any hobbies, interests, etc? Go enjoy it, you’re not remotely close to doing anything bad.", "Confused why she thinks she entitled to YOUR money. You don’t owe her a thing. She literally owes you. You work hard and you have every right to enjoy yourself and treat yourself. She’s not a friend. Seriously. You don’t owe someone that much and get an attitude theh wont give you more. She’s needs to go.", "NTA - you've already lent her a lot of money, she  hasn't paid you back and is now criticizing the way you spend your money? Money that you saved??? That's some audacity she has.", "NTA. Why does she feel entitled to your money when  she owes you alot already? Enjoy your trip, go LC with your friend.", "NTA- in what world would you be? She is already delinquent in paying back what she owes you. And your money is in no way hers to spend. The nerve!", "You should have attacked her too: so you owe me money but you are planning to go to London next year??? How dare you!!!\nObviously, she has just found a way to never give your money back...\nNTA", "NTA - your money, your choice.\nHell, you could've set the money on fire and you still wouldn't be the asshole.\n\nSpending the night at a hotel close-by is something I do too when going out.", "So how are you the AH in this Situation? It’s your money, she owes you, she should have better finances. It’s not like she is your family member or wife or something that you could help without something in return. NTA", "NTA. You've already helped her out but she sees you as some sort of cash machine that she's entitled to draw money from. A real friend would be happy that you're doing something you really want to do and that you'll be safe  Enjoy yourself at the concert and think carefully about what you tell her in future.\nEdit: she damaged her phone on a night out as well!", "NTA- you don’t need to set yourself on fire to keep others warm. If your mutual friends say anything let them know she owes you 2k and you’ll be happy for them to fund her vacations and new tech whenever she decides she needs it", "NTA", "NTA \nYou worked hard to save that money, spend it how you like…", "NTA\n\nDon't worry about it, she probably owes money to the people she's badmouthing you to, so they know who the AH is.", "You will never get your money back from her.", "NTA\n\nWhy is it she thinks your money is also somehow her money? It's not and she isn't entitled to any of it.\n\nGood luck getting any of the money you loaned her back. Don't throw good money after bad.", "NTA I know being a single parent is hard, but you’re not her parents nor her kid’s parent, so it’s 100% not on you to provide for her. Not to mention she doesn’t need a whole new phone because she cracked hers while she was (presumably) spending money she could’ve been giving YOU on a night out. Poor planning on her part doesn’t constitute an emergency on your part. Spend your money how you want.", "NTA.\n\nYou’ve already given your friend money, you saved to stay in the hotel, and you deserve it.\n\nAnd even if none of that were true, you still wouldn’t be the AH, because you are under no obligation to ‘lend’ (cough give cough) your friend money.\n\nPerhaps one of the people she complains to about you can lend her money while you find a better friend.\n\nAnd the fact that she wants the money not for rent or groceries but to replace a phone SHE dropped and cracked is the hypocritical icing on the entitlement cake.\n\nEnjoy the concert!", "NTA. Funny how you were a great friend when you loaned her 2K. Now when you spend your money on yourself instead of loaning her more money you'll never see again you are suddenly a sh###y friend. I think she has you confused with a ATM.", "NTA. This person doesn't really sound like she's your friend, it sounds like you're her ATM. Like if she's really so hard up for cash maybe she should spend the night in? Or pick up an extra shift that you and be dropping your phone on nights out", "You need to set a deadline for the money she owes you in writing.  You’ve turned off the tap and you are no use to her anymore", "NTA. She owes you an insane amount of money and hasn’t paid any of it back. Why would you lend her more?", "NTA, your friend is though. She already owes you money and she needed more for a new phone because she broke it on a night out.... screw her and don't lend her any more money she's just using you.", "Nta, the fact that someone who owes you £2000 has the nerve to suggest you can't spend money on yourself is the height of entitlement. Not only is this person selfish, but they obviously don't care about you/your feelings. You need to cut her out of your life immediately.", "NTA. Money saved for a purpose isn't money that's free to just use. You were saving for something. Even if it was just random savings with no purpose, you don't owe her anything, Whether she already owes you money or not. It sucks as a parent when you're really struggling financially but that doesn't mean it's on you to bail her out. That's on her. If she owes you 2k already then it sounds like she's been struggling for a while and expects everyone else to bail her out instead of finding ways to make healthy changes for her and her family.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f29) am going to my first big concert later this month. It’s in London and I’ll admit, as a true crime junkie, I’m having some anxiety going to a big city on my own (I’ve never been to London before) but since I understand it’s not healthy, I’m not going to miss out on the experience.\n\nBecause of that, I decided that I will go (I’m going on my own) but I will save money to book a hotel that’s close to where h w concert is so I don’t have to travel around London at night on my own. I thought it was a great solution although painful when it came to paying.\n\nFor obvious reasons, the concert was postponed for ages and I was able to save up for the trip. And I booked my hotel a month ago, spending approx. £500 for 2 nights stay. It’s expensive, I’ll admit but I saved up for a while so I can enjoy something as safely as possible.\n\nI was talking to my friend (f31) today and she asked when I’m going and we had a chat and she asked me how much the hotel is as she wanted to go to London next year. So I told her and and said I saved up for a while for it.\n\nShe freaked! She told me she couldn’t believe how insensitive I was, how when she asked me to lent her money I refused (she still owes me over £2k, I wasn’t going to lent her more) and she’s struggling as a single mum and I’m a shitty friend when all this time I was sitting on this money that could’ve help her out (she wanted a new phone because she dropped hers on a night out and it cracked). \n\nI said that I’m sorry but she still owes me money and that I worked hard to afford this. She kicked me out of her house and now have been telling people what a shitty friend I am.\n\nAm I really the asshole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA you aren't her bank and you aren't responsible for her finances. You loaned her money (that you aren't likely to ever see again) and she wants more. The saying is, don't throw good money after bad. She's a bad risk, and ridiculous for suggesting you should be giving her your money rather than enjoying it yourself.", " NTA. On no!!!! Her phone is cracked!!!! From a night out!!!! She’s going to London next year!!! How dare you spend your money on yourself!!!!", "NTA, she already owes you £2k;  Her struggling does not make you a bad friend.  If you had helped her instead of taking this trip, she would just owe you more."]}