{"id": 957, "submission_id": "yk7s8b", "title": "AITA for raising attention to the fact I can hear my neighbours having sex?", "selftext": "We had new neighbours move in a few months back and at least a few times a week you can clearly hear them going at it. \n\nBy going at it I don’t mean the muffled moan or bed post bump on the wall, I mean full on screaming, swearing, grunting etc. think over the top adult star performance.\n\nSo this has been going on for a few times a week (new relationship etc, I get it) but it’s so loud that we have to put music on to mask the noise and hopefully get the point across that we can clearly hear them.\n\nLast week it got to breaking point. We are due to have guests with children over the coming holidays so I thought that I’d bring it to her attention that we can hear them to avoid embarrassment should she find out a room full of people next door can hear the performance. \n\nThis did not go down well. \n\nThe response was extremely condescending, saying that things like this aren’t supposed to be talked about and I was creating an issue out of nothing. Now there’s a friction between us. \n\nI’ve not heard them since but because of the reaction I received, AITA?", "created_utc": 1667401821, "permalink": "/r/AmItheAsshole/comments/yk7s8b/aita_for_raising_attention_to_the_fact_i_can_hear/", "score": 82, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Pointed out that I can hear my neighbours going at it\n\nNow they don’t talk to me at all\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You're in a building with a shared wall (or more than one) and it's on folk to be aware of their effect on the other residents. \n\nBesides, you were nicer than I was when it happened to me... my upstairs neighbours were prevented from \"completion\" when I shouted \"OH, GOD!\" right at the moment she would have shouted it. They never apologised either.", ">The response was extremely condescending, saying that things like this aren’t supposed to be talked about and I was creating an issue out of nothing. Now there’s a friction between us.\n\nI once had to have this exact sort of conversation with somebody in an apt building I lived in.  I told them that it pains me to have to discuss this delicate and extremely private matter with you.  If you are embarrassed, then you can imagine that I am too!  Frankly put, I cant help what I hear in my own apartment and bc of your noise, *Im involved in your business*.  Where I dont want to be!  I want my own privacy.  I want you to have your own privacy  and not make me aware of your lovemaking.  \n\nThat being said, its understandable in multi dwelling construction, there will be some sound travel.  But an over the top porn star performance is too much...  I get she is embarrassed and so are you.  This is one of these uncomfortable conversations where there is no easy way.  You just have to rip of the bandaid and get it over with.\n\nI dont think you are TA for bringing this up with your neighbor.  NTA", "NTA\n\nAre you hearing them through thin walls or are they leaving window(s) open?\n\nThere's a very real possibility they are just exhibitionists who are enjoying your reaction.", "NTA\n\nWhen you live with shared walls like this, it's with the understanding that you need to pipe down at certain times. Now we all love a good time in bed, but have some respect for others. No need to be porn star loud every time, multiple times a week.\n\nThey were probably pissed as they were embarrassed.", "NTA. \n\nReproduce [this note](http://www.thedailytop.com/wp-content/uploads/2014/07/50aabeee547a443260b7a9f7981722b2.jpg) and leave it on their door.", "Many years ago, when I lived in LA, I had neighbors like that in the small apartment complex I lived in. After one particularly ( maybe spectacular) evening performance, a bunch of us stood outside their balcony in the courtyard and loudly applauded, shouting \"Bravo, bravo! Encore! The 2 of them came out on the balcony, thankfully clothed, bowed, then went back inside. They turned the volume down quite a bit after that...", "NTA - you did the mature, polite thing.\n\nNext time they're going at it, loudly cheer them on.", "NTA. You had to try, but were bound to fail.\n\nAs Robert Heinlein's fictional character said in his novel *Time Enough for Love*:\n\n>Never attempt to teach a pig to sing. It's a waste of time, and you'll annoy the pig.\n\nIn this case, it's about teaching the pig not to sing, but the same principle applies.\n\nOh. Wait. The pig learned? The problem is solved? Great!", "if things like this aren’t supposed to be talked about, they’re definitely not meant to be heard either. NTA", "NTA. They were probably just embarrassed and lashed out", "NTA\n\nI'd record it from your house and send it to them.\n\nOr, put on super durpy, chipper carnival clown, music on super loud and aim the speaker at the wall whenever they start up. Just completely ruin the mood and rythm. \n\nOr have ALL of your guests just burst into laughter when they get loud. (or fake this by using a realistic laugh track)\n\nIf they don't stop, talk to the other neighbors and emphasize they're creepers who know children can hear them and that makes them louder. I'd also maintain an attitude of unimpressed \"you're pathetic and have no self control\" when speaking with them.", "NTA", "An anonymous note works wonders, next time.\n\nNTA", "NTA.\n\nYou mentioned that her private life was intruding on the peace within your home. You weren't going out of your way to try to eavesdrop. \n\nIf things like this weren't supposed to be talked about, then they definitely should not have to be heard. \n\nYou weren't creating an issue. The issue already existed due to their actions. \n\nKeep it moving, OP. You didn't say or do anything wrong.", "Start playing [Cbat](https://youtu.be/VmCqEGNLK4I) when they go at it\n\nNTA", "NTA. I'm all for adults enjoying themselves and I know that when you live in apartments/shared housing you can hear things, BUT the screaming and swearing are a bit much. The fact that you haven't heard them since means they can enjoy themselves quietly.", "NAH It's just an embarrassing moment :P", "This is probably going to be a fringe take, but NAH.\n\nJust put yourself on the other end of it. They'd have no certain way of knowing how well the sound carries unless they're on the other end of it, and when you confronted them with it they were probably pretty embarrassed. Music carries differently than voices. Some people go straight into a defensive position when challenged like that, especially if you don't know them. Yeah, would be great not to hear it, but don't tell me y'all don't get wild sometimes and make too much noise? Happens to the best of us occasionally, unless you don't have sex (which is fine). Ultimately you let it be known in a mature manner, which is all you can do.", "Honestly... NAH.  Living situations with shared walls are not ideal because you can hear other people living next to you, but as long as the noise doesnt come during quiet hours, there really isnt anything you can or should do.  If you dont want to hear the noises of your neighbors, move somewhere where you wont be sharing walls with anyone.  They have every right to have sex in their apartment.  You had the right to make them aware of it, they had the right to respond how they see fit, now that they know you can hear them there really isnt anything you can do.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe had new neighbours move in a few months back and at least a few times a week you can clearly hear them going at it. \n\nBy going at it I don’t mean the muffled moan or bed post bump on the wall, I mean full on screaming, swearing, grunting etc. think over the top adult star performance.\n\nSo this has been going on for a few times a week (new relationship etc, I get it) but it’s so loud that we have to put music on to mask the noise and hopefully get the point across that we can clearly hear them.\n\nLast week it got to breaking point. We are due to have guests with children over the coming holidays so I thought that I’d bring it to her attention that we can hear them to avoid embarrassment should she find out a room full of people next door can hear the performance. \n\nThis did not go down well. \n\nThe response was extremely condescending, saying that things like this aren’t supposed to be talked about and I was creating an issue out of nothing. Now there’s a friction between us. \n\nI’ve not heard them since but because of the reaction I received, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  I'm torn between \"they are embarrassed\" and \"they thought they were putting on a great performance and you didn't give them the applause they wanted\".  Either way, NTA.", "NTA.  You even got what you wanted, with the added bonus that your condescending neighbors are now ignoring you.  This entire situation is full of win for you, OP.", "I had this problem... college students above and the girl still thought sex needed porn star noises. (Cringy plus annoying plus a massive trigger for me from trauma.) I ended up banging on the wall and they stopped being loud.", "NTA\n\nHearing someone having sex is very uncomfortable and not just that, they should also respect their neighbour by lowering their voice down. Im not saying they cannot have sex but tone it down\n\n>This arent suppose to be talk about\n\nWell if you lower it down then it wouldnt be talk about. They are loud, of course people would talk about it. \n\n> I was creating an issue for nothing\n\nYou weren't creating an issue, you were just informing them that they should not be too loud as  you were having children with a guest and that its actually weird or uncomfy to hear your neighbour having sex", "I'm so sorry we were that loud. I had no idea the walls were so thin.\n\nYTA.", "It's funny that the neighbor said these things shouldn't be talked about,  and they wouldn't if they weren't so loud. Making it awkward makes it go away or makes them double down.", "That's perfect!", "The former. Old houses but crap sound insulation", "Don't cheer them on, provide unsolicited feedback. \n\nEdit - even better idea, provide either a sportscaster style play-by-play or a David Attenborough Natural Geographic style narration.", "Mad props for the Heinlein reference.  Those are pretty thin on the ground these days!", "Didn’t tell anyone how to do anything; just brought attention to it as described above. \n\nAs for how it’s gone, I haven’t heard them since but they may not be friendly anymore.", "Sound carries. Thinking adults know this.", "Yup. To OP's neighbour I'd have said just that.", "Critique the quality of sound! Yes!", "Yes we do. And go ahead and try to tell someone how loud they can have sex in a place they pay for. LMK how it goes.", "I have. Most of them have been conscious of the effect on their neighbours afterwards. \n\nWith the belligerent, entitled MF'ers, I've reminded that I pay for my place, too, and that they can close the damn windows if they want to scream during sex. Even in a heat wave. And that if it happened again at midnight on a work night, I'd be complaining to the HOA/management."]}