{"id": 9582, "submission_id": "10yc8sr", "title": "AITA for doing an Irish exit at a restaurant so I wasn't stuck with the bill?", "selftext": "I was lucky enough to get a great job after I graduated.  I make pretty good money and my job is challenging but fun.  \n\nSome of my friends didn't bother with college and some who did go chose less lucrative fields.  \n\nI'm not rich or anything.  I'm not buying a Porsche any time soon.  I just have a good salary and very few bills since I still live at home.  \n\nI got a very nice hiring bonus when I was recruited and I took my friends out for, what I made clear, was a one time celebration.  \n\nEvery once in a while I get together with my friends and go to a restaurant.  We usually end up splitting the bill.  I don't drink a lot so I might have a beer with my meal but that's it.  I know they don't al have disposable income like I do so I usually also cover the tip. They tend to go overboard.  Like one girl orders five or six drinks over the course of the meal.  And she will order appetizers \"for the table\".  I never eat the appetizers because they are almost always deep fried and I tend to avoid that stuff.  It is also common for one of us to leave and just cash app or leave money for the bill. \n\nLast Saturday we went out to a nice Mexican place.  The food was excellent and my margarita was delicious. That girl brought her girlfriend and a couple of the guys brought their girlfriends.  \n\nI mentioned that I had to have an early night. After we finished eating I hung around until everyone started ordering more drinks and desserts and stuff.  And I'm not joking here one girl ordered a to go meal for her roommate.  \n\nI excused myself and went to the bathroom.  Afterwards I paid my bill at the front of the house and bailed.   \n\nI started getting texts about 45 minutes later.  The bill came and they wanted to split it.  I told them I already paid and had to leave. My bill was $55 including tip.  The three guys and the girl were going to be splitting the remaining $640. They wanted to split their guests bill as well.  The other guy who didn't invite someone was saying it wasn't fair for him to split the bill when I didn't.  I said that I had paid my food bill and I wasn't going to give more.  \n\nThey ended up each paying their own bill and one guy ended up paying for his, his date's, and her roommate's food.  He is especially salty about the situation.  \n\nThe other single guy also ended up just paying for his own stuff and he is also in their bad books.  \n\nI feel bad for leaving without saying goodbye but if I had stuck around I would be subsidizing food for strangers.\n\nEdit\n\nI'm sorry if I offended anyone with the term Irish exit.  I didn't know it was an insult.", "created_utc": 1675991754, "permalink": "/r/AmItheAsshole/comments/10yc8sr/aita_for_doing_an_irish_exit_at_a_restaurant_so_i/", "score": 1327, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I paid my bill and ditched my friends at a restaurant when I knew they expected me to pay part of their bill.  I might be the asshole for not being more clear up front that they were on their own.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "\n>They ended up each paying their own bill and one guy ended up paying for his, his date's, and her roommate's food.  He is especially salty about the situation.  \n\nYeah, because he was trying to get everyone else to pay for it and failed. He'd also be salty if he tried to steal $100 out of your wallet and you caught him.\n\nNTA. Yes, it would have been better to be more direct, but the reason for their upset isn't because you left without saying anything, it's for failing to subsidize their greed. If you want to hang around these people again, just be blunt from the start that it's separate checks.", "NTA.\n\nI hate people who know either the meal will be split or paid for by the host but still order a meal to go. My blood boils thinking of how many dinners I had dealing with the entitlement.", "NTA - Good job reading the room.", "NTA it’s best to let wait staff know up front that the checks are separate. Say it in front of everyone. You’re not an ATM. Good for you for paying your bill & your tip then getting out of there🙌🏻", "Well played\n\nNTA", "NTA. There is usually a couple of people that totally go overboard and try to \"sneak it in\" under the radar thinking that no one will notice.  It caught up with them this time, lol.\n\nYou're wise enough to not get taken advantage of.", "NTA.\n\nAs someone else who MAYBE has a single drink with a meal, when you go out and everyone expects you to split a bill that includes excessive numbers of drinks, it’s an AH move on their part. \n\nIf everyone basically gets the same thing, splitting things evenly between the group is fine.", "NTA. They were taking advantage of you and they spent nearly $700 presuming you would cover it, or at least a significant part of it. I wouldnt have paid that either.\n\nSneaking out might not have been the greatest but by the same token, how much more courtesy do you owe some clowns who not only presumed you were going to foot a big chunk of the bill, but ran it up for that exact reason?", "NTA  You need to find new dinner companions. If you bring a date you don't expect others to split that cost. You order food for someone who's not there then that's a separate check. \n\nFuck them, they're taking advantage of you.", "NTA!! Shame on them for being so entitled!", "NTA, do y’all not regularly get itemized bills and do some quick math and figure out true totals that way? That’s what my friends and I do. One of us covers and the other person Venmo’s at the table (I’m not leaving without the money in my bank acct!). Anyway, splitting everyone down the middle is a rip off and they know it.", "NTA at all. Rude of the freeloaders to invite people, run up the bill like little piggies, and expect you to take care of them. Good on you! Next time, if there is a next time, they'll know better not to do this to you or anyone else again. Jesus.", "NTA \n\nYou need better friends.", "NTA\nyou're not their bank or ATM \nProps to u", "NTA- you and the other single person need to insist that you’ll each have your own Bill! No more of this splitting the Bill crap.", "NTA - they were intentionally trying to force you to pay for their food and their guests' food (and even the roommate's to go order, that's so far over the top it's funny), this is just bad faith, and to try to turn it around on you like you're in the wrong for not paying for their shares is indefensible.  \n\nWhy should you pay for their food and drinks exactly?  Because... they want you to pay more?  Did you agree to do that in advance?  Nowhere here do you say you agreed to do this.  And with the pattern of ordering you describe, they're clearly knowingly taking advantage, and if they're trying to paint you as the bad guy, these people are users and not really trustworthy friends IMHO.", "NTA\n\nBut I feel like you should have gone back to the table and said I paid for my portion, good to see you guys, I have an early morning. Other than that, you're not expected to pay anyone else's bills so they have no cause to be upset.", "NTA. No one is ever required to pay more than their personal share.", "NTA but it sounds like you need new friends", "Honestly, you all bring this on yourselves. Why don't you just all say that you're all going to pay for your own bills instead of splitting the bill when people are known to abuse that privilege? \n\nNTA, but just be upfront with your \"friends\".", "Nta, they just taking advantage of you", "NTA but are people just allergic to having direct, grown up conversations?", "Who just splits a large bill? Why would you not each pay your own bill?\n\nNTA", "NTA, but you guys should make it clear in the future that you want to do separate bills.", "Nta.  Next time make it clear up front what the split is but nobody should expect others to pay for their food", "NTA. To be blunt, it sounds like they are trying to use you to pay for their champagne lifestyle on their beer budgets.", "NTA. From now on when you order clearly state to the server you want individual bills.", "NTA you made your point tho for sure. I think they were slowly creeping up the mooch. IF they invite you out again, stick with new, clear ground rules. Say, let’s do separate checks. If you want you can also say, “first rounds on me” as an early and defined gesture.", "NTA. Not once have I dined with a group of friends and split the bill evenly.", "NTA they were clearly trying to take advantage", "NTA \n\nThese people sound like leeches.", "NTA.  Sometimes people try to take advantage and they get p@ssed when it backfires.", ">Edit\n\n>I'm sorry if I offended anyone with the term Irish exit. I didn't know it was an insult.\n\nWut? Can anyone explain? - because Google is lending no help.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI was lucky enough to get a great job after I graduated.  I make pretty good money and my job is challenging but fun.  \n\nSome of my friends didn't bother with college and some who did go chose less lucrative fields.  \n\nI'm not rich or anything.  I'm not buying a Porsche any time soon.  I just have a good salary and very few bills since I still live at home.  \n\nI got a very nice hiring bonus when I was recruited and I took my friends out for, what I made clear, was a one time celebration.  \n\nEvery once in a while I get together with my friends and go to a restaurant.  We usually end up splitting the bill.  I don't drink a lot so I might have a beer with my meal but that's it.  I know they don't al have disposable income like I do so I usually also cover the tip. They tend to go overboard.  Like one girl orders five or six drinks over the course of the meal.  And she will order appetizers \"for the table\".  I never eat the appetizers because they are almost always deep fried and I tend to avoid that stuff.  It is also common for one of us to leave and just cash app or leave money for the bill. \n\nLast Saturday we went out to a nice Mexican place.  The food was excellent and my margarita was delicious. That girl brought her girlfriend and a couple of the guys brought their girlfriends.  \n\nI mentioned that I had to have an early night. After we finished eating I hung around until everyone started ordering more drinks and desserts and stuff.  And I'm not joking here one girl ordered a to go meal for her roommate.  \n\nI excused myself and went to the bathroom.  Afterwards I paid my bill at the front of the house and bailed.   \n\nI started getting texts about 45 minutes later.  The bill came and they wanted to split it.  I told them I already paid and had to leave. My bill was $55 including tip.  The three guys and the girl were going to be splitting the remaining $640. They wanted to split their guests bill as well.  The other guy who didn't invite someone was saying it wasn't fair for him to split the bill when I didn't.  I said that I had paid my food bill and I wasn't going to give more.  \n\nThey ended up each paying their own bill and one guy ended up paying for his, his date's, and her roommate's food.  He is especially salty about the situation.  \n\nThe other single guy also ended up just paying for his own stuff and he is also in their bad books.  \n\nI feel bad for leaving without saying goodbye but if I had stuck around I would be subsidizing food for strangers.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA those leeches are not your friends. drop them like the deuces they are", "NTA. Your “friends” are entitled people who use you. You simply made that impossible this time. Good going. In future, separate checks!", "NTA - they were clearly using you for your money, they have no right to complain after their ATM ran away.", "NTA. \n\nI hate this. Like really hate this. If people are paying for themselves they order less than if someone else is paying. When someone else is paying, that’s the time to not go crazy ordering.", "NTA That was the perfect solution. The horror of having the pay their own way!", "NTA. Everyone should pay for their own things. It’s not fair for the person who just gets mashed potato and apple juice when the others get steak and a fancy drink. \n\nYou could’ve waved and said bye though.", "NTA. It might be time to hang out with a better group of people who aren't trying to take advantage. Stop covering the tips and be clear it's seperate checks from now on.", "NTA but I do think there are better ways of handling things like this.  I think if you had excused yourself and said I'm gonna take off, I'll pay my bill up at the front or asked the server to bring just your bill they would have gotten the message.", "NTA. They wanted you to pay over 3x your bill… no thank you.\n\nIn the future though, I would make it clear that you will be paying for only what you order and nothing else.", "NTA arms fuck people like this.  Unless it is stated that someone is treating everyone to a reasonable meal, it should be a given to pay for yourself.  Not rack up $100 in drinks, get food for 3 people, and then expect to split with everyone.  You wanna order half the menu? Then pay for it.  And even if someone is treat8n you. You should absolutely be at least prepared to pay for your guests and the takeout that weren't explicitly stated in the invitation.  Some people have absolutely no shame.", "There's one of the lesser circles of hell for people who order \"appetisers for the table\". They are ordering stuff they want to eat but other people to pay for. Many of the other people won't get any or won't want any, but still have it added to their bill. \n\nWhat did they guy who brought his girlfriend expect? That everyone would pay for the pleasure of her company? Entitled AF.\n\n&#x200B;\n\nNTA", "NTA. Only go to restaurants with the single dude, from now on.", "Who are these people!!!!   I’m shocked at the assumption.  Salty dude pissed he had to pay for him and his girlfriend and her roommate.  Well don’t order for people who aren’t there.  And if she’s your guest you should pay for her or she pays for herself.  Idk what kind of people these are.  Makes me think they as usually take advantage of the situation.  Shrewd move by you.  Very much NTA.  All your so called friends are.  Can’t believe they texted you after you left.   Like you were gonna return to pay for other people’s dinner.  Lol.", "NTA - not your job to subsidize other people's food. Sure as hell not a roommate's order that isn't even there. Pretty ballsy of your friends to get upset when other people won't pay for their food.", "NTA I have a 3 friends in our friend group that do this shit so when they come to outings I let the server know ahead of time before everyone gets there that my bill is separate so I don't drive them crazy trying to split the bill later. I pay mine tip well because I know they'll have to deal with the bs and go wait outside. Past few years no one really invites them anymore but they pop up when they see us out on social media. Pet peeve", "NTA.\n\nI understand that it can be a pain to get separate checks when you go out in a large group, but with some people, it's the only way to go. Once you see which people keep it fair and which ones order freely because they won't have to pay for their extravagance, you know what you have to to do.\n\nI have warmed my petty heart twice, with the same people, by asking for the server to split the check after the meal. They liked nice wine, but never shared from their bottles. I'm a no appetizer, one cocktail diner.", "NTA. I loathe splitting the bill . I refuse , I pay for myself and if I want to pay for something else , I will offer, like this add this appetizer or that drink .   I am also the person that probably order me the most and I won’t even feel comfortable splitting my 80-100 tab with someone who’s total ia much less. I don’t know who started this trend but if everyone isn’t in millionaires tax brackets we need to stop it .", "NTA and who the hell thinks it's okay for a random female to order a dinner to go for her roommate. Jesus Christ", "NTA.  \"Friends\" showing up with other friends and roommates that are strangers to you is rude.  They were looking for a free meal.  \n\nNext time, announce in a loud, clear voice, that everyone pays for his/her own meal, drinks, whatever.  Make sure the wait staff knows that the bill will not be split or paid by you.", "ESH\n\nabsolutely you should not have had to pay for anyone but yourself. They suck for trying to take advantage.\n\nBut you didn’t need to ghost. You could have been -\nan adult and said, “I’m on a budget, I’ll foot my own bill, but I can’t cover anybody else’s.”", "ESH\n\nYour friends for taking advantage and you for not just growing a backbone and saying \"I can't pay for everyone all the time\".\n\nAlso the phrase \"Irish exit\" is kind of bigoted and ignorant.", "Soft YTA for skipping without saying goodbye, but you were completely within reason to *openly* pay only for your own meal and then leave.", "I’m sure you will be the next CEO. You know these are things my friends and I clear up before going. \n\nMaybe NTA but you don’t sound nice. Also, what is the Irish exit? I don’t know this term.", "ESH. Irish exit aside (which sounds like a slur but not one I'm familiar with), if these are your friends, you should be able to speak up, not sneak out. If you can't say to your friends that everyone needs to cover their own bill, you need to grow up.", "> I'm sorry if I offended anyone with the term Irish exit. I didn't know it was an insult.\n\nNot to pile on but almost any kind of nationality/ethnicity term (see also Indian giving, etc) is probably an insult", "ESH. Y’all ain’t friends.", "YTA. On the core issue, it's ESH. Y'all need to learn to communicate like adults. However, I'm downgrading you to AH-in-chief for \"Irish exit\". What the racist fuckery, mate?", "ESH. ~~\"Irish exist\" is a slur, and~~ you ducking out without saying anything was an AH move.\n\nThat said, your friends expecting the five of you to split the cost of meals for three guests was even more of an AH move. If they wanted to split evenly, it should have been divided eight ways and the three people who brought guests should have each paid for two shares while you and the other unaccompanied guy each paid for one. That would have bumped your total up to $87 or so.\n\nAnd even that should have required your consent. It should not have been expected especially when you said earlier that it would have to be an early night for you.\n\nThat said, there were only two ways for you to avoid being an AH. You could have asked for a separate check from the start. Or you could have behaved like an adult and used words to tell your friends you would only be paying for yourself. If you had said that before you left, they might not have racked up such a big bill.\n\nEdit: I stand corrected.", "ESH I hate when people do this. Someone always gets stuck with more than their fair share and I don’t understand why they can’t just have the waitress do separate tickets. Most places will allow it. The fact that they are mad at you shows they are trying to get away with something. But you should have just said No, I can only pay for me own.", "Soft YTA because it’s super weird to have just left. You should have said that from now on you’ll be paying your own bill and tip (understandable), rather than just running away.", "NTA. Hopefully this makes your friends realize they can't keep over-ordering like this. You did well getting out of that situation paying your fair share", "NTA. Sounds like your \"friends\" were taking advantage of your generosity far too many times. You're responsible for the cost of your own meal, which you covered.\n\nPersonally, I'd stop hanging out with people like this, at least in places where an aggregated bill is involved.", "NTA, as a canadian no one really splits bills like that, we get asked together or separate. Together or individual bills, couples together?, etc. As a bartender it's very very rare I get a group that asks me to just split it in half, but more common with american tourists. I think it's odd, the software is super easy to split by guest seat, harder to split by equal portions. They're both easy, but it's just weird. My friends an I will order rounds, people order rounds off me, that person always has that round on their bill. Who orders pays. Super weird habit, splitting bills by equal shares is not necessary and only creates tension.   \n\n\nI point out the canadian vs american thing because we have the same tipping culture and the same general dating expectations when it comes to paying, as well as friends grabbing rounds etc.", "NTA. You didn’t let your friends take advantage of you. Nice work.", "NTA - these people are NOT your friends!", "How did they not notice you were in the bathroom for 45 minutes?!?!?!  \nNTA", "When one person orders disproportionally less, there should be no splitting of the bill. I go out with my sisters a lot and we only evenly divide the bill when we’ve ordered roughly the same cost of food. We don’t haggle over a few bucks. But if one of us is getting a $25 burger platter and the other a small $10 bowl of chili, we pay for what we ate specifically.", "NTA. Leave early from now on if you don't want to pay the bill for these people. Know who they are and act accordingly.", "NTA-- Reassess your friends. (Other single guy should also do this)\n\nAre you their friend or their discount?", "NTA. Your \"friends\" were apparently ordering a *lot* of food and drinks,  assuming you would be splitting the bill.  They were taking advantage of your generosity.", "Haha I'm irish but I never heard of that before but I love it and must tell my mates and nope not offended. Nta, they were being greedy and taking advantage. It probably looked bad to them though that you sneaked off.", "NTA", "NTA. You simply paid for your own bill. Good job leaving then.", "NTA the first time you “split”the bill with them after the initial treat you gave them you fucked up. Next time you go out with them make sure you let the waiter know that you want your bill separately. That will send a clear message that you will no longer be playing their games of free food and drinks all around.", "NTA. In situations like this, I love a good Irish exit!", "NTA, but it's so fucking weird to me that there are people who split bills like this. Is splitting bills like this suddenly a common thing? Because I'm in my 30s and have never encountered a situation like this ever--everybody just pays for their own itemized bill or one person pays and we venmo them later with what we owe for the food we ordered. Nobody likes equal splits on bills except for huge assholes who want to order a fuck ton of food and make others pay for it. So why do you go out with these \"friends\" if they pull shit like this? They sound awful.", "Nta harsh lesson for all.", "NTA\n\nWhen I go out with my friends and it is not a birthday invitation or something like that, everyone pays their own bill. Splitting the bill evenly when everyone ordered things of different value sounds totally idiotic to me. It punishes the ones eating and drinking less or cheaper stuff. It is just unfair and I don't know why anyone does it. It is just a breeding ground for resentment and conflict which can easily be avoided. \n\nYou are not the asshole for not wanting to be used for your money again.", "NTA\nAnd evaluate on the people you call friends. Sounds like booze and expensive food and your credit card are more desired than you.\n\nThe icing on the cake…took them 45min to realize you were not even there. \nAnd they only called for your money.", "NTA for not wanting to split the bill but YTA for how you did it.  You could gave asked for separate checks when your server first arrived. Loud enough so everyone could hear. Even better, you could have messaged the group ahead to say from now on you'll just pay for what you consume since you gave different ordering patterns from others in the group. That allows them to adjust to the new reality.\n\nYou've grown up in other ways, so develop adult communication skills to match.", "NTA \n\nCombining and splitting bills is one of the trashiest ways of getting a discount.\n\nYou could be the one ordering $300 worth of food but getting it cut slightly with some of the cost going to others 💀\n\nF all that. Give me my separate check and I'll be going about my business. Most restursnts have it set up separately for a reason.", "NTA, I’ve never understood people who think it’s okay to take advantage of others in this way, good on you. It should probably be discussed before hand next time as it would just be creating healthy boundaries and healthy communication.", "NTA These are not your friends. They’re mooches.", "NTA\nThey knew what they were doing here and just saw you as the money bags and their free meal ticket. Good on you. If you decide you still want to dine out with them in the future insist on paying separately. They did this on purpose and are using you. Massively disrespectful. Do not feel bad at all", "If you were on mumsnet they call your friends cf. Cheeky fuckers.", "Absolutely NTA no one should have a problem paying for their own food that they ordered. From this point forward ask for a separate checks when you sit down.", "NTA but I would have told them a long ass time ago that I'd be paying for me and only me as well as asking for a separate bill.  I would say maybe a soft YTA for not being up front with them.", "NTA nicely played", "You paid your share nta", "Nta", "NTA - you should't have to carry moochers, it may be nice to treat your friends on occaision. But you are under no obligation to buy meals and drinks for people you don't know.\n\nEveryone paying their own is always more fair when theres weird spend patterns.", "EDIT - NTA I misread and thought the situation was the one time celebration. This was just a random dinner with friends? Super rude of them, definitely NTA.\n\n~~INFO~~\n\n~~What exactly did you say and what expectations did you set about going out and \"taking your friends out for dinner\"? That really influences where behaviour goes from acceptable to taking advantage of you.~~\n\n~~If you said you'd split it or cover all/some, then the later behaviour indicates they were maybe taking advantage, but you didn't handle that well either. You could have set better expectations up front, or raised the issue with your friends in a collaborative way when the dinner was wrapping up. Sure it may be uncomfortable, but if you can't discuss and figure out a fair solution to a common problem with your friends, then that's not great, eh? Instead you just bounced to avoid the immediate problem.~~\n\n~~If you were explicit early on about covering their meals to a certain extent, then probably ESH, because while they weren't great, your response wasn't either.~~", "YTA for the racist comment re the Irish, wtf. Do you think it would be acceptable to say something derogatory about any other people. \n\nanyway, you are not the asshole fire paying for just your own food, but you should have been upfront, why did you have to hide", "yeah I don't blame you for what you did but YTA for the racist term \"Irish exit\" you didn't know it was an insult> really? Using an ethnic label for running out on a bill? Like I Welshed on a bet or Indian giver? You can't see that? give me a break", "ESH. They were taking the piss but they're your friends and you could have given a clear warning first.", "You know you’re going to get roasted over the use of Irish Exit right, even with your edit. \n\nMoving on, NTA, your friends kind of suck honestly. I have friends that I have no problem slitting the bill evenly, but I also have friends that I will never pay for more than what I had because they will take advantage and go off the wall! Your friends are taking advantage of the split, but you already know that. I would put a permanent end to splitting.", "this: \"the reason for their upset isn't because you left without saying anything, it's for failing to subsidize their greed.\"", "Funny how his date and her roommate didn’t pay in either. Maybe he should be salty at them instead.", "If I were OP I would definitely be rethinking these friendships. Totally NTA but the people who apparently ordered certain things because they thought OP would be subsidizing the bill are.", "NTA\n\nOP should also note that there wasn’t a single complaint about the Irish goodbye, just that there were problems splitting the bill.\n\nAlso, in the age of Venmo who the hell splits a bill evenly anymore!?! I’ve never seen anyone under 40 want to do that unless they were trying to get others to cover their excess.", "This runs the risk of his “friends” guilting him into paying/splitting the bill and OP folding because of the guilt and it being a public place. These mooches seem like the type to publicly berate until OP folds.", "Yeah the one guy has no one to be pissed at but his girlfriend. Who orders for her roommate if she herself isn’t even pitching for the bill?", "Exactly.   When I go out with friends I immediately tell the waiter that it's separate bills.  My friends have told me they appreciate that as they feel too awkward to do it.", "It’s a cultural thing. In my experience much more common in the uk than the USA", "It’s leaving without saying your goodbyes. But I have never in my life heard it to be insulting from Irish friends or otherwise.", "An Irish exit is when you just leave. No goodbye. Just take off. I didn't know it was an offensive term tho. I definitely use it. Just like MN goodbye or Midwestern goodby-which is the total opposite. You say bye a million times, inching closer and closer to the door until finally 2 hrs later you're on the road home.", "> Irish exit\n\nGoogle has it covered.", "AKA \"French leave\". When you just vanish. It's not an insult.", "I agree fully with you. Whenever I order \"appetizers for the table,\" it's either because I'm *buying* the appetizer for the table (because I like the people I'm eating with and want to), or I discuss in advance who wants in so we can account for it on the bill accordingly. The folks I typically go out to eat with follow the same standard.", ">Also the phrase \"Irish exit\" is kind of bigoted and ignorant.\n\nI'm Irish, and I've never found it bigoted, but I've also never understood it. My experience is that Irish people take forever and a half to leave with about 30 attempts at \"Ah I should be going then\" which get stopped with conversation and more tea until finally you end up with \"Okay well it's past time now lads, I'm up early in the morning.\"", "I’m Irish. The term “Irish goodbye” is not bigoted, ignorant, or anything offensive. Don’t listen to this SJW.", "It’s sometimes called a “French exit,” where you just disappear without saying goodbye to anyone or being seen.", "To leave a party without saying goodbye to the host is known as a 'French exit' in the UK, an 'Irish exit' in the US, a 'Polish exit' in Germany and an 'English exit' in France.\n\n\"Early versions of the term Irish Exit come from Irish Americans leaving social functions like Church, football games, and plays. When the functions let out people would congregate outside and chat with each person they knew and say goodbye before heading home. This usually added 30 minuets to an hour to the evening. When there was little or no time to do the customary goodbye, the family would leave through the side door. The side door move became known as the Irish Exit.\"\n\nLiterally nothing to do with racism but rather a stereotype caused by Irish Americans, each country has its own name because of which ethnic group would do it most commonly.\n\nIt's also called \"Dutch leave\" by some, can't find out which country though.\n\nIts kinda ethnophobic, should you be offended? No... its not really an offensive thing, its like the \"Asians are smart\" stereotype. It falls into the \"overly sensitive\" part. If you don't like it, just don't use it...", "Nope, not racist at all, Irish goodbyes are a thing.", "not racist in the least", "I don't think Irish people are a race", "> However, I'm downgrading you to AH-in-chief for \"Irish exit\". What the racist fuckery, mate?\n\nOh ffs. I'm irish born and bred and I love it. Stop looking for offense.", "Which part is racist, exactly?", "The way you have it is. Are you upset that Irish people are on the planet and exist? Lol\n\nBut seriously, the Irish exit (or goodbye as my Irish friends call it) is not a slur. I’m sure you can find a few Irish people offended by it, but most Irish people have awesome and wicked senses of humor and they absolutely use this phrase themselves (even about themselves!)… at least the Irish (from Ireland even) friends I have.", "> Irish exit\" is a slur,\n\nLOL, no. Not everything 'ethnic' is an immoral characterization.", "You literally made that up, stop making everything a slur. When everything is a slur, nothing is a slur. Good grief", "Wtf?", "I'm sorry I didn't know.  I can't edit the title.", "Literal Irish people are fine with it. Stop going out of your way to speak for groups you have no association with.", "That's not what \"Irish exit\" means. It means to leave without saying goodbye, not to dine-and-dash. It's not an insult.", "> Also, in the age of Venmo who the hell splits a bill evenly anymore!?! \n\nPeople who don't want to do math? As long as people keep things roughly even, it's easier to just divide a bill than it is to tally up stuff from the itemized receipt. Venmo just means I don't carry cash.", "I've heard it theorized that the English coined the term to paint the Irish as \"rude and discourteous\".", "That's why I was confused, it's a badge of pride for myself. \n\n20 years under my belt of flawless Irish goodbyes.", "I think the idea behind it is something to do with being drunk - like you sneak out drunk before everyone at the party realizes how drunk you were.  Which feels less Irish and more….me. That’s what I do. I am guilty.", "I'm Irish too and this is my understanding", "The term \"Irish Exit\" implies that Irish people are prone to leaving social gatherings without saying goodbye or bc they're too drunk to do so. So it may not be offensive to you but it was meant to be offensive lol", "I think it's a thing where the area you live in calls it something different. So dipping where I live is an Irish goodbye but we call the lingering MN goodbye or Midwestern good bye. Obviously some terms are more universal than others.", "Irish Goodbye is what I’ve always heard and it refers to leaving the bar without saying goodbye to everyone.", "We call this \"milling\" in my family. Trying to leave but standing around for another hour chatting.", "I've been saying it since 2003 about myself 🤣😂🤣", "I’ve always heard it as an “Irish goodbye”, and I learned it from my Irish friend.", "You don't need to, real Irish people dgaf", "Do not listen to these blowhards looking to be offended on behalf of the people who don’t find it offensive.", "Literal Irish people are also not fine with it. How tf do you know whether this person has any association or not?", "I can assure you that I have “association“, which is actually a weird way to say I am Irish.  I think it’s insulting to describe sneaking away as an Irish trait.", "Leaving without saying goodbye is impolite and cruse and calling it an \"Irish exit\" goes back to the English colonial/imperialist days when then Irish were all supposed to be uncouth and crude so yes it is absolutely an insult\n\n:crude", "Someone further down in the comments said it’s an American thing to refer to it as such, and that other countries have the same concept but just attach a different nationality to it.", "Some ridiculous looking to be offended geniuses in the comments is all", "I think it's actually just sneaking out so you don't have to say goodbye to your 80 family members for an additional hour. That's how my Irish family does it. It's hilarious that everyone is just trying to avoid everyone else.", "It's because the Irish are a talkative people and when you start saying goodbye, it takes hours to go through and speak to everyone before you leave. So it's easier to just quietly slip away. I don't care if other people want to think it's offensive.", "Same. Never heard the “French” iteration.", "So your family is know for milling about", "Irish heritage here and my family always uses Irish Goodbye! We also call it Houdini-ing. And we're proud of it 🤣", "I have Irish family members. They are fine with it. Irish people in other comments have said they are fine with it. Check yourself next time, maybe do a bit of research before you speak on the behalf of others, yeah?", "I'm Irish too, with family still living there. You and that other commenter who are arguing with me seem to be the exception to Irish folks who have no issues with the term.", "We do. It's actually a long running family joke about how bad we are at milling and how long it takes us to go anywhere.\n\nWe are not Irish, however.", "I have lived in Ireland. My grandfather emigrated from Ireland. I have no need to check myself but thanks.", "Just because you have no issues, doesn’t mean it’s ok. There are plenty people in the world who think it’s ok to say certain other slurs for other nationalities, religions, sexuality, gender, colour etc. It doesn’t make it ok.  You think it’s ok, that’s fine in your own company of like minded people, but  slurs on people are generally not acceptable in 2023.", "Well then we both have Irish blood in us. I have no issues with it, but you apparently do. None of the fine Irish folks I know have any issue with it. Maybe it's just you.", "It's not a fucking slur it's figure of speech.", "Coming from the person who just criticized me for speaking on behalf of others this is an interesting take. I’m going to take a wild guess that you haven’t met the vast majority of Ireland’s population, let alone discussed this issue with them, so perhaps don’t assume that a small sample group is representative of an entire nation’s opinion. There’s a whole country full of people with perspectives you know nothing about. \n\nAnd for the record, there are Irish people who associate the origins of the term Irish goodbye with the Famine. To quote the first non scholarly but clear explanation google provided: It attributes the phrase to \"the Potato Famine of 1845-1852, when many Irish fled their homeland for America. At the time, distance and technology meant that when someone went to America, they were gone forever and it was unlikely they would ever again speak to or see friends or family back home. The departure was sudden and absolute.\"", "NTA - They were taking advantage of you.\n\nI've had $600+ bills before, when I've taken my wife to places like Roka Akor in Chicago (Fucking phenomenal, btw) and ordered Kobe wagyu. But it takes \\_work\\_ to get a bill like that at most restaurants. They were ordering expecting to get a mass discount by taking advantage of everyone else - or worse - some of them were going to sneak out without paying \\_anything\\_.", "Who TF goes out to dinner and doesn't expect to pay their portion of the bill? \n\nNTA, and frankly, I would only do separate checks with these greedy assholes going forward.", "I will never understand splitting the bill this way. I have never done it, and it’s weird. Either one person pays for the table, or everyone pays for their own. I have never been to a restaurant that doesn’t just ask at the beginning how it’s being split, and puts people on separate tabs. \n\nEven with things like appetizers and bottles of wine, you either ask them to split it x ways, or you tell them who’s tab to put it on if one person offers. \n\nI wouldn’t want to pay for someone else’s extravagance when I’m getting something cheap, and by the same token, I’d feel bad having someone else subsidize my fancy cocktails.", "NTA. I learned early on, always request separate bills if the restaurant allows it. I have also seen checks that were overcharged and had the server refigure to show the real prices. One friend was embarrassed and I said I wasn't going to pay an extra $7 a person because that made her uncomfortable.", "NTA you paid your share so idk what they're talking about. \n\nWait....\n\n*rereading*\n*reading a 5th time because what*\n\nThey ordered $700 worth of food, even a meal for someone who wasn't even there, and thought you were gonna pay for food you didn't even eat? Ew.", "NTA you absolutely did the right thing.\n\nYou might want to take a hard look at whether these people are friends you want to keep going forward.", "NTA… you also need new friends…", "NTA. You need new friends.", "Why would Irish exit be insulting?  I’ve done the Irish Farewell for decades at parties that look to be hunkering down for an all-nighter.", "NTA. I'm irish and GTFO those who are offended.  Drink me under the table if you are real Irish. Otherwise you are a bloody poser", "Did you invite all these people out?", "In France, the Irish exit is filer à l'anglaise, which basically means english exit, when you leave without saying bye or playing the bill... So basically it's sticking a rude attitude to a nation that you have historically been in conflict with. An other french idiom that means a girl is on her period is \" the english have landed\" as historically english army had red coat.", "YTA for not communicating which method of payment you prefer beforehand and then ditching them. NTA for not wanting to split it though, I totally get that, but you need to say this right away, like before you even order (maybe before you get to the place). It was rude of you to just leave them like that.", "You are young and seem intelligent. These bumbs aren't your friends. Drop them and make new friends. NTA I am so glad you didn't pay for them.", "NTA. You paid for your food. You don't have to pay for anyone else's.", "NTA but your friends really suck.  If I were you I would always ask for a separate check right when you order of you want to continue being friends with these bunch of moochers.", "NTA - Unless it's explicit in the invite, everyone should pay their own damn bill!", "NTA.  Say you want a separate bill upfront when you order.  Makes it much easier later.  Or get new friends.  Lol", "NTA.  Good for you standing up for yourself and not allowing them to take advantage of you.  Inviting people you didn't know and expecting you to for the bill is such blatant disrespect.  I was going to y t a you for your title, but I see you've realized the term is not appropriate.   Good job on that too!", "NTA but the more adult thing to do would have been to address the issue beforehand.  Tell them you will only pay for yourself and tell them why.", "If anyone is to be angry at anyone here it’s the guy at his gf and her roommate for trying to get that meal out the guy and all three if he was in on it\n\n\nN\n\n\n       T\n\n\n\n               A", "NTA\n\nWhy aren't seperate tabs normal? You pay for what you ordered and don't get stuck with anyone else's tab.", "100% Not the asshole. \n\nI'm also a non drinker, and I find it ridiculous to split the tab w heavy drinkers. \n\nThese booze hounds aren't throwing me money for weed.  \n\nW that said all my friends are big drinkers, and even THEY don't expect me to throw in on their alcohol", "NTA. I agree it would have been much more mature to announce at the outset you wouldn’t be paying, but the outrageous behaviour of your friends retroactively justifies it.\n\nI’d love love love you to ring your salty friend and just kindly ask him to explain why he expected you to cover dinner and drinks for him, his gf, and the room mate? Like, how do you possibly justify that explanation.", "Definitely NTA!", "NTA.\nFrom now on I would only pay for what you yourself eat and drink plus you own tip, and see how quickly they all go from drinking 5-6+ drinks each time down to 1 drink with dinner.", "Dude, is Irish exiting something that is better than Welshing? My family is American,  but largely Welsh. My husband’s family is Irish. I would like to hold some insult over them as they are still angry my kid has a welsh name.", "What the hell is wrong with your friends? You're not their daddy. I've never seen anything like this.\n\nNTA", "NTA", "NTA and I'd probably never go out to eat with them again. They seriously rung up over $200 each while you had $55 including tip? Sounds like they got fed up with bleeding you dry slowly and just upped the ante 100%.", "Yeah as a general rule I feel like people shouldn’t order apps for the table unless they’re planning to pay for them. Also I’ve never come across a situation where I’ve had to split the whole bill evenly? Whenever I go out with friends or whatever we pay for what we ordered..", "NTA", "NTA. And ild stop going out to eat with these people.", "NTA My friends and I will often split the bill equally, but based on number of people, and with the assumption that everyone ordered roughly the same thing and everyone is too lazy to determine who is paying for the appetizer that everyone shared. \n\nFor example, my wife's birthday had 6 people, my wife and I, one solo friend, and one group of three. Everyone ate a meal within a few dollars of each other, everyone had 2-3 drinks, and we all split 3 appetizers. So rather than figure out who owed what based on meals, and how to divy up apps, we divided the bill by 6, then the solo person paid 1/6, we paid 1/3, and the family of 3 paid 1/2. No muss, no fuss. \n\nIn our friend group, if someone ordered way more than others, that person always offers to somehow compensate the others, perhaps they put the whole tip on their tab, or next time out they pay more, or they just throw a couple of bucks at everyone. But this is all done with common courtesy among friends, who want to remain friends, and respect each other. \n\nWhat you have is a group of assholes trying to mooch off you.", "You need a better friend group. NTA.", "WTF???? Why would I pay anything towards his girlfriend's ROOMMATE????????? Unless you invite them Wich you didn't, hell no, no even, the roommate?? Seriously 😒\n\nNTA OP", "NTA.  Great friends./s", "INFO: Why are you friends with these people? If you can’t even tell them to their face that you don’t want to split a bill and have to sneak out without saying goodbye?", "NTA. I am surprised that it's standard practice to split the entire bill evenly everytime. All through my twenties and now early thirties that has never been a thing with my friend groups. We all pay for our own. Sometimes if there is an appetizer shared by the table, a couple people will split that particular item. Or if I'm with one friend and I want to go get ice cream I will pay for it, but nothing to the extent of appetizers and drinks that I didn't order. I think you should just suggest at the start of the next get together that checks are separate and if they all want to split that's fine, but yours is separate. And then I wouldn't partake in any appetizers or desserts for the table, just to be transparent and keep my hands clean of any criticism. It's shouldn't be that deep with grown adult friends but I guess if they were use to going out on your dime and you are putting a stop to it, you may find out who your real friends are.", "NTA. Splitting the bill makes zero sense in general and this is a perfect example why.", "NTA I would be doing this every time you go out with the group. It can even be your party trick", "NTA you paid your bill and left. If you didn't pay your bill then you'd be an AH.\nHave you ever talked to your friends about this? A simple convo can go a long way.\nI think you need to have a conversation going forward with your friends that you will not split bills, and you will only pay your own way.", "NTA\n\nHandled smart.", "Nta. I also never knew an Irish exit was an insult? My husband and his family are Irish and they take pride in their Irish goodbyes. In every gathering, they joke around on who will pull the first Irish goodbye.", "NTA. Years ago I went out to dinner with friends. There were six of us and things were fairly even, when two people decided they wanted additional beers and another entree only they ate. \n\nI didn’t want to look cheap but I was like “really guys? You ordered extra stuff only you had but want to split it evenly?” And the others looked at me like I was being unreasonable. I wasn’t as assertive back then and didn’t want to cause a scene so I just paid but I never ate out with them again.", "NTA, separate checks is a thing for a reason.", "NTA. Why would you have to pay for someone else’s bill?", "So they’re mad because they had to… (check notes) …pay they’re own bill? Yea, NTA", "NTA. Smart move. I would stop going out to eat with those people altogether since it isn't the first time they tried to pull something like this.", "NTA. I wouldn’t go out to eat with these “friends” of yours again.", "You are NTA. I would have done the same.. on a side note, modern POS terminals that us hospitality employees use now typically have the option built in to split bills by seat positions which means as long as the server uses positions for every order going into the system the total bill can easily be split into individual bills based on who ordered what. It doesn't take any extra effort on my part other than pushing the \"split by seat number\" button and then HUZZAH!! We can tell each of you what you owe us without y'all having to do any math. You went out with people with champagne taste and Budweiser budgets and that is not your kuleana to pay for them", "NTA. In fact YTH (You're the Hero).\n\nPretty sure the other guy was thinking \"this is some old bullshit\" when the others ran up the tab expecting  it to be split evenly with everyone else.\n\nYour actions gave him the confidence to speak up. Good job.", "NTA the friends were leeching off you. Hopefully now you have set a precedent and it won't happen again. But next time you go out make sure you state you will only pay for your meal.", "NTA. Clearly your friends thought that they could take advantage of you considering you were in a more stable position then they were. What you did was show that you’re more than the friend group pocket book. Good show mate.", "Nta, simple as that, people were trying to take advantage,good call", "NTA, also TIL the phrase “Irish exit.” ngl it sounds badass imo but if the Irish are offended by it I won’t use it", "NTA, why do you have a bunch of free loaders for friends?  You probably should have paid at the front and then said bye to everyone.  \n\n&#x200B;\n\n>one guy ended up paying for his, his date's, and her roommate's food.  He is especially salty about the situation.\n\nThis guy should be salty at his date, not you.", "NTA I applaud this, and I would have done the same. Don't let your friends use you. They aren't very good friends to assume you would pay and dear lord what a bill.", "NTA !!! don’t ever apologize for taking a stand against bullshit and next time you go out make sure they know you’re paying for your bill not there’s it’s not your problem what they ordered. It’s on them.", "NTA that’s just reasonable. \n\nOn another note, is this an American thing ? Where I live they just bring everyone’s individual bill to the table or ask us how many bills we want. Everyone pays for their own stuff and that’s it.", "NTA. I go out with the same group of friends once a month. We normally split the bill evenly because we normally get pretty much the equivalent and we want to make it easy. If you order within $5 or so of each other, it's not really a big deal and will even out. However, if I decide to get a to go meal for my boyfriend, I'll suggest separate checks. Or if someone splurges on an expensive entree when no one else does, they volunteer to cover the tip or chip in extra some other way. \n\nI used to have a friend who would order twice the food as everyone else and always expect to split the check evenly. I don't go out to eat with that friend anymore. If they did it once or twice, I wouldn't have cared, but they did it literally every time.", "NTA. Maybe it’s just the way I grew up, but I’ve never understood splitting bills evenly that you didn’t contribute to evenly. Everyone pays for what they ordered. Why isn’t that the norm everywhere?", "> I paid my bill\n\nNTA at all.\n\nThis splitting the bill thing seems popular in the US and I don’t get it. When travelling in the US I didn’t understand why restaurants don’t just bill everyone for what they order? \n\n> They ended up paying their own bill\n\nGood. I’m so confused why this isn’t the default from the beginning..?", "NTA you did the right thing, the dude who’s gf brought her roommate food should pay for that or she should. These people are taking the P with you and not acting as friends, if you decide to continue going out for meals with them you should always state separate bills to the waiter before in case they try to leave without paying next time", "NTA. These people sound like freeloaders. Good job on the escape.", "NTA, and it’s about time someone in the group changed the dynamic. There’s no point in splitting the check evenly, when they can easily split the ticket with one click, as long as the server kept up with who ordered what.", "NTA.\n\nThis is the reason I got used to getting separate bills for my meal. I tip extra for them doing this though.", "OP needs new friends.", "Irish goodbye executed to perfection", "NTA. You saw that people were trying to take advantage of you and you graciously and smartly avoided it.\n\nThese dynamics get introduced when a group is not/is no longer on equal footing in terms of resources AND people get exploitative about it. It can come up with friend groups like this who evolve into different lifestyles, multigenerational families moving through life phases, coworkers who eat out under varying circumstances... Unless someone specifically emphasized up front they would hosting it is ALWAYS someone's right to pay for what they order. Agreeing to split the bill is a convenience that needs to be unanimous and mutual. For many groups it only makes sense when things are roughly even.\n\nYes it is great if one person is better resourced than the others for them to offer to cover an appetizer, one round of drinks, the tip... but that has to be an offer.\n\nIt is never cool for \"five cocktails and dessert\" to ASK \"one beer and left early\" to split the bill evenly. That always needs to flow the other way. \n\nSo CAN a group split a bill evenly? Sure, if that's what everyone wants to do. And it can be annoying when someone wants to argue over who did or didn't have cheese on their burger. But it is never an entitlement.\n\nNow that you've clocked this group for being this way, you might need to either switch to places that will do separate checks, order-at-the-counter, or other arrangements where it is crystal clear from the beginning that people are paying for what they order.\n\nAnd sadly you probably can't treat them anymore, even with just \"covering the tip\" because they are twisting that into expecting you to always pay more than your share.", "NTA for the bill splitting to be fair everyone should order similar stuff, like a dish and a beverage, and pay their own alcohol. I have gone out with coworkers on birthday meals and ended up ordering a salad and lemonade and paying for other people's booze, appetizers and deserts. These were managers, team leaders, etc and I a jr analyst.", "My friends and I always do seperate bills and take turns paying for each others birthday meals", "NTA. These people are not your friends, you know that, right?", "You’re NTA but you are a coward. Just tell your friends you prefer everyone pay for themselves. \nThis is what most people do.\nInstead of being uncomfortable for 30 seconds you just made a bunch of people bitter towards you. \nWhy can’t people just communicate I swear 🙄", "NTA but stop hanging out with these people or make it clear from the start you are only paying for your food", "NTA. I despise the concept of splitting the bill equally because people do tend to take advantage. Bravo to you for kinda giving everyone a reality check. Their reaction proves that they were totally expecting to pay way less than what they consumed!", "Splitting the bill only works if \n\n1. Everyone is eating/drinking about equal and \n2. In a group like that, should be agreed upon at the beginning.\n\nWhen you have a mix of not eating appies, not drinking and single vs drinking a ton, ordering appies and getting food for the roommate, no way that gets split evenly. Your friend has a right to be salty about paying for three people's meals but not with you.", "NTA - Why is it that people don't have these conversations beforehand? I sometimes get stuck with the bill when folks come to visit and most of the time it's not a big deal, but every now and then you get the one asshole that orders half the drinks menu too.", "NTA", "Your friends are users. NTA", "Splitting a bill is common and it's rude to pinch pennies over a few dollar difference, but a $55 tab vs $160 per head for the rest of the table is excessive. NTA.", "NTA: who are these people?! Your supposed friends?! Who the hell orders a meal for their roommate and expect to split the bill.\n\nThey’re all using you for your money. I don’t care how much OP makes. Either they learn from this and stop using OP as an ATM, or find new friends that aren’t users.", ">They ended up each paying their own bill and one guy ended up paying for his, his date's, and her roommate's food. He is especially salty about the situation\n\nHe's upset because he had to pay for his gf's roommate's food, but has he even considered the question of *why should you have to pay for his gf's roommate's food?*\n\nNTA, and good on you for getting out of there without an arguement!", "I get so confused every time I see split bill AITA. Do people not ask servers for *separate* bills? Every single time I’ve gone out with friends, acquaintances, coworkers, we’ve always done separate bills. Everyone orders what they can afford and pays for their own shit. With split bills even if people ordered around the same price point u still risk paying a bit more or less than you expected/budgeted. Just keep it easy and separate it 💀\n\nOP you’re NTA, and honestly reconsider the friendship with these moochers. My own friends wouldn’t order more than standard servings if someone is covering as a treat, and that is the NORM. Friends do not exploit and take advantage of each other. You’re a free food service for them. Run.", "NTA\n\nMy friends and I always tell the server up front that we’d like separate checks. No problems. No haggling. Only once have I encountered a restaurant that refused.\n\nYour friends were huge a-holes if they were expecting you to subsidize their own friends, which it sure sounds like what they planned. Just next time tell the server upfront that you want separate checks. That way they are clearly aware that you’re done subsidizing.", "NTA- You may have outgrown these friends. Most friends don't order a lot if they aren't going to cover it or be realistic about the split. The fact that one brought their gf and she ordered food for a friend but didn't ante up at the end says a lot about them. Next time let them know up front that you won't be paying for anyone but yourself and if they get mad about it then you know not to go out with them anymore. It's probably a good time to find new friends that don't expect you to pay for them.", "\"They ended up each paying their own bill and one guy ended up paying for his, his date's, and her roommate's food. He is especially salty about the situation.\"\n\nI don't understand what they are upset about. The above is how it is always done when I go out with others. You can just tell the server up front that you want separate checks. It sounds like people who order a lot want others to subsidize them.  One guy orders food and drinks for  himself, his date, and his date's roommate, and he thinks he should pay the same as a single person? That doesn't make sense.", "You aren't the asshole.  They are, for wanting you to pay split for their drinks, and the girlfriend, and the unseen roommate.  That wouldn't have been fair for you, or they other guy who paid his own tab.  Friends like that will make you go broke.", "NTA.  \nYou paid for you. You're not obligated to pay for others, especially when they're going overboard.   \nIf they didn't want to pay for it, they shouldn't have ordered it.", "NTA", "I’ve never understood splitting the bill like that. Why should I have to pay a portion for people who I don’t even know or weren’t even there’s food? My salad is $12, unlike the $30 steak you ordered and 7 margaritas. \n\nI’ll pay for the food I consumed (and potentially took home) and call it a night. \n\nNTA.", "Yta for using that term. \n\nMaybe when you say a thing, think about why you say it. You obviously know what it means, but didn't stop to think that it could be derogatory. But you know what it means?", "NTA. it doesn't matter how much money you make, people running up a tab knowing it will be spread around to the rest of the table are a holes.", "NTA. I hate it when people do shit like that. They know they are getting people to subsidize their food and drinks and then try to guilt people who don’t go along with it. Definitely NTA", "NTA. Sounds like you were accurate in your assumption that it was going to be a situation just like the others. \n\nSome of your friends sound really rude. Who orders a meal for someone who isn’t there, and then has *someone else* pay for it? 💀 \n\nAnd ordering six drinks with dinner? To be clear…I’m not judging anyone’s alcohol intake here. But unless everyone else orders like 3+ drinks too, expecting everyone to split the bill evenly is just ridiculous.", "INFO Can you not just ask for separate checks from the start?", "Im Irish, no offense taken. Its a saying, its not personal and more people need to realize that. That said:\n\nNTA by any stretch. Its nice to offer to take friends out for a one time celebration. Its very generous of you. To expect it to happen every time is incredibly selfish and stupid of *them*. You arent obligated to feed the world.", "NTA   It sounds like those friends were specifically planning to get you to pay a lot of their bill.  I've done various methods from everyone pays their own to split equally to split without alcohol etc. but I have never seen people bring a date they were paying for and then expect other people at the table to share their cost of their date.  That's so outrageous it's actually funny.  You were smart to get out of there.  Find more grown up friends who aren't users.", "Given that the etymology of the phrase “Irish exit” is claiming Irish people leave without goodbyes to hide how drunk they are, it’s kind of a disrespectful phrase.", "Somewhat related to this. I got to experience someone facing some real justice for this kind of behavior. \n\nIn my line of work we often have vendors take us out for lunches or dinners. They are even nice enough to let us take a dessert back for our assistants if we want. \n\nBut of course one guy just didn’t know enough to be gracious and accept the current system. This dumbass started ordering dinners to take home to his wife and kids! He would order his own food and then order 2-3 more as to go orders. Luckily one vendor complained to corporate and this dude got fired over it. I felt like it was 100% justified.", "This is why I never tell people when I plan on picking up the check and also when I am working as a server if someone tells me they want to buy so and so a drink I won’t mention it until the recipients are almost done because I’ve watched so many people change their happy hour draft beer to a $17 shot of bourbon just because it was on someone else.", "And that is how it should be done. Pay your own. They are salty because they over imbibed so others foot some of the bill. Nice job. NTA.", "It's funny, there was an AITA a while back with a similar situation, that OPs friends group split the bill rather than itemizing it, OP didn't want to because they ate and (especially) drank less than everyone else there, so they just figured out what they owed, paid it, and refused to pay any more.\n\n\nWhen I agreed with OP on this, and basically called their friends likely mooches for trying to insist on splitting the bill, I was called \"stingy\", and that doing that math for fair payment \"destroys the dynamic of the evening\".\n\n\nOh, and OP? NTA.", "reddit would have no content if people were able to communicate like adults.", "Yes", "What my friends and I have done is heavier drinkers run one tab while non drinkers run another.  It’s easier for the servers and alcohol is one of the main expenses in a restaurant meal.  So non drinkers or light drinkers don’t get stuck subsidizing heavy drinkers.  I always try to put in more if I have more than one, but people often won’t take it.  I like the two tabs system", "Neither have I.  In my 42 years, I’ve always paid for what I ordered.  If I choose to pay for the whole meal I will tell whomever I’m with upfront that dinner is on me.  Other than that it’s separate checks.", "I have a few times, really situational though.  If everyone spent around the same amount it really doesn't matter which way you split it.  If appetizers were shared amongst the table then splitting it evenly saves from either having to do the dreaded math, or sticking someone with the full price of the apps.", "In France, the Irish exit is filer à l'anglaise, which basically means english exit, when you leave without saying bye or playing the bill... So basically it's sticking a rude attitude to a nation that you have historically been in conflict with. An other french idiom that means a girl is on her period is \" the english have landed\" as historically english army had red coat.", "It's a hell of a lot better than a Minnesota goodbye.", "I did not.", "Then most definitely NTA.", "Lol what a stance, kudos to change your mind about but Jesus what an awful take going to a slur right off the bat.", "Him saying a potential slur is not what is being judged here.", "F'ing English and their labels Welsh names are awesome", "I'm from a large Irish American family and we perfected the Irish exit. But it was never an insult. It just mean you left without saying goodbye. I perfected it over the year. Usually when you want to leave but everyone is guilting you into staying or to avoid the 2 hours of goodbyes to have people telling you not to leave yet. I also used to have parties at my house with my roommates so I could go to bed when I wanted without having to tell anyone. I would just lock my door. I'm not sure why some are taking it as a negative thing.", "He clearly said that it was one meal in the past (not this dinner the post is about) that he made sure they knew was a one-time celebration. This dinner had no expectations that he would be covering for anyone else.", "I've been told that it's because if they stop to say goodbye they will be there for another hour.", "That's what I was wondering. Doesn't his date have a job? He's paying for her meal so she decides to get an extra meal on top of it? Time to tell her to pay her own way like an adult.", "He had worked out a meal for a threesome with the roommate but had planned on being floated by OP, I would guess.", "Totally agreed. My husband is super generous and has many items surprised the group by paying the bill but our friends have never expected it so much that they bought food for other people who weren’t even there! \n\nIt kind of sucks that you left without saying goodbye and couldn’t be more direct with your friends but it also highlights that they might not be that great of friends if you can’t speak with them honestly and they are taking advantage of your generosity. NTA.", "Exactly. \"I got dozens of friends and the fun never ends, that is, as long as I'm buyin'.\"", "Wow that is insane!! Glad the vendor complained and the guy got what he deserved. \n\nI’ve been to so many corporate dinners where half the table would just order a second meal for their SO at home - with no shame at all. \n\nI even had one person have a budget for dinner at an event, so this grown ass adult is ordering exact sides and a kids meal to max out their total. Like really?! You need a side of kids chicken fingers too?!", "Love your approach to this!! 🙌🏽\n\nThanks for being such an awesome server!", "Yup, no problem he cared he left just that he wasn’t there to split the bill with them", "Is this an American thing? We all just get separate bills in Canada.", "My friends and I almost exclusively split the bill unless there's some kind of disparity (like 2 couples and 2 singles, or someone not drinking alcohol), but we are also all in around the same income bracket unlike OP", "My best friend and I always split the bill when we eat out. We've been best friends since middle school. We figure it will all even out in the end.", "That’s exactly why they want to split the bill. He orders the least amount and pays same as the rest plus the tip. Not fair and not ok obviously.", "Not everyone uses venmo. I prefer paying cash at restaurants cause i had my card stolen before at one. And my friend caught a waiter at a restaurant she worked at taking photos of peoples cards.", "With very good friends (and roughly similar incomes), we just split it evenly rather than do the math. We’ll all order more or less at one point or another and so it evens out. More importantly, none of us care because we know that we’re not trying to take advantage of each other.", "I do when I go out with a good friend and it’s just two of us, because it usually comes out in the wash. I have a few friend groups where we will order apps and drinks or a bottle of wine and either split or declare ownership of the thing being ordered for paying purposes. OP’s group seems extreme and OP is just not the same type of diner they are.", "Because most of the time, if you're not eating with people like this, you can split the bill evenly and just have the people who owe more add on a tip accordingly.", "Most adults I’m aware of? \n\nAll my friends and I put cards down and split bills evenly. \n\nIf you can’t trust people not to be fair with food bills, what’s the point of going out with them?", "I am 34 and have literally never split a bill evenly. One time in my early 20s someone in our friend group suggested it but that was because she liked to spend over $100 on booze whenever we went out. She was shut down.", "The 90% of the world that's not in the US", "Dim sum where you only had plates for the table and nobody had their own entree lol. What. You gonna add up how many dumplings everyone had and divide by % consumed? Or just split it by how many people attended.", "With friends like this- who needs Muggers?", "Went to my school mate's hen do (meal in a restaurant followed by trip to a trendy nightclub) and it was mostly her friends from work and university there. They all had better paying jobs than I did, were decked out in designer clothes and handbags, I'd bought my dress in the charity shop. I don't drink so I just had a 7up, they were ordering 2-3 cocktails each. I'm a vegetarian so I got the only vegetarian option on the menu (pasta with tomato sauce 🙄) they were eating steaks. When the bill came they decided that we'd all split it and split the bride's meal between us too so she wouldn't have to pay anything. I had never met these people before and didn't feel comfortable suggesting only paying for what I'd ordered plus my share of the bride's meal. \n\nThat 7up and pasta cost me €150. I had to eat a lot of rice that month.", "Exactly 💯%", "Or a glorious opportunity to play dumb -\n\n“Bye everyone, I already covered everything I ordered plus my tip. So it won’t be on the bill; you have nothing to worry about!”\n\n“We were going to split the bill OP”\n\n“Oh good call, that’s much easier since it looks like the receipt will be complicated”\n\n“Yeah but we thought you were splitting”\n\n“Oh no worries, the restaurant didn’t mind pulling out the specific items I ordered so it’s already done. I don’t even know how you split a bill if you’ve already paid ”", "Fucking let them, it would only make them look like bigger assholes.", "Whatever works that keeps you friends and not users. My friends and I do rough math. “I had one more or I had lobster, so here’s 20 more.” Our waiter always gets a great tip.", "I think it's more regional. I'm originally from the Tri-state of NYC. Restaurants used to not give you the option to split. The most they would do would be to split the cards evenly or one lump sum of cash. Then it gradually turned into some restaurants allowing splitting but only if you told them before ordering. It seems much more acceptable now across the board, as a lot more restaurants allow people to split the bill.", "Hint: It's not\nSource: Am Irish", "Honestly I’ve only ever considered Irish people cooler in consideration of this term. And I frequently use this exit strategy because it often makes more sense…. (My partner is full Irish and hasn’t informed me on this either!)\n\nOf course, open to learning!", ">You say bye a million times, inching closer and closer to the door until finally 2 hrs later you're on the road home.\n\nIf you're allowed to leave.", "Same in the South. There’s the “well we’d better get going”, followed 30 minutes later by a repeat of the same, then everyone moves to the kitchen to pack up whatever leftovers the host is insisting you take, then you move to the doorway for a while (this is when you start rounding up children if there are any), then about 20 minutes later you make it to the driveway (this is the final stretch but also the longest segment), then you’re in the car but still talking through the window, then finally drive off waving. That said, I Irish goodbye all the time, given the chance.", "This is how it is in Mississippi. Probably why I've Irish goodbyed for so long.", "And you start by slapping your hands on your knees and going \"Welp!\"", "The funny thing is, is that is exactly how the Irish in Ireland say goodbye. You gotta start preparing your goodbyes early. it can take hours to leave \n\nI lived in Ireland for years and first heard the phrase \"Irish goodbye\" from an American and thought it was an ironic phrase or something as its the complete and total opposite to how Irish say goodbyes.", "Okay but that is literally how we say good-bye in Ireland. Takes us at least an hour to leave a party. This \"Irish exit\" shit is just some crap Americans made up, like \"Irish twins\" or \"Chinese fire drill.\"", "I lived in Ireland. It was the Irish people who told me what an Irish goodbye is. I think it’s these “internet people” who make everything a “thing” 🙄", "We call it \"Smoke bombing\" where I'm from. I don't think that could offend too many people.", "\"SJW\"\n\nI'll bet you use the word \"wokeism\" too, don't you?", "Don't worry about it. It's not a slur at all.", "Ooooooh I totally misread the OP. I thought the situation he was describing WAS the one time celebration, lol. That makes way more sense.\n\nNTA then for sure.", "People do it though, it happened to me last year! My daughter graduated a training program and I invited everyone to cheesecake factory after. Her one friend ordered food to go since she \"only ordered something small for lunch\" and my step brother got desserts to go for him and his new GF who didn't come. They knew I was paying. The best part though was when they both saw me talking to the server, saw me take the bill and give her my credit card and only after I got the receipt back and signed it they both suddenly said \"oh, you didn't have to get my to go food!\" Lol \n\nIt wasn't that big of a deal, but I noticed it.", ">Exactly. \"I got dozens of friends and the fun never ends, that is, as long as I'm buyin'.\"\n\nA fool and their money are invited everywhere", ">I’ve been to so many corporate dinners where half the table would just order a second meal for their SO at home - with no shame at all. \n\nBut shouldn't whoever is in charge place a rule that this isn't allowed? I can't imagine going for a dinner paid for by anybody and me taking a meal home for my partner. Its so classless and worse is that they do it openly. I'd really think less of a colleague for doing that.", "Thank you! It just irks me so bad", "Fellow Canadian, very confused by this whole thread", "Most places will only split between two cards, max 3. They will do separate bills at some restaurants if you make sure you tell your wait staff ahead of time so they can organize the tickets properly when everyone orders.", "I'm an American, and most people I know ask for separate checks.", "I wouldn’t call it an American thing. It’s very friend group specific. One of my friend groups were all at similar income levels and order similar amounts of apps and drinks and ‘zerts on a fancy night out. If we all went overboard we’ll split it. I have other friends where money is tighter for some people while I might still order 3 more drinks and it’s assume individual checks. Then I have one group of jerks from work that like to go for a fancy as fuck meal after our annual bonus hits and we play credit card roulette for who has to pay the whole check. Trying to take advantage of “rich” friends or being the rich friend and making everyone split in an inequitable way are dick moves.", "Yeah but if things are roughly even, this wouldn't be an issue. The issue stems from certain people going way overboard on drinks or buying an entire extra meal, because they know the bill will be split evenly", "Venmo also means there's a calculator readily available to you in the exact same place Venmo is.", "Yup. Friends and I order similarly, we don't bother w the math any more.", "Except for those who abuse a situation by pulling the “what’s money amongst friends” bs and use that as an excuse to split bills that are lopsided", "[deleted]", "Screw Venmo, use Zelle! No fees.", "People who want others to pay their share? Who want to order a dozen drinks and the surf and turf, but don't want to have to pay?", "Silly. You have a calculator in your pocket at all times.", "My friends and I all do this as well.  We don’t care about being exact.  It’s not a big deal.", "I literally had a friend try to do that. Like if it bothers you that much that we might eat a couple dumplings more than you, maybe don’t eat with us?", "Yes in theory and it’s easy to have these responses on hand when we’re not in the situation. But people respond differently when put on the spot!", ">Fucking let them, it would only make them look like bigger assholes.\n\nOf course but some people are easily intimidated and bad with confrontation but with reddit keyboard warriors it's easy to be brave.", "That's nuts. I'm from Canada but I've never been to a place in my 30-odd some years that wouldn't split a bill. I don't think I would eat at a place that wouldn't split the bill.", "Yep, I'm from NY/NJ and my friend groups have usually split the bill. None of us order excess and if one person is ordering a bunch of drinks, usually we all are.", "Same. A large portion of my family is Irish American and I have perfected the Irish exit. It's my go-to when no one else wants to leave and/or tries to guilt me into staying.", "Yupp. Sometimes they offer more food and treats or ask about your grandma so you take your shoes and coat back off.", "Yeah. I've definitely done the Irish goodbye and left my husband even. Ppl have said to my husband one second she was there and then she was gone. Yeah, I'm tired and I wanna get back in the comfy clothes. You can text me all this stuff. So any chance I get I just walk away.", "I think the people down here are exactly why I Irish goodbye", "Ha, I've never heard that term but I love it.", "Nope. Not at all. And I can honestly say I’ve never used the term SJW before without being sarcastic ... but the shoe so aptly fits in this instance. Also, it’s not surprising you’re making assumptions and generalizing again.", "so all of you people down voting are supporting using ethnic terms to characterize behavior?\n\nnot saying OP did anything wrong - just don't use ethnic/national/racial stereotypes to categorize behavior that is just wrong", "I’m kind of torn here because while I understand the sentiment here is that people do take advantage of the generosity of others, I can’t help but think maybe they truly meant it when they said “ you didn’t have to get their to-go meal too”. \n\nBut I guess they could’ve explicitly asked that the to-go meal is a separate bill.", "A lot of my dinners this happened were young professional events and the host would come at the end to close the tab/etc. \n\nOthers were when they didn’t realize the exec would cover and then never request a second bill for their to go order. \n\nThe worse was when someone found out their to go meal was covered and told someone else and then that’s when the domino effect would kick in where everyone would just order extra. \n\nSorry,  I’m extremely passionate for my distaste in how people treat hosted events and dinners bc I’m with you - I would NEVER order anything while at a table for a company event.", "It depends. Sometimes these meals are intended as a socially acceptable bribe - a little grease to make the business flow a little easier. \n\nIf the intended audience would like a trivially bigger bribe (dinner for their SO), they may be more than happy to provide it.", "A lot of restaurants will not split a large party bill. Unfortunate I know.\n*in the US of A \n\nSo we’re left to calculate our own “split checks” and in extreme asshole cases like OP’s friends— people feel entitled to split the bill unfairly.", "That’s wild, literally the default here is separate checks for everyone. I’ve never had to negotiate a bill with the table in my life.", "We literally had to do an intervention, with a family member, while on vacation over seas. They were ordering 3 course meals, and wine \" for everyone\". Then wanted to \" split it\"..  and use his credit card, so our Euros kept him from paying exchange fees.", "I have friends I go out with and we'll split evenly, we are all on the same page and eating and drinking at the same pace. So if their chicken entree is $17 one time and my steak is $19 its not a big deal, because I'm not committed to always ordering the slightly more expensive thing and vice versa. \n\nI also have friends that turn into forensic accountants when the bill comes, and yes we have calculators. But it becomes an exhausting going item by item and it gets especially annoying if there were any shared items. Also calculating tax and tip at the individual level. I've rarely had meals with groups like this were some people don't feel like they got ripped off by the calculations. \n\nWith these friends if we eat out we tend to ask for separate checks whenever possible.", "Kind of like your cell phone has a calculator, huh?", "Yup.  I have a regular crew I go to dinner with and we order similarly enough to just split. \n\nAs for folks who expect me to subsidize their meal and reduce their costs.  I generally don’t go out with them anymore.   Learned that lesson a long time ago when I was on a diet and ordered a salad and everyone wanted me to pony up $80 to split the bill evenly.", "If you're with decent people, it's easy enough to split - people who ordered more drinks automatically put in a bit more, and it works out OK. Some restaurants split automatically, or don't mind splitting, which is fine. Some won't split, in which case you need to eat with decent people.", "> the only people I know who enjoy an even split are the ones who order the steaks knowing they aren't paying the full cost.\n\n...or they ordered things that are roughly the same cost and aren't going to spend more than a minute quibbling over what amounts to a dollar or two.", "As an Australian where we've had NetBank since the early 2000's (literally since the invention of the iPhone and smartphone apps) it's amusing to see Americans so excited to have Venmo. I'm actually shocked to realise you guys have not been able to do this all along? Apparently it's something to do with US banking regulations?", "I feel like part of being an adult is just taking responsibility for that fact that we chose to go out more than once with the same person. \n\nIf you can’t trust them, simply choose not to go out.", "OOF that is so tacky lol. I guess I can see it if you're having money problems and hyper aware of how much you spend, but it'd be so awkward to be one of the other people at the table.", "True, but it’s fun to imagine.", "I'm almost all Irish and I think it's a fantastic term lol It's pretty hard to offend the Irish.", "Yeah because it originates with American Irish. It refers to people taking open spaces on ships during the famine without telling their families and just Peacing off to America. But it’s not an insult.", "https://youtu.be/MHCmE4ABnNs\n\nYou've probably seen this but...", "Haha, same! He can stand around talking forever, but when I’m done, I’m DONE. It’s sweatpants time.", "Oh okay. Google gave a completely different answer. The more you know.", "Yeah, I'm from an Irish American family and went to uni in Ireland. I have perfected the Irish exit. It was never a slur.", "> so all of you people down voting are supporting using ethnic terms to characterize behavior?\n\nCultural terms, not ethnic ones, but yes. There's plenty such terms that are not appropriate to use because they are really insulting, or slurs, but that doesn't mean \"[culture] + [behavior]\" is automatically bad.\n\nYou're being downvoted because you're calling it racism, when most people aren't thinking of it in terms of race, but of culture. There are plenty of cultures today where making abrupt exits is socially permissible, just as there are cultures where showing your teeth when you smile is considered rude, or where smiling at strangers is seen as weird or a sign of lacking intelligence. Just as there are cultures that are more introverted and less openly friendly, and cultures where everyone and their dog is up in your business. When people have a general understanding of \"x behavior is common in y culture\", they use that as a shorthand for describing things they do. \n\nNow, to be clear, the *origin* of \"the Irish goodbye\" is pretty negative. But words and their connotations change over time, and what it meant a hundred years ago isn't what it means today. If the original connotations attached to \"The Irish Goodbye\" were negative ones, they don't seem to have stuck around, because if you ask someone what they mean when they say that, they're highly unlikely to say \"because Irish people are uncouth and rude\". They're more likely to assume that it's a facet of Irish culture that's different from their own, even if that assumption is wrong.", "really so it's ok to be racist about the Irish on Reddit?", "Yea agreed they sound like a pack of vultures. My boss throws us a good Christmas lunch and there's loads of free drink etc. It's in the office but I would never in a million years start lifting the drinks provided to bring home to others. That's just so tacky and inappropriate.", "We had a company event the last few days and there were some amazing sandwiches boxed up for people that couldn’t stay for the sit down lunch and I felt bad taking one of those even at the insistence of upper management. I couldn’t image placing an order at a restaurant for a to-go spouse meal.", "It still doesn't justify taking it home. It's not even the money, it's more the principle of it.i would just seriously look differently at a person that does this.", ">We literally had to do an intervention, with a family member, while on vacation over seas. They were ordering 3 course meals, and wine \" for everyone\". Then wanted to \" split it\".. and use his credit card, so our Euros kept him from paying exchange fees.\n\nSorry I don't understand. What exactly happened?", "Those latter friends are gonna have the lake houses you visit with their care for money 😂", "In NZ we pay at the counter when you leave. You just tell the person what table you were at and what items you are paying for and they add it up on the computer and you pay it. ez", "Next thing your going to tell me is that we can somehow talk to people using our voices on this thing. Craziest shit you kids come up with these days.", "Witchcraft!", "Exactly. With experience, you start making better decisions about who you hang out with. Hopefully, OP takes this as a learning opportunity. Keep the other single friend, drop the rest.", ">Learned that lesson a long time ago when I was on a diet and ordered a salad and everyone wanted me to pony up $80 to split the bill evenly.\n\nHow was it resolved?", "Same as a Canadian. We have interac e-transfer in our banking apps. Little to no fees, no extra accounts or apps, just send the money using email/phone number and you’re good to go. Literally the only time I ever use any of those apps is when I’m ordering online and use PayPal for extra consumer protection.", "It has nothing to do with regulations, quite the opposite. PayPal is ancient, but their “non bank” status means they can charge whatever fees they want, and even confiscate your balance at any time.", "Yes, I tend to surround myself with conscientious people so taking advantage of others is not in our nature.  Hence why splitting checks among other things is not a big deal.", "As far as we know, he earns about the same as the rest of us. We just never noticed he was that way because we always ate at Western restaurants where it’s more natural to split the bill according to what you ordered. Listening to him try to remember which dish he ate from and which he didn’t while doing the math was excruciating, and he probably saved less than $10. Never again.", ">I'm almost all Irish \n\nSo....not an Irish person living in Ireland?", "This was so good🤣", "So how do you differentiate between culture and ethnicity? (As an American this is a difficult construct) - I reject the use of any ethnic/linguistic/cultural/racial/gender identity etc labels that have at an time been used to denigrate a group of people - we should be beyond using these labels even if they were only hurtful a century ago. We are better than this. And certainly making an abrupt exit is permissible in many cultures especially when someone is stiffing you with the bill - no argument there!", "yeah go ahead and support the racist colonial English imperialists", "Oh I totally agree, have a little pride right?", "Dude says \"everyone at the table owes all this money, but I'm putting it on my card, so give me cash.\"", "Spending $2 extra is worth it for an evening of not hurt feelings for me. But maybe they can enjoy their lake view and wonder why people don't wanna hang out.", "I don't want to turn this in the three millionth comment thread on \"tipping culture\" but its different in the US. Gratuity is expected, our sales tax (sorta like VAT) is not inclusive. For larger parties in the US historically the total bill is provided on one slip and it's up to the party to sort out how it's going to be divided. \n\nThis is kind of turning into a derail, OP is NTA, I was just more addressing the point \"you all have calculators why can't you just sort it\".", "Fair enough. It's just that we've been whipping out our phones at restaurant tables for twenty years, and we didn't realise it hasn't been a thing in the US until recent times", "Mainly, context. It is a difficult construct, and it is difficult to separate them sometimes.\n\nBut a kind of weird and unfortunate side-effect of how the West has evolved regarding discourse on ethnicity and race is that we seem to use identifiers like \"Welsh, Irish, Chinese, Japanese, Kenyan, Maasai, Cherokee, Anishinaabe\" to designate culture first and ethnicity second. When we're not talking about culture, we often switch to \"race\" instead (white, asian, black, native american, aboriginal), even though racial designation is incredibly broad and has the unfortunate effect of lumping totally distinct peoples together in one giant blob (a Black American, after all, has basically nothing to do culturally with a black person from Kenya, and a black person from Kenya likely has no meaningful cultural or ethnic connection to a black person from Zimbabwe).\n\nWhat that means is that the use of terms like \"Irish\" to designate an ethnic identity has been severely weakened and pushed aside a lot in modern discourse. When people say they're Irish, what a lot of people hear is \"I'm a person from Ireland who grew up in Irish culture\", even if they're not what you'd consider ethnically Irish (for example, they might be the children of recent immigrants). You might assume they're white, because most ethnically Irish people are classified as \"white\" these days, even though they weren't a hundred years ago. It's similar to how if someone says they're Navajo, you assume they're Native Americans of the Navajo culture, even though any Native American will tell you that it's also an ethnic identity because they're not all one homogeneous group, culturally nor ethnically. In short, we've taken to using racial identifiers and attaching them to cultural identities to describe people, rather than using the cultural identity to describe the ethnic identity. \n\nIn some ways, this is good. It means that we're pulling away from a time when we widely believed that traits like intelligence and virtue or vice were genetically inherent to different groups, and thus used these terms as a way to say that failings and shortcomings were inherent to an entire ethnicity or sub-group. I still get shocked when I read old writings from a hundred to a hundred and fifty years ago, and see white Colonialists describing other people as if they had characteristics that were inherent to them-- the way we talk about dogs, like when we say that some dog breeds are calm and intelligent, or describe other breeds as being willful and prone to disobedience and destruction. We still talk that way, just generally not about people anymore, and thank goodness. \n\nIn other ways, it's not so good, because again, it means a lot of people blank out on the importance of recognizing that a white person in America has a totally different experience and history than an ethnically Irish person from Ireland, or an ethnically Welsh person from Wales, who may have to deal with a great deal of cultural suppression (of language, food, religion, etc.). That suppression was historically rooted in racism, which is to say, it was historically rooted in beliefs about people based on their ethnicity and genetic heritage. These days, that suppression is usually rooted in a disdain for the culture, because an ethnically Irish person in Britain who is raised like a Brit, walks like a Brit, talks like a Brit, and eats like a Brit, and doesn't carry a hint of Irish culture in them is probably not going to face much actual racism. \n\n> reject the use of any ethnic/linguistic/cultural/racial/gender identity etc labels that have at an time been used to denigrate a group of people\n\nThat's understandable and laudable, but what about when people of that culture don't particularly mind the usage, or use it themselves, or have reclaimed it?\n\nThere's a whole lot of labels I can think of that just aren't reclaimable. But not only has the Irish Goodbye lost a lot of its colonial baggage, it's inspired a whole slew of other \"goodbye\" variants-- like the Minnesota goodbye, the Greek goodbye, the Canadian goodbye, the Italian goodbye, and the Pittsburgh goodbye. Because of that, \"The Irish Goodbye\" now blends in with them as clear cultural descriptors, and not ones that reflect badly on the Irish. (Some of these variants are really quite funny, too)\n\nI think it's worth pointing out that in this case, trying to push against the use of \"the Irish goodbye\" when it exists among half a dozen other goodbye variants is a bad idea. It's pushing for people to take a negative slant on just *that* one in particular, and to deliberately form a negative interpretation that requires engagement in an outdated (and bad) thought process in order to see it. Irish people are doing a lot to protect and preserve their culture against forced Anglicization and the spectre of colonialism, but I feel like the fact that \"the Irish goodbye\" has lost its colonial meaning is actually a strike against colonialism, because the weapon's had its teeth knocked out. It used to be a weapon designed to damage the Irish reputation and character, now it isn't.", "You seem like a blast at parties", "Yes it reminds me of my friend when he was staying at my house one night after clubbing. It was about 4am and we wanted cigarettes. There was a shop beside my house and I went up and got a 20 box. Its Ireland too so they are expensive.\n\nI paid for them and we smoked a cigarette each and he was sleeping on the sofa and I was upstairs in my room. I left the box of cigarettes in the living room where he was sleeping and told him he could smoke more if he wanted and I went to bed.\n\nYep you guessed it, he took them home the next day. It really annoyed me and it wasn't even the cost aspect. It was the principle, that he totally abused my hospitality, in my own house too. That was about 13 years ago and it still pisses me off. \n\nThere's just something violating about it if you get me? I can't put my finger quite on it but it's like you did something nice for them and they abuse it sort of. Or give an inch take a metre.", "And was he trying to split the bill unfairly? What exactly was the issue? What was the intervention and how was it resolved?", "The US’s banking system is far behind other countries. I have a client with a U.K. bank account, and the amount of stuff you can do with just an individual online login (which is far more secure with the chip and pin card reader you use for transactions) and with little to no fees is amazing. I wish we could get there. \n\nI can’t do a wire with my personal online login, I have to physically go into a bank branch. And it still costs me at least $15 to do a domestic wire, closer to $50 for international. To do it online, it would need to be a part of a much bigger iTreasury system, which would charge so many fees for one account… And the only way to get money from one bank to another is a wire transfer if you’re not using a third party app. The ability to login and pay people with just a sort code, account number, and name on the account *for free* is amazing.", "Yeah I know no one wants to see a middle aged women getting into brawls .)", "Presumably his card does not charge a fee for international usage at businesses, but would to use an ATM. So this maneuver enabled him to effectively stockpile cash in the local currency while offloading those fees to everyone else at the table.", "OK not really understanding still. How did the intervention go ? Was he hostile?"]}