{"id": 9612, "submission_id": "10yrja3", "title": "AITA for ruining a guy's favorite spot?", "selftext": "There's a small bar in my town I recently started going to. They have trivia night Friday night. I started going a few weeks ago, and after my second week there one of the regulars at trivia told me that trivia was something he had set up with the bar owner and I wasn't welcome. He doesn't work for the bar, so I told him he couldn't really tell me I was unwelcome.\n\nHe explained that trivia night was a guys thing and a safe space for them from the judgement of women. I told him he shouldn't have it in a public bar then. Last week he left \"in protest\" of me being there, and his team was upset, because they didn't do as well as usual. I told my boyfriend and he thinks I'm being mean to the guy and should try to see his point of view. Maybe I'm a little cold-hearted, but I don't really care about that guy, even though he was there first.", "created_utc": 1676034406, "permalink": "/r/AmItheAsshole/comments/10yrja3/aita_for_ruining_a_guys_favorite_spot/", "score": 4829, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I kept going to an event even after one of the regulars said I was unwelcome. The regular was there first and I ruined the event for him because now he won't go.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, I've been to a ton of bar trivia and there's always a healthy mix of men and women. No idea what this guy is going on about. I'm not against the idea of gender specific spaces and activities but this one ain't it.", "[removed]", "NTA- who the hell thinks trivia in a bar open to the public is an appropriate place for there littke boys club?", "NTA.\n\nIf it's a \"guys thing\" then he may invite his male friends over to his house.", "NTA I think it’s fair if men wanna have their own space or whatever, but it’s super weird to try and make a bar trivia night a guys only activity.", "NTA. They want an specific \"guy's night\" at the bar, then they should have a private party there, and specifically promote it as \"guys night trivia party\". I'm sure it would do wonders for the bar's popularity", "NTA. A public bar is not the place for his boys club, and I’m sure the owner would be pissed at this guy for telling patrons they aren’t welcome to spend their money there.", "NTA weird thing your boyfriend says you were mean to this guy.", "NTA. What decade is he from?", "NTA.\n\nHe‘s an AH and so is your boyfriend. They‘re both sexist.", "NTA. Until and unless the owner specifies it as \"male-only\" night, you have as much right to be there as he does.", "NTA he can hold his woman-hating group in his parents’ basement where I’ve no doubt he lives. What a creep", "NTA. Id go back next week with a bunch of girlfriends", "NTA. I'm left wondering what judgment. It sounds like he's insecure and that is not your problem, that's a  him problem.", "NTA. It sounds like he needs “the judgment of women.” And men. And anyone who has two spare brain cells to rub together. If he wants a private trivia night, he needs to pay to rent a space or have it in his mom’s basement. Also, you might want to re-evaluate your relationship with your boyfriend. I’m not sure exactly what he means by you needing to see this other guy’s point of view but it sounds like he expects you to be a doormat. Is he going to expect you to “see his point of view” and always give up things you enjoy in favor of him? I’m not telling you to break up but it might be something to think about", "NTA - I hope the bar staff is on your side.", "NTA. His fragile ego is not your responsibility.", "LMAO NTA the never of this guy.", "NTA. Something tells me “free from the judgment of women” means this group of guys aren’t upstanding citizens.", "INFO: am I reading this right that this guy is solely mad because you’re a woman in a predominantly male space, not because of anything you’ve said or done to him? Is it advertised as “guys night trivia” or anything like that?\n\nIf so, NTA, and this guy is the worlds biggest misogynist baby. You are allowed to go places and he will somehow manage to survive being in the same bar with a woman playing trivia across the room.", "NTA. It's not your job to appease the manosphere. It's a public bar, and nobody has any right not to see the kind of people they don't like in public places.", "NTA\n\nHe can take his gatekeeping with him. I would talk to the bar owner", "Nta. He is being sexist. He's probably scared that you're smarter and better at trivia than him.", "NTA. If this was such a problem for them, then why did they let you attend in the first place? Doesn’t seem like it was advertised as an “invite only” or “guys only” trivia if they were fine with you for the first week. Also if they don’t want to be inclusive then they should go somewhere private, or properly rent out the public space.", "NTA my petty ass would bring a whole group of women next time, and say oh we were just looking for a place that was safe from misogyny and sexism,  and I guess we’re getting it now that you’re leaving. He can pick and choose who is allowed in him basement, not a public bar", "Nta. If he is so bothered by the presence of a woman, he should host his own private trivia in a private space, not in a public one where anyone (and I mean anyone of any genders, age, ethnicity, etc) is welcomed to join.", "[removed]", "[removed]", "Nta, if the dudes want a guys only trivia night then advertise and book it for that or smt, a public bar is not exclusive to one sex like that", "NTA I hope you show up with a group of women whenever you have time", "NTA This guy doesn't get to claim a public space as his own, personal kingdom.\n\nI hope you wipe the floor with him in trivia.", "Safe space from judgement of women? Should have trivia night in mens toilet then.\n\nNta.", "If trivia night was a male only space then yes you would be in the wrong but if that's genuinely what the trivia night is about then wouldn't it be advertised? Promoted by the bar? Something everyone was aware of and probably would have informed you of? \n\nNTA", "I would talk to the owner just to head drama off at the pass.", "ESH - If that's the way the bar wants to do it, why would you want to be part of that bar scene to begin with?  You are being excluded so you are going to be an AH about it.  Conversely, why is a bar sanctioning an event that excludes 50% of the population?  It has to know that it is going to create bad press eventually.  Ultimately, though, it's their business, it's a side-activity that has nothing to do with whether they are willing to fulfill their business duty to you.  It's tantamount to peering over your neighbors fence and complaining that you weren't invited to their barbecue.", "NTA- but there’s just less and less places dudes can just hang out with their wangs out, without it being an issue with you females", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThere's a small bar in my town I recently started going to. They have trivia night Friday night. I started going a few weeks ago, and after my second week there one of the regulars at trivia told me that trivia was something he had set up with the bar owner and I wasn't welcome. He doesn't work for the bar, so I told him he couldn't really tell me I was unwelcome.\n\nHe explained that trivia night was a guys thing and a safe space for them from the judgement of women. I told him he shouldn't have it in a public bar then. Last week he left \"in protest\" of me being there, and his team was upset, because they didn't do as well as usual. I told my boyfriend and he thinks I'm being mean to the guy and should try to see his point of view. Maybe I'm a little cold-hearted, but I don't really care about that guy, even though he was there first.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I hope you whoop some ass today!", "Nope NTA he just wants a place to trash women without women cause he can’t get a woman. Unless the owner of the bar states guys only trivia anyone is welcome. His POV is woman bad for being in my space on my trivia night. You are in no way the Ahole", "Nta\n\nIt's the same as banning people with brown hair just because they have brown hair", "NTA.", "NTA if it’s a men only night then advertise it accordingly.", "Absolutely NTA. If you're anywhere in Western Europe, I'll make a trip to come to trivia with you once.  I'm shit at trivia but I *am* a woman and I'll happily stick it to this sexist asshole.  :)", "NTA. Tell him to build an extension on his house if he is looking for a \"safe space\", or play the trivia online.", "Unless it was part of the advertising as being a men's group/gathering/safe space then he has no right to bar you based on gender - NTA", "NTA", "NTA.\n\nIt’s a public place with a public trivia night, correct? Dude needs to check his precious little fragile ego at the door.", "NTA. The owner could easily close the bar and make it “invite only”. He didn’t so you’re allowed to be there.", "INFO: how badly did you beat him at trivia?", "NTA. If it's not advertised as a men-only event then they can't complain.", "Nta, bring more ladies w you", "NTA", "NTA\n\nGuy trying to bully you out of the space with his incel rhetoric, fuck that noise", "NTA, unless this was billed as a \"Men's only\" trivia night,  he doesn't get to decide that.   Sounds like he needs grow up.", "NTA", "NTA. Is this really a serious question?", "Yeah, the bear bar (that skews heavy toward the leather crowd) that I have gone to a couple of times for trivia night has a good mix (granted skewed towards gay men, but still a mix of genders).  \n\nIf butt-hurt misogynist guy complaining about OP wants a 'guys only trivia night' kind of thing, he has a some choices - rent the bar out for a private invitation only kind of event every week (and only invite people with a peen), make a set of categories for the trivia teams (men, women, mixed) - or perhaps a 'bowling league' kind of set up, get over the butt-hurt that women exist and are in public places, or go back to his man cave in mommy's basement and whine to his gamer-gate bros about how people with estrogen are destroying 'real' men by existing and not being his bangmaid.\n\n&#x200B;\n\nOP NTA.", "Perhaps he's worried his people would lose.", "Agreed, mens bowling league came to my mind as a bowler, who gatekeeps trivia night! Lol", "You want to work with your local bar to set up a guys-only trivia night, be my guest.  That does not appear to be the case here, however, and it would be up to bar management to enforce it anyway.\n\nNTA, OP has done nothing wrong.", "On a Friday night when the bar, presumably, is quite busy. So odd.", "I'm imagining early 1970s and he looks like one of the guys from Anchorman.", "Hold up. While I agree what the guy at the bar said/did was childish and immature, why aren't men aloud to have \"men only trivia night\" and immediately branded as sexist?\n\nLadies night events are a thing, and men are excluded from the same perks the women would get. But I guess it's a nothing burger when it goes the other way, right?\n\nThis is more like an ESH situation where nobody's a winner.", "The guy at the bar? Yes 100% I wouldn't jump the gun on the boyfriend he's probably just trying to sit the fence so he doesn't have to fight s some dude he has no reason to fight.", "You’re 100% right. But let’s be real. Male-only nights at bars/public venues are not really a thing anymore and never will be, while the opposite definitely is. They’re frowned upon and seen as sexist. I don’t think male only places/events in general are a thing anymore (or at least I haven’t seen any) outside of private events that people organise for themselves.", "He’s only mad because from reading between the lines OP is smarter than him, so he is butthurt.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "The guy doesn't even work for the bar though? He's a patron that comes in to play trivia.", "I do agree that this isn’t a worthwhile hill to die on, but they should have stated their trivia night wasn’t inclusive from the get go. She already attended the first week and liked it enough to go back a second week (where then she was confronted on it being a “male only” space). Maybe this was the first time a woman ever tried to join their trivia night, but these are things they should have thought of before having it in a public space during regular business hours.", "Hilarious, given that women have had to fight so hard for so long to even be allowed in male spaces.", "I dunno, where you live, but usually, the only space where you can see other guys wangs are swimming pool or gym showers, and to my knowledge nobody hangs out there.\n\n(And if somebody did, I would feel pretty weirded out by that, even if it was a guy).", "> You want to work with your local bar to set up a guys-only trivia night, be my guest.\n\nThat’s almost certainly illegal gender discrimination in many countries.", "Maybe it should have been advertised as a \"Mens only trivia night\" then? Every trivia event at any bar I've been to has been open to anybody in there.", "Usually ladies night at a bar is intended to bring more ladies for the men to talk to so.....", "He's totally allowed to start a men's only trivia night, the problem is he didn't. There was no advertising to that point and it seems op was welcomed to join by everyone except him.", "he's not sexist for wanting a man-only trivia night. he's sexist for telling her she couldn't come to a trivia night NOT branded as men-only because she's a woman, and implying her presence ruins the experience because she's a woman.", "Hypocrisy at its finest. Not even worth trying to talk about it. They will just downvote you to oblivion homie.\nEdit: Yeah I predicted it yall dont like it when you get called out for the hypocrisy. Keep downvoting and keep proving that i am right", "Why would he want to sit on the fence ? To not upset a guy he doesnt know?", "Her boyfriend defended a sexist who discriminated against his girlfriend, and this was a conversation solely between these two. There wasn’t any mention of a possible fight.", "Bf sounds like an ass to me\n\n\"he doesn't have to fight some dude he has no reason to fight \" well that's a made up scenario", "I'm old enough to know that 'ladies nights' in bars started just as a business practice to get more women to come to bars and clubs that were overwhelming attended by men. Honestly I'd argue that money is still the motivator for most of these nights now.\n\nPrivate member's clubs for men are definitely still a thing. I genuinely think this guy should look into hiring out a space for these nights, they can set their own rules without damaging the bars income. \n\nThe bar isn't doing themed nights to be altruistic, they have a business to run.", "Darn it, there just aren't spaces for cis dudes to get together and dude out anymore without the intrusion of the women and the lower classes!!", "Not true at all. See for example [the men's shed](https://menssheds.org.uk/) in the UK. Spaces and events specifically for men.", "Right? For some reason women-only spaces are a-okay, but men-only spaces aren't? What happened to equality and all that?\n\n(Lol at the people downvoting me for bringing up a logical point)", "I’ve never been anywhere that women aren’t allowed, even male public bathrooms, if the girls room has a line there’s always females in the male bathroom", "Right? I love how someone is trying to spin “ladies nights” events at bars as something that men are excluded from. I have never seen a ladies night at a bar with more women than men.", "Okay. Some bars use ladies night to provide a safe space for women to hang out without having to deal with harassment.\n\nLadies night isn't always used to try and herd the l women over to the men. Different businesses have different motivations.\n\nAlso, my comparison was to call out the person who commented calling the men in OP's story sexist. That's a cop-out response that required zero critical thinking.\n\nI also said everyone sucks. Litterally nobody is a winner in this story.", "No,  to stop OP from bringing it further and having to fight the dude at the bar.", "What does an animal do when it feel threatened? It attacks. How do you think that man feels about his \"trivia night with the boys\"? Probably feels like she's threatening his relaxation time. And what do drink townies do best when they feel slighted? They get drunk and fight. If this is pursued any further there's going to be some cliché confrontation outside a bar infront of a shitty pickup. And all I'm saying is that the boyfriend is trying to avoid that shit before it gets there.", "100%.", "You can have gender specific groups without automatically seeing women or men as lesser...", "I don’t understand why you need to see it as men looking down at other groups of people. Women have girls nights/women only events without it being considered sexist. It’s perfectly normal to want to have time with just the girls or just the guys. It’s common sense that men and women are different and that while it’s awesome to come together, it’s okay to want to just be with the girls or the guys where you can talk and interact without having to consider the opposite sex.\n\nEdit: I’d love to hear from more people that disagree with my comment here (comment is getting downvoted so I’m sure there are plenty of people who disagree) why you can’t have gender specific groups/events/spaces without it being seen as looking down at people that are not a part of that group; or at least why you disagree with anything that’s a part of the statement I made.", "I linked mens sheds in my second comment (reply to myself) if you haven’t read it yet (except the Aussie one). The people who came up with mens sheds saw that there was a massive decline in places like that and decided to create something specifically to improve mens mental health.\n\nMy point was just that they’re not common any more + many people view it as sexist + that it’s a good thing for them to exist. It’s easy to see that based on my relatively uncontroversial comment (just pointing out that it’s okay and normal for both sexes to want girls nights or guys nights/events) being downvoted already.", "I can understand where the sentiment came from originally. It was because women were excluded from men only bars/clubs, which was pretty much all of them which was wrong ofc. \n\nNow it’s gone the other way, having normal nights and women only nights, instead let’s say having themed nights for just the ladies and then just the guys and the normal nights.", "Bro, I'm talking about the fact that HISTORICALLY, women have had FAR less freedom than men, that in order to gain those freedoms, women had to fight hard. It seems ironic to me that now there are men who complain that there's so few places where they can just go and be dudes without females interfering. It's just the progress of time.", "I’m pretty sure “ladies’ night” isn’t legal in my state and many others. I haven’t seen one advertised in years.", "That makes no sense.", "This was addressed in a private setting away from the guy though? Why would there be an ensuing fight if he agreed with her?", "How does a woman existing in a bar equate an “attack” to a man?\n\nMen are so fucking scary. \n\nWoman - exists \nMan - I am under attack and must fight.", "Exactly", "2. People/media also love to talk about toxic masculinity, how men are shit at talking about their feelings etc. Its also true that men account for ~80% of suicides so clearly there are issues that aren’t being talked about. Trying to stop/criticise having spaces for men to feel comfortable, open and in environments to talk while holding to other views about toxic masculinity etc is hypocritical.\n\nHere’s a mens space thing that was made in Australia solely for the purpose of improving mens health (they also have womens spaces and community spaces). Yea, I think it’s important to have places like this for men as well, without being demonised for it.\n\nhttps://mensshed.org", "The reason was is because historically, men only spaces have been places of exclusion and elitism. Not to mention sexism, racism and classism. \nSo these places have rightfully been dismantled. Good on the part of the men's shed to specifically address mental health issues, but you can't really bemoan the loss of gentlemen's clubs and such. \n(Not to mention that many spaces, such as governing boards, sex segregated sports clubs, some political spaces, higher ends of many industries etc STILL function as de facto men's clubs.)", "Remember when sexism and oppression gave us all these dude spaces? Why are those spaces now full of feeeemales??", "I’m not from history, I’m from America", "I see you've never had to suffer through a partner getting you into fights with strangers.", "[removed]", "Idk I'm not that guy threatened by a woman in a bar.", "It was perfectly fair to dismantle those (I said that I understand where the sentiment originally came from in another comment - basically what you said but with less detail - since at the time they were all men only places) without having the equivalent spaces (specifically the kind men had at the time, bars, gentleman pubs etc) for women or having places for both sexes to be. However, that doesn’t mean it’s okay for every other sex/gender/group to have their own spaces or at least events today, and to pretend like men shouldn’t have them too. It’s pretty easy to understand why those groups would want time and space for themselves and apply that same logic to men. \n\nAs for political spaces and governing boards, even if I concede that they function as de factor mens spaces, the proportion of men that actually care about those things and are involved in them are minimal. Sports teams are an irrelevant point and shouldn’t even be brought into this since there are plenty of sports clubs with mixed sex/gender social sports teams for those who want it + men only teams and women only teams (not everyone wants to be in mixed teams as well, esp for contact sports). There are also women only gyms that cover that area too. Higher ends of certain industries also, but definition, only include a very small pro-option of men. Even then, it’s work. Don’t see how it’s anything related to solving the declining number of spaces for men and worsening social networks for men as they age compared to women (women are better at building and keeping friendships past marriage/middle and into old age - one of the contributing factors to male loneliness and depression is that men tend to be shit at it).\n\nNone of the points you gave are valid reasons to not have more places like mens sheds but for other activities + explicitly for men only, the same way women (or for other gender/sexual orientation groups) only events and spaces exist.", "Forgot to mention but mens sheds also tend to attract an older crowd (retired men/middle aged and older). It’s not really a thing for most 18-30 yo’s. Alternatives with activities that catered to younger age groups could be positive.", "Seems more like you’re from intentionally obtuse dumbass.", "You're giving major incel energy here.", "You are projecting. Is she going to avoid all conflict her whole life because it might turn into a fight? \n\nIf he is not willing to support her in dealing with a massive asshole at a public bar and event, then he is a shit boyfriend.", "Most people haven’t. That’s not a thing.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "🔥🩹", "I'm not saying he isn't shit in just saying it doesn't make him sexist.", "Yeah wtf, “making” your bf fight another dude for you is not common outside of bad 80s movie scenes.", "It is a thing, it's happened to me.", "No girlfriend can “make” you do anything my dude, unless they’re holding a gun to your head. If you’re with a woman that toxic, I would end it right there. It’s not normal or okay.", "Pay attention to your bf's attitude towards this - does he think it's ok to tell women to leave public spaces?  \n Does he think women should just get up and honour mens' requests?  From complete strangers?\n\nIt sounds like he's interested in how men feel more than basic rights of women to exist in a public place. \n\nFor the guy at the bar - If women are the issue and if he wants to be somewhere where he doesn't feel the judgement of women, then he and his knuckle-dragger friends can go to a gay bar.  That would be ok, right?  lol\n\n(NTA).", "It's INCEL trivia night!", "NTA. That guy and your boyfriend can rent a private space for their loser meetings", "NTA. Does the bar owner bar female bartenders from working that day so the He Man Woman Haters Club can meet in peace? \n\nUnless it's p*rn trivia, I'm having a hard time understanding how your presence would create any gender specific form of judgement.", "NTA\n\nBut you might want to contact the management as 1. If he’s turning away business, they’ll want to know. 2. If it’s sanctioned you should leave a review for people to know that women are discriminated against on certain nights and know to avoid for safety.", "NTA ahahahahah that guy's an incel, he can have a safe space at home cause he sure will never have to worry about women there...", "NTA Next time bring in your female friends !", "INFO:  Is the trivia competition advertised as a guys-only event? I find this story hard to believe, having a trivia night banning half the population on one of the busiest nights in any bar.", "NTA. I dealt with assholes like this when I played quiz bowl in college because they couldn’t handle a woman answering questions faster than them or being right when they aren’t. It only ever made me want to play more and better. That’s his issue, not yours.", "If they want an exclusive trivia night, they can have it at one of their homes or rent out a business for a night. NTA", "lol imagine leaving trivia night at a bar in protest because a woman was there. im sure he wont be missed. what a goddamn baby. NTA", "NTA - His fragile male ego got bruised when he couldn't flaunt his willy and scare you off? LOL  If you really want to wound them, convince the owner to make one night's trivia about the female anatomy, including menstruation. They'll be falling out crying within 5 minutes.", "NTA but how bad did you beat him in trivia for him to throw this temper tantrum?", "NTA, you should have taken his spot on his team.", "NTA\n\nWas this dude's name Calvin and did he walk around with a stuffed tiger and is your name Suzy?\n\nIf he wants a private club with no-one else allowed in, then he can pay to rent the bar for the night and close it. Otherwise, too bad so sad.", "NTA - I'd get his opinion if you were joining his table and it was situation where a group of friends where having a guy's night and someone kept inviting their girlfriend. \n\nThis is not that situation, if it's such a big deal being in the same room as a woman that's a that guy issue. I imagine he is the sort of guy who says shit like 'at least there's no emotional women, throwing tantrums and making it all about them.' Then storms out like a whiny child when he doesn't get his way.", "NTA. He can have a guy's only event at his place if he wants but he can't bar women from coming to trivia", "NTA, but jeez was that guy ever, and frankly so is your BF.\n\n\"safe space from the judgement of women\" is pretty much bs. If the owner didn't back the guy up, he's probably just a misogynist jerk who's salty because you're better at the trivia than he is.", "NTA. Everyone else has summed it up perfectly. But I’d let the owner know. As a small business owner, he should be made aware the people are trying to deter business from his establishment", "NTA and dump your boyfriend", "I was banned from a trivia night once. \n\nA bar in some college town i used to work in had 90's music trivia. As I was a radio dj in the 90's my 90's musical knowledge is pretty fucking good. I wasn't obnoxious or anything but once the organizer found out what I did for a living, I wasn't allowed to play anymore.\n\n&#x200B;\n\nPeople don't like to lose.\n\nNTA", "NTA My wife writes and runs out local bar trivia and it’s a blast! If anyone even suggested it was gender exclusive they’d be out on their ass in a second!", "I hate it when guys want to exclude women so they can  have \"guy\" talk. You know why? Because it's pretty disparaging the things they'll say and they don't want to be judged for it. Source: volunteer firefighter", "NTA.\n\nIt's a public place and you have every much a right to be there as he does. If he wants a guys-only activity, that's fine, but he needs to set that up in a private residence or rented space or something. He can't just commandeer a public meeting place.\n\nYour boyfriend should be backing you up, frankly.", "NAH because we literally have no context for why he doesn't want women in the space. If he's just a misogynist then obviously you're not in the wrong but if say there's something deeper and maybe troubling in his past then his refusal to join could be reasonable. Men can end up traumatized by women and everyone just assuming he's a misogynist with no context besides this lady's brief interaction is ridiculous and exactly why men under report a lot of things. Like seriously no context really given and yall just immediately assume it's for bad reasons when I've seen plenty of posts asking for more info before being able to make a judgment. Yall need to make sure you don't become the assholes you judge. If I'm wrong and I missed the context let me know but like really fucking rediculous", "NTA\nI'm a guy. We dont need guy safe spaces in bars. He is a sexist ass. You want a guy space drink at home. \nI can think of reasons I may not want a person in a space but sex is not one of them.", "NTA if dudebro wants to have Sausage Society Trivia Night, he can rent out a private event space.\n\nFree from the judgement of women? WTF kind of trivia is this where the questions or answers are going to result in negative judgements from women?\n\nIf you aren't comfortable saying or doing something in a public space if a specific kind of person is present, then chances are whatever you're saying or doing is some serious BS you know you shouldn't be engaging with publically.", "INFO: Is this a group of dudes in the back room trying to have a guy club thing going or is the guy trying to take over the whole bar?\n\nBecause if these guys kind of got their thing off in a corner to themselves and aren’t trying to generally exclude women from the whole place, why do you feel the need to invade what they want to be a male only event? Flip the genders. No one would be saying a guy doing this to a group of women would be cool.", "Hooray men's mental health issues are a joke.  Everyone laugh at this man that wants a public safe space from women.  What a jerk for wanting to be free of women for a couple hours of his weekly life.  I can't believe the privilege of this one guy who maybe needs that space.  \n\n\nThe fact is if the shoe were on the other foot and it was a guy entering a public female safe space. He would be ripped up and down for his privilege, invading that space.  \n\n\nIt's shit like this that lead men to  feel like they can't express their feelings and end themselves.  \n\n\nYTA.", "ESH. How would you feel if your safe space was invaded by a member of the opposite gender, who after being asked nicely wouldn’t just leave. It doesn’t seem like the guys entirely alone in his unhappiness at your presence. The guy sucks because he can’t handle a woman being in the same room or apart of the same game as him.", "NTA - Fuck that guy and him trying to gatekeeper the trivia night, if the bar owner has an issue with you coming into their bar and spending money on things their bar sells, he can broach that subject himself. Also your boyfriend should be on your side of this issue not telling you that something you found that's fun and safe should be kept from you.", "NTA. It's a public space.. he has no right to tell you you aren't welcome there. He doesn't even work there!", "If they want an exclusive trivia night, they can have it at one of their homes or rent out a business for a night. NTA", "NTA. I’ve been to trivia night at multiple bars, it was always a mixed gender crowd.  If the guy wanted a “safe space from the judgement of women” he should’ve made that clear from the beginning that it’s boys only trivia.  Or better yet, hosted it at his own house, because I don’t know how you manage to exclude one gender at a public bar.  Were you literally the only woman playing?", "Lmao so nta what a weirdo huh?", "NTA.  F that guy.", "NTA Trying to kick you out of a public space?? Yeah no. They can have their guy's night at home. \"Women's judgement\" bro just say you're an unfunny sexist dick. Or they're afraid you'll do better than them. Probably both.", "NTA \n\nBar... public Bar. \n\n\nYou can set up a fun trivia night in some man's cave where it's beer and trivia if you only want men.", "NTA, not even close. It's a PUBLIC BAR. Even if he were the owner, I'd say the same thing that you should be allowed there.\n\nA guy's safe space. Give me a freaking break.", "The audacity of that man trying to create a he-man we hate girls club in a public restaurant/bar.  Cry about it, buddy.  \n\nNTA.", "NTA and I smell an Incel.", "NTA.", "NTA", "NTA. Creepy misogynists don’t get to make rules about where women can be.", "NTA and fuck that noise. Men don't need a safe space from women beating their asses at trivia.\n\nSigned: former college bowl captain, unsuccessful Jeopardy contestant, regular winner at pub trivia, and owner of a vagina.", "NTA. If he wants a guys only Trivia night, then he can have it in his mother's basement.", "NTA - He doesn’t own the bar. He’s acting like an entitled little boy. Just ignore him", "NTA I’d have found as many females of as many ages as possible and invaded on the next ‘trivia night’ and asked the quiz master to stat with the question: what do you call people who hate and are afraid of women?", "Sounds like you found an incel in the wild.\n\nNTA", "NTA I cannot imagine the bar owner is OK with this as bars normally want to get women to patronize their business, that brings men in. Stand your ground and keep winning at trivia!!", "Unless he's hired the venue for a private function every week, you have every right to be there. NTA\n\n&#x200B;\n\nEdit: does the bar owner know he's trying to turn away business on a Friday night?", "NTA. Sheesh. It's not a private club. You should direct him to the incel subreddit.", "Unless the bar management themselves have raised a legitimate objection to your presence there (and based on the OP, I can't see why there would be), NTA.", "NTA\n\nI would gather several all woman teams for the triva night and make it a weekly thing. .. I guess I'm pretty but yes your not the ASS", "Nta , if the rest really cared they would leave with him and leave you excluded, but since that didnt happen yet just do whatever you want", "If it's public space and not reserved then NTA. You're free to be there.", "NTA fuck that guy and the dog he rode in on.", "What is wrong with your boyfriend?!?!?! NTA.", "NTA your boyfriend sounds like he’s either dumb or a doormat", "What kind of bar A) needs trivia to drive Friday night business, and B) prohibits women on Friday, or any other night? The bar owner seriously needs to reevaluate his business model.\n\nEdit: NTA", "NTA.  You have every right to be there.  It's a public place.  A random stranger being scared of women is not your problem.", "NTA but this is a stupid post. Drink wherever you want and screw whoever says otherwise", "Obviously you're NTA but your boyfriend's priorities are concerning. A stranger tries to kich you out of a public place and he's worried about that person's feeling instead of yours? WTF", "I fail to see how your presence is a detriment to their enjoyment of trivia night??? \n\nIf he wants a guys only trivia night at a bar he doesn't work at or doesn't own, he can arrange his own trivia night or rent the place. Also, it's every Friday night!! So what, no woman is supposed to go to thar bar on Fridays? \n\nYour bf is a bit of an A too btw.\n\nNTA.", "NTA - that is not how it works. He is too emotional.", "NTA\n\nHe sounds frail. It a public location. He can grow up.", "Holy shit NTA I’d find some girlfriends to come with me next time", "NTA, and bring your girlfriends next time.", "If that’s really the case then the bar needs to make that clear if not then fuck em he’s being sexist for no reason let him do that somewhere else", "NTA. \n\nYou owe zero consideration to delicate misogynists threatened by a woman who may be better at trivia than them.", "NTA. Obviously you have as much right to be at the bar as anyone else. It's a public area.\n\n\nIt is kind of weird you go to bars on Friday nights apparently without your partner. It's even more weird that your partner took that guy's side, considering how unreasonable the guy was being.", "NTA.  Dude is too fragile.  Your BF kinda sucks for this.", "NTA. It's not his bar to decide who's welcome or not", "NTA. This is some incredibly sexist bs, and if I were you, I would be digging in deeper with your boyfriend as to why he thinks this other guy's behaviour is acceptable.", "it’s super weird to try and make a bar trivia night a guys only activity.", "NTA. \n\nIf he thinks the mere presence of a woman in the same place as him is enough to ruin a spot, he's an asshole. Like, you're not even on his team. Away from the judgement of women?  It's a fucking public place that he doesn't even own. What the hell is he planning to do that you'd judge him for?  Did you even know who the fuck this guy was before he told you to piss off?  Hell is he even telling the truth about setting it up?  \n\nAlso, your boyfriend taking the side of some rando trying to exclude you from the bar over you isn't a good sign for the future of the relationship.", "NTA. It's a public place. That patron is misogynistic. If he truly needs a \"safe space\" from women, he should stay go some place private, like his own home. The fact he had the audacity to say women aren't allowed is so backward and regressive it hurts my brain.", "[removed]", "NTA - is there a sign on the door (or in the bar) announcing 'Trivia Night'?  I'm guessing yes and you're just coming by for their advertised entertainment.\n\nBTW, he left because he's not the winner anymore", "NTA\n\nYou should offer to fill in his spot on his team and then proceed to destroy their opponents", "NTA\n\nThats sexism. They wanted a space for men, should have made it in one. But they didn't.", "NTA. He's only worried his dick will fall off if he loses to a woman.", "Wait did he want OP to leave the bar entirely or just not participate in the trivia??", "Did the owner say it was a men's only trivia night? I'm confused as to why he thought that to begin with.", "NTA\n\n\"Who is an entitled whiny baby and leaves when they don't get their way?\"\n\nThat guy.", "NTA. That is the most fragile shit i’ve heard in my entire life. Go enjoy trivia.", "NTA lol what the fuck\n\nI probably wouldn't want to go to that bar anymore after finding that out though", "NTA since when is Trivia a guys thing? I met all my friends of all different gender identities at trivia, never heard of it as a \"Guy's night\"", "INFO: is the bar paying for someone to run trivia, or is one of the guys paying someone to run trivia? If the bar is paying, it’s free game and you should go play. But if one of the guys is paying for it, then it is just like having a private event at a bar. In case of the latter, it would be just like you crashing someone’s birthday party and sitting at their table and eating cake.", "If it was the other way around and a man came into an all women event (in a public place or not) you’d all call him a creep and how many red flags that shows. Can’t have it both ways.", "NTA. He’s being a baby. Join his team and lead them to victory. 😌", "NTA\n\nThat's truly one of the most insane things I've read in awhile. \n\n\"The mere *presence* of a woman is uncomfortable for me, so please leave this establishment!\"", "NTA. \n\nThis is not how trivia works in a public place like a bar.", "NTA\n\n>Shouldn't have it in a public bar then", "NTA. screw that guy. my judgement as a woman is that he sucks.", "NTA, fuck that guy. You don’t owe him nothing", "\"He explained that trivia night was a guys thing and a safe space for them from the judgement of women.\"\n\nLol what a fucking snowflake. Either they want to be free to shit on women without getting called out on it, or they are so fragile they can't handle losing at trivia to a woman. Either way he can fuck off. \n\nNTA", "NTA luckily for you and other women you dont have to give a shit about these \"guys only\" arrangements. A man would never want to intrude on a \"womens only\" arrangement, but women can just not give a fuck. Congratulations.", "INFO - Did OP ask to see the manager and relate the exchange?  \n\nA good manager would not want even a regular behaving in a hostile manner to a paying non-aggressive customer.  If the manager or owner supports the patron's request, whether or not you return, report the bar - to the BBB, to the Mayor's office.  This is likely NOT treatment either wants the town being known to support.", "NTA, bring more women.", "The ‘judgement of women’ - you just know the sort of shit they’d have been talking. Men in the 60’s had issue with this, I thought we’d moved on. \n\nClear NTA.", "It's MY tree house and there's no. Girls. ALLOWED!", "NTA\n\nWhat the actual fuck?  Trivia as a space space for henpecked men?  Like, was the guy going on about scoring 4 touchdowns in a HS game?", "NTA but your boyfriend is sexist and not doing any favors.  That attitude could mean he talks about it different privately to his buddies than when you’re there.", "Speak with the manager or owner of the bar. They need to know this “customer” is trying to run off the female patrons. That is not conducive to their bottom sales line. As a bartender, I would throw this guy out for being a bully. NTA", "NTA - But the dude at the bar and especially your boyfriend are assholes", "\"safe space from the judgements of women\"!   \nClutches pearls! Those cruel cruel women judging him for, I'm guessing, being a misogynist!  NTA", "NTA. Dude sounds like an incel.", "imagine if women had a womens only thing going on and a man said owell im doing it to wouldnt yall freak out and kick him out.  ive seen this many times. cant have it both ways", "NTA; I'd understand if he was referring to a club that tried to be men only for the sake of helping men feel safe from creepy women the same way some people have made women only clubs to protect women from creepy men but that isn't the case.\n\nIf he feels that strongly he needs to pay the owner to rent out the bar for trivia night then, otherwise you're not doing anything wrong by going to a public space intended for the public and not even causing any actual problems.", "Were the men wearing t-shirts that said \"No Ma'am\",   did one of them look suspiciously like Al Bundy?", "NTA. He’s a huge, sexist AH. And so is your boyfriend.", "Definitely nta. He sounds misogynist since he’s refusing to let you join them solely because you’re a woman and he’s underestimating your intelligence because of that. It’s a public space, it makes so sense for him to “not allow” you there", "What in the sexist fuck is this nonsense? And what is wrong with your boyfriend? Anyone who needs a safe space from women is free to establish one, but not in a public bar via a public trivia night.\n\nFeel zero sympathy for this guy. Make zero apologies. Attend trivia at every possible opportunity, and kick ass.\n\nNTA in any way shape or form. Anyone who disagrees is a sexist asshat.", "NTA it’s public and that guy is on a power trip. I am sure he just wants to be the smartest in the room and if anyone jeopardizes it then he doesn’t want to play anymore. He’s a big baby. Keep going and bring friends", "NTA.     Trivia night is there to drive traffic into the bar, and they usually have it on a night that wouldn't otherwise be busy (Tues / Wed / Thu usually).   It doesn't make sense to have an event that is designed to bring people in, then stand at the door swatting 50% of the population away.   I doubt your guy's story that a) he set it up with the owner, and b) it's men only.\n\nPlus - was OP the only woman in the pub?   Seriously doubt that.", "NTA", "Of course NTA but WTF is up with that guy and honestly your bf seems a bit sus. \n\nTrivia is a guys thing? WHAT? That’s moronic. And he was so butt hurt he left in protest? That guy is unhinged. \n\nAnd your boyfriend says you should try to see his pov? WHAT!? There is NO explanation for trying to say trivia night is a guys thing! \n\nStay away from bar guy and honestly I would keep an eye out for other red flags from bf.", ">I told my boyfriend and he thinks I'm being mean to the guy and should try to see his point of view.\n\n🚩🚩🚩🚩🚩🚩🚩🚩🚩", "OH NO! You threatened his manhood. Heaven forbid a woman be better at something. \n\nNTA and good for you for standing your ground and beating them!", ">He explained that trivia night was a guys thing and a safe space for them from the judgement of women.\n\nhis \"reasoning\" is nothing but pure misogyny\n\n>Last week he left \"in protest\" of me being there\n\nLOL, and not only he's a misogynist, he's also very immature\n\nNTA, if he feels so threatened by women, he can set up his own trivia night at his place.", "NTA. I used to do a regular bar trivia night, but it was for both men and women, and only half of the bar patrons got involved anyway. If he wants to make this a private event then he needs to pay a fee to the owner for the exclusive use of the bar for the evening, and that needs to be posted at the door. Otherwise, this is not a private party and you should definitely keep going. If I were you, I'd find a group of ladies to show up regularly just to piss this guy off. But I'm petty like that. Haha...", "NTA.  Maybe you should try to see the guy's point of view, but it is up to him to present it in a non-ahole way to you.  Looks like he didn't do that.  Also, somebody in this story is afraid of  losing in trivia to a woman.", "LMAO NTA. He's just a fragile little baby who's threatened you might show him up.", "What a load of BS, pardon me. How do people get to live in their safe little bubbles like that for that long, is beyond me.\nNTA OP. This is, in my opinion, behavior I'd expect from children.", "NTA. It's a public place.  He just doesn't want to get beat by a girl.", "Nta", "NTA nothing about “trivia night” at a public bar says “men-only safe space”.\n\nIf that’s really what it was supposed to be they would call it “gentlemen’s night: men-only trivia” and it probably wouldn’t go over well at all with the general public.\n\nNot a bad thing for guys to have safe spaces, but, those safe spaces definitely shouldn’t be “public” if they want them to remain “safe”", "Fuck that guy, if he wants to exclude people from a trivia night at someplace he has nothing to do with then he can bring in a box of Trivial Pursuit and bask in his fragile masculinity. Nice work making this one uncomfortable, sounds like he needs it. NTA", "NTA", "NTA if it was really as he said it'd be the bar owner talking to you and even if that happened they'd just be a couple of sexist bastards.\n\nyou weren't there judging him until he made an ass of himself then you fairly judged him.\n\nbe sexist in his own house if he wants.\n\nalso wtf is wrong with your bf? the guy's point of view is pretty clear, he feels negative emotions in the presence of a woman so he thinks the right course of action is for her to vacate that public space not him just because he was there first.", "NTA, fuck that guy. You want to play by different rules than society, do it from the comfort of your own home.", "Sheesh! If we let women in on trivia night, next thing you know they'll be running for president and captaining starships! Where will it end...?!\n\nOh, and NTA.", "A guy only game night? Mmmmkay then you can pay to have the bar privately for yourself. There is such thing as renting spaces for private events, does he know that?? 🤣 nta", "Sheldon is T.A.", "Aaaaaand here come the ‘not all men’ crowd", "NTA, if he didn’t want women there, shouldn’t have done trivia night at a public place", "NTA", "Does the bartender have an opinion on one of his clients running off other paying customers? NTA, obviously", "NTA, unless it was advertised as a mens only night. And even then, it’s the bar owner’s responsibility to enforce not some random attendee.", "NTA, occupy that space with all the confidence of a mediocre white man!", "NTA\n\nHonestly, the guy has a point about men's safe spaces.  We do need them.  Just like women need them too.  However, those shouldn't be in public settings.  If they are, then they're open to the public.  He can be mad all he wants, but having your \"safe space\" in public is simply unreasonable.", "I'm worried that this is a troll post so someone can say \"wahhhh if the genders were reversed you'd see it differently!\" and it's meant to be some kind of rough analogue to a dude trying to barge into women's only events.\n\nHere's where that breaks down: it's a public bar. It's not a private event. The owner of the bar did not ask OP to leave. Nor did any of the bar employees. Just a regular customer. \n\nIf this WERE an official men's only event or a private event where the bar was a rented out venue, then OP would in fact be the AH for insisting on attending. But since it's fully open to the public, and the actual bar staff doesn't seem to care, if this is real then OP is NTA", "NTA. Bar trivia is open to the public. If the owner has a problem with someone, it’s up to them to kick that person out, but you didn’t do anything wrong. If they wanted it to be a “guy thing” they can do it in one of their homes.", "NTA but I was a bit surprised there was no mention of other girls participating in the trivia. Still the dude is an AH but if she’s the only girl there, I find that very odd.", "NTA and run from that boyfriend", "This reminded me of that video that recently surfaced of when they started allowing women into bars into, I think, Australia.\n\nSome of the men interviewed were furstrated because it had previously been a men-only space for them to unwind.  Honestly, I can understand that to an extent.\n\nBut, there are dusty old men's organizations for that type of stuff, even to this day.\n\nTo be so blatantly sexist about it as to try to get you to leave, presumably when you weren't even interacting with him, makes him a huge AH.\n\n&#x200B;\n\nNTA.", "You should be more concerned that your boyfriend is supporting a random stranger being misogynistic towards you.\n\n>I told my boyfriend and he thinks I'm being mean to the guy and should try to see his point of view.\n\nTell him you think he's being mean to you, and he should try to see your point of view. Ask him how he feels now. If he doesn't get it, you need to take a view on that...", "NTA - eff that pigman", "NTA the bar isn’t public, it’s a private business and if the bar doesn’t want you then they will ask that. He is just a customer", "NTA. This guy is a sexist jerk and he SHOULD get things “ruined” for him.", "Ask the people who work there I guarantee you they prefer having a woman there over a man", "I'm a guy who *loves* bar trivia, and this idiot is insane.  NTA.\n\nAnd, uh, have a talk with BF.  I'm a little worried by the fact he thinks the guy has a point...", "What bar is this? I want to go to trivia night.", "> I told my boyfriend and he thinks I'm being mean to the guy\n\nBy being at the same bar while female?  There's something really wrong with your BF.\n\nNTA.", "NTA, what is this, a treehouse with a “No Girls Allowed” sign?!", "NTA Get a bunch of your girlfriends and put together a kickass team", "NTA", "NTA and throw the boyfriend away for supporting sexist behavior. 🚩🚩🚩", "NTA. Taking \"safe spaces\" away from people like this is basically a public service. Call him a little baby man next time you interact, for bonus points.", "Nta", "NTA - it sounds like he has some major issues with women in general.", "Hahaha NTA. Unless the bar posts a sign saying “He-Man Woman Haters Club, No Girlz Allowed” on the door, you are allowed to be there. Like seriously - reading that story I was picturing Spanky. I’m sure the owners are happy to have another paying customer. I’m the kind of petty that would invite a few extra girl friends just to piss him off more.", "NTA. It’s a public bar, end of story. If he wants a safe space far away from “the judgement of women”, whatever the hell that means, he should host it somewhere else like his own home for example.", "NTA\n\nIf it's not advertised as a mens only trivia night then you are not being the AH.\n\nIf it is, then yes, YTA because we know when we have women specific events, we don't expect men to show up. #Equality\n\nIf the bar is not stopping women from entering, then it's him just throwing a little temper tantrum.", "How did you ruin it? Were you being loud and obnoxious? Were you talking to all the players distracting them from the game? Did ya keep feeding a jukebox with loud music?( Dobthey still have jukeboxes in bars? I didn't even know they still had bars.)\n\n It seems odd that in this day, anyone would have fault with a woman being I'm a beer tavern. In Grandpa's day, and I mean my grandpa so way way back, women weren't allowed in the taverns. I always chalked it up to being that you can't get accused for picking up girls if there's no girls. Lol. But those guys should all be dead by now. \n\nWere you beating him? Dam Google millenials!!! Lol. If that was why he got upset then he's definitely the asshole.\n\nIf it's as you say it was, you sitting there having a drink and politely minding your business, then NTA. He too should politely mind his business. But the fact that your boyfriend took his side over yours makes me think we're not getting the whole story. In fact, the whole \" I don't care about that guy anyway...\" rant puts me in belief that YTA and we don't have the whole story.", "NTA. If I were you I’d start inviting friends to go with you and make it a girls night.", "NTA. I didn't realize 14 yr olds were allowed into bars, which I assume he is based on his behavior \n\nYou're not impacting his enjoyment of the space, HE is. If he sits at a seat with his back to your table he won't even know you're there.", "This guy hates women ***so much***, he feels the need to harass a stranger in a public place and try to make her leave? And your boyfriend *agrees with him*? NTA But you need to find a new boyfriend, he's misogynistic as fuck", "YTA", "YTA...  If it was opposite..  I'm sure you would make a stink.", "[removed]", "Your last sentence indicates you are an asshole. If you don’t care about being an asshole, you’re still an asshole. Honestly, why are you even asking? You know you’re an asshole.", "easy to see why these men do not want to be \"in judgement of women?", "The trivia night is a safe space? For what exactly? Dumb people?? Dude's probably just mad OP happens to be good at trivia and is blaming her \"smarts\" on being a feeeemale. \n\nNTA. That asshole doesn't even work for the bar and I'm betting the bar owner would be pissed to know this tool was trying to chase off customers.", "I’m sorry I really don’t like OP’s boyfriend rn…\n\n>I told my boyfriend and he thinks I'm being mean to the guy and should try to see his point of view.\n\nWanting equal access to public spaces is *mean* y’all 🙄", "Honestly this just sounds like OP is good at trivia and the guy doesn't like losing to a woman lol", "If he was trying to make a guys only thing, it's odd to do it in a public space but the least he could do would be to pick an odd day of the week like Tuesday nights or something to get a smaller more targeted audience. Still not a good plan but considering Friday and Saturday nights are always going to be more popular, and wouldn't you know it but about 50% of people aren't men. If you weren't the first woman to upset his plans, someone else would have been.", "This, yeah. Completely in favor of men having their own space, but that’s not going to be it.", "Not to mention, it is a FRIDAY night.  I doubt the bar owner would be happy this dude is trying to chase off half the clientele.  NTA", "If that was actually the deal, you'd think the owner would've backed him up about it being a \"guys' night\" activity.", "I think it's even fine to have a trivia guys night if the owner wants, but it needs to be clearly advertised as such and not be surprised when people want to join.", "Men are never so protective as when they are defending another man’s bad behavior", "If I were the bar owner, I'll be furious if some random customer decides to deny entry to women every Friday, which would undoubtedly be a busy day since end of the work week and all. Like unless that guy is willing to reimburse me for all the sales I would have lost by only allowing men into the bar, he can take his little \"no girls allowed\" treefort somewhere else.", "In America that would violate the Civil Rights Act.", "Or he can do it at the bar — if he rents the entire bar out **every Friday night** to have a private event. \n\nBut if it's an open business, anyone who walks in the door gets to participate.\n\nSo what's a mens-only space worth to him? Is he going to pay to play (the way he wants to)? Or is he going to make peace with the fact that a bar is open to the public on terms he doesn't get to set.", "\"Judgement of women\" probably means \"calling me out for misogyny\".", "Sounds like that guy is an incel.", "My guess: OP is a dude trying to make a point about \"everyone thinks this is unfair but they don't say the same about ladies' nights at bars, waaaahhh\"", "Considering she described as the bar Has a trivia night It’s extremely safe to assume this isn’t a small group of guys off in the corner whispering trivia questions to each other.", "I knew I'd find a y.t.a if I scrolled far enough. \n\n😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Reading comprehension is important", "I think it's fine for dudes to have places to hang out without \"feeeeeemales\" (it's pretty weird to refer to men as dudes and women as females lmao), but a public bar is not it. If this guy wants it that way, he needs to privately rent the bar or do something else to control a private space and gain the right to make it exclusive.", "Im sorry, OP is the entitled one?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Agree!\n\nI was thinking — okay, if the guy needs to play like this, he can rent out the entire bar for his private event and make it invite-only.\n\nOnly how tf much would that cost? Or how much would it end up costing the business — to give up public service every **Friday night**?\n\nThis situation... is not a thing. It's obviously the dude's *wish,* but wishes aren't real. Someone shoulda told him.", "Right? \n\nDoes the bar owner want to sell a lot of beer to women? How does the bar owner feel about being known as the bar that provides a safe space from the judgment of women?\n\nDoes he know this guy is planning to make the bar a dudes only space? \n\nDo other dudes know there will be zero chances of meeting women there?\n\nI have questions about the business model Trivia Guy is proposing.", "Lose _to a woman_.\n\nWe all know the penalties for that, you are legally required to undergo castration and your man card is voided.", "If you want to worry about losing in trivia, try playing in Cocoa Beach with two different groups of actual fricking rocket scientists in the place.", "He's just worried that their sexism would be called out", "considering how unreasonable the guy was being.", "Totally. A some guys really cannot stand to lose to a woman!", "That's likely exactly what provoked him to tell op to leave. Some woman was proving to be smarter than him and he simply couldn't have that. What a doorknob.", "Except I’m pretty sure the bar owner doesn’t want that guy’s “safe space” to get in the way of his revenue.  If OP comes and spends money I guarantee she’s welcome", "Seems like the correct answer would be to just host the trivia night at someone's house.", "The BF does have a point though. Clearly the guy doesn't have anywhere else to be inappropriate and say things too vulgar for a woman's fragile, virgin ears.\n\nOn a serious note, people who try to claim public space as theirs like he did have serious issues they need to deal with.\n\nNTA op", "He should also be furious that this guy is implying he has the authority to make a decision for the bar that would violate the civil rights act.", "This is my take. He's made because he can't be the king of trivia night anymore. It's weird and creepy.", "It's not the idea of having a 'men-only trivia night' that makes him sexist and weird - it's the fact that there is no indication that this *is* a 'men-only trivia night' beyond the assertion of this one patron of the bar. He doesn't work there, no-one who actually works there has told OP she isn't welcome, and it doesn't sound like the evening is being advertised as men-only. (If it was held in a private function room with signs up etc, then OP would be TA for crashing the party. It isn't, therefore...)\n\nHe's trying to bully her out of going to a bar, that is open to the public, on completely made-up grounds, just because she's a woman. If that *isn't* sexism, it's still a concerning level of hostility and entitlement towards a complete stranger in a place where he has no authority. If I were the manager of the bar, I'd be telling him to stop harassing paying customers or gtfo.", "It sounds like if anyone working for the bar told OP this she’d leave. This is just some regular who made a suggestion. He isnt organizing it. Hes showing up with his team to participate. He is truly just some guy", "The bars or clubs are the ones arranging Ladies Nights events, not some mouthy patron. He can have his Boys Night at his house.", "Ladies nights are a thing because bars use specials to draw in more women... for men to hit on. Men aren't excluded — in fact the events are really *for* them (better hunting ground, I guess).\n\nExclusive mens-only trivia nights are probably a lot of fun!...in the host's home man-cave. But if that bar ever wants a woman's dollar again, they're bad business. And I'd be surprised if the bar owner is as on-board with looking discriminatory as the hostile bro is.\n\nNTA", "Please, tell us about these women's only nights at bars. I'm 40 and have never heard of such a thing. I've heard of ladies nights, where women get to drink free, but men are there.", "\"Ladies nights\" are just discounted drinks or no cover for women. The whole point is to bring women into the bar so that men will come to the bar to chat them up.", "That just sounds dumb, most of the time the business doesn’t exclude men on those nights, the goal is to bring women in so that men will want to go there. This guy could go to trivia at a gay bar, but he would be disappointed because women will be there also…", "Men are excluded from the drink prices. They’re not excluded from the bar.", "It’s not absurd, it’s up to the actual business, not the patron who suggested the night to enforce it. Seems like a bad business decision to me to exclude a large number of your guests from a trivia night. And the main reason there are ladies nights at bars is to bring in more people not potentially tun off a bunch of people. It’s a purely business decision.", "Ladies are advertised as ladies nights. On top of that most ladies nights ARENT gender exclusive, they just give free drinks/discounted drinks, and/or free entry, men are still allowed they just have to pay full price. This trivia night is advertised as a trivia night, not gender ex,cursive or she would have known that the first time she went. Considering she went the first time and not a dang person said anything to her, including the bar owner who okayed the trivia night, this isn’t a case of her invading a mens night.", "Yeah, the sitting the fence part to avoid confrontation is the sexist bit. Bigotry doesn't present itself only in the 'in-your-face' type of way.", "Please enlighten me on where my reading comprehension failed?", "It's first and foremost not a hill at all.\n\nSome random id\\*ot decided that a woman at a public space is a problem for him.\n\nHe built his own hill and committed a suicide on it. It has no bearing on OP's life whatsoever.", "You’re right but this story kinda makes me think he has a controlling girlfriend that won’t let him be around other women", "If I owned a bar and found out that one of my patrons had taken it upon himself to ban women from entering or taking part in bar-sponsored events, that guy would be the one not allowed in anymore, not the women.", "I read that first line in Chi Fu's voice from Mulan for some reason.", "A few years ago, I was picking my daughter up from elementary school, and a mom and her son were leaving right at the same time as us. As kids do, both started running across the courtyard for fun. The mom yelled to her son, \"You're letting a girl beat you!\"\n\nIt still makes me so goddamned angry.", "That would be the worst! It is like not even losing to another person! How dare women be smarter than men! \n\n/s obviously..", "This!", "Even if it’s not illegal good luck finding a bar that’s like “yeah let’s have half our potential clientele not be allowed in this night”. And, how many guys actually want to go to a bar with no women?", "Depends on how they do it. If they have trivia nights every week, and one a month is men-only and one a month is women's-only, they're probably okay.", "depends. My dad was a bouncer, and told be stories about how the bar had a TINY cover fee to get in. like a quarter or a dollar. this was important because the second you have to pay to get in, *its no longer a public establishment, but a private one.* this distinctions is VERY important because the rules for private members is much less restrictive. a private establishment can kick you out, or not invite your any for basically any reason. if the bar has a cover fee, the BAR OWNERS could choose to have guys only trivia night. but that has to be by the owners, and they would need a cover fee", "Not if you rent it out for a private party", "I would hope a women-only trivia night would also be illegal in those countries, then. Sounds like a stupid law, but I hope it would be applied fairly at the very least.", "Not in the least. A private establishment has every right to put on a 'blokes only' or 'women only' night.", "The bar is private property, they can allow in anyone they want", "How do women only gyms work?", "In the US,  bars are privately owned, and free to discriminate against anyone (  see:  bakers refusing to make cakes for gays)", "I don't think anyone is saying that.\n\nIn any case: Was it advertised as a men-only night? Did anyone who actually work at the bar tell OP she couldn't be there because it was booked out for an event? Or did this one dude just get in her face for no reason?", "I've never seen a single women-only bar.  Where are these spaces exactly?  Maybe if you actually had a point instead of a strawman people wouldn't downvote you.\n\nAnd if OP is in the U.S. that would be illegal for a public establishment.", "Maybe because no one else wants a male only trivia night besides that guy", "Which is why he's an asshole.", "Both can be true.\n\nPromoters can go to a bar and negotiate to use a space in their establishment to host a \"boys night trivia\".", "I get where your coming from, but I still don't see it the same way.\n\n(based on OP's story) He didn't talk down or belittle her, didn't threaten or become violent... Just told her what he did, and left when she wouldn't. \n\nI think he was certainly childish, immature, and that guy definitely needs to work on his communication skills and a sign for his trivia night. But to brand him sexist becasue he clearly lacks communication and social skills is a bit of a reach. \n\nIf there was more to the story, and he used misogynistic language, I'd be on the \"he's an asshole\" side immediately.", "I think that depends on the bar and promotion. Not all \"ladies nights\" are the same. Especially if you don't live in the same city, state, province, or country.", "It’s not the bar. It’s a patron. There’s no business decision being made.", "Oh same. Whenever I read something misogynistic online I always hear it in his voice lol", "In fact, I think he had a line very similar to that.\n\nNow *that* was an asshole.  Just a couple of notches above Shan Yu", "I totally did too.", "I can totally hear it", " Yeah men like this are just the worst. My ex-husband was always upset that  I knew more than him all because I read a lot and if I don't know something I look it up. He hated it.  I remember he once told my son that \"Men Know everything\". So the first time after that when my son asked him for [help.My](https://help.My) ex said \"Buddy if you don't know I don't know\".My son is very sharp and my ex's words ame right back at him with. \" But you said men know everything\". I never laughed so hard and I told him \"I knew that was going to bite you in the ass someday.\" My son was 5 he's 23 now and we love this story.", "they may be able to make the trivia \\*contest\\* gender-based but I don't think that they can refuse service based on gender.  Even bars with Ladies Night allow men through the door.", "Depends on the state, but none of them really accept “separate but equal.” You can’t balance out one discriminatory event/space with a counter-discriminatory event/space. Both would be illegal or neither would be.", "It doesn't balance like that. You can't deny someone service from a business that serves the public based on their gender, ever.\n\nWhat you described would just be two separate instances of illegal gender discrimination on two separate days. One against men and one against women.", "It depends on the incorporation. An establishment can’t just switch between public bar and private club at a whim.", "They still do this in the South", "In the US that would be a state law and not apply everywhere.", "Yes, the law is against gender discrimination, not specifically men’s-only trivia nights. Of course it goes both ways.", "It’s explicitly illegal at public accommodations, even privately owned ones, in many states. https://en.wikipedia.org/wiki/Ladies%27_night", "No that’s really not true.\n\nIf anyone reads this and cares, here’s an article explaining how extremely limited that decision was and how it was based on the baker’s religious views - where the bake also was closed on Sunday and didn’t make cakes for Halloween or any that contained alcohol.\n\nThere is absolutely no basis to say privately owned businesses can discriminate against who they want.\n\n[Baker refusing to make cake for gay couple](https://www.nbcnews.com/politics/supreme-court/narrow-ruling-supreme-court-gives-victory-baker-who-refused-make-n872946)", "No, it’s explicitly illegal in many states.", "Discrimination is based on protected classes in the US.", "That's because they aren't a protected class.\n\nI would guess that if those same asshole bakers refused to bake a cake because the person was disabled, they would lose in court because of the ADA.", "In England, its the owners discretion if they bar anyone and they own the pub. Source: local guy barred unvaccinated people when things reopened.", "That dude was definitely in the wrong and his behaviour was weird. \n\nIf you read my very first comment replying to the comment at the start of this thread, I clearly agreed that OP is NTA (quote - “You’re 100% right”). \n\nEverything else was unrelated to the behaviour of that guy, and was specifically about the existence of mens only nights (I replied that they aren’t really a thing and a discussion went on from there, unrelated to the weirdo and his behaviour).", "The other BAR patrons would probably be furious if all the eligible ladies were kicked out of the bar for dudebro trivia lmao.", "Totally agree! Ladies' nights were created to get more men to the bar... similar to discount taco night. Lmao!  They don't exclude men. Discount taco night doesn't exclude burrito eaters. They just pay full price for a burrito. \n\n They usually give women free entry and charge men a few bucks. It's like a free kids meal at ihop... which isn't to exclude adults. It's to encourage adults with kids to come. \n\nIf trivia night was \"gentleman's night\" and women paid $5 and men were free, that's fine. Op can pay $5. But attempting to exclude her from a public place and activity... that's different.", "your comparison is still comparing “a safe space for women without having to deal with harassment from men” and “a safe space for men without having to deal with the judgment of women” which is…not a great comparison\n\nedit: a word", "The only time I’ve seen a ladies night like this, is at a queer/gay/lesbian bar where straight men are already less likely to be thus making it easier to make it a safe space. And it’s *advertised as such*,", "She hasnt done anything wrong tho. You’re saying E.SH. All she is doing is participating in a public non-gendered trivia night even though some random asshole wants to exclude women\n\nRandom men on the street dont have the right to order women out of public spaces", "She wasn't asked to leave the bar, just to not participate in the trivia event. I also think there's a chunk of the story missing based on her Bf's reaction to it, and her comment after about being cold.", "And he didn’t do that so", "Ok so a black person comes into a bar of only white people, a white guy walks up to them and in a polite tone says you’re not welcome here. Trivia night is for white people and it’s a safe space for white people to be free of the judgment of people of color. Then he walks off because it’s not all white people anymore so he’s uncomfortable.\n\nWhile this guy didn’t use any overt slurs, the racism is obvious.\n\nJust like the misogyny is obvious in this post. We are not going overboard by saying that a man trying to ban a woman from a public space/business he doesn’t own is sexist.\nHe is motivated by not liking being around women because of their “judgements”\n\nThere’s no way he isn’t sexist", "Fair, but I’ve never heard of one barring men from the premises. In fact I feel like typically the point is to attract ladies so more men will come to talk to the ladies.", "The boyfriend wasn't at the bar. Op told him about the situation so obviously he wasnt there to witness it.\n\nWhy would he have to go to a bar that this other guy had already left, somehow find his address, and go to his house in order to fight him over an unofficial trivia night?", "He doesn’t think she’s threatening his relaxing time-he’s annoyed because now he can’t comfortably engage in “locker room talk” or other sexist stereotypes he holds-(like you can’t swear in front of women apparently)", "Looks like you may need to work on reading comprehension (as well as   \nlogical reasoning). \"... trivia was something he had set up with the bar  \n owner and I wasn't welcome...\"", "Yea I’ve seen some bars have themed trivia nights so it tends to skew one way or another, but it’s not like they say “no men at romcom trivia” or “no women at sports trivia”", "It really does. At least four states in the US have determined that ladies night promotions are illegal gender discrimination. I can’t imagine this would be any different.", "Of course you can. There are women only gyms, gentlemen's clubs, women only taxi firms... I mean I could go on for hours. The simple fact is there are jobs and services which are gender specific and perfectly legal.", "How is \"lady's night\" a thing at so many bars if that's not legal? I'm not saying any of this is or isn't a good idea but it seems like if one is legal the other should be", "yeah they can, bars do it ALL the time. friday and sat nights have cover fees, and are \"private\". the less busy and rowdy nights no cover fee, just walk right in, \"public\"", "It depends more on the state and local laws and how they’re interpreted I’d think. \n\nBack when they started passing the no smoking inside laws there was an exception for performances like you’d see in a theater. Well, a lot of bars decided to make it so that they were giving a performance each night so people could smoke inside until the powers that be cracked down on it.", "You would be surprised at how often that's not the case.  Either way, I stand by my original argument: If someone wants to set up a men-only or women-only trivia night or other event, they have every right to do so.  But they have to do so from the start, they can't just gatekeep later.", "And perfectly legal in the majority of countried. A handful of archaic laws doesn't equate to it being *'gender discrimination in many countries'*.", "You could do that in the US as well because vaccination status isn't a protected class.", "> Although ladies' nights are prohibited by the Equality and Human Rights Commission in the United Kingdom as unlawful discrimination, some clubs reportedly flout the ban.\n\nhttps://en.wikipedia.org/wiki/Ladies%27_night", "Sure, but that discussion is a red herring, since there is no indication in the post that it actually *was* a men-only event/night, and the comment you were replying does not decry the very concept of a men-only night as inherently sexist.", "OP used the quote “a safe space for men without having to deal with the judgment of women”, not me. \n\nBut yes, sometimes guys just want to be guys with other guys because they feel they can't be themselves around women. There's no asshole behaviour behind that. Just people calling men sexist assholes.", "Your position is basically that she must be lying about the story because the men couldnt just be unreasonable. She feels cold hearted cuz her boyfriend is gaslighting her for not obeying a random male bar stranger", ".... So.... He's an asshole....", "In fairness the bar guy makes no sense and so assuming he’d do nonsensical things isn’t without some merit.", "Men feeling attacked by women: women are at a public bar when I don’t want them to be that’s mean :(\n\nWomen feeling attacked by men: literally physically and violently being attacked", "Nope. The bar saying you can set up a trivia night is not you being part of the bar’s business structure. The bar isn’t making a rule about no women. This one non-employee is making decisions.", "Omg, lol. Right!\n\nWe don’t live 100 or 50 years ago when women couldn’t vote or own property or even had a hard time getting into college or what the hell ever else. We live today. Show me a place where women are truly discriminated against? Underrepresented on board rooms? Congress? That’s about it these days, but are they discriminated against in those places? Girls are in the Boy Scouts now for crying out loud.\n\nBut, but, but we fought so hard…. Yeah you did, you achieved 99.9% of those goals, you don’t get to keep using some sort crime of our great grandfathers as some sort of slight that YOU never experienced.", "Gyms and clubs are membership things. They are not \"open to the public\" the way a restaurant or store is.\n\nThe problem comes in when I'm only in town for a day, and it's a day you refuse to serve my gender. It doesn't fucking matter to me that you're going to make up for it tomorrow. I won't be there.", "They let men in and still serve them. The rulings are all over the place though. It's illegal in California and NY to have discounts for one gender, for instance. Other states it's legal.\n\nI, myself, have never actually seen a ladies night in person. I'm not sure it's a thing places still do outside the media. Even then, I haven't seen one in the media since the 80s or 90s.", "Ladies night is women free  or free drinks before a certain time. It also only exist to get men to come to bars.", "Just because they have a cover fee doesn’t make them a private club for the night.", "Or any night there's live music.", "> they have every right\n\nI’m telling you that in many jurisdictions they do not.", "That’s why I said it’s illegal gender discrimination in many countries. That implies that it’s not in others.", "Hr was praised for it alot to be honest, especially as it was just back to opening up and most people were vaccinated", "The parent comment to this thread is as follows:\n\n“NTA. Until and unless the owner specifies it as \"male-only\" night, you have as much right to be there as he does.”\n\nI agreed with the NTA. Then responded to the second sentence saying that those aren’t really a thing. In response to that, another commentor replied with “Darn it, there just aren't spaces for cis dudes to get together and dude out anymore without the intrusion of the women and the lower classes!!”\n\nThe “lower classes” part clearly implied sexism/seeing other groups as less than. I was responding to that. \n\nThe discussion wasn’t a red herring at all (wasn’t trying to mislead from the fat that his behaviour was wrong, esp when I already agreed) but I can see how it can look as otherwise after the thread separated into a bunch of comment and reply threads without easily showing everything I said in chronological order.", "If you want a place to go where you can be \"yourself\" which you can't do around women for some weird reason that *most certainly has nothing to do with being a sexist jerk that likes to make comments that make women feel unsafe* then do so in your own home and only invite men. Not a public bar. \n\nBut, like, you sound like a sexist as well. Just sayin'.", "“Men are afraid that women will laugh at them. Women are afraid that men will kill them.” - Margaret Atwood", "yeah?? we are specifically talking about the scenario in the OP, and you are saying its not sexist because women have ladies nights. you made the comparison because obviously you think its in line with the explanation buddy boy at the bar gave. “guys feel they can’t be themselves around women” and “women can’t exist without being harassed by men” are not the same.", "Not lying, just leaving some stuff out. Not even intentionally, that's just how most human brains work. That's why there are three sides to every story.", "But you’re defending him, so you clearly agree with him", "It absolutely is part of the bar's business structure.  The bar is making a rule about women (they are allowed).  The non-employee is making zero decisions.  He's expressing desires.  That's it.  They are effectively a puppet in this scenario.   If he had any power to enforce his desires, do you think he would have left the bar?  And if he actually \\*did\\* have power, why would the OP want to intrude?  It'd be like sitting down at a table of people you don't know and demanding that they include you in the conversation.", "The bar for women to get into congress is way too low, see marjorie taylor green and lauren boebert", "It doesn't matter. They are private establishments, and as such can put on events which cater to any audience they wish. Only in a handful of ass-backwards states is it considered illegal. Most places aren't so archaic.", "For every country you can give me where it's illegal, I can give you two where it's not. So given a bit of context, it's certainly not illegal in *many* countries.", "I don't think the guy in OP's story is concerned with OP's presents, I think it was more of a participation thing that bothered him.\n\nAgain, because it seems nobody reads, he was childish, immature, and lacks communication skills which make him an asshole. Never said he wasn't.", "While I agree with the quote, all I said was guys want a place to hang out with other guys.\n\nWhy is that so evil?", "No, I used the \"ladies night for a safe space\" in response to the person who said all ladies nights are to herd women.\n\nI used ladies night as a general event bars and clubs host as comparison to guys wanting to have a night of there own.\n\nIf you read my first comment though, I actually call the guy in the story childish and immature. And in another post said he lacked communication skills.\n\nBut please, go off on me becasue im a man.", "Unlike George Santos the pillar of integrity.", "Well, that’s true for everyone. Many congressional districts are very uncompetitive and total clowns can win - man or woman.", "The places that are archaic are clearly the ones which deny service based on sex or other characteristics. It is not archaic for that practice to be illegal, because it was historically very common for people to be segregated (by gender, by race, by class etc) and it is only in very modern times that we have recognised dividing the world up like that is not a great thing to do.", "It does matter, though. We carved out exceptions in the law for it. Men wanted to keep their men only clubs", "You think California, Maryland, Pennsylvania, and Wisconsin are all ass-backwards archaic states? Because they have all found that ladies night promotions are illegal gender discrimination and having a men’s only trivia night would run into the same issue.", "Yes, those \"ass backwards\" states the abide by *federal* law: specifically the [Civil Rights Act of 1964.](https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964)\n\nPrivate clubs can do whatever the hell they want. However a  **public** business (or accommodations, facilities, schools)  can't deny their normal service to someone on the basis of race, color, religion, sex, or national origin. And employers can't deny employment on the basis of the aforementioned. \n\n[I wonder why that law came to be!?](https://en.wikipedia.org/wiki/Jim_Crow_laws)\n\nEdit: I'll add that private clubs/groups/individuals can rent or use private spaces and deny non-members entry to that private space. They can also refuse to non-member from participating in their activities in public spaces, but can't deny access to the actual space.\n\nPublicly owned venues that are available for \"rental\" or reservation can also fall under \"private space\" for the duration of their reservation by a group or individual based on the universal terms of use. E.g. \"event\" rooms/areas, study rooms in a library, theaters, etc.", "*Many* doesn't have to mean *most.* You can use many as a qualifier for something, even if it's not the majority. For example, I could say \"There are many Marvel movies,\" and I don't think most people would disagree. But if you try to do the math, for ever 1 Marvel movie I name, you could named hundreds of non-Marvel movies.", "I understand that. You're just defending men who \"can't be themselves around women.\" Why do you think that is...?", "You said guys want a place to hang out with guys because *they can't be themselves when women are around*.\n\nWhat's wrong is that makes it sound as if the guys can't be themselves because they're sexist jerks and having women around will highlight that fact.", "I mean, first off, I was replying to this whole sidebar that you're having where you're trying to equate safe space for women to judgment-free zone for men.\n\nBut if you want to deflect to an entirely different point, sure. There's nothing inherently evil about guys wanting a place to hang out with other guys, nor do I think anyone said so (certainly not me). \n\nBut it's absolutely an asshole move for the guy in OP's story to unilaterally decide to try and make the bar he likes, which is open to the public, *into* that place by enforcing exclusion on OP or anyone else. It's an asshole move to OP and any other women who might be interested in going, and it's also an asshole move to the owners of the bar who might not like one of their regulars trying to chase off business.\n\nAbsent involvement of the bar's owner(s), it's no different than a little boy and his friends trying to section off part of the playground and saying \"no girls allowed\" and harassing any girls who want to play in that area. It's immature and shitty.", "i’m not “going off” on you like…at all. you made a direct comparison, i pointed out that its a bad comparison, and i explained why. i thought we were having a conversation. \n\nbut please, disregard everything i’m saying and act like i’m being unreasonable because i’m a woman.", "Yeah I can believe it’s probably a thing for trash", "So you're weak and have no self-control and you think all men are the same way?", "It really doesn't matter whether a place is members only or not. Aside from a few archaic places (perhaps where you reside) people can choose which demographic they wish to serve without it being automatically discriminatory by law.", "'*You think California, Maryland, Pennsylvania, and Wisconsin are all ass-backwards archaic states?*'\n\nYes, I do.", "Wrong. Happens all the time here and is perfectly legal. But, you know, Murica is the world...", "\"*Many doesn't have to mean most.\"*\n\nThat's why I said '**...given a bit of context...'**", "Because I'm not defending him? I'm defending the idea that's its not inappropriate or wrong for men to have a night.\n\nBut if we want to dive into the \"men who can't be themselves around women\" comment you made... What's your take on men's mental health? Or is that a myth?", "Yes, becasue when women aren't around, all men immediately become sexist jerks and talk as if women are objects....\n\nHas nothing to do with men's mental health or anything positive.", "Never said he wasn't an asshole. I actually added to it by saying he was childish, immature, and lacked communication skills.\n\nBut this whole branch of comments came from one woman saying ladies nights were essentially to herd women to men.", "You picked off comment that expanded what a ladies night 'could' be, instead of the one box of \"ladies night is for actually for men\" the comment above that put it into. \n\nIt was also from a comment on my comment from the comment on the original post that called both the little man at the bar, and OPs boyfriend sexist. All becasue the little man at the bar lacks social skills, and the boyfriend can see where the little man is coming from.", "First time I thought I was defending her honor. The second time, however, I saw how she instigated the whole thing: My bf will do this and that. Calling them names and shit. I left her ass in that bar and never talked to her again. \n\nAll I'm saying is if OPs bf has been through shit like that in the past he's probably hesitant as I am to get in the middle of an argument like this.", "Why am I trash? Because I won't be dragged into a fight I didn't start?", "I'm weak because and have no self.control because?", "NTA what a weird thing to gatekeep. He needs to keep his sexism to himself tbh.", "As a man, it makes deeply sad how many other men make us look like a bunch of insecure jabronis.  \n\nOf course you’re NTA.   Most men believe it or not think that bars are actually improved by the presence of women.", "NTA. \n\nIf he said that it was \"whites only\" trivia night and you and your friend had to leave because your friend is black, would you still be wringing your hands, saying \"I feel BAD because I didn't enable this guy's bigotry mooooore. Am I a bad person? Maybe I should have been more strict with my Black friend and ORDERED them to leave since it was whites only, right? So I wouldn't offend the bigot? I feel SO UPSET that I might have hurt the bigot's feeeeeeelings!\" \n\nHonest to God I feel like we have normalized sexism and bigotry SO MUCH that women have to post here like \"Was I mean for not allowing the sexists to be more sexist? How much do I need to apologize to my misogynist of a boyfriend so that he'll allow me to keep caring for his needs while neglecting my personhood?\"\n\nWe women need seminars or something.", "NTA. Wtf lol, was he in The Little Rascals? 😂", "NTA. That is blatant sexism.  As you said, if he wants a mens only night, he should host somewhere private.", "NTA Public bar and the guy isn't an employee or contracted with the bar.", "NTA - It's not like the bar closes for a private event.  Men are so emo hahaha", "NTA. When I first read the title I assumed that the guy was your boyfriend/husband, in which case I would have said \"yeah you should just pick a different bar and let him have his night out.\" But it's some random dude you don't even personally know? Guy sounds like a loser.", "Info: did he lose to you?  I mean, NTA regardless, I just wanna know because I have this feeling that if he’d destroyed you at trivia, he wouldn’t be so mad you were there.", "NTA and this is not on you.\n\nPlenty of bars do ladies nights or stag nights and that's entirely fine as it's up to the bar's discretion. If he's friends with the bar owner, why didn't they just do that? Because the bar owner didn't agree with him, so it's just a him problem.", "It sounds like he should start his own private club.  You can't make it all male & expect to get away with that.  If he wants a boys night then don't do trivia in a public bar.\n\nHi, you're female you can't play because I'm the superior sex here & you are nothing.", "NTA\n\nThis wasn't a closed event, you responded in a very reasonable manner. I'd also check with the bar owner or manager, since they probably don't know this patron is turning other clients away.\n\nAlso the phrase \"judgement\" of women gives terrible incel/ sigma/ Andrew Tate abuser of women vibes 'ಠ⁠_⁠ಠ", "From a dude, sooooo NTA, and the things I want to say about that guy would get my comment removed faster than you can say “Be Civil.”", "NTA. \n\nAlthough personally I just wouldn’t go back. And I would tell the owner why I wouldn’t be back. Making sure to apologize for making any of his customers uncomfortable in their safe space. I would also assure him that I would share the Friday rule with my other girl friends and co workers and such. That way this won’t happen again and his handful of Friday regs won’t be put in an awkward position. \n\nBut I’m an incredibly petty person…", "Nobody mentioning the unsupportive boyfriend.", "NTA\n\nAnd your boyfriend calling you mean for \"hurting a man's feelings because he couldn't dictate that women aren't allowed in this place of business which he doesn't own\" is weird and a bit sus.", "Feel like there is something missing here…\n\nAlso, why does a bar allow a trivia night on a Friday? Trivia is a midweek thing that brings people in on an otherwise slow night.", "NTA. What in the absolute bonkers sexist fuck?", "NTA. \n\nHow fragile.", "Right, because women should always let men exclude them from public spaces so the men will be spared from the judgment of women, which is so very unlike the judgment of men who think women are \"mean\" if they stay.  \n\nHow does participating in a trivia night in a public bar when one of the men doesn't want you there due to your gender make you cold-hearted?  \n\nStay.  Win.  Judge the crap out of the man who pouted and stomped off 'cause girls are so so so judgy.  Feel free to judge him, by the way.  (Also, your BF, who thinks it's mean not to cave to misogyny.)\n\nNTA!", "I'm sorry but I'm dying at the safe space from women. NTA and that guy can go cry his tears to anyone that will listen (I hope it's no one). Keep going and destroy him.", "Nta. \n\nThe dudes you’re around seem to be really fragile and emotional. Bf included though. Id lose a bit of respect for my spouse if he started siding with incel crowd.", "Nta. Lmao what a fragile little man. I can’t imagine throwing a tantrum over a woman playing a game in a public place. If he wants a purely boys night out, he can hold trivia night at his own house.\n\nUnless the owner is telling you that you can’t play for whatever reason, this weirdo stranger has zero place in dictating what you can and can’t do. Let him cry about it.", "NTA - tell all your female friends and acquaintances how great this bar is that has a wonderful quiz night. Storm that place with teams of women. I’m sure the owner will be thrilled with the extra custom.", "NTA. That dude is an AH but so is your bf honestly. Why do they just assume women are judging them during a trivia night? They are trying to kick you out for literally just being a woman. So stupid. I agree with another commenter here saying he is probably insecure and doesn’t want to see a woman be better than him", "NTA. I bet the bar owner would not be happy that his regular was trying to drive away paying customers.", "NTA\n\nIt's a public space. He's being a fucking weirdo. Are you literally the only woman in that bar on Friday nights?", "NTA. It's a trivia night at a public bar, not a \"men-only\" club (do those still exist?). He's afraid of \"the judgement of women?\" He must have had some serious trauma in his life, but that's not your problem at all. He needs help.", "NTA- He's not the owner, the owner didn't say you couldn't participate, and you're not responsible for his comfort in any way.\n\nIf he wants a \"guys only\" event, he can either rent out the bar for an evening or host at his own place.", "If he wants a 'private' trivia night, he can rent a function room in back of the bar.", "Not the Ahole. You can’t be asked to leave just because you are a girl.", "NTA. Unless it's specifically a space for a certain group, you're perfectly welcome at trivia. And I highly doubt that \"bars that men enjoy\" are a safe space for anyone, lol.\n\nLet him be sexist at another bar.", "NTA. Tell your boyfriend to look at it from your point of view.", "NTA - Also, how have you not talked to the owner about how incredibly illegal it is for them to let that guy represent the bar like that.\n\nAnd putting that aside, how have you not invited every woman you know to trivia night?", "NTA\n\nyou can continue going to the bar and not join trivia if there all men and his the one setting it up, he can start going to a guy bar if he only wants to be around men.", "NTA. He’s being ridiculous. The He-Man Woman-Haters Club meets in the clubhouse, not a bar.", "He wants no women in the bar at a public event on a Friday night? \n\nSomething tells me no one told the bar owner. This sounds like a sure way to lose money.  \n\nNTA", "NTA", "He needs to move it to his home if he feels only men should be allowed to play! Please please recruit the smartest women you know, form a team and go play", "NTA and it sounds like you took half of the trash out. The other half is still dating you.", "NTA\n\nIf the bar is closed due to a private event, then there would be signs posted. Management never asked you to leave. So the dude can go kick rocks.", "NTA.  This is extremely weird.  The boys want to gather to play/watch games?  That's what man caves are for.  Not a public establishment where I am a patron.  Since I'm an AH, I would be inclined to get a girl team together.", "NTA, show up more often, and drop bf.", "NTA\n\nIf he can't handle women in public places maybe he should have his safe space at home.\n\nI#m also worried about your boyfriend, he sounds sexist too.", "A bar can’t discriminate  like that anyway.  Even ladies nights have to allow men in the space. The guy can rent out the space for a private party, but he can’t tell you to stay out of a bar because of an immutable characteristic or gender identity. NTA.", "Nah, if he wants to make his own space it doesn’t need to be in public space. NTA.", "Based on info provided I guess NTA, but I really think we're missing parts of this story. TBF though, Friday night, one of the busiest nights in the resto industry shouldn't be a restrictive evening on business. If there's an all male, or all female trivia nights thats fine, just do it on a Monday or Tuesday", "NTA. Dude is fragile as fuck 😂", "NTA.  What did I just read?  Talk to the bar manager for some clarity.    If the bar manager has no idea, he might want to know that guy is running off patrons\n\nDoes that guy go on FB and mark himself safe from women every Friday night?\n\nMost people that play trivia welcome competition .", "NTA. Fuck him and his toxic insecurity.", "NTA. It’s giving incel.", "Not only are you NTA, I would find a whole BUNCH of female friends and bring them to trivia night and be loud and rowdy. Screw this misogynist (who is an asshole) and all the other people who think like him. No bar owner is going to kick out a bunch of women who are spending money. If the bar owner isn't stupid, he/she will know it actually brings more people in.", "NTA. Let the bar owner tell you you’re not welcome, if you’re truly not welcome. Fuck that guy.", "NTA. Public trivia is open to all. \n\nBut, it seems like your attitude is the same one that gets men labeled YTA for not caring to respect women's events (classes at gyms that are all women until one guy decides to join... he's kindly asked to respect the space of women. He claims \"it's a public gym with open membership\"... while true, he could join another mixed class but chooses not to.)\n\nAs a society, we need to teach men like the one at trivia that they need to be more accepting. OP is allowed to join trivia. But we also need to be aware of what we're encroaching on.", "NTA- if he would like a guy only trivia night then he should set that up with the owner. Are you telling me there wasn’t a single woman in that car?", "If I were the bar owner I would not appreciate this Neanderthal trying to push away business. On a damn Friday. \n\nNTA and I hope you beat him regularly.", "NTA\n\nIf you want a PRIVATE game room, literally choose a place that isn’t a public bar. What an AH and your bf sucks too.", "NTA he doesn't get to make that decision lol", "Nta", "NTA, and seriously what year is this?? \"yOU'rE nOt wELComE\"", "NTA and what an unfortunate way to learn your bf is also sexist", "Switch the genders in this scenario and everyone would say you're the asshole. Therefore, YTA.", "NTA but I would be for getting a whole table of women together JUST to go \"ruin\" his Trivia night", "Is it a gay bar? Otherwise I would say NTA.", "In a month, someone is going to write the same post, only with the genders switched, to see what the results are.", "INFO:  Is the trivia night bar-sponsored or is it a trivia night that just happens to be held in a bar and the bar owner doesn't care as long as they are buying drinks or food?  Does the bar actually advertise it?\n\nI mean, the guy is repugnant any which way you cut it.  That isn't in question.\n\nBut I do think there's some nuance in \"Hey, owner, do you mind if my buddies and I come here on Friday nights to do our trivia night?\" and the owner saying ok as long as they buy food and drink and aren't bothering other customers and them saying \"Hey, owner, I think you should have a men's only trivia night at the bar\" and the bar sponsor's that activity for anyone who shows up at the bar that night.  Sort of the difference between a bowling alley hosting a private league and open bowling.  Or I know a few language clubs used to meet at my local Barnes and Noble and there's a puzzle club that meets at a local coffee shop - the coffee shop doesn't sponsor or advertise the puzzle meetings, but is fine with them meeting at their shop every Saturday morning.  If it's more like these kinds of clubs, then I could see how for them this would be like if you just walked into a restaurant and decided you wanted to join someone's table and eat dinner with them.  They're still exclusionary jerks, but I would cut them just the tiniest bit more slack in the club scenario than the bar-sponsored scenario.", "NTA. You're not doing anything wrong in a legal or technical sense.\n\nIf it's actually something where guys vent and use the time to share their thoughts without judgment, then you're being a bit rude since they can no longer do that.", "So what's the problem? Is this a team sport or can anyone play? Was there a sign up that said 'Men Only Trivia Night'? \n\n *one of the regulars at trivia told me that trivia was something he had set up with the bar owner and I wasn't welcome.* \n\nYou should have asked for the bar owner so that he could confirm the story.\n\n*He explained that trivia night was a guys thing and a safe space for them from the judgement of women.*\n\nHow would women judge them at trivia night? You either know the answer or you don't. Was his masculinity so fragile that he can't take knowing that a woman might be better at trivia then him?\n\nYou need to ask the bar owner for the truth and if it is remind them that in a public bar, they can not discriminate when it comes to trivia night. Maybe  they should have it in a closed off part of the the bar so that the 'baby' men won't be hurt when they lose to a woman.", "What a circle jerk this whole thread is", "I am a man.  I believe that we, as a society, would benefit if there were more spaces where men are allowed to be men with other men.  Over the past 30 years or so we have taken any space that was a \"man only\" space and gotten rid of it.  These spaces are important to men's mental health.\n\nHowever, having said that, this guy is wrong and you are NTA.  He's having trivia in a public space, he does not get to enforce a \"only one gender\" rule in that public space. In addition, I'm pretty sure that such a rule would be illegal since gender is a protected class and a bar is a space \"open to the public\". \n\nIf he wants to have a men's only trivia he needs to have it in a non-public space.  A church hall or something of that nature would be perfectly suitable.", "YTA- your only going there because he asked you not to. If the gender was switched and a random guy was encroaching on a ladies only safe space event, you be attacking him for it.", "YTA.", "NTA\n\nSounds like an incel.", "(coming from a woman cause from all these comments feel like I gotta say that, it's stupid) yes, YTA. Just let them having their guys night for fucks sake. I'm sure you get your girls nights all the fuckin time so why can't they do it? WHY ARE MEN SEXIST FOR DOING WHAT WOMEN DO?", "Funny how girl’s nights are openly accepted but when a guy tries the same thing, this sub gets so outraged.", "YTA doesn't matter if its a public bar, with that logic, I could sit at a family's meal and say the same thing.", "YTA.  You're legally fine but that doesn't make forcing your way into a space not meant for you less of an AH move.", "Yes, YTA. If the roles were reversed all hell would break loose here on reddit. You're not coldhearted, you're just not a person I wanna be around.", "YTA, if they advertised it as a Men’s night trivia there would be riots. \nWomen have their own spaces, devoid of men and no one bats an eye. \nGuys have their own spaces, and they get attacked, protested and abused in the name of “diversity”", "Probably be inviting them over to his mother's basement.", "tell him to start a club in his garage. He can call it \"No Ma'am\"", "Several bars in my area have men/women only events. They advertise that, though.", "Also, it was just \"one man\", not \"men\". It is not \"we vs them\". It is just a single insecure sexist person having problem living in the real world.", "And he tried to \"No Girls Allowed\" a BAR every Friday night! Where do I purchase the audacity please", "It would genuinely make me rethink my relationship if my partner took this guy’s side.", "I'm right there with you. Having men-only spaces can be very good for them, just like having women-only spaces is very good for women.\n\nHowever, a public bar *should not* be a male/female/other (no disrespect intended) only space.", "I'm curious about the other patrons, too. You'd think they'd like having a woman in their midst. Plus, healthy competition is good for everyone.\n\nNTA, OP.", "I dunno, maybe the owner agrees? OP should call and talk to the owner, explain that this guy has been telling women they aren’t welcome at the bar on Fridays, and ask if that is in fact the case. I suspect he will want to talk to his gender-obsessed customer and clarify some things. \n\n(Of course if the owner confirms that this is indeed the policy, she should probably apologize and, to make up for her rude faux pas, she should help spread the word that this is a men-only bar; post on FB, Yelp, etc.  Make sure every female in town understands that giving the bar their woman-money would be hurtful and wrong)", "This is the most important question!", "It must have been brutal", "Basically he's upset that some random woman intruded on the activity he set up with his buddies with permission from the bar owner.  What's stopping her from going to the bar owner and organizing her own trivia time?", "Some bars have \"ladies night\" to attract women... because that also attracts men.  (Otherwise every night is \"dudes night\").  Point being, even a \"ladies night\" still lets men in the door.  This guy wants to gate keep someone else's business.  He's the AH in this scenario..", "Use the power of social media and get a bunch of random women to go.", "That was my immediate thought.  Time to make this trivia night the place to be for women on Friday nights.", ">he can hold his woman-hating group in his parents’ basement where I’ve no doubt he lives. What a creep\n\nWhile I agree that dude has no right to hijack a public event like that I'm curious if you think all women only groups/activities are full of \"man hating creeps\"?", ">It sounds like he's interested in how men feel more than basic rights of women to exist in a public place\n\n...even worse, how some random dude feels more than his own girlfriend.", "Agreed!", "Not sexist at all, women have \"women-only\" events and organizations but a group of guys want a guys only trivia night and they are ... sexist? That's a bit of a reach. \n\nNo it shouldn't be a public bar. They should find a more private venue. No it isn't sexist.", "I have to disagree about the boyfriend being sexist. He just saying she doesn't know that guy story. But the bar guy is AH", "I'm curious, do you think men should be allowed any safe spaces?\n\n\n(I 100% agree that dude had no right to try and claim a public event like that)", "I'm sure the owner would be furious if he found out this guy was secretly going up to bar patrons and telling them they're not allowed there because of their race or gender.", "Especially *that* guy.\n\nHa, I highly doubt he's that buddy-buddy with the owner to be the driving force behind the success of this trivia night.  No business person worth their salt would turn away *any* paying customer from an event at their place, nor would they let a mere **customer** dictate who can attend.\n\nIf I were OP, I would either find a way to contact the business directly like through social media, pose the question about trivia night, then wait for a response.  As soon as I received one, I would not name names, although I would say that I was directly addressed by a regular - who I have seen at trivia night previously - that I was not welcome.  Hey, what's the harm in asking for clarification?\n\nIf there is any kind of chumminess between the owner and this spoil sport, it is sure to be destroyed in one fell swoop. :D", "Lemme just do some reps in the women’s only gym", "Arm pit, Funyuns and over-ripe kumquats.", "Except they will sneakily add extra objectional details to make the situation seem more egregious. Therefore guaranteeing more YTA votes. Checkmate, misandrists!", "It's funny how many people despise the idea of male spaces. I want to see the reaction to the gender-switched one.", "Your analogy doesn't work. This isn't an all-men event. It's a bar open to anyone.", "Jfc man, can you read? She clearly stated she had already attended trivia night for 2 weeks before being confronted, therefore she is not “only going because he asked you not to.” And what’s up with the gender switch? You men who act so fragile about gender always try to change the subject and switch the roles to justify your sexiest beliefs.. super sad and pathetic.", "It's a public bar, though.  It's not a men's only safe space...", "Bruh what, it is not stated that it's a men's only trivia night. Your point here does not really makes sense.", "Woman enters a bar. Man tells woman to leave the bar. Woman does not leave the bar. How the fuck is that “mental health”? That is sexism moron. Get educated.", "There are plenty of ways to find an all-male safe space away from women if that's what you're looking for. Invite friends over, join a men's group at a church, join a softball team, google a support group.\n\nThis is a public business that he does not run and it is not even advertised as an all-male event. I don't even get why he would want an all-male space for this type of event. At trivia events, you're basically only interacting with your own table. If that's all-male, what's the issue? You can't handle a women saying an answer from across the room? I don't get it", "LMAOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO. Nice try buddy.", "He sucks because he can’t handle a woman being in the room, but how dare she protest leaving a public bar? You intelligence is really shining with that comment.", "I hear you, men can and do face trauma at the hands of women, sure, but if that is the case why is he claiming rights to who can and can't enter trivia night at a public bar? Did he personally rent the whole space every Friday night? What would the owner of the bar think about patrons telling other patrons they're not allowed at the bar on Friday nights? If the man wanted a woman free zone why not go into his parents' basement with his pals and have a few beer there instead? If I were the patron being told where I can and can't spend my money at, I would first ask the owner of the bar if this were true, am I allowed at the event? And if they told me I was allowed then I would simply ignore the individual gatekeeping trivia night and keep playing to my heart's content. NTA.", "It's a public bar, open to the public, holding a trivia game for it's patrons.  OP is one of the patrons.", "Having a bunch of gay guys crash this trivia night would be an excellent bit of “malicious compliance.” We’ll see if it’s really about the “judgments of women”.", "Yeah, that threw me. Most trivia nights I know of are mid-week/slow night things to try to get a least a few more people into the bar and drinking something.", "Agree, I don’t think her bf is getting nearly enough flack for his reaction. He is also part of the problem.", "I wonder if the bar owner knows this customer is actively telling other paying customers to leave?  I can’t see a bar owner being ok with losing money like this.", "Exactly what every bar owner hopes for....a sausage party!", "I can’t get over the idea that his safe space where he goes to avoid being judged by the opposite sex…is a bar.", "I'm a man, and i think that guy's an asshole. OP's boyfriend is being weird.", "God forbid he lose to a woman", "Alternatively he probably makes some really awful 'jokes' regularly and now he can't.", "For a private business? How single gender only schools operate then?", "Would it? Are women only gym days in violation of the civil rights acts??", "> get a bunch of random women *who are really good at trivia* to go.\n\nGotta pour some salt and squeeze a lemon on that guy's wound.", "I can't even imagine what it would cost to rent an entire bar on a Friday.", "No, all groups of women/men hanging out together aren’t necessarily sexist creeps.\n\nBut the type of women (just like the type of men) who would go into a bar or other public space and tell any men(/women) there they should leave or couldn’t join an open public event? Yeah, that’s probably at least a bit of sexist creep going on there.", "Are you determined to “gender swap” this entire comment section? It doesn’t feel like genuine curiosity. It feels like you’re trying to catch every comment in an anti-male wording and rage bait a bunch of dudes.\n\nIf that’s not what you’re doing, you need to work on your approach. If it is, then disregard the rest of this cuz I’m not gonna engage in foolishness.\n\nBut to answer your snarky question, no. People don’t think that safe spaces created for women are just to bash on men. They are to actually encourage safety because we live in a world where women are afraid to jog at night because of all the murders and r*pes and assaults that happen to women who dare to venture outside when the sun is down. Safe spaces for queer people are spaces where they can be themselves without being exposed to homophobia. Safe spaces are meant to protect those who need protection.\n\nThis guy said he wanted to be free from the judgment of women… during a trivia night. Now OP is the only one in this thread who we know has attended this trivia night. They can tell us if the questions are specific towards men? Only things a man would be able to answer? That doesn’t sound like trivia. What protection is this guy actually seeking with this trivia night? The space to be misogynist? The reason ppl are coming to that conclusion is because historically, men are the oppressive group. Don’t not all men me, there’s no time and that’s stupid.\n\nSo if you need a “safe space” then it’s typically to do something you are unable to do in mixed company. Safe spaces for women and queer ppl are centered on actual safety. Freedom from the oppressive class. If your safe space is actually only excluding those socially “beneath” you, then that exclusion is inherently oppressive and one can only figure that space is being utilized to give men the freedom to be misogynist, because why else would they feel wholly unsafe around women?\n\nApologies for my hostility in the beginning, unless of course you are trolling, then I meant that shit.", "Here's the difference for me. I completely understand having men's nights events and why women wouldn't be welcome there. But this isn't \"Men's Night: Trivia Time.\" It's just a trivia night. There is no pre-existing social norm that women aren't invited to this type of event, and no way for her to know the group wouldn't want her there.\n\nInstead, they complete a trivia night, she had lots of fun, everyone seemed fine. She shows up a second week, trivia night is great. But this time, trivia night guy walks up to her and says that **she** isn't welcome, her and only her. She presses back that he doesn't own the bar so he has no right to give her orders, and *now* he levels it up to \"well it's a guy night.\" So she didn't accept being shoved out personally, now he's making it a sex thing. Hmm.\n\nAnd then he adds in that it's a \"safe space\" to be free from the judgment of women? My dude, it's a bar having a trivia night, women are expected to be there. It isn't a sensitive issue that men need a reasonable expectation of privacy from. It isn't even advertised as a \"men's night\" social event. It sounds more like this guy has had his ego bruised by OP because she's a woman and that's a problem for him. *That* is sexist.\n\nThere is nothing wrong with having a men only social event in a bar. There *is* something wrong with making up rules on the spot to exclude one specific person.", "There’s a difference between a members only, private club vs a public space. There are plenty of private men only clubs in the same way there women only gyms", "It is sexist bc she’s being excluded from a public place on the basis of her gender. If it was a private event then it would be a different story so yes this is sexist.", "That’s nonsense. Men have dominated society for literally thousands of years, and white men for hundreds. Most spaces were men only spaces - any well paying job, government, etc. Men do not need a “safe space” the same way women and POCs do. They’re the ones everyone else needs to be safe from. Anyone who ignores thousands of years of discrimination and literally treating everyone else as property instead of humans is a sexist ahole. Including this dude. And you. NTA., OP", "His story is \"girls have cooties so I don't want to let them participate in a public event with me\"", "The guy’s story about being sexist?", "When you defend a sexist, you're instantly an asshole", "Ladies nights are historically meant to bring more women into an establishment FOR MEN.", ">Ladies night events are a thing, and men are excluded from the same perks the women would get.\n\nOh my god. You're one of those people that thinks women getting reduced drink prices/cover charges is ***FOR*** the women. It's not. It's to bring the women in ***FOR*** men. I bet you have no problem understanding that a free service like Facebook has YOU as the product. So why can't you understand that when reduced or free things are given to women at bars that they are the product?", "Doesn't seem like it was labeled as men only, or a safe space, or anything, by anyone but this singular dude.", "> ESH\n\nI agree that bar guy and bf are AHs, why OP?", "Ladies night just means gals get together and have fun w/out men. They can do that anywhere in public spaces where men are still allowed to be, they just choose not to interact with the men. They don't get to exclude men from trivia at a public bar.", "You can't make a safe space out of a public place. Bars, restaurants, parks, etc-these are all places that are open to the public regardless of age, race, gender, sexuality, and the like. The only way to make a public place a safe space for your group is to reserve the area for that day, if the location allows it. But using public places as a safe space defeats the purpose of safe spaces bc you have no control over who enters.", "Not at a *public bar*\n\nEdit to add:  unless they paid to rent it out for a private event or something", "A bar is not defined as a safe space for anyone?  \n\nTry reworking that question? Men already have plenty of male only spaces. and usually it's *men* who make spaces \"unsafe\" by fighting or general ego malarkey.", "If it's labeled as one, then sure, why not.\n\nBut it doesn't sound like this trivia night was labeled as men only, possibly because this dude is the only one who actually cares.", "The entire world is a safe space for men.", "Do you then men’s only spaces don’t exist?", "Safe from what, exactly?", "Genders reversed but it will be a private event, advertised as single-gender, and the OP won’t have been asked to leave but rather to stop yelling out slurs, and _we’ll all be exposed as hypocrites_.", "Disagree that it is unambiguous:\n\n“They have trivia night Friday night. I started going a few weeks ago, and after my second week there one of the regulars at trivia told me that trivia was something he had set up with the bar owner and I wasn't welcome. ”\n\nSo there is some sort of trivia event going on. It doesn’t have to be whispering in the corner to be OK to be a specific group of people. This guy may have been trying to set up a guy’s trivia club and he approached the bar owner to see if it was OK to use some space in the bar for that. People ask for private events that don’t take up the whole bar or restaurant all the time. \n\nThe whole situation seems inadequately described. No one was kicking women out of the bar. Maybe this person just has blinders on and didn’t notice this is a specific group of people’s thing not a “bar event”? Some people are like that and butt in without understanding the boundary. Or they feel entitled since it’s a “public” bar (which keeps getting repeated, but no it’s a private business) and they want to “prove a point”.", "Lots of all women things are held at public places.", "True. But if it was the other way around or a lgbtq event. how would you feel. Would you be nitpicking the legalities of a bar or offended that a group of people were denied a safe space due to one person wanting to prove a point.", "Went down all the way just to read them lol", "\"Friday\" makes me think this is fake. I go to a lot of bars. A LOT. I have never once in my entire life seen trivia night on a friday night. Friday night is the busiest night of the week for every bar.\n\nBars do trivia on weeknights to increase customers on days when business is usually slow. No bar likes doing trivia night. Most people working at the bar hate it. They do it to bring in business. I do not believe OP.", "Went to the local dive on a whim and won trivia with my wife. I didn't realize it's also the townie conservative bar, I still imagine their malding over losing to a *woman* and a *lib*. I think I was wearing a college t-shirt too, the horror!", "The sheer audacity to have both boobs AND a brain? They must be stopped! /s\n\nNTA, OP. That guy is weird.", "Honestly, the insecurity was palpable. We’re hearing this second hand but it’s hard to deny if it’s even close to accurate.", "Men have it so rough /s", "Pfffft Well it's not like it's BRAIN SURGERY. \n\nhttps://www.youtube.com/watch?v=THNPmhBl-8I", "Yep...unless the trivia players leave to hold it elsewhere. She would have to drink a lot to equal the lost revenue.", "Nah dude. Or at least, not in the US. If you refused to hire someone for being a woman that's illegal, but it's absolutely legal to have spaces/events that are limited to a specific gender.", "Yes, yes, sweetie, we know. Not all men.", "do you want an award for the bare minimum", "places of public accommodation", "Yeah, a big point of the CRA was to put a stop to private businesses that excluded people on the basis of a protected category. For example, the whites-only diners that were the target of sit-ins throughout the civil rights movement. Places that are not open to the public (like private schools) are not necessarily governed, but I don’t want to get into the fine details.", "Women only gyms have gone the way of the dodo. Men have been suing.\n\n[https://apnews.com/article/sports-lifestyle-health-business-connecticut-supreme-court-fefcd0ae73da3ea2effc6d8596505274](https://apnews.com/article/sports-lifestyle-health-business-connecticut-supreme-court-fefcd0ae73da3ea2effc6d8596505274)\n\n[https://www.pressdemocrat.com/article/news/lawsuit-says-gyms-women-only-policy-illegally-discriminates-against-men/](https://www.pressdemocrat.com/article/news/lawsuit-says-gyms-women-only-policy-illegally-discriminates-against-men/)\n\n[https://www.clubindustry.com/commercial-clubs/california-agency-national-coalition-fight-women-only-areas-and-clubs](https://www.clubindustry.com/commercial-clubs/california-agency-national-coalition-fight-women-only-areas-and-clubs)\n\nWhile women get attacked by men in mixed space gyms:\n\n[https://www.indy100.com/viral/man-woman-gym-weight](https://www.indy100.com/viral/man-woman-gym-weight)\n\n[https://www.distractify.com/p/man-throws-weighted-ball](https://www.distractify.com/p/man-throws-weighted-ball)\n\n[https://www.wsbtv.com/news/local/cobb-county/man-arrested-after-attacking-woman-shower-cobb-gym-police-say/PKSPE6ZJMNHCDKD2CAWSVAHXOY/](https://www.wsbtv.com/news/local/cobb-county/man-arrested-after-attacking-woman-shower-cobb-gym-police-say/PKSPE6ZJMNHCDKD2CAWSVAHXOY/)\n\n[https://abc7news.com/fremont-gym-sexual-assault-attack-24-hour-fitness-police/5951188/](https://abc7news.com/fremont-gym-sexual-assault-attack-24-hour-fitness-police/5951188/)\n\nSo, yes, I would say the women's only gyms are being proven to be a civil right's violation EVEN THOUGH there is a public safety interest for women. The civil rights issues are trumping the safety issue.", "Gyms aren't public.  You have to be a member to go there.", "Yessss this is this answer", "I guarantee you it’s five figures", "You could rent a ROOM in a bar for a semi-reasonable price, depending how many people you were splitting it among. People do that sort of thing all the time for weddings and events. But it surely is more costly and difficult than just paying your own entrance fee to a public event, where the bar takes the risk for you if there aren't enough people to make it profitable.\n\nI wonder what the bar would think about knowing he turns away women who are paying customers. She's surely not the first, but the others decided it wasn't worth the fight.", "The idea of having a guys only night is not sexist. The action of excluding her is due to it being a guys only night, not because \"we hate wammen\". \n\nAgain, they need to change the venue. Not because they are sexist, but because you can't hold a public space without renting it and excluding outsiders.", "So if a gym has a set time for women only spaces, is that sexist towards the male gym goers?", "But it's not sexist when women do it to men? \n\nWe need to fix our bullshit. It shouldn't be awful for men to have men only events in public places when we women do it all the fucking time with no backlash. Grow up.", "You're an asshole for assuming a person hates a whole group of people off one comment that isn't sexist, people have guy things only and girls stuff only all the time(girls night out) the guy in the story is just overreacting and being an asshole about the whole thing but you are too now over some dumb comment, I don't think the guy in the story or the guy you replied to hate women", "Plus more and more places are disallowing ladies’ nights on the basis of gender discrimination…\n\nSomehow I have the feeling that a lot of the dudes on here who are arguing how this is totally not sexist would consider the banning of ladies’ nights a “win against feminists” or something lol", "Exactly! Defending a man he doesn't know over the women he does know is CLEAR evidence of sexism. It's literally preferring a stranger because they happen to be male. I don't understand all the dudes freaking out over the boyfriend being called sexist. It's really simple deductive reasoning.", "No if it was a mens only trivia night the bar would have advertised it as such. Period.\n\nYeah people ask for private events, and they usually PAY to reserve whatever part of the bar they want and advertise such event as whatever gender only. This wasn’t the case here, OR someone, the bar owner, a bartender, someone who actually works there, would have told her. They don’t play this guess work.", "Where are you at that that’s the case? I’ve never seen a women’s only event at a bar or anything like that. Maybe in a rented room at a bar or restaurant, but not just at the entire bar.", "Straight allies are more than welcome in our events. We just don't tolerate bigots, creepy straight men who comes here openly to sexually harass young lesbians and bisexual women and to assault gay and bi men as well as everyone within the trans and non-binary community. \n\nThis has nothing to do with a chauvinist pig claiming that women shouldn't be allowed to play games because it makes him feel warm inside to insist that men are smarter since women cannot play in public space and men therefore always win. These chauvinists have already ruined geek spaces for many of us nerdy women and they now want to ban us from public bars. Fuck that shit really.", "The LGBT+ groups that have existed around my sphere have always been rather welcome to non-lgbt people, so...  I have never seen a \"You're not like us, so get lost\" reaction from them.\n\nThe bar isn't hosting a private get together for those men.  They're holding a public event for their patrons.  The guy is just a customer with an opinion and shocking amounts of insecurity.  The bar is obviously fine with her participating.  It's the bar's event, not the insecure guy's event.  He just simply doesn't want women around (probably especially because it's trivia and he can't stand the idea of a woman using her brain to win against him).", "There are quite a few in my area that do trivia nights etc. on Fridays, I live in a college town though", "Where I live, Friday night is quite common for pub quizzes and meat draws. They're done relatively early, before the young'uns want to go to the pub for their pre-club drinks and so that they get in some parents who want an excuse to go to the pub but don't want to have to pay a babysitter for too long.", "Dishonor! Dishonor on you, dishonor on your family, dishonor on your cow!", "I'm female and did martial arts as a child. I was almost always the only girl and whenever I was better than one of the boys, the others would go \"Haha, you are worse than a girl\". It was so  infuriating because I would hear that every time I did something well. And when I did something badly then of course that's proof girls in general cannot do that.", "Disclaimer - I'm an aunt, not a mom.\n\nDid you yell \"leave his Neanderthal ass in the dust, sweetie!\"?", "My cousin and her fiancé are like that with her nephews. I fear for their infant daughter.", "I hate that parents pass this on to their sons. One of my daughters classmates told her that even though he can't read (she has pretty much read every dinosaur book in the library) he still knows more about dinosaurs than her. He was constantly telling all the girls that no matter how good they are at something he is better because he is a boy.", "There's gay bar, but even then, it's not like they discriminate against anyone. Usually, they're very inviting and fun (at least the ones I have been to).", "https://en.wikipedia.org/wiki/Ladies%27_night\n\nIn some parts of the US, yes. In others, no.", "No, the person he replied to made a broad statement about all men and it was entirely ridiculous. Please place your condescending nonsense somewhere uncomfortable.", "I don’t think people are necessarily disagreeing with the potential value of gender specific venues or events. I think it’s because you seem to think there is a double standard in that women are getting away with having “women only” spaces.\n\nYour stance is based on an incorrect understanding of “ladies night”. I’ve been a women for nearly 40 years, and I’ve never come across a “women-only” space other than certain gyms, which seems to be a benefit to both men and women. Ladies night/girls night takes place in public where there are plenty of men. “Girl’s night” is literally just female friends hanging out in a public place. \n\nOther than washrooms and changing rooms (and the aforementioned gyms), I can’t think of a single “women only” public space. I’d be interested to hear your experience with this. Can you give a few examples of a venue or event where men are excluded in some official way?\n\nFor what it’s worth, the downvotes are likely because “gender specific venues” hits a bit of a nerve. For hundreds of years, women were legally and socially prohibited from the majority of public spaces. Even public washrooms for women were extremely rare until the early 1900’s, which put a physical limitation of the amount of time women could be in public. While both genders could potentially benefit from gender-specific spaces, advocating to bring back “men only” can feel a bit like bringing back “whites only”.", "“Guys only night” only works when it isn’t a public space. As far as the story says it isn’t a bunch of guy friends getting together and doing trivia, it’s a guy running bar trivia! Those are completely different.", "This isn't the bar setting this up, it's just a random dude telling her to go away", "Those spaces were made because guys kept being cr33py to women \n\nIt’s a safety thing", "No bc a gym is a private facility. Now if the gym was owned by the city or something then yeah that would be messed up to exclude certain people.", "Sure. I also think it's sexist af that \"women only\" gym spaces tend to only have machines and dumbells up to 25. \n\nI think it would be better, rather than making it a gendered thing, to have designated newcomer spaces with machines and limited heavy weights to encourage people who might feel intimidated by more experienced people.", "Women don't have such a longstanding history of abusing, owning, degrading, and excluding men.", "Most gyms have a women only area", "No one is saying it's awful for men to have men only spaces in public. When women do it from what I have seen, they either rent out a space, the place itself is hosting it, or they do it in a separate area of the space.\n\nThe guy tried to tell op that they couldn't come into the bar at all during triva. No signs saying men only or anything just said it was men only. If a woman did this, she'd be laughed at.", "Where do women have women only events in public places? You need to grow up and realize women are half the population but get treated as if they are the minority.", "Sexism is not always conscious actions, it’s not a title reserved for supervillains. \n\nSometimes it is casual opinions and normal-looking actions, like leaping to the defense of a open sexist. You’re doing it *right now in this comment of yours.* You don’t know him, just like OP’s bf doesn’t know Trivia Guy, yet you’re leaping to his defense anyway. Why aren’t you leaping to OP’s defense? Do you think it’s possible in any way that you’re feeling defensive?\n\nSometimes, yes, giving people the benefit of the doubt is sexism.", "Why is her boyfriend jumping to the defense of a random man at a bar instead of defending her right to also be in a public place? Shouldn't he care about her more?", "You can do whatever mental gymnastics you want, but if a person is unwilling to participate in a public event because a woman is present, that person is a misogynist. No additional information is needed.", "\nMaybe he doesn’t “hate” women, but he certainly doesn’t view them as equal considering he’s willing to quit because a woman is at a public trivia night.", "You don’t have to “hate” an entire gender to participate in sexist acts and/or facilitate sexist ideology.", "Right! From my reading of the OP, the boyfriend is (knowingly or not) perpetuating that unspoken societal expectation that women bend over backwards to protect the feelings of men... whose feelings are hurt because she dared to exist. I'd be pretty suspicious of any partner that would take that stance.", "When you are from a little town the bar is one room so therefore they sometimes have events that not everyone can go to. Also small towns don’t have event venues or things like that. Just because you never heard of something doesn’t mean it doesn’t exist it means you don’t know about it.", "True. Shan Yu was an asshole for several reasons, but he wasn't misogynistic. He readily accepted that Mulan had destroyed his army with no hand-wringing about her being a woman.", "I knew there was something wrong with you. A woman! Treacherous snake!\n\nNTA OP. If it was a private event then hold it as one, not an open pub quiz.", "God, I bet that was so frustrating.  I hope you enjoyed kicking their butts, lol.", "Wrong dojo. The Master should have put an immediate stop to this.\n\nI remember when my girl was working towards her black belt (she was about 9 at this time).\n\nOne class ended up with my daughter and one other girl age 12. And 12 boys ages 8 to 16.\n\nThe Master announced a melee, girls against boys. But with a handicap to account for the number differential: boys could use left hand and left foot only (lefties right side only) and could only strike official TKD sparring targets. Girls had no limitations; and groin strikes were encouraged.\n\nThe girls kicked ass that night. And no one complained. Because they didn't want to do push-ups for backtalk.", "Man here. To be fair, if someone tried to cheer me on by saying im a failure if i lose to someone because they have ovaries, I'd probably stop running and just stare at them angrily, because that's bullshit. I hope that little boy doesn't listen to misogyny lady, but I feel bad for him. Doesn't help to insult him, insult the mom. ;)", "There are definitely bars that have ladies' nights or that allow unlimited women but only some men. That said, I think those practices suck and they may just never have been tested in court in whatever state OP is in. But it could turn into a case of \"this is why we can't have nice things\" if challenged in court.", "Thank you. This group has some real gender issues sometimes.", "Many men feel attacked by the idea that men are bad at taking about/dealing with their feelings. I think a huge missing piece here is that these aren’t meant to be accusations. The whole idea that men should be able to cry, be sensitive, talk about their feelings, seek help when needed, etc. is a key cornerstone of modern feminism. Toxic masculinity isn’t an accusation, it’s just a term that identifies a social construct that hurts everyone involved, particularly men. Sadly, it’s a social construct that’s typically enforced by men.\n\nWhen you hear people or media talking about toxic masculinity or “the patriarchy” or gender roles, try to see it as a validation instead of an accusation. While some ignorant people may be loudly misusing these concepts to bully/shame men, the actual point of discussing these things is to alleviate the very real suffering that men experience. You are correct that mens groups like the one you cited are a critical resource in this effort. (That said, those aren’t public events like the example in OP’s post. They are private events, similar to group support meetings.)\n\nSpeaking as a feminist, we know that the patriarchy actively hurts men and women equally. We’re also fighting for you to be able to express your emotions, be vulnerable, and talk about mental health without fear of ridicule. That’s why we keep saying feminism isn’t just for women. \n\nWomen are not a monolith, but most are not your enemy. A lot of us are allies. 💛", "Yeah that makes it dumber imo because this dude doesn’t own the bar or anything but thinks he has the right to dictate it’s visitors.", "I'm sure the bar was privately owned as well...\n\nAnd that private owner consented to this guy running his own trivia night.", "That's because men tend to sexually harass and/or assault women in settings like gyms.", "Lots of places actually. But the difference is that it's advertised and organized events, and I really can't see the problem with that. If this dude wants a night with lads only, he should try to make it an organized event.", "Exactly, why is he advocating for a guy who’s trying to exclude her? Unless the bar explicitly stated “men’s only trivia night”, both these sexists don’t have a leg to stand on.", "If you aren't paying for a product, you are the product, after all. Same for ladies' nights events- a price reduction has to provide benefit for a business somewhere.", "Especially on Fridays", "Some jurisdictions also don't allow for happy hours. Both of those are more related to preventing over consumption and public safety than sexism.", "On a friday night? Come on, in a little town sure, on a Tuesday or something. But on Fridays and Saturdays? the busiest days for all bars?", "Probably because the Huns had female warriors, so to Shan Yu Mulan being a woman and a warrior was probably not that big a deal lol", "Shan Yu didn’t have a mantrum when he realized Mulan was a woman, he said “the soldier.”", "Yeah, let this dude have his little *tantrum. I can see why he feels the need to have a space \"without female judgement\" when just having a lady around causes him to behave this badly. \n\nI am definitely picturing him storming out of the bar like a dramatic Southern Belle. \n\nIt's even funnier because his friends only cared when they lost. \n\nYou're NTA but he definitely is for even asking you not to participate because of your gender and then for his over the top public performance. It's not like this is a group therapy session for men. It's trivia. It's literally just... Trivia night.\n\nEdited... To not get banned, I guess?", "Fair points. Humor/sarcasm is my go-to, sometimes it doesn't translate through text. \n\nI wouldn't *actually* yell that across a playground of children, I know better. But I *might* say it loud enough for the mom to realize how she's raising her child.\n\nI'm glad you were raised better. :)", "This reminds me of when I was in an abusive relationship and the guy I was with for way too long got mad at me when I hit him back. Which I always did. Anyway once I hit him back and he said, “It wouldn’t be so bad if you hit like a girl, but you hit like a man!” And I was like, “Thank you!”  Mind you, he was much bigger than me. Yeah thank God I’m out of that.", "I would prefer to go romcom trivia night and I'm a guy. Sounds like fun!", "I've never heard of a ladies night restricting men from coming. All the ones I've ever seen just make it free for women. For the bar, they know that having lots of women there will draw lots of men, too, and that's good for business!", "In many states in the US it isn't legal.", "The problem here is it wasn’t the bar telling her no it was just a random dude. So the bar isn’t excluding her at all it’s the weirdo who wants his all dude trivia night.", "Seems like op need to tell the manager or something what’s going on so the owner can deal with it", "Not on a weekly basis like this but yes sometimes on a Friday or Saturday night. Have you seriously never been to a rural area?  That’s what it’s like growing up in the middle of no where lol.", "And that is why he’s one of my favorite villains tbh.", "I have read that! I just love that extra little layer to one of my favorite Disney movies.", "Bingo! \n\nShan Yu *[holding Li Shang by neck and pointing sword at him]*: You took away my victory\n\nMulan *[throws shoe at his head, drawing his attention]*: No, I did. *[pulls hair up into bun]*\n\nShan Yu: The soldier from the mountains! \n\nAt no point there or in the fight following does he actually say anything misogynistic towards her which I’ve always found interesting because he easily could have and it being Disney in the 90s they could have gotten away from it.", "Exactly! And he didn't hesitate even a second in trying to kill her, which is probably a weird thing to praise him for, but it means he took her completely seriously.", "I can understand why he worries about women judging him.  I've never met him and I'm judging him like gangbusters.", "Y T A, I can't believe you had the audacity to ruin someone's event by \\*checks notes\\* existing.  Oh.  NTA.", "Mantrum! My new word! Thanks", "I hear you, and yeah i admit i have my cave man moments of incredible stupidity, so you're not *wrong* per se.\n\nBut for the life of me, women are amazing. So many women i know have this ability to rationally think through an emotional storm of Katrina proportions. How can you love and cherish someone if you think you should be able to... i dunno, outrun them because they're... really smart and amazing? Please ladies, outrun me. Out lift me. You're all amazing and pretty, and I love you all like sisters.", "\"Like a girl\" ... I mean... there's so much wrong with that man's reasoning. I'm sorry he hit you. That is not acceptable, manly, or funny.", "I have seen clubs allow all women and only some men. Ladies' nights usually involve a discount for women. Those are both still discriminatory practices and are **sometimes, in some states** legal.", "I use to go to some in the 2000s and early 2010s.  They always started with a show they thought would bring in more women than men. Male strippers, a woman comedian, Spice girls cover band, etc.  It would last about an hour or two, and there would be discounted drinks during that time, similar to a happy hour. Men were welcome at all times, but not many came until after that hour was up. \n\n\nI only went to one club with a “women drink for less all night” policy and it was practically all men. We wound up leaving shortly because of how uncomfortable we felt.", "Take it up with the owner, then.  The owner consented to this guy running trivia night.", "I have lived in mostly rural areas until semi-recently. No, it is not normal anywhere for them to block out half their clientele for a friday or saturday night, even once a month. You’re reaching.", "Huh, now I want to rewatch Mulan!", "Use it in good health!", "I am very much using this lol. Thank you", "I like it too, it's also not allowed on this sub because it's a gendered insult. Do you want to get banned?", "Do you think this would fall under the “all rights reserved to refuse service” ? Like those signs that say a business can deny you. Just curious", "I’m sure the owner of the bar is super cool with this random dude turning away paying customers because they have vaginas.", "It was one of the first movies I remember seeing in the theatre as a kid so it’s pretty near and dear to my heart haha. \n\nBeing older and wiser now I don’t *love* that they forced a love interest into it (especially now knowing Disney is more than capable of producing films with exciting plots without a speck of it) since the original legend of Hua Mulan generally included her staying incognito as a woman for 12 years until after she was offered and declined the position in government offered by the Emperor and had returned home, when her comrades finally saw her as a woman. \n\nBut considering that it followed the garbage heap that is Pocahontas it’s much closer and shows progress towards cultural sensitivity (although there’s still many issues).", "Yeah... Too bad I had to change it. I thought it was a kinda inspired play on words when I thought of it 😔", "The bar owner isn't selling trivia night, so it's not really applicable.  If the bar owner told her she can't order a beer because she's a woman, then there's a problem.  If the bar owner was selling spots to trivia night and denied her based on her gender, then that's also probably an issue, but that's not what's happening here.  \n\nYa know how some bars have some shitty board games around?  Imagine if a stranger threw a fit because you didn't let them hop in on a game that you and your friends were playing.  Regardless of how bigoted their reasoning is, the owner is consenting to private game playing."]}