{"id": 9627, "submission_id": "10yoqwz", "title": "AITA for booking my wedding without checking with my sister?", "selftext": "So I (27M) am getting married this year and arrangements have just been made (last week or so), deposits paid for and registrar/venue booked. I did check with people before booking the date and although we're still very early into the arrangements, the date is set for a Friday in August this year. \n\nI've told some people the date and my fiancée has told her family, some people have made hotel bookings already. My sister is currently travelling and has been for the last 5 months or so. Good for her she's having a great time. \n\nThis morning I got a message from my mum saying that my sister is upset because she is supposed to be at a music festival (Wednesday - Sunday) where the Friday clashes with our wedding. The festival is around a 5 hour drive away and essentially a mini holiday for her. \n\nAfter I got the message from my mum I immediately called my sister. I apologised to her and told her that I'm sorry I didn't check with her first, I had just assumed that since she's been away for 5 months, she wouldn't have anything else booked. My sister seemed okay with it, she wasn't rude but a bit upset. We talked about how she's getting on with her travels as she's currently in the mountains in New Zealand. She's not going to miss the wedding all seemed good.\n\nI then called my mum and she was pissed, as my sister has been travelling, she's not had many opportunities to speak to my sister, most of it has been text. The first conversation my sister had with my mum in ages was essentially (according to my mum) my sister angry at my mum over the phone, blaming my mum for not knowing she was away them dates and generally just being angry and upset. This then upset my mum.\n\nAITA for not checking with my sister before booking the dates of our wedding?\n\nExtra info for anyone that can be bothered to read it:\n\nMy sister is going to the festival with 1 friend and she's worried about telling that friend about having to bail for some of it. She's worried the friend will then pull out of going. I have invited the friend to the wedding if it means that my sister still gets to go to some of the festival\n\nMy mum feels guilty (she shouldn't) and has offered to pay for flights to allow my sister (and friend) to get to and from the festival to attend the wedding. \n\nMy sister has been to this festival a couple of times in previous years already.\n\nINFO: my mum is annoyed at my sister and not me", "created_utc": 1676025551, "permalink": "/r/AmItheAsshole/comments/10yoqwz/aita_for_booking_my_wedding_without_checking_with/", "score": 82, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I arranged my wedding without checking the dates with my sister\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nI’m not sure anyone could plan a wedding around this travelers schedule.", "So... Just so I've got this straight...\n\nYou're engaged, and have picked a date for the wedding.\n\nLater on, you find out that the date you've chosen conflicts with a music festival your sister is going to.\n\nYou call your sister and she's a little upset, but generally okay with it and will make arrangements to come. \n\nShe was worried about letting a friend down, but that friend is also getting invited.\n\nBut now, your mother is upset that be resolving this issue, you've ruined a phone call between her and your sister by being the only subject of discussion?\n\nNTA.\n\nHonestly, from this it sounds like everything has been resolved as best it could. Your mother could have been a bit more chill, but it seems like there shouldn't be any major drama unless someone wants to make some.\n\nEnjoy the wedding!", "NTA.  If you have to accommodate people's schedules, where would that end?  You'd never find a date that's convenient for everyone anyway.  It's your wedding.  P8ck a date that suits you.  But a consequence of that is that if others have pre-committed to something else, maybe they can't come.  I mean, your sister isn't obligated to change her plans for you.   No use getting into a war over whether it's more important to you for her to be there etc.  I say stop discussing it, leave the decision with her now, and respect it either way.", "NTA a wedding takes precedence over a music festival and she can make her own choice about which to prioritize. You don't have to arrange YOUR whole wedding to HER optional fun schedule.", "NTA. It's hard enough to arrange a date for a wedding without all of this.", "NTA.  You can't make the dates work perfectly for everyone.  It doesn't sound like you were particularly in contact with your sister.", "NTA\n\n\nLook your not responsible for your mothers relationship or lack their of with your sister.  \n\n\nWhat your mom is doing is trying to make the wedding about what is best for your sister because she is trying to mend the relationship.\n\n\nYour sister needs to stop being ridiculous as no one is a mind reader.  The fact is that these festivals happen every year, she has already gone, and you shouldn't be bending over backwards to make your sister happy or your mother.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I (27M) am getting married this year and arrangements have just been made (last week or so), deposits paid for and registrar/venue booked. I did check with people before booking the date and although we're still very early into the arrangements, the date is set for a Friday in August this year. \n\nI've told some people the date and my fiancée has told her family, some people have made hotel bookings already. My sister is currently travelling and has been for the last 5 months or so. Good for her she's having a great time. \n\nThis morning I got a message from my mum saying that my sister is upset because she is supposed to be at a music festival (Wednesday - Sunday) where the Friday clashes with our wedding. The festival is around a 5 hour drive away and essentially a mini holiday for her. \n\nAfter I got the message from my mum I immediately called my sister. I apologised to her and told her that I'm sorry I didn't check with her first, I had just assumed that since she's been away for 5 months, she wouldn't have anything else booked. My sister seemed okay with it, she wasn't rude but a bit upset. We talked about how she's getting on with her travels as she's currently in the mountains in New Zealand. She's not going to miss the wedding all seemed good.\n\nI then called my mum and she was pissed, as my sister has been travelling, she's not had many opportunities to speak to my sister, most of it has been text. The first conversation my sister had with my mum in ages was essentially (according to my mum) my sister angry at my mum over the phone, blaming my mum for not knowing she was away them dates and generally just being angry and upset. This then upset my mum.\n\nAITA for not checking with my sister before booking the dates of our wedding?\n\nExtra info for anyone that can be bothered to read it:\n\nMy sister is going to the festival with 1 friend and she's worried about telling that friend about having to bail for some of it. She's worried the friend will then pull out of going. I have invited the friend to the wedding if it means that my sister still gets to go to some of the festival\n\nMy mum feels guilty (she shouldn't) and has offered to pay for flights to allow my sister (and friend) to get to and from the festival to attend the wedding. \n\nMy sister has been to this festival a couple of times in previous years already.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. mistakes happen", "NTA- Your mother and sister are upset with you because your WEDDING is at the same time as a festival your sister wants to go to AGAIN? You have been more than accommodating, including inviting her random friend who is also going to the festival. If your sister wants to be at the wedding, she can miss one day of this festival that I assume happens every year. Your wedding is a once in a lifetime event, assuming this is your first wedding.", "NTA... Such is life...", "Sheesh.  Talk about making mountains out of molehills.  Mostly NAH.  Sister is being a bit of one, though.  To blame your \"mum\" is selfish and, well, stupid.", "NTA. Your wedding is far more important than an annual music festival and should certainly take precedent on your sister's schedule.", "NTA", "NTA\n\nWhy even bother with this... if my sister is getting married that takes priority over anything unless I need life saving surgery or my own wedding.", "You and your sister are NTA. You talked and found a compromise like mature adults. Besides your mom, this seems to me like an already resolved issue.", "INFO: how do you feel about your sisters amount of traveling?", "She needs a mini holiday from all her traveling?!?! NTA but they need to relax.", "NTA you can't check with everyone. Scheduling by committee won't work well in far too many cases. Based on what you wrote, I'd say it sounds like you checked \"enough\".", "NTA.  Even if your mother had remembered, I don't see what difference it would have made.   With everything that goes into planning a wedding, a guest attending a music festival is not a priority consideration.", "My mum and sister spoke before my sister and I, my mum mentioned the dates to my sister, and that's how it started. my mum is upset at my sister for making her feel bad about forgetting the date she is going to the festival. My mum is not in any way annoyed at me. Other than that, yeah you got it right.", "My mum and sisters are actually really close, they talk everyday (but since she's been away it's mostly text because of time differences) my sister was annoyed because she believed that my mum should have known the dates she was away", "I appreciate everyone will get over it and probably nobody will lose sleep over it, it's no major conflict I was just trying to get a sense of whether I was out of line at all by not asking first", "This is the first time she's gone travelling, she saved up for years to do it and I am fully behind her, very happy that it's something she's been able to do", "Ok gotcha. Kinda seemed the opposite with your couple comments about it in the post, and she was able to call you so I’m guessing you could’ve told her. NTA, but a little odd you didn’t try to inform sister about the date I guess and I can see why that would hurt her a little since you did inform other people. But she can probably easily sell her ticket so I don’t think it would’ve tipped the balance towards moving the wedding anyway. Doesn’t sound like a once in a lifetime festival considering she’s been before."]}