{"id": 9664, "submission_id": "10z5fky", "title": "AITA for screaming at my boyfriend because he said all women do is enjoy", "selftext": "I (21F) and my boyfriend (26M) were having a conversation about marriage and he said it's easy for women coz all they do after getting married is enjoy and you might say women give birth which is painful but technology has made everything easy you get a c-section done and you're good to go, painless delivery. We've been dating for a year now and it's really bothering me that I find him so misogynist. I couldn't take it when he said pregnancy and giving birth is easy i screamed at him out of frustration, cried and left abruptly. I couldn't take it because a month ago I had to terminate our baby and it was painful and i couldn't imagine how painful giving birth would be, him belittling it made me lose my shit.", "created_utc": 1676069654, "permalink": "/r/AmItheAsshole/comments/10z5fky/aita_for_screaming_at_my_boyfriend_because_he/", "score": 265, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole since i screamed at him and escalated a casual conversation, he does have a point that technology has made everything easy and that has reduced household work to an extent\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Girl, what part of getting your body cut open is easy and enjoyable? Maybe your boyfriend should try it once or twice if it's so fun to him.\n\nNTA.", "Info. He sounds like a nasty piece of work. Why are you with him?", "NTA, don't let him trap you. He was good at the beginning because he was trying to suck you into a relationship.  He will never be less of a jack-off.", "Nta but look when people show you who they are believe them. This is a man who if you marry and have a child. He will down play  your birth. If you have a C-section he will tell you you're being a baby while you recover. C section aren't the easier way out.  It's a huge surgery where all the layers of you are cut through.  Run away op.", "NTA and its time to roll the dice on a better boyfriend. He's not going to be a healthy choice in the long run.", "Girl, leave that trash behind. The fact that he said that to you after your loss is unbelievable.", "You’ve been dating for a year, it isn’t that long in the scheme of things. Dump him, he will only get worse as it continues, imagine the contempt for you he will have if you get married, with him thinking you are having a perfect life and he isn’t.", "NTA  \n\n\nhe is however, and supremely mysogonistic", "He seems horrible. Leave NTA", "NTA - and you might want to rethink this relationship. He's a misogynist.", "NTA. He's a misogynist, he's showing his true colors.", "INFO: Was he like this when you chose to date him, or was this the first time he said something like this? Did this happen in public?", "NTA - huge red flag, you need to get away from this misogynist fuck.", "NTA - Sounds to me like his been listening to the likes of Andrew Tate. You don't need that in your life mate.", "NTA, also he’s not going to change. Then he will either raise another misogynist boy or be misogynist to his daughter. He doesn’t respect you. Or women.", "NTA.\n\nI don't exactly understand why he went immediately to giving birth - you don't have to have a baby after marriage (and you don't have to be married to have a baby), but in any case, a c-section is major abdominal surgery with weeks of recovery that many find pretty painful. It's also riskier for mom and baby than a vaginal delivery in the case of a normal, healthy pregnancy. I don't think life for anyone before or after marriage is solely enjoyment, and I'm not sure what his point even is or what he's trying to say? But in any case, pregnancy, childbirth and parenting are frequently difficult and challenging and painful, and definitely not universally enjoyable all the time.", "Why is he so sure he knows what pregnancy and giving birth is like? Honestly, why does he think he knows?! Your boyfriend is not playing with a full deck of cards!", "NTA\n\nI have never heard of anyone so tone deaf in my entire life, this guys a piece of work. If you can get out, get out and leave this guy behind.", "NTA you need to leave. He doesn't think of you as a person he will not treat you like one.", "NTA, you should really rethink this relationship. If he is already such a misogynist at this young age, there really is no hope for the future. You are still young and the world is your oyster! You should enjoy your life, but not in the way your bf seems to think it's done...? He obviously has no clue.", "Definitely time to throw out the whole man. There's no possible future where he miraculously becomes a decent partner.", "Why are you with him? He sounds like a misogynistic AH. You are definitely NTA, you should probably leave his misogynistic ass.", "NTA. Why are you with him?", "yta to yourself for dating him.", "NTA\n\nSure proved a point by reacting like a toddler though", "Sounds like he might enjoy Andrew Tate. Technically it's bad to scream at people when they calmly express their opinion. Even when their opinion is dumb as hell. I guess ESH, but I really don't understand why you would stay with someone who would say that to you.", "NTA.  Find a better bf.  This one needs some major education about real life.", "NTA as you're right to be upset. Easier does not necessarily mean easy, and it isn't even necessarily easier though it's safer. Besides, he basically reduced you to a baby-making machine when married. Since it is so easy, he's probably not going to help you while you're pregnant and after you've given birth, and surely the house work, cooking, etc, isn't his problem as it is too easy to be worth mentioning. Of course you're upset.", "NTA. Girl, you need to ditch this guy. This is a HUGE red flag.", "NTA\n\nHe sounds heartless and TA here. Don't count on changing him. Is this behavior you can live with?", "Don’t have a baby with this man. In fact run far far away from this boy. NTA", "NTA \n\nWhat did I just read. A cesarean is neither painless nor easy, and the recovery can actually be more difficult in comparison to a vaginal birth. A pregnancy puts a HUGE stress on the body (where I’m from there’s this saying “Every child costs a tooth” = you loose a tooth for every pregnancy) because the baby just takes all the nutrients it needs and it literally alters your brain. Every birth is a risky situation, women have died and are still dying from giving birth. \n\nStatistically women do WAY more of child caring and house chores even if they have full time jobs.", "Nta\n Dump him", "NTA - also don’t have a child with this fuckwit.", "NTA. You should make him watch a video of a C-section and see if he thinks it's better. The only reason it's less painful is because they give you a shit ton more drugs.", "Congratulations on dumping your boyfriend!", "GET OUT NOW!!!!! 🚩🚩🚩🚩🚩🚩🚩", "NTA - RUNNN. He’s an idiot and a misogynist. \nMove on and find better.", "What does he think women enjoy about marriage that men don't?", "I dont know whether to laugh or cry at the idea of a c-section being a painless delivery.  He does understand its surgery right? They literally cut you open.. the healing is generally worse for c-section births, it is in no way painless. Also pregnancy in general can be painful, even before the birth. If this is how he views women in general, you should probably reconsider the relationship.. he is being so dismissive and sexist.", "NTA - pay attention to how you feel when he speaks to you like this. Then imagine a lifetime of feeling that way. Your aversion and confusion are telling you something.", "NTA. I don't understand why this person is your boyfriend. Why would you want to be with someone like this? There's no future with someone who has this little respect for women.", "info: Is english your first language? what does \"all woman do is enjoy\" mean?", "NTA\n\nI was leaning towards \"everyone sucks here\" because in my opinion, it's not right to scream at someone for simply upsetting you.  But the context of him knowing that you just had to terminate a baby and still saying that shit is pretty significant.  I still don't think you should scream at people, always try to maintain your composure and if you can't do that, excuse yourself until you can.  Still, it sounds like he was trying to bait you with a painful topic.  Why exactly do you want to be with someone like that?  You know you deserve better, right?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (21F) and my boyfriend (26M) were having a conversation about marriage and he said it's easy for women coz all they do after getting married is enjoy and you might say women give birth which is painful but technology has made everything easy you get a c-section done and you're good to go, painless delivery. We've been dating for a year now and it's really bothering me that I find him so misogynist. I couldn't take it when he said pregnancy and giving birth is easy i screamed at him out of frustration, cried and left abruptly. I couldn't take it because a month ago I had to terminate our baby and it was painful and i couldn't imagine how painful giving birth would be, him belittling it made me lose my shit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "I had 3 c-sections, not by choice and there wasn't a damn thing enjoyable about any of them. Not the drains, not pulling out the drains, not the catheter, not the staples, not trying to sit up while holding a pillow to my stomach, not the weeks I wasn't allowed to drive or lift anything....", "NTA!!!!\n\nBreak up with him!  He'll only get worse as time goes on.", "As someone who went through two c sections, may he rot in hell", "NTA, and where is he? We'd all like to yell at him too.", "Oh yeah major surgery is incredibly painless! Just had mine 4 weeks ago and I'm doing backflips! Insert well m eye-roll here \n\nIs this someone you want to be with forever? He has no empathy for you. NTA", "NTA he’s not worth your time", "[removed]", "Oof I am sorry you just learned your BF is a huge misogynist - NTA", "Run.", "NTA but you need to get as far away as you can from that toxic relationship. Girl you can do better. Do yourself a favor and kick his ass to the curb.", "NTA.\n\nYou might want to cut something else from your life though.", "Take this little boy right to the trash where he belongs. Ignorant little shit. NTA.", "NTA but you’re wasting your breath. dont get together with people on the assumption that theyll change. he’s a misogynist, you cant change that.", "Ahahahaha he thinks that a surgical procedure is a painless delivery. Maybe he can get his abdomen cut open so you can see how painless it is. He can get his taint ripped open too! So easy!\n\nSounds like he’s conflating being a sugar baby with being a SAHP, and adding in some misogyny for good measure. Don’t stay with this guy. Just consider yourself lucky that you found out before you had a child.", "Right like yes please cut me open move organs aside and a baby pulled from my abdominal cavity", "What? Getting cut open is easy, you literally don't have to do anything! /s\n\nBut honestly that's something I'd expect this dude to say.", "And you know what else is super easy? Feeding and carrying around a helpless baby while you have no core strength because your abdominal muscles aren't attached to each other right now! How do you get up from the couch when you have to hold the baby but you ALSO need the strength of both your arms to push yourself up?\n\n(I had a planned C-section, I was not in labor for one minute and I think I have the second least difficult birth story I've ever heard, so I feel pretty qualified to say that process is NEVER \"easy.\")", "I've had 2 c sections. 2 of the scariest moments of my life. 1 was emergency, 1 was planned. The planned one the spinal wore off. You can't move. And vomiting without the use of those muscles is so traumatic. I was in pain, like hurt to use my muscles to pee or cough for like 2 months. It was horrible. It was so far from easy. Thank God my husband understood that and advocated for me.", "He was great in the beginning now he says shit like this and asks me to respect his opinion", "I mean he was in a lot of pain too emotionally since it was his first child... He started acting like this after termination", "He was amazing in the beginning and it did not happen in public", "In 2022, in the United States of America, with amazing health care, one of my best friends nearly died during an emergency C-section.  She lost so much blood from complications and there was so much tearing.  Her body will never be the same that it was before in so many different ways.  She adores her baby and I know she would do it all over again if given the chance, she wouldn't trade her little one for the world.  But it was still a very traumatic process.", "He said a man is supposed to run the household financially but a woman can be a homemaker she is not expected to earn so she can enjoy. All she brings to the table is sex and children now if you believe sex is also work then you're delusional and child birthing has become really easy because of technology that's why women enjoy after marriage and men work like slaves", "Wdym?", "I'm sorry English is not my first language... \"Women only enjoy\" is what that means", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Man, feeding and carrying a helpless baby around sounds so much easier than not feeding and carrying a helpless baby around, with or without detached abdominal muscles! /s", "Respect YOURSELF and leave him. He is showing you how he really feels now…believe him.  NTA unless you stay with him…", "Well, don’t hold on expecting him to change back to the way he was. Have you told him you don’t like the way he talks about women? You need to consider if this is someone you want to continue seeing. Life’s too short.", "Saying that a c-section is \"easy\" and a \"painless delivery\" is not an opinion, though. Or rather, it's an opinion formed around utter nonsense and is objectively, provably untrue. A caesarean section is a *major abdominal surgery*, involving cutting through multiple layers of organs, results in a significant surgical scar (which can reopen or become infected, due to how deep it is), and requires WEEKS of recovery time as with any major surgery. \n\nWhy on earth would you \"respect his opinion\" when he literally doesn't even understand something as basic as \"cutting a woman open to remove a human being from one of her major organs is, in fact, a very big deal medically speaking and the opposite of 'easy'\"?\n\nAside from being shockingly misogynistic, the man sounds like an absolute ignoramus.\n\nYou are not required to \"respect\" opinions that are poorly informed and easily disproved.", "Girl, he lovebombed you, and now thinks he has you locked down.  He's a toxic, chauvinistic mess.  Get out.", "Now you know this is the real him. The first him was to reel you in. This is his true colors", "Dump him, girl. He's not getting better.", "Time to break up.", "Respecting his opinion doesn't mean you have to stay with him. He is perfectly feee to have and keep them. He's not free to have and keep you when those opinions hurt you. You are worth more than that.", "You don’t have to respect stupid opinions.", "That gives him no right to speak so poorly about women, and by extension you. Respect yourself and leave.", "Did you start saying terrible, untrue, misandrist things to him after your miscarriage? No? Then don't you think perhaps it's not an excuse for him saying terrible, untrue, misogynist things to you after your miscarriage?\n\nSeriously, OP, this man is showing you who he is, and you need to believe him, and you need to leave.", "I wouldn't count on that.  Guys like him are great at playing the game which is what he did until he had you.  If the termination wasn't medically necessary (put your pitchforks away, I'm pro-choice), but coercion to terminate, and you agreed he knew he didn't have to keep playing the game any more so he stopped since he got you to do what he wanted.\n\nChild, leave, FAST!  This relationship is a one way street to hell, for you.", "Sounds like he knows better and waited to show his true colors once he had you tricked into caring for a false version of himself.", "Did he change before or after your termination", "NTA (if you'd been screaming in public I might've thought esh). From your other comments, this guy either waited until you were in love to show you his hideously misogynistic side, or he's been consuming too much toxic Youtube content. Either way, he's not a prize. Please get away from him. You'd be happier alone or with someone who shares your values.", "Your boyfriend is seriously and irredeemably flawed. Dump him immediately.", "If he's thinking being a homemaker is just sex and children that means he will never appreciate the work that you do as a homemaker.", "You know this is absolutely not acceptable and is misinformed and dismissive of women’s place in society. He sounds like someone you should be calling ex.", "Leave him before he assaults you", "If he thinks being a homemaker is so enjoyable, let him do all the housework while you earn the income.\n\nOr (my actual advice to you) leave him and let him find out that way what you were contributing to the household.", "Nta. From some of your replies I have to ask. How many more red flags do you need?  It's time to run for the hills.", "Your boyfriend hates women run", "He has not, nor ever will give birth, yet he speaks from a perspective as if he knows and is an authority, making it the basis of why women just “enjoy”. He uses no logic nor has experience about what he speaks. He appears to be dull witted because he spews BS about something he clearly does not know.", "\"Not playing with a full deck of cards\" is a phrase meaning, basically, that someone is stupid or their thought processes are not working correctly. Essential pieces of information or logic are missing and things just don't make sense, like if you play a game and there are cards missing.", "Typically in English, that sentence would end with a noun.  What is the only \"thing\" that the married women are enjoying?  \n\nIs he trying to say that married women don't have any worries or cares?  That once they're married their lives are perfect?  That they can just sit back and enjoy life with no problems?  \n\nThat's how I interpreted what you were saying, at least.", "im sorry im going to have to bow out, i still dont understand, sorry OP, sounds like hes a horrible misogynists outside of that..", "I did .... He said he respects my opinions and expects me to respect his opinions as well but he sometimes calls me a feminist (like his tone makes it sound so negative)", "This ^^^  A caesarean is the equivalent of a major car accident, in terms of the impact it has on your body. The boyfriend is not only an ignorant git but a chauvinist moron as well. OP needs to dump his sorry arse.", "Classic narcissist move.", "After", "But then what do I tell him?... What does a homemaker bring to the table? I told him he gets the money she manages it and he said an accountant can also do it even an app on your phone can do it i don't need a wife for that... I said she'll cook and he said i can hire a Maid to cook. I'm just so frustrated!", "I think op means that wives just get to enjoy their life not work hard etc", "I almost never give this kind of advice, but leave him. He is an awful person, he was masking his true self by being nice when you first got together. He will not change and he will make you miserable. Get out now.", "Oh FFS, you're dating a childish Andrew Tate wannabe. Please stop wasting your time even TRYING to justify his nonsense. Life's too short.", "Being factually wrong or hurtful is not an opinion. You cannot insult someone and then claim \"that's just my opinion\". This is deflection and trying to mix things together that don't belong.\n\nHim saying that he respects your opinion is like people saying \"I hear you\". This basically means \"Your voice is loud enough for me to receive your words, but this will not impact me in any way\".\n\nRespect is not shown through saying it out loud, it speaks through actions. Someone who is respecting someone else will take their words serious, especially if they are not the subject matter expert (like a man talking about pregnancy and birth). Someone who is not respecting someone else will claim to understand but then belittle their feelings, words, and worth.\n\nThis man does not respect you", "'You need to respect my opinion that you're not really a person'\nNaah, fuck that dude.", "His aren’t “opinions” they’re bullshit lies. There is nothing easy about a C-section birth.\n\nEdit to add NTA, although I think it was a given from my comment. He’s waving more red flags than a color guard.", "1. Does he respect your opinions?\n\n2. Saying a cesarian is \"painless\" is not an option, it's an objectively wrong and misogynistic idea he's saying for no reason other than to put women down.", "You deserve better", "He says he respects your opinions, but he doesn't, really. He's really not worth keeping, at this point.\n\n(edited for typeo)", "That is gaslighting", "Oh, he’s just saying he respects your opinions so you “have to” respect his terrible opinions. You don’t want a partner who you disagree on certain issues with…and it seems like he doesn’t really see women as people tbh.", "Hope she finds the strength to leave him.  He sounds so manipulative and purposefully hurtful.", "Dump him.", "you don't argue. You leave. He's not going to respect you. Do you have friends or family you can contact?", "He is telling you everything a housewife is doing has no worth. So he would not value anything you'd do if you took care of \"his\" home. Do you want a life like this?", "Why are you with him if you need to justify your existence and self-respect at every point?  Do you hate yourself?", "What do you get from the “worker”? Money, but you can earn your own. \n\nDo not under any circumstances allow him to badger you into being a stay-at-home wife or girlfriend. He absolutely will say since he makes the money, he makes the rules. You will be trapped.\n\nEven if you don’t want to dump now, finish some sort of training or schooling so you have the ability to fully support yourself. This will give you the confidence and ability to leave when you are ready.\n\nHe will try all the standards: “you should be grateful”, “what other man would want you” to tear you down. Don’t believe him.", "What do you tell him? How about \"bye\".  He is not a good man. Stop wasting your time with him.", "\"Don't argue with an asshole, they'll only drag you down to their level.\"\n\n\"You can't make sense out of nonsense.\" \n\nThose two sayings jumped to the forefront of my mind as I read your comment. Do you really want to spend your life trying to convince a misogynist that he's wrong? He isn't interested in logic or facts, he's only interested in being right. Anyone who thinks major surgery isn't painful is a fool, and an idiot (to put it nicely). \n\nHe's right that he can get an accountant, but he'll need a personal chef to cook. Then he can add a maid to clean the house, a nanny to raise the kids, and a personal assistant to run errands, and manage appointments and schedules. That's an awful lot of people he has to pay for, compared to a wife that's simply \"enjoying\" life.\n\nYou can tell him all of the above for what a housewife contributes, but I can't stress enough how much you shouldn't need to. He'll argue about all of it anyways. You shouldn't have to convince your partner to respect and value you.\n\nI don't say this flippantly, but you need to leave him. It's only going to get worse otherwise. You don't deserve that. You deserve to be loved, valued, and respected ❤️", "Don’t tell him anything but that you are done with him.", "You can't reason with people who refuse to be reasonable. He'll only get worse", "What do you tell him? How about \"bye!\"", "To be blunt, here is what he is telling you: \"You are a lubricated hole with flesh wrapped around it. You have no value except for my sexual gratification.\"\n\nHe can't be any more clear about that message. Nothing above your pelvis has any value to him. And the fact that he's now being so blunt with that message, and that you're very close to accepting what he says, means that he's nearly beaten you down into being a proper little slave. \n\nSo you, your thoughts, your emotions, your personality, all the things that make you a unique person, he's straight up telling you that none of that matters, and your only use is that you have a vagina. \n\nYou need to leave.", "Something I used to hear in my childhood was \"sitting around eating bonbons\".", "Ah, thats kinda what I figured just didn't want to assume, thanks /u/Wickedlove7 that makes a lot of sense. Yeah this guys a AH", "all wives know is C-section , charge they phone, twerk, be bisexual , eat bon bon & enjoy.", "I assumed she meant “women only enjoy *themselves*”.", "[removed]", "Nta get rid of him girl come on", "NTA, but can I ask this: \n\nIs he saying anything to you now that YOU respect? \nIf this is what he really thinks, is that the person you want for a partner? \nOr as the father of a future daughter or son?", "NTA but you can’t change someone who doesn’t think you’re a person. The only effective response is to leave him.", "I strongly recommend you do not marry this man. NTA", "NTA\n\nIgnorance like this could literally cost you your life.", "Why are you still in a relationship with him?", "NTA. It sounds like you’re hurting and I’m sorry. You deserve a better partner.", "hmmm yes as a man im really annoyed over the fun activtys women have like 5-6 months of pain and morning sickness and then being cut open like a fish about to be gutted.\n\nmarriage as everything else in life has pros and cons for everyone that lives, and as a man i whould say men has the best pro in marriage as we get a wonderful beautiful person to call yours. the joy i have seen on my friends faces just to be able to call their women wife is insane", "It seems like a bad idea to get stuck in life with a man who you're not sure in and who doesn't sound like he respects women in general. Especially this early in your own life.\n\nI think you're an a-hole for screaming though, so I go with a ESH.\n\nBut girl, get out while you still can!!", "NTA. I had a c-section which was painful. I could feel the doctor cutting my stomach and when he removed my child he wasn’t gentle either. When I was released from the hospital on a weekend I had been prescribed pain meds BUT the pharmacy they sent the prescription to weren’t open on the weekends.\nLastly one of the aftermath of having a c-section is that I get sharp stabbing pain in my abdomen every time I sneeze.", "NTA - as someone who has had a C-section and takes 8 weeks to recover this is not painless. \nAlso from what you are sharing you need to care for yourself - it is unclear if he is making comments about pregnancy after he knew about the termination or if he just is being aloof. Either way you may want to reconsider if this is the person for you!", "NTA\n\nalso, dump him. No good can come from dragging this out. He’s not going to change,", "NTA. God I wish it was easy. I had a c section and it sucks. It's surgery, they slice you open through layers of fat and tissue, push your organs around, and pull the baby out.\n\nListen I'm gonna be real. He's doing you a favor by showing his true colors now before your relationship continues into the marriage department. Easier to dump a boyfriend then to dump a husband.", "NTA. So, after the C-section, the doctor’s put a bandaid on it, and she’s good to go?", "NTA\nLeave him", "NTA\n\nTF? Dump this boy.", "Why on earth would you put up with a jerk like that?  I have had 3 vaginal births., one normal, one foot first and a 9#15oz, butt first baby that was so difficult and exhausting that I fell asleep between pushes after hours in the delivery room. I also had one C-section, that was painless delivery but was definitely not painless recovery. We often also do most of the feeding, diaper changes, etc, as well as working our full-time jobs.  Please do not marry someone that thinks that way. Get rid of him and find a man that shows he cares about you.", "NTA. Sounds like you should probably leave him.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Meh, his opinions are dogshit....and only an idiot would respect them. \n\nThrow the whole clown out....\n\nI am sorry you recently had a termination, I hope you have support in your life, if not many communities here have your back...\n\nTrauma bonding is real, and you may feel extra attached to him for it, but trust your decision and see the open door its giving you. This guy sucks and you can find a much nicer guy!", "Well if he was shit in the beginning you wouldn't have had sex with him, would you? How much more of your life are you going to waste on him?", "He was good at the beginning because he was trying to suck you into a relationship.", "Dude, I had a 49 hour labor ending in a vaginal delivery with tearing & an episiotomy, and I was still thankful that I didn't have to have a C-section. It's major surgery on top of figuring out a newborn! C-section moms are rockstars.", "You're barely above the legal drinking age and already thinking about kids. With a guy you're not even sure about. Just don't", "Men like him pick younger naive girls to unload their misogyny on, because a lot of those girls don’t know their worth. He doesn’t want a partner, he wants someone to control and use. If you are telling us this, this means that you know on some level that this is red flag behavior. \n\nDo you want to spend the rest of your life being belittled, insulted, disrespected, and possibly abused? If you put up with this now, you are telling him this is okay behavior and it will give him reason to escalate. People like this don’t get better over time, they get worse. He’s going to fall deeper into the Red Pill black hole and you are rewarding his behavior by putting up with it. Protesting isn’t enough- staying with him tells him that women secretly want controlling, sexist men, even if they occasionally get emotional about it. “It’s best to ignore them and remind them of their place, they’ll get over it and accept their subservient role eventually”- that’s what he thinks of you. \n\nEither you break it off now and get over the short term pain, but the post-relationship clarity comes sooner and you realize you made the best decision for you. \n\nOr you drag it out and give us an update down the line about how everyone was right all along and you’d wished you ended it sooner. \n\nOr you tie yourself to someone who doesn’t respect you fundamentally as a human being, and you lose the best years of your life to them. He clearly is letting you know he expects to have all the power in the relationship. You won’t even have the money to leave. He’s telling you straight up he expects to exploit you and keep you trapped with no resources to get out. Yet you think he’s a good boyfriend because…?\n\nTake this seriously. You’re still young, you have options. You can’t fix him. Run. And make sure you have a safe escape plan too.", "It's a terrible idea to date a man who isn't a feminist and considers being one an insult. He is a misogynist; you really really don't want to live with that belief system the rest of your life. It would be misery for any woman. I know he says he respects your opinion, but that is a lie. Because he clearly doesn't respect women or care to learn about their life experiences. And so if you are a woman he doesn't respect you. So he doesn't actually respect your opinions.", "I had an abortion a few years ago. Before I had it my partner was so sweet kind and loving. After I had it, he only became more sweet kind and loving. His empathy towards the struggles women go through only increased when he watched me go through this, so he got a vasectomy so I'd never have to suffer through that again. That's what a loving partner does, that's what you should be looking for. Leave this awful misogynist before it gets worse.", "An accountant, a maid and cook even part time would collectively earn more than him I'm sure, so his thinking is not sound.\n\nHis ignorance of what it takes to run a household is not your problem to solve. Let him do it on his own, he will be having crisps for dinner and never changing his bed sheets.\n\nIf you find someone more worthwhile whose eyes you want to open, then look for a book called Invisible Women by Caroline Criado Perez.", "I, 27M and my wife 25F have been together since high school. I've made enough money since I was 21 that she has never had to work, and we don't have kids yet. She used a lot of that time to get a bachelors degree. I asked her to try working for a bit when she was 24 and wow big regrets. Homemaking even without kids is something I learned to appreciate so much. I just didn't see what it really meant until she wasn't doing it. I asked her to stop working pretty quickly. Now she just works at our local ski resort for fun a few hours and home makes otherwise.\n\nI'm one of those people that is really good at something specific, so I make quite good money. But I'm a mess otherwise. She's good at everything else that I'm not. She makes me healthy homemade food and bring love into every moment of my day, which makes me perform better at work. Her homemaking unironically makes us more money as a household than if we both worked white collar jobs because my income increases year over year much faster when I can focus. That's why she spends OUR money whenever she sees fit. She earned it just as much as I did by helping me achieve more professionally.\n\nBasically, I'm posting this because there are good men that don't currently understand why homemaking is important but will learn. And it isn't something that you can itemize, which most jobs you can't. Don't try to because it just isn't going to make sense. They either understand the value, or they don't. You aren't a salesperson, nor do you need to be about it. Your boyfriend may not ever learn that.\n\nLastly, don't let your boyfriend make you feel like homemaking does not have value. It has THE MOST value of any job in this world. Our consumerism shit-tier society has made us lose sight of the intangible things that make us happy and at the center of any happy household is a wonderful homemaker. My wife makes me feel love every single day, how sick is that? And when we have kids, I get to experience more love.  I hope you get that one day too.", "NTA I am a married women and I don't find it particularly enjoyable. He sounds like not very good marriage material.", "Please leave him.", "NTA but you are dating one.", "NTA Sorry your soon-to-be ex is such a misogynist.", "NTA- I'm a guy and I even know his statements are disgusting, wrong and not fact. He's not going to get better. You need to decide if he's what you really want. I'm sorry you're in this situation.", "NTA. Would you really marry a blatantly misogynistic man? I hope not!", "NTA why are you with him?", "NTA. Well, that's not true, you're being a real AH to yourself by choosing to stay with a sexist pig who doesn't respect you.", "NTA. We have four children, only the last of which was a C-section. That was by far the most horrific pregnancy and birth of all of them. He sounds like a real loser.", "NTA leave him, he is a walking red flag. You deserve so much better. His behavior is beyond repugnant.", "NTA and he should be your ex-boyfriend now. What a misogynist tool.", "I (63F) was never pregnant.  I was cut open majorly anyhow in 2018 to deal with severe gut issues, and cut open more gently twice to deal with hernias.  *It is not pleasant.  It does not heal in a week, barely heals in a month or more.  It is not trivial.*  It is far, far even less trivial to be pregnant, with all the hormone and other bodily changes that incurs*.*  Push this one out the airlock, and look for an adult guy.  NTA.", "ESH. I won't go into the \"terminating\" thing. I will say you shouldn't have screamed at him. He's not worth that. He's clearly misogynistic and doesn't have any clue what he's talking about. He's not worth marrying, so all you're doing is wasting your time in a relationship with him.", "Why are you still with him?\nNTA", "He's 26? Lmao he's an idiot", "Your bf is awful and uncaring. A cesarean is a major life-threatening operation,  it takes 6-8 weeks to recover and not to mention you can infected stitches. I know as I had one. Please break up with this person, he is unfeeling. You deserve better as you are still recovering from your termination too. NTA", "I almost admire the boyfriend's naivete/stupidity. He's the guy everyone laughs at before be jumps off a building with a trash bag for a parachute... Hilarity and broken bones ensue. I'm just sorry OP has to deal with him. NTA", "Girl, you are worth far too much to be tying yourself in knots trying to square this situation in your mind.\n\nHe is telling you very clearly where you stand with him.  Your problem is that you remember what he was like “before” and you hope that he’ll be that person again.  He isn’t at the moment, and he’s showing no sign that he will be again.  What are you going to do? Hang around on the off chance? \n\nYou know that the vile shit he’s spewing is wrong on many levels.  Because you’re a reasonable person you think “oh well, I’ve been taught that we respect others’ views”.\n\n I’d like you to think about this - you know his “views” are abhorrent, so you certainly don’t have to respect them in any way, shape, or form.  You’ve been with him a year, so you do t want yo “throw away” that time, but he’s doing that all by himself.\n\nPlease take it from one who has been in similar situations - leave, take time to heal from your loss, and concentrate on finding all your strength and confidence.  It won’t take long for you to look back on this time as a “youthful learning experience” that made you a stronger woman, who knows what she’ll put up with, and knows what she won’t.\n\nMuch love to you x\n\nETA NTA obviously", "NTA - Please leave him, for your sake \n\nBirth, c - sections are not easy.\nAs someone who has given birth it is not easy, no matter what route you go and those kind of views and not something anyone who has just gone what you have gone through or someone who may get pregnant in the future and go through birth whichever route they chose should ever have to experience. \nI couldn’t imagine going into labour and someone telling me it’s easy and to just get on with it. That’s what I imagine it would be like with someone with those views", "Also ‘had to terminate our baby’. Gives me red flags. It doesn’t sound either like he would give you the support you need through that. Please please ditch him, he’s a creep. NTA", "As a guy, I wish I could upvote this more. You're a superwoman.", "Hey, I'm a guy and I don't like feminism either (parts of it at least).\n\nBut even I can tell you that your boyfriend sounds like a dick. He doesn't sound 26, he sounds more like a teenager and an internet troll. Maybe he was just teasing you, but clearly, he doesn't know how to do that properly.\n\n>He was great in the beginning...\n\nEverybody sounds great at the beginning. It's the honeymoon phase. It's the facade we put on. \n\nMay be it's time to admit you made a mistake and leave that guy.", "Call him a misogynist and see how he reacts.", "Tell him the relationship is over. Because it is. It sounds like he’s trying to make you leave him so he doesn’t have to leave you.", "Nothing, you just take your shit and leave one afternoon, and block him on your phone and instruct your friends and family to do the same. Get far, far away while you’re at it, because he’ll be a stalker for sure.\n\nThis guy is straight up deranged, and being deliberately offensive. Next steps are when he starts hitting you for “not cleaning properly, it’s so easy it’s barely a duty”.\n\nIf you marry this guy and become a stay at home parent your odds of making it to 40 are dramatically low. At some point he’ll become convinced that your oceans of free time as a stay at home parent is spent cheating, and then the news will call it a “family tragedy”.", "NTA. As a male I will say this. Dump him immediately and run.\n\nThere is a statistically high chance that he will abuse you in the future. Either emotionally and/or physically. His \"opinion\" and augment tactics fall more in line with extreme right wing methodology and their ideology. He will most likely cheat on you in the future if you continue to be with him.\n\nHis views will most likely continue to get worse as he will treat you as property and not as a person. He will also grow resentment towards you since \"you will have it easy\" while he works long hours. This is a well established pattern of abuse that repeats often. So please run and escape before the cycle of abuse occurs.", "Throw this one back, he's defective", "NRA. Get away from that creep. He's never going to even like women and he doesn't like you. Once he is out of your life, you should explore in therapy what was the appeal for you of a guy who's so contemptuous of you", "NTA. \n\nAs someone who had two emergency c-sections, wtf. C-sections are hard. It's surgery. You have to heal for a longer period of time, you feel like your guts will fall out at any moment, and you can't even lift a lot. You also have pain and numbness from that site for years and years. It is not painless. It's terrifying.\n\nWhy are you with someone who doesn't value you and what you've been through?", "NTA break up with him break up with him Pls break up with him misogynists are never worth it", "NTA \n\nred flags are flapping and a flying here! \n\nI had my emergency C-section almost 10 years ago (after 2 full days of failed inductions), my scar still hurts and I’m pretty sure it’s why I now have Adenomyosis where I pretty much bleed profusely 16 days out of the month, need iron infusions every year and now I need hysterectomy. SO ENJOYABLE! So relaxed! \n\nFfs leave him, you’re wasting your time on him", "NTA literally c section is not “easy” or “simple” it can lead to MANY complications hes the asshole", "NTA.\n\nPlease leave his sorry ass. He has no idea what he's talking about and he obviously delights in hurting you. (I'm so sorry you have to deal with this as you're recovering.)\n\nDon't bother arguing with him. You know how you win against sexist jerks who love to spew this rhetoric? \n\nYou leave. You leaving and ignoring him will teach him a better lesson than anything you say ever will.", "Have him watch a video of the organs getting removed during a c section and come back and tell me it's painless. Get a new BF. Especially after you had recently lost a baby??? Throw the whole BF out", "NTA. In general anyone who thinks that the opposite sex always has it easy lacks imagination and empathy.", "NTA. I broke up with an ex over a similar statement and I have never even been pregnant, I can’t imagine how painful and infuriating that must’ve been for you to hear.", "I try really, really hard to avoid using this word on this sub because \"Be civil\" but there really is nothing else applicable.\n\nOP, you are dating an idiot.  An insensitive and cruel idiot.  Why?\n\nNTA.", "NTA dump him", "Nta. \n\nTell him to go get his fucking stomach cut open, pulled apart  and see how painless it is. \n\nI've watched a C-section and had two. They look absolutely brutal watching one. I probably would have fainted if I could see my own. And the healing was horrific.", "NTA. Please leave this man.", "ESH\n\n&#x200B;\n\n\"We've been dating for a year now and it's really bothering me that I find him so misogynist. \" YOU chose that bf .. His statements reflect on YOUR values, too. You ARE still with him, and thus support his worldwiew and his statements.", "Ok, so you had one argument about birthing and c section. Any other examples?", "We have many arguments but we resolve it by the end of the day and then sleep, this one in particular wasn't resolved... What in particular do you wanna know?", "Between this and your comments NTA but please get yourself away from this man.", "Run. Now.", ">He was amazing in the beginning\n\nYes, that is how abuse works. And abuse is not only physical harm.\n\nIf abusers were assholes from the beginning, no one would ever want them. They *have* to be amazing in the beginning \n\nThis means that they need to learn how to make their victims care for them and not want to leave. Only then can they take off the loving mask and let their cruelty out. And if they're too cruel, if they push their victim far enough to consider leaving, the abuser will act apologetic and promise it'll never happen again and make a show of being incredibly loving - that way the victim is tied to them again and is once again safe to abuse again. \n\nCheck out \"Why Does He Do That\" by Lundy Bancroft, it's a book that helps people to identify unhealthy relationship patterns. Here is a [link to a free pdf copy](https://goodfileshare.com/why-does-he-do-that-pdf/).", "Check out Love Is Respect\n\nwww.loveisrespect.org\n\nHe sounds horrible please leave, you deserve much better. Do you have people in your life you can reach out to for support?", "I'm sorry but there's nothing respectable about a misogynistic pig like him. My ex was like that.", "A Caesarean is major abdominal surgery that requires weeks,  sometimes months, to recover from. (Vaginal childbirth is also mot a stroll in the park.) I delivered babies for a living so I speak from having helped many women in their recovery times. Post section, you need a lot of help with baby care and just general living (not lifting anything more than 10 lb for weeks). This man will not do that for you, and I think you know that. Baby care, ideally, is a shared thing and not just the mother's responsibility. Call me a feminist- it's a good thing.", "You tell him \"I am breaking up with you\". \n\nYou cannot convince him. Don't waste your energy trying.", "So... He doesn't respect your existence. He thinks you are inferior to him simply because you're a woman. He expects you to stay at home but thinks that staying at home will make you unworthy of respect. He expects you to have babies immediately upon marriage and dismisses the extreme physical impacts of pregnancy and childbirth \n\nAnd now he has informed you that the ONLY things you'll be good for in the future is spreading your legs so he can fuck you.\n\nSeriously OP, please find some self-respect and leave this trashcan of a man. He is filled with nothing but misogynistic garbage. You deserve a relationship where you are respected as a person and not treated like a glorified fuck-doll and baby machine.", "Thank you so much for this... Yes i do have a family i can reach out to❤️", "That's good please reach out to them.\n\nI'm really sorry that you're going through a hard time right now, you deserve to be supported and respected."]}