{"id": 9667, "submission_id": "10zbrga", "title": "AITA for telling my husband he may need to reconsider riding a motorcycle once our first child is born", "selftext": "I (30)F have been married to my husband who is also 30 for 5 years and been together for 8.\n\nMy husband became interested in motorcycles about 3 years ago.It is something I have never liked as I feel motorcycles are very dangerous .He bought one against my wishes which was fair enough because he is an adult and it would be unfair for him to ditch his hobby because of someone else but he knows I do not like it and will never go on it.\n\nWe are trying for a family and I told my husband he may need to stop riding because I was not willing to become a widow and support our children by myself if he had an accident or died. It was a bit better right now since there were no children involved but I am totally against him continuing to ride the motorbike if there are other people to consider which would be the children.He was not very happy with this and said if he ever died while riding his motorcycle I should just know that he had died doing something that he loves.\n\nI am unwilling to accept this and do not know what is going to happen once the children arrive.I am just checking to see if I am the AITA and just accept that  he rides a bike and not ask him to stop or cut down once we grow our family.", "created_utc": 1676088551, "permalink": "/r/AmItheAsshole/comments/10zbrga/aita_for_telling_my_husband_he_may_need_to/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Asking husband to consider stopping his motorbike hobby once we have children due to it being very dangerous.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Well if it brings him peace and happiness to ride a bike it will bring happiness to your marriage and family.\n\nNTA if you just tell him how you feel and let him decide whether to reassure, continue or stop. YTA if you think you can force that away from him.\n\nIf it brings you any peace, the chances of crashing on a well maintained and looked after bike is very slim, and the fatality rate from crashes, although higher than a car, isn't something to fear riding a bike for. Can check the internet for the stats.", "I'd say fine keep the motorcycle but then also get life insurance", "NTA but how about a compromise? If he wants to keep riding, he needs to buy and maintain large life insurance and disability insurance policies. You would be financially protected in case he gets hurt or killed. He doesn't resent you since he can still keep riding.", "NTA. Although he is entitled to his own hobbies and interests, it’s a very different situation when you bring kids into the mix. Being a parent means putting your kids first. If it puts you at high risk and your wife is also strongly against it, there should be some understanding and willingness to seriously cut down on ride time.", "NAH yet. Just make sure you are fully informed in the decision you make, not based on emotion or intuition. \n\nMotorcycles might be less (or more) dangerous than you realize. So if you’re going to decide, at least do it with the right statistics at your disposal. You might decide to cut out saturated fats from your diet instead of the motorcycle ultimatum.", "Yta\nCan't take a man's joy, my husband likes to surf in the north Pacific lol", "NTA. Asking him to refrain from a high risk activity when you are planning a family is perfectly normal. Motorcycles are unambiguously dangerous. \n\nAll the people telling you “you can’t keep him from dying” are not wrong. But he can minimize needless risk. And a life insurance policy is not a father.", "Someone earlier today/yesterday posted in this sub asking if they were the AH for having to have surgery the day his first child was born and leaving his wife alone in the hospital post birth due to an injury resulting from a motorcycle accident. It badly damaged the marriage.\n\nNTA.\n\nIf he wants to ride and isn't concerned with the consequences for you and your potential children, don't have kids. Decide if that's a deal breaker for you or not, and proceed accordingly.", "NTA. I know someone who died on their motorcycle. A lot of the time it isn’t the motorcyclist’s fault, but that of other bad drivers.", "YTA - there are many dangerous things in this life and you can’t tell him how to live his. You’ve told him you don’t want him riding one - which I think is fine. But I don’t believe in forcing him to give up his hobby for you. I’m a little biased as my husband has ridden motorcycles for decades, but a lot of this depends on how he drives, if he takes a lot of risks etc.", "NTA.\n\nOf the few people I've known who have ridden motorcycles - all but one have been in moderate to serious accidents.\n\nOne - while standing the bike rolled on their ankle and shattered it. \n\nTwo - were (almost fatalities) - one of which will never fully recover. \n\nIn the end its his choice - but he needs to be aware of the risks / consequences of his decisions and if YOU are ok with them. Are you in \"ultimatum\" territory? Is it - the bike or us? Have you considered what your \"line in the sand\" is or are you just asking him nicely?", "YTA - You being afraid of something doesn't give you the right to lay down the law and tell him to give up the bike. Yes, they can be dangerous. Being in a car can be dangerous. Being a pedestrian can be dangerous.", "YTA. There are things that you will do which will be dangerous to the baby. But ‘because you did it, it’s ok’. Life is dangerous. Let him have his hobby. Or be consistent later on when he asks you to make a major change that you don’t like.", "You are not the ah. If somebody decides to have a kid it’s time to grow up and put things away. Being there for a child is more important than riding a bike. He can pick it back up when they’re grown.", "NTA. Is he going to stay married to you or marry his motorcycle. Let him make the choice. The children are besides the point. Do you want to be a 30 yo widow?", "NTA. motorcycles are dangerous", "NTA. There’s a reason ER docs call them donorcycles.\n\n&#x200B;\n\n>He was not very happy with this and said if he ever died while riding his motorcycle I should just know that he had died doing something that he loves.\n\nThis is not an acceptable attitude from a parent.", "NTA.  I've rode motorcycles for over 30 years, and recently sold my favorite Harley.  Riding a motorcycle has always had an element of danger, but there is so much out of your control now, and I'm a single dad with two kids full time. Things like people on their phones while driving and more cars on the road make it riskier than ever. I've been rear-ended in my truck a few times over the last few years. They were minor accidents with no real damage, but had I'd been sitting on a motorcycle I could have easily had my back broken or worse.", "NTA. Motorcycles are notoriously dangerous, and the fact that he’d prioritize his hobby over being a father is concerning.", "NTA. My husband owned a motorcycle when our child was born. He had not ridden it since the summer before I got pregnant because one week he was talking \"how do you know she's the one? How to propose? How to ring shop?\" with a motorcycling friend and the next week, he rode in this friend's memorial ride. That was my husband's last ride. Just like my husband, he was a safe driver who wore all the top tier safety gear, but he was waiting to turn left onto the street he lived on and a car hit him and he did not survive. When my husband realized how much more he loved our child than he ever loved his bike, he sold it that summer.\n\nNothing my husband's friend could have done would have changed the other driver's actions. That was the injustice of it all, he sold motorcycle apparel for a living and wore the best gear. It just can't compete with inattentive drivers and physics.", "NTA. Part of parenthood is taking fewer risks because you don’t want to die with young kids. \n\nI understand that some parents are willing to take the risk, but in that case, they both have to agree to it. \n\nI get that everything in life has risk, and that any of us could die at any time, but the statistics on motorcycles make riding a high risk.", "NAH. I can see both sides. I personally believe that when you have kids, you should limit dangerous activities for their sake, but that's just my opinion. Autonomy is also super important. Make sure he has a good life insurance policy - maybe that's the compromise.", "NTA. Hubs needs $1 million life insurance policy (minimum) if he wants to keep riding. That should be your argument. You can’t really stop him but he should make sure you and the kids won’t have to struggle without him.", "NTA my wife did the same to me. Now since I sold it I still want another but I agree with her after seeing several accidents.", "NAH. My parents didn’t participate in high risk activities while they raised kids and my siblings are the same now that they have kids. After my siblings and I grew up my parents resumed motorcycle riding (among other activities).\n\nUltimately, this is your husband’s call, but you did the right thing by expressing your valid concerns and asking him to reconsider riding.", "BIL used to think I was a jerk for not “letting” my husband ride motorcycles. He changed his mind when he wiped out so badly that the pins in his bones were the best case scenario. \n\nNTA", "Doctors, nurses, and EMTs call them donorcycles for a reason. It is not selfish of you to want him to limit dangerous activities when you are bringing children into the world. It is selfish of him to only care about “doing what he loves” and not thinking about leaving you and the kids alone forever. Please do not get pregnant without resolving this. NTA.", "Take out a lot of life insurance on him if he insists on continuing to ride a motorcycle.", "NTA.\n\nMotorcycles are *insanely* dangerous.\n\n[https://www.medhelp.org/general-health/articles/The-25-Most-Common-Causes-of-Death/193?page=2](https://www.medhelp.org/general-health/articles/The-25-Most-Common-Causes-of-Death/193?page=2)\n\nAccording to these folks the death ratio is roughly 1/800, and 'motorcycle accident' was the 12th most common way to die.\n\nIt's one thing to be taking that risk yourself, but if he can't appreciate that being a parent changes that then I don't thinks he's ready for kids.", "YTA. There are so many dangerous things in this world. When your number is up, it's up.", "Why not just ask him to increase his life insurance and wear protective gear? They are dangerous, but so is many other parts of life including eating that bag of chips or bacon.  Yta", "NTA. When we become parents the rubric we judge acceptable risk against changes. As others have said, yes, there are things we do on a daily basis that pose risk to our lives, such as driving a car or eating poor diets. However, there are risks as a society we don’t seem as acceptable, like stopping on train tracks. This is because the probability of surviving the 1 in 10000 chance that something will happen is lower if we stop on train tracks versus being in a car accident.\n\nWhen you look at buying a family car you will undoubtedly look at buying the safest car you can get. When you purchase car seats and cribs and clothing you will buy the safest things you can manage for your family. You will seek to minimize risk, generally we consider parents who do not take these measures negligent to some degree. Using a car as your means of transportation is minimizing risk.\n\nYou cannot reasonably remove all risk from life - driving on a daily basis is a necessity for most people. Driving on a motorcycle is needlessly increasing the risk posed by driving. There are other hobbies and means of enjoyment that are significantly less dangerous.", "..…. I get your concern, but I can’t say that you’re not the asshole. Motorcycles are dangerous, cars are dangerous, trains, bikes, buses, what have you. There’s always a crash, drunk driver, someone speeding, a random cause for a car/bus accident, a train derailment, etc… \nTell the man to get a helmet, a padded/armored leather motorcycle jacket/pants, and hope nothing happens. But don’t stop the man from having fun. YTA-ish.", "YTA. You can't control life. Millions of ppl ride motorcycles daily with no issues. Just like millions of people fly, cross the street, go into convenience stores, get in cars, etc.\n\nWhat you can control are your decisions and actions. If you won't have kids with a motorcycle rider, then don't have kids with him.", "YTA - one can ride safely with taking a few courses, wearing proper gear, and abiding simple traffic laws. You won’t give him the chance to pursue a new hobby because of your personal fears. Talk to each other", "Yta - people die all the time. If you're unwilling to risk raising kids as a widow, don't have kids.", "Tell him to get a pretty hefty life insurance policy.", "NTA\nIt’s interesting that a lot of people on here are like “anything can be risky what are you gonna do?” But I’m guessing they wouldn’t run across a freeway or play Russian roulette or go BASE jumping because it’s extremely risky. Riding a motorcycle is a lot closer in risk to Russian roulette than eating bacon or driving in a car. I personally don’t find that to be a tolerable level of risk and would not consider someone who rides a motorcycle to be a viable father to my children. Life insurance or not no one wants to be a widow and have to raise kids whose dad died bc he’s thrill seeking and didn’t prioritize his safety to be able to raise his children.", "YTA, if this bring him happiness and is an outlet who are you to take that from him because you have a fear", "NTA.  Not wanting your children’s parent to ride a motorcycle is reasonable.  It may make you incompatible, though.  That sucks, but better than being a widow with a small child (or small children), suffering the list of your partner/their father.", "NTA\n\nYou're not an asshole for telling him that.   You would become an asshole if you tried to enforce it.\n\nYou do not get to decide whether he rides a motorcycle, whether you have children or not.\n\nYou can, on the other hand, take out a large life insurance policy as well as Accidental death and dismemberment (AD&D) insurance.\n\nHe's a grown adult, he gets to assess the risk of riding his motorcycle vs the joy he gets from riding it.\n\nIf you are absolutely against his riding if the two of you have children you either need to be careful about your birth control and not have children with him, or divorce him and get married to and have children with someone who shares your view on motorcycles.", "YTA. Boundaries are set for yourself. Not to control other people. 14% of road accidents are Motorcyclists. He’s more likely to get into a deadly crash in a car than a motorcycle. So maybe read up on statistics before you spout nonsense like this.", "YTA  \nYou're concerned for his safety, which is understandable. Someone I went to school with and graduated with in 2016 died in a motorcycle accident on 9/11 in 2021. He didn't do anything wrong, it was an irresponsible driver not using turn signals just over a hill, not giving my former classmate enough time to react, and so he wrecked in the rear end of the vehicle. So, I get the worry.   \nHowever, you do not get to decide whether or not he is able to enjoy his hobby. If he enjoys it, he should be able to do it.", "Classic AITA young, single, childless, and utterly lacking in wisdom or life experience redditors in here – but the interesting twist is that there are plenty in both the YTA and NTA groups.\n\nIt’s hard to say which group is more clueless – those telling you to mind your own business because it’s your husband’s hobby, and that’s all that matters, or those urging an immediate divorce.\n\nAs a married guy and a father, I think your husband should not ride a motorcycle.  But the solution, of course, is not to engage divorce counsel.  It’s to figure out, in the context of the give and take and compromise that are part of every marriage, a way to convince him.\n\nNTA and good luck.", "I may be biased here, but my late husband bought a motorcycle against my wishes and died on it 3 months later. I got really tired of people telling me \"At least he died doing something he loved.\"\n\nNTA", "YTA. \n\nImagine him telling you that you cannot eat unhealthy food, and micromanaged your food intake, because heart disease is the number one killer of women. It isn’t appropriate to demand that your significant other give up things they love to save them from themselves. That being said, you DON’T have to be comfortable with a partner who wants to do that, but that doesn’t mean that he has to be comfortable giving it up, or that you have to stay with him if it makes you that uncomfortable. It just means, that if he is your person, you both have to be willing to compromise. \n\nIf he takes the appropriate safety precautions, has the proper riding education, and always wears safety gear, riding isn’t much more dangerous than driving a tin can,  because of the maneuverability. The reason the stats are so high is mostly due to improper safety precautions while riding. It’s never going to be as safe as a truck or something, but unless he’s an untrained clown on it, it can provide stress and health benefits that are likely worth the risk. Maybe suggest that he take safety classes and get better gear, and gear fittings. there are a TON of riding courses available in every state, and a good place to call about the ones available close to you is through the DMV or any nearby military base (which will have it’s own motorcycle safety office). If it is his main mode of transportation, You could also ask that he not use it for as much commuting, and use it for intentional rides only, and get a more family appropriate car so it isn’t only on your to transport the children. \n\nYou cannot keep him from dying. He could die in a car accident, from cancer, from a heart attack, from almost anything. You can’t prevent it. The only thing you will accomplish with this ultimatum is driving a wedge between you, removing a stress reliever for him, and setting him up to resent you,  and possibly your future child, and ultimately, things like this could end up snowballing until your relationship fails… and then you’re on your own anyway.", "Ohhh...OK. I'm going to give some insight here because I really don't know what judgment to give except NAH. \n\nI grew up in a state that, to this day, does not require motorcycle helmets. \n\nMy dad always wore one anyway. He was an artist and sign maker. I remember riding on the back of his bike when I was in kindergarten. Always with a helmet. He rode his bike a lot because it was cheaper on gas than his big work truck or pickup. (This was in the 80's)\n\nOne day...dad didn't come home. I was about 6. My brother was even younger. We didn't see him for almost 2 weeks. Mom said he was working on a job in another state....when mom was actually home. \n\nHe finally came home...on crutches in an air cast. Whole body covered in road rash. But his head intact. My brother and I were horrified. \n\nTurns out he had spent 2 weeks in the hospital. He was going through the one stoplight in our town and a woman ran a red and broadsided him, carried him through the intersection and hosed him and his bike. \n\nDad was on crutches and a walker for a year...and still managed to run his business. \n\nBut he never got on a motorcycle again and even went as far as to tell me that he never wanted to see me on one. \n\nHis helmet, calved off on the left side, hung in his sign shop until a fire destroyed the shop 10 years later.  To encourage people to wear helmets, he offered free airbrushing and custom painting on anyone who brought in a full face helmet. \n\nI understand the draw of motorcycles. I also know that when ridden correctly, they are safe. But I also know that you can't trust other drivers and someone on a bike is no match for, say, a distracted driver in a half ton pickup truck. \n\nHe has probably never experienced seeing someone seriously injured or killed in a wreck. \n\nMy dad stopped because he realized that almost left my brother and I without a father. \n\nPerhaps you have a compromise. He can keep his bike but increases his life insurance?", "My partner grew up around bikes and extreme sports. I didn't. He didn't get a bike until our kiddo was older. Now I love to ride. I still definitely have my anxiety around bikes, they are dangerous. Flat out. Maybe you can compromise on cooling it with bikes until kids are older? Also get a good life insurance policy. Nta for trying to set some boundaries.", "Slight YTA.  You are concerned for safety and the future, not being malicious.  However good your intentions are though, you do not have the right to order someone to stop their hobby.  If you do not want to have children with someone who rides a motorcycle, the appropriate decision is to end the relationship.  While I agree with you that they are dangerous, it is not your decision to make.  If he chooses the bike over your peace of mind, that is on him.", "Not the Asshole:\n\nYou can’t stop your husband from doing something he really loves to do. But you can give him an ultimatum, requiring him to get/pay for a hefty life insurance policy if he insists on this dangerous hobby.", "INFO.  Where does he like to ride and is he a safe rider?  Riding a motorcycle on an empty straight 2 lane highway is much safer than riding a motorcycle on crowded highways in metro areas like southern NY.  Some riders refuse to wear helmets and do other deliberately dangerous maneuvers like weave between cars or pop wheelies, whereas others ride speed limit, minimize lane changes, and wear full body riding gear.  My point is some people really are thrill seeking and make motorcycle riding more dangerous whereas others are quite safe.  Which category sounds more like your husband?", "YTA. riding a motorcycle with the proper gear isn't much less safer than driving a car somewhere. and if it makes him happy, the emotional benefits can outweigh the negative as far as his overall health is concerned. \n\nif you were just insisting he rides safely/legally and with the proper gear, i'd be on your side. if he wants to ride fast he can do it on track days. but telling him he can't ride at all is an AH move. y'all might as well work from home, never leave, and have all your food delivered from now on if you're gonna go that route.", "> I feel motorcycles are very dangerous\n\nEh, life's dangerous. Motorcycles are the bright red cars of danger — super easy to see, so they get all the attention.\n\nBut real talk: probably *not* his highest risk factor. How's his diet?", "NTA. It's not an unreasonable ask.", "NTA. I would leave him it I was you", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (30)F have been married to my husband who is also 30 for 5 years and been together for 8.\n\nMy husband became interested in motorcycles about 3 years ago.It is something I have never liked as I feel motorcycles are very dangerous .He bought one against my wishes which was fair enough because he is an adult and it would be unfair for him to ditch his hobby because of someone else but he knows I do not like it and will never go on it.\n\nWe are trying for a family and I told my husband he may need to stop riding because I was not willing to become a widow and support our children by myself if he had an accident or died. It was a bit better right now since there were no children involved but I am totally against him continuing to ride the motorbike if there are other people to consider which would be the children.He was not very happy with this and said if he ever died while riding his motorcycle I should just know that he had died doing something that he loves.\n\nI am unwilling to accept this and do not know what is going to happen once the children arrive.I am just checking to see if I am the AITA and just accept that  he rides a bike and not ask him to stop or cut down once we grow our family.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA But the time to stop riding is when you start trying to have a child, not once the child is born.", "YTA - If you honestly thought it was that dangerous you would have never been ok with him starting riding in the first place. How does a child make his life more valuable? I know it's coming from a place of being concerned and wanting the best for him and your child, but like you said he is an adult, and even with a child it's unfair of your to ask him to ditch his hobby. \n\nRiding is dangerous, but so is driving a car. So is childbirth. So is travelling. So is eating unhealthy. So is drinking alcohol. So is swimming in the ocean. If you are worried about what would happen to you if he wasn't around, then get good life insurance and have a plan. But don't make him resent you for taking away something he loves because you are afraid.", "NTA. My mom asked my dad to do the same. I have extended 2 family members who were severely injured and one who was killed in motorcycle accidents, none of them at fault. It doesn’t matter how experienced or good of a driver you are if you get t-boned by a semi.", "YTA. Don't try and stop your partner from doing something they love. Life has dangers and trying to control people doesn't end well for anyone. \n\nIf you feel really strongly, tell him you need an insurance policy and you can both pay towards one.", "YTA\n\nThis probably won't be popular. \n\nHe is a grown adult. You have no right to tell him what he isn't allowed to do. What if he said that he doesn't want you to have children cause women can die during pregnancy and child birth? Would that be acceptable for you? Just because he could die, doesn't mean you have certain rights to forbid it. You can die any day from doing every day things. My cousin lost his son and father in a car wreck. Should he have forbidden them from driving? \n\nDon't misunderstand, I know how dangerous they are. My ex husband spend 2 months in the hospital, 2 years of rehabilitation and still lost his leg, after a motorcycle wreck. I was there for it all. I was his full time caretaker at home. We had to have an IV that I had to learn to do cause he needed antibiotics. We also have older friends who've never been in a wreck.", "Does your husband have life insurance ? \n\nI have an old Honda CRX with a big engine swap and a turbo. My missus doesn’t like the idea of me driving something that fast with almost zero safety features. The compromise was I won’t drive that car without life insurance.", "NTA. My stepdad always wanted a motorcycle, my mom made him wait until both my brother and I were out of the house lol", "Yta\nJust take out a large life insurance policy.\n Good grief!", "YTA somewhat. If it scares you that much the time to stop him was before he started, not now. How will you be if he refused to have children rather than give it up, or leaves because it has become a deal breaker?\n\nIf it helps any me and my friends are in our 60's - more than ten of us - ard bikers and none of us has personally  known someone who died in a motor bike accident. Two have never had cars and only ever ridden motor bikes.", "The fatality rate from motorcycle accidents is 30 times higher than the fatality rate from care accidents. If that is not something to be considered as a parent, you probably don't need to be a parent.", "No amount of money brings back a partner and a parent. What happens when its a traumatic brain injury or serious disability instead of death and now OP is primary caregiver for child and spouse? I have a friend who rode motorcycles, she was riding in a residential area with her spouse. She made a left in to her neighborhood on a protected green arrow and was hit by a 16 year old looking at his phone who ran a solid red light. Her spine and hips will never be the same. She has metal plates holding her joints together, she is never not in pain. It affects her whole life, for the rest of her life since her early 30’s. And she didn’t do a damn thing wrong -helmet, leathers, skid gear and all.\n\nOP’s requirement is not unreasonable. That accident would have been much different had my friend been in a car.", "You can’t compensate for distracted drivers in 2 ton weapons when you’re on a motorcycle. No amount of helmets and skid gear is going to prevent serious injury when a distracted driver hits you full-on at 45mph. I’m very glad your husband has not sustained a lifelong injury but that’s more about luck than skill.", "But motorcycles are much more dangerous than cars or walking. They are not the same level of danger.", "He should also sign up for the organ donor registry if he already hasn’t.", "Family friend of ours nearly lost his life in a motorcycle accident. The surgeon saved him AND his leg, but it gives him so much pain these many years later he wishes she had amputated it. Imagine a life where you would rather be an amputee, all because you were doing what you love.", "Good point. If he’s going to engage in high risk activities, he should consider the possible ramifications and do what he can to make sure you and the kids will be okay.", "It’s actually even worse than this because this is the risk for the overall population and counts deaths as a ratio to everyone, not the much smaller population of people who actually ride motorcycles, which you almost always have to do to die in a motorcycle accident. This list makes it look like riding in a car is more dangerous but a lot more people are doing that. You’re actually 28x more likely to die riding a motorcycle than in a car https://www.michiganautolaw.com/blog/2020/07/21/how-dangerous-are-motorcycles/#:~:text=Riding%20motorcycles%20is%20dangerous.,in%20an%20injury%20or%20death.", "This is a better link that actually supports your point:\n\nhttps://www.jdpower.com/motorcycles/shopping-guides/motorcycle-vs-car-accident-statistics\n\nThe chances of a fatality in a motorcycle accident are approximately 30 times higher than in a car.\nMotorcycle accidents have a staggering 80% injury or death rate, while car accidents remain around 20%.", "And cars are ranked #8 with 1/272 chance of death. Sooooo. By this it would be better to ride a motorcycle than a car.", "Lol motorcycles kill you instantly, bacon takes decades.", "Uh, have you seen the drivers out there? A motorcycle rider can follow all the rules, wear all the gear, follow all the laws and still get killed because some idiot was drunk driving. Motorcycles are much less protection in an accident than any car on the road.", "There are different levels of risk though.", "Hell, **giving birth** is dangerous.", "Definitely get or increase his life insurance. Make sure to get one that doesn't prohibit riding a motorcycle.", "False. Everything you’ve said is false.\n\nhttps://www.jdpower.com/motorcycles/shopping-guides/motorcycle-vs-car-accident-statistics\n\nThe chances of a fatality in a motorcycle accident are approximately 30 times higher than in a car.\nMotorcycle accidents have a staggering 80% injury or death rate, while car accidents remain around 20%.", "I’m really sorry for all that you went through. \n\nMy dad’s life was saved by an organ donor who died on his motorcycle. Our family got so lucky on a day a family like yours was struggling. \n\nI’m biased as well, NTA", "Oh geeze, I’m so sorry for your loss.", "How come Reddit is always suggesting to \"end the relationship\"? \n\nI mean you couldn't think of any other solution/suggestion/option for both of them that your only go-to suggestion was ending the relationship? \n\nI mean what do you think relationships are so fragile to break? \n\nOP is NTA", "I would like to know this as well. Hell, my dad had motorcycles and took us on rides around the neighborhood. Helmets and leathers for both of us always and never on highways or popping wheelies or tricks. It was a great bonding experience and inspired me to get my motorcycle license. However, if OPs husband is an unsafe rider or takes unnecessary risks I would feel differently.", "Not true. The risk of permanent harm or death during an accident while on a motorcycle is drastically higher. Cars are built for the chasis and frame to protect the driver whereas a motorcycle by design does not.\n\nI would say that driving on a track could be good but there's a reason why insurance companies charge so much more for uninsured motorist and medical for the driver. Source? I worked in insurance and specifically in motorcycle policies for several years.\n\nNTA, OP", "\"Motorcycles are the bright red cars of danger — super easy to see, so they get all the attention.\"\n\nNot really the case, statistics really do show motorcycles are more dangerous than cars. \n\n\"Among all the registered vehicles, 3% are motorcycles in the United States, however, motorcyclists’ death numbers make up 14% of all traffic fatalities, meaning the safety hazard of riding a motorcycle is tremendous.....\n25.98 fatal accidents involving a motorcycle occurred for each 100 million miles traveled in 2019 compared to only 1.42 collisions for passenger cars using the same number of miles. . .. \nwhen looking at the rate of fatal crashes per 100,000 registered vehicles. Motorcycles had a fatal crash rate of 59.49, while the rate for cars was 15.06....The smaller size relative to other vehicles makes it easier for a motorcycle not to be seen by other drivers. The lack of a protective cage and safety features, such as seat belts and airbags, that other vehicles have as standard equipment increase the likelihood that an accident will result in a motorcyclist being taken to a hospital.\"\n\nhttps://www.google.com/amp/s/motorcyclesportworld.com/2022-motorcycle-accident-statistics-and-facts/amp/ \n\nWhen it comes to mode/vehicle transportation motorcycles are more/most dangerous. \n\nYou might be right that husband might have a greater likelyhood of dieing from other health issues, it still does not mean OP is wrong to be concerned.", "A bad diet takes decades, a motorcycle is one pebble you don’t see away from game over.", "This extreme advice to divorce always comes up in these. Yeah, they are dangerous. Yeah, it would be great if he'd stop and I'd likely do it for my wife if I were into motorcycles, but jumping straight to divorce when they don't even have kids yet is way over the top. This isn't like a drinking or drug problem amd there's no indication here he's been irresponsible on it before. He may come to the realization that it's not worth it on his own when he actually becomes a dad. He may think about it and change his mind in a couple weeks after he was caught off guard when it was initially brought up. Stop with the one conversation didn't go how you wanted it, so you should get a divorce shtick.", "I mean. No. You are an idiot.", "A child doesn't make his life more valuable; it should make him want to be around to raise that child, and not leave his wife a young widow with a young child who won't remember his father – and not because he was doing something heroic, like saving lives as a fireman, but because he valued a good time over a lifetime with his family.", "Yes, excellent advice.", "Oh, I agree with you. It depends how far she wants to push it though- no riding or no kids? Or can they comprise on some really large insurance policies? It won't bring him back or restore his health, but she would be able to make it financially.", "I mean… they kind of are. You can either crash a bike or be a pedestrian being hit by a bike. Same for a car. People have died from motorcycles despite protection, people have died in cars despite airbags. People have died while walking/jogging, getting hit by cars, etc…", "This is a handy comparison. Guess I’m never getting near a horse again. \n\n\nhttps://www.reddit.com/r/motorcycles/comments/471hqx/motorcycle_risk_compared_to_common_activities/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "That's because there's massively more people driving cars than motorcycles - you're misinterpreting the numbers. Adjusted per number of registered vehicles, the fatality rate is 6x higher for motorcycles than cars. \n\nSource: https://www.autoinsurance.org/motorcycle-vs-car-accidents/", "Yeah, some of us have ridden 100s of thousands of miles over decades and are fine. A car can also kill you instantly.", "You know what  I concede on that. But she’s still TA for forcing the issue. Either divorce him or stay with him.", "No. Motorcycle accidents are 30 times more likely to be fatal than car accidents. \n\nhttps://www.jdpower.com/motorcycles/shopping-guides/motorcycle-vs-car-accident-statistics\n\nYou could get killed in any kind of freak accident. However, you are much more likely to be killed in a motorcycle accident than a car accident. Pedestrians do get run over and killed. But not at the same rate as motorcylists.\n\nIt is similar to lung cancer. You are at much higher risk of getting lung cancer if you smoke. Does everyone who smoke get lung cancer? No. Does everyone who gets lung cancer have a history as a smoker? Also no. However, you are an idiot if you choose to smoke and say that smoking doesn't raise your risk of lung cancer.", "That’s not how that works. Those numbers are like how we measure population 100/100000 is this or that. That number strictly stats. 1/800 motorcyclists are killed . Where as 1/272 are killed in accidents.", "Yes, motorcyclists may be more likely to die, but there are more death by vehicles. Especially when motorcyclists only account for 14% of motorist accidents overall. She’s TA at the end of the day", "You know what. I concede on your point. Yes. It’s dangerous to ride a bike. But she’s still the Asshole.", "I’m not talking statistics."]}