{"id": 9724, "submission_id": "10zzmc6", "title": "AITA for not wanting my boyfriend's kids to sleepover?", "selftext": "My boyfriend (50m) and I (27f) live in a 1 bedroom apartment. I moved in with him around 8 months ago. He has 8 kids. 2 adults sons in their 30s, who are married with kids, and 6 younger children ages 19m, 17m, 15f, 14m, 11f, 10m). \n\nDespite the fact none of his kids live with him he is very involved in their lives. One or a few of them regularly spend the night at our place (staying in the living room). His youngest son sleeps over almost every Thursday night and his 2 daughters sleepover almost every other weekend (they have different moms so it's more about spending time together then with their dad). His other kids + grandkids also intermittently spend the night.\n\nDuring the warmer months my boyfriend takes his sons camping a lot. It being winter, they haven't gone camping in in a few months. His youngest son especially loves camping and has been saying he misses camping and being with all his brothers. \n\nMy boyfriends has now told me next weekend his 4 younger sons plus his 2 oldests grandsons (13m, 11m) will be camping out in our living room. Not asked but TOLD. Because he thought I wouldn't have an issue with having 6 teen/pre-teen boys in my living room all weekend. \n\nWhen I told him I objected to his plans, he made it seem like I was only unhappy with it because I didn't want to be around his kids despite the fact I gave logical reasons why this was a bad idea. I also know I would end up cleaning up after them and making sure we have enough food for them ect. \n\nHonestly I'm not super comfortable around my boyfriend's kids and can be awkward with them. I also don't generally like it when any amount of them sleep over so I know next weekend will be awful for me. They can be loud, messy and generally don't like me much. They also take over my living room, which is inconvenient. \n\nMy boyfriend is mad at me for objecting, as is his daughter (15f) who was around when he told me his plans and my follow up objection. She thinks \"is it really any of your business though?\" My boyfriend pretty much agreed with her. I think it is my business as I live there too.\n\nDoes not wanting this sleepover to happen make me TA? Should I just be happy my boyfriend has a good relationship with his kids/grandkids?", "created_utc": 1676153988, "permalink": "/r/AmItheAsshole/comments/10zzmc6/aita_for_not_wanting_my_boyfriends_kids_to/", "score": 1042, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > not wanting boyfriend to have a sleepover with 6 of his kids could make me the asshole because he should be able to spend time with his kids as he sees fit.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I don’t think you’re an A for not wanting six teenage boys in your one bedroom apartment, but… why are you dating and moving in with a guy who has children older than you are?", "yta … you knew what you were signing up when you got involved a man w 8 kids. yeah it’s annoying a lot of ppl are in the small area you guys share, but they’re his kids and any parents gonna want to see see their children. you kinda signed up for this part of the relationship.", "YTA\n\nYou shouldn’t be expected to care for them or clean up after them BUT\n\nyou’re dating a man with kids. If you want to be with him longterm or marry him, you need to accept the fact that he has kids and they’re a big part of his life. Don’t date an involved and seemingly good father if you aren’t prepared for his kids to join your life as well.", "You are not wrong believing that having so many teen boys in a one bedroom for a whole weekend would be a mess. Thing is: your boyfriend agreed with his daughter that it is none of your business.\n\nYTA, but mostly for moving in with a man who has all of this going on and not having any established agreement regarding your standing in his life.", "This is one of the many reasons dating someone so much older than you never works out well. You are in different places in your life, OP. His kids come before you, always. If you can't accept that, you're incompatible, period. Kids come FIRST. \n\nSo, yeah... You're the asshole.", "Oh honey… a sleepover is not your problem here. \n\nwhere do you see this relationship going? I’m sure he swept you off your feet, but what are YOU looking for in life? If you want to get married and have kids - it’s not going to be with him. If you don’t (that’s fair!) do you honestly think you’ll have a future with him? His children are OLDER than you. By the time you are 40, he’ll be retiring. And that 15 year old will be your age right now. Protect your heart and figure this out.", "You are 27 living with a man with at least 1 grandchild who is only 14 years younger than you. There is a smaller age gap between you and the grandson than you and your BF.\n\nI’m sure you’ll come back to say the age difference between you means nothing and you’re very happy. OK then, this is what you signed up for. Only you can decide if you can handle it. But it’s not looking good.\n\nIf your only objection was to the small space, I wouldn’t call you the asshole, but the truth is, as you said, you’re not comfortable around his kids. That sounds like you’d prefer not to have them around, so YTA.", "YTA. Why? Because you are with a dude twice your age who has kids AND grandkids, and you seem genuinely surprised that he prioritized them.\n\nGirl, get some therapy and go find someone closer to your own age instead of getting upset with PopPop.", "YTA. Literally what?? First off, they are his kids and grandkids, and he wants to spend time with them. And you keep saying it is \"your\" space. It's not just yours, dear. \n\nAnd of course you feel awkward around his kids because you are close to many of their ages and are younger than two of them. You need to grow up or GTFO. You sound like a complete AH when you try to explain your reasoning to your bf as well. \n\nHe needs to drop you if you are so adamant about these feelings.", "YTA. \n\nIn the future, don't play house with someone who has a bunch of kids and insufficient room to have them stay over without taking over the main living area. \n\nThis was a totally foreseeable situation.", "YTA mainly to yourself for willingly signing up for all this.  Dude has a gaggle of kids with multiple women and you don't seem to be down for dealing with this.  He also apparently does not have the means to make it any easier by getting more space.  You're young.  It this really what you want your life to be?", "YTA, you choose to date a man with kids.  Get a hotel and go out with your friends!", "YTA. Don’t date a man with kids if you have a problem with him spending time with them and doing nice things for them. Why are you even with a man who is old enough to be your dad? He has kids older than you and that doesn’t bother you?", ">Honestly I'm not super comfortable around my boyfriend's kids and can be awkward with them. I also don't generally like it when any amount of them sleep over\n\nINFO:\n\n\\- Why are you with a man with many minor kids then?\n\n\\- Surely it is logical that he would have some fraction of them over to stay overnight? Did you two never discuss this? Were the 8 kids hidden from you?\n\n\\- If it isn't working for you, you have options of course, including living alone, breaking up etc. His kids should always come first before you.", "YTA\n\n**You** moved in with him, **you** chose to date a man 23 years your senior *with children*, to think that you get a say in what he does with them is laughable\n\nIf you didn't want to deal with children, why did you choose to date a man with them? \n\nTbh, he sounds like a good dad", "YTA. You date and choose to move in with someone with kids, you accept that the kids are part of the package. \n\nBut why are you dating someone old enough to be your father?", "ESH\n\nThese posts really irritate me. This has much less to do with your boyfriends kids coming and sleeping over, and the fact that you are dating a man twice your age and at a very different point in his life than you are. He is with you because you do not know any better and he can treat you with the lack of respect he is currently showing you and teaching his kids to do the same.\n\nWhy are you with a man that does not take your say into consideration, who allows his daughter to disrespect you and then agrees with her? Why are you there?", "Yta, his kids come before you. Why do people feel they come before the children especially when you're not even married. You knew he had 8 kids. You walked in with your eyes wide open. You don't get to try and flip the script. They will always be his children, no guarantee you will forever be the significant other", "YTA. Don’t be with a man who has kids if you’re not comfortable around kids. New flash - his kids are always going to be more important than you", "INFO: What were you expecting when you got into a relationship with a guy who has 8 kids??? If interaction with his children is so uncomfortable for you, why did you move in with him? Why did you pursue this relationship in the first place?", "YTA\n\nYou presumably knew he was a parent when you moved into *his* apartment. Kids come first. If you don't want to be around his children this coming weekend, go stay in a hotel. Expecting him to not have his children come over anymore because you're uncomfortable is unreasonable. If you can't deal with this dynamic move back out.\n\nOnce a parent, always a parent. And any decent parent, when put on the spot to choose kids or new partner, will put the kids first every time.\n\nYour partner isn't TA for this, but he is for dating someone younger than his eldest kids. This is a whole mess.", "Smh.\nThat’s all I have to say.", "While it’s definitely not cool that he did this without discussing it with you first, unless an unspeakable tragedy occurs *knock on wood*, his children are not going to stop existing. If you’re not ready to be or open to being a stepmom, you shouldn’t be living with (or even dating) him. \n\nYTA", "yta\n\nAnd you are dating someone with children older then you. that basicly never works out. All his previous relations failed, so this one will too. Because at the very least he should date someone older then his children, but they noped out.", "YTA- Don't date parents if you can't deal with them being a good parent.", "Info, did his kids/grandkids sleep over before you moved in.", "YTA you married them all when you married their dad. Suck it up and do what you should do for the kids. Your selfishness is unbecoming", "YTA\n\nYou're dating all the kids too.  If you don't want a boyfriend with 30 kids, don't have one.  \n\nIf your boyfriend has kids, they come with the territory and get to visit his home.", "YTA because his kids are nearly your age... Let that man host a sleepover for his own kids for Pete sake", "YTA - his kids always come first, you shouldn’t have started dating (this much older man) if you didnt want to deal with his kids.", "Eh..I understand your desire to not want six kids running around a 1BR apt, but you knew he had 8 kids. I assume you knew he was involved with them before you moved in. It’s something you have to deal with now.   I think the AH part depends on how the objection was delivered and what the reasoning was.  I’m on the fence.", "Do you feel weird about being close to his grandchildren’s age ?", "YTA, because you know he has kids (hell, he's almost double your age), and his kids come first. You cannot act offended or get involved with his relationship with his children. If you cannot deal with this, then you must end the relationship.", "Generally dating someone with children older then you is going to be a challenge, add in 8 kids (in a 1 bedroom and assuming not much money) that's more of a challenge. Save your sanity and don't become the next baby mama.\n\nYTA for assorted reasons....", "YTA\n\nYou knew what you were signing up to the fact he wants to be so involved in his kids is great albeit having so many people in a small space is ridiculous sometimes it happens... but a whole other issue is you're younger than some of his kids !! Major red flag", "ESH\n\nYou’re with a man who has an entire sports team of children. He loves having them in his space and sharing time with them. You don’t. Rather than tell him the truth, you don’t want to be surrounded by his family, you’re being passive-aggressive. \n\nThis is not a stable foundation for a long-term relationship. He will choose his family over you. He literally made these people.", "ESH. You for dating (moving in with!) a man with kids if you don't want those kids around. He and his kids are a package. Him for not being considerate of the fact you live there, too, or considering the effect of EIGHT people in a one-bedroom apartment.\n\nHe's also kind of TA for dating someone younger than his children. Sometimes it works out...but a lot of times there's too much power imbalance.", "Kind of have to go with ESH because you knew that he had 8 kids and grandkids when you moved in with him. However you also live there and he should have discussed it with you. He also shouldn't be expecting you to look after his kids. If he wants them over it's on him to look after them. \n\nI can see why he wants to be with you because he needs a nanny for the kids and will soon need a nurse. But I can't for the life of me see what you see why you would be with him. I'm closer to his age than yours and I wouldn't want an old man with 8 kids from multiple women who doesn't even think I'm worth an opinion on what happens in our home.", "YTA You are dating a man with kids and there are going to be in his life, full stop.", "The kids sleeping over is the least of your concerns.", "A 50 year old man who has 8 kids and lives in a one bedroom... \n\nGirl, do better. Leave. \n\nNTA, but you're not being smart", "OMG, are you dating Nick Cannon?", "What you do is you book a hotel room or AirB&B for the weekend and let them enjoy their time with their father. You insist that either they cleanup the house OR a cleaner is booked to sort out THEIR mess and that your bf pays for that.\n\nNTA for not wanting to put up with it, but YTA for expecting your bf to agree not to have them over. It’s HIS house/flat and HIS kids.", "NTA\n\n8 kids in a 1 BR apt sounds like a nightmare.  And he just sprung this on you?  Don't let it happen.  You pay rent to live there, so it is your business.\n\nAlso, the fact that he is almost double your age that his eldest kids are older than you...He's likely into younger women to control them, and I don't say that lightly.  If I was you, RUN.", "YTA. You are dating a much older man with eight children and several grandchildren. You presumably knew that he was involved in their lives before you moved in, but moved in with him in his one bedroom apartment anyway.\n\nIf I were you, I would take a hard look at what kind of future you see for yourself with this man. His family is going to keep growing. There are going to be ever more children coming around. He apparently loves making babies even though he does not raise them. And now his babies are having babies. Next up, he will be making babies with you, before leaving you for an even younger woman.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend (50m) and I (27f) live in a 1 bedroom apartment. I moved in with him around 8 months ago. He has 8 kids. 2 adults sons in their 30s, who are married with kids, and 6 younger children ages 19m, 17m, 15f, 14m, 11f, 10m). \n\nDespite the fact none of his kids live with him he is very involved in their lives. One or a few of them regularly spend the night at our place (staying in the living room). His youngest son sleeps over almost every Thursday night and his 2 daughters sleepover almost every other weekend (they have different moms so it's more about spending time together then with their dad). His other kids + grandkids also intermittently spend the night.\n\nDuring the warmer months my boyfriend takes his sons camping a lot. It being winter, they haven't gone camping in in a few months. His youngest son especially loves camping and has been saying he misses camping and being with all his brothers. \n\nMy boyfriends has now told me next weekend his 4 younger sons plus his 2 oldests grandsons (13m, 11m) will be camping out in our living room. Not asked but TOLD. Because he thought I wouldn't have an issue with having 6 teen/pre-teen boys in my living room all weekend. \n\nWhen I told him I objected to his plans, he made it seem like I was only unhappy with it because I didn't want to be around his kids despite the fact I gave logical reasons why this was a bad idea. I also know I would end up cleaning up after them and making sure we have enough food for them ect. \n\nHonestly I'm not super comfortable around my boyfriend's kids and can be awkward with them. I also don't generally like it when any amount of them sleep over so I know next weekend will be awful for me. They can be loud, messy and generally don't like me much. They also take over my living room, which is inconvenient. \n\nMy boyfriend is mad at me for objecting, as is his daughter (15f) who was around when he told me his plans and my follow up objection. She thinks \"is it really any of your business though?\" My boyfriend pretty much agreed with her. I think it is my business as I live there too.\n\nDoes not wanting this sleepover to happen make me TA? Should I just be happy my boyfriend has a good relationship with his kids/grandkids?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Info: Who's house is it ?", "Whew, this one's a handful. You're not an ass for wanting some say over sleepovers at your house but you're dating a guy with 8 kids and grandkids and a long history of having an open door policy. That's guaranteed to not change just because you started living with him. I'm going with NAH and a strong strong strong recommendation that you move out. This guy's house is NEVER going to be a comfortable place for you to live, he should never curtail his time with his kids because he has a live in girlfriend who doesn't like overnights. There are no jerks here just a relentlessly bad match.", "Yta for being in a relationship with someone with kids when you are not willing to get involved with those kids", "YTA. You dont want his kids there because they are going to act like, umm, kids?! Do you realize there is no logic behind anything you just said. I love how you keep saying my living room. No sweetie, its \"our\" living room and you knew he had all these kids prior to moving in with him. Because you feel awkward, his supposed kick his kids out? How about you go somewhere for the weekend. However why are you 27 dating a man 50 with kids older than you!", "Hmmm I wonder why your the YTAH. Let me see .\n Your bitching that your gonna lose YOUR LIVING ROOM. Um hello it's their living room aka bedroom \nYou are awkward around his kids. That's because they are close to your age lady\nYou seem to be one of those selfish types that thinks that when they get a man it's all about you. The fact that he has 8 kids and he's very active in there lives is amazing and if you don't like it see yourself to the 🚪\nGet a reality check. It's not all about you. He's loves his kids and grandkids.", "You can't be serious. This isn't about a sleepover. You two are in totally different life stages that are wildly incompatible. You're 27 dating a 50 year old GRANDFATHER. What the actual fruit did you think life would be like with him? What kind of future do you see with him?", "This is disgusting.. yikes", "What are you thinking? 8 kids? 13 year gap? Did the sea run out of fish?", "YTA\n\nYou’ve chosen to date and move in with a man who is old enough to be your father. With that, comes the fact that he has children and grandchildren. You can’t expect for him to never have them over because you don’t like it. You really don’t get a choice in the matter. If you don’t want children staying in the apartment you’re living in, don’t date a man with children.", "NTA, but girl, RUN! This is an alarming age difference and your discomfort with his kids is not going to get better. He’s not consulting you about your shared living space and I don’t doubt he’s using his age/“experience” to claim he has more of a right to the choice than you do. Move out and go somewhere your comfort will be prioritized. \n\nEveryone that’s calling you the AH is completely ignoring the fact that his kids DONT live with him and it was reasonable for you to assume the amount of contact you had with them would stay relatively the same. \n\nThis also isn’t a situation where “he’s old enough to be your father” but is a situation where you are literally younger than some of his children!", "I can understand why you don’t want 6 kids sleeping in your living room for a sleepover when you live in a 1 bedroom apartment BUT who have chosen to have a relationship with a man with 8 kids and with grandkids. And then you chose to move in with him, into his 1 bedroom apartment. So what were you expecting to happen? This was totally foreseeable. YTA", "NTA because this sounds like a terrible arrangement for you but… why are you with this man who’s almost double your age? and has kids older than you? and kids with multiple women?\n\nIf he and his daughter think this is not your business then you’ve probably realized your place in their lives. YWBTA if you stay with this man.", "YTA. What did you think would happen with living with a guy with that many kids from different women and that age range. Are you planning baby #9. Is he even paying child support for all of them. Either get with the program of having the kids around all the time or move out. Simple as that", "Can't help but inwardly groan everytime I see a post about someone not wanting their partners kids to be part of their lives.\nDon't have a boyfriend with kids, that's the solution here.\nYTA", "Man, posts like this are why we need a new voting option. YAI - you're an idiot. You put yourself in this ridiculous situation and somehow you're surprised with the outcome.", "So even his 15 year old daughter doesn’t respect you?😂😭Girl move out if you can, and break up with the grandpa", "Break up", "Yta. Im ignoring the age gap thing as you're both grown, so it's up to yourselves. You chose a father of 8 children + grandkids. It sounds like he loves them & loves spending time with them. Why would he ask you if its ok to spend time with his children in their home. He might only be able to afford a 1 bedroom after child support, but his home is their home the same way it would be if he lived in a mansion & they each had their own bedroom. You've moved into their home & want to be asked if it's OK if they stay?", "You don’t have a kid/grandkid problem, you have the wrong boyfriend. You need to find someone closer to your age that has the same priorities you have. \nYTA for dating someone old enough to be your father and not wanting him to act like a father.", "You are not doing yourself any favors dating someone 23 years your senior. Age wise, you would be better suited as his child. He is a clearly a predator dating someone old enough to be his child, but YTA for wanting to restrict his relationship with his grandchildren. You 200% knew what you were getting yourself into dating a middle aged man with kids older than you. You do not have a say at all in his relationship with them. If you don’t want to spend this much time with them, move out or break up.", "YTA. He is their father. They should always be welcome in his home. As should his grandchildren. If you attempt to interfere with this, you will regret it. He is not likely to uninvite his children and grandchildren to his home to accommodate your comfort level.", "ESH. You knowingly dated and then moved in with a parent. The kids visiting regularly should have been expected. That being said having 8 people in a one bedroom flat is gonna be cramped AF and as a parent I doubt I'd allow it. Just make plans that weekend. Go have dinner and drinks with friends etc.", "You are NTA for not wanting them over. You live in a one-bedroom apartment and having that many kids over, especially when you were given no say, sounds miserable.\n\nAs an aside, there are way too many red flags here. Your bf is more than 20 years older than you, has a bunch of kids from other women, has grandkids older than some of his younger kids, has kids older than you are, and only has a one-bedroom apartment. If your long-term plans do not involve being his next baby mama, look for the exit.", "NTA. Putting age gaps and children aside, 8 people sharing a 1 bed apartment for a weekend is a nightmare. Especially if you know you are going to be relegated to staying in your bedroom and cleaning up after them - it's not fair or sanitary. Why couldn't he hire a big AirBnB and spend a weekend with them? I would be reconsidering my relationship with him if you are just going to be treated like this.", "YTA and  have you need to have your daddy issues checked by a therapist", "NTA. I’m gonna be real - I don’t know you two, but it’s pretty easy to judge your boyfriend, his 8 kids, and having none that live with him. It sounds like he has a habit of not taking responsibility.\n\nIf I were you I would be very protective to make sure the same thing doesn’t happen to you, that his life choices become your responsibility to take care of. \n\nIt’s fine to date someone for fun and not want all of the baggage they travel with. If you were married, the story would be different, but you’re not.", "NTA.  Having that many people stay over, or even just one person staying over regularly in a ONE bedroom apartment isn't reasonable.  It's your space too and it sounds like he isn't respectful of your need to have a home too.\nI'm not a fan of all the people saying YTA because his kids come first.  You're not asking him to abandon his kids for you.  His kids can't get 100% of his attention whilst you get nothing... and you're being as good as squashed out of your own home here to accommodate older kids.  He's TA, and so are some of the kids.", "Hmmm NTA, I mean, yes, you moved in with a man with kids, but also, you’re sharing a home, you’re partners now, so he should ask before making these type of plans that take over your whole place. And you don’t *have* to clean up after them, tell him to do it, they’re his kids and he invited them over. Maybe a serious conversation about boundaries for the both of you would be a good idea.\n\nThe post is about the kids sleeping over, not sure why everyone is judging the age gap. I usually am very judgy about age gaps, specially when the young person is almost a teenager, but a 27 year old is perfectly capable of deciding to date an older person.", "How do you split the bills?\n\nINFO", "YTA and not mature enough to be with someone who has children", "YTA. I’m the same age as your boyfriend and I would run away without looking back. Why are you in this relationship?", "If you won’t leave the relationship I would leave for the weekend.  Go have a girls weekend somewhere and let the mess and food and entertainment be his problem.   Might even be good for their bonding since it sounds like it rarely happens.  \nReally think this out.  8 kids plus grand children with the numbers only increasing - do you really want this at 27?", "Honestly your bf has wayyyy too much baggage. Why are you with him? \nAren’t there any men your age who are able to give you more time and attention?\n\nYTA because a good parent always puts their kids first. \n\n8 kids! What a total nightmare. Girl you need to respect yourself. Do better!", "ESH. You’re right, if you live together you should be able to set norms that work for both of you about the space. But you’re wrong to think your norms are going to be established in your favor with a person who has been a father longer than you’ve been alive. He can’t “restart/reset” with you the way you can with him.\n\nAlso, like… maybe triple check and quadruple lock whatever birth control y’all are using bc 😳 at this man", "YTA for the way you handled it. He had 8 kids before you arrived on the scene. He can have his kids over. If you don't want to be there, that's fine. Go have a girls weekend or visit family or take yourself to a hotel.", "NTA for not wanting this sprung on you, but you shouldn’t be dating a guy with kids if you don’t like his kids.", "NTA for not wanting this sprung on you, but you shouldn’t be dating a guy with kids if you don’t like his kids. He’s going to want to see his kids with you involved. Overall YTA.", "This is why age gap relationship are a bad idea", "YTA. You are in a relationship with an individual who has children, they are going to be around whether you like it or not. Should he have maybe asked? I guess.", "He is 50 with 8, two of which are older than you. He is also a grandfather with bunch of GRANDkids…  YOU ARE 27 with you whole life ahead of you, with no baggage.\n\nNot only is he forcing you to share a 1 bedroom apartment with must of his kids and grandchildren but he is telling you, he is ordering you to suck it up. \nIf you don’t see how messed up this is you are too far gone for help. \n\nNTA", "Wtf, why are you with someone 23 years older??? Gross. YTA.", "NTA why don't you just stay with a friend over that weekend so you aren't hooked into doing the things you don't want? You can tell your boyfriend it's so you won't ruin any of their boy time fun and he can't complain.", "Oh my god please say you’re on really good birth control.", "Honestly the kids sleeping over is the least concerning thing you’ve described in this scenario.", "YTA. You’re dating a man who has EIGHT kids who aren’t going anywhere. If you didn’t like them or want them around you should NOT have moved in with him and you really shouldn’t be dating him in general. Book yourself into a hotel and re evaluate your selfish views. You don’t outrank his children. You’re also awkward around his kids because some of them are older than you and you for some reason think you have any authority over any of his kids???? Get over yourself.", "YTA and your boyfriend is gross.", "I'm 26 f and wouldn't go near 50 year old OR any guy with 8 kids. Yet alone both together. The f are you doing.", "Can you re-read what you wrote? It’s a shit show. You are dating a guy who could be your father who has been dropping his seed all over the place. He sounds like a catch.", "YTA you moved in with a man with kids. They come before you. Also is it not a red flag that you’re younger then some of his kids, plus he has kids with multiple woman. What’s wrong with you that you think that’s good enough for you?", "Don’t date dudes with kids/grandkids if you don’t like them staying over…I’ll go with ESH, he needs a bigger place if he’s having his kids sleep over, you need to not live with him if his kid’s staying over is an issue", "YTA\n\nYou don't want to be around his kids, it reminds you of how much older he is, how he's lived a full life before you, annnnd you don't like kids. Just be honest. It's his apartment, on top of it all! You just moved in! You knew the score before you moved in, you don't get to dictate the changes now.", "YTA. I truly wonder why they don’t like you…..🤔", "These are his kids, they come first.\n\nWhy put yourself in a position where you’re with someone where you are #8 at best when your preference is much higher than that? There’s nothing wrong with you wanting to come first, it’s just that you’ll never get that with this person.\n\nThis is a really hard verdict but I’m going to have to go with NAH. But you are really just not compatible IMO.", "YTA - really is this how your want to live your life", "YTA because you thought you could keep the kids at a distance while living with an active father. You are literally dating somebody's grandpa, grandpas love spoiling kids.", "NTA .    One bedroom @ assume one bathroom.., I would be heading to a hotel for the duration", "Not a chance in hell this is real", "YTA.  They are his children/grandchildren.   And you moved in with him.   Move out if you don't like it.", "YTA\nTalk about a Gold Digger with Daddy issues.\nMy....God.", "ESH\n\nYou clearly aren't bringing much to the relationship table. You moved into his space and I'm guessing you don't bring much money with you, or together you probably could have afforded a bigger space. You also should have known that the dynamic with a Dad would be different than a single man, and his kids need to come first.\n\nThat said. This is not a good man, and not a good dad. He has 8 kids. If he's 50 and his kids are in thier 30s then he started having them under 20. He has multiple baby mamas. All of these are big Ole red flags. \n\nBut maybe he's changed with age? Seems unlikely.  He should have asked you or at least brought it up privately. That would be expected even in a roommate situation, let alone a relationship.  \n\nHe's also teaching his kids that they don't have to respect you. It honestly sounds like he's with you because you are at least semi dependant on him and he can do as he pleases to you. \n\nGet out. Before he gets you preggers. And he will.", "This dude must be amazing at something…. Doesn’t matter what, I’m just befuddled at why you thought living with a man with 8 kids + grandchildren who lives in a 1 bedroom apartment was going to result in any type of harmonious living arrangement. ESH", "oh my God!  forget the ages!!  all those boys in a 1 bedroom/1 bathroom??? and you're going to have to clean and make sure they have food?? that's a BIG NO from me. go to a friend's house for the weekend and look into getting your own place.", "ESH- hes clearly an involved dad but you shouldn't have to clean up after his walking STDs and cook for them. Just leave that weekend, simple. Or uh, don't date dads.", "YTA - I think you should rent a hotel room for the week-end and leave this family live like a family.", "No judgment, but listen, this is who he is, his way or, well, nothing, it's just going to be his way. Eventually it will be the highway or in all honesty worse. And since you're already coming to Reddit to get a read on a situation you knew already was wrong, I think you already know what the future looks like, in my opinion. \n\nLook after you, not him", "Can you arrange to hang with family or friends that night? Refuse to clean the mess they make?\n\nI personally think this is a lot deeper than this 1 sleepover, you need to figure out if you can handle his family dynamics for the rest of your life because they aren't going anywhere and you being awkward and uncomfortable around them won't get better unless you all try, well mainly you. I'm not making a judgement because I think shit is deeper.\n\nOh, use protection and maybe seek some therapy.", "NAH but he’s got a lifestyle going here and you can join the circus or resent it.  If you aren’t pregnant yet, I really think you should go.  You don’t want the life he has.", "ESH. The guy has 8 kids with a 20+ year age range, actually seems to be doing an OK job with his kids, but you're upset that he doesn't prioritise you? Sounds like you never stood a chance.", "ESH - why are you cohabitating with someone that has so many children when you know you don't like that many kids? Why is a middle aged man living in a 1bdr apt when he has so many kids that visit him?", "You moved into his house.", "YTA. If you don't like it when kids sleep over why are you dating a man 23 years older than you with 8 kids, multiple grand kids, and multiple baby mamas?? This is some ridiculous, short sighted, and given the huge age difference extremely creepy bullshit.", "INFO: are you purposefully ignoring the red flags or what?", "This entire post reads like a fever dream. The age gap. The number of folks you’re trying to fit into a one bedroom. You moved in to HIS home knowing his situation and thought your presence would change it? What in the fuck are you thinking?\n\nYTA", "YTA!!! Why TF do people date people with kids and then throw a fit when their partner wants to be with their children. \n\nOf course YTA they’re his freaking children. Grow up", "YTA.  What did you seriously expect getting involved with someone with 8 kids who is considerably older and with many years of baggage?   Date someone your own age FFS", "YTA for dating a man with 8 kids and two of them are older than you. Sounds like he regularly has his kids spend the night so, so you should’ve considered this when you moved in.", "YTA \n\nYou are younger  than your boyfriends  oldest kids, he has grandkids and you aren't comfortable  around them..  where do you see this relationship going? This situation  will never improve for you.", "She calls it “my house” but I’d bet money it’s actually his house.", "You chose to date a 50 year old with kids and grandkids. Honestly don’t know what you expected. He enjoys bonding with them and that bonding shouldn’t be limited just because you aren’t prepared for it. YTA, and maybe reconsider this relationship… I would not be settling at 27 for a 1 bedroom apartment with a man halfway through his life span and dealing with this many kids that aren’t even mine", "I thought the whole point of dating someone who is 23 years older than you is financial stability… and he’s got you all in a one bedroom apartment?? I think you need to extricate yourself before you become mom to kid number 9 and the problems get 100 times worse\n\nESH", "Um, what did you expect when yuo moved in with a guy who has kids and grandkids he's actively involved with? I don't think YTA for not wanting them over but if you stay in this relationship it's just the way it is. YWBTA if you try to stop him from having them over.", "🚩🚩🚩🚩🚩🚩🚩🚩🚩 YTA for not recognizing the shit show that you're wrapped up in. Get out and don't look back.", "What do you expect being with a man with many kids who have different mothers?", "YTA.  If you're not prepared to date a man who has multiple kids who are going to be around, then you should rethink your relationship.  If you're not ready to play house, then you should end it.", "YTA. Those are his kids and they are more important to him than you are, at least for now.\n\nDon’t date old men with 8 kids of you don’t want 8 kids to become a major part of your life.", "Do you feel weird about his kids because two of them are older than you? You should maybe just reconsider this relationship.", "YTA. You moved in with a man with 8 kids and should have anticipated they’d be visiting in your tiny apartment. Don’t get yourself into a situation you knew was going to happen and then act surprised and hurt.", "YTA\n\nYoure choosing to date a guy with 8 kids, you cant complain that he spends time with those 8 kids and occasionally invites them round his house. You cant choose to date a guy with 8 kids, and then tell them he isnt allowed to spend time with them. Thats not how it works...\n\nIf you dont want to be around kids, dont date a guy with kids.", "Girl breakup with him you guys are at different points in your life.Get an apartment.  He’s got way too many kids and I’d hate to see you add to his total.", "Your boyfriend has 9 kids, op.\nHe’s also a creep to pray on someone your age. \n\nBut be that as it may, you chose a grandpa wit kids and grandkids. Kids that have a relationship with him. As any (future) stepparent knows, they are part of the package. \nYTA", "NTA, but the bigger issue is that you seem to be in a very weird relationship. Like you don't just ignore red flags, but took a tour of the factory where they make red flags and thought \"This is fine!\". Rethink your life choices and get out.", "What the heck are you doing with a man approaching pensionable age when you are a young woman? His kids are older than you…it may not feel such a huge gap now but when you’re 50 and he’s in his 70’s his kids will be almost in their 60’s. If he doesn’t care about your feelings now do you honestly in your heart of hearts think he will change and you’ll suddenly become a priority? Honestly love, do yourself a favour and and take a real close look at what this relationship can offer you,", "Well he doesn’t care what you think because you are just the bangmaid. You need to evaluate your priorities and self respect and think about if this is really a good relationship for you.", "INFO:\n\nWhat does this dude have magic Dik or something!? \n\nHow does he have THAT many kids and still manage to get a 27 yrs old GF AND move in with you?", "WHY are you dating a man almost twice your age with *eight kids* when you are \"not super comfortable\" around his kids?\n\nEverything about this is wrong. He is dating someone younger than his children. You are mad that he \"told you\" that his children would be staying it what, I will assume, is his house. \n\nYou should not be in this relationship... but since you are, than YTA. He has kids, they're a part of his life. If you can't handle that, you shouldn't be in a relationship with a 50 year old man.", "YTA. You moved in with him and decided to play house. You know he's got a herd of kids. They're a package deal.  Move out and support yourself or pipe down.", "YTA. To yourself. What a crappy life you set up for yourself. Your bf is a loser who could be your loser dad and you allow him to make your life pathetic. Move on and away. I don't even care about his kids sleeping over or not, the fact you allow this clown to be part of your life is just blurgh.", "Yes YTA they’re his kids and grandkids. You moved in with him, this is what he and his family do 🤷🏻‍♀️ they can’t be expected to change their family time just because you’ve moved in", "He has 8 kids, and still go for women younger than his adult ones. His oldest is older than you, you seriously don’t think this is a problem?", "ESH. You’re with a dude who has children that are older than you… he has 8 kids with different mothers! Why would you even desire this dude in the first place?? You moved into HIS apartment. And you should’ve been prepared to also take on kids if you’re getting with someone who has kids.", "8 kids, grandchildren, multiple mums, your opinion not counting, one tiny home, him 22 years older… looking for mom of kid number 9?\nNewborn and teenage boys camping in the living room?\nEeek… leave soon", ">Despite the fact none of his kids live with him he is very involved in their lives\n \nyes, because he's their father, what did you expect?\n\n>Honestly I'm not super comfortable around my boyfriend's kids and can be awkward with them\n\nthen why did you get involved with a man with kids? \n\nyou are 27, and while I don't think it's okay to get involved with a man 22 years older than you, you are old enough to know where you got involved. Did you expect this man to have you as a priority rather than his children?\n\n\nYes. YTA.", "YTA because you’ve moved in with a Grandad who has a load of kids and grandkids and you’re kicking up a fuss that he wants to spend time with them all. YTA because you didn’t preempt that moving into a 1 bed apartment would mean there would definitely be times that the whole family would swing by. YTA because you’re essentially Grandma now and if you’re not comfortable with that or being part of this family then just get out (before you get stuck giving birth to kid number 9)", "YTA - my boyfriend (50M) and I (27F)", "Nta mostly because it's a 1bdr apartment this just sounds like way too many people and if you are cleaning up after them that's just alot to handle", "Why are you with him?  Seriously", "You don't like children and so you want your partner to be a deadbeat dad and no longer be in his children's lives. YTA.", "YTA. YOU moved into his space. He has a shit ton of kids what did you expect? Is this a daddy issue thing that you would date a man nearly twice your age with multiple kids by multiple women?", "YTA. All the other questionable stuff aside. You don’t date people with children and then expect them to change their routine and relationship to accommodate you. The children and grandchildren will and should always come first. You have to learn to be okay with that.", "He is a father and he does need to prioritize her kids. They are probably the only lasting relationship he has.", "that’s your father lmao", "You moved in with a guy 23 years your senior, with 8 children (some children older than you), and never even had a realization or discussion on what his family life entailed?\n\nYTA, for the sleepover objection and so so much more. What on god’s green earth were you thinking when you got yourself into this, exactly?", "Is this a joke?\n\nYTA to yourself for dating your grandfather and the complaining about it. What part of this fiasco sounded like a good idea?", "Ewwww YTA", "Point blank - You guys are not compatible. \nIt was an extremely short sighted and immature decision to move in with someone who had EIGHT children and grandchildren who you don’t want to see. Eight kids would and should be a dealbreaker for most relationships. That’s just insane, no offense. \n\nMy judgement, ESH. Your BF for being a breeder, and you for moving in with him hoping he wouldn’t be *highly* involved in his kids lives. Unless you’re leaving out other major details this is something that only the most immature person wouldn’t have discussed before moving in together. Im sorry.", "Moving into a 1BR apartment with a 50 year old man who has 8 children as a 27-year-old woman is pretty interesting.", "You chose to date a man with several children and grandchildren and then try to make demands on his visits. Either deal with it or leave tbh, YTA and I don't normally comment on age gaps but be has children **older** than you. What on earth could you two have in common?", "Just stay with a friend that weekend or get a nice hotel room and treat yourself to a getaway. He loves his kids and they are gonna be in your life. Get over it", "YTDA- you're the dumbass. Seriously", "What the hell are you doing with a man who has 8 kids if you don’t want to include them and treat them as family? And don’t get pregnant, I don’t think he can afford more child support. Maybe he’s rich?", "Time to go. You have NO power in this relationship.", "ESH.\n\nI’ve seen less obviously glaring flags at NASCAR.\n\nWhy are you dating a man almost twice your age with eight kids by different mothers?\n\nYou *chose* to move in with him, knowing he had eight kids. Is it not a sign of trouble that not *one* of them lives with him?\n\nHe should not be calling the shots without consulting you first, but it’s highly unrealistic of you to expect that they won’t be spending the night in a group of one or more. They’re his *kids* and they deserve to be with their dad if they wish. There’s multiple younger ones *on top* of grandchildren.\n\nGet the hell out of dodge before you wind up with his ninth and tenth.", "Get out. A friend. Your momma. A shelter. Just get out.", "50 years old, Kids in his 30s and a 13 year old grandchild.\n\n\nHoly Moly", "I hope to Zeus you have gotten your tubes tied. \n\nPlease don't give this man his ninth child so you can move out, move on, and put this boyfriend in folder labeled \"youthful mistakes.\" Get as far away as you can from this life has too many complications for someone in their twenties who should be finding themselves and building their own life, not making themselves smaller for someone else's. \n\nNTA. Good luck.", "I wouldn’t say that YTA as much as I would say that you are probably too young/immature to be in a relationship with someone with kids. \n\nYes, you live full time in their father’s house but you are not the boss of it or of when and how many of his children can visit. \n\nThat said, it is also not your responsibility to feed them and take care of them. Although a good step parent would do it cheerfully and develop a relationship with them, it might be better for you to get your own place or hang out at a friend’s place when his children are in their father’s home.", "What is this post? Girl, gtfo there\nYou're almost half his age with 1) a lot of kids and 2) some who are OLDER THAN YOU\nNot a life you deserve", "NTA. It’s not weird to not want to have your siblings sleeping over with you on the weekends. Your boyfriend sounds gross.", "YTA because you chose to move in with him knowing that he has children and grandchildren. If you don’t like it, live in your own separate home.", "Girl, wake up! He is too old for you and got too many kids, some even older than you. You must be color blind because you're missing all those red flags. NTA and gtfo of there ASAP, yikes.", "YTA. You must have known what you were getting into when you moved in with a man twice your age with a one-bedroom apartment and 8 children. That's...a lot. They are probably a bit uncomfortable with you also with you being so much closer to their age. It's so creepy. \n\nAside from that - where do you really see this relationship going? Do you want kids of your own? Do you want to future with a crowd of children and young adults constantly camped out in your living room?", "You're just the next in a line of women for this dude. Why are you with a man old enough to be your dad? Why are you with someone with that many offspring? Will you be next?\n\nYWBTA to yourself if you stay with this guy. When you're his age, you'll realize it's kinda gross to date people younger than your children.", "You are dating a 50 year old man, with 8 children, who lives in a 1 bedroom apartment.  What future is this for you. ?", "So.... are you looking g to be his next baby mama??", "Red flag #1. He had 8 kids. That’s the only red flag you need.", "ESH. But I don't think you need to put up with it. Let them do their thing and book a hotel or Airbnb for yourself that weekend and let him do it on his own.", "ALSO. Your boyfriend is a predator. Just FYI", "Look– ignoring the fact that this man is twice your age and has children older than you with children of their own– why did you decide to date a man with 5 minor children if you weren’t prepared to be a step-mom (literally a parent by choice) and accept those children? Did you think it was a great deal because none of them actually lived with him? Did you think they would never visit? What are you going to do if something changes and one (or more) of those children move in with him? If what you want is the peace of your own home then you should understand that a man with children, especially so many, was never for you. Move out. YTA.", "You have got to be kidding me.", "YTA...for moving in with someone who has multiple small children that he has partial custody of. If you didn't want to have THAT many kids in your living space in rotating fashion, you should not have moved in with a partner with THAT many kids. You are not wrong for feeling the way you do, but you chose this option, so put ya big girl panties on and deal with consequences of your decisions. You don't get to change the terms and agreements of his life just because you don't want to play live in babysitter. You are smart enough to know what hellscape you signed up for. If not let me disabuse you of your misconceptions: kids first; partner younger than his oldest, second. Get used to it or get a better partner. \n\nHave you ever thought about the fact that no one his age was WILLING to put up with that level of home disruption? .", "ESH\n\nHim for dating someone younger than his kids\n\nYou for dating a dad and being surprised when he does dad things", "So everyone here saying YTA but because you went and moved in with a dude twice your age. But you’re not the AH for trying to have a say of what happens in the home you both live in.  All these people acting like just because you moved in with him, you must shut up. I wonder if they did the same when they moved in with someone or someone moved in with them. You don’t say anything about utilities or even splitting rent so we can’t all just assume. If you don’t want to leave him because “reasons” then just go stay elsewhere that weekend so you don’t have to clean up after them. If you come back and it’s a mess, leave it to make a point. Honestly he has A LOT of baggage, life experience, hell kids and you have zip in comparison. Just cut your losses and break up. He already let’s his minor child disrespect you and that’s a preview of what life will be with them.", "Yta. If you date someone with kids, you can expect them to be in your life. Either get over it or let your man find someone who wants him to be involved with his kids.", "Why would you date a guy who's way older than you with that many kids and custody of none of them? He should at least have a two-bedroom with that many kids coming and going for fire safety reasons.\n\nIt doesn't even sound like the kids necessarily care about seeing him, more so each other. IMO, he doesn't sound like much of a parent or partner, and you should be smarter than to sign up for that long-term.", "YTA. You chose to move in with a man who has 8 kids and grandchildren. If you don’t want them in your life, the you shouldn’t have him in yours.", "Nah. Break up.", "Why are you dating a man with kids that are older than you? \n\nYTA he is a man with kids. You wanted to date him, and to move in with him, so you take care of them.", "INFO: Why are you dating a man who is almost TWICE your age *and* has EIGHT CHILDREN?  Please don't become another baby momma for this guy.  Yeesh.", "I stopped reading after realising you’re younger than his sons. A 50yo man with tons of kids and still live in an 1 bedroom apartment, what a catch…", "If you dont wanna be a grandma why are you dating a grandpa lol", "Yta. When you play stupid games you win stupid prizes. Shocked you didn’t see this coming…wonder how many other red flags you rushed passed before arriving here as well.", "Maybe find a guy that doesn't have 8 kids,  so he can afford a larger apartment so you have more space.", "Why the fuck are you dating someone 23 years older", "Ewwwww", "Nah\n\nThis is what you are signing up for. If you don’t want this - exit stage right. Talk with him and figure out a way to make this work - or just end it as amicably as possible.", "NTA BUT…..u have no business living with this guy and if you can’t admire what a wonderful Dad he is you really shouldn’t be in this relationship. His 1st priority is to his kids and not you. So unless you learn to be ok with playing 2nd fiddle to all of them you really should not have moved in and never made plans to spend the prime years of your life with him", "You are not at a place in your life where you should be with someone who has a full-blown family. He literally has grandchildren. He wants to spent time with his children and grandchildren.", "YTA.... This is something parents do to spend time with their kids. Why do you assume you'll have to take care of food and cleaning? Was he a messy person who didn't feed his own kids before you came around? I get that it's a lot of people in a small place but you had to have known ahead of time this was a possibility. Maybe spend the weekend at a hotel so he can enjoy time with his kids and you can have some peace and quiet.", "Soft YTA imo. His lifestyle with his kids isn't unreasonable, he wants to hang out with them and I think it's great they have such a healthy relationship. I think you need to take a good hard look at if this is what you want in a relationship. He's not gonna see his kids any less, babes. It doesn't seem like your lifestyles are compatible- that being said, it's unreasonable for you to ask him to see his kids any less just because you're an inflexible person. I could see you happier someplace else.", "ESH. Why are you dating a man with older kids than you? A man in his 50s with 8 kids and a one  bedroom apartment doesn’t sound like a catch and of course you don’t find it comfortable when they are around because they could LITERALLY BE YOUR SIBLINGS!!!! Honey are you colourblind because those flags around you are red.", "NTA but you went about it the wrong way. Just show him. Stay in your room. Relax. Make him make sure everyone has enough food. Make him clean up. Do absolutely nothing but relax. Then next time he won't be like this.", "Get. Out.", "ESH. Your boyfriend because he is dating someone so much younger. You because you moved in with a man who has so many children and is involved. What did you think was going to happen? \n\n>She thinks \"is it really any of your business though?\"\n\nHis daughter is right. You don't like it, move out. And please make better choices.", "Yta\n\nThis is funny as fuck holy shit", "think about the good part! soon will be your children with his next girlfriend doing the camping, i dont think with that amount of kids and exs you will get much more time with him! YTA", "YTA- you knew he was old and had a shit ton of kids when you got with him.", "INFO:  Why are you here?", "YTA for not expecting that a man with 8 kids would sometimes want them to stay over with him. \n\nI'm not even getting into the age difference, different expectations, or any of that. This is just a simple family dynamics issue you should have expected.", "NTA, but this isn't a relationship you should be in. You aren't respected by your bf, or his kids.\n\nThe age is weird for me, but you're nearly 30, so whatever. The issue I have is that he's teaching his younger kids that you don't deserve respect. And that's wrong. He's teaching his daughters that their opinions won't matter over the opinion of men. \n\nThe guy is just, not a good person. If you're name isn't on the lease, move out. If only your name is on the lease, issue him an eviction notice that is legal for where you live and end the relationship. This isn't healthy, and his behavior tells me that he'll likely leave you once younget pregnant too.", "All your red flags are in paragraph 1. Reread it and then re-evaluate your relationship.", "Perhaps don't move in with a senior citizen who's too stupid or too proud to wear a condom. Like girl, what the fuck are you doing here. What is this clownery. YTA just because you're a big time sucker", "YTA why are you doing this to yourself?", "Oh look another woman dating a man twice her age with kids that doesn’t want to be around the kids. Look, I don’t blame you for not wanting all those kids around but then don’t date a man with 8 kids! YTA.", "YTA. He had kids when you met him. What did you think that would look like? I don’t understand people that find it attractive when their partner doesn’t want to be around his/her own kids.", "YTA it's his house", "your bf is not a good parent. \nFirst. He has all these kids and grandkids, and is living in a 1 bedroom? He should have a place that gives the kids space of their own. Not a living room floor. That's ridiculous. \nSecond, if it is also your place,  you should get a vote.  But if he had a reasonable place to accommodate his kids,  it wouldn't be as big an issue. \nThird,  he is twice your age.  There's a reason he is with someone your age. He has all these kids with how many women, so really.  what's the attraction? His child support must be high since he can't do overnight or share time with the kids. \nLastly, he sided with his 15 year old against you.   \n\nThings to ponder....\n\nEdited for corrections", "Too much marinara on both sides", "ESH\n\nNot A-H for not wanting the responsibilities for 6 teenage boys in your livingroom for a weekend.  A one bedroom is completely the WRONG for a situation where kids are constantly spending weekends there.  \n\nYou are dating a man with sons older than you--this might be part of the family dynamics issue.  But your Boyfriend, is completely not respecting your rights as a tenant in the home AND his girlfriend.  You should have a say, especially, since it sounds like you are being used as their personal made(boyfriend and his kids/grandkids).\n\nAlready his daughter feels it's appropriate to tell you it's not your business who shares your home?  Is it not?  \n\nIs this the future you want?  Do you think that the kids will ever accept and respect you?  What happens if you have a child with him?  How will your child be treated then?  How will your child learn to treat you?", "You are dating a man that not only could EASILY be your father but that actually is the father of men actually older than you? Also he is the father of EIGHT??\n\nI have no words. I feel for you.", "Yta if you stay with him dump him that will solve your problems.", "YTA you choose to have a relationship with a man almost twice your age with 8 children and grandchildren.  \n\nthe children come as a package, if you don’t like it move out and end the relationship. You should probably do so anyway before you are the next baby mommy", "Wooooow.", "YTA.", "I’m less concerned with whether you’re the asshole or not and more concerned that you’re dating an old man with children by several different women. Are you trying to ruin your life?", "Yta I hate to tell you sweetie that is not “your living room” that’s your partners apartment you moved into, you’re lucky he didn’t pull the this is my place card on you. You knew this man had that many young kids before you moved in and it was going to be a high possibility of them coming over to stay. If you have a issue with cleaning up behind them then don’t, let your partner know that and stick to it..and if his kids coming over is really truly bothersome to you maybe you need to find a different relationship instead of trying to come between a man and his kids..\n\nBtw your reasons aren’t logical at all makes you seem like a bit*h whose jealous of his kids.. so rethink all of your silly “reasons” for not wanting his kids at “his” apartment.", "Nta. You are their new step mama they should listen and obey you. What mama says goes everyone knows that. Maybe if it doesn’t work out with their dad you can pick your choice of his children!", "An old man with 8 kids with several women. Sounds like a catch.", "Normally I’m inclined to agree, but she moved into HIS apartment, and now is saying “I don’t want your kids doing kid things in my apartment”. So definitely a YTA from me lol.\n\nBut I agree with the main part of your comment. If I were one of the kids, I also would feel weird around OP, to be 100% honest. Nothing on OP tho. Just such a weird dynamic.", "TBF, no woman his age is going to go anywhere near that. We know our worth, and we sure af aren't prolonging our child rearing years.\nETA Y T A. Not for not wanting a pack of wild, smelly, boys in the house that you'll wind up taking care of, but for putting yourself in this position.", "she CHOSE to date a man almost twice her age who has 8 kids, with two of them being older than her, she then CHOSE to move into HIS home knowing that his kids stay over sometimes. I get it, I also wouldn't want 6 teenage boys running around my living room but she put herself into this situation. She's TA if she didn't want to deal with this, why move in with him, why date him in the first place?", "Maybe she thought his kids would be respectful. But it looks like they are taking after their dad.", "It’s awkward because she’s younger then his children", "8 kids from several different moms! And he is 23 years older than her, with grandkids and kid as young as 10.\n\nDid she really think she was gonna come first?\n\nPlus, SHE MOVED into his 1 bedroom apt. He probably can't  afford a bigger place due to child support.\n\nOP,  YTA. Why date and live w/someone with MINOR kids when you clearly don't like them and refuse to accept that YOU DO NOT COME BEFORE HIS KIDS. \n\nLeave him already!", "Good father? In what universe not cooking for your kids or cleaning after them (or asking them to clean after themselves) is a good father? He is a self-serving AH, who wants to be a 'good' dad at the expense of his partner", "It is her business, as her asshole partner who you all seem to defend expects her to clean after his kids (clearly he has no interest in parenting them and making to clean after themselves) or cook for them. Nice to be a 'great' dad at the expense of your partner!", "If they come before, why doesn't he clean after them or cook for them himself? Why you all defend her asshole partner is beyond me", "I almost cried from laughing at your comment, “getting upset with PopPoP. 🤣", "Amen", "So it's her fault he chooses to invite a kindergarten home and doesn't bother with making them clean after themselves or cooking for them?", "EXACTLY!!!! She is acting immature and possessive. This is why has a single mom, I prefer to date a man who has kids because he understands. Its alot more difficult when they dont have any", "Not just some children, 8 children!", "He….. sounds like a good dad??????? Where", "Announcing you’re having six teens to stay over in the one bedroom you share with your partner is really dickish and the parent card doesn’t cut it. He should have said “this is what I’m planning, when would be a good weekend ?” And “of course I’ll take care of prepping and cleanup”. ESH because yeah she doesn’t want to deal with the kids at all and therefore shouldn’t be with a dude with kids, but him making unilateral decisions about their living space & expecting her to clean up after his kids is also asshole behavior.", "I agree 💯\n\nAnd is not her living room, that's his\n\nShe moved in to his place\n\nAnd six kids in a living room is rough, but she chose to move in with him knowing the situation.\n\nYTA", "He would have been a good dad if he cleaned after them (or even better - made them clean after themselves!!), or was cooking for them. He is a 'good' dad, at the expense of his partner.", "OP is not an a h for not wanting multiple kids in their living room but they are one for dating and moving in with a guy who has 8 children. I don’t understand what they expected. If OP is not happy with their boyfriend having a relationship with their kids then it’s time for them to move", "He picked a girl so young because he didnt want your opinion….EVER", "Maybe because he thought that he is actually a good parent and makes his kids clean after themselves, rather than let her serve them? Also, maybe he is the one who should be cooking for them and entertaining them, since he is such a good dad?", "Why do you care how old her BF is?", "Summed up pretty well.", "How is he disrespecting her? By choosing his children? Or did I miss something?", "This is so biased. My husband was 48 and I was 28 when we met. Thank goodness everyone in my life knows my dad and so daddy issues are off the table. We just connected and see the big things the same way. It’s fun to have differences to talk about both cultural and generational. But to just assume every age gap is creepy is just ignorant and closed minded. You don’t know everyone’s inner workings. Not every man that marries a younger woman is a pervert. We were best friends before dating and still are 8 years later. I implore you to stop putting every age gap relationship into the creepo box. Sometimes it’s just an odd match that works well.", "Sad that some people go into it thinking that but even sadder when the parent concedes. My dad let his gf push us pretty far out before he finally came to grips. She’s not younger than him but just as immature and selfish as OP", "Then why doesn't he clean and cook for his mean-behaved kids himself? She is not his cook and maid.", "Why should she be comfortable around kids who don't like her and don't bother cleaning after themselves? When she agreed, she probably assumed he would be a normal parent, who actually parents them, rather than expecting the partner to clean after them and cook for them. They are your kids, make them clean after themselves ffs!", "This really is the bottom line. All the other nonsense aside, this is it.", "On what universe letting your partner, who is not the mother of your children clean after them and cooking for them is a good parent? He is a 'good' parent at her expense!", "Yeah, this is my question, too. Did you know he did activities like this before you moved in? \n\nIf you did, then yeah, this is on you. Don't try to change people's relationships with their family. \n\nIf you didn't, then this is more on him. It's not fair to be blindsided by all these visits in such a small space.", "They aren't even married.", "Naw 2 of his kids are older than her!", "I wonder if OP can just leave for the weekend. That’s what I would do.", "She is younger than his oldest child.  🤮", "Age difference doesn’t have to be a bad thing, the problem is OPs immaturity. I am one year\nOlder than my husbands oldest. But I have always put them first. When the youngest was getting married he said we couldn’t afford it (he did the finances back then) and I said we have to. We borrowed, sold, and found enough to make the trip. THE KIDS COME FIRST. Parents get this way way more than a non parent is likely to.", ">ESH\n\nHe's not an a-hole for dating someone younger, just for dating someone so immature lol", "My thoughts exactly. Op, just break it off. NTA\n\nAnd also people are brushing off that he has 8 kids but only one bedroom apartment? \nOr the fact that this guy keeps going for younger and younger women, so that he can control them? \n\n\nOp, find someone without attachments.", "She says it’s his", "It's no one's house. Her bf, who has 8 children, had a 1 bedroom apartment which she moved into.", "23 year gap", "Maybe she can date the grandchild", "Why would someone get a in a relationship with someone with kids and then literally complain about there partner being a parent, newsflash when you have young children they are more than likely going to be sleeping at your home", "Agreed. NTA, and why didn’t your husband get a place with more than one bedroom when he has 8 people who stay over often? He doesn’t sound like a great dad making them sleep in the living room with no privacy of their own.", "I was totalling going to write the daddy issue thing at the end of my comment, but I held it back LMAO", "OPdoes not indicate that the bf twisted her arms to move in w/ him. She can always move out. He barely has enough time for all those minor kids, much less a gf. The kids come 1st.\n\nEven if he had a bigger home, the revolving door of kids would be a problem for her. \n\nShe needs to find a childless man.", "There not just people they are his children.\n\nThey have a right to spend time with their father. Their needs come before hers. She can walk away", "I gasped when I saw his age, her age, the number of kids, the ages of said kids, and GRANDCHILDREN but living in a 1 bedroom.\n\nBruh, you just ignored a parade of red flags.", "Four out of five women agree!", "At this point, those aren't red flags; that's red bunting.", "Exactly my thoughts.  Does he have a lifetime supply of Score cologne or something? \n\nYTA but mostly to yourself for being in a situation like this. If he is treating you badly, it is only because he is prioritizing his actual family. Usually we celebrate this… he isn’t a deadbeat! Only reason people find him objectionable is due to the age difference, really.", "Who apparently can’t afford more than a one-bedroom apartment, so all those kids have to sleep on the couch. A catch indeed.", "He’s “so involved in their lives” that he has a one bedroom.", "He's twice her age!", "Who has a one bedroom apartment.", "Maybe she liked them originally, but they if behave like little shits she is allowed to change her mind", "Maybe actually read my comment before going off on it? Not defending the boyfriend at all. I am calling out OP for staying with a man who doesn’t think it is any of her business, and CLEARLY doesn’t value her in this relationship.", "Wtf?? That's not remotely what I said. Go pick on someone your own size.", "Well the 15 year old  daughter said it had nothing to do with OP and the man agreed. \n\nOK nothing to do with you OP so let him 100% do everything. Cooking, cleaning etc and when he kicks off because you dont pick up after all 7 of them your answer is there. Nothing to do with you.", "Eight children\n\nwho have children of their own", "1 in 4 are older than her 🤢", "Eight children and a one-bedroom apartment. What?", "And grandchildren!", "I know lol", "Yeah I'm really not ready to throw OP under the bus here. This man is GROWN and choosing to live in a ONE BEDROOM APARTMENT with his twenty-something girlfriend, when he has at least partial custody of what, like, six of his eight kids, and occasional sleepover status with his grandkids? Come on, grandpa - how exactly did he see this playing out?", "I wonder if he sprung this on her with his 15-yr-o daughter there to test her reaction. Maybe he wants to subconsciously break up with her?", "Because it’s bloody weird.", "Because dating someone who is younger than your own children is grotesque.", "Does your hubby have 8 kids (with multiple women), at least 4 grandkids AND apparently became a father at 16ish (since he's 50 and has 2 sons in their 30s)?\n\nOPs situation is far from normal or healthy.", "I never used the word \"creepy\", nor did I say or insinuate that my comment applied to \"every\" age gap relationship. so that is all you.  Your age gap relationship is healthy, good for you, it happens.\n\nI stated that they are in two different phases in life(which they certainly are) , and that he does not treat her with respect, or concern for how she feels.  I implore you to actually read what I said and not to read into what I did not say.", "You must have alot more maturity. However, he has kids older than her! You and your husband are exactly 20 yrs apart, me and my SON are exactly 20 years apart. So understand why people look at you strange. Its like me 42 dating a 22m, you would look at me funny", "I don’t think there is anything wrong with the age gap, the problem is he wants to spend time with all his kids in his tiny 1 bedroom(which is great he sounds like a great dad) and she wants nothing to do with the kids. They just aren’t compatible", "From the OP's text it's the kids who don't treat OP nicely and her 'wonderful' partner chooses to ignore it", "You are really hung up on her having to clean up after them. He has 8 children with several women living in a 1 bedroom apartment. She has a choice to leave at any time because she is actually an adult that can make that decision. She chose to date someone that is a walking red flag. She chose to put herself in that situation. If I weren't comfortable around my partners children, who will always be a part of his life and should be, then I'd walk away from that relationship. \n\nBased on his attitude and behavior, he has no respect for women and probably keeps picking younger women to date because they are easier to influence and control. She's nothing but the housekeeper at this point who he has sex with. I see being outraged on her behalf for being treated this way, but she literally put herself into this position. What did she think life with an older man and 8 children was going to be like?", "There's only so much sympathy I can muster up for a woman who moved into a one bedroom apartment with a man who's probably older than her own father, who has EIGHT children (many of them older than her), with many different women, and who didn't see this coming.", "That would be her choice to cook & clean for them. She's grown. Sounds like another example of her poor boundaries. She obviously resents these children/ teens so its hard to grasp if it's slaving away making 3 meals/ dishes etc or ordering an extra loaf & crisps when she puts in the online delivery.", "Maybe I am just too much of an optimist, but I wouldn't think asking a parent if they spend time with their children is something you should have to do. I think the default assumption should be that their children are a part of their lives and if you go into a relationship with a parent and expect them to shun their children for you, you are AH.", "Boyfriend, you’re right, I read over that because of the context of the situation. Well shit OP is out of bounds, total AH and not wife material for this dad.", "Ah that’s why she isn’t calling him her husband. Well he’s smart not to commit to marriage yet because obviously she only wants the convenient parts of his life.", "Omg I totally missed that the first time. That seems like a wildly inappropriate gap then.", "I was thinking the same thing…I’d go away. But I also don’t think I would have dated someone with 8 kids when I was 27.", "Good suggestion", "He is kind of an AH for thinking you can fit six boys \"camping\" in the living room of a one-bedroom apartment...", "Oh yea his house his rules. I just wouldn't clean up after him", "🤦🏻‍♀️", "She moved into his apt. She should've stayed where she was. I'm sure she knew about the kids staying over before she moved in. Except it wasn't a problem then. OP is TA.", "I saw the ages and scrolled to the comments. That's all it took for me to know that this was RED FLAG WORLD", "I mean, those child support payments don't come cheap for all his different baby mommas. She should be glad he has at least the 1 bedroom at this point.", "My eyebrows were in my hair by the end of the first paragraph.", "Yeah I mean all of that and he’s broke, c’mon now", "I just interrupted a movie laughing at your comment.", "All of this! It is clear he sucks at relationships (like seriously!), but turned out to be a really good dad whose children, from multiple mothers, all like to spend time with him and each other!", "He's 50. It's more likely to be Polo or Drakkar Noir. \n\n(source: i'm close to the same age)", "She's also younger than his 2 oldest kids!", "Yeah, the \"little shits\" need to stop wanting attention from their father, coming over to visit him, and spending time with their siblings. The nerve! The shitty nerve! /s", "Doubtful", "Her boyfriend is FIFTY YEARS OLD with EIGHT kids??!?! What they have in common?? I am just genuinely curious what they see in eachother??? He could be her dad and he is a GRANDPA!!!\n\nNot saying the age gap is toxic, but just curious what their relationship is like???\n\nEDIT: didn’t see that he was grandpa already!! My bad", "25% of his kids!", "I mean he still has minor children I'm sure he couldn't afford anything bigger, but I'm sure he could afford a vasectomy. But still holy baby jebus with all the baby mommas. Like after 2 I'm walking away I'm not going to be #3 or #4 etc lol", "Damn…. Like what is the point of the relationship if you can’t accept his children?!?!? Plus grandchildren? She needs to date someone who at least has the same life stage as her, she can’t go into a relationship with a father and grandpa, and expect to be top priority", "Agreed. OP if you see this, don’t handle the groceries or cleaning up… get a hotel room Fri-Sun night, tell him to have a great weekend with his kids and to make sure they clean up when they are done and peace out for the weekend.", "Oh, I didnt know people were supposed to live their lives by your standards. Are all of your opinions gospel or do you allow for the possibility that other people have views that are as valid as your own?", "Agreed there are levels off issues here", "Ok thanks! I gotcha", "Why would you assume I would look at you funny? Literally the only details you know of me should lead you to the conclusion that I would justifiably NOT look at you weird. That’s the point, age gap should not be weird on its own. It’s like people judging us because we’re also from totally different cultures and races. It’s time we stop judging by appearance and judge on how someone IS. This age bias is ridiculous when you consider the immunity coming out of these generations. My husbands oldest is only a year younger than I. Her kid is older than mine… my mom dated a younger man (only one date she wasn’t feeling it) but I was like GO MOM! whatever makes people happy should be ok. The stigma is needs to be retired, like my husband bahahahha", "Sure, but that's not what I'm asking. I'm asking about the physical space available for longer visits. \n\nFor example, if op knew they were spending the night frequently, then the best course would be to look into a bigger place together or not move in at all. \n\nIf she didn't know or was told they were not spending the night often, then she's moved into a home under false pretenses and should have a say in how many bodies stay overnight there. \n\nMy question isn't about how much time you spend with your family. It's about what expectations were set when you moved into a small space with another person.", "Its like me dating one of my son's friends. What the hell so we have in common?!", "Preach! There’s no way I would date someone with 8 kids no matter what my age was lol. I got 1 that I had at 29 with my still husband, and sometimes he’s 1 more kid than I want to be around lol", "I read that he agreed with his 15yr old that it's not her business who is in the apartment and I was like ohhhh she doesn't realise this relationship is transactional. Poor girl thought she was more than the latest bedwarmer. Hope this thread is a wake up call haha", "Lmao best comment ever bc omg yes", "Except he has no space for them.", "🤣🤣the Drakkar Noir comment made my drink come out of my nose!! Ahhhh the ‘80s!!!", "He already is a grandpa! Don’t date a man like this and then complain. Like go find someone your own age OP.", "I'll say it: the age gap is toxic.", "I wonder with how many moms? Given the ages of the kids - that looks like two separate families…\n\nHe proably would go for another 4 with her", "my opinions are law everyone must follow them actually", "I’m the same age as OP’s bf…and there are definitely days I’m not sure I want the 2 (both teenagers) I have. My husband keeps telling me it’s too late to decide that I don’t want kids. LOL.", "Yeah, it's a shame when they don't realize they're just a bangmaid.", "Thank you!!", "💎🥇", "Facts", "We planned this one. He’s almost 12. I don’t see why I can’t change my mind! He can be a real meanie head.", "Fact: with such an age difference there's almost certainly a power differential in BF's/grandpa's favor, due to innate respect for greater experience, the increased confidence on his part that usually comes with age and also a backlog of dirty tricks that will help him win arguments. Despite the man's likely dominance, he hasn't managed to push OP around completely: she's asking Reddit why she's so unhappy with this situation. If she's not happy, it's reasonable to note all the ways in which he's overruling and exploiting her, which correlate pretty highly with the things she's taking exception to. In this case, age seems to matter a lot.", "Oh I feel ya, there. I have one coming out of the unpleasant teen years (19) and one solidly in them (15). The 19yo I’d like to keep now that he’s back to normal…but I’m getting close to obliging the 15yo’s desire to “go be in foster care because it would be better than living here with you.” Parenting teens (especially in 2023) ain’t for the faint of heart.", "I’m not gonna lie and say I haven’t threatened mine a time or two that I’d send him to go live with the poor kids if he didn’t act right. I know that’s not PC, but even though we live in Alabama, he’s not really seen poverty. All his friends and everyone he knows are in the same position as we are, solidly middle class. The threat of me sending him to public school here usually straightens his little ass right up lol.", "He has children that are OLDER than you and you are with him...why? He has 8 children with MULTIPLE women and you are with him....why? \n\nI think that YTA for this post itself in general because like...you I hope knew going in that he had kids and that would mean visitation and all of that, so you knew ahead of time that this was all a thing. \n\nHowever, I would really think about this relationship and whether it is even sustainable. Not even because of the gap, but because he has children older than you who have children of their own. Because you can't stand being around his kids. You don't even want his kids around. So like...leave and find someone who doesn't have kids. You are way too young to be bothering to continue to deal with this.", "YTA. What gives you the audacity to get with a guy with EIGHT KIDS and say they can’t spend the night with THEIR FATHER.", "[removed]", "YTA. I'm asuming you knew he had kids prior to moving in. Also, you moved into HIS home, not the other way around.  Most of his kids are still minor children who deserve time with their parent. DO NOT DATE PEOPLE WITH KIDS IF YOUR NOT PREPARED TO BE AROUND THEM!", "Lord. You're NTA for not wanting camping world in your one bedroom apartment. \n\nBut you bought a season pass to Six Flags and all 6 flags are red. \n\nWhy are you dating/living in a one bedroom apartment with a 50 year old man with 8 children (some older than you are) with multiple women? \n\nWhy does this 50 year old man TELL you what's going to happen in your home? (No need to answer- it's a total lack of respect for you, your autonomy, and your wishes.) \n\nWhy would you have to clean up after this 50 year old man and the gaggle of teenagers that are camping in your living room (against your wishes)? (Again, I got it: because this 50 year old man fails in the personal responsibility department to such a degree that of course you will come around and pick of his slack, what a pleasure!) \n\nDon't be an A to yourself. This is insane.", "Of course you were told instead of asked because you're younger than his actual children- what do you think he looks at you as the majority of the time? \n\nPeople. Stop dating your parents. Please. \n\nESH.", "If you dont wanna deal with your partners kids then get a partner that doesnt have kids!", "ESH. Your (twice your age) BF has minor kids - they will sleep over and visit. This shouldn’t be a surprise.\n\nThat’s a lot of kids for a 2 bedroom apartment so I can your annoyance however when you day a man with 8 kids you should expect them to be around", "YTA to yourself. Wtf is wrong with you dating this guy?? He has 8 kids and 23 years older than you.", "this has more redflags than russia did in the 1930's", "YTA for not accepting your bf's children as part of dating him. Your 50 yr old bf has 8 children. The majority of whom are minors. His 1 bedroom(you said you moved in with him) apartment is not large enough for you two and his 5 minor children to share space. \n\nGet a larger place, learn to accept his responsibility towards his children, or find a more balanced relationship for your 27 yr old self.", "I’m not sure if this is an AITA issue. As most people have stated, there are many red flags here. If you absorb anything I say here, absorb this: PLEASE DO NOT HAVE A BABY WITH HIM. \n\nFor the bot, I will make the judgement of NTA. However, can you really see yourself living this way for years and years? Some of his kids are older than you, he has A LOT of parenting to do with his ten year-old AND he has grandchildren. \n\nHe doesn’t seem to see you as a partner here, and they don’t either. I hope you have friends or family or SOME FORM OF SUPPORT. This is really heavy.", "YTA. If you don’t like having kids around, don’t date someone with kids.", "YTA", "ESH - you're dating a guy who is a good dad and grandfather, surely you knew that going into this. But ESH because you should not be expected to be cleaning up after his kids and seeing to their meals and groceries. The kids are old enough to be expected to clean up after themselves and dad needs to be pitching in otherwise, as well as managing their meal needs. Accepting that the kids will be there is on you, but that doesn't make you a free maid, cook, and food store.", "YTA for moving in with a guy who is happily super involved in his family life and then not wanting to embrace the chaos that is multiple tweens/teenagers. Don’t live with him if you don’t want his life.", "Not really. Take yourself off to a spa for the weekend whilst they're there.", "INFO - why are you guys in a 1 bedroom apartment? If he's got that many kids that are consistently over, can he not afford a house with one or 2 extra bedrooms?", "NTA \n\nLike you really wanted this man??", "I read that and have a question.\n\nHave you ever had a full psychological evaluation?\n\nJudging from your post the answer is no. Schedule one immediately.\n\nESH\n\nHim for the mess he’s created with his life. You for being involved with him.", "yta his house and his kids who are underage shouldn’t be with a man with kids if you don’t want to deal with them.", "ESH - Your relationship is built entirely of red flags. Date someone who is in the same stage of life as you. You are younger than his oldest children, so he will treat you like a child. Also be aware that when you date someone with kids, you have to have a relationship with the kids as well.", "Run for your life. What are you thinking?", "Absolutely not, i don’t like kids, and I would not be wanting kids to stay over at my house", "Your BF is the AH.\n\nThis isn't a marriage. It's a dormitory. And you're the housekeeper.\n\nAnd that daughter is really foul to ask if living arrangements in your house are any of your business.\n\nCan't you find a BF without a peanut gallery of offspring?", "WTF OP?! He has kids older than you!?!!!!!!!!!!!!!!\n\nSTOP.", "Lol YTA! Instead of trying to crowd control how many of his children can crash, you should mention looking for a larger home? The age gap as well, crazy. I bet his children feel awkward around you too lol", "Yta. You moved in with him knowing he has children. They are going to come over sometime.", "Oh dear. Why are you wasting your time on a man 20+ years older than you, with grandchildren and children older than you and 5 kids still under 18??? go live your life. do not get bogged down living his life. it already sounds like his kids dont like you, and it doesn't sound like he does either, tbh. \n\nAlso, do these kids moms know that when they go to dads place they dont have their own room and sleep in the living room so they have zero privacy??? i'm gonna assume this isn't a court ordered visitation schedule because there's (usually) no way that would fly.", "Girl……do you want better for yourself or no?", "RUN!!!!!!!!!!! Lol\n\nI mean he should run from you (he wants to spend time with his kids and you’re in the way)\n\nYou should run from him (all them damn kids with different mamas, they are young; you also seem selfish, why even date a man with that many kids if you’re not willing to share) \n\nAnd y’all shouldn’t be together at all (is he your sugar daddy? Can you not afford your own apt? Why do y’all live together?)\n\nYTA", "YTA. You knew he had kids and grandkids and they come and stay at his place. If you don’t want to deal with them you need to reevaluate your relationship because the kids aren’t going anywhere. I would evaluate the relationship real quick and not waste his time or cause more problems with his kids. He will choose his kids over you and it doesn’t sound like you can handle it. Just leave.", "ESH (assuming this is real).\n\nYour bf is dating someone younger than 2 of his kids.  His kids have various baby mamas.  He only has a 1 bedroom apartment but wants to house several of his kids there at random times throughout the year.  He's making his gf do all the clean up after his kids visit instead of sharing the load.\n\nYou're dating someone who's almost twice your age, has 8 kids (plus grandkids!), and expecting him to not have those kids visit.  You knew the situation but still hooked up with him.  If you don't like the setup, you should leave.\n\nPlease tell me you're not going to have kids with this guy.", "YTA", "I hate to have to choose YTA because you don't sound like an asshole.\n\nBut you did sign up to date a guy with 8 kids, and you knew they are not all adult kids and since he \"has a good relationship\" with them, they'd be in his life and... in his house?\n\nYou need to realize that the term \"good relationship\" is as much about providing for them (housing included) as it is getting along and being in their lives. These are not his friends, they are his *children.*\n\nDid you two even discuss how living arrangements would be dealt with? Him moving into YOUR little one bedroom apartment then turning your living room into the YMCA? Yeah, they're his kids, but where is his role in providing a stable home environment for them?\n\nHe should be putting in long hours at work to afford a town-home with at least three bedrooms - two for kids and maybe a space in the basement where these teenagers can be teenagers. Video games, computers, being loud. Being teenagers. They can't camp in the living room of a 1 bedroom place. They need. He needs. You need. YOU ALL NEED a proper sized place for this many people.\n\nThis whole thing is just wrong and smacks of bad planning. Or compulsive choices...\n\nIf you're a serious couple, you both need to sit down and figure out how to get into a property that better suits the needs of yourselves and the *children in your lives.* \n\nThese are not random homeless people crashing your apartment. These are his children, and you are technically their step-parent. Again, you moved in with a man who has custody of minor children. Where were they going to go? Be? Live?\n\nThere seems to be something missing out of the thought processes involved here. Like, \"I am moving a man with 8 kids into my apartment where are all these kids going to go\" thinking. \n\nShaking my head here. Do you think maybe there needs to be a conversation between you and bf about housing needs? Or maybe... living together wasn't the right \"move\" at this time? You guys have some issues to work out, for sure.", "Not necessarily YTA here, but he’s twice your age and is a grandpa with a big family, you’re a bit of fun, you’re not his priority. This is what life is going to be like with him.", "What the fuck you doing with a 50 year old???\n\nJesus....I cant imagine why this relationship has issues my god, you are closer in age with his children!! \n\nBut you're younger.......\n\n\nYTA , well, him more than you really but you are are in different stages coz of the ages. \n\nRhymed.", "His kids are older than you are and he's got 8 of them.... Yep not touching this one with a ten foot pole", "Sweetie, this man has 8 kids and sounds like he is a very involved father. Dating a man like this means his kids will be part of your life. When you date a parent, you are taking on the knowledge that good parents put their kids first. It comes with the territory. If you're \"not super comfortable around them,\" this is going to be a problem.\n\nI'm giving a gentle YTA, because you're not being fair to your BF nor yourself. If you're not comfortable around kids, you shouldn't be with a father of 8.\n\nYes, it's not cool that he presented the group indoor camping as a fait accompli. It's not good if the preparation and cleanup falls only on you. But his kids and grandkids are always going to be around in some way.", "YTA  \n\n\nHe's a father, if you can't cope with that get out of his life and let him get on with caring for his children.", "ESH Both you and your boyfriend, you for dating and moving in with a man with kids, if you don't like kids around leave, and your boyfriend for not having a place with more bedrooms so the kids aren't sleeping in the living room.", "YTA. He is a 50 year old man with a tight family… if you can’t be a part of that, get to stepping. Sorry. You don’t get to object to a man spending time with his family when you knew from the jump he’s an active part of their lives. What… exactly did you expect? You sound crazy.", "He's 50 and 2 of his sons are in their 30s?", "Wow. Play stupid games, win stupid prizes. Have fun.", "Get a hotel room for that weekend.", "YTA. You are involved with a guy 23 years older than you with a huge family. They are part of the deal. Just use the time to go away for the weekend with some friends. That way you don't have to feed them.", " YTA.\nYou IGNORED ALL THE RED FLAGS IN THIS SITUATION. I mean he has kids OLDER THAN YOU \nYou don't get to complain about his kids.", "Probably thinks she's different", "Even if we ignored the age gap, what kind of man who has 5 underage children doesn’t have even a single bedroom for those kids?  That alone would be enough for me to think twice about dating him. \n\nAdd in the *multiple* mothers, and the fact that he doesn’t think his gf has any say in what happens in her own home, the glaring age gap is at least #3 on the *very* long list of glaringly obvious issues with this guy/relationship.", "Hope she likes kids...he will probably expect her to pop out a couple as well. Seems to be his MO", "And he’s been a dad since his teens, if he has kids in their 30s.  He’s been a dad for 2/3 of his life.  That just makes it even weirder for me, even though I can’t articulate why.", "This comment irks me. Obviously you are trying to tie this comment in to a series of AITA posts where the secret revelations is the age difference and a barely legal women who is being taken advantage of. A real question: I understand your comment assumes that any age gap is purely exploitative but how old does a woman have to be before she is an adult in your eyes and can make her own choices and be responsible for them? OP is 27. That isn’t a child. It isn’t barely and adult it is hardcore an adult woman. She is willing dating an older man. Almost certainly not her first relationship. So why is there an unspoken moral finger wagging at the boyfriend like he is abusive or coercive for dating a younger women? It reads more as a personal vindictive streak more than anything else. As far as the question YTA. You knew he had kids and you didn’t think about that oe question it when you moved in with him. An active father who wants to be in his kids like is a good thing. If that doesn’t work for you, OP then leave.", "Cool victim shaming", "Lmao not PopPop!!", "Yep. OP, get out of there, find someone better.", "She’s def a weirdo lol bc wtf", "A “good dad” who leaves his children’s mother(s probably) for women younger than his kids are. The guy is not a “good” anything.", "[removed]", "That's because most older women have gotten to the point where they can see past the bullshit and they've already had men like this in their life. He can't date older women because they know better.", "Her objection was to piling 6 more people in a 1BR for a weekend without even discussing it with her and apparently expecting her to look after their mess and food. A person can be both a good parent and a thoughtful partner, but he wasn’t in this instance.", "Having 8 children and 0 in your custody doesn’t make someone a good parent", "I had voted N T A in another comment but after reading your post, excellent points!  Well said \n\nESH", "she is 27. she isnt a child anymore, what kind of power imbalance would there be? are you saying that she isnt able to decide at that age what a suitable partner for her is?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "It’s like the Wish.com of Nic Cannon", "I wouldn't call him boyfriend....more like grandpa friend....saggy balls friend maybe", "And lives in a one-bedroom apartment. #winner", "Not only that, a 50 y/o that has her living at a 1 bedroom apartment?!?!? That's what I call a sour daddy.", "And he lives is a 1 bedroom at 50. Would expect him to at least be a sugar daddy", "I’m also a 27 year old woman and I cannot IMAGINE being in this situation or even wanting to come anywhere near this situation.", "As a daughter of a father who had numerous children by multiple women and a heck of a lot of women who never had his children (yet a good Dad), you accept reality early on. The women are ignored and yet appreciated for the warm breakfast. You know their place before they recognize it. The only weird part is when they try to play mommy. \n\nThese kids all know who their Dad is and aren't weirded out by it.", "I mean, don't have your partner move in if you're still going to treat the place like it's just yours when it suits you.", "She is the sugar baby only explanation", "*eye roll*", "I agree with you, I'm 27 and while I have not dated a TON of guys I still have enough respect for myself and know my own worth to not go anywhere near this man", "By expecting her to be his bangmaid, essentially. It's not her job to clean up after his kids, and past events have shown that he leaves this to her. Allowing an entitled little 15 year old shit to say anything about how OP doesn't get a say in the apartment she pays rent for is the cherry on top. I'd have laughed in her face and told her she can have fun cleaning up after her brothers then. There's a reason he has 8 kids and can't keep a stable relationship; this man is a complete and utter deadbeat.", "Well a man that doesn't disrespect his partner usually ASKS \"hey, do you mind if my 6 kids/grandkids stay in the apartment we SHARE?\" \"Hey, I really want my kids/grandkids to stay here, in OUR one bedroom apartment, why don't I put you up in a hotel room for the weekend?\" \"Hey, 15 year old child, of course this is her business, we SHARE this apartment and it is HER home.\" He can choose his kids all he wants, but it is her home and she should have an opinion not be TOLD what is happening and definitely shouldn't be disrespected by a 15 year old child.", "I don’t know why you’re downvoted so much, you’re right.  Redditors need to stop doing this, especially when the younger person in the relationship is almost 30.  27 is grown enough to date whoever they want, and if it’s someone 50 that’s fine on both ends and not perverse or wrong inherently.", "It's very sad and feels like a betrayal. I got booted out at 16 when my father chose my stepmother over me. We've been permanently estranged for over two decades, which is far longer than his marriage to that woman lasted.", "I guess she’s looking to have child number 9.", "He spends time and gives attention to his 8 kids and his grandkids. It sounds like an involved father, which is tough with 8 kids with a number of different women. He puts his kids first. So yeah, sounds like a good dad.", "Better than mine.", "This is why he HAS a much younger partner. What 50 year old woman would tolerate this?", "“He can’t date older women because they know better.” \n\nTHIS.", "i actually think her issue is moreso that he’s chosen his kids over her, and them being mainly adults for some reason minimizes his duty to spend time with them in her eyes. this is a textbook situation, and it’s why general consesus is that she’s the a-hole. \n\nparenting doesnt stop once your kids hit a certain age, and she knew EXACTLY what she was getting into my dating a man almost double her age, with kids older than she is, and whose apartment is too small to fit them all.\n\nhe is a good parent from the looks of it. sure it really isnt bright to fit 8 kids into one small space but he seems very involved in their lives. if a partner is new to a family they have to accept that they have a limited say on these things, as his daughter outlined to her already. and sadly due to the age issues it doesnt seem like she’ll *ever* have much say in these things.", "you’re speaking in hypotheticals here, and this isn’t the crux of the issue. they are his kids and they ultimately come first. what she thinks about how he spends time with kids who are OLDER than her is not her business at all, and frankly she’s incredibly ballsy for giving him shit for this in the first place. \n\ni will not get onto how fucked up the entire situation is age-wise, because no 27 year old should be dating a man with children older than her, but she *knew* all this and that’s why my sympathy is so limited here. (unless she was groomed beforehand and then this gets straight up illegal)", "So you married a man old enough to be your father who can’t even support his own kids and has to be forced into doing so?? That sounds like an amazing choice! *eye rolls*", "it's only a matter of time before the bf gets OP pregnant, he seems to have a possible breeding fetish. OP is def not TA and she needs to gtfo before she's just another baby mama. Her bf is so beyond gross. Esp the way he doesnt validate her feelings re her own home.", "More red flags then a Soviet parade!", "His child support takes up all his income.", "Especially with 8 kids.", "Lol I have a one bedroom house. Most people don't even know one bedroom houses exist.", "Maybe he just wants to make sure none can actually live with him as that might affect his extracurriculars.", "Cos it's creepy AF is probably why. I'm 36 and also can't imagine myself in this shituation.", "With a guy in a one bedroom apartment? And 8 kids? I doubt he can afford real sugar, let alone have a sugar baby.", "The 15 year old is not a little shit. She knows who her Dad is, and she knows that the flavor of the year doesn't have a voice in the decision. She is just being truthful.", "He's a deadbeat but the post is about HER not wanting his kids to stay over and him overriding that? Interesting.\n\nShe can choose to stay with family or friends that night and make him responsible for cleaning up after them. There is a such thing as compromise in relationships. I never said he's made the best life choices but the post isn't asking if he made bad choices. Its asking if she is an a hole for saying his kids can't be there overnight.\n\nI do agree he shouldn't allow his daughter to speak to her that way. That indeed is disrespectful. I had to reread because I was very confused by the downvoting. Turns out I did indeed miss something.", "That is it", "That’s terrible. I’m sorry you’re going through that", "Could be true, unlikely but possible she’s not delusional, but it doesn’t matter because it’s OPs duty to try harder. The kids come first. They were here first too.Even if they’re cold shouldering her, keep trying… IF you want to marry this man, which it sounds like she shouldn’t", "I would call that the bare minimum, not “good” in any way. He also has 8 children from who knows how many moms, doesn’t have even part time custody of *any* of them, lives in a one bedroom apartment so they have to sleep in the living room when they do visit, and has a girlfriend who’s younger than two of his children that clearly doesn’t want them around. In my opinion all of that completely negates any points he might’ve gotten for spending time with them occasionally. \n\nThis next bit might be a stretch, but it honestly sounds to me like he has a breeding fetish and I’m guessing OPs his next victim.", "It's one thing to put your kids first. But I'm not sure this guy is doing his kids any favors by not actually having room for them, and by choosing to date a woman who clearly doesn't get along with them.\n\nImagine a mother posting this, dating a 27-year-old man, no custody of her multiple kids with multiple partners, inviting them over on occasion to her one-bedroom apartment. She'd be DESTROYED. It's kinda laughable to me that OP's boyfriend is seen as a \"good dad\" here.", "Better than mine too lmao but he isn’t exactly my bar for a good parent", "Right?! These aren't rose colored glasses. She's walking around with her eyes and ears off. \n\nI think my favorite is how they all don't really get along, or however she put it. Even the kids know.", "Maybe she resents them because her partner treats her like a bangmaid and lets *children* tell an adult woman who pays rent that she has no say in the apartment she lives in, idk. Guarantee you that 15 year old won't lift a finger to help with her brothers. OP already stated that cleanup gets left to her, not the kids.\n\nTime to examine your misogyny there, buddy.", "the kids want to see their dad or spend time together. you think he has much more money  for a bigger apartment when he has to pay child support for 6 kids?", "He must have a golden shlong to ignore the sizes of these red flags. They’re not flags, they’re fricking tarps!", "Do you honestly think he can even remember her name? Bet, he calls her “hun’’", "I wonder if OP knew this going in. If she did, I'm really hoping she didn't think she could change things. Besides,  how did they have time to date when he spends so much time with his kids?", "I was going to say Paco Rabanne or, more likely given the child support situation, Brut.", "Oh gods. That green bottle! I can smell Polo right now even though I haven't been around it in decades.", "I was thinking it would be Cool Water.", "Disability doesn’t go far", "You’re too old for him.", "She's the artificial sweetener baby.", "She lives with him. Obviously he’s doing better than her", "You know, you are right. He's the bad parent here. Kids usually don't behave badly unless someone allows them to. I certainly knew how to clean up after myself at that age, but I had a good father.", "Being a fun dad is not enough to not be a deadbeat. My sis's ex would take the kids to Disney, Chuck e cheese, etc and then allow them to come home and live in complete filth around drug addicts. If the courts had listened to them, they'd still be living with fifth and drug addicts, because Mom made them do chores and stay clean and speak to people politely and Dad brought them to arcades. OP has stated that Dad expects her to do the cleaning, so do you really think he's doing this efficiently or at all when he doesn't have a partner?\n\nI do get what you're saying tho. You are correct tbh.", "Haven’t you ever watched the Brady Bunch? Wait no wrong show lol.", "Excellent idea!!! He did it before she moved in, he can handle it himself .\n\nESH", "Truthfully, anyone who gets with someone 20+ years their senior with multiple children by multiple different women, and doesn’t expect to be treated like a bangmaid is just naïve or living in denial, probably a bit of both. No one is saying that she deserves to be treated this way, but this is the life that she is choosing. How many times do we have to hear the same story before we realize that men like this aren’t getting with women like her, because they think they are mature for their age. Men like this, get with women like her, because they know they are naïve and easily malleable. And this is coming from somebody who is supportive of age gap relationships within reason. I genuinely think the limit should be 10 years. My husband and I are 10 years apart and we notice the gap in our age when certain songs come on, he asks me about certain movies, etc. I couldn’t imagine being with anyone older than him because I would genuinely feel like I was married to my grandpa. She should leave and get with someone her own age (or at least a little closer), with no children, that she can actually build a future with. Not fill in the maternal role for a man twice her age who clearly can’t get women his own age to take him seriously. Instead of realizing this isn’t the life that she wants for herself, she instead wants to step in between the relationship that he has with his children. Regardless of whether or not he’s a good man when it comes to relationships, he obviously puts forth effort to be a part of his children’s lives. She made no indication as to whether or not this visitation schedule was something that started once they were dating, so I can only assume he was doing this even before they met. It doesn’t make her the A for not wanting to slave away for children that aren’t hers and don’t even have any respect for her. It does, however, make her the A for thinking that she should be able to tell his children/grandchildren that they aren’t allowed to stay the night at their fathers house. She doesn’t get to dictate a visitation schedule that was in place and that she knew about before the relationship ever started, she does get to dictate whether or not this arrangement is something she wants to deal with for the rest of her life. You don’t get to stay and then complain that you’re not happy. You either move on or deal with the life that you choose for yourself. He’s showing her exactly who he is and how much respect he has for her…she should choose to believe him instead of trying to make the kids visiting their dad the problem. They’re only behaving the way their father is allowing/teaching them to. 🤷🏽‍♀️", "All op has to do is just not clean up after them.\n\nTelling her bf to stop spending time with his kids is the worst way to handle the situation.", "And, maid, cook, laundress, shopper, etc., no doubt.  \n\nShe should stop wasting her time and money on a guy who is old enough to be her father.", "Bedwarmer, but hopefully not brood mare also.", "Spot on!!! Yep!🥇🎖️🎶🤠😎", "I figured it was the chocolate covered testicles", "She knew going in 100%", "No doubt, but they don't seem to mind.", "Omg one of my roommates in the 80s had every Drakkar Noir product known to man. It filled the bathroom counter.", "I'm not ashamed to say (ok maybe a little) I used Paco Rabanne, Polo, and Drakkar (edit: not simultaneously). I may have used some of Dad's Brut 33 originally. \n\nI also had a mullet.", "Paco Rabanne died a week or two ago in his 80s. Until that hit the news I had completely forgotten about it.", "I was going with High Karate due to all those child support and maybe even alimony payments.", "Polo imprints on your brain and that sense memory never goes away.  Lagerfeld is the same way.", "Let me guess, he is probably having her living with him so he can afford rent! She is the bang roommate", "Three families, because the daughters have different moms.  So one for the 30-somethings and two for the teenagers.", "Frank has given this world many delights", "With 8 kids already a career as brood mare seems inevitable", "I just choked on my drink, so thanks for that lmaoooo", "🤣🤣", "You were a man of taste, I see. \n\nI'm almost 40 and I can practically smell my dad's signature scent of Brut and Irish Spring.", "You are right - that is probably what happened with wife 2.\n\nI have to hand it to him though - he’s in their lives and they all seem to love him. More than i can say for many other people.", "I think that's one of my favorite core memories of my dad. Now my hubby (39) can not stand when I smell like Irish spring....he tells me \"I love you, but you kind of stink of Irish spring\" when I use it 🤣", "I do give him credit for that, and for facilitating relationships between the kids and grandkids of different mothers.", ">My boyfriend (50m) and I (27f)\n\nOh here we go.\n\n>He has 8 kids.\n\nOof. Like, no hate to people who like kids... but oof.\n\n>2 adults sons in their 30s\n\nWait, wait, wait. He has *kids* that are older than his *girlfriend*?!\n\nI'm giving you some advice: get tf out of that relationship. He sounds like a very involved dad... and a very creepy boyfriend.\n\nI'm also giving you a YTA vote because you want him to be less involved in his kids/grandkids' lives because his kids don't like you. That's definitely asshole behavior. Those are his kids. I personally think he's still real gross for dating someone younger than his kids, but I will give him what credit is due in that he does spend plenty of time bonding with them.", "\n\n*My boyfriend (50m) and I (27f) live in a 1 bedroom apartment. I moved in with him around 8 months ago. He has 8 kids. 2 adults sons in their 30s, who are married with kids, and 6 younger children ages 19m, 17m, 15f, 14m, 11f, 10m).*\n\n*Despite the fact none of his kids live with him he is very involved in their lives.*\n\n🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩\nJust … run for your life, sweet, thoughtful, obliging gf! So many red flags I don’t know where to begin, but just reread these sentences for starters. You moved in with him when he had a 2m child? Oh lord. The request is absurd. NTA.", "Why are you in this relationship and moving in when he needs the space to see his kids all the time? Also find someone who doesn’t have 8 kids if you don’t want to live your life around 8 kids", "At 27 years of age you should be a lot smarter than this.\n\nINFO: How long have you been together for?", "RUN. Why on earth would you want to be in this situation?", "YTA, get a bf closer to your own age dumbass", "OP I hope you're on the pill", "YTA- you have no business dating a man with that many kids especially since 2 are older than you. You really think he gives a stuff about your opinion?", "YTA and you need to pack up and move out.", "If your sleeping with a guy that much older atleast make sure he has money, Jesus. Unless he’s like brad Pitt or something. This is not a catch. Go fish.", "YTA. So, he's got a boatload of kids/grandkids and they are going to \"camp out\" in the living room. This can't come as a surprise as you moved into his one bedroom apartment knowing he had kids. Any overnight visits, even with only 2, they would be sleeping there. Go stay with a friend for the weekend.", "Um why are you dating this loser is the question?", "While I don't think it's a desirable situation to be in I still have to wonder, what did you expect? You decided to get with a man twice your age, with multiple children from multiple women. If you don't want them to be in your lives, why are you with him? By his track record, the chances are that you will also have a child one day by this man, and you may want them to have a relationship with their siblings too which could mean lots more sleepovers at yours, or at their father's place. Based on the fact that you chose to date a man with kids, YTA.", "YTA.  You moved in with a FATHER that has several minor children who all deserve a dad and a relationship with their siblings.  Your wants come after those kids needs.  Move out.  You should not be dating or living with a person with minor children.  You are not mature enough to recognize that him raising his children IS extremely important.  Please stay child free.  I can’t imagine being this unrealistic.  - stepparent", "NTA for objecting. 100% the ahole if you ignore the situation and general disrespect for you. Pack your shit and get out, bc things are just going to get worse.", "What the Hell are you doing with this guy? Get out of there. He can’t host that many people in a ONE BEDROOM even by himself. ESH.", "Let’s just address the elephant(s) in the room \n8 kids \nEIGHT\n\n2 of them are older than you!\nHis children will never respect you. You’re literally a sibling in their eyes \n\nYou knew he had a football team when you decided to live with him. He can’t just undad them \nNor should he be expected to \n\nYTA", "NTA\n\nHe invites 6 people to your 1 bedroom apartment for the weekend and expects you to be happy about it?  That probably explains why he is no longer married to one of his many kids' mothers. \n\nSounds like a good time to take a trip to a local hotel for the weekend to indulge yourself, with him paying the bill.", "YTA\n\nIf you don't want to deal with a half dozen (or more) kids at once, maybe don't get with a guy who has a half dozen (or more) kids??", "I couldn't get past the first paragraph.", "What are getting out of this relationship?  He has no respect for you. He allows his children to talk to you disrespectfully. It sounds as though you do all the housework, cooking, and shopping. He can’t be wealthy if he knows his kids come over to spend the night all the time and only has a one bedroom apartment. He is almost twice your age. If YOU want to have children he probably can’t afford to and is probably past that point in his life. You best course of action would be leave that situation and find someone who truly cares about you. \n\nThat being said, it is great that he is so involved with his kids. And that he is so close to them. His kids should be his priority. But your needs are being ignored completely and that is not sustainable. You have come to resent his kids because they and he walk all over you. They don’t view you as an authority figure in your own home. So ask yourself, Is it worth it?", "Run away before he impregnates you.  Good lord what a sick situation", "OP I UNDERSTAND YOU COMPLETELY... AND NO, you are NOT THE ASSHOLE!!! Or if you are, I guess I am too. Exact same situation kind of. Myself (30m) and my Fiance (49f) live together in a small studio apartment. I am constantly getting off work to just FIND her grandchildren all over our living room floor (keep in mind, this is a studio so theres not much room). It pisses me off so bad, but she doesn't get to see them much so I deal with it most days, however we have fought about it and she does the same thing to me. SO I fully sympathize with your situation.", "I noticed this too. She’s 27, her boyfriend is 50, and her boyfriend’s oldest grandson is 13. She’s closer in age to her boyfriend’s grandson (14 years apart) than she is to her boyfriend (23 years apart).", "Yeah, \"Am I the Asshole\" is not one of the top ten questions OP should be asking herself.", "I just can’t get over that she says \n\n > he made it seem like I was only unhappy with it because I don’t want to be around his kids despite the fact that I have logical reasons \n\nAnd then her “logical reasons” ended up amounting to “I don’t want to be around his kids”", "Yeah, this situation is nuts. What is OP doing dating a guy with that many children AND grandchildren but she doesn't feel comfortable around his kids?? \n\nOP, get out of this situation now. It's never going to get any better. What are you doing?", "She is an A if she though those 8 kids would disappear now that she is around. Date someone in your league, like another 27 with NO kids", "And if you don’t want to be around kids, don’t dare a man with teenage kids.  And pre teen grandkids", "I gotta wonder what's in it for OP to stay with him. What does she get out of it? Besides blatant disrespect and no consideration for her needs. I was thinking I'd be booking a hotel room for myself that weekend, but then I realized I would need to stay there a bit longer, while I find an apartment and move all my stuff out and leave him.", "If she doesn't want to be mumming a bunch of kids, why is she living with a guy who has so many of them, that he still has close contact with? What did she think was going to happen?", "I mean she chose to date a man with 8 kids and grandchildren so does she really have a reason to complain? Two of his kids are older than her, she should have known what she was getting into.", "i don’t think dating an older man is an issue or him having 8 kids, or him having kids older than her (damn this doesn’t look good for OP when i spell it out like that haha).\n\ni think the issue is she knew his life and his baggage moving in. camp out with 6 preteens doesn’t sound outside the norm. if she’s not comfortable around his MANY MANY children plus grandchildren then maybe this relationship is not for her and she shouldn’t have moved in to begin with. \n\nYTA. either accept your boyfriends life or move on.", "> If you want to get married and have kids - it’s not going to be with him.\n\nTo be fair, with his history and swimmers, I wouldn’t say kids with him is out of the question. Whether she *wants* to be baby mama #4+ is an entirely different thing.", "i have pop pop in the attic", "Good fucking lord I’ll never understand the judgmental attitude of two adults consensually dating one another. This is a question that could happen regardless of their ages, and has been asked *multiple* times in this sub.", "men like him with that many kids is not a good dad; i am speaking from experience", "The man with 8 different kids from multiple women who is dating someone younger than two of his own children sounds like a *good dad*?\n\nAbsolutely not. This man is a train wreck, and OP is just as much so for getting involved like this and then complaining.\n\nESH.", ">Tbh, he sounds like a good dad\n\nThe bar really is in the sub-basement for men huh", "I question the “great dad” part considering they’re all from different women and he sees nothing wrong with dating someone younger than his children….", "This. All of this. I don't know know how good of a Dad though if he's providing for a young girlfriend but not enough room for his kids to stay live him or even live with him. I'm all for love, but you also love your kids and are responsible for them. His priorities seem out of wack if he's continuing to pursue young women and not providing better for his children in his home.", "Except she has to cook and clean up after them. She's tA to herself if she doesn't leave him, but I can't blame her for not wanting that to be her weekend.", "He has multiple kids that aren’t adults, and has a one bedroom, ensuring they can never live with him.  That’s not a good dad in my books.", "Can’t be a gold digger if there is no gold. One bedroom apartment. Strictly daddy issues.", "Her truth leaked out: “I am not comfortable around my boyfriend’s kids.” Doubtless everyone is well aware.", "Lol, lets get this age thing handled.  I'm 60 years old and I Am NOT OLD.  Many years ago I asked my dad \"when do you feel old?\"  He said \"I'll yell you when I find out.\"  He never did feel old, he died at 76 years young.  That being said, my head is spinning at all red flags on this one.", "She is! She’s kinder, nicer, sexier, and less saggy… than the last one. Until the next one.", "Lmao Am I stupid  should be the OPs question. Yes, yes you are indeed", "He's been a dad since before his current girlfriend was born. Thats why it gives you the ick.", "I actually agree with this as a 28 year old who is mostly attracted to older guys, and even more attracted to MUCH older guys.  I don’t see why this sort of age gap is such an issue.  She’s almost 30.  She’s fully grown, it’s not like she’s a teenager.  This sort of thing is so shamey when it shouldn’t be.  Focus on the issue at hand, not the age gap lol Jesus Christ.  Any time there’s any sort of age gap of more than 10 years between ADULTS, Reddit goes insane about how the older person (usually a guy) is taking advantage.  You have nothing to base that on.", "Yea and the \"you dont know any better\" comment is just condescending. Op isnt 18, they're probably well into their career and are in the part of their life where they're more than capable of making big life decisions, as they've probably made more than their fair share.", "She moved in with a man that has 8 children by multiple women. He has a 1 bedroom apartment. He was never a great father. But if he had contact with them she knew they were going to be spending time in a 1 bed apartment with them. Given there are 8, it’s not unreasonable to think several will be there at the one time. He has been doing this longer then she has been around. He wanted a bangmaid she agreed and is now upset that it means there are actually multiple kids in a 1 bed. Cleaning is the least of her problems", "A good dad would have wrapped it up yeahs ago and not be dating a woman younger than some of his kids… ewwww.", "If she's living there with him, as a couple, then it is also her living room. She has a say in what happens in her home\n\nAnd I would argue that the six kids living room situation is NOT something she signed up for. It sounds like the kids coming over is not a structured thing. More of a free for all where they come over when they are able, rather then on a set schedule. It sounds like she has accepted this situation because they come over in only 1-3 kids at a time. There is a major difference between 3 and 6 kids in a small living room. I think that it's ridiculous to cram 6 kids in that small of a space for that amount of time, but if the father wanted to do that, he should have at least discussed it with her - especially when it seems like she's the one that has to care and clean up for them.\n\nAll that said, I think she does share a little bit of the AH title because it seems like she more tolerates the kids than anything. She should have thought about it more before entering the relationship, but I still think that the 6 kid sleepover is a level above a regular custody system. That qualifies as an event in my eyes and I don't think it's fair to push that on someone without a discussion", "Considering she moved in with an old man with 8 kids by multiple partners where 1/4 of them are older then she is then yes. She isn’t able to decide what a suitable partner is.", "Yes I mean if he was like a multi millionaire or something than I might understand that she got an agenda but a 1 bed room apartment?? Like what does that 50 year old man has lol", ">Bruh, you just ignored a parade of red flags.\n\nYeah, like May Day in Red Square 1966 parade of red flags.\n\nThis will not end well.", "His oldest kids in their 30s and OP is 27", "Not to mention it seems like she isn't even a fan of the kids so why even be with him? Clearly he is an involved father good for him, but it's a package deal. Either take him AND his kids or move on", "She saw all those red flags and though she was going to the circus.", "Cant be much of a catch if they live in 1br house, right.\n8 kids plus grandkids, wow.", "I gasped too! What the actual fuck?!?", "That would have been my guess, but how can he afford a sugar baby?", "Exactly. She may have moved in, but it's still their place. She should be allowed to have some say, and the situation outlined here sounds ludicrous.  \n\n\nThe bigger issue is why she's with him at all but I think other commenters have covered that territory pretty well.", "Where did OP say she pays rent?", "How much do you think this guy is paying in child support?", "OP is hurling herself under the bus, and double that if she tells us we're mean.", "Wow judge much? His kids supported themselves by then and we were broke because he emptied his savings to get custody of my kid. Ya real jerk!", "Assuming he pays it.", "Who needs a brow lift? ;)", "Omg I’m screaming, funniest comment", "So many marinara flags that it’s a pasta party", "She’s closer in age to his grandchildren than to him.", "She’s closer in age to his grandkids than to him", "Ummm, I guess the bar is pretty low for men if we are considering a guy with 8 kids from 8 different women who spends a few nights a month with them, doesn’t give them their own room or even bed, and lives with a woman younger than half of them, who clearly doesn’t like children, a “good dad.” I mean he’s a dad. And I’m hoping he’s not an abusive one. But “good” might be a bridge too far.", "But do you have 8 kids and a live-in girlfriend?", "Most adults pay rent for the places they live in, so I assumed.\n\nEven if she doesn't, she isn't his fucking maid and doesn't have to live in the fifth his children create and don't take care of. You don't just move a partner in and expect then to parent your children or be your maid. OP's boyfriend needs to learn to clean up.", "Enjoy your father/husband then I guess.  Point still stands when you marry someone old enough to be your parent they should have more financial stability then to go broke over a custody dispute", "Your husband sounds like an awesome guy for helping gain custody of your child. You also sound like an awesome wife for going so hard for his kids. I know personally how much custody wars can cost! So dumb how people wanna hate for no better reason than to try and make people feel shitty because it makes them feel better about themselves somehow. Sad.", "Well he must be hung cuz he sure as hell don’t have any money with a one bedroom apartment and that many kids.", "Big enough to camp under.", "When your sd turns into your Bf ...\n\nEw", "A ONE BEDROOM. Lord.", "Does his landlord know how many people are regularly staying at his one BR apartment?  That would be one way to stem the flow of kids.", "Sigh, no. I really need to catch up.", "Lololol", "I also understand where you are coming from. My brother is that dad (alcoholic) and I have to often tell him that there's more to being a dad than spending time. I also feel if he came on and asked, \"am i the a hole for cancelling my planned sleepover with my boys bc my gf who is 20 years younger didn't want them there,\" It'd be a resounding youre the a hole. He'd be ripped a new one even without the context she added.", "No you dont and she shouldn’t have to clean.  It doesn’t say she cooks for them either though OR pays rent.  Not anywhere.  Also, she’s dating a guy with kids.  She IS inherently expected to parent if she wants to be in his life.  Should she be the one doing all the annoying/cleaning parenting things while he does the fun stuff? No.  She shouldn’t.  But if she wants to date someone with a bunch of kids, and be with him long term, she should expect to parent or should just not date him.", "Dude became a grandpa at 37.", "Yup, when his kids are older than you….", "Don't be fooled by the close ages... the guy I dated in high school (who peaked during that time!) had six kids with five different women in a close range...two of the kids were only born 6 months apart. And the the youngest two were twins born to a baby momma about 17 years younger than him. And he pays little to no support nor sees them regularly. Thank God I dodged that bullet ...", "Thank you for saying this", "Don't forget babysitter!", "He is more than twice her age! He has children older than her that have children closer in age to her than she is to him! \n\nAnd if they are living in a 1 bedroom apartment, he apparently isn't rich. \n\nNot that it would all be okay if he was rich, but c'mon.. Why?! What?! Holy shit, where's the Tylenol?!", "I desperately hope OP is on birth control that he can't sabotage", "After a certain age, that schlong doesn't hang or perform the way it used to, Gurl run....", "That’s not coconut 🥥 flakes she’s looking at. Cough Old is Old.", "I had a lesbian roommate in San Francisco who would shower, pour on the Drakkar Noir and sit topless in the living room, listened to the Indigo Girls and cry.\n\nNothing wrong with being a lesbian, but I don't miss living with her. This was still a better living situation than OP has, however.", "She hasn't yet. Let's hope this is her wake up call.", "Nick Cannon in training.", "You are staying in that man’s house it’s not yours. His house his rules. You have zero say in any matter that occurs in HIS house. For you to think his gonna listen to someone younger than his two oldest kids is ridiculous. He has 8 kids and a one bedroom apartment his priorities are jacked. If you can’t handle a man with kids don’t get with one that has 8. You are 27 you have no reason to be playing “step mom” to those kids and it seems like you have no desire to either. YTA for even entertaining this relationship as long as you have.", "YTA. Is it your house? It's a 1 BR. His. You lived in. You're wanted wifey privileges when you're just a gf. \nGot to hand it to him. Get a young girl who doesn't know any better or bring anything to the table. \n\nYou're willingly dating a man almost twice your age with kids older than you. \n\nHe has 8 kids. And I don't think there's anything wrong with that but he clearly prioritizes them and you're there as a place holder. \n\nBelieve me, if your relationship was going anywhere he would value your opinion. He would want to build a home with you. He doesn't. \n\nTake the clue, my dear.", "Why won't she get along with his kids and grandkids? They're all about the same age as her!", "YTA for dating a dude twice your age with eight kids. This is an entire sea of red flags.", "Oh dear, another young woman that dates a man who could easily be her father and then surprise surprise isn't able to deal with the fact that he has children (and in this case, grandchildren).\n\nThere is a reason why you feel uncomfortable around his children, OP.", "Beside love, what else could be the attraction? Maybe he's really good in bed? Either way, she's old enough to decide for herself and hopefully she's getting good benefits from it.", "She’s the 3rd oldest child in this family band", "Yeah I know that I have no room to judge people, but a 27 year old doesn’t really have any business dating a 50 year old. They’re in completely different stages of life", ">This was a totally foreseeable situation.\n\nRight?  Very simple math.\n\n1 Bedroom apart...... 8 kids..... plus grand kids.......\n\nHell yeah people are going to be crashing on the couch.", "> Sounds like a catch.\n\nI was wondering who she turned down.", "If she is dating a man with grandchildren he’s a real catch", "And is living in a one bedroom apartment…", "The mere fact that you call making love pop pop tells me you're not ready", "I think OP should spend the weekend with a friend and not come home until the apartment is cleaned up after the weekend. I think the cleaning won't happen unless she does it though. She shouldn't do the shopping and prep either.", "This story has to be fake. OP isn't responding at all. And the conditions seem ridiculous. They also don't expand on what their reasonable objections were.", "They’re HIS children, guess what that means? His home is THIER home too! They were coming and staying there with dad longer than he’s known her I’m sure, so what right does she have to say he can’t have HIS children in HIS home? She doesn’t want to cook or clean for them? Then She shouldn’t cook or clean for them, problem solved. She doesn’t like that her boyfriend actually wants to be a present father? She can move her ass back out of HIS apartment.", "Custody and time sharing are two completely different things and people often get the terms mixed up. It’s pretty obvious that the kids spend as much time with him as they want too. He sees the kids and they spend the night. Don’t act like he’s a dead beat.", "Right lol I saw the age and her saying “he didn’t ask he TOLD me” like girl off course he told you. Your legit the middle child between his 30year old sons and his teenagers 😅 no hate but maybe reevaluate things girl! I know some people think “ago doesn’t matter” but if you are younger then his oldest kid it’s kinda weird", "She thought it was the carnival", "She thought the red flags were a ticker tape parade welcoming her into his life…", "All that child support does wonders for the ol' retirement account", "Yup, the first paragraph was a wild ride.", "I’m assuming the amount he must need to pay in monthly child support is why it is a 1 bedroom… yeeesh", "Definitely fails the half your age plus 7 test", "More likely his pe*** is shrunken in.", "He's a father of 8 (5 of which are still minors), and clearly somewhat involved in their lives. She should have a say, but not in his custodial/visitation matters. As people always say when men are dating women with kids - this is a package deal. Don't like the whole package, don't move in.", "Really???....ok so he spends time, but they literally don't have 1 single room for any of them. Not 1. Children should have a room at their other parents house dude. That's like bare minimum...even if they have to share a room between them, they still need at least ONE room.", "I really thought the age gap would be the worst part of it but oh nooooooooo I was so wrong.", "I know! I kept reading and with every sentence, then every paragraph, I was thinking \"And this is still just background?!\"", "I walked by someone wearing Drakkar Noir not that long ago and I was immediately transported to the hallways of middle school…", "I am adding shituation to my vocabulary. I haven't heard it before today, and it's brilliant.", "This.", "THIS! YES! DO NOT CLEAN AFTER THEM!", "His next baby's mama.", "Nah, I think it's \"baby\". Which given the age difference is 🤢", "He's got 5 minor children, and a bunch of grandkids. And is a somewhat involved father, it would seem. \n\nWhere exactly did OP imagine these kids would be staying, when they're with him?", "We do not know that every child has a different mother, the post says the two girls do. That doesn't mean they aren't full siblings with some of their brothers.\n\nOP is older than six of the eight kids.\n\nThere's plenty of red flags and reasons to be concerned without exaggerating or making up details.", "Yep only a 27 year old would be dumb enough to fall for this shit.", "She doesn't sound like she wants to be part of his family, despite wanting to be part of his life. She will never be able to separate the two.\n\nShe doesn't seem very smart at all.", "You mean her *daddy*", "Good deal for him, eh?", "I definitely see this perspective but the way I read it I was thinking maybe he intentionally keeps a sort of bachelor pad as a way of only having a few kids at a time (usually). I was picturing a decently nice/spacious one bedroom because 7 males, at least 3 of them adult-sized, \"camping\" in a living room for a weekend would require some space I'd think. Your interpretation probably makes a lot more sense though 😂 He probably doesn't have much left after child support each month.", "I didn't even know until I Googled to make sure I spelled his last name correctly. He was definitely one of those that I assumed had died a long time ago.", "Certainly not in a 1 bedroom apartment, right?  But she should have expected the kids to be around on a regular basis.", "If people don’t want to be around kids, they need to stop dating people with kids. Not smart and living in a fantasy land for dating a guy with kids and then not wanting the kids in his apartment.", "Probably going to child support.  He's probably got a ton of support money he has to pay out every month.", "Nitpicking: a lot older than her, but not more than twice her age. My mathematical side is offended. She's 27, he's 23 years older than her. \n\nShe should def gtfo there.", ">and sit topless in the living room, listed to the Indigo Girls and cry.\n\nWait. With you present?", "My dad used Irish Spring and Calvin Klein Eternity. I always hated it because Eternity kinda smells like Worcestershire sauce to me. Maybe there's something wrong with my brain.", "Well she knows he lives in a 1 BR, so she must have realized that's where they'd be staying on their visits with dad too. And yeah, like every dude who's dating a woman with kids is told here - package deal. Deal with the package, or leave the relationship.", "Or just don’t date a man who has 8 kids and grand kids and can only afford a one bedroom if you don’t want to feel like the old woman in the shoe.", "Nah, this guy's kids are all at least a year apart, got a ways to go before he reaches Cannon level", "Yep. Me, the other two roommates, our friends and boyfriends/girlfriends. I moved out, she started dating one of the roommates but didn't tell roommate that she still had a girlfriend who believed that they were exclusive. Got busted by roommate, stopped paying rent...worst roommate I ever had!", "Yeah, you're right. I think Cannon had 4 kids in 2022 alone haha", "So awkward 😂🤣😂"]}