{"id": 9761, "submission_id": "110bxtb", "title": "AITA for insisting my family pay me?", "selftext": "Alright so I've always assumed I've had a good relationship with my *adopted* parents and siblings and haven't really had any problems with them until this. So I(F20) was told about my sister's birthday that was happening and my adopted parents asked if I was going to be attending. I told them that since it was after work I could just swing by after my shift. I asked if there was anything that I needed to bring or if there was a specific dress code for the party as I probably wouldn't have time to change out of my work clothes. They told me there was no dress code but asked if I would be willing to get the food for the event especially since I work at Zaxby's and they offer party packs and everything so I'd be able to do that and get a discount. I told them sure there wouldn't be a problem with that, but if I could get some assistance with payment as it still would be around $600. They agreed that they'd pay me back part of the cost. So come to the night of the party I show up and bring the food into the party and basically for the rest of the night I get treated as a caterer instead of a party guest, even by my parents and my sister which frankly made me slightly irritated as I didn't really get to enjoy the party at all. So after the party I pulled my sister off to the side and I handed her a bill. She looked confused as it was the full bill for everything that I had gotten. I told her that since I didn't get to enjoy the party and was delegated to working it then I'm not going to work for free, even for family after I had expected to be a guest, I didn't even get to have any of the food. This got us into a pretty heated argument where my sister was saying that I was ruining her birthday and that it was an asshole move to charge for the entire bill after I had agreed to bring food for the party. I said that it was an asshole move to treat me as if I was working the party and that the bill stands. The argument continued on for a little bit before I left after telling her that I better get payment. But now I'm wondering if it was a little harsh and if I am being an AH.\nEdit: since it seems to be a common question of why I went to my sister let me explain my parents had left earlier than when the party ended and I didn't realize it at the time. I felt comfortable giving my sister the bill because she also treated me as a caterer and not a guest. I don't think that it can excuse if I'm an AH or not but since people keep asking I'll give an answer.", "created_utc": 1676194941, "permalink": "/r/AmItheAsshole/comments/110bxtb/aita_for_insisting_my_family_pay_me/", "score": 41, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I might be the AH because I had offered to bring the food to the party and that I would cover most of the bill but at the same time I didn't expect to be treated as if I was working the party.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\nBut you should have directed all that towards your parents, not the sister.  \nRegardless, if you were treated like a caterer, you better charge them for the full amount. \nYou didn’t enjoy the party, you didn’t eat and were treated poorly. They need to compensate.", "INFO:\n\n1. How old is your sister? Is she your adoptive parents biological child?\n\n2. Does your adoptive family have a history of singling you out or treating you as less than their biological children?\n\nPeople in the comments need stop saying that \"they're your parents, that's all that matters\" without actually knowing ANYTHING about this specific situation. Not all adoptions are great, some adoptive parents suck balls.", "NTA.  Crappy for that to happen to you. They need to apologize for disrespecting you and they need to collectively pay you back.", "Wow NTA, I hope this was just some kind of misunderstanding but don't let anyone treat you like that again please. You deserve better,", "NTA - You should not have been treated as a caterer and it was wrong of your parents to make you work for free. Even if you had agreed to bring the food, you still should have been able to enjoy the party as a guest.", "NTA for wanting to be reimbursed for what you paid for the food, but YTA for the way you handled it. The bill needed to go to your parents and not your sister. \n\nAnd your comments to your sister were inappropriate. \n\nAnd what more needed to be done that made you the \"caterer?\" Didn't the food just need to be set out and that's it? Participating in the set up or clean up of a family party is just part of being a family member. Doesn't necessarily make you the caterer, but it looks like you felt insulted.\n\nAlso, why are you being so careful to say \"adoptive\" parents? Do you not feel like a member of the family? Perhaps you have some underlying emotions about your family connections that you may want to explore further.", "If they ask again tell them to order online", "I mean it was her birthday, if your parents said they would pay it was between you and your parents. You are NTA for asking to be paid, $600 is a lot of money, but you are asked at the wrong time, worng place and wrong person. I agree it can feel rubbish when you expect to be a guest at a party and they ask you to work it. But tbh your parents probably \"worked it\"too in their own way, ik for my 18th my mum was doing drink, my dad did the BBQ, my brothers helped with chairs so that I wouldn't have to lift a finger, and I'll be doing the same back. Sometimes it take everyone to put a little in to help the person who's birthday it is. I wouldn't bill them for your time, you should have agreed a set amount to be paid before the party to avoid arguments. \nThe fact theya re your adopted parents doesn't make an ounce of difference, they are your parents and chose to have you, you sre their own and if they treat you differently when there is no need to then that's a seperate issue", "ESH for being treated like the help but you're also an asshole because you presented the bill to your sister, when it's your parents that agreed to pay you back for the food, your sister had nothing to do with that.", "I have to wonder why you keep putting \"adopted\" on front of your family. Don't get me wrong you can put that but it wasn't pertinent to the story. I think there may be more going on here than just this incident. Do you not feel like a part of the family? Have you spoken to your parents and sister about it? I could be way off the mark here so feel free to completely ignore what I'm saying. All in all, if it's down to the money thing, then it's not fair for them to expect you to pay for all the food. However, I feel like this might be a miscommunication issue. ESH.", "YTA. You state your parents asked you to bring the food, which means you should have brought up the matter of payment with them, not you sister. I understand you felt like you were treated as an employee, and that sounds like maybe it was true, but the time to bring that up was in the moment not after the party was over. \n\nYou also seem to be saying it’s because your adopted. Unless there is a life long pattern of them taking advantage of you, which it seems like your saying their isn’t, don’t assume it’s because your adopted. These kinds of disagreements happen all the time in all families, biological or not.", "ESH. Why didn't you give the bill to your parents? I'd have gone with Not AH if you had given the bill to your parents. Giving the bill to your sister on her birthday doesn't sound like the most dignified way to go about it.", "ESH. Your parents should not have let you cater the party, but why didn't you just say so? Like \"Here's the food, help yourself, I'm not the caterer\" and pour yourself a drink and enjoy the party? You went along with it and then made a fuss afterwards when it was too late.\n\nAlso: why such emphasis on the fact that you were adopted? Does not seem relevant here.", "ESH except for the sister\nYou and your adoptive parents decided on the food. You should have spoken to them about the bill instead of your sister. Your parents and your sister shouldn’t have designated you as the caterer", "INFO. What did you mean by them making you the caterer? What was so time consuming or so much effort, or such an inconvenience? Because when I am at friends or families parties, I help out the hosts to serve food, especially if one of them is the birthday girl/boy because I want them to enjoy their party not be stuck in the kitchen the whole time.", "ESH, except the sister ? I think. Soft YTA because you should not have taken the bill to your sister or you could have had that discussion another time. You did put a \"down\" to her party whereas your parents were in charge of the bill. You should have had that discussion with them.\n\nYour timing was not cool even if I totally understand your disappointment... You should stand by your decision because you *should* get back the money, but perhaps have another discussion with your sister on another day to talk about how you perceived her party ? Just an idea", "ESH, they should have helped you unpack the food so you could enjoy the party just like everyone else. Also, it was your parents that told you about the party and asked you to bring the food so why did you hand over the bill to your sister? On her birthday? You should have given it to your parents instead.", "YTA this has nothing to do with your sister, it was with your parents. you had to \"unpack the food and keep it warm\" aka lighting a sterno can underneath which takes two seconds.\n\nYou chose to include your sister in this and intentionally ruined her night. Get over yourself", "ESH. You seem to imply that the fact that you're adopted is a factor here but haven't included any anecdotal evidence to back it up. These types of arguments are not uncommon in families.\n\nYour fam should absolutely have assisted in taking care of the food and tbh, I don't think you should have agreed to pay for any of it, just picked it up. I guess I don't really understand why you couldn't have put some serving spoons in there and simply walked away to enjoy the party. \n\nTexting your parents to be like 'that wasn't cool, here's the entire bill etc' would have been a better option imho than taking it to your sister, who probably wasn't aware. That being said, you're probably not gonna get that money back, so you need to decide if it's worth the drama.", "ESH. You were mistreated, but you immediately escalated conflict by handing your sister a bill instead of sitting everyone down to talk to them. \n\nI cannot say for sure whether you were forced into the role of caterer, or if you fell into it and no one argued because they assumed you were being helpful. But remember that you have the power to say no in the moment; exercise it so that you do not end up so bitter afterward that you lash out.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAlright so I've always assumed I've had a good relationship with my *adopted* parents and siblings and haven't really had any problems with them until this. So I(F20) was told about my sister's birthday that was happening and my adopted parents asked if I was going to be attending. I told them that since it was after work I could just swing by after my shift. I asked if there was anything that I needed to bring or if there was a specific dress code for the party as I probably wouldn't have time to change out of my work clothes. They told me there was no dress code but asked if I would be willing to get the food for the event especially since I work at Zaxby's and they offer party packs and everything so I'd be able to do that and get a discount. I told them sure there wouldn't be a problem with that, but if I could get some assistance with payment as it still would be around $600. They agreed that they'd pay me back part of the cost. So come to the night of the party I show up and bring the food into the party and basically for the rest of the night I get treated as a caterer instead of a party guest, even by my parents and my sister which frankly made me slightly irritated as I didn't really get to enjoy the party at all. So after the party I pulled my sister off to the side and I handed her a bill. She looked confused as it was the full bill for everything that I had gotten. I told her that since I didn't get to enjoy the party and was delegated to working it then I'm not going to work for free, even for family after I had expected to be a guest, I didn't even get to have any of the food. This got us into a pretty heated argument where my sister was saying that I was ruining her birthday and that it was an asshole move to charge for the entire bill after I had agreed to bring food for the party. I said that it was an asshole move to treat me as if I was working the party and that the bill stands. The argument continued on for a little bit before I left after telling her that I better get payment. But now I'm wondering if it was a little harsh and if I am being an AH.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH they should not have treated you like a caterer. That wasn't right. However, as a 40 yr old woman who has been the designated cook/takeaway provider for many gatherings I can tell you the person who walks in the door with the food often gets lumped with all the work. This isn't right but nearly always happens. To avoid this either don't bring the food or you simply just put food on table and say \"everyone help yourself\" than walk away, anyone asks a question just say \"foods on the table any problems you will need to sort out yourself\". I do not think being adopted had anything to do with this situation at all.\n\nAs for the bill, this is were I think y t a because you had no agreement with your sister that she pay you anything. Your agreement was entirely with your parents and if they had already left then you call them and discuss with them. You cannot demand money from ppl who had nothing to do with your agreement. You can say \"sis, I think you treated me real low and I'm owed an apology\" you cannot say \"because I don't like how you treated me I am charging you money despite have no agreement with you\" if you actually were the caterer you can't sued the party host you can only sued the person you have a contract with.\n\nSo in summary they are A Hs for treating you like a caterer, you are an A H for demanding money from a third party to your contract just because you didn't like their behaviour and were to lazy to pick up the phone and call your parents. All together that makes ESH.", "The reason I directed it towards my sister was the fact that she too treated me like I was just a caterer and not a guest, so as she was responsible for the party, and my parents had left earlier on I had nobody else to give it to.", "My sister, who's their biological daughter turned 24.\nWe've had a good relationship yes, but ultimately I was adopted because when I was a baby my parents died by a DUI and my adopted parents were their best friends and my god parents, I think they felt more of a responsibility to adopt me than let me go into the system and go through foster care. I've never truly felt like their biological daughter.", "Sound slike someone had to \"work\" the partyand it ended up being you and it could have easily been any other family member", "I wondered about the ‘adopted’ bit too.\n\nThese kinds of things can happen in biological families too. I understand that you’re upset, OP, but this is your family. Adding the ‘adopted’ bit could further ruin relationships if it gets back to them. I would focus on the issue here, which is that they unfairly created a financial burden for you and that you were treated like staff so you didn’t get to enjoy the party.\n\nESH here but them more so than you.", "Said in another comment, my parents left early and as she also treated me like I was a server, I felt it was appropriate as she was responsible for the party.", "Exactly. At a family party, usually the whole family is chipping in. Trash overflowing? Can someone take care of that please? Ice bucket empty? Can you please refill that? Drink spilled? Oops! We need more paper towels. Can you grab a roll?  All of that is just part of being a family.", "Not just unpack the food but also serving it. And insuring that it all stayed warm and everything.", "If they ask a favor ever again ask for the   money in advance  .also as soon as you are starting  to get treated  like the caterer or not ok say goodbye and leave asap \n\nNta", "Your anger towards your sister is fine because of how she treated you. But this conversation needs to be between you and your parents because it was them who asked you to bring the food, not your sister. Your frustration is fine on your sister, but the conversation needs to be redirected to your parents.", "Then a very light YTA for misdirecting your justified feelings. Your parents are the villains in this for just hoofing the costs and service on you. Your sister might not have known that you were asked and literally peer pressured into this. Not to excuse her either, you know her better, but I can imagine myself thinking my siblings were just riding a good vibe of celebration.\n\nRegardless your parents ARE ABSOLUTELY the AHs, and I hope you give the bill to them. Talk with your sister to explain what happened, and hopefully that solves it between you two", "I am sorry to hear that. Sounds like it might not have been the best family dynamic, even if they tried (not commenting on their character, it's just a reality). Please remember that you don't owe them anything. You were a baby.\n\nNTA\n\nI would be pissed if one of my siblings/friends/parents/anyone remotely close to me invited me as a guest and then expected me to work their party. It's one thing of they have specifically asked you to help out but I'm not getting that from your post.  No one gets to expect free labor from anyone else.\nI personally wouldn't have confronted her at the party, but I recognize that you might have your reasons for that, so whatever.", "But you know where your parents live right? You could have followed up with them the next day for the payment. \n\nAnd how exactly did they treat you like a server? Did they ask you to walk around with trays of food, offering food to people? Wasn't the food just set out for everyone to help themselves?", "But why did you do that? Did you ask them to help with the unpacking? And did they specifically tell you stay with the food all night and take responsibility for it? You could have just unpacked, filled your plate and begun mingle with the rest of the party guests.", "Was unpacking the food really a big deal? And what do you mean \"serve it.\" Were you making up dishes for people and delivering them like a restaurant? Because that would be odd for a party. Usually you set out the food and walk away.\n\nHow did you have to ensure it stayed warm? Chafing dishes just have the little flame thing underneath. No effort required.  \n\n\nIt just seems that you trying to make your assistance seem like a bigger deal than it actually was."]}