{"id": 9804, "submission_id": "110r17t", "title": "WIBTA for requesting a child be removed from my class due to his parents?", "selftext": "I am an art teacher at a school in a small town, recently I welcomed a new student to the class, he had previously been homeschooled but had begged his parents to let him go to normal school with his friends, he's a great kid, he has already fit right in with the class and he does really great work, my only issue with him has been that he does not ask to leave the classroom, if he needs a bathroom he just leaves. I'm not the strict \"everything needs to be my way\" kind of teacher, but administration has a very strict policy for students outside of classrooms during class periods.\n\nI asked his parents to come in so we could discuss it, to try to get them to help me figure out a way to get him to follow this rule. They arrived and seemed like fine enough people, but then saw my photo on my desk of myself (28m) and my husband (31M) they asked who it was and I was honest, it has never been an issue before. They later called the school to report me for \"inappropriate behavior in the classroom\" mind you I do not talk about my husband in class, I am there to teach, not preach lol. \n\nAdministration is definitely with me on this, but honestly they have started sending some really rude emails to my school provided account and I would like to honor their wishes that their child not be \"exposed\" to my \"disgusting lifestyle\"\n\nI may be the asshole here because as good of a student as he is I just no longer feel comfortable with him in my class, he loves art class and there are no other art teachers at the school so he'd be removed from the course entirely which I know isn't fair to him. But it also is not fair to me to be called things like groomer, and accused of working in a school to \"corrupt innocent minds with [my] filth\"\n\nEdit: forgot to add, they have requested I be fired and replaced\n\nEdit 2: gonna talk to a lawyer, but also we have talked it over and decided to move after the school year, going to go somewhere a bit bluer, thanks everyone!", "created_utc": 1676237899, "permalink": "/r/AmItheAsshole/comments/110r17t/wibta_for_requesting_a_child_be_removed_from_my/", "score": 2490, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I am considering removing a student from my class because of his parents behavior\n\n2) he is a good kid and loves art class, it's his favorite and he has real talent (especially for an 8 year old) and it's not HIS fault\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, I’d also want to distance myself from such parents. Unfortunately, the only person who will really be affected by their madness is their child. And I don’t see how having a picture of yourself with your husband is so wrong. Unless you’re naked on a bed with him.", "This is something for the school administration to handle. You should not have to put up with this kind of harassment. They need to make it stop one way or another.\n\nEDIT: I read your comments about not feeling safe now. Your school and maybe the other parents need to have your back here. If they are already making a public issue of it, you might want to get police involved too.", "NTA, but the school may not be able to remove him entirely, so I would advocate for another adult to be present in the room when you teach his class. You should also insist that any further communication should go through administration. \n\nHis parents are already making false allegations, and if the administration is not willing to address their behavior, they at least need to take steps to protect you professionally. \n\nA lot of the y t a and e s h comments are ignoring the very real danger that the parents’ behavior could be to your career and livelihood. Of course you don’t want to punish a child, but if given the choice between your career and a child being in your class, there is nothing wrong with protecting yourself.", "NTA. But the administration should be doing more to deal with them.\n\nI lot of parents homeschool their kids to keep them from being exposed to anything they do not approve of.  The actual education is secondary.\n\nIf yours school's backing is strong enough they may withdraw him.  Sucks for the kid though.", "NTA, the parents made it clear they are going to antagonize you until he is removed, you'll both be happier. It's too bad for the kid because you'd probably be a great influence but for your own peace of mind, but it's not worth the misery.", "NTA. I would recommend that you make sure that you are never alone with the child in case his parents try to claim that you engaged in inappropriate behavior. If the child wants to speak with you alone, make sure the principal or another teacher is present.", "NTA. Ever wonder why he was home schooled in the first place?", "Speak to a lawyer.", "NTA- Either way we know your Job is safe, but you shouldn't have to put up with harassment. Before removing a good student from class, I would attempt to use the schools resources to have an OOP filed against the parents.", "NTA here, you need to protect yourself here. Do not expect too much from the school. They tend to bend to parents. First and foremost you probably just need to report these emails to the police and see if you can get a tro. Are we talking about a small private school or an actual district. Either way, there should be a governing body they will eventually escalate this to which more than likely won't be good for you as I stated earlier schools ultimately always tend to bend to parents and generally the most horrible of parents that pops up out of the woodwork.", "NTA;  This kid's parents suck and it isn't your fault.  With them outwardly hostile towards you, you cannot provide their child a safe environment for education.  Your employment and safety may be threatened.  Suck for the kid who is the victim of his parent's prejudice.", "If they don’t want their son to be in your class because you are gay then they need to be adults and tell the school to switch his class instead of sending you hateful, homophobic emails. To be honest the school should have already moved him given that they know about the parents behavior. I worry that if you request he be removed his parents will feel like they have “won” and that’s not fair to you. Let the kids parents be the “bad guys.” My judgement is NTA and I feel sad for both you and your student.", "NTA. They don't want you teaching their kid and you aren't comfortable teaching him anymore. Hopefully they can find him an online lesson or something similar or at least give him supplies to keep going on his own - if they were previously homeschooling him they should be able to find him some way of doing it on his own.", "NTA - you a teacher and you are allowed to protect yourself from an abusive environment.  It sucks that the kid gets punished by being removed but either the school steps up and provides you more support or you protect yourself", "Honestly it's tough to make a judgment here. You're NTA, but neither is the kid, and you having him removed from your class is taking away a fantastic opportunity for growth for him. \n\nIs it possible for you to have these emails redirected by the school's IT department? Perhaps someone in the administration can step in and screen these emails for you, or the parents can be told that they must contact the administration with any concerns instead of reaching out directly to you? On that note, are you even sure that these emails will stop if you have the kid removed, or are these parents going to keep harassing you or the school about you?\n\nUltimately, I get it. I wouldn't want to be in an environment where I'm being degraded like that either, and if you choose to have the kid removed I can't blame you.", "INFO: Could you simply block the parents emails and force them to communicate directly with administration, rather than with you?", "NTA, with some conditions. \n\nListen, as a former teacher, I get what a nightmare some parents can be. Have you brought the harassing emails to administration's attention? What was their response? Because, honestly, they should be the ones handling this. There needs to be a clear line drawn by administration that administration will NOT be firing you and that the parents either have the choice to remove their child from your class or keep him in art and keep their mouths (and computers) shut. \n\nHowever, if the parents decide to keep their mouths shut, then the young man should be allowed to stay in your class. It's not his fault, and he shouldn't be punished for the actions of other people.\n\nSo, here's my final decree: Your administration is TA if they won't take a firm stance with TA parents of this student. However, YWBTA if you insist the student be removed if his parents back off.", "NTA\n\nSorry for the kid, but his parents are the cause of him being removed from class.", "NTA, and I'm sorry this is happening to you. The administration should attack this problem head-on and make supporting statements against these rumors. Can you file a police report for harassment and defamation?", "NTA These people will do ANYTHING to manufacture a reason to get you in trouble. That would leave all your students without a teacher. Protect yourself for all your students' sakes.", "YWNBTA for requesting that the child be removed from your class, so long as you have exhausted all other options in dealing with the parents. You are not ‘punishing‘ him, and your safety— emotional and physical— need to be prioritised over his feelings. It’s a shame that he loves art and that there are no other teachers to go to, but that’s on his parents, not you: both you and the boy are their victims. Having said that, he may not be able to be removed if art is a mandated part of the curriculum in your area.\n\nIn my country, parental behaviour like this is generally strictly regulated— not just through the union (though that’s one avenue), but through our OH & S (occupational health and safety) laws. I don’t know if this is an option where you are, but in cases of harassment here our admin will often develop protocols for the parents: e.g. they must not have direct contact with you and are only allowed to email the prin, etc. Having admin field their nonsense would at least resolve the in-school issues without necessitating the boy’s removal. Outside of school is harder, obviously, if they escalate to that point— I would think this aspect is an issue to discuss with your union, police, a free/low-cost legal advice service in your state, or even contacting an lgbt+ advisory service. If you’re in the US, Lambda Legal also outlines your protections on a state-by-state basis, including ones specific to schools: [https://www.lambdalegal.org/](https://www.lambdalegal.org/) .\n\n(Also, if you’re not already, *document everything).*\n\nEdit: first paragraph, for clarity.", "The parents seem like absolutely horrible people and it’s terrible how they abuse you. Also, if straight teachers have the right to have photos of their families then so do you. The whole movement against queer teachers is quite frankly deeply disturbing.\n\nHowever, I’m going with YWBTA. You shouldn’t punish the kid for having terrible parents. The child has probably been brainwashed from their home schooling. So being a positive gay role model in their life will probably be a good thing that can counteract the brainwashing. Get your revenge by giving the kid the best time ever in art class, so amazing he never wants to leave. Become his favourite teacher. Hopefully then he will never want to go back to homeschooling and exposure to the wider world will make him realize what awful parents he has.\n\nIn the meantime, is it possible to block their emails and have the school mediate communication with a parent through a third-party so you don’t have to deal with them directly?", "ESH - don't punish a kid for their parents. Work with the school to manage your boundaries and wellbeing, but don't exclude a kid for their parents bad behaviour.", "Ooof ok meeting with parents is not how any teachers I know would address the bathroom thing. You tell him, then the principal tells him, then administration contacts the parents if it is a school rule not an art class issue. And the initial parent contact would be an email or phone call opposed to an in person meeting. Did administration request that you meet with the parents or was that your call? Obviously these parents are horrible terrible people but you invited them into the whole situation when it was decided the bathroom situation could not be handled in school and the parents needed to be brought in. Ultimately you should not punish the kid bc of the parents block their email or collect them for a harassment case. YWBTA if ur only solution is to dump the kid.", "Ywbta as you don't punish a child for the parent's behavior. But it seems likely with what you claim is occurring that the parents would have already asked he be removed,  yes?", "YWBTA. \n\nThe child is not their parents' terrible choices. Let your administration deal with this. \n\nChances are, the parents will remove the child on their own, it's a shame if they do, but then you're not the AH.\n\nAlso, if the parents remove the child, the child is more likely to oppose the parents and their way of thinking. If you get the child removed, it's all the more likely the child thinks \"maybe mom and dad are right\".\n\nEdit: OP has been drip-feeding additional (very relevant) information throughout the thread that was not in the original post. Sounds like there may already have been an attack, which probably should have been mentioned in the first place. I'm not changing my initial post here because that behavior is BS, but know that I made the call I made based on the information that was originally presented.\n\nThe spirit of this sub is \"tell your story and let the sub decide\". I detest this behavior of \"tell half your story then come back and argue with people and let out the rest of the story one reply at a time\". Yes, this is potentially a serious situation. If that's the case, this isn't the place for this situation.", "Ywbta if you punish a child for their parents behavior. It seems at this point the parents are the sort who would continue, possibly more if you removed their child.\n\nYour school district has the ability to protect you, even if small. Save any evidence, show the principal and school board. Then tell them you need to block these people, for your safety.\n\nIf they disagree then consult a lawyer. I understand being low income and worried, but a lot of people in the field of law do pro Bono work and will direct you to someone who can do that. Especially in relation to hate speech/attacks on someone who is a LGBT minority.\n\nDon't make the kids life any worse, he is also a victim here and likely is treated badly at home. Defend yourself and his need to be around other people his age/different than him.", "NTA for disliking the parents and their attitude towards youm YWBTA if you remove the child. He likes your class, and he doesn't give you problems. He more than likely doesn't even care about your sexuality.Go to your admin, have them present for any meetings between yourself and the parent and CC your admin in any email you may send to them. Also, I'm assuming you do this already via lesson plans (assuming they're required for you), document what you're teaching so they can't go against you with some wild claim that you're grooming their child.\n\nIt's the parents fault that they're being ignorant. The kid is just trying to have fun in a class he enjoys. Don't take your issues with the parent out on the kid if he's genuinely a good student- all that's going to do is; 1. Make him feel like he did something wrong or 2. Make him dislike you and reinforce his parents ideals.\n\nEdit (after reading some replies in the comments): your school board should have a team of lawyers at hand, if not one assigned to your school.  If they are threatening you, especially via email or any sort of written method, take these issues to the school board, with evidence, and seek legal advice.", "ESH, if you get the child removed. It wouldn't be fair to punish the child for their parents behavior. You can show this child that his parents are wrong by being accepting of him. Talk to the principal and other staff members and create a plan to address the child's behaviors. He clearly wants a public education and may already know his parents views are problematic.", "YWBTA it's not his fault that he has awful parents. Chances are the parents will end up pulling him out and homeschooling him again. So at least give him the chance to learn something outside his awful upbringing", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am an art teacher at a school in a small town, recently I welcomed a new student to the class, he had previously been homeschooled but had begged his parents to let him go to normal school with his friends, he's a great kid, he has already fit right in with the class and he does really great work, my only issue with him has been that he does not ask to leave the classroom, if he needs a bathroom he just leaves. I'm not the strict \"everything needs to be my way\" kind of teacher, but administration has a very strict policy for students outside of classrooms during class periods.\n\nI asked his parents to come in so we could discuss it, to try to get them to help me figure out a way to get him to follow this rule. They arrived and seemed like fine enough people, but then saw my photo on my desk of myself (28m) and my husband (31M) they asked who it was and I was honest, it has never been an issue before. They later called the school to report me for \"inappropriate behavior in the classroom\" mind you I do not talk about my husband in class, I am there to teach, not preach lol. \n\nAdministration is definitely with me on this, but honestly they have started sending some really rude emails to my school provided account and I would like to honor their wishes that their child not be \"exposed\" to my \"disgusting lifestyle\"\n\nI may be the asshole here because as good of a student as he is I just no longer feel comfortable with him in my class, he loves art class and there are no other art teachers at the school so he'd be removed from the course entirely which I know isn't fair to him. But it also is not fair to me to be called things like groomer, and accused of working in a school to \"corrupt innocent minds with [my] filth\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YWNBTA. The kid is clearly having some issues with traditional school structure. This whole thing got started because he wasn't adhering to the rules. It's disruptive and you have other students. You asked for a conference to discuss the disruption with his parents, and it turned into homophobic bullying by people who conflate orientation with lifestyle choices and child abuse. Your classroom has now become emotionally unsafe for you because he's there, potentially unsafe physically as well depending on how far this goes. Is it going to stay at cyberbullying, or do they proceed to doxing and threats? I feel for the kid, but your class isn't only about him and neither is your career.", "NTA.   geez.  The parents are total AH", "YWBTA for having the child removed unless he's parroting his parents' bigotry and hate. It's punishing the kid, and he clearly needs the exposure to more tolerant views. You also have a right to a harassment free work environment so the proper recourse here is to notify the parents they'll be communicating through admin and/or sending actual letters, then set up a rule in your email box to have anything from them automatically forward to the department AP.  If anything actionable or genuine concern is sent, your AP will notify you, and you'll be able to schedule a supervised meeting. Although, for the most part, they tend to stop because hate mail isn't as fun for them when others see it. \n\n(Taught 15 years before leaving because of people like this)", "ESH. Getting students to ask to use the bathroom is extreme and it was unwarranted to get parents involved for this. The parents suck for being rude in your emails. You are a school teacher you can't just 'remove' a student from your class. Don't punish kids for their parents.", "Thankfully my classroom is under camera", "Not really, I know a lot of homeschooled kids in the area for various reasons", "Our schools IT department is currently not a thing lol, we barely have a computer lab, the computer teacher runs everything for us", "OP cannot put himself at risk for this child, regardless of \"opportunity for growth\".", "I am not allowed to block parents emails, I can request they go through admin\n\nI'm more concerned about them getting me attacked outside of the school", "No, OP’s job is to teach Art, not to unteach homophobia. It’s not OP’s responsibility to undo the parents bad influence by “being the good gay role model”. OP isn’t punishing the student, it’s the parents who are punishing the student by ruining OP’s ability to comfortably teach in his own classroom. If anything; getting dropped from the Art class will be an effective lesson in the consequences of their parent’s bigotry. OP is the victim here. The child’s lack of art class would be the parent’s fault, not OP’s. NTA", "He's not TA for protecting his career and his family and his LIFE. Good lord. Tragic for the boy to lose an opportunity, of course, but his art instruction doesn't trump the teacher's safety.", "He's worried they're going to hate crime him, my guy. It's far past that.", "They are attempting to get me fired and have told a bunch of people in town I am a p*do, I feel unsafe at this point OUTSIDE of school grounds", "I had attempted multiple times to rectify it internally, parents were called in when it didn't work", "He's not being an asshole or punishing the child. He's protecting himself. It doesn't sound like it will be long before these people file a complaint that the teacher has molested their son. He needs to have this child removed from his class like yesterday.", "They are asking that I be removed and replaced", "The parents are slandering me and attempting to get the school board to remove me, they have also told several people in town I am a p*do", "School board can't protect me from getting attacked at the gas station again", "I really just don't want them to end up getting me attacked in public by branding me a diddler, they also are attempting to get me fired", "OP is worrying about them murdering him. It's not about punishing the kid. It's about his own safety, which must come first.", "They're attempting to get me fired through the school board and have managed to get a few people in town to believe I am a pervert", "I literally do not have control over the bathroom thing, the school requires it for \"safety\" reasons, I attempted to talk to him directly as did another teacher (his general studies teacher) she was unable to meet with the parents so it fell to me after we tried everything else", "It's not about asking permission for going to the bathroom,  it's knowing where the students in your care are.  If there's a fire or a lockdown, teachers may need to tell firefighters/police the last place a student was if they can't be accounted for.  It the student has a medical episode or falls and hurts themselves, the teacher would be the one to notice they've been gone a concerning amount of time.  Teachers are considered caregivers while students are under their supervision, and in some situations can get in deep trouble if they can't account for their students. OP is NTA for doing their exact job as is required of teachers everywhere.\n\nThese parents can easily ruin his life.  He needs to distance himself from this whole family.", "There's this weird thing where teachers need to know where students are.", "I’m glad and sad at the same time.  And I feel sorry for the boy, but you need to protect yourself and make sure they have zero ammo, no matter how innocent.  People like that can vibe vindictive.", "The majority homeschool for religious reasons, they generally do not interact outside there church.", "Really? Look at your interaction with his parents and think it through. Religious bigots perhaps?", "It sucks but your safety is the most important thing.  If your administration won't take whatever steps are neccesary to protect you than the kid has to go.", "The parents could try to escalate this. NTA.", "OP, if that’s the case I suggest you consider filing a harassment report with the police.", "Consult a lawyer.", "That really sucks. I'm really sorry you are dealing with this. Although I'm not sure it would stop if you did ask the kid to be removed from your class. \n\nAgreed re consult a lawyer.", "I’m saying it shouldn’t have fallen to the art teacher if it is a school rule that he was presumably breaking in every class. Not that it matters at this point but small town homeschoolers often do so bc they don’t trust public education bc of their extreme views. This was never going to end well and it sucks that it was over something so trivial as asking to use the bathroom", "Well you say admin supports you so that isn't happening. Have admin talk to parents about how they are not allowed to send abusive emails and would they like son removed from the class.", "Do you have a lawyer? That is slander. Get a cease and desist sent. Or have school block their email from your account and have principal deal strictly with them.", "Nothing about this is fair for you, but getting the kid kicked out confirms all the parents' hate toward you and doesn't hurt them in the least. It hurts the kid.\n\nSend a legal threat to the parents if you really want. Otherwise just wait 'em out. They'll fuck off eventually. \n\nPS if the town REALLY believed them, you wouldn't be teaching right now. They can spread all the BS they want.", "No they cant personally, but they should have protected you from it ever getting to this. You need to tell them what is going on and say their lack of involvement in protecting a teacher who is a minority is going to look bad if anything happens. That you are afraid outside of work and don't know what to do. If they don't give any hint of caring then this is ok you to take care of sadly. But keep all evidence of their lack of help, as this is likely against the law for them to not protect you.\n\nCall a lawyer immediately, Google lawyers that work on civil rights and LGBT hate crimes. Waiting for something to happen from the school may not work, and if you do find a lawyer who says that they are in the wrong you may be owed damages/be able to protect yourself if anything these parents do isn't put to a stop by the board.\n\nYou have rights, but removing this child would harm him  and likely make these people double down for 'discriminating' against him. Which could cause you more harm.", "This is a very hard situation to be in. If these parents are acting like this they might get more unhinged if you exclude their child. You should talk to the school board and maybe get some legal advice.", "Then sue them", "I know a few who do it because we don't offer accelerated programs", "In this case yeah", "I'm a teacher, I cannot afford a lawyer", "This.", "I can't afford one and also a lawyer can't stop a stabbing js, but I'll see what I can scrape for it", "By admin I mean principal and Super, idk about the rest of the school board", "I'm a teacher", "Most of the town may not, but a select few definitely do, and are not the civilized protest type", "I will try that but I can't really afford a lawyer, I'm a teacher and my husband is a mechanic, we make ends meet but not by much", "I can't afford a lawyer lol", "We homeschooled are kid for the same reason.\n\nWe were definitely a small minority.", "If you have a union, consult your rep about what resources they can provide.", "What about the ACLU or similar?", "Contact the school district to determine what legal resources it can provide. Document the harassment and reach out to law enforcement.", "Reach out to Lambda Legal or the ACLU.\n\nEDIT:  Is there a local or regional PFLAG chapter near you? They might have a lawyer they can recommend, who would be willing to help you pro bono or on a sliding scale because family.", "You can get a lawyer to write you a cease and desist for pretty cheap. It doesn't carey legal weight, but a lot of times it's enough to scare people into knocking it off. Plus it lays some paperwork in case things do escalate.. Do what you think is best though. You don't want to accidentally incite more hositility", "Some lawyers will offer an initial consult for lower fees, but probably good if you can get a recommendation from a friend. Might also be worth asking for advice in other subs. \n\nI honestly don't think removing the kid will change things. The parents are clearly irrational bigots, I don't imagine they'd just stop now that they've set their sights on you. \n\nIt's a truly horrible thing you are going through. I hope you have supports in your school and community.", "Find a lawyer that will do a free first consultation. What I read the parents are slandering you and you should have a case where the lawyer can write them an official complaint", "Yes, that's who you need to talk to,  the principal first and then superintendent if principal is not helpful.", "Call your union rep. Lawyers are part of why we pay the dues", "You fight them, they're going to fight back harder, and things are gonna escalate.", "The school, the board and the union have access to lawyers. You need to get this dealt with. Also harassment is a crime so you need to go to the cops, if you're genuinely concerned for your safety you need the cops to tell them to leave you alone.\n\nAll interaction needs to be through the principal at this point, you don't need to speak to the parents and the school should be making a decision about what to do and they shouldn't be allowing anyone to harass their staff. They have a duty of care to their employees.", "i guarantee, there is a lawyer out there who will take this case on as a contingency. They slandered you and made false accusations. Get their fucking house.", "You don’t have a teachers union?", "Oh snag, I wouldn't have thought of that", "Local sheriff (towns to small for a PD) is anti-lgbt to an extreme, idk who to contact instead", "They can protect my job only, not me. And if the PTA gets infected I am fucked and will likely need to find a new profession", "The local sheriff (closest thing we have) is on record as hating gay people so much he wishes he could execute them via dragging", "They have started that since the case is a personal conflict and the school is not the one causing it that they have limited resources for me. They currently can't even get me the crayons and paints I need", "Make the report locally to start a paper trail. If nothing gets done, contact the county or state.", "State Attorney General.\n\nACLU.\n\nYour Congressional representative.", "Do you have a concealed or open carry permit? That'll protect you good. \n\nInvite the PTA over for a BBQ. Everyone loves BBQ. Get them on your side. \n\nI fail to see how you think having the student removed is going to help with any of these concerns you have? The parents would still have it out for you in this scenario.", "Solid what a nightmare. His department still has to enforce the law whether he agrees with the homophobia, you can't slander people and you can't send people countless harassing messages. It doesn't necessarily need to even get to his level surely, or is this place so small that he deals with everything personally??\n\nUltimately it sounds like your best bet is to use the school and the union for support. It is their responsibility, and the union is where I would begin, they will lobby for your right to a safe work environment. If you need private legal advice often you can get a free consult or local university law departments run legal clinics of law students supervised by lawyers who take cases pro bono.\n\nI don't know, america is a fucked up place from everything I've heard. I don't even understand how you can have people get away with that shit in positions such as the sheriff.\n\nReally sorry this is happening to you. Any decisions around this child and their parents needs to be made by people above your head and as I said before, all communications need to come from above your head as well.", "Ok but do you pay union dues or are you in a state that does not allow teachers unions? Bc if you are in a union they will provide a lawyer.", "I... Shit I hadn't thought about that... I may just need to move I guess", "He mostly deals personally, small area, I think he has like a single deputy. \n\nHe has the position because nobody else ever runs, there's no option but him so he wins by default", "I pay dues, but they have started this is outside what they provide legal services for since the school isn't against me here", "Maybe. But have you even looked into gun laws in your state? Some states are quite liberal with personal protection. And if the parents see you at the gas station carrying they might think twice about messing with you.", "Huh? It’s harassment at work. And you said admin isn’t doing anything. That’s totally a union thing. Idk dude", "I am not at all comfortable with firearms, as a kid my uncle accidentally shot his wife while I was staying with them, she lived but had brain damage", "I am so sorry for this poor boy, but his opportunity to grow creatively does not trump your civil rights and safety…or the safety of your husband. I would file a report with the police, just to have something on record. The school should provide legal intervention in the “cease and desist” kind of way. And if that doesn’t work, well, guess this will be one more thing he will hate them for later. That is sad. Tragic, even…but protecting his right to be creative (not being snarky; I feel that truly is very important) isn’t going to help him and could truly damage you and yours. NTA", "The parents want to replicate the home school experience.  You won’t he able to overcome their bias. \nYour school needs to stand up for you very strongly.  Make sure the camera footage of your classroom is retained with dates and time of day and kept in a safe place", "NTA", "NTA, and at this point I don't think you have much of a choice in terms of removing him from your class, for your own safety. The fact that they already called you a \"groomer,\" coupled with the rest of the behavior you described, tells me that they COULD eventually resort to accusations of inappropriate behavior on your part. I understand your classroom has a camera, but all it takes is one accusation of \"he touched our Timmy in the bathroom/said x y z/etc\" and you'd have a proper shitstorm in your hands. It wouldn't even matter if you could prove them wrong; a whiff in the rumour mill that a teacher is inappropriate with small children can and will ruin careers and lives. It's too big a risk for you to take. I'm sorry for you and for the kid, OP, but you gotta protect yourself. (edit for spelling)", "Do his parents know your classroom is on camera?", "NTA - do what you need to to feel safe. \n\none idea - can you talk to your principal about setting it so all emails they send to you are automatically forwarded to him so you don’t have to read it, or getting an exemption on blocking? I suspect they’re required by law to protect you more than they are, but it’s not my area of law. \n\nAlso, are you in the US? If so, worth calling around to some of the orgs on here to see if they can help: https://www.nalp.org/lgbtq_organizations\n\nYou might also post on one of Reddit legal forums to see if someone can give you any basic advice from an employment law standpoint to see if the school is required to do more to protect you. \n\nI’m sorry this is happening to you, and so sorry about the sheriff - how terrifying. Definitely if you call those orgs mention him - they may be willing to do something about him too.", "NTA\n\nShort term mental health protection. Almost all email platforms allow you to presort emails into folders as they arrive. Redirect theirs to a folder so they aren't in your main inbox. Then ask a colleague periodically to pop on your computer to forward them to admin. Also see if they can print them so you have documentation of the harassment.\n\nLonger term. This is harassment. Plain and simple. And you shouldn't have to just take it because you are an educator. Talk to admin again. Make it clear that the harassment needs to stop. They can either properly deal with it or you will need to escalate it as you fear for you safety. After this in person meeting email them a summary of the meeting asking them to confirm this was what was discussed. \n\nNo matter what they do find some outside support. Either through a teachers union rep (whether you ever joined or not) or through and LGBTQ+ organization. Often both have access to legal advice, mediators foe conversations, and lawyers if you need it. Don't wait till you need them to reach out. \n\nI hope things get better for you and you stay safe!", "Print and save all email. If possible forward to your home email.", "I think you need to document all that, take it to the administration and also keep a copy in case you need a restraining order for those assholes.\n\nNTA, you don't have to tolerate those homophobes.", "NTA, It sucks having to punish a kid for parents behavior but this is about your saftey. Inform administration (if you have not already) about the emails and ask for removal. This could help teachers if the parents decide to go after anyone else.", "Nta, talk with your administration about not feeling safe at work and to remove that child from your class", "I guess you’re NTA but it sucks to punish the child for his parents’s shitty views and actions. He can learn not to just walk out of the room without the parents being involved. If the kid starts parroting them, though, I’d 100% agree.", "NTA your protecting yourself from abuse (verbal and emotional) in a work/school environment. This means your also keeping the other students safe too.", "NTA", "Lol they sound like psycho Christian’s. They would accuse you of living an even more satanic lifestyle if you weren’t married \n\nSpeak to a lawyer and the cops. This is felony stalking and harassment", "NTA The us is losing teachers like mad. It’s okay to remove this particular situation from the list of stuff you have to deal with and avoid letting it burn you down.", "NTA I feel so bad for you and the kid. Good luck.", "NTA- The parents created this situation", "NTA, you would not be the AH. What all of these \"punishing the kid :(\" and \"you could be a good influence\" comments are naively ignoring is that if this kid, great as he is, ever went home and so much as implied that you had talked about your personal life or beliefs, it would get infinitely worse for you. You cannot be a positive influence for this kid because you're just supposed to be an art teacher, who teaches art. Not life lessons and tolerance. You can't be his introduction into progressivism or whatever people are going on about because his parents will brand you a predator and try to ruin your life simply for existing, let alone doing anything that might combat their brainwashing. Protect yourself and your job.", "Holy shit. NTA….1000 times, NTA\nThis world (country) has gone of the rails & lost its ever loving mind. I am so sorry you have to deal with this. And I feel bad for the kid too. These parents don’t realize that their overly “protective” ways are setting them on the path of “I don’t understand why my kid doesn’t talk to me anymore.” If your administration backs you, kudos to them, and for your sake I hope they continue to. That child will suffer but there’s nothing you can do about that.", "NTA. The parents are bigots.", "You might consider trying to get a restraining order to stop the harassment.  \n\nNTA", "NTA", "NTA but can you ask the administration for ways to buffer you from the parents.  Such as (1) Having the administration tell the parents they are absolutely not allowed to contact you directly and any communications should be directed to someone in administration and (2) enforcing that.  \n\nThis kid desperately needs to not be stuck being homeschooled by his parents  and if there is any way for you to keep teaching him and giving him this better input, it would be great to make the effort.", "NTA, but I’m super jealous if you’re in a district where you can do this.  I’ve been assaulted by students and parents have attempted to assault me and threatened to kill me and my family, and the student was sitting in my class the next day.  I was told I could be moved to a different school, but they wouldn’t be moved anywhere (being moved would be bad for me for a variety of reasons but mostly because it would be traumatic for my other kids and families and I’d be away from all of my teacher friends and you get moved to even worse schools usually).", "NTA.  They have started using things straight out of the Nazi playbook.  All bets are off now.\n\nDoes it mean the kid is being punished for his awful, disgusting parents?  It does, unfortunately.  But you are being unfairly punished _much_ more harshly by people who are, again, fine with with using pages straight out of the Nazi playbook.  They are trying to get you _killed_, period.  This isn't just \"we need to get him fired\", going around in the community is designed to get you harmed, or at the very least, run out of town if you have the \"good sense\" to leave before they hurt you more.  They want to ruin your life, and possibly _take_ it, because they're assholes.\n\nI worry that now that they've set this in motion, nothing you do short of leaving town will actually keep you safe.  You've said you don't like guns, which is fair, and I wouldn't trust it to keep me safe in this situation; martial arts won't do much to keep you safe when they get a group, especially not in the short time you're likely to have to actually learn something; the sheriff isn't going to help you, based on what you've said about him.\n\nFor now, get the kid as far away from you as possible.  That's not an asshole move; that's basic safety.  _Your health and safety always matters more than the child of bigots, no matter how good of a kid he might be_.", "NTA. Could you just block them from contacting you? Have everything go through the administration? If that can’t be accommodated I would think you have no choice but to ask that the kid is removed. It’s unfair to the kid but this won’t be the only time his parents mess something up for him, I can guarantee that.", "Gee wiz parents are ah\nGet cameras for car home etc and have own cameras\nHave other teacher with you\nAlso like others said there are lawyers that would take it", "NTA, but personally, I wouldn’t jump to having the child removed since he’s not the problem. Perhaps there’s an intermediate step. What is your school policy regarding harassment? I would talk with a union representative and the school administration about how to file a harassment complaint. The school can give the parents an official warning. If the parents persist, perhaps the school can redirect all communication through a third party. It’s obviously up to you and your comfort level, as well as your school policy.", "NTA- put your own safety and health first. \n\nFile police reports about the emails, they may be classified as hate crimes. You and your husband may need to get a restraining order against the unhinged pair. \n\nAre they the religious fanatic type of homophobic ranters with scripture preachings and hate slogans like the WBC? \n\nOr the secular lowlife versions that target their hate campaigns at random homosexual people and anyone else they see that supports same sex marriage?", "Please file a police report. Hate speech is illegal.", "This is a hard one, he is a innocent child and it is not his fault. Perhaps you could redirect their emails to someone else such as the school administration? I know you cannot block another person's email as a school account but maybe look into sending their horrible emails into a spam container or forward it to an administrators account?", "Agreed. You get one homophobic kid in that class and false allegations can ruin OP’s career in a second.", "Plus, it will bother the parents a lot more to have their child continue to be exposed to OP's disgusting lifestyle than to have the kid removed. And OP can set a good example for him, showing him that gay people aren't any different than straight people. This kid really, really needs some good role models.\n\nThey're not going to fire OP, so he should just have fun with this. Next class project--they can all paint rainbows!", "Home schooling is not as uncommon for non-crazies, especially in the wake of Covid. Lots of kids are home schooled for various reasons. I found out during Covid I have an autoimmune disease (we were still testing for more) and my daughter was supposed to start kindergarten. We made the choice to home school her until we had more information and were in a safer spot. My daughters program also had kids who struggled with in person instruction, and many of the older kids were suuuuuper heavy into sports and/or music/arts. While, obviously, you still get the ultra religious parents, the stereotype of “all home school kids have crazy parents” is not super accurate anymore. Home school programs are publicly funded and overseen by licensed teachers (in my state at least) with the same standard tests as public schools.", "There isn't another art class", "I assume so since the entire school has cameras", "Expecting every member of a minority group to be the “good minority role model” is such a bigoted view and I need it to die.", "Hard disagree. NTA even if he removes the student. It isn’t his job to accept abuse and potential safety threats to help a single kid. It’s also not his responsibility to represent all gay people and that perspective is rooted in bigotry.", "Normally I'd agree, but when someone is pulling actual Nazi tactics against you, their kids' feeling stop mattering _real_ damn fast.", "Are you a teenager? You sound very much like a teenager.", "It's not your job to endure abuse to \"save\" this kid, but he seems to have abusive and psychotic parents that are definitely the restrictive, sheltering type. It's likely he won't be able to be as artistic or expressive at home if he is removed from the class. It's just something to keep in mind, but again, it's not on you to have to put up with this", "I know. I meant switch him to another class in a different subject. I would so much rather he stay in your class because he clearly loves art and is good at it but you don’t deserve to be bullied and disrespected by his parents. (It’s not his fault his parents are like that.)", "OP, if it makes you feel better about forcing the kid to miss out on art, please know that being removed from your class is truly the best option for him.  This kid NEEDS to be in school to have any shot at being normal and well-adjusted, and if you don't accede to the parents' wishes here, they're apt to just pull the kid from school altogether, and he'll grow up with no influences other than his parents' bigoted evangelical bullshit.", "If you are that afraid, then you need to tell the principal that seeing as they aren't taking steps to protect you, then you will be forced to involve the police. It might be wise anyway- if they are this vile, I would worry about the child's safety too.", "He's not there to represent gay people, which he clearly said and I didn't reinforce the idea that he is anywhere in my reply- you're only one implying it was said anywhere that he must be the one to represent gay people. \n\n But he is there to help kids and educate them. I've been in situations where crackhead parents have threatened ,in person,  to clip me in the parking lot on the way to my car. I didn't remove the kids from my class, I just worked with them and they turned out great.  They weren't the ones giving me issues, their parents were.\n\nHe can give up if he wants and remove the kid but if that's how it's going to be he might as well find another career.  He's going to encounter stuff like this, and swapping the kid to another classroom won't always be an option. Whether it's because he's gay or if it's because he's not teaching how the parents want him to.", "That’s horrifying.", "If a student leaves the classroom you can safely assume it is for the rest room.  This sounds like a very American issue.", "It's pretty standard to assume a student is using the rest room when they leave.", "That's a bit ageist and demeaning.", "There are more secular home schooling families than you think. We have for years, and it is not for religious reasons. We are far from alone.", "“Make him dislike you and reinforce his parents ideals” \n\nYou’re pointing out his position as a “representative of the gays” here.", "The kids feelings and opportunities are less valuable than the person it could get killed. He’s not worth it, remove him.", "Cool, what if they're not? What if you didn't even notice them leave and now you have no idea how long they've been gone? Could they have left the school? What if, because this is probably the US, there's an active shooter?\n\nAdults taking care of children need to know where those children are. He doesn't need to ask permission. He can literally just say, \"I'm going to the bathroom now.\"", "Oof. I forget redditors read into the smallest things to scream bigotry whenever they get the chance. \n\nI was pointing out a possibility that his parents could reinforce their ideals in their child, especially when given a direct reason to dislike the teacher. Never inferred he was a representative of the gays. You read it one way, it was meant another.", "Please look for lawyers who will take this case pro bono.  NTA and yes, you are in danger now if the sheriff is on their side.  Sorry I'm not there to stand guard for you.  With love, just an old auntie", "My best wishes to yare child", "*our", "Yes, my daughter is dyslexic & they didn’t know how to teach her, so we homeschooled for a year, but we were absolutely the minority. I checked into homeschool groups and nope. (She’s grown now, this was in the early 2000s)", "Whatever man, suck a fat one.", "😂😂", "🤣", "Must be pirate family", "You deserve to feel safe at work", "My union rep kinda sucks, like I said won't even fight to get me supplies for the class", "NTA. It's distressing that your admin hasn't already removed said child from your class. Have you shared the emails you've received with your admin? At this point, I would no longer deal with these parents and pass everything on to my admin. Let admin know that you will no longer be communicating with these parents. Good luck!\n\nP.S. Are you a member of your teacher union?", "Maybe the ACLU can offer some assistance.", "NTA OP, and have you shown any of the emails to the administration? If not, you need to. As bad as I feel for this boy, getting him out of your class would be heading off an entire host of problems later down the line for both you and the school.", "NTA. Sucks that the kid will have to go to a different school because his parents are bigots though.", "NTA get him out of your class STAT his family will cause you nothing but trouble.", " NTA.  In order to protect yourself and your career the kids needs to move.", "NTA, kudos on the camera in the classroom. Submit everything to admin in writing (email). Follow their instructions exactly. If they say keep the kid and the photo, do that with minimal explanations to the parents. If they say remove the photo, query your union or content supervisor. Never ever touch the kid, don’t even get close. Close off your phone from potential air drops. Be explicit with admin that you will not communicate with the parents further without an administrative mediator present. Protect that job!", "As a former homeschool mom I was all ready to take you to task for linguistically suggesting \"normal school\" is the opposite of  homeschooling.  But then I decided to give you a big (bathroom) pass when you described the outrageous,  vile, horrific and totally inexcusable verbal assaults from the creepy parents. I am so sorry for what you have endured (and are continuing to endure) from these worthless losers. Not all home schoolers are this way. It's the toxic religious element at play.", "To the question posted - YWBTA - for making any decision like that, in regards to the well-being of the student impacted by that decision. If he is removed from the class, let that burden be on the parents to answer for... not you. Let the people responsible for the class change answer for it - just make sure it's not you.\n\nOf course - Y W N B T A - if you use the proper channels to put this harassment in its place, yes harassment. Attacking you, vs. removing their child from your class, puts an immense amount of accountability, on their behavior since first contact. Let that tree bear fruit, not the former.", "NTA, but I feel bad for the kid. That's probably why he wanted to go to regular school. Would blocking or muting their emails be an option, so you don't have to deal with them but can still keep their kid in your class? If not or if you don't want to, you're perfectly within your province removing him from class. People are disgusting, and I'm sorry you have to deal with this. It infuriates me. One of our best teachers in my kids' school left because of harassment like this, and while his replacement is good, his program isn't as good as it used to be.   \n\n\nGood luck, and I hope you stay safe.", "NTA but please don’t kick this kid out of your class. As long as he is treating you with respect, don’t hold the actions of his bigoted parents against him. Homeschooled kids with parents like these have very few adults in their lives who can broaden their perspective. If this poor kid loses your classroom, he’s closing more than just an art class, he’s losing a chance to see that the world is bigger and better than his parents are telling him.", "NTA for protecting yourself, but I don't think asking for him to be removed from your class is going to fix the issue. His parents are still going to try to get you fired. You need to file a complaint for harassment if you want to get them to leave you alone.", "NTA; at least you don’t have an onlyfans with your husband where your smashing in the classroom (like some teachers we know)", "NTA. The big question is, how is admin handling this to their faces? It bothers me that this is sitting on YOUR shoulders to handle when they should be creating the safest environment to you that also doesn’t screw over the kid (by taking them out of your class is what I mean would be screwing them, it seems like they thrive in it).\nI know you said admin is with you, but I also know sometimes they can say one thing but still take the road of least resistance with parents. If you are receiving emails like that from the parents, could you respond (cc’ing in your admin) and say something to the degree of “due to previous communication experiences, all future communication must be through administration or will be automatically forwarded to them.” and expect they truly back you up?", "NTA, but I would also get an advisement of a lawyer in case these randos keep going. Some parents a psycho. See also poor Kelli Peters", "You might not even be allowed to remove him due to being the only art teacher so be prepared for that. I worked in a small school and a student could be moved around to a different periodx but they couldn't be removed from a teacher's class due to the fact that there was only one teacher per subject in the Middle School.", "NTA", "NTA. But the better revenge would be to keep him and show him the world isn’t as small as his parents try to make it . You may the one person that changes his life just by being yourself and a good teacher. Block his parents from contacting you thou , send them to spam and make a formal request due to all hostile, inappropriate communication they have sent you , any contact needs to be vetted thru office before you receive it.", "NTA - I’m surprised they still let their kid go to your class tbh. But I mean if they are harassing you protect yourself and move on. You have every right to be safe and feel safe at your place of employment.", " NTA. ‘’They have requested that I be fired and replaced.’’ \n\nOh hells no.", "It took me a long time to figure out why they would have such an issue. I’m sorry you are going through this situation. Hopefully with time it passes by and maybe they educate themselves a little. Thanks for what you do.", "NTA", "NTA, wow that poor kid! But, no you're smart to demand the change and you also need the administration to loudly back you up. I can see that kind of parasitic feedback turning into something much worse if they aren't strongly rebuked.\n\nI'm so sorry, clearly that kid NEEDS to be in school.", "nta. wonder if you should connect with a lawyer and swear out a restraint order.. i would be concerned that these people may escalate to your home. protect yourself and your family.", "NTA.  \n\n(1) You have to protect yourself.  \n\n(2) Sadly, children of these type of parents will lose out on opportunities due to their parent’s horrible behavior.  It’s sad - but a reality.", "NTA, and those parents can go fuck themselves. As for their kid, not your problem. There are plenty of teachers out there who share the views of the parents, same as there are bakers and website designers. What’s good for the goose is good for the gander.", "Well if you feel bad for the child like you obviously do,  figure out what they want, if they just want you to just put the picture away then why not, I didn’t know anything about my teachers in elementary school or in junior high,  they never had any pictures out, I knew nothing about their personal life whatsoever so if its just as simple as that then why not?", "NTA. I’m so sorry you’re going through this. Is it possible for you to take action against them with the school that doesn’t involve the student being removed? I know teachers aren’t really given the support they need nowadays. It sucks that teachers have to put up with harassment from small-minded parents.", "NTA. The bigoted parents clearly are. It’s unfortunate the child has to suffer the consequences of their actions, but maybe that’s what it’ll take for the parents to learn the consequences of their actions. I doubt it, though. Bigots never grow.", "NTA  \n\n\nI was a faculty head in a Scottish high school. If someone had done this to one of my staff members, I'd be moving the kid to another class - preferably my one. (Not sure how it works in the States, but Scottish faculty heads teach a portion of the timetable.)  \n\n\nI'd also be writing up a formal report to the council/district to inform them that one of my teachers was the victim of a hate incident.", "NTA. Don't put ur kid in an art class if you don't want him to encounter gay people .", "Seems unfair to punish the son for the sins of the father.... Modern society is so fucked.", "NTA. Keep those letters somewhere safe just in case, and good luck.", "NTA and I’d be tempted to consider pressing charges for harassment. That poor kid. Your admins need to step up and tell them to stop.", "NTA!! Dont you dare move!! I'm so sick of oppressed people always having to be the ones to move or acquiesce because of the fearful ones.  Fearful that they may have to actually love their neighbors.  Do the kids from your class. You don't need the problem.", "NTA for wanting to distance yourself from toxic people ... BUT --\n\n&#x200B;\n\n\\-- that kid needs you, and your example, probably more than the rest of the kids in class combined.   If you can, keep him just so he can see  that you're a strong professional man, loving, intelligent, cool - not disgusting, not filthy, not evil.   Just a good person with a big heart doing a great job.  He needs to see that gay people are not what his parents say they are.", "I would hope you keep the child in class, as even though the parents are A's, don't stupe to their level, or YWBTA.  You would lose your high ground,and the child would lose out on the experience of class and you as an example, and the parents would have another reason to citsize your character.\n\nBut to protect yourself I would keep an eye and an ear out for slander or defamation of character. These can't just be told to you but must be broadcast to others to be illegal. If they said to someone else that you were grooming children, I'd file a lawsuit to sut them up. See what they have told  the school and keep documentation, as this would be big. And if they did pull their child because  of a suit, don't drop it.", "NTA- your safety is more important at the moment than this child. Your responsibility needs to be to yourself. It’s unfortunate that this little boy is getting caught up in this but it is his parents fault. You shouldn’t martyr yourself for this. Best to transfer him out and work with administration to limit or cut off all contact the parents have with you.", "Nta. \n\nIt sucks for the kid, but honestly this could escalate. Your safety comes first.", "Nta", "I feel so bad for that kid. He begged to get into your class and his parents ruin it for him.", "Lol", "NTA. You have mentioned that you can't afford a lawyer, but please at least schedule a consult with a lawyer. Many will do a free consult or at least the one hour won't cost much. I suspect someone would jump on your case pro-bono (maybe find a lawyer who specializes in LGBTQ issues). \n\nYou are being harassed and your livelihood is being threatened. That is not okay and you deserve to be protected.", "NTA\n\nI wish you could legally find some way to fuck with their life like they’re trying to fuck with yours.", "Not sure where you teach or if you are part of a Union. If you are, seek their counsel and support. If not, it may be time to retain a lawyer for counsel. I am truly sorry this is happening to you.", "I really hope OP sees this. This is the best comment I’ve read on here.", "Forward every email to your principal", "It's really the asshole parents who need an \"opportunity for growth,\" though they obviously neither want nor will accept one. This is unfortunate for the youngster who loves art, but the teacher who is under threat from crazy people needs to be protected. Hopefully the boy will continue to look for opportunities to learn about art in other spaces, but this is not a safe place for the teacher and him together. After all, not only is OP's reputation and employment and possible legal freedom at risk now, the child is in a bad place too. These are the kind of awful people who will happily try to convince their child and themselves of something very bad happening. \n\n\nImagine the awful effects of this kid being convinced of experiencing abuse that never happened and needing to go through all of the necessary investigation, interviews, and possible even invasive medical testing where he is expected to describe abuse that never happened. That's fucked up something fierce.", "They installed one in every room after a student hid in the band room after hours in order to vandalize the place", "Traditional* my apologies :) I'll be more mindful in the future.", "We typically don't even hold hands in public lol", "Principals in the US are an entirely administrative position usually. I know of one in the area who acts as a sub for emergencies", "Can you block direct contact with them? Make it so they contact an office or general school email, and do this for calls too, so all interactions include a third party for your protection. Get the school to advise them that no direct contact is allowed and all communications will be handle/coordinated by the school.\n\nYou're NTA, but I think this kid getting away from home and his parents will be a huge benefit to him, and it may help him escape following in their toxic beliefs. Help him develop and become independent of them. It's so sad that he'd lose out because of his toxic parents.", "Forward every email to your lawyer.", "But also potentially put a big target on OP’s back. If bigots weren’t also consistently violent I’d totally agree with this but OP does have to think about their safety.", "You really want me to get killed huh?", "As a teacher, depending on location of course, you can absolutely get fired for bullshit reasons if enough people make a stink about it and admin/district get tired of taking the heat. In most places we only have year-to-year contracts and can be let go or shuffled to another school if admin can come up with a good enough reason to non-renew (such as escalating a conflict with parents).", "If this wasn’t a school I would be all for it. But since it’s school he needs to be careful not to give the kid’s parents a reason to report him again and give him more grief. Unfortunately in the classroom we need to keep our VERY satisfying pettiness out to pasture over the “rainbow”!", "Gay people are better than us straight people. They understand the value in accepting people as they are for what ever reason whereas heterosexuals think they're the norm and everything else is abnormal.", "[deleted]", "NTA I can see that you don't want this kid to suffer for his parents' behavior. Do you think that those parents will allow you to focus on teaching their child? Their beliefs are so at odds with the mainstream, even trying to make a living will eventually push him to leave their world behind. It really seems like intervening to save him while they still have years of control over his life would do nothing at all for him, and probably stir them to ruin you. I don't see how you can afford to choose this battle.", "The child's development is not your responsibility over your health and safety and career.", "Too bad, so sad. It’s not your fault the kid misses out on art. Your career and livelihood is more important than saving this kid’s art experience. Hopefully the kid will go to college, open his eyes, and find experiences independently - away from his parents.", "NTA. Respond to the latest email from the parents requesting they include your principal/admin on all correspondence. And copy your principal, etc on your response. Set up a rule in your email to automatically forward anything from them to your principal/administration in case they ‘forget’ and to your private email in case you need backup later. Always include everyone in your email conversations. Officially ask for an action plan from your principal that includes support and professional/physical protection. Make it their problem too because it is. They should be guiding you through this challenge. If you meet with school and/or parents verbally, send an email to all recapping your conversation and action plan or lack there of. Stay as neutral as possible and focus on the facts of what is appropriate and inappropriate behavior, not the perceived motivation for it. Good luck. Those parents are ridiculous.", "Kids do be wily", "Thanks! Best wishes to you and your husband,  hoping for the best possible outcome.", "I can almost guarantee it’s your sexuality as well. Some people raise hell when they see same sex couples. That’s the most annoying thing ever. If you were single I bet there wouldn’t be a word said", "I feel you. Had one saying it was racist not to give their child brown paint... during a lesson on mixing neutrals for portraits. \n\nThe downvotes don't bug me because, unlike the people doing those votes, I have been in your situation.  Idk what state you are in, but there's pretty specific stuff that needs to be met to have a child removed from a subject entirely, and it doesn't sound like the actual kid has done anything.  Cut direct contact and if they're harassing you or slandering outside of work press charges/small claims.  Unfortunately, you're right. The union can't step in.  If the child is going to be removed, there'd need to be something like a restraining order against the parent or they need to be a danger to you", "[deleted]", "You need to forward those emails to your principal. Thats harassment, and they need to be told to stop.\n\nTreat the boy the same, but your school should step up to protect you.\n\nYou can also set up a \"rule\" in your email for how emails from a specific addres are handled. In this case Id suggest creating a special folder, any emails from the parents should be automatically filed there, as well as forwarded on to school admin. That way you dont need to open and read them, but they can still be dealt with.", "OP, please provide an update for however this resolves.  Good Luck to you and your husband!", "Who died and made you the authority on what heterosexuals think?   \n\n>heterosexuals think they're the norm and everything else is abnormal.  \n\n\nI certainly don't think this. If you want to out yourself as a bigot then that's your choice, but don't drag the rest of us down with you.", "That’s not the case here. Lots of people homeschool in my country because the school system fails neurodiverse kids.", "In this case, probably, but it's not always the case. We homeschool and are religious, but we don't teach hate to our kids. We've got a variety of reasons for homeschooling, health and safety, being able to tailor the curriculum and teaching methods to our kids' needs, and honestly giving them more time to just be kids. \n\nWe are active in our church, and frequently spend time with other families from our church who homeschool. We teach our kids that while we believe certain things, we won't force anyone else to do the same. We're not going to judge others, but to be kind to everyone, regardless of whether their decisions and actions are the same we would make or not. \n\nBigots really make things worse for everyone, don't they? They give others a horrible example of religion, and they basically just spread hate, which helps no one.", "So they should open themself up to unhinged accusation to save the kid?", "This is something you should seriously consider. You could have them charged criminally instead of suing them civilly. You should look into private criminal complaints.", "I can't admit it in person but I was impressed as hell", "I am actually not allowed to leave my class during lesson time, I have to go between classes or during periods when I have no students", "Secular homeschoolers just tend to be quieter about it", "Most homeschool families do it for religious reasons. Secular homeschoolers are in the minority.", "Same. Secular and homeschooling. Going to homeschool because our public schools are absolute *garbage* and we can't afford private school tuition. It also depends on the area of the country though (assuming we are talking about the USA) about reasons why people homeschool. In the south and large chunk of the midwest, it's almost always for religious reasons. The coastal and lake areas usually have larger groups of secular homeschoolers.\n\nMy area is give or take. Blue city in a very red state. But it is hard to find a decent homeschooling group in my area as they are either super religious or new age peeps that crunch a *little* too much granola for my taste.", "I just want to say, as a parent, and as a Christian, I am absolutely APPALLED by the behavior of those parents. You chose to be an educator, and that isn’t an easy job by any means. Your orientation is none of their business. My kids have had some amazing teachers that also happened to be part of the LGBT community. They told us EXACTLY what you said - they’re there to teach, not preach. I’ve told my kids (because of parents like the ones you’re dealing with) “What goes on in your teachers’ homes is none of our business. They live their lives every day just like everybody else. Be kind, be respectful, and learn!”.", "[deleted]", "😂", "can you check with your union about legal help?", "[deleted]", "Seeing as you misused \"are,\" uhh, great sign for your kid 🥴", "and not AHs about it", "Yep. In large part because when we talk about it we just get lumped in with the religious folks. Easier just not to mention it unless it is absolutely relevant", "There are dozens of us!", "Again I have no fucking control over the policy, I am expected to know my students locations, nobody gives a shit where I am in the event of a shooter so I don't have to ask", "and Lambda Legal", "You can also file a private criminal complaint. Your case would go before a judge without input from the local authorities. To file a private criminal complaint where I live, you only need the person’s name and address.", "That’s unfortunately true. These people are willing to openly wage war on you because you’re LGBT. It’s unlikely they’ll be mollified if you place their child in another class. You can certainly do that if you think it’ll help, but they may persist making personal attacks regardless.", "It seems like that would improve a lot of things for you. This sounds like a horrible place for you to be living..", "NTA. You shouldn’t have to but it might be time to consider it. It’ll probably look bad in their eyes if you move right after the accusations but at this point it doesn’t seem like there’s anything you can do to change their minds. Yes people need to stand up to bigotry but it shouldn’t come at the expense of your life. I haven’t finished reading through your comments but it sounds like you’re in a smaller town. Everyone tends to know each other or at least of each other and many probably know where you live or can find out fairly easily. Best case scenario, the connections you’ve made won’t believe those parents and ignore them. They may even stand up for you and eventually that kid will be pulled from your class and probably return to being homeschooled. You know your community better than we do so I may be reading this completely wrong but right now a part of that community is putting you in danger so no matter what next steps you take, please take them carefully. Best of luck", "NTA, but this poor kid. There is a good chance he wanted to go the real school to get away from there crazy, and now the are destroying something he enjoys.\n\nYou need to protect yourself here.", "I have worked with kids before and some homeschool kids parents are just …odd..( some not all) … but you are definitely not AH.. do what’s best for you cuz those parents are even wanting you fired over a pic? Sounds ridiculous but there going to be in for a good ride if they let their kid go to public school still after that, the real world will hit them quick", "Come to California (Long Beach is hiring)", "NTA.  I think moving to a bluer state is a good idea.  Not just because it would be safer for you at school, but you would feel safer in general.  I would never expose myself to bigots and homophobes unnecessarily.  I lived in such an area for a while, and it was awful. It was filled with \"christians.\"\n\nPeople with hate in their hearts mixed with religious mania are very dangerous.  \n\nThis kid's parents have it in for you and they won't stop.  They believe that anything they want should be immediately given to them.\n\nFor now, document everything and keep every message they send you.  You have to protect yourself as best as you can.\n\nI feel for you and hope everything works out.\n\nI feel extremely sad for that little boy.", "Easy NTA.", "Nta keep us updated", "They are bigots but you don't need to put your picture of you and your spouse on your desk. It is unnecessary and somewhat inappropriate and I'd say that if it was a woman too in the picture. I'd say it to all couples regardless of orientation. \n\nI'm gay myself and I'm a teacher but I don't think teachers  having pictures of their spouses or kids in the class is appropriate. The kids don't need to know your private life and it's just not the place. You are there to teach.", "NTA. You need legal advice stat. If you are in a union, get them on it.", "NTA. If you arent pushing anything on the kids or talking about things inappropriate for a teacher to bring up then these parents are way out of line. A normal picture with your husband is not inappropriate. The school administration should have moved him to a different class already if this has been happening for some time.", "NTA. I'm gay myself. But personally (and you don't have to - just my own personal choice), I wouldn't remove him at this stage. They aren't likely to even back off if you do, because then Little Johnny is being 'denied' an education by the Evil Gay Man. I'd be more inclined to take every last protective action you need to - and let management handle it. \n\nThey should already be writing to the parents warning them off this behaviour, threatening police action, following whatever policies are in place, etc. There will be ways of making sure you don't need to have any contact with these homophobes, even if you teach their child.\n\nThe parents will probably end up removing the child themselves, of course. But I'd wait for it to happen that way, if possible. At least that way it's not you rejecting the child because of his parents, and hopefully the child will know that. And you have some time to set an example to the kid in the meantime.", "NTA I love your want to give their child a great experience but you have to protect yourself so you can continue to give that experience to many other kids in the future. His parents want to jeopardize your career, they did this to their son, not you", "Actions have consequences and if the kid has to miss out on art class due to his parents behaviour, then that’s a good lesson for them.   \n\nHaving said, that i doubt that having him removed from class would stop their campaign of bullying…it would probably escalate it\n\nNTA", "That’s so sad. What you do behind closed doors in your own home is your own business.\nI respect that you don’t bring it into the classroom.  These people are actually discriminatory, and that’s so terrible. Would removing the child even make them\nStop though at this point?", "NTA\n\nI guess the reason why they previously homeschoooled is clear now. The parents are total assholes.", "NTA, I feel like if you don't request the child ti be removed from your class, they parents will probably request the same thing anyway...\n\nIt's such a sad situation, because it doesn't seem like the kid did anything wrong and somehow he's the only vivtim here. I hope that as he grows up he realizes his parents are the ones in the wrong.", "YTA.  It's not ok to use your position of power to punish people for having different views than you.   If roles were reversed and OP was a Christian conservative with a student who has two mom's that were on the warpath to get the homophobic teacher fired I'd say YTA for getting the kid of the lesbians thrown out.", "Completely and totally NTA. The family is the AH and I feel bad for the kid. I am really sorry you are exposed to these people.", "Info: can you block email addresses on your email?", "I am confused. Why don’t the parents just pull the son out of your class? Why do you have to be the one to cut him?", "You’ve got to put this in r/teachers they will give you great advice on what you can do legally and give you moral support.", "As a teacher I just want to say NTA. You deserve to work in an environment that is not hostile.", "Good luck.", "NTA. I’m so sorry that you are dealing with this level of harassment. Wishing you and your husband safety and peace from these hateful/unkind folks.", "NTA. The bigoted homophobic parents are. What horrible people.", "NTA. That's pretty sad. I'm surprised these parents didn't remove their kid themselves.", "You can't even do it as a teacher in Florida. It violates the Don't Say Gay bill.\n\nObviously NTA, OP. I'm sorry you had to deal with that, and I'm sorry for the kid too. Not your fault to distance yourself from the parents. You need to look after your own well-being and safety.", "Christians? Why so specific", "Unfortunately, the kids of bigots, racist and homophobes suffer every time one way or another.", "Also wow, this is literally harassment - you are being harassed by these horrible people", "My son is in Kindergarten, in Texas, and at the Meet the Teacher event… his teacher had to ask us if we were okay with her using rainbows as a major part of her lesson plans for the year. One example: they are learning sight words and each group of words is labeled with a Roy G Biv color. They get to color in a part of their rainbow after they’ve learned all the words for that color. I don’t think any of the parents had any issues… but the fact that she had to ask is so sad. It’s… it’s a rainbow ffs.", "wow bud. not every state is shiny blue. gays get beat up still in many places in America, even “progressive” places", "And something that homeschooling does kind of right, if done well, is not require the kids to ignore natural things like needing to use the restroom. I assume you presented it to the parents in this way. \"If your kid needs to go, that's fine, I am supportive of that, but he needs to get a hall pass from me to do so. He just needs to understand that you have to ask in school, I won't say no.\"\n\nI find the way kids are handled in most schools (I went to a private school through grade 6, and it was more restrictive than the public school I went to from 7-12) overly restrictive. Of course I should use the restroom if I need to before a meeting in the professional world, but should I have an emergency of any variety, a \"sorry, I have to handle an emergency\" will not raise many eyebrows as I walk out of the meeting. I come back 5 minutes later and respond to the \"are you okay?\" with \"I am okay now, let me read the minutes as to what happened while I was gone and then we'll move onto what I need to address.\"\n\nI had several female accidents in school because teachers were told to keep us in the classroom unless it was an \"emergency.\" Bleeding through your pants was not an \"emergency\" to many male teachers. Most of them were probably of the ilk commonly featured in r/badwomensanatomy. \"Just hold it in! Are you a toddler who can't stop the flow?\" There's a balance between letting them go (pretty much so freely) and making sure they're okay while doing it.", "Are you in a teachers' union? You may be able to get a lawyer from the union for free or reduced cost.", "Forward every email to the local newspaper.", "Schools almost always take the path of least resistance and if firing someone makes a problem go away (even temporarily) they will do it.", "Please don’t do what this commenter is suggesting. Protect yourself and your husband.", "Remember to take every comment here with a grain of salt. The people commentingbare reading this for entertainment", "It’s not that.  You have a right to look out for your own safety.  It’s just…  Florida here.  Frequently lonely blue speck in a red sea.  I worry about the kids who are born here, who will discover they are gay as they get older.  They are going to be very lonely.", "Please forward all their emails to your personal email and save them in a folder. Document days/times you've been harassed, and ask for an admin to be with you when you meet with the parents. The district is responsible for keeping these parents in their lane. If that doesn’t work, call a lawyer.  I was denied tenure at the beginning of my career and I knew it was because I'm gay, but I couldn't prove it because I never documented or reported anything.", "Hey as a queer person… no. \n\nQueer people are still people, therefore, can be shitty. There are still issues within the queer community. You can easily find gay people who are racist, sexist, transphobic, biphobic, xenophobic, pretty much anything. Putting queer people on a pedestal like this can be damaging", "*laughs in bisexual*\n\nSeriously though, most supposedly LGBTQ+ friendly spaces online that I've been a part of are full of biphobia or bi erasure. Seriously, gay people can be just as bigoted or unaccepting as hetero people. It's almost as though different groups aren't monoliths where everyone is the same!", "I knew a woman who homeschooled her daughter.  If she disagreed with something in a textbook, she just taught her daughter it was wrong.  I'm not talking about anything like you would think but sometimes geographical facts.  She told her daughter there was no such place as Paris, Texas because Paris was the capital of France.  And that they lived in a grassland (plains) area when they lived in the Smokey Mountains.", "There are actually many people who homeschool for non-religious reasons", "Or living in a very rural area far away from the school. It wasn't until I was a rural delivery driver that I noticed just how many farm kids are homeschooled. In hindsight it's super obvious why but as a public school kid, it never crossed my mind when I was younger.", "Starting homeschooling next year because the workplace demands in 10 years will be completely unrelated to the way school continues to be structured. Learning to take tests and having knowledge meted out that is retained for a short period is becoming so much less relevant as time goes on. The ability to make mental connections, work independently, explore ideas, follow a framework to create relevant output is more and more needed. Kids need to learn to find information, pick it apart, find meaningful parallels and build it back together for something useful. Plus I guess having lunatics block book access or stifle ideas because they don’t want their kids to know about it and therefore my kid is under the same ruling doesn’t sit well with me.", "Sounds like isolation and abuse.", "In Germany refusing kids a bathroom visit is actually illegal and considered assault and can get the teacher in real trouble.", "“he does not ask to leave the classroom, if he needs a bathroom he just leaves”\n\nThat’s not “he asks to go pee and then we make him wait.”  \n\nThe teacher isn’t asking him to ignore his need to pee?  It sounds like he just needs to provide whatever notice/attention getting is needed to hand him a hall pass so that he can wave it at any curious administrators in a hallway so they’ll know he’s where he’s supposed to be/absent with the permission of his teacher.\n\nWhich is reasonable with young kids.  With no hall passes, you end up with kids in fifth grade like me who regularly cut hours of class to read in stairwells or really unsafe roof nooks just because I looked trustworthy moving along a corridor.  My english teacher honestly somehow got the impression I had a terminal illness because I was never in class.\n\nMy classmates were cutting class to go have unsafe beginner sex and get high in less frequented bathrooms, which finally got a pass policy instituted.", "Think through what you're saying.\n\nWe're not talking about a teenager, we're talking about a \"kid\". To me that implies the child is still young, and young children can be pressured into saying really anything. And who wants to fight those kinds of allegations? Or have to face that kind of lynch mob?\n\nAlso this is America I assume. Those kind of parents (and/or their friends/relatives) are likely to be gun-nuts. Why put yourself through that kind of risk? Life is not some Hollywood movie where the arts teacher is a former elite Special Forces.\n\nI feel horrible for the kid too, but the OP needs to look out for his own welfare and the welfare of his loved ones. Some parents are just insane.", "LMAO!\n\nStudents leave the classroom for all sorts of reasons that have nothing to do with going to the bathroom.  \n\nSource: I am a Canadian teacher.", "What other age group would think that an adult whos responsible for a minor wouldn't need to know the location of that minor OR think that an adult wouldn't have the choice to no longer be responsible for a minor that theyre not comfortable being responsible for?", "If they are not in a super conservative area.", "Why?", "I was being sarcastic", "Exactly, same gender relations arent for me. To each thier own. The ONE AND ONLY time I don't like it is if said person knows I'm straight and continues to hit on me or try to make advances to change me. Which is a very small percentage of gays. I don't let the small minority of \"those ones\" change my mind about the bigger picture but i just don't like the ones that overstep boundaries of which i have had to work with before...", "I was an art teacher working for a public school district in the western suburbs of St Louis. Parkway.    Parents often picked our district because of the programs we offered .  Every grade school had a full time Art, Music  and Gifted teacher.  We had 2 PE teachers .  All third graders had violin lessons,  If the parents wanted those lessons to continue in 4th and 5th grade, a teacher was provided .  We had a full time counselor , sometimes 2, and a full time nurse.  We had a  multi level program for students on the autism spectrum .  We had a teacher with at least 1 aide for children diagnosed with behavior disorders. We had a full time reading specialist and a full time math specialist for students with difficulties in those areas.  We gad special school district teacher for assistance with students with low IQs.  There are after school clubs for students with varied interests.  The private schools in our area do not have such a comprehensive educational structure.", "And I knew many when we homeschooled.\nWe were still a minority.", "No one is suggesting to refuse the child a trip to the bathroom, I believe they just want him to request/announce that he needs to go. Likely so he can have a hall pass", "I thought I was clear that teacher wasn't being unreasonable, it was just a difference in expectations from home schooling to public. OP seems to agree that if a kid has to go, they can go, they just have to alert him and get the pass to do so, unlike at home, where they just...go use the restroom.\n\nI was just providing some commentary in addition about how schools/teachers like to police children's bladders, bowels, and menses, which is also bullshit.", "I more worry that removing him will make the parents even more mad/aggressive. So maybe get help before that to have backup. Parents can be awful, I've been a TA and shit is crazy.\n\nBut you should also think about the kid because what if his parents are just as bad to him, and this is his only safe space? Both deserve protecting.", "Why ask why when you don't even care bear?😜", "what made you guys able to provide services above your competitors?", "*our. Lmao wow", "there was a discussion in another forum regarding charter schools. \n\napparently, on the whole charter schools do not offer any academic benefit. \n\nbut on closer examination there are charter schools that offer quality schooling, and other charter schools that offer religious adherence. \n\nand both kids get lumped into the same statistic.", "Yep!", "Lol.  I homeschooled a bit as a kid.  I think I came from a fairly normal family (obvs not if we homeschooled, but bear with me).  My parents moved from a big city out to the country, and the local schools left something to be desired.  At any rate, I met a LOT of interesting people.  There are definitely some very sane homeschoolers out there, but the crazy also goes all the way round the dial and back again.  Was extra funny at state level conferences, where people too conservative to send their kids to school get together with people too liberal to send their kids to school, so they can all work together on keeping the state out of their business.", "Homeschooling was originally a mostly secular movement", "That....is what you said.", "Exactly!", "For like 10 years, until the Religious Right saw it as a way to prevent their children from hearing about evolution or sex ed. And since they were the ones who actually lobbied for and got our current incredibly lax homeschool laws in the US, they're the ones who actually made it a solid movement.", "Police officers would so get fired at once where I live if they say something like this publicly. It is really crazy that he still has his job.", "That really sucks. I’m so sorry. Stuff like this is so often overlooked in local elections and it’s a huge problem. [John Oliver even did a piece on it a few years back.](https://m.youtube.com/watch?v=v_kak7kAdNw)\n\nAs a fellow teacher, I really wish you good luck. You don’t deserve to be dealing with this… it’s totally unwarranted and completely unfair. I hope you and your husband are able to find a more accepting and safe place to live and work.", "NTA.  A part of me is happy you are moving away to a more liberal area, but the other is mad at you for letting ppl like this push you away from your job and home.   They will feel like they’ve somehow “won” this battle and encouraged to continue this behavior.  I’m so sorry you’ve received hate mail from them and had to go through this situation.", "Regardless of the situation I don’t think the child should be forced out of a class he liked because of his parents actions.", "NTA. My policy to my kids is this, ask once as a curtsey. If the teacher says no just walk out and use the bathroom anyway. Don't piss your pants or beg for permission to pee like you're an animal.", "This post makes me so fucking sad", "NTA But it's a shame you think you have to move. You've never had an issue before these specific parents. I'd understand moving if a lot more people were like this in your area. Sorry, but you're going to find people like this anywhere unfortunately.", "Avoid problems c", "NTA. But yey for you leaving to a more accepting place! Land on any area?", "NTA!!! I am soooooo sorry you are having to deal with this. I hope you and your husband are not effected long term from this treatment.  It's so sad. Noone deserves this. I am a friend to the lgbtq community. I have had to hide my actual feelings for people from my family because I was told I wouldn't be accepted.  You and your Hubby deserve all the happiness in the world,  and to not deal with people like that. This made my heart hurt for you.", "OP you are NTA. Get a lawyer. This is like [EEOC complaint](https://www.eeoc.gov/filing-charge-discrimination) worthy. Get a restraining order against the parents if you think the police in your area are safe for you to talk to.", "NTA  \nI am wondering if this is why I never seen any of my teachers have pictures on their desks. Its a shame you are going through all of this and its a bigger shame that this kid is paying the price of his parents.", ">decided to move after the school year, going to go somewhere a bit bluer\n\nI'm so glad to hear you and your husband are getting out of there. It feels like things are getting a lot worse for LGBT+ folks all over the world. Having seen what you wrote about your local law enforcement, you are definitely at risk.\n\nGood luck and best wishes to you both. ❤️", "NTA. Get a restraining order.", "NTA.\n\nTHe kid is, obviously, NTA.\n\nYou are enforcing a dumb policy, which is kind of making you an AH to the kids. But it's not your fault, you need a job.\n\nThe School Administration are AHs for 2 reasons:\n\n* They force you to enforce a bad policy where kids can't go to the bathroom without permission, like it's some sort of prison!\n* **They are not protecting you from this criminal, bigoted harassment. Which is their legal responsibility as employers.**\n\nBut by far the **BIGGEST** AH are the poor kid's homophobic hateful parents. These people are criminally harassing you.\n\n------------\n\nPossible solutions for you:\n\n1. Threaten to sue the parents if they don't leave you alone.\n\n2. Report the parents to the police (what they are doing is a crime).\n\n3. Threaten to sue your employer. They have a legal responsibility to keep you safe at work, which they are not fulfilling. Instead they are letting these awful crooks harass and threaten you.", "NTA for all other reasons mentioned.\n\nRegarding the classroom exit policy though, you could consider putting a visible whiteboard beside the door that students use to sign themselves in and out of class. Do a few trial runs and students will catch on quickly. Anyone who forgets does a few more and then it will become anchored.", "Nta. What a town of bigots by the sounds off your comments! Those kids are all going to miss out on a great art teacher and opportunity to learn there are all types of people out there! I’m sure one day you’ll run into former students who have come out and left this place, who will tell you what a wonderful teacher you are. I feel sorry for the kid, he’s obviously intelligent enough to know he’s better off getting educated in a mainstream school and hopefully other teachers can reach him", "How are you able to just remove a student from your class? In most schools, it doesn’t work like that. Admin have to remove students, you have to have documentation, and the parents being out to get you usually isn’t good enough, unfortunately. I mean, these parents are awful and you shouldn’t have to deal with them, but in my experience as a teacher, that doesn’t usually matter.", "NTA but explain to the student that you think he is a good student, you sish him the best but unfortunately his parents no longer want him to attend your classes.", "NTA, you or the kid. Make the kid really enjoy your class and start to question his parents hateful teachings. Maybe one day he will be lucky enough to escape from that life and be more accepting. Until then, cut ties with parents and let it be admins problem. Having them sit on their hands and letting you get the brunt of it is no skin of their bones.", "YTA, just on your edit 2! \n\nThat depends on the area, I am red and if I had seen anyone treating you that way I would have ripped them so far deep that the Marianas trench would no longer be the deepest place on earth. Thanks for stereotyping though. As much as I feel sorry for your situation, I will have to say, eff you!", "Are you joking? Republicans are actively pushing a genocide on queer people right now. BFFR.", "And democrats are requesting that I pay 75% of my earnings to those that don't deserve them. \n\nI never claimed to speak for all. I claimed to speak for myself. Republicans were the ones that opted to free the slaves but that fact goes unnoticed. Those in elected positions have been proven to speak only for themselves.", "I’d talk to an attorney about whether the emails received are specifically threatening enough to justify a restraining order against the parents.  If it does, maybe tip off a reporter or two from LGBT press about when the hearing is. If your local court proceedings are still partially on Zoom they might not even need to travel to cover the hearing.  Cockroaches like them tend to scatter when bright light is shined.", "OP thank you for being a wonderful role model and teacher. I understand it is hard on you because of the hate his parents are sending your way, but please don't take it out on the child. He is finally being exposed to a positive role model who embraces the  beauty &  joy in Art. If you want to share a nature lesson after a rainstorm with your students and he paints a landscape with a rainbow go for it. It's your class, YOU decide the lesson plans not the bigoted parents. I hope you and all of your class enjoy the rest of this school year. And that you find a new school to teach at without all the unneeded stress from the uneducated yet vocal parents. Good Luck and keep us posted.", "Some homeschool to hide massive child abuse (see Durbin family)", "That would be a massive violation of FERPA. Like, massive.", "That would be a great way to get fired.", "Don't forget afobia. I have heard more then once that as an ACE I am not part of the LGBTQIA community... Never from someone outside the community, only from within.", "It's just a deep seated jealousy. Gays are forced into a single column while bi folks get to hopscotch across the line and if they wanted to could totally remain closed their entire lives with no real ill effect. \n\nI'm not saying it's right, and I don't personally hold that view at all, but it is conceivable most gays don't realize why they even dislike bi folks.\n\nIt could also stem from fears of infidelity and insecurities exacerbated by how gays tend to grow up and constant worry over abandonment. If the person they're with could fall for either sex, why would they stick around for just them? \n\nI've heard another take where bi people need simultaneous active relationships with members of both sexes? But... I'm not sure I buy that line.\n\nSource: I'm LGBT and I've got lots of LGBT friends", "Good grief.", "Did she think grasslands just meant places that have grass?", "Yes! We tried public school and it was a disaster. My daughter is smart but stayed in trouble because her IEP did nothing to help with her issues. \n\nShe was the only kid reading in her kindergarten class and was so bored. She is the queen of random facts. Her dad and I are both nerds, but she just amazes me with all the random things she remembers from reading. \n\nHomeschool can be a challenge with us both having ADHD, but we just go down the rabbit holes and have fun.", "He should also look into sueing his employer.\n\nThey have a responsibility to create a safe workplace for him, which they are being negligent in.\n\nAs he just said, he's not even allowed to block parents emails ... when they are CRIMINALLY HARASSING HIM.", "And quite obviously I thought.\nSeems lots of folks took it very literally", "Fucking hell hahahhahahahahha\n\nDo you teach your kid using accelerated grammar program?", "As a nonbinary apostate: I'm sorry to say you're in the minority, but I'm glad that you are. We need more people like you.", "Well, we don't have hall passes either. The only rule is that during exams it's one pupil at a time so they don't cheat.\n\nI'm not saying that asking is wrong, but in the US there seems to be the option for the teacher to say no which I find horrendous", "Your troll game is seriously sub-par, so quit it already.", "They misused there/their in the previous comment, too. 🤣", "Do you mean private schools? Or are you referring to a type of school outside of the US?\n\nBecause charter schools in the US are public schools/publicly funded and legally *cannot* be (institutionally) religious.", ">people too conservative to send their kids to school get together with people too liberal to send their kids to school, so they can all work together on keeping the state out of their business.\n\nThis is a beautiful summary.", "I think it's more during exams or for keeping track of kids. Like a kid disappearing during an activity or being gone for 20 minutes but the teacher didn't realize they'd slipped out. Or the issue of an older kid cutting class or leaving campus entirely. \n\nThis is especially taught to younger kids, starting at the age they might have distraction or discipline issues, and the age they're going to the restroom independently. Wandering off to go play with the recess toys is way more interesting than going to class for a 4 or 5 year old haha.", "If this wasn't extremely sad and worrying, it'd be hilarious. 😭\n\nI'm so glad that in most of Europe you can't homeschool...", "I looked at their profile and it seems to me like English is their second language. I've been around both homeschoolers (as a former homeschooler myself) and non-native English speakers for most of my life, and the mistakes they make are way more similar to the latter. I am fully against homeschooling for any reason, but it really just seems like this individual is bilingual and not fully fluent."]}