{"id": 9804, "submission_id": "110r17t", "title": "WIBTA for requesting a child be removed from my class due to his parents?", "selftext": "I am an art teacher at a school in a small town, recently I welcomed a new student to the class, he had previously been homeschooled but had begged his parents to let him go to normal school with his friends, he's a great kid, he has already fit right in with the class and he does really great work, my only issue with him has been that he does not ask to leave the classroom, if he needs a bathroom he just leaves. I'm not the strict \"everything needs to be my way\" kind of teacher, but administration has a very strict policy for students outside of classrooms during class periods.\n\nI asked his parents to come in so we could discuss it, to try to get them to help me figure out a way to get him to follow this rule. They arrived and seemed like fine enough people, but then saw my photo on my desk of myself (28m) and my husband (31M) they asked who it was and I was honest, it has never been an issue before. They later called the school to report me for \"inappropriate behavior in the classroom\" mind you I do not talk about my husband in class, I am there to teach, not preach lol. \n\nAdministration is definitely with me on this, but honestly they have started sending some really rude emails to my school provided account and I would like to honor their wishes that their child not be \"exposed\" to my \"disgusting lifestyle\"\n\nI may be the asshole here because as good of a student as he is I just no longer feel comfortable with him in my class, he loves art class and there are no other art teachers at the school so he'd be removed from the course entirely which I know isn't fair to him. But it also is not fair to me to be called things like groomer, and accused of working in a school to \"corrupt innocent minds with [my] filth\"\n\nEdit: forgot to add, they have requested I be fired and replaced", "created_utc": 1676237899, "permalink": "/r/AmItheAsshole/comments/110r17t/wibta_for_requesting_a_child_be_removed_from_my/", "score": 336, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I am considering removing a student from my class because of his parents behavior\n\n2) he is a good kid and loves art class, it's his favorite and he has real talent (especially for an 8 year old) and it's not HIS fault\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, I’d also want to distance myself from such parents. Unfortunately, the only person who will really be affected by their madness is their child. And I don’t see how having a picture of yourself with your husband is so wrong. Unless you’re naked on a bed with him.", "This is something for the school administration to handle. You should not have to put up with this kind of harassment. They need to make it stop one way or another.\n\nEDIT: I read your comments about not feeling safe now. Your school and maybe the other parents need to have your back here. If they are already making a public issue of it, you might want to get police involved too.", "NTA, but the school may not be able to remove him entirely, so I would advocate for another adult to be present in the room when you teach his class. You should also insist that any further communication should go through administration. \n\nHis parents are already making false allegations, and if the administration is not willing to address their behavior, they at least need to take steps to protect you professionally. \n\nA lot of the y t a and e s h comments are ignoring the very real danger that the parents’ behavior could be to your career and livelihood. Of course you don’t want to punish a child, but if given the choice between your career and a child being in your class, there is nothing wrong with protecting yourself.", "NTA. But the administration should be doing more to deal with them.\n\nI lot of parents homeschool their kids to keep them from being exposed to anything they do not approve of.  The actual education is secondary.\n\nIf yours school's backing is strong enough they may withdraw him.  Sucks for the kid though.", "NTA, the parents made it clear they are going to antagonize you until he is removed, you'll both be happier. It's too bad for the kid because you'd probably be a great influence but for your own peace of mind, but it's not worth the misery.", "NTA. I would recommend that you make sure that you are never alone with the child in case his parents try to claim that you engaged in inappropriate behavior. If the child wants to speak with you alone, make sure the principal or another teacher is present.", "NTA. Ever wonder why he was home schooled in the first place?", "Speak to a lawyer.", "NTA- Either way we know your Job is safe, but you shouldn't have to put up with harassment. Before removing a good student from class, I would attempt to use the schools resources to have an OOP filed against the parents.", "NTA here, you need to protect yourself here. Do not expect too much from the school. They tend to bend to parents. First and foremost you probably just need to report these emails to the police and see if you can get a tro. Are we talking about a small private school or an actual district. Either way, there should be a governing body they will eventually escalate this to which more than likely won't be good for you as I stated earlier schools ultimately always tend to bend to parents and generally the most horrible of parents that pops up out of the woodwork.", "NTA;  This kid's parents suck and it isn't your fault.  With them outwardly hostile towards you, you cannot provide their child a safe environment for education.  Your employment and safety may be threatened.  Suck for the kid who is the victim of his parent's prejudice.", "If they don’t want their son to be in your class because you are gay then they need to be adults and tell the school to switch his class instead of sending you hateful, homophobic emails. To be honest the school should have already moved him given that they know about the parents behavior. I worry that if you request he be removed his parents will feel like they have “won” and that’s not fair to you. Let the kids parents be the “bad guys.” My judgement is NTA and I feel sad for both you and your student.", "NTA. They don't want you teaching their kid and you aren't comfortable teaching him anymore. Hopefully they can find him an online lesson or something similar or at least give him supplies to keep going on his own - if they were previously homeschooling him they should be able to find him some way of doing it on his own.", "NTA - you a teacher and you are allowed to protect yourself from an abusive environment.  It sucks that the kid gets punished by being removed but either the school steps up and provides you more support or you protect yourself", "Honestly it's tough to make a judgment here. You're NTA, but neither is the kid, and you having him removed from your class is taking away a fantastic opportunity for growth for him. \n\nIs it possible for you to have these emails redirected by the school's IT department? Perhaps someone in the administration can step in and screen these emails for you, or the parents can be told that they must contact the administration with any concerns instead of reaching out directly to you? On that note, are you even sure that these emails will stop if you have the kid removed, or are these parents going to keep harassing you or the school about you?\n\nUltimately, I get it. I wouldn't want to be in an environment where I'm being degraded like that either, and if you choose to have the kid removed I can't blame you.", "INFO: Could you simply block the parents emails and force them to communicate directly with administration, rather than with you?", "NTA, with some conditions. \n\nListen, as a former teacher, I get what a nightmare some parents can be. Have you brought the harassing emails to administration's attention? What was their response? Because, honestly, they should be the ones handling this. There needs to be a clear line drawn by administration that administration will NOT be firing you and that the parents either have the choice to remove their child from your class or keep him in art and keep their mouths (and computers) shut. \n\nHowever, if the parents decide to keep their mouths shut, then the young man should be allowed to stay in your class. It's not his fault, and he shouldn't be punished for the actions of other people.\n\nSo, here's my final decree: Your administration is TA if they won't take a firm stance with TA parents of this student. However, YWBTA if you insist the student be removed if his parents back off.", "NTA\n\nSorry for the kid, but his parents are the cause of him being removed from class.", "NTA, and I'm sorry this is happening to you. The administration should attack this problem head-on and make supporting statements against these rumors. Can you file a police report for harassment and defamation?", "NTA These people will do ANYTHING to manufacture a reason to get you in trouble. That would leave all your students without a teacher. Protect yourself for all your students' sakes.", "YWNBTA for requesting that the child be removed from your class, so long as you have exhausted all other options in dealing with the parents. You are not ‘punishing‘ him, and your safety— emotional and physical— need to be prioritised over his feelings. It’s a shame that he loves art and that there are no other teachers to go to, but that’s on his parents, not you: both you and the boy are their victims. Having said that, he may not be able to be removed if art is a mandated part of the curriculum in your area.\n\nIn my country, parental behaviour like this is generally strictly regulated— not just through the union (though that’s one avenue), but through our OH & S (occupational health and safety) laws. I don’t know if this is an option where you are, but in cases of harassment here our admin will often develop protocols for the parents: e.g. they must not have direct contact with you and are only allowed to email the prin, etc. Having admin field their nonsense would at least resolve the in-school issues without necessitating the boy’s removal. Outside of school is harder, obviously, if they escalate to that point— I would think this aspect is an issue to discuss with your union, police, a free/low-cost legal advice service in your state, or even contacting an lgbt+ advisory service. If you’re in the US, Lambda Legal also outlines your protections on a state-by-state basis, including ones specific to schools: [https://www.lambdalegal.org/](https://www.lambdalegal.org/) .\n\n(Also, if you’re not already, *document everything).*\n\nEdit: first paragraph, for clarity.", "The parents seem like absolutely horrible people and it’s terrible how they abuse you. Also, if straight teachers have the right to have photos of their families then so do you. The whole movement against queer teachers is quite frankly deeply disturbing.\n\nHowever, I’m going with YWBTA. You shouldn’t punish the kid for having terrible parents. The child has probably been brainwashed from their home schooling. So being a positive gay role model in their life will probably be a good thing that can counteract the brainwashing. Get your revenge by giving the kid the best time ever in art class, so amazing he never wants to leave. Become his favourite teacher. Hopefully then he will never want to go back to homeschooling and exposure to the wider world will make him realize what awful parents he has.\n\nIn the meantime, is it possible to block their emails and have the school mediate communication with a parent through a third-party so you don’t have to deal with them directly?", "ESH - don't punish a kid for their parents. Work with the school to manage your boundaries and wellbeing, but don't exclude a kid for their parents bad behaviour.", "Ooof ok meeting with parents is not how any teachers I know would address the bathroom thing. You tell him, then the principal tells him, then administration contacts the parents if it is a school rule not an art class issue. And the initial parent contact would be an email or phone call opposed to an in person meeting. Did administration request that you meet with the parents or was that your call? Obviously these parents are horrible terrible people but you invited them into the whole situation when it was decided the bathroom situation could not be handled in school and the parents needed to be brought in. Ultimately you should not punish the kid bc of the parents block their email or collect them for a harassment case. YWBTA if ur only solution is to dump the kid.", "Ywbta as you don't punish a child for the parent's behavior. But it seems likely with what you claim is occurring that the parents would have already asked he be removed,  yes?", "YWBTA. \n\nThe child is not their parents' terrible choices. Let your administration deal with this. \n\nChances are, the parents will remove the child on their own, it's a shame if they do, but then you're not the AH.\n\nAlso, if the parents remove the child, the child is more likely to oppose the parents and their way of thinking. If you get the child removed, it's all the more likely the child thinks \"maybe mom and dad are right\".\n\nEdit: OP has been drip-feeding additional (very relevant) information throughout the thread that was not in the original post. Sounds like there may already have been an attack, which probably should have been mentioned in the first place. I'm not changing my initial post here because that behavior is BS, but know that I made the call I made based on the information that was originally presented.\n\nThe spirit of this sub is \"tell your story and let the sub decide\". I detest this behavior of \"tell half your story then come back and argue with people and let out the rest of the story one reply at a time\". Yes, this is potentially a serious situation. If that's the case, this isn't the place for this situation.", "Ywbta if you punish a child for their parents behavior. It seems at this point the parents are the sort who would continue, possibly more if you removed their child.\n\nYour school district has the ability to protect you, even if small. Save any evidence, show the principal and school board. Then tell them you need to block these people, for your safety.\n\nIf they disagree then consult a lawyer. I understand being low income and worried, but a lot of people in the field of law do pro Bono work and will direct you to someone who can do that. Especially in relation to hate speech/attacks on someone who is a LGBT minority.\n\nDon't make the kids life any worse, he is also a victim here and likely is treated badly at home. Defend yourself and his need to be around other people his age/different than him.", "NTA for disliking the parents and their attitude towards youm YWBTA if you remove the child. He likes your class, and he doesn't give you problems. He more than likely doesn't even care about your sexuality.Go to your admin, have them present for any meetings between yourself and the parent and CC your admin in any email you may send to them. Also, I'm assuming you do this already via lesson plans (assuming they're required for you), document what you're teaching so they can't go against you with some wild claim that you're grooming their child.\n\nIt's the parents fault that they're being ignorant. The kid is just trying to have fun in a class he enjoys. Don't take your issues with the parent out on the kid if he's genuinely a good student- all that's going to do is; 1. Make him feel like he did something wrong or 2. Make him dislike you and reinforce his parents ideals.\n\nEdit (after reading some replies in the comments): your school board should have a team of lawyers at hand, if not one assigned to your school.  If they are threatening you, especially via email or any sort of written method, take these issues to the school board, with evidence, and seek legal advice.", "ESH, if you get the child removed. It wouldn't be fair to punish the child for their parents behavior. You can show this child that his parents are wrong by being accepting of him. Talk to the principal and other staff members and create a plan to address the child's behaviors. He clearly wants a public education and may already know his parents views are problematic.", "YWBTA it's not his fault that he has awful parents. Chances are the parents will end up pulling him out and homeschooling him again. So at least give him the chance to learn something outside his awful upbringing", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am an art teacher at a school in a small town, recently I welcomed a new student to the class, he had previously been homeschooled but had begged his parents to let him go to normal school with his friends, he's a great kid, he has already fit right in with the class and he does really great work, my only issue with him has been that he does not ask to leave the classroom, if he needs a bathroom he just leaves. I'm not the strict \"everything needs to be my way\" kind of teacher, but administration has a very strict policy for students outside of classrooms during class periods.\n\nI asked his parents to come in so we could discuss it, to try to get them to help me figure out a way to get him to follow this rule. They arrived and seemed like fine enough people, but then saw my photo on my desk of myself (28m) and my husband (31M) they asked who it was and I was honest, it has never been an issue before. They later called the school to report me for \"inappropriate behavior in the classroom\" mind you I do not talk about my husband in class, I am there to teach, not preach lol. \n\nAdministration is definitely with me on this, but honestly they have started sending some really rude emails to my school provided account and I would like to honor their wishes that their child not be \"exposed\" to my \"disgusting lifestyle\"\n\nI may be the asshole here because as good of a student as he is I just no longer feel comfortable with him in my class, he loves art class and there are no other art teachers at the school so he'd be removed from the course entirely which I know isn't fair to him. But it also is not fair to me to be called things like groomer, and accused of working in a school to \"corrupt innocent minds with [my] filth\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YWNBTA. The kid is clearly having some issues with traditional school structure. This whole thing got started because he wasn't adhering to the rules. It's disruptive and you have other students. You asked for a conference to discuss the disruption with his parents, and it turned into homophobic bullying by people who conflate orientation with lifestyle choices and child abuse. Your classroom has now become emotionally unsafe for you because he's there, potentially unsafe physically as well depending on how far this goes. Is it going to stay at cyberbullying, or do they proceed to doxing and threats? I feel for the kid, but your class isn't only about him and neither is your career.", "NTA.   geez.  The parents are total AH", "YWBTA for having the child removed unless he's parroting his parents' bigotry and hate. It's punishing the kid, and he clearly needs the exposure to more tolerant views. You also have a right to a harassment free work environment so the proper recourse here is to notify the parents they'll be communicating through admin and/or sending actual letters, then set up a rule in your email box to have anything from them automatically forward to the department AP.  If anything actionable or genuine concern is sent, your AP will notify you, and you'll be able to schedule a supervised meeting. Although, for the most part, they tend to stop because hate mail isn't as fun for them when others see it. \n\n(Taught 15 years before leaving because of people like this)", "ESH. Getting students to ask to use the bathroom is extreme and it was unwarranted to get parents involved for this. The parents suck for being rude in your emails. You are a school teacher you can't just 'remove' a student from your class. Don't punish kids for their parents.", "Thankfully my classroom is under camera", "Not really, I know a lot of homeschooled kids in the area for various reasons", "Our schools IT department is currently not a thing lol, we barely have a computer lab, the computer teacher runs everything for us", "OP cannot put himself at risk for this child, regardless of \"opportunity for growth\".", "I am not allowed to block parents emails, I can request they go through admin\n\nI'm more concerned about them getting me attacked outside of the school", "No, OP’s job is to teach Art, not to unteach homophobia. It’s not OP’s responsibility to undo the parents bad influence by “being the good gay role model”. OP isn’t punishing the student, it’s the parents who are punishing the student by ruining OP’s ability to comfortably teach in his own classroom. If anything; getting dropped from the Art class will be an effective lesson in the consequences of their parent’s bigotry. OP is the victim here. The child’s lack of art class would be the parent’s fault, not OP’s. NTA", "He's not TA for protecting his career and his family and his LIFE. Good lord. Tragic for the boy to lose an opportunity, of course, but his art instruction doesn't trump the teacher's safety.", "He's worried they're going to hate crime him, my guy. It's far past that.", "They are attempting to get me fired and have told a bunch of people in town I am a p*do, I feel unsafe at this point OUTSIDE of school grounds", "I had attempted multiple times to rectify it internally, parents were called in when it didn't work", "He's not being an asshole or punishing the child. He's protecting himself. It doesn't sound like it will be long before these people file a complaint that the teacher has molested their son. He needs to have this child removed from his class like yesterday.", "They are asking that I be removed and replaced", "The parents are slandering me and attempting to get the school board to remove me, they have also told several people in town I am a p*do", "School board can't protect me from getting attacked at the gas station again", "I really just don't want them to end up getting me attacked in public by branding me a diddler, they also are attempting to get me fired", "OP is worrying about them murdering him. It's not about punishing the kid. It's about his own safety, which must come first.", "They're attempting to get me fired through the school board and have managed to get a few people in town to believe I am a pervert", "I literally do not have control over the bathroom thing, the school requires it for \"safety\" reasons, I attempted to talk to him directly as did another teacher (his general studies teacher) she was unable to meet with the parents so it fell to me after we tried everything else", "It's not about asking permission for going to the bathroom,  it's knowing where the students in your care are.  If there's a fire or a lockdown, teachers may need to tell firefighters/police the last place a student was if they can't be accounted for.  It the student has a medical episode or falls and hurts themselves, the teacher would be the one to notice they've been gone a concerning amount of time.  Teachers are considered caregivers while students are under their supervision, and in some situations can get in deep trouble if they can't account for their students. OP is NTA for doing their exact job as is required of teachers everywhere.\n\nThese parents can easily ruin his life.  He needs to distance himself from this whole family.", "There's this weird thing where teachers need to know where students are.", "I’m glad and sad at the same time.  And I feel sorry for the boy, but you need to protect yourself and make sure they have zero ammo, no matter how innocent.  People like that can vibe vindictive.", "The majority homeschool for religious reasons, they generally do not interact outside there church.", "Really? Look at your interaction with his parents and think it through. Religious bigots perhaps?", "It sucks but your safety is the most important thing.  If your administration won't take whatever steps are neccesary to protect you than the kid has to go.", "The parents could try to escalate this. NTA.", "OP, if that’s the case I suggest you consider filing a harassment report with the police.", "Consult a lawyer.", "That really sucks. I'm really sorry you are dealing with this. Although I'm not sure it would stop if you did ask the kid to be removed from your class. \n\nAgreed re consult a lawyer.", "I’m saying it shouldn’t have fallen to the art teacher if it is a school rule that he was presumably breaking in every class. Not that it matters at this point but small town homeschoolers often do so bc they don’t trust public education bc of their extreme views. This was never going to end well and it sucks that it was over something so trivial as asking to use the bathroom", "Well you say admin supports you so that isn't happening. Have admin talk to parents about how they are not allowed to send abusive emails and would they like son removed from the class.", "Do you have a lawyer? That is slander. Get a cease and desist sent. Or have school block their email from your account and have principal deal strictly with them.", "Nothing about this is fair for you, but getting the kid kicked out confirms all the parents' hate toward you and doesn't hurt them in the least. It hurts the kid.\n\nSend a legal threat to the parents if you really want. Otherwise just wait 'em out. They'll fuck off eventually. \n\nPS if the town REALLY believed them, you wouldn't be teaching right now. They can spread all the BS they want.", "No they cant personally, but they should have protected you from it ever getting to this. You need to tell them what is going on and say their lack of involvement in protecting a teacher who is a minority is going to look bad if anything happens. That you are afraid outside of work and don't know what to do. If they don't give any hint of caring then this is ok you to take care of sadly. But keep all evidence of their lack of help, as this is likely against the law for them to not protect you.\n\nCall a lawyer immediately, Google lawyers that work on civil rights and LGBT hate crimes. Waiting for something to happen from the school may not work, and if you do find a lawyer who says that they are in the wrong you may be owed damages/be able to protect yourself if anything these parents do isn't put to a stop by the board.\n\nYou have rights, but removing this child would harm him  and likely make these people double down for 'discriminating' against him. Which could cause you more harm.", "This is a very hard situation to be in. If these parents are acting like this they might get more unhinged if you exclude their child. You should talk to the school board and maybe get some legal advice.", "Then sue them", "I know a few who do it because we don't offer accelerated programs", "In this case yeah", "I'm a teacher, I cannot afford a lawyer", "This.", "I can't afford one and also a lawyer can't stop a stabbing js, but I'll see what I can scrape for it", "By admin I mean principal and Super, idk about the rest of the school board", "I'm a teacher", "Most of the town may not, but a select few definitely do, and are not the civilized protest type", "I will try that but I can't really afford a lawyer, I'm a teacher and my husband is a mechanic, we make ends meet but not by much", "I can't afford a lawyer lol", "We homeschooled are kid for the same reason.\n\nWe were definitely a small minority.", "If you have a union, consult your rep about what resources they can provide.", "What about the ACLU or similar?", "Contact the school district to determine what legal resources it can provide. Document the harassment and reach out to law enforcement.", "Reach out to Lambda Legal or the ACLU.\n\nEDIT:  Is there a local or regional PFLAG chapter near you? They might have a lawyer they can recommend, who would be willing to help you pro bono or on a sliding scale because family.", "You can get a lawyer to write you a cease and desist for pretty cheap. It doesn't carey legal weight, but a lot of times it's enough to scare people into knocking it off. Plus it lays some paperwork in case things do escalate.. Do what you think is best though. You don't want to accidentally incite more hositility", "Some lawyers will offer an initial consult for lower fees, but probably good if you can get a recommendation from a friend. Might also be worth asking for advice in other subs. \n\nI honestly don't think removing the kid will change things. The parents are clearly irrational bigots, I don't imagine they'd just stop now that they've set their sights on you. \n\nIt's a truly horrible thing you are going through. I hope you have supports in your school and community.", "Find a lawyer that will do a free first consultation. What I read the parents are slandering you and you should have a case where the lawyer can write them an official complaint", "Yes, that's who you need to talk to,  the principal first and then superintendent if principal is not helpful.", "Call your union rep. Lawyers are part of why we pay the dues", "You fight them, they're going to fight back harder, and things are gonna escalate.", "The school, the board and the union have access to lawyers. You need to get this dealt with. Also harassment is a crime so you need to go to the cops, if you're genuinely concerned for your safety you need the cops to tell them to leave you alone.\n\nAll interaction needs to be through the principal at this point, you don't need to speak to the parents and the school should be making a decision about what to do and they shouldn't be allowing anyone to harass their staff. They have a duty of care to their employees.", "i guarantee, there is a lawyer out there who will take this case on as a contingency. They slandered you and made false accusations. Get their fucking house.", "You don’t have a teachers union?", "Oh snag, I wouldn't have thought of that", "Local sheriff (towns to small for a PD) is anti-lgbt to an extreme, idk who to contact instead", "They can protect my job only, not me. And if the PTA gets infected I am fucked and will likely need to find a new profession", "The local sheriff (closest thing we have) is on record as hating gay people so much he wishes he could execute them via dragging", "They have started that since the case is a personal conflict and the school is not the one causing it that they have limited resources for me. They currently can't even get me the crayons and paints I need", "Make the report locally to start a paper trail. If nothing gets done, contact the county or state.", "State Attorney General.\n\nACLU.\n\nYour Congressional representative.", "Do you have a concealed or open carry permit? That'll protect you good. \n\nInvite the PTA over for a BBQ. Everyone loves BBQ. Get them on your side. \n\nI fail to see how you think having the student removed is going to help with any of these concerns you have? The parents would still have it out for you in this scenario.", "Solid what a nightmare. His department still has to enforce the law whether he agrees with the homophobia, you can't slander people and you can't send people countless harassing messages. It doesn't necessarily need to even get to his level surely, or is this place so small that he deals with everything personally??\n\nUltimately it sounds like your best bet is to use the school and the union for support. It is their responsibility, and the union is where I would begin, they will lobby for your right to a safe work environment. If you need private legal advice often you can get a free consult or local university law departments run legal clinics of law students supervised by lawyers who take cases pro bono.\n\nI don't know, america is a fucked up place from everything I've heard. I don't even understand how you can have people get away with that shit in positions such as the sheriff.\n\nReally sorry this is happening to you. Any decisions around this child and their parents needs to be made by people above your head and as I said before, all communications need to come from above your head as well.", "Ok but do you pay union dues or are you in a state that does not allow teachers unions? Bc if you are in a union they will provide a lawyer.", "I... Shit I hadn't thought about that... I may just need to move I guess", "He mostly deals personally, small area, I think he has like a single deputy. \n\nHe has the position because nobody else ever runs, there's no option but him so he wins by default", "I pay dues, but they have started this is outside what they provide legal services for since the school isn't against me here", "Maybe. But have you even looked into gun laws in your state? Some states are quite liberal with personal protection. And if the parents see you at the gas station carrying they might think twice about messing with you.", "Huh? It’s harassment at work. And you said admin isn’t doing anything. That’s totally a union thing. Idk dude", "I am not at all comfortable with firearms, as a kid my uncle accidentally shot his wife while I was staying with them, she lived but had brain damage", "I am so sorry for this poor boy, but his opportunity to grow creatively does not trump your civil rights and safety…or the safety of your husband. I would file a report with the police, just to have something on record. The school should provide legal intervention in the “cease and desist” kind of way. And if that doesn’t work, well, guess this will be one more thing he will hate them for later. That is sad. Tragic, even…but protecting his right to be creative (not being snarky; I feel that truly is very important) isn’t going to help him and could truly damage you and yours. NTA", "The parents want to replicate the home school experience.  You won’t he able to overcome their bias. \nYour school needs to stand up for you very strongly.  Make sure the camera footage of your classroom is retained with dates and time of day and kept in a safe place", "NTA", "NTA, and at this point I don't think you have much of a choice in terms of removing him from your class, for your own safety. The fact that they already called you a \"groomer,\" coupled with the rest of the behavior you described, tells me that they COULD eventually resort to accusations of inappropriate behavior on your part. I understand your classroom has a camera, but all it takes is one accusation of \"he touched our Timmy in the bathroom/said x y z/etc\" and you'd have a proper shitstorm in your hands. It wouldn't even matter if you could prove them wrong; a whiff in the rumour mill that a teacher is inappropriate with small children can and will ruin careers and lives. It's too big a risk for you to take. I'm sorry for you and for the kid, OP, but you gotta protect yourself. (edit for spelling)", "Do his parents know your classroom is on camera?", "NTA - do what you need to to feel safe. \n\none idea - can you talk to your principal about setting it so all emails they send to you are automatically forwarded to him so you don’t have to read it, or getting an exemption on blocking? I suspect they’re required by law to protect you more than they are, but it’s not my area of law. \n\nAlso, are you in the US? If so, worth calling around to some of the orgs on here to see if they can help: https://www.nalp.org/lgbtq_organizations\n\nYou might also post on one of Reddit legal forums to see if someone can give you any basic advice from an employment law standpoint to see if the school is required to do more to protect you. \n\nI’m sorry this is happening to you, and so sorry about the sheriff - how terrifying. Definitely if you call those orgs mention him - they may be willing to do something about him too.", "NTA\n\nShort term mental health protection. Almost all email platforms allow you to presort emails into folders as they arrive. Redirect theirs to a folder so they aren't in your main inbox. Then ask a colleague periodically to pop on your computer to forward them to admin. Also see if they can print them so you have documentation of the harassment.\n\nLonger term. This is harassment. Plain and simple. And you shouldn't have to just take it because you are an educator. Talk to admin again. Make it clear that the harassment needs to stop. They can either properly deal with it or you will need to escalate it as you fear for you safety. After this in person meeting email them a summary of the meeting asking them to confirm this was what was discussed. \n\nNo matter what they do find some outside support. Either through a teachers union rep (whether you ever joined or not) or through and LGBTQ+ organization. Often both have access to legal advice, mediators foe conversations, and lawyers if you need it. Don't wait till you need them to reach out. \n\nI hope things get better for you and you stay safe!", "Print and save all email. If possible forward to your home email.", "I think you need to document all that, take it to the administration and also keep a copy in case you need a restraining order for those assholes.\n\nNTA, you don't have to tolerate those homophobes.", "NTA, It sucks having to punish a kid for parents behavior but this is about your saftey. Inform administration (if you have not already) about the emails and ask for removal. This could help teachers if the parents decide to go after anyone else.", "Nta, talk with your administration about not feeling safe at work and to remove that child from your class", "I guess you’re NTA but it sucks to punish the child for his parents’s shitty views and actions. He can learn not to just walk out of the room without the parents being involved. If the kid starts parroting them, though, I’d 100% agree.", "NTA your protecting yourself from abuse (verbal and emotional) in a work/school environment. This means your also keeping the other students safe too.", "NTA", "Lol they sound like psycho Christian’s. They would accuse you of living an even more satanic lifestyle if you weren’t married \n\nSpeak to a lawyer and the cops. This is felony stalking and harassment", "NTA The us is losing teachers like mad. It’s okay to remove this particular situation from the list of stuff you have to deal with and avoid letting it burn you down.", "NTA I feel so bad for you and the kid. Good luck.", "NTA- The parents created this situation", "NTA, you would not be the AH. What all of these \"punishing the kid :(\" and \"you could be a good influence\" comments are naively ignoring is that if this kid, great as he is, ever went home and so much as implied that you had talked about your personal life or beliefs, it would get infinitely worse for you. You cannot be a positive influence for this kid because you're just supposed to be an art teacher, who teaches art. Not life lessons and tolerance. You can't be his introduction into progressivism or whatever people are going on about because his parents will brand you a predator and try to ruin your life simply for existing, let alone doing anything that might combat their brainwashing. Protect yourself and your job.", "Holy shit. NTA….1000 times, NTA\nThis world (country) has gone of the rails & lost its ever loving mind. I am so sorry you have to deal with this. And I feel bad for the kid too. These parents don’t realize that their overly “protective” ways are setting them on the path of “I don’t understand why my kid doesn’t talk to me anymore.” If your administration backs you, kudos to them, and for your sake I hope they continue to. That child will suffer but there’s nothing you can do about that.", "NTA. The parents are bigots.", "You might consider trying to get a restraining order to stop the harassment.  \n\nNTA", "NTA", "NTA but can you ask the administration for ways to buffer you from the parents.  Such as (1) Having the administration tell the parents they are absolutely not allowed to contact you directly and any communications should be directed to someone in administration and (2) enforcing that.  \n\nThis kid desperately needs to not be stuck being homeschooled by his parents  and if there is any way for you to keep teaching him and giving him this better input, it would be great to make the effort.", "NTA, but I’m super jealous if you’re in a district where you can do this.  I’ve been assaulted by students and parents have attempted to assault me and threatened to kill me and my family, and the student was sitting in my class the next day.  I was told I could be moved to a different school, but they wouldn’t be moved anywhere (being moved would be bad for me for a variety of reasons but mostly because it would be traumatic for my other kids and families and I’d be away from all of my teacher friends and you get moved to even worse schools usually).", "NTA.  They have started using things straight out of the Nazi playbook.  All bets are off now.\n\nDoes it mean the kid is being punished for his awful, disgusting parents?  It does, unfortunately.  But you are being unfairly punished _much_ more harshly by people who are, again, fine with with using pages straight out of the Nazi playbook.  They are trying to get you _killed_, period.  This isn't just \"we need to get him fired\", going around in the community is designed to get you harmed, or at the very least, run out of town if you have the \"good sense\" to leave before they hurt you more.  They want to ruin your life, and possibly _take_ it, because they're assholes.\n\nI worry that now that they've set this in motion, nothing you do short of leaving town will actually keep you safe.  You've said you don't like guns, which is fair, and I wouldn't trust it to keep me safe in this situation; martial arts won't do much to keep you safe when they get a group, especially not in the short time you're likely to have to actually learn something; the sheriff isn't going to help you, based on what you've said about him.\n\nFor now, get the kid as far away from you as possible.  That's not an asshole move; that's basic safety.  _Your health and safety always matters more than the child of bigots, no matter how good of a kid he might be_.", "NTA. Could you just block them from contacting you? Have everything go through the administration? If that can’t be accommodated I would think you have no choice but to ask that the kid is removed. It’s unfair to the kid but this won’t be the only time his parents mess something up for him, I can guarantee that.", "Gee wiz parents are ah\nGet cameras for car home etc and have own cameras\nHave other teacher with you\nAlso like others said there are lawyers that would take it", "NTA, but personally, I wouldn’t jump to having the child removed since he’s not the problem. Perhaps there’s an intermediate step. What is your school policy regarding harassment? I would talk with a union representative and the school administration about how to file a harassment complaint. The school can give the parents an official warning. If the parents persist, perhaps the school can redirect all communication through a third party. It’s obviously up to you and your comfort level, as well as your school policy.", "NTA- put your own safety and health first. \n\nFile police reports about the emails, they may be classified as hate crimes. You and your husband may need to get a restraining order against the unhinged pair. \n\nAre they the religious fanatic type of homophobic ranters with scripture preachings and hate slogans like the WBC? \n\nOr the secular lowlife versions that target their hate campaigns at random homosexual people and anyone else they see that supports same sex marriage?", "Please file a police report. Hate speech is illegal.", "This is a hard one, he is a innocent child and it is not his fault. Perhaps you could redirect their emails to someone else such as the school administration? I know you cannot block another person's email as a school account but maybe look into sending their horrible emails into a spam container or forward it to an administrators account?", "Agreed. You get one homophobic kid in that class and false allegations can ruin OP’s career in a second.", "Plus, it will bother the parents a lot more to have their child continue to be exposed to OP's disgusting lifestyle than to have the kid removed. And OP can set a good example for him, showing him that gay people aren't any different than straight people. This kid really, really needs some good role models.\n\nThey're not going to fire OP, so he should just have fun with this. Next class project--they can all paint rainbows!", "Home schooling is not as uncommon for non-crazies, especially in the wake of Covid. Lots of kids are home schooled for various reasons. I found out during Covid I have an autoimmune disease (we were still testing for more) and my daughter was supposed to start kindergarten. We made the choice to home school her until we had more information and were in a safer spot. My daughters program also had kids who struggled with in person instruction, and many of the older kids were suuuuuper heavy into sports and/or music/arts. While, obviously, you still get the ultra religious parents, the stereotype of “all home school kids have crazy parents” is not super accurate anymore. Home school programs are publicly funded and overseen by licensed teachers (in my state at least) with the same standard tests as public schools.", "There isn't another art class", "I assume so since the entire school has cameras", "Expecting every member of a minority group to be the “good minority role model” is such a bigoted view and I need it to die.", "Hard disagree. NTA even if he removes the student. It isn’t his job to accept abuse and potential safety threats to help a single kid. It’s also not his responsibility to represent all gay people and that perspective is rooted in bigotry.", "Normally I'd agree, but when someone is pulling actual Nazi tactics against you, their kids' feeling stop mattering _real_ damn fast.", "Are you a teenager? You sound very much like a teenager.", "It's not your job to endure abuse to \"save\" this kid, but he seems to have abusive and psychotic parents that are definitely the restrictive, sheltering type. It's likely he won't be able to be as artistic or expressive at home if he is removed from the class. It's just something to keep in mind, but again, it's not on you to have to put up with this", "I know. I meant switch him to another class in a different subject. I would so much rather he stay in your class because he clearly loves art and is good at it but you don’t deserve to be bullied and disrespected by his parents. (It’s not his fault his parents are like that.)", "OP, if it makes you feel better about forcing the kid to miss out on art, please know that being removed from your class is truly the best option for him.  This kid NEEDS to be in school to have any shot at being normal and well-adjusted, and if you don't accede to the parents' wishes here, they're apt to just pull the kid from school altogether, and he'll grow up with no influences other than his parents' bigoted evangelical bullshit.", "If you are that afraid, then you need to tell the principal that seeing as they aren't taking steps to protect you, then you will be forced to involve the police. It might be wise anyway- if they are this vile, I would worry about the child's safety too.", "He's not there to represent gay people, which he clearly said and I didn't reinforce the idea that he is anywhere in my reply- you're only one implying it was said anywhere that he must be the one to represent gay people. \n\n But he is there to help kids and educate them. I've been in situations where crackhead parents have threatened ,in person,  to clip me in the parking lot on the way to my car. I didn't remove the kids from my class, I just worked with them and they turned out great.  They weren't the ones giving me issues, their parents were.\n\nHe can give up if he wants and remove the kid but if that's how it's going to be he might as well find another career.  He's going to encounter stuff like this, and swapping the kid to another classroom won't always be an option. Whether it's because he's gay or if it's because he's not teaching how the parents want him to.", "That’s horrifying.", "If a student leaves the classroom you can safely assume it is for the rest room.  This sounds like a very American issue.", "It's pretty standard to assume a student is using the rest room when they leave.", "That's a bit ageist and demeaning.", "There are more secular home schooling families than you think. We have for years, and it is not for religious reasons. We are far from alone.", "“Make him dislike you and reinforce his parents ideals” \n\nYou’re pointing out his position as a “representative of the gays” here.", "The kids feelings and opportunities are less valuable than the person it could get killed. He’s not worth it, remove him.", "Cool, what if they're not? What if you didn't even notice them leave and now you have no idea how long they've been gone? Could they have left the school? What if, because this is probably the US, there's an active shooter?\n\nAdults taking care of children need to know where those children are. He doesn't need to ask permission. He can literally just say, \"I'm going to the bathroom now.\"", "Oof. I forget redditors read into the smallest things to scream bigotry whenever they get the chance. \n\nI was pointing out a possibility that his parents could reinforce their ideals in their child, especially when given a direct reason to dislike the teacher. Never inferred he was a representative of the gays. You read it one way, it was meant another.", "Please look for lawyers who will take this case pro bono.  NTA and yes, you are in danger now if the sheriff is on their side.  Sorry I'm not there to stand guard for you.  With love, just an old auntie", "My best wishes to yare child", "*our", "Yes, my daughter is dyslexic & they didn’t know how to teach her, so we homeschooled for a year, but we were absolutely the minority. I checked into homeschool groups and nope. (She’s grown now, this was in the early 2000s)", "Whatever man, suck a fat one.", "😂😂", "🤣", "Must be pirate family", "You deserve to feel safe at work", "My union rep kinda sucks, like I said won't even fight to get me supplies for the class"]}