{"id": 990, "submission_id": "ykleeg", "title": "AITA for not wanting to pay for my family's groceries anymore?", "selftext": "Hey everyone, thanks for taking the time to read!\n\nI [M21]have been living at home for various personal reasons for the past few years with my father [55] younger brother [18] and sister [16]. Despite my offers to help, my father never deemed it necessary nor wanted me me to pay rent (which is beyond generous) and my expenses were minimal. \nMy only responsibility for the house was to grocery shop and feed my siblings. I was happy to pull my weight and accepted and I have been doing this for years now (since I was probably 18~19yo). \n\nThings have changed recently, and my father wants me to help out more with finances (which is fine. not a problem at all). He has requested that I pay for my car insurance (Okay that's fine. Not a problem. I already pay for my own car payment anyway), my phone bill (once again not a problem. Happy to help), 500 dollars a month for rent (no problem), and to continue to pay for groceries for my siblings. The groceries for our family are around $500 a month give or take.\n\nLike I said, the first 2 criteria are fine. The rent cost is also fine considering I'm sharing a small room with my younger brother currently. The grocery thing though is a little interesting to me.\n\nFirst off, they aren't my kids nor my responsibility, I bought groceries to pull my weight in a way, but now that Im pretty much going to be a \"roomate\" or independent (which once again, I'm perfectly okay with doing) I have lack the desire or see the point to pay for groceries for them anymore.\n\nAm an asshole for this? Do I need to change my perspective? Thanks for reading.", "created_utc": 1667431189, "permalink": "/r/AmItheAsshole/comments/ykleeg/aita_for_not_wanting_to_pay_for_my_familys/", "score": 24, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I need to pull more weight and quit complaining about my subjectively easy life. I could be an asshole to for refusing to feed my family strictly because I'm placing a price tag on their ability to eat and conflicting with my father who has done so much for me and my family in the past and needs help right now.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Since you are a paying roommate, contribute $125 for your share and be done with it. If it is still an issue, tell him you will pay rent or groceries but not both. NTA.", "$500 for a shared bedroom aND all the groceries?  That seems excessive.What is dad’s issue he can’t afford to cover rent and food costs for his kids?\n\nNTA", "Why does he now need your help with groceries?  Did he lose a job or source of income?", "NTA however, you need to move out and here’s why. This arrangement has gone on too long. And it’s not good for you or for him. This setup is an emotional sponge, that will continue to drain your goodwill away, until you start to loathe how your father breathes.\n\nCan you afford to move out? Into a rental? Or into a very small land contract on a  studio? \n\nStart looking for a place if the answer is yes. \n\nIt’s time.", "NTA. Like you said - it was one thing when you weren't paying rent (or the other bills you mentioned), however, now that you are paying rent and bills, asking you to pay for all the family's groceries is a bit much to ask. Like you said - he is the father, therefore it is his responsibility to feed and clothe the minor children.", "I don't think you're an AH, necessarily, but there are things I don't like. First, the first two things are your bills. Your saying that paying those things are \"fine\" or that \"you're happy to help\" feels off to me. Those are your bills--youre not \"helping\" by paying your own bills. And as I write this, I realize what's eating at me about this: it's the idea of help. Your dad is asking for help. He can't do for you or your siblings like he once did. Before, he was paying your car insurance and phone bill, and you were paying for groceries but not rent, which kinda seems like a wash to me. But now your dad not just needs you to step up (paying your own bills and a little rent), but he also needs your help (groceries). It sounds like you've framed stepping up/doing your part as helping, but you're bristling at the idea of actually helping. Before it was kind of a trade off, but now it's pitching in.\n\nI don't know your relationship with your dad or sibs. Maybe he's on a power trip and doesn't really need your help, and maybe there are other more complicated and nuanced aspects to this dynamic that exceed what can be explained in an AITA post. If that's the case, hush my mouth right now. But check in with him, and have an adult to adult conversation. He may be in a sticky situation, and you may have to do some quick growing up.\n\nEdited to add:\nI saw that you've tried to talk to him, and he won't level with you. Pay your bills & rent, contribute to groceries, and work on moving out. NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHey everyone, thanks for taking the time to read!\n\nI [M21]have been living at home for various personal reasons for the past few years with my father [55] younger brother [18] and sister [16]. Despite my offers to help, my father never deemed it necessary nor wanted me me to pay rent (which is beyond generous) and my expenses were minimal. \nMy only responsibility for the house was to grocery shop and feed my siblings. I was happy to pull my weight and accepted and I have been doing this for years now (since I was probably 18~19yo). \n\nThings have changed recently, and my father wants me to help out more with finances (which is fine. not a problem at all). He has requested that I pay for my car insurance (Okay that's fine. Not a problem. I already pay for my own car payment anyway), my phone bill (once again not a problem. Happy to help), 500 dollars a month for rent (no problem), and to continue to pay for groceries for my siblings. The groceries for our family are around $500 a month give or take.\n\nLike I said, the first 2 criteria are fine. The rent cost is also fine considering I'm sharing a small room with my younger brother currently. The grocery thing though is a little interesting to me.\n\nFirst off, they aren't my kids nor my responsibility, I bought groceries to pull my weight in a way, but now that Im pretty much going to be a \"roomate\" or independent (which once again, I'm perfectly okay with doing) I have lack the desire or see the point to pay for groceries for them anymore.\n\nAm an asshole for this? Do I need to change my perspective? Thanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA That seems to be a huge increase to your contribution. If you add it all up and it would be much more than what you would have to pay to be a room mate in your own apartment, then I suggest you consider that as another option.\n\nINFO: Can I ask why your 18 year old brother is not working and contributing to the house as well?", "NTA you should be paying for all your expenses and if you pay rent and for your own groceries you shouldn't have to pay more, if he thinks you should, maybe you need to move out and find a roommate to share expenses.", "NTA\n\nBut I think you have just become used to paying so little in contribution that this all just seems A LOT at once, and essentially it is. All of the sudden you're only paying $125 p/week for groceries, and now it's going up probably around a few hundred dollars p/week, I think it's fair to ask questions!\n\nHe might genuinely have financial issues and he is embarrassed to tell you, sometimes people are too proud and especially would feel bad asking his son for financial help if thats what it is....\n\nOr maybe he might be trying to push you out? Are things getting a little cramped at home? Sometimes parents do this with kids, they start charging rent and asking for all the bills they would be paying if they lived out of home, just to test them, and almost to get them to say\"Oh well I might as well go out on my own with some friends\"..\n\nYou've had a great run! Getting your car insurance, phone bill payed for, only having to chip in for groceries every week, hopefully during this 2-3 years you have used that to your advantage and been able to save your money a bit!\n\nBut it might be time to get some friends together and find somewhere on your own.", "NTA\n\nYou've been buying groceries in lieu of paying rent.  And $500 a month for rent, utilities, phone, and insurance is a reasonable amount for a young person who is working a full time job.\n\nBut you're correct that your Dad is asking you for too much.  You should pay your share of car insurance (total insurance divided by number of drivers in the house, ~$100 per month), your share of phone bill (total bill divided by number of phone lines, ~$50 per month), $500 per month for rent and your share of utilities, and your share of groceries (~$150 per month).  If your father wants more money, he could ask your 18 year old brother to pay something for his expenses.", "Have nothing to add to the above but my verdict- NTA.", "copied from another response:\n\n\"The things is, I've asked and I have no idea. He has the same job he's always had that pays quite well. My parents have been divorced since I was around 17 or so and my father keeps mentioning his retirement. Retirement this retirement that. So the only thing I can think of is that his retirement was split and he's looking to recuperate some of it. I could be way wrong however. The only thing I know is that to my knowledge his financial obligations SHOULD be less because we were a family of 4 kids 2 adults. 1 kid lives by himself, mom isn't in the picture, and only 1 remaining kid is under 18. \"", "The things is, I've asked and I have no idea. He has the same job he's always had that pays quite well. My parents have been divorced since I was around 17 or so and my father keeps mentioning his retirement. Retirement this retirement that. So the only thing I can think of is that his retirement was split and he's looking to recuperate some of it. I could be way wrong however. The only thing I know is that to my knowledge his financial obligations SHOULD be less because we were a family of 4 kids 2 adults. 1 kid lives by himself, mom isn't in the picture, and only 1 remaining kid is under 18. Not very transparent with me at all with that stuff unfortunately.", "I appreciate your response and thoughts. I will definitely be looking more into this option.", "I appreciate your response and keeping it real with me aand I see what you're saying in regard to the \"helping out\" sentiment I have. Like you already saw/read, I have tried to ask what the situation is looking like with his finances to no avail. I think the \"help out\" mindset comes from the fact that he has been adamant in the past about me not having to worry about my bills, and I felt I owe it to him to pick where where things have been easy for me for so long. I'm more than capable in doing that given my situation currently but I would like some transparency on his end.", "Thanks for your response. 18 year old brother has a job he works part time 2 days a week but is primarily a full time student and athlete in college.", "2nd the motion.  NTA.", "OP\nHe may have recently lost the child support for your younger brother, actually. But whether it is that or something else, you should look into how much it would cost for you to get your own place. At the very least it might give you more bargaining power and a backup plan if your dad won't budge.\n\nAlso keep in mind that your time planning what groceries to get, getting them, and preparing the food is also super valuable labor. Add up the time and what it's worth if you were being paid a fair wage for it.\n\nFinally, if you had to start contributing around 18, so should your brother. Time to nail down those dates on when this started. Your dad needs to justify this double standard if he's asking you to pay more when your brother doesn't have to at all. Your dad has been pretty chill up to now so I hope you can get some answers from him. Finances are not an easy conversation to have.", "You are NTA. You are already pulling your weight.  Sounds like he did not save for retirement and now he is more closely approaching it so he is worried.  But buying groceries for the family? That makes what you are paying to stay there in a shared bedroom close to $1k per month.", "That makes a lot of sense. I do think if your dad needs this help and is asking for it, he ABSOLUTELY owes you transparency, especially considering the precedent he's set. He's got to treat you like the adult he wants you to be. \nThis is tricky. I wish you and your family nothing but the best in navigating this situation. Most of all, though, I hope you're able to make a seamless transition into a happy and thriving independent life.", "OK, well, if the new arrangement is going to leave you with no money, the only other option is for you to find a new place to live, or ask your Dad to make a compromise."]}