{"id": 9925, "submission_id": "112423b", "title": "WIBTA if I told our parents my brother is lying about his paychecks?", "selftext": "My (17f) brother (15m) and I's parents have a rule for jobs. We get to keep 1/3, 1/3 goes to college, and the rest goes into an account for us to get when we turn 21. I think that's a pretty fair rule, and it's what I'm doing since I've started working. My brother has always complained about our parents \"taking\" his money, but since we live under their roof I think they have every right to do it.\n\nWe thought my brother was making $15 an hour, and they were splitting the money like that. Well he told me the other day that he got a raise to $18 and hasn't told our parents. He just pockets the extra money. I really think that's disrespectful towards them to break a rule like that. So I told him he has until tonight to tell them or I will, and he called me a bitch.", "created_utc": 1676377202, "permalink": "/r/AmItheAsshole/comments/112423b/wibta_if_i_told_our_parents_my_brother_is_lying/", "score": 35, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) telling our parents my brother lied to them\n2) It might hurt our relationship.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "He is an idiot. Your parents are raising you to be fiscally responsible adults, and all the money is being held for your future.", "YTA\n\nNice and loud so everyone can hear…\n\n\nIt’s. None. Of. Your. Business. \n\n👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "YTA - what pleasure do you get from being mommy and daddy's lil snitch?  what he's doing might be disrespectful, but that's between him and your parents.  at a minimum your brother will learn you are not to be trusted going forward.", "hard call.  Not your business,  but he's also saying they're taking his money but they're not if it's going to savings.  So there's assholery to spare here.  Your parents are trying to get him off to a good start.  But he's not being honest, which sucks and what he does with his money has nothing to do with you.  So ESH.", "How your brother spends / saves his money is none of your business, so you should keep your nose out of this. I don’t see what you have to gain by snitching to your parents? If anything it will just damage your relationship with your brother.\n\nYTA if you follow through with your threat.", "It seems like you care but after reading it does come off as jealousy in a way\n\nYTA", "NTA.\n\nRules should apply to everyone and when he breaks them, he needs to face the consequences.", "YWBTA.\n\nYour brother’s choices are his own to make. Stay out of this.", "YTA. Is it really such a big deal if he keeps an extra $3 an hour? Is it worth breaking any trust he had in you?", "YTA. He’s working for the money so let him use it how he wants. Why are you trying so hard to control your brother?", "YWBTA", "YTA", "Unpopular take but yta. Why can't you just mind your own business instead of running to mommy and daddy to tell on your brother? Will it make you feel a sense of achievement? Is what he is doing really hurting you that much? Is it affecting YOUR money? Think about it.....", "YWBTA. Nobody likes a snitch. Are you certain these accounts even exist?", "YTA\n\n>since we live under their roof I think they have every right to do it\n\nActually, they don't. It doesn't matter under whose roof you are living, no one is entitled to your money. Your brother is working and earning the money, it isn't pocket money he is getting from his parents that they have control over it. \n\nYes, they are trying to teach you how to handle finances which I think is a pretty good thing, but at the end of the day, they can't force you to spend or save your hard earned money. \n\nAnd OP, it is not your place to say anything. Your brother pocketing the extra $3 is none of your business and isn't hurting you.", "yes you would. it’s his own earned money let him do whatever the fuck he wants with it..", "What’s up with people calling the parents TA? They’re not using that money. They’re ensuring that their children will get a good head start when they’re 21. Also, NTA. Your parent’s system is genius", "NTA\n\nIf your brother thinks doing that sort of thing won't get him into trouble in the future, he's wrong. He better learn now.\n\nAnd to all those who are bitching about controlling parents, it's called parenting, not pandering. The kids keep ownership of ALL the money - part of it gets saved, and even get to spend a third. That's completely reasonable and good parenting.", "NTA. Your parents are teaching you/him about budgeting, saving, and spending. It's not like your parents are keeping any of your/his money for themselves. If he decides to lie about it, he's going to be spending more than he should be. This will probably snowballs into debt in his near future when he has access to credit cards because people usually use more on their credit card than they can actually pay off in full at the end of the closing statement.", "Better idea,   \nextort your brother for $1.50/hour :D   \nBut naw NTA, mess aboot and find oot", "ESH. Don't be a rat, but pay your damn taxes.", "It is really none of your business what your brother decides to do with the money he earned and worked hard for. YWBTA", "YTA\n\nThats not a fair rule.\n\nIt is a sensible suggestion that shouldn't be forced on someone against their will.\n\nIf he wants to decline the suggestion he should be able to, since its his money he earns.\n\nTaking 2/3 of his paycheque from him against his will and not letting him access it is dangerously close to stealing, even if they intend to give it back to him, because he earned it and can't access it for that time period.\n\nIf he ends up regretting spending all his money later, that's a consequence of his own actions and he'll have to deal with it, but it should still be his choice now what to do with the money he earns.\n\nAlso, stuff like this doesn't teach people good saving habits, if anything it makes them hate saving because of all the negative feelings they associate with it.", "YTA stay out of it. He is lying to your parents but he is the one who will have less money in college and at 21. The down side here is you will fuck your relationship up with your brother over something that doesn’t materially effect you.", "The truth always comes out, OP. In this case, it’ll likely come out during everyone’s favorite season: tax season. Pretty hard to lie when the W2 says totals… \n\nStay out of it. Let the truth come out. This isn’t your circus, and these aren’t your monkeys.", "ESH\n\nMostly your parents for wanting to control your money.\n\nYou for being a snitch.\n\nAnd your brother for understandably lying. It's his money, if he doesn't want to save them it's up to him, not your parents.\n\nDon't get me wrong, I think it's a good rule of thumb, but only if the person with the money wanna follow the rule.", "YTA \n\nMind your own business. Your parents' desire to teach him budgeting clearly backfired and he learned how to conceal his income and operate on \"grey income\" instead. Let the ~~IRS~~, ahem, parents, catch him in the act and see to the consequences, you stay out of it.", "Yta. \n\nSo are your parents. They don't just take his money like that. Whose name is on the paycheck HIS. He's already paying taxes he doesn't have to pay your parents. \n\nAlso he will never trust you again. So deal with being an ass sister.", "I’m with others - I understand where your parents are coming from but he’s the one working and he should decide what he wants to spend it on. He parents can guide and suggest - but in the end it’s his money. My parents didn’t do that to me and I learned how to save and pay off debts. ESH", "YTA - no one likes a tattle tale!\n\nIt sound sensible to be fair but it’s probably a pretty boring idea to a 15 year old boy. \n\nIf your parents are serious about this rule they should be conducting a quarterly pay check audit to verify earnings 😂", "Yta, you just salty you coupdnt think of that yourself.", "YTA mind your business", "Gotta go with ESH (apart from your brother).\n\n\nIt's his money and he should be the one to decide how it is used/split. Your parents can give suggestions but shouldn't be forcing either of you do split your wages the way they want you to.\n\nYou shouldn't tattle on you brother, he isn't doing anything wrong.", "Stay out of his business!", "ESH. Your parents suck for setting rules on what your brother can do with money he has earned with his labor. Your brother sucks for lying. You suck for wanting to be a snitch.\n\nYour brother should be able to do whatever he wants with his hard earned money. Your parents should advise him on being smart with it, but forcing him into some sort of plan isn't going to teach him anything as we can clearly see.\n\nYour brother shouldn't be lying, but if your parents were that concerned about it then they'd be asking to see his pay stubs and bank statements to make sure he's following through.\n\nYou need to mind your own business. I'm sure your brother will get caught up in his scheme at some point, and maybe your parents don't really care that much, but regardless, don't be a snitch - his actions aren't harming anyone.", "YTA this is a lesson he needs to learn for himself. He needs to get natural consequences. You telling your parents will not help him. He won’t do any lasting harm to himself. He has already damaged the trust between him and your parents now he just needs to Rey that he hurt himself by spending instead of saving. Leave it alone. Unless he is damaging you or your family or someone else as a rule don’t snitch.", "u nerd!", "Omg your brother is pocketing $3 an hour extra and not giving your parent $2 of his hard earned money. If you tell on him you are the TA, taking 2/3 of a 15 year olds money seems really controlling and harsh. Don’t expect him to tell you another thing once you dob him in either!", "YTA, regardless if you’re living under your parents roof or not, it is still his money that he earned through work that he did. His money is still going towards both those things mentioned, his pay has only risen by three dollars an hour, I’m sure it wouldn’t break bank if that extra $3 an hour goes into his own pocket for spending money.", "Yta maybe he’s saving his extra money on his own. What happens when one of you gets in an argument with the parents and wants to leave? Do they lose the money the parents took? Do you have any guarantee that it’s actually being saved at all? Anyway he earned it and it’s his", "[removed]", "YTA, you’re planning for the future which is great for you. but he’s going to learn it at a later date. But mind your own business, it will make people hate you if you’re in everyone else’s business all the time.", "YTA. Just because you think the rule is fair doesn’t mean he does.  This isn’t your business at all.", "YTA and this is none of your business . Go ahead and grass on him if you don’t really want much to do with him. He’s at an age where he wants go out with pals and do stuff, it’s also his money.", "[deleted]", "YTA, because:\n\nYou seem to only be upset that he's not doing as *you* did, and he's \"disrespecting\" your parents. \n\nRather than the whole \"you tell them or I will\" it would be beneficial for you to explain *why* your parents do this. Rules work a lot better when the people who have to blindly follow them understand their intent. \n\nEven if it's been explained before, it's not been explained enough for him to understand. Everyone learns differently, so a different approach may need to be taken (I say this as someone who is raising 3 kids, one who just turned 18.) They aren't children that just need rules, they are humans that need to understand why rules are there, so they can make informed decisions. If he still makes poor decisions after that, that's a him problem. He's the one who will suffer. He may need to just live & learn.", "YWBTA.\n\nThere’s absolutely no point in telling your parents that. \nI don’t even know why you’d want to involve yourself, what do you want to achieve? \nThat your parents punish him? For 3 extra dollars?\n\nHe’s 15 and already working. He’s already more responsible than most 15 year olds. That needs to get through your head.\n\nIf he thinks he needs those +3 dollars per hour, let him have them. He needs to learn how to deal with money, give him his space.\n\nWhat’s your motive, cause honestly, the only reason you said is that it’s „disrespectful“. It’s not. It’s his money that he works for and at 15 he already puts aside money for a.) college and b.) for when he’s a bit older. \n\nGet out of his business and be a good sister 🤦🏻‍♀️", "YWBTA. Seriously? Don’t narc on your brother. I can’t even believe you’re asking this.", "YTA this is so not your battle lol stay in your lane", "YTA.\n\nWhen he turns 21 or goes to college he will have less and that's when karma will hit him.\n\nThis isn't your place to get involved stop being so controlling", "YWBTA. Your parents rule isn’t fair - they have no right to dictate what is done with the money you and your brother has earned. So what if he wants to save up a bit more? Stay in your lane.", "NTA. Let your parents handle it. They will find out inevitably. Maybe I wouldn’t explicitly tell them, but I would drop a hint for them to ask. It’s not fair to you or to your parents.", "ESH. Except the parents. \n\nHonestly it's baffling to me, that everyone is calling them TAs for \"taking\" his money in the first place.\n\nHonestly I think what your parents are doing is pretty smart. It seems like they are just trying to help get you guys a better start when you do turn 21. \n\nLet's face it, when we are young, we blow our money on some seriously dumb and unnecessary stuff, and I bet a lot of us here wish we could take that back. It's not like their pocketing the money for themselves like how my parents did me. My parents would take half my paycheck and \"put it in a bank account for me\" then on top of that I had to pay $500 rent. After 3 years of working and having biweekly checks of at least $700, I only had $3200 in my bank account. So yeah, my parents seriously screwed me over.\n\nBut your parents seem amicable. YBTA if you said something. Let your brother learn the hard way for himself, it isn't any of your business to sell him out. And I'm sure your parents will find out on their own eventually.", "YTA.  Stay out of it.  It's likely he'll get caught when your parents help him file his tax return anyway.", "Yta, focus on yourself .", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (17f) brother (15m) and I's parents have a rule for jobs. We get to keep 1/3, 1/3 goes to college, and the rest goes into an account for us to get when we turn 21. I think that's a pretty fair rule, and it's what I'm doing since I've started working. My brother has always complained about our parents \"taking\" his money, but since we live under their roof I think they have every right to do it.\n\nWe thought my brother was making $15 an hour, and they were splitting the money like that. Well he told me the other day that he got a raise to $18 and hasn't told our parents. He just pockets the extra money. I really think that's disrespectful towards them to break a rule like that. So I told him he has until tonight to tell them or I will, and he called me a bitch.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA - he is lying, but they are not taking the money to pay for bills. In this case he's simply too immature to realise that the only person he's screwing is himself. \nIn this case I'm assuming that the money for college is to pay for his costs and the rest is going to be a loan.... so he's only making sure he needs a larger loan and he will suffer for that for many years. \nIf your parents have to pick up the rest of the college bill then he's actively stealing from them and it becomes a different story.", "NTA, \n\nif you where to tell as there are rules. However it’s still not nice and he told you that in confidence. The one dollar ain’t gonna change that much for your parents I’d say (I’m unfamiliar with working hours in ur country).\nKeep in mind that you would destroy trust he has in you that way. \nYou’re his sister, you shouldn’t get mad about something like that. Sounds more like the typical jealousy between siblings (ik for myself)", "YTA. If you seriously want to ruin your relationship with your sibling, and start this path that will lead to more nasty things. Yes you indeed are TA. \n\nI couldn't think of anything worse for yourself relationship with him.", "YTA. Your parents have no “right” whatsoever to take the money other people work to earn. Giving a roof to live under is the bare minimum parents should do and children do not own their parents for taking care of the life they chose to bring into the world.\n\nYour brother seems to be responsible since he’s able to not only already have a job at 15 but also get a raise. Mind your own business.", "Your parents have no right to decide what you do with your money just because you live under their roof. \n\nThey can set rules for how to behave in the house that they are obligated to provide to you, but they do not get to decide how you use the money you earn with your own work. \n\nIt is not disrepectful in any way for your brother not to tell your parents how much he's earning, and you would be wrong for sharing that information with them. \n\nThe money he 'pockets' is his own money and he has every right to it.\n\nIf your parents want you to save, there's some sense in that, but they're doing you both a serious wrong by dictating it rather than helping you learn to make good decisions yourselves. \n\nWhat usually happens when parents enforce overly-strict rules like this instead of teaching their kids, is that once the kids are out from under that strict environment, they don't do as well at making their own decisions. Because they were never allowed to before. \n\nDon't snitch on your brother, and also start thinking yourself about learning to make your own decisions too.\n\nYWBTA", "YTA. Think hard about ratting him out. You may need a babysitter in the future, and the rate he charges you might reflect how much you had his back growing up. Cool sister bare minimum; snitch sister $50 an hour per child.", "YTA it's his money. He can't expect your parents to make up any shortfall for college or at 21 but it's his choice if j3 doesn't care about saving", "Why is it your business? It's not and your brother told you in confidence. You tell your parents then your brother will not trust you again.\n\nWhat your parents are doing, that's great. It's a good way to teach finances and savings. However, at the same time, it's his pay cheque and he should be able to use it as he pleases and learn the hard way how to save.\n\nIs $3/h really worth risking your relationship with your brother?\n\nEdited to add a judgement: YTA.", "YTA, your parents are weird.", "This is the mom pretending to be a sister.", "Yta. He makes the money he should be able to do what he wants with it. Your parents are very controlling.", "You don't raise kids to be responsible by forcing them to do things. That doesn't teach them good decision making or problem solving skills - it teaches them how to follow orders. Good parenting is offering guidance, explaining the pros and cons of different decisions that can be made in particular situations, possible outcomes both short and long-term, and allowing the child to ultimately decide.", "I mean I'd rather my parents know they can trust me and that I won't keep secrets for them.", "Because she was following the rule so everyone has too. YTA", "Because he lied to our parents.", "Doing what sort of thing? Keeping his own money? \n\nAllowing a teenager to manage and spend their own money they make through their own employment isn't \"pandering\", its the normal and best thing to do, especially if your goal is for the teen to actually learn money management.\n\nTaking away 2/3 of a teens income whether they like it or not doesn't teach them how to manage money or save, it teaches them to associate saving with negative feelings and resentment, which is a bad thing if its something you want them to do of their own accord once you can't forcibly take their money any more.", "Good parenting isn't forcing your working age children to put their money where you say. Good parenting is offering guidance and allowing the child to make their own choices, and to accept the reward or consequences of their actions. This isn't a life altering amount of money we're talking about.", "He is 15….this money from what is clearly a very part time job probably amounts to nothing more than pocket money. It’s not that deep.", "No they aren't. Taking someone's money against their will to save it teaches none of those things.\n\nIf anything it teaches the opposite, because the person who's money is taken learns negative feelings about saving, and doesn't learn to control their spending because they never had any practice choosing how to manage their money.\n\nIts like saying force feeding someone bananas every meal teaches them to like bananas.\n\nThey end up hating bananas and probably never eating them again once they escape your house.", "Personally I think parents should be able to raise their children with whatever rules they think are reasonable.   There are far worse thinks than requiring kids save their money for long term goals.   Especially 15 year old boys who likely do not have the maturity to plan.\n\nEdit: if his parents are footing the bill for college, they are requiring his sacrifice as well to get him there.  He is actually stealing from the parents knowing they will make up the shortfall.", "He is disobeying his parents. His parents aren’t taking his money, they are telling him he can’t spend it all immediately.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "The parents aren’t taking the money. The kids get 1/3 as spending money, 1/3 to save for college, and 1/3 for their account when they turn 21.", "Where did it say they are stealing the money? \n\nIt says that they make them save 1/3 the money for college and 1/4 for when they are 21.", "you people need to learn how to read", "We engage in mild tomfoolery towards the IRS", "Did you read this?  They aren’t taking his money, they are stipulating he put some of it away for himself in the future to teach him life lessons and budgeting???  He gets some fun money and has to use the rest for necessities,  you know kind of like adults.", "Not very. I’ve seen worse than parents who set a rule that money should be saved.  There are a lot of millionaires in the world that thank their parents for teaching them the value of saving.", "I hope you are prepared to not have a relationship with your brother.", "I think it has more to do with the fact that he's comfortable pocketing extra money for himself and you're not able or willing to. If your parents cared that much they'd be asking for pay stubs and bank statements to verify his finances.", "Well you came here for a judgement. The consensus this far is that you would be an asshole, a snitch, and betray your brother. Siblings keep secrets all the time and if your brother is keeping the extra money HE EARNS to himself you need to let it go.", "Wow, again a \"I wanne be the golden child\" case", "But that’s not why you wanna snitch. It’s because you’re not keeping as much of your money as your brother is his. This has nothing to do with your parents trust. As pointed out several times, just be prepared for the fallout with your brother.", "YTA. Trust isn't won by betraying other people's. If they don't feel like they can trust you, this won't be what changes that. What else do you have to gain from this? don't hurt your brother in an attempt at validation from your parents.", "Girl, let it go. He’s 15 and struggling to see the consequences of his actions. He doesn’t see that he’s only hurting himself. He will have less funds for college and he will regret his choices then. Then when he graduates from college he will have less money in the account he gets at 21 to start his life. If it’s a high interest investment account, he’s going to set himself back some money. Maybe he is fine with that. \n\nJust mind your business and stack your money. \nYWBTA if you block him from learning his own life lessons.", "That's a very valid point.", "Have they provided stubs for you guys from your accounts so you can see a balance?", "Yta for even considering it tbh. I’m sure having a sister like you is more than enough punishment already. Why kick a man when he’s already down?", "> Because he lied to our parents.\n\nAnd how did this lie affect you, directly? If it's not hurting anyone, and it doesn't affect you, it's not your business. \n\nIf you're truly concerned about his future, and his future money, explain that to him. \n\nTelling mommy & daddy that \"he lied\" and \"he's not following the same rules *you* did\" teaches him *nothing* **except that he can't trust you.**", "And you've never lied to your parents? \n\nKids lie, and this seems like one of those small inconsequential lies. If you snitch on him, you will ruin your relationship with him, and I don't think that's worth it.", "Sounds like he has too because otherwise they take his money against his will", "You’re 17. old enough to not run to mommy and daddy.", "Where did I say they were taking his money? Correct, I didn't say that at all.\n\n\nThe parents are trying to control their children's finances. Telling them they have to split their money in specific ways. To me that's a no-no for the majority of situations.\n\n\nThe parents should only be giving suggestions and guidance on what to do. If the kid ends up blowing everything on something stupid at least he will learn the lesson of consequences at a young age.\n\n>He is disobeying his parents\n\nSo? Are you saying teenagers should have no freewill and do everything their parents say?", "No. You people need to be more realistic. Those parents are spending their money on their bills.", "Millionaires didn’t get there by saving from a $18/hour job", "No it’s an ass kisser whose way to far up their parents 🍑 and is brainwashed into turning against his brother.", "But it's like school, you learn habits and techniques to apply in adult life. Even if the application in youth have less benefit. You need to learn such stuff before you enter the workforce.", "Millionaires mostly became millionaires through inheritance or through other peoples labour. Not by saving up from their job."]}