{"id": 9933, "submission_id": "111ycdd", "title": "AITA for telling my exs mom they won't claim my son on taxes?", "selftext": "I 20 (f) have an 11 month old boy (well call him K), and his dad rarely comes to see him, and when he does, it's normally because his mom makes him. Today, my exs mom (call her G) messages me and asks if they can claim my son on their taxes. I said no, I already did that. And said says\n\n\"Are you ever going to let B(my ex24M) claim him?\"I said,\"Idk. He solely lives with me, I've been with him 24/7 since th3 day he was born. So I don't see why someone who rarely sees him has any right to claim K on taxes.\" He doesn't pay child support either, so I'm barely scraping by. She tries to pull a guilt trip and says her son doesn't feel welcomed at my home, so he never comes over. And I tell her.\n\n\"That doesn't stop him from texting me and asking for updates about K, especially when he's been sick with a fever of 103 and has pneumonia. \" My ex lost interest in the pregnancy after I broke up with him bc I couldn't stand his face after he had SAd me multiple times in our relationship and I still can't stand being near him without being sent into a panick attack. \n\nShe then proceeded to say.\"Well, we just want Kai to come and stay 3 to 4 days out of every week.\" And I am just shocked like what? I tell her.\"I dont feel comfortable with that. B barely can change a diaper, and he plays video games all damn night and works all day.\" Then she tries saying she feels like I don't trust her, and honestly, I don't. The last time I left this woman alone with my baby, she gave him a monster energy drink. Thst night, K had an upset tummy and didn't go to bed until 7 in the morning. \n\nK's dad did coke for Chrismas. However, He bought K toys he won't won't be able to play with until he's older, like 4 or 5. I told him 4 different times the type of things K likes and doesn't like so he could grt him a good gift. He shows up with scary toys thst made K cry snd scream and crawl to me sobbing.ive just had nothing but issue after issue with that family and I'm still learning how not to let people walk all over me, snd it's very hard. But G is upset because i won't let her claim my son on their taxes and let them keep him for 3 to 4 days..AITA?\n\nEDIT: thank you everyone for the advice and kind words. I'm definitely gonna try to go for child support once I csn gather all the evidence I need to make it so his dad doesn't have visitation at all or unless supervised. And once I can afford it", "created_utc": 1676365988, "permalink": "/r/AmItheAsshole/comments/111ycdd/aita_for_telling_my_exs_mom_they_wont_claim_my/", "score": 74, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Telling my exs mother they can't claim my baby on taxes because he's been with me every day 24/7 since he's been born. And they always make comments thst I'm toxic or an asshole for not letting them do things they do.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. They're trying to use your child. Stand strong! Can you get a restraining order to keep them away from him?", "NTA. The audacity of these people. Best to have a written agreement on child support and visitation to prevent trouble later. Consider posting in r/legaladvice for more appropriate guidance.", "NTA. \n\nThere are sooooooo many of us who have to coparent with exes we don’t like, what makes him special? He can pay child support and put effort into being in his son’s life if he wants to claim him on taxes (and even then it would be every other year) or he can forget about it.\n\nI know it’s hard because I’ve been where you are, but set those boundaries NOW. It only gets harder. And set them with G. “You can contact me about Kai but please don’t contact me about your son. If he wants to see his son he can make that effort himself” and then set up supervised play dates with G and Kai only if she follows through. There will be no hidden visits with B.\n\nBest of luck in your current situation, but overwhelmingly NTA.\n\nETA: my own trauma blocked out the SA part. Don’t give him unsupervised visits if you can help it. And make sure you keep record of the SAs, how much he contacts you about the baby, and any other incriminating screenshots or evidence.", "NTA for sure. He has no right to claim him. I feel like she only wants him have of the week is so they can try to claim him on their taxes. Keep an eye on them and keep doing what you are doing. When someone has a child and is a good parent they don't use drugs or give kids energy drinks so you are doing the right thing. Keep a journal or take notes of the things they have done while K is in their care and keep doing a good job protecting your kiddo.", "NTA \n\nYou are legally entitled to claim your child on your taxes. The only way that changes, is if there is an agreement in writing that says otherwise. I would make sure going forward that his family doesn’t have your sons SSN. \n\nEven if they babysit your son, they are not raising him, or entitled to claim him on their taxes.", "Claiming on taxes is for those that pay bills for the kid.\n\nAs long as he does not pay child support, he likely has no legal way of claiming a child on tax forms. \n\nNta\n\nThat \"granny\" can rot, same for the sperm donor.", "NTA. You are the custodial parent of your son, so you are the only one that can claim an exemption for him. The in-laws/ex don't get to just decide that they want to claim it. There are tax laws about this.\n\nAnd also NTA for not allowing them to have 3-4 day visitation every week.\n\nDidn't you get a court-mandated custody agreement that spells out visitation? And you should be going after him for child support too.\n\nEdit - I'm assuming you are in the US, but maybe shouldn't.", "NTA, and draw a hard boundary between you and that entire family.  Good job sticking up for yourself and your son.", "NTA you are the primary care giver and have every right to claim your baby who you look after by yourself every single day with no financial help from the \"father\" (using that term loosely) on your taxes. He and his mother have some weird emotional incest going on. They can play victim all they like but he needs to do better. You keep being the wonderful mother it seems you are and ignore the deadbeat playing victim and his mother excusing it. Their priority is obviously money, not the baby. They are very much the entitled AH's x", "NTA, please go after child support, its for your child and he HAS to pay, also block her on every sm u can find, record and screenshot everything and go for full custody.", "NTA and I’d sue for child support if I were you", "NTA. keep you child far away from these people.", "NTA though there is a lot of extraneous info here. You don’t clarify if Ex is ex husband or ex boyfriend, but either way the custodial *parent* claims the child unless a court order says otherwise.  Be prepared to be audited and to have to demonstrate that you have the majority of physical custody and are not receiving financial support.", "NTA, no one would leave their kid with people they don’t trust\n\nThe energy drink part was scary, who of earth think that’s a good idea?\n\nEDIT: fixed typo", "NTA\n\nGo for child support and supervised visitation.", "NTA\n\nThe only person that should be claiming the child is the person supporting the child.", "NTA. Claiming him as a dependent when he’s not being supported by them would be fraud. Suddenly asking for majority custody when they’re told they can’t claim him is trash.", "GET A LAWYER", "NTA - they can’t legally claim him on the taxes. Also, there may be free legal resources available to you since you’re a survivor of domestic violence (SA absolutely is part of this). In NYC, for example, legal aid would represent you in court against your ex for free since you’re a survivor of domestic violence. You could start by calling the national domestic violence hotline who might be able to help you get a list of local resources. You can also use this search tool and select the legal advocacy option: https://www.thehotline.org/get-help/domestic-violence-local-resources/\n\nThey also may be able to help you find free therapy which could help a lot to figure out how to keep setting healthy boundaries and recover from what’s happening.\n\nYou’re very very smart to be documenting everything. It’s the most important thing you can do right now, along with not leaving him alone with them, which you’re also doing. You’re doing great.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 20 (f) have an 11 month old boy (well call him K), and his dad rarely comes to see him, and when he does, it's normally because his mom makes him. Today, my exs mom (call her G) messages me and asks if they can claim my son on their taxes. I said no, I already did that. And said says\n\n\"Are you ever going to let B(my ex24M) claim him?\"I said,\"Idk. He solely lives with me, I've been with him 24/7 since th3 day he was born. So I don't see why someone who rarely sees him has any right to claim K on taxes.\" He doesn't pay child support either, so I'm barely scraping by. She tries to pull a guilt trip and says her son doesn't feel welcomed at my home, so he never comes over. And I tell her.\n\n\"That doesn't stop him from texting me and asking for updates about K, especially when he's been sick with a fever of 103 and has pneumonia. \" My ex lost interest in the pregnancy after I broke up with him bc I couldn't stand his face after he had SAd me multiple times in our relationship and I still can't stand being near him without being sent into a panick attack. \n\nShe then proceeded to say.\"Well, we just want Kai to come and stay 3 to 4 days out of every week.\" And I am just shocked like what? I tell her.\"I dont feel comfortable with that. B barely can change a diaper, and he plays video games all damn night and works all day.\" Then she tries saying she feels like I don't trust her, and honestly, I don't. The last time I left this woman alone with my baby, she gave him a monster energy drink. Thst night, K had an upset tummy and didn't go to bed until 7 in the morning. \n\nK's dad did coke for Chrismas. However, He bought K toys he won't won't be able to play with until he's older, like 4 or 5. I told him 4 different times the type of things K likes and doesn't like so he could grt him a good gift. He shows up with scary toys thst made K cry snd scream and crawl to me sobbing.ive just had nothing but issue after issue with that family and I'm still learning how not to let people walk all over me, snd it's very hard. But G is upset because i won't let her claim my son on their taxes and let them keep him for 3 to 4 days..AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTAIt would even be understandable if you wanted to cut all ties with them\n\nI'd also strongly recommend setting what you want clearly out of this whole mess with your ex and his mom and obviously your son, and getting legal advice", "NTA.  Please keep records of the conversations about claiming him on taxes.  They might try to.", "NTA - if this is the USA it is tax fraud to claim a dependent child if you do not live with the child.   Since the child lives with you, you are the only one who can claim him.\n\nThough if the child stayed with them 4 days a week for the entire year, then really the child lives with them not you.   Maybe they did the math on that, or maybe I'm seeing schemes where they don't exist.   \n\nIf he bailed during pregnancy, then you probably have full custody I'm assuming.   Don't do anything with the child you aren't comfortable with.   Don't let yourself be bullied.   The father of your child is an adult and can arrange his own visitation if it's important to him.   You don't have to deal with his parents if you don't want to.   You owe them nothing.", "NTA. Claiming your son on taxes is a financial benefit that’s supposed to go to the household where he lives. If you and the child’s father were cooperative, perhaps you’d calculate the value if the credit for you, and offer to sell it to his household for some amount more than that. If it’s worth more than that to them, they’ll agree, and it’s a win-win-lose (for the taxman). But since things sound less cooperative, that doesn’t sound like a good idea.", "You can put a PIN on your sons SSN to prevent them from adding him to their taxes. \n\nhttps://www.irs.gov/identity-theft-fraud-scams/get-an-identity-protection-pin", "NTA put a pin on your child’s SSN!!!", "NTA, you should cut these people out of your life as much as possible.", "NTA\n\nYou don't have to communicate with Ex's mother at all.  You have no relationship with her.  You can put her number on Do Not Disturb or block her altogether if you want.\n\nIf your Ex isn't listed on the birth certificate, he isn't the baby's legal father.  In that case, you can deny him and, and all, access to your child until he's gone through the legal process of getting himself listed as the father.", "NTA. \n\nDo not, under any circumstances allow them to take your child anyplace if you are not with them. No overnight visits, no going weekends or anything. They will more than likely try to keep him. \n\nHonestly, with the way they behave, I don’t know whey you haven’t filed for child support yet. If he wants visitation, it should be supervised visitation and it would have to be mandated by the court.", "FYI: I recently learned that you can call the IRS and basically lock down his ssn as far as taxes go. That will make sure nether dad nor grandma can try anything like this in the future. I don't know the exact steps, but it's probably worth looking into. I would go so far as to lock down his credit, too. Just in case.", "NTA\n\n&#x200B;\n\nSue fr child support. ANd formalize full custody for yourself.", "YTA\n\nFor not protecting your baby! Your ex and his family shouldn’t be allowed anywhere near your child! Not only did sexually assaulted you, but your baby is also showing signs of sexual abuse! Plus he uses coke!!! Your baby will DIE if he ingests coke! He’ll go down for murder and you’ll go down for manslaughter for neglect!", "I wish I could. But I wanted to at least try to make a healthy co-parent environment for my son so I haven't plus we don't have a money for that", "Thank you, I really appreciate it, I thought about going for child support but his dad can barely afford to feed himself", "I'm sorry you had your own Sa trauma..no one should have to go through that..and yes I have many screens hots snd texts snd pictures", "I'm definitely trying to be a good parent,my son has helped me grow up a lot, and I never want him hurt.", "Yeah they don't have a copy of his Borth certificate or his SSN I made sure they don't have those, they are sneaky people", "We didn't I figured his dad would be around often so we wouldn't have to have a written agreement  sadly he can barely afford to feed himself let alone child support so I haven't gone for it", "I never really saw them having emotional incest until now lol a lot of stuff makes SO much more sense. Thank you sm", "I'm definitely trying my best to. My son isn't safe with them..I only told a small portion of everything", "Also, don’t rule out the possibility that they are giving their son cash that he claims he’s giving you for child support, but really he’s spending it on games or blow. Their perception of involvement may be different than their actual involvement.", "Yes, sorry about that he's my ex boyfriend and I've been talking to my friends uncle who's a lawyer about what exactly I csn do", "Idk I left my son for 2 minutes to use the bathroom and I came back to find her giving him some on her finger snd my son pulling away and moving his head away from her finger", "Thx. It shocked me to no end reading that.\nThat stuff is dangerous the younger you are. The dosages are usually even too high for the average human, let alone teenagers/children, on top if your brain is still developing.", "Yeah I knew why she was asking to get me to let Kai stay with them 3 or 4 days every week. I shut that crap down", "I very much do, but ik they'd demonize me to everyone and anyone", "Yes I have screenshots snd the messages from my exs mom just in case and my friend has the screenshot as well", "Yes I live in the US sorry for any grammar errors lol I always end up shaking when I am venting. I figured I'd be the only one who csn claim him but I wasn't 100%", "Yeah, I didbmy taxes a few weeks ago and had already put him down as me claiming him so it was toi late anyways but I don't see why they think they have a right to claim him when they see him maybe twice every 2-3 months", "First priority needs to be a healthy environment for your child. If you ex is overdosing him on caffeine and using drugs around him, that’s not a safe, nurturing environment.", "The coparent is a sexual predator!!! He SA'd you by your own admission. \n\nWhat healthy coparent relationship could you ever have?", "A healthy co-parent Situation first requires financial contribution. Take him to court for child support. Then HE can show interest in him, but you do not need a coparenting situation with his parents. It is not a co-grandparent plan. Also it is hard for you to deal with him because of the SAs... \nCurrently i do not see a benefit in this meeting", "I think you've quite effectively ruled that out in your post. A healthy two adult situation requires two adults, let alone healthy; the fact that his mother (poorly) does any attempt on his part of negotiation more than proves that. Good luck in the child support negotiations, and if you can or did already, keep on record that energy drink incident especially with the doctor.", "> I thought about going for child support, but his dad can barely afford to feed himself\n\nThat's not your problem.  Your only responsibility is to your son and his well being.\n\nI urge you to follow up as soon as possible with your friends uncle and get a formal custody and child support agreement.", "If his mom can talk this much, best to let her checkbook do some of it. Seriously, get legal advice on this.", "For sure. I feel that 100%. My oldest kiddo was the best thing ever happened to me and unfortunately their dad is an addict. He was pretty petty and salty until he got sober a few years ago when my kiddo was around 15. Keep it up. It gets hard sometimes so feel the feels but keep doing what your doing to keep that kiddo safe.", "If the fathers name is on the BC, it would be easy to request a copy of it. The parents and the person whose certificate it is all have a legal right to request a copy, usually for a fee.", "OP, you're NTA but I would seriously consider taking this to the court room to get a formal custody agreement in place + a child support order. It doesn't matter that he can't afford to feed himself - he's still the biological father and his mother seems to think that she has an awful lot to say about your son. You should have all the formalities in order to be honest.", "please keep yourself and you child safe. i hope everything works out for you", "True, he's always been agaisnt being forced to give child support even when we dated he told me thst and him barely able to pay his own bills I've been hesitant to try for child support", "It is never too early to take him to court. Go after him for child support, but also nail down a custody arrangement that acknowledges his poor parenting and illegal drug use. How often does he use? Often enough that he’d fail random drug tests?", "His mom wants a do-over baby since she clearly did a shit job with her own son.", "Seems tough, I hope it gets sorted out eventually", "My interpretation of this is that it isn’t about “Right”. I think they see something they want (reduced taxes) and someone who can be manipulated into giving it to them. They’re going to push you on this until they decide it won’t go their way. Then they’ll move on and pretend it never happened.", "Hes definitely in a safe environment, we live with my mom and he's healthy and safe and very happy", "I will thank you, I feel a good bit better, it's my first kid and everything's been crazy", "Thank you, I don't have any parent friends so it's hard to vent to my friends about baby stuff lol, I can say that my son is very healthy and safe", "Yeah he's on the BC sadly, but he sleeps all day snd would sleep right through the office being closed", "I've set boundaries with them but they don't like listening to me or following, I know going to court would probably be easier and better in the long run snd now and I will as soon as I can afford it", "Me too, thank you I'm doing my very best", "If he can afford daily weed and occasional blow, he’s not “barely able to pay his own bills” at all. He’s prioritizing drugs over diapers. Does he live with his parents?", "He smokes weed probably daily snd befote we broke up he started coke..and he uses acid whenever he can get it idk if he's still using coke but ik he enjoyed it", "When he’s with you. What is happening when he’s with his dad and other grandparents?", "You might call legal aid or lawyers that do pro bono work. You're NTA. These folks are bas news. Even if he got visitation I'm betting he wouldn't see the kid unless him mom makes him. Having that legal agreement protects you in case they try anything. And regardless of his inability to care for himself, child support can be established based on his income. Then if he doesn't pay the court would have record of his bad behavior.", "Hes got his own place his mom lives with him tho, I think he gets his blow for free from a co-worker", "My son is laughing and happy snd crawling snd taking steps, playing eith his toys and eating baby food snd food food. He's just a general happy baby until his dad is around then he doesn't Crack a smile, doesn't wanna leave my side and screams whenever his dad takes him from me", "That is a MASSIVE red flag. Don’t let this man or his mother alone with your baby. And start documenting this kind of stuff, along with specific incidents of your ex doing dumb things.\n\nYou have larger issues than who gets to claim Kai as a dependent.\n\nAlso, there’s no such thing as free cocaine.", "dude... he sexually assaulted you and now your son is showing classic symptoms of being abused. protect your son or YTA.", "I know I've got larger issues then just tax claims, it's just one of a long list of things that finally just set me off yk? My son used to be perfectly fine with diaper changes and now he screams and cries like I'm hurting him..idk if his dad got angry when he was changing him once or what.\n\nYeah I thought something was sus when he said it was free but I was very timid in our relationship so never questioned", "The diaper thing could also just be his age. Bring it up at his next dr appointment or ask your mom if she thinks it is normal for his age. Maybe also seek out an online community for people whose kids are the same age as yours. If none of your IRL friends have kids, that could be a good resource for figuring out what is normal."]}