{"id": 9943, "submission_id": "1127993", "title": "AITA for making my boyfriend apologies?", "selftext": "My boyfriend hates my son. Me (20M) and my bf (20M) have been together for 3 months now. A little while ago i introduced my son (1M) to him. When they met my bf said he was afraid of my kid. Not everyone is a kid person, i know that. But whenever i send a picture to him of my son, he calls him ugly, disgusting and stuff like that. I dont know what to do. I love my bf but no one should insult a child like that. I called him out on it, and he said his option on children will never change and he refuses to apologise. I forced him to atleast say sorry, but it didn't seem like he meant it. So am I the asshole?", "created_utc": 1676386396, "permalink": "/r/AmItheAsshole/comments/1127993/aita_for_making_my_boyfriend_apologies/", "score": 44, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) the action was trying to stop my partner from hating my kid. (2) forcing him is what could make me the asshole here.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "“My boyfriend hates my son” \n\nFull stop right there. Get out for the well-being of your child.", "YTA, for staying with this guy. I’m sorry, but an apology is not going to change the fact that he’s a disgusting human being towards your son. This isn’t going to change. Time to bounce.", "YTA for being in a relationship with someone who hates your kid.  That makes you a bad parent.", "YTA for having a bf who hates your son, yes.", "N T A for asking him to apologize, but YTA for staying with this guy.  He openly insults your son to your face. Is your 3 month old relationship more important than your son?", "You “love” your boyfriend of 3 months who shit talks your toddler? And you don’t know what to do?\n\nYTA if you keep dating him.", "You choose to stay with a person who hates your son.  How in the world do you see this working out long term?\n\nESH", "YWBTA if you stayed with this guy. Nobody had to like children, but this is your child, he'll be a major part of your life for the next two decades, so how do you see any future with a guy who hates your kid?", "YTA. But only because you're still with this guy.  You need to pick your kid over a boyfriend.  EVERY TIME !", "He's calling an innocent child ugly and disgusting and \"you don't know what to do\"?\n\nESH. YTA for allowing your son to be abused and staying with a man who would say things like that. Something is deeply wrong with you that you wouldn't walk away the second those words came out of his mouth.", "you would be the AH if you kept this person in your son's life.  or your own.  \n\nThis guy is telling you who he is.  Believe him.  There is great potential for abuse if he is allowed near your son.\n\nNever mind that fact that he hates a living being who has never done a thing to him.  Who is, at this point, incapable of causing him any harm.  That is seriously concerning.  You are correct that not everyone loves babies or thinks they are the cutest thing ever, however that level of hate and vitriol is deranged.  That baby is made up of part of you...does he think the same of you on some level?", "You need to end this relationship immediately. Who says that about a child, let alone the child of your boyfriend?\n\nYou do realize that your boyfriend would play a role in your sons life, and the fact that he is reacting this way is VERY alarming. You could be putting your son into a potentially dangerous situation.\n\nIf his opinion is never going to change, then what are you expecting for your future?", "What is wrong with you.  Dump him. Your son comes first", "YTA here for allowing this man to insult and belittle your son?? why wasn’t bad enough to make you immediately dump him? Stand up for your kid", " YTA-Your child comes first. You are wrong to continue a relationship with someone who hates and insults your kid. You had to force him to apologize of course he didn’t mean it. Forced apologies mean absolutely nothing. Do better for your son.", "Yes, YTA.  Why didn’t you dump him the first time he called your kid ugly, disgusting, and stuff like that ?  You claim to love someone who literally makes fun of little children. \n\nHis apology is worthless.  His attitude is gross.", "YTA, the first sentence alone should have told you this. “My boyfriend hates my son”, why is this not your ex boyfriend? I’m so confused. You just met this person 3 months ago, and love them, but don’t have enough love for your one year old child to distance yourself from a person who despises them. This doesn’t seem like a safe situation.", "You can't be that desperate.", "YWBTA if you chose to remain in a relationship with your boyfriend. \n\nBF is TA because he insulted your child and didn't provide a sincere apology.\n\nGet out of this relationship for the safety of your child.", "YTA for even considering letting this person in your son's life.", "ESH first of all, how can you even be debating being in a relationship with someone who hates your kid? Obviously this isn’t the one for you and never will be. He TAH for verbally expressing his hatred towards kids and taking it out on your son. Also shouldn’t the topic of kids be talked about on the first date to save you both time?", "You're not the ah unless you stay with this jerk.\n\nIt's one thing to be leery of small children if you're not used to being around them.\n\nIt's quite another to openly insult them to their parent.\n\nDo you and your son a favor and move on from this relationship now.", "NTA but you really ought to break up.\n\nHe's verbally abusing your child, who's only 1 right now. It shows a lack of respect not only to him, but to you as well.\n\nIt will only get worse as he grows older", "YTA for dating a man who hates your CHILD.", "This man has shown you who he is and that's an abusive creep. Who says that about a baby???? He's definitely A H.  You are too if you stay with him.", "YTA for being with someone who doesn't like you son and no he won't magially love him . when soembody shows you who he is BELIEVE him. . There is no future with this guy so break up NOW", "Ok, so I’m going to be as gentle as I can about this, you’re NTA for making him apologize.\n\nBut you will be TA if you don’t leave this man. You are a DAD. Your child comes first in every single aspect. You and this man are not compatible in any way. He doesn’t want children? That’s cool, but YOU HAVE A CHILD. A child that he continuously insults and degrades. That is NOT the kind of man you should ever want to be with. Period. This may come off as rough, but you need a hard truth to see what the damage will be if you continue to stay with someone who will NEVER live up to the step-dad or even good role model. You and your son are a PACKAGE DEAL. Anything less from a man is/should be a DEALBREAKER. \n\nPlease, stop seeing this man for your little boy’s sake. He deserves better, and frankly, so do you!\n\nEdit: changed the gender.", "YTA for choosing your bf over your child. \n\nDo you hate your son as well or why do you want to force him into a family situation with a „maybe future step dad“ who has hated him from the beginning and who will make your son feel that he „disturbs“ and that he‘s not wanted?", "\"My boyfriend hates my son\". Your one year old child. Why is he still your boyfriend?\n\nYTA for staying with him when he treats your child like this.", "Soft YTA for dating someone who is disrespectful to both you and your son. Calling him names directly to you is just absolutely uncalled for and someone with an attitude like this isn't going to change. No apology is going to solve things here. Unless you're planning to not have a son in the near future you need to find someone who is compatible with your family situation.", "YTA simply for staying with this man who doesn’t have any interest in even being nice towards your one year old son. He doesn’t have to like children but his benhaviour towards your son and the things he calls him are quite frankly disgusting. Leave this man, and don’t ever date anyone that doesn’t like children. Your son is your first priority", "Seems quite clear that he's TA and YWBTA if you stayed with him. Clearly this relationship has no future if his opinion of your child 'will never change.'\n\nSeems like a horrible guy, to be honest.\n\nEdit: spelling/grammar", "WTF? You know he doesn’t like your kid and you’re with him anyway? Where do you think this relationship is gonna go? Im not saying you’re desperate and a bad parent for this but isn’t what good parents do", "NTA.  Drop this man immediately.  Your child comes first.  Protect him from this person or you will likely being exposing him to abuse.", "YTA for staying with him come on really ?", "YTA for being in this relationship", "ESH. Your BF for his horrible comments about a literal child, that’s obvious.\n\nBut you… you’re rushing into a relationship with a person who’s been clear about his views on children without any regard for your son. You’re in love with him after only 3 months (not really an issue but that’s very fast) and you’ve already introduced your son to him (also very fast). From the moment your BF said he was “afraid” of your kid your relationship should have been over.\n\nYou need to learn, as a single parent, to put your son first and foremost until he’s independent. Every relationship decision you make until then has to be in the best interest of your son. Yes, even if that means being single until you find the right match. This is the hard part of being a parent - you brought them into this world and now you have to make sacrifices to ensure they thrive and are happy.", "YTA. I can’t believe you’re allowing someone to treat your son like this!", "YTA for staying with this prick.", "He should apologize--but he shouldn't still be in your life *to* apologize after the things he's said. You should have broken up with him, because jfc dude, you're a parent and your job is to protect your kid. \n\nYTA for not immediately breaking up with your bf, and continuing to stay with someone who has called your child 'disgusting'. And I say this as someone who is intentionally child-free and doesn't like being around kids. Kids are people, and they're people at one of the most vulnerable times of their live, and no child should have to be around anyone who *hates* them for being a child.\n\nAnd your boyfriend is an asshole for saying the stuff he's saying, and also not realizing that despite his own feelings towards children, kids deserve safe, loving, respectful environments to grow up in. \n\nIf you love your kid at all, or even just respect him as a person at all, you need to call it off with your shitty boyfriend. It reflects poorly on you that you're still wrestling with this after knowing what he thinks of your child.", "He is twenty. Plenty of twenty year olds are not ready to have a child in their relationship, much less if the child is not theirs.\n\nHe should not be dating you if he is immature and can’t handle you having a baby.\nYou should not be dating someone who cannot accept a baby in the relationship.\n\nBut what makes you the AH here is that you have a responsibility as a mother to your baby, and you are not choosing your baby (who is 100% in your charge) over your bf.\n\nYTA\n\nEdit: OP is male, please change mother to father when reading this.", "better to he alone than in bad company", "YTA. Holy fucking shit. Number one, y'all haven't been dating long enough for your son to meet him anyway. Number two, WhyTF are you still dating someone who is openly abusing your son???", "YTA for dating a man who hates your son.", "I don’t know what to do? Is this a joke? \n\nYOU DUMP HIM \n\nYTA for staying with someone that speaks like that about your son.  The very 1st incident should have been the last.", "Why are you with someone that enjoys insulting a baby?", "YTA for staying in a relationship with him - he's going to be emotionally (if not more) abusive to your child as he grows up. If you love someone like that, you are the problem.", "Obviously he doesn't like kids and you still love him after he said those things about your child? \n\nGet your priorities in check.", "Listen..   I was a single mom too. You have to end this relationship with your bf. He is seriously bad news. I dated a guy like that and the moment he said he didn't want kids, I had to leave. There's no coming back from that. For your sanity and your son's safety, please leave this dude. Step parents are special people, and he's clearly not special enough for the job. \nNTA... but you will be if you choose your bf over your son.\n\nI waited 6 years to find a suitable man. He loves our son like his own and adores me and dotes on us both. He said from the beginning that he knew we came as a package. He is definitely my husband now. ❤️", "Info, why do you wanna date somebody that obviously hates your child? Where do you see this going long-term? I think it would be the asshole if you stay in this relationship and force your kid to be around someone who hates them.  I never want kids but I would never speak about a child that way so I would really consider if this is the correct relationship", "YTA for dating this guy. Dump him if you care about your kid at all.", "YTA IF You stay with someone that hates your child. Especially since you've only been together 3 months.", "YTA for staying with a guy you just met who talks about your kid that way. You'd trust your kid around this dude?\n\nYou can't change how people act or who they are, you can only control who you allow into your life and around your kids.", "Oh you are a huge YTA\n\nWhy do you hate your son so much where you can’t even stand up to your bf. \n\nOP are you blind? Your so called bf made it completely obvious he hates your kid and your still with him why? Fucking leave his ass and be a better father", "YTA\n\nFor dating someone who doesn't like your child\n\nFor staying with someone after they insult your child\n\nFor introducing your child to someone you've only been with for 3 months. \n\nParenting 101: don't introduce your child to a romantic partner until you've been dating at least a year. This is for many reasons, but the most important one is to help prevent child abuse. \n\nYou sound like a selfish person for subjecting your child to this. I guess since you \"love\" him, only your feelings matter. Get it together for the sake of your child.", "NTA. Seriously end that relationship immediately. That attitude toward a young child is a red flag the size of a building.", "RUN! Do not walk, RUN.", "YTA, you only met him one month ago and you already love him? I think you don't know what love is supposed to be like. If he trash talks your son already, you should think RED FLAG and immediately leave him. Having him say sorry is not gonna change anything. You really are the asshole for trying to make it work with someone who hates your innocent baby. Move on!", "YTA for being in this relationship.", "Typically when you find a partner, you hope that person would love your child and even treat your child as their own. Seeing how your relationship is in the early stages and your bf is already saying such things about your son is very alarming. I understand you wanting him to apologize because what he said was hurtful, but you can't force someone and expect a sincere apology. But do be mindful of how his actions and words speak volume about his character and how his relationship may be with you and his relationship with your son may be in the future should you continue to invest in this relationship.", "YTA. Why are you with someone who hates your very, vulnerable child? This should be an obvious reason to break up and you are worried about an apology from him?", "YTA for putting dick before your child. Either leave him and sort yourself out or put your child in the care of someone who isn't so selfish. Gonna traumatise the poor kid.", "ESH yeah he sucks, but you’re still with him after he’s been shitty about your kid.", "YTA for staying with someone who hates your child.  Your #1 priority is your child. Period. Do you think this will get any better as your child gets older???  All that will happen is your child will realize you are subjecting him to someone who hates him.", "YTA, \nFor not putting your son first. How could you possibly entertain a relationship with someone who openly hates your child?\nYou'd never feel like the child was safe around them for a start.", "ESH You shouldn't be with someone who behaves lkke that towards your son. Your son is your priority and you shouldn't tolerate people like him, especially if you only know them for 3 months. He sucks for obvious reasons.", "subtle YTA. it's perfectly acceptable to dislike children, but it's not acceptable to ridicule them. the fact that he feels at ease enough to say these things demonstrates his lack of regard for your child, perhaps even for you and your way of life. there are obviously not enough reprimands coming from your end, but there is also not enough self-reflection on his part. for the sake of your baby, consider being more adamant about your disdain of his behaviour. no child should have to grow up in a judgemental environment. I mean with how it's going what else will you let your boyfriend get away with?", "Wow why are you still with him 🚩🚩 RUN", "YTA for staying with anyone that would talk about your child like that.", "Stop dating this man. Full stop.  You are a parent which makes you and your son a package deal. Anyone who doesn’t love your son is not dating material.", "> my boyfriend hates my son\n\nEverything else in your post is irrelevant you are a shitty parent for being in a relationship with somebody that dislikes your child\n\nEdit: just read the post and not only are you with somebody that dislikes your child you allow him to constantly disrespect them as well and think an apology will fix it and before anybody says anything yes he’s horrible as well and YTA just in case that wasn’t clear enough\n\nEdit 2: I’m sorry guys the more I read this the more furious I get but OP of course it doesn’t seem like he meant the apology he’s been actively telling you and showing you that he hates kids INCLUDING YOURS for at least the past month", "You want him to apologize when he is not remorseful at all!?\n\nIt will never happen. \n\nA parent should never be with someone who hates their child.\n\nYTA for choosing an apology over protecting their child.", "YTA in several ways. \n\nOne, why are you still with him? The moment you tried to introduce your son to him, he said that he was afraid of your son and you acknowledged that he wasn’t a kid person. Why wasn’t that an automatic dealbreaker? You are not single. You are a mother first and foremost- your greatest responsibility is to your child. Partners who are not enthusiastic about your child are an automatic no. \n\nTwo, he literally insulted your child and called him disgusting? What’s wrong with you for accepting that? You don’t think that will impact your child keeping a man like that around who thinks that way about him? Who would have access to him and be a father figure? \n\nThree, 3 months is too short to introduce a partner to a child especially when you obviously didn’t know much about them (the fact you were surprised by his reaction to your child is proof). \n\nFour, why are you still forcing this relationship? HE DOESN’T LIKE OR RESPECT YOUR CHILD AND HE DOESN’T RESPECT YOU. \n\nYou are way past asking for apologies. You need to drop him and reevaluate why you’re so hung up over a man who hates a part of you and why you’re so easily willing to harm your son for some duck. Do better. There is nothing redeemable about this relationship and he is not a good person.", "YTA for 1) introducing your poor son to someone after only dating them a month then 2) staying with that person after you’ve concluded that they “hate your son”.\n\nLook OP, being a parent is hard, and being a single parent is even harder. I’m sure as a young person you’re anxious to date, but your child has to come first.\n\nHe shouldn’t have to apologize for you for not liking children, but you need to end the relationship now.\n\nYou need to wait a lot longer before introducing your son to people you’re saying. Most single parents I know wait at least 6 months to a year. It’s unhealthy and can cause a lot of issues for a child for them to constantly meet people you’re dating and then having that person leave your life.", "whaaaaaaaaaaaaaaaaaaaat\n\nit's a 1yo. if he doesn't like kids so much as to hate a 1yo, wtf is he doing with you", "Why on God’s green earth would you stay with a man who speaks about your infant that way? Any kind of a decent parent would end it immediately.", "YTA not for wanting to make him apologise but for not knowing what to do in this situation. \n\nI'll say this clearly.\n\nYou put YOUR infant first and ditch the boyfriend of 3 months. \n\nHow was that even a question.", "NTA and it's hard to think if bigger redder flag than than this one apart from, maybe, abusing animals.", "NTA for wanting an apology, but Y T A for continuing to date someone who openly hates your son.  This relationship will never work, he literally calls your 1 year old disgusting.  You do not “love” him after 3 months.  Break up now and stop wasting both of your time.", "For making the bf apologize? NTA.\n\nFor staying with a boy who hates your son? YTA, and bigtime.", "I stopped at the first sentence. You’re an ahole for him not being your ex. He’s not an ahole for disliking kids, but YTA for continuing to be with him when he doesn’t even like your child. You’ve been together 3 months, he’s already been introduced to your son, and he’s awful about your child. What do you love about this man??\n\nLove yourself and your son more. If you don’t break up with this guy, you’re an even bigger ahole.", "yta. i hope the child is doing okay & i hope you end things w this weirdo who insults babies!", "YTA for putting your child through that over a man that’s a huge AH too. Don’t have kids if romantic relationships will be more important than their well being.", "YTA for staying in this relationship.  Your child comes first.  Period.  End of story.  If this guy is insulting (abusing) your kid, you need to dump him because it will only get worse for your son.  \n\nTake your son and go!", "For you and the 1yo baby's sake, get rid of the 20yo baby. Sounds like you'd be raising them both if you stay with him. Dude clearly needs more time to grow up before he should be in an adult relationship. You deserve better.", "ESH. \n\nY T A for: \n\n* Claiming to love a guy you've only dated for 3 months\n* Introducing this guy to your child after only 3 months of knowing him \n* Sending pictures of your child to a guy you only know for 3 months\n* Allowing this guy to call your child names\n* Claiming to still love a guy that constantly insults your child, to your face\n* Thinking that someone forcing him to say sorry would change anything \n\nHe's TA for obvious reasons. \n\nWhy on earth would you want a relationship with an (insert term I can't type out without earning a ban) of a human being that thinks it's ok to tell a father that his baby is ugly and disgusting? What exactly do you expect to happen if you continue \"dating\" a guy that is openly telling you he hates children... AND YOU HAVE ONE?! \n\nUnless you're planning on abandoning your child (and then you'd be the same (insert term) as he is), you have no future. \n\nBut how could you possibly be still tolerating, let alone liking, this person after what they said about your child, is beyond me.", "ESH. Him for being so rude and you for staying with someone who insults and actively hates your child.", "YTA for exposing your child to a disgusting man and having your top concern being his lack of an apology to you. How badly do you need a bf that you'd subject your child to this dude? Get your priorities straight and concentrate on your child, and someday you might find a decent man who'd be pleasant around your son.", "YTA for dating him when he talks about your child like that. This shouldn't be an argument, it should be a breakup.", "And what part of being a parent includes being around anyone who calls a baby names?", "YTA for staying with a man who will inevitably abuse your child, at least mentally.  No man should come before your child ever.  He has shown you who he is, why do you not believe it?  No wishing or wanting is going to make him change.  I feel sorry for your child.  Dump the boyfriend and if you won't, give your child to someone who  will protect him.  There is no scenario that works with you having both of them in your life.", "You should love your kid more like f this guy.", "YTA for dating a man who hates your son.", "YWBTA if you didn't break up with him.", "Why would you continue to date someone who hates your child‽ You've really lost the thread here. Screw an apology. Dump the AH who hates your kid. As a mom, I don't see how you could be attracted to, much less love, someone who feels this way about your child. Better to be alone than with someone like this. This is not a person you should have around your kid.", "YTA to your son. The relationship will only hurt him. Break up.", "He’s TA obviously, but you’re just as bad if not worse if you tolerate that treatment at the expense of your son. Attempting a full personality change 3 months deep into a relationship is something. Not a red flag like a big pirate ship flag. Leave for your son", "YTA, never prioritize a boyfriend who hates your child over your child. The second he said those things you should have broken up with him and blocked him. You're a single mama and your number ONE priority is raising a son who feels loved by everyone in his orbit. You are doing your son a disservice by staying with that guy.\n\nBoyfriend is also an AH. He knew going into the relationship she had a child and if he doesn't like it he shouldn't enter into or remain in the relationship.", "This is going to ruin your relationship with your son. If you are not careful cuz kids can tell when somebody doesn't like them and especially you as their parents staying with that person that doesn't like them, you will become their enemy because you stayed with someone that blatantly treats them badly. Right now you have to choose between your kid and your significant other. Your kid will always be your kid. You and that man can break up at any time and you should break up with them. Your kid is more important than any other person that could come into your life. Quick disclaimer. I don't have kids but I know how this would feel", "YTA bc you are with a man who blatantly dislikes your son.  Its your job to protect love and stand up for your defenseless son.  Who gives a shit whether this man apologizes or not! Leave him don't look back.  YWB a selfish asshole to let this man anywhere near your child. Ever.", "YTA four staying with a guy that hates your son, what happens if y’all get married or move in together? Are you going to chose him over your son because I guarantee you the boyfriend will make you chose and if he doesn’t he won’t treat your child right.", "You're not an asshole.  You are an idiot, though.  Either dump the fool or be reminded you have an ugly kid all the time.  Dump the fool or are you the fool?", "How can you love someone like this, who speaks about your son in this way?  Show some self-respect and LEAVE HIM.  You can (and must!) do better for yourself and your son.\n\nRight now, ESH.", "YTA for not dumping this guy the first time he talked shit about your baby.  I understand you are young but you are a mother now.  Your child comes first and this man is calling your child ugly and disgusting.  What do you think he will do to your son if your relationship progresses and he is around him more?    \n\n\nHe's going to abuse him, OP.  If not physically than emotionally and mentally.  Stop putting a man over your child and get rid of him.", "YTA\n\ngoogle \"boyfriend kills child\"\n\nJust GOOGLE IT", "YTA. Not for forcing an apology but for staying with a new BF (come on, 3 months is a blink not a deep emotional investment) who hates your son.  It’s your job to protect your son above all else.", "ESH. He's the TA for disrespecting his boyfriend's son and therefore I think you should dump him. YTA for not directly disclosing that you had a kid. You're both 20 which is very young to raise a child. It's pretty uncommon to have kids at that age (especially in gay relationships, since in that case having kids is a choice). I'm in my early twenties entering my mid-twenties, and if I were dating a guy my age and he hid he had a kid, I would be pretty annoyed (don't feel ready to raise a child yet). But ofc that's no reason to be disrespectful to the child. I would just end the relationship and find someone else  who is not a father.", "YTA for staying with someone like that and not keeping your son safe. This guy has told you he doesnt like kids, so why are you still with him?", "You’ve been with this guy for 3 months and you clearly stated he hates your son, so why are you even entertaining this nonsense? Do not keep this man around your son. You have a choice right now, your boyfriend or your son, choose wisely. YTA for putting up with this at all. You need to do a better job protecting your son.", "HUGE RED FLAG.  Get out while you can.  NTA", "YWBTA if you stay with this guy. Your son comes first.", "No, but you will be TA if you stay with him. He's going to be cruel to your son, and has said nothing will change his opinion.youre making a huge mistake if you date him any longer.", "YTA for thinking there’s anything salvageable about a relationship with someone who hates your child. Protecting your son from the negative effects of having someone in his life who actively hates him should be your priority. \n\nI have friends who are child free and/or aren’t particularly comfortable around kids, and none of them are anything but kind to my son when they see him. I wouldn’t tolerate a friend near him who insulted him, let alone a partner.", ">he said his option on children will never change \n\nThis is all you need to know right here. Him insulting your kid is such a red flag. This relationship should have ended the moment he said how he feels about children so absolutely YTA for making him give lip service to his uncontained disdain for your child. And you will continue to be the Ahole until you remove this guy for yours and your son's lives", "YTA if you stay with him. Obviously he doesn't want to be involved or anywhere near your son.", "3 months, and you love a guy that hates your kid? Yta if you pursue this.", "NTA-for having him apologize. You need to break it off with him though because it's verbal abuse.", "ESH", "NTA. Is bro jealous of a baby? lmaoo. Thats kind of what it seems like. Either way he needs to grow up. Even if he doesn’t like babies he’s not a child. Should be mature enough to accept one that will be in his life forever if he stays with you", "1 NTA\n\n2. GET DIVORCED IF YOU ARE MARRIED! Trust me this man will make your life HELL! just think: a man that will not care about the child, will spend his money elsewhere, won't buy gifts, or even sessential items like clothes and not give a shit about his psychology. \n\nOP Pls dont let your son go through this ....... Please just go to court, ask for the custody of the child and have his child support. And just in case record him whenever you have another Convo like this. So you are 100% to get the child. \n\nBest of luck. A very hard life is in front of you. Especially if your family doesn't support you......", "ESH\n\nYour boyfriend is allowed not to like children, but should not call your child ugly. \n\nYou should not send your boyfriend pictures of your child, when he don't want them. And is afraid of your child. \n\nYou should more over deside if you want a boyfriend who never want to spend time with your child. \nAre you okay with having a boyfriend you can never move in with due to you having a child? \nAnd you need to decide if you are willing to have a boyfriend who don't want pictures of your child.", "NTA, but just forcing him to apologize when he doesn't mean it or isn't going to change doesn't help much.\n\nDoes he have some kind of negative association with children? Or some vendetta against the mother or son? Maybe he thinks he's just being \"brutally honest\" about the kid?\n\nAt the very least, he should be civil and neutral towards the child, but ideally, he would make more of an effort if he is going to be in your life long-term. I would have a heart-to-heart with him about what's going on, and if he continues to refuse to be open-minded or civil, you can consider where this relationship is going.", "Off topic. You are gay and have a son at 20?\n\nBack to your story, it is clear you love him and want him to love your son. Which he clearly doesn't. If you're gonna live with him or marry him this is going to be a deal breaker. I think you should have a talk with him. \n\nAlso NTA, mild YTA for your boyfriend for using harsh language when he can simply tell you he is not interested.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend hates my son. Me (20M) and my bf (20M) have been together for 3 months now. A little while ago i introduced my son (1M) to him. When they met my bf said he was afraid of my kid. Not everyone is a kid person, i know that. But whenever i send a picture to him of my son, he calls him ugly, disgusting and stuff like that. I dont know what to do. I love my bf but no one should insult a child like that. I called him out on it, and he said his option on children will never change and he refuses to apologise. I forced him to atleast say sorry, but it didn't seem like he meant it. So am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "Making him apologise was the right thing but if you don’t think he didn’t mean it that is a concern.\n\nPeople have very right not liking kids, but this has to be considered if this turns into a long term relationship as you are mum and need love and protect your son.  If this person remains in your life, he needs to develop a relationship with your son. \n\nHe doesn’t have to see himself as a dad to him, but it needs to some level of love and care. Without this, you could run the risk of him becoming abusive or general nastiness which will have impact on your son.\n\nIf this is a causal relationship where he is not involved with son that would be fine, but if you want a more committed relationship, you come as a package deal and if he can’t handle that - you and son shouldn’t have this type of person in your life", "YTA 1000000% for allowing him to be around your kid and for pushing your kid on him\n\nHe’s been very clear about his feelings, you guys are NOT compatible because he will never like your son.\n\nBreakup with him before he starts treating your son shitty to his face", "YTA. But not why you would think.\n\nYou need to prioritize your son. Being with your boyfriend will damage you son, and as a mother you WILL prioritize your son. So you need to break up with your boyfriend. \n\nIf you stay with your boyfriend your son will always feel like a loser. Always never loved (why did mommy stay with this man who doesn't like me - am I wrong? Doesn't mummy love me? Does she love him more than me?), always in the wrong, always a burden.\n\nTake it from someone who knows this situation.\n\nGet out if you love your son.", "Wtf... do you actually think it's okay for him to say these things to you about your baby?  Do you think an apology is going to fix this or change his mind about how he feels about your baby?  He's not going to change; he even said it.  Don't let your son grow up with someone like this in his life.  NTA for wanting him to apologize, but you're the A H for putting up with him and letting him talk about your baby like that.", "YTA. Why is this man still in your life????", "YTA, not for wanting him to apologize, but because you're making a massively terrible choice as a parent. Get out of this relationship for your child's sake.", "YTA for staying with a guy who hates your kid. Where do you see this going? Getting married in a few years and subjecting your son to an AH who calls him disgusting and hates him? Come on now.", "YTA a thousand times for being in a long term relationship with someone who talks to your child like that. How will you explain it to your child when, years later, they ask why you made them grow up around someone who verbally abused them? Because if he says this sort of stuff around your baby now, how much worse will it get over time?", "It’s terrifying that you have a child with this lack of awareness", "You should put your child first... he is only 1. He needs you. Dump this clown.", "How does he have beef with a baby?", "Massive red flag, run... Don't walk away.\n\nYour baby boy is your priority, don't let him anywhere near him. Sounds potential to be bitter, angry possibly dangerous.\n\nMove on now for both your sakes. Yours and your baby I mean!", "Why even post here, it's clear your boyfriend already hates your son...so leave ig?", "This has to be a joke. This is your son you're talking about. Common OP get it together.", "YTA for staying with him. Take out the trash. He hates your kid. This will not work.", "YTA for continuing a relationship with this person. Your son deserves better from the people you bring into his life.", "It's been 3 months Only, tip him out of ur life like a band-aid, there will be others .. it will take u maybe 2 months to get over him... Probably not even that . Do u think he is going to magically change his mind or that u can put alot of excruciating work in whilst getting offended to fix it... I wouldn't trust this dude alone with the kid ...do u? If u don't, how do u expect the relationship to continue working 1 year in... \n\nIt's ok , there better others , not that u need someone else.", "It's been 3 months Only, tip him out of ur life like a band-aid, there will be others .. it will take u maybe 2 months to get over him... Probably not even that . Do u think he is going to magically change his mind or that u can put alot of excruciating work in whilst getting offended to fix it... I wouldn't trust this dude alone with the kid ...do u? If u don't, how do u expect the relationship to continue working 1 year in... \n\nIt's ok , there better others , not that u need someone else.", "YTA for dating this \"man\" who would insult your son like this. Break up with him. You have a responsibility to your child to be with a man who will love him, not hate him.", "YTA for even entertaining having someone like this in your life. How can you even consider having this idiot around your son?", "Come on now really, you need the internet to tell you this guys a dirt bag and you should find someone else", "YTA for being with that guy, not being a kid person is one thing but to call a baby ugly and disgusting is speaking volumes on his character. that‘s not an opinion on children, he‘s just a vile human being, you can very well not be over the moon about children and idk not insult them or be hostile towards them", "3 Momths? Leave", "YTA why are you still with him. If I was in this situation I would immediately break up with them.", "yta.  You've been dating him 3 months.  For Petes sake.... kick him to the curb.  Not everyone is a kid person.  that's fine.  But, you don't date someone with kids.  And you don't have to be mean.", "YTA for staying with a man who trash talks your one year old son", "YTA for continuing to date someone who is so overt about their disdain for children in general, and specifically yours. Break up, it will not get better.", "This has to be fake.", "YTA. If you choose this man over your son you really don’t deserve your son at all", "NTA for making him apologise. But you really really should think about whether a person who says that about your child is worth knowing at all. If he insults your kid, he insults you. It's not okay to treat a child like this and honestly that kind of attitude raises immediate red flags for the potential for abuse. Do not leave your kid alone with this person ever.", "YTA for several reasons: \n\n1. Introducing your child to someone you’ve been dating only a month or two at the most. Your son is young enough he won’t remember this asshat, but don’t do this again. Wait at least 6 months and be sure the person would be a good role model and likely to be a permanent presence in your life. \n\n2. Staying with someone who hates your child and says mean things about them. This vile human should’ve been gone from your life the minute the first insult left his lips. \n\n3. Considering for even one moment that the affection you have for this new date could ever be enough to overcome the horrid way he treats your child. Nothing could ever be enough, not even decades of a shared life. But 3 months?!?! Are you kidding?!?!! How can you “love” someone who hates your kid?", "This is harsh, but honestly Idk how you “don’t know what to do.” This man hates your child, gtfo. idk how you could continue loving someone who obviously hates your child. YTA if you stay with him.", "YTA for even thinking about continuing to date someone who is that mean to your son. One of two things will happen: this relationship will fail because he doesn’t love your son (which should happen), or you’ll choose him and destroy your relationship with your son in the future because he will absolutely feel the effects of having someone that involved in his life who hates him.", "Let this be your lesson to **never** enter a relationship with anyone who dislikes your child.", "YTA for being with this person.\n\nKick him to the curb, if for nothing else, for the wellbeing of your child.", "YTA to your son. Leave your bf before he has a chance to actually harm your child, because that’s where this is heading.", "YTA.\n\nNever even consider being with someone who isn’t willing to get to know your child, and particularly someone who shows a complete dislike of your child.", "YTA for still calling him your boyfriend instead of your ex. He’s already verbally abusive towards a young toddler, do you want to be one of those women who ends up on the news when their boyfriend beats their kid to near death?", "Sounds like you hate him too YTA", "Honestly the only reason YTA is because you're still with him. You just said it, he said his opinion on children will never change so why are you with him? When you're dating someone and you have a kid, you aren't just dating for yourself. You need someone who is going to treat your son right as well, and this dude does not seem like he is it.", "YTA if you expose your son this garbage person", "YTA If you stay dating him he’s vile towards your child.", "You need to kick his ass to the curb. If he “hates” your son, he is dangerous around him. Get away from this creep..", "YTA. For being with someone who hates your son.", "YTA for dating a man who doesn't like children and who calls your child ugly.  What is wrong with you? Protect your child. Keep him away from a man who hates him.  He's going to abuse your child.", "NTA. But.... DTMF. Dispose of the Whole Man. For serious. It's only been three months. He's not worth it. You want around 18 years of him destroying your kid's confidence and tearing him down like that once he's old enough to remember and internalize it? You want his awful stepdad to be reason he's no longer in your custody or gets emancipated at 16? You can not like kids and not be an asshat about them. He's not even trying!", "YTA. You are dating someone who does not like children, does not want children, and actively dislikes your child. You are a parent, try to be a good one.", "YTA- your son is only 1 but I have no doubts he can feel what you describe as hatred. Anyone who hates babies to the point of individually targeting a specific child vs a child free lifestyle are bad. If this man doesn’t want kids it’s not gonna work unless you’re planning on giving your kid away for him.", "YTA for staying with a dude who is this awful about your kid. yikes.", "[removed]", "Get the f.. away from that jerk. How in the hell do you care for someone that’s puts YOUR own child down? You need to get into counseling if you think that’s ok. Please leave before he hurts the baby. Please always look after baby and you - FIRST", "EW wtf is wrong with you? Have some self respect and don’t introduce people to your son after three months, don’t date buttholes.", "ESH--- He is an AH for literally saying disgusting things about an infant. But you are too because you are trying to force your infant onto a man that wants nothing to do with him, and for putting your infant in that position where he is judged. He is clearly not a good bf, why would you want a life with a man that would never want to be around a child, is your child not that important to you? Or are you that selfish where you demand to have the best of both worlds? Thats not how it works. You both clearly have a difference in morals and opinions. BREAK UP.", "ESH, though at least your bf is honest. He's showing you who he is. For the life of me,  I don't get why you are choosing him over your son. \n\nYou demanding an apology seems to imply you'd forgive your bf. Not sure your bfs attitude is forgivable or that an apology would be meaningful,  given the bf had no intention of changing. Please for the love of you son, so not let this man be a part of his life.", "YTA for allowing someone to speak about your child like that and not cutting them out of your lives. Holy hell that’s the fast track to having your child be abused by them. Leave him and take lessons to be a better parent because you are failing right now.", "YTA for dating a man who calls your literal fucking child disgusting. What the hell is wrong with you?", "“My boyfriend hates my son.”\n\n“He calls him ugly, disgusting and stuff like that.”\n\nLeave. This. Man. \n\nMaking him apologize isn’t going to change the sort of person he is. Why would you tolerate this from a person you’ve only known for 3 months? That’s absolutely alarming. \n\nBe a parent. Your kid comes first, and he’s a threat to your child. \n\nNTA for making him apologize. Y T A for staying with him. Do better .", "Info: Why would you be with someone who hates your son?  How is that not a dealbreaker immediately?", "You're the asshole for staying with him. I'd get general statements like \"kids are icky\" because, well, they are (and I love kids!), but direct, cruel insults to your baby are completely unacceptable.", "YTA if you continue to stay with this dude for another minute. \n\nLet me tell you about the kind of guy you need ti find.\n\nI’ve got a friend from church. She got married fairly young and had 2 kids with her husband. Her second son was born with Apert Syndrome. I only know all of this from Facebook, but it seems her husband just up and abandoned her around the time her son was born. It’s hard not to guess that he didn’t want to deal with a disabled child and left her alone to fend for herself.\nShe stated in a very forgiving birthday post that he was an addict and incredibly selfish but she can’t bring herself to hate him because he gave her her sons, who are her world.\n\nShe had to move back in with her parents and navigate the world as a young single mother with a child with very special needs (so many surgeries and hospitalizations, I’ve lost count).\n\nAbout 2 years ago, she met a nice guy that not only fell in love with her but also with her sons. He sees them as his own. They’ve gotten married and they’re living the life she/they deserve after she’s had it so hard the last several years. She’s got someone who loves all of them unconditionally. \n\nI love seeing her life updates on social media, knowing there are men like that out there. \n\nFind that guy, OP. Please, for your sake and your son’s.", "[removed]", "YWBTA if you stay with someone that openly hates and talks shit about your child. Please don't be that parent..", "YTA for even considering staying with him for one more second", "YTA. Be a good parent, not the shit show this is. You've made a post basically saying that you choose men over your son, ew", "“My boyfriend hates my son”\n\nthats where id just stop right there", "He is not your boyfriend. He is a stranger who hates your son. Now that you know. What do you think you should do?", "Umm you leave this loser. Your the AH for letting this waste of oxygen around your kid.", "Why are you with someone that's calling your kid ugly and disgusting? Ffs get rid of the bf", "Just break up with him? You're only 20, you'll find someone else who'll actually love you AND your child. NTA but you will be the AH if you stay with him", "YTA If you say with him", "NTA\n\nDump him. The end.", "Bruh, YTA because you’re still with him. Your kid deserves better.", ">My boyfriend hates my son\n\nStopped reading there. Break up.\n\nEdit: I kept reading. YTA Break up.", "YTA for dating someone who hates your son, are you kidding me right now? Break tf up with this loser", "Soft YTA. I see that you’re young and sometimes it’s really hard to be assertive when you’re young and not used to it. \n\nDon’t degrade yourself or your son for this guy. Your son is a part of you. You and your baby are a package deal. anyone who dates you and wants a future with you needs to accept that and treat your child like their own. If your bf doesn’t want children, or hates children, why tf is he with someone who has a child?!\n\nBreak up with this loser and enjoy life with your baby. The right person will treat you and your son like gold, and see your baby as an extension of themselves. You’ll meet the right person in time but this loser is not it.", "Read your own post….be very afraid for your son.", "why the fuck are you dating this person? YTA if you don’t get out of this relationship and expose your son to this guy who hates him.", "\"Me (20M) and my bf (20M) have been together for 3 months now.\"\n\n&#x200B;\n\nCome on......Please prioritize your son over 3 month relationship!  YTA    Get rid of him please", "YTA for being with that guy", "Don't introduce your son to new bfs that early. That being said, how horrible are you for staying with a guy who says such hateful things about your son? Start acting like a mom and protect your kid for fuck's sake.", "Someone calling your child ugly should automatically end the relationship", "Why the fuck are you with someone who hates your kid? This is what we call failing as a parent. YTA Be better", "Yta. You met someone three months ago and you are already introducing him to your baby. Why? And seems a bit soon to say you love someone, specially someone who hates your child!", "If someone said my child is ugly and disgusting, love is not a term I’d use for describing my feelings towards that person.  I question how fit you are to be a  parent.  YTA.  Not for making him apologize but for not standing up for your child and dumping his ass.", "YTA if you stay and put your wants before the safety of your son.", "NTA now, but you would be if you stayed with this guy.  he is showing you who he is, believe him and move on before you traumatize your child.  He is right, he doesn't have to like him or kids in general, but the way he is treating your son now will not get better in the future.  If this is how he truly feels then he should not be dating a woman with a child and you a woman with a child should not be dating him.", "yta for keeping this guy in your life rather than prioritizing your son.", "NTA but for future reference, if you're forcing someone to say sorry then it's never going to seem like they mean it because they don't.", "NTA - and i would seriously reconsider this relationship. Just because he doesnt like kids doesnt mean that your son is going to go away. That is your SON. he will be your child until the end. Do you want to expose him to someone who is going to call him ugly?", "Yeah, the first impression itself was horrible why is she still pursuing this 3 months old relationship?\n\nAlso, whenever he gets exposed of the kid's existence he acts like a dick. Leave now.", "Right? OP is a father. Is he really okay with bringing someone like this into his child’s life? \n\nYTA for not having broken up with him already.", "OP here’s the TRUTH…\nWorrying about whether or not you’re an asshole for asking for an apology from your DEFINITELY an asshole boyfriend is the least of your problems here.\n\nBF is showing you his TRUE self and it ain’t good.\nLeave him for your sake and your child.", "[removed]", "I stopped reading there. End this relationship NOW. \n\nWho hates a 1yo?", "This isn't a red flag from the boyfriend. It's a giant billboard saying \"NO\"", "Exactly get outta there", "YES! can’t believe that OP’s concern is if she is an asshole for making her bf apologise when she should be worried about being a god awful parent.", "Hard to believe this is for real. YTA 10000x", "BuT hE's BeEn HeR BF fOr 3 mOnThS nOw. And apologizing will fix everything. /s", "You know the posts where mothers/fathers choose their newer SO over their own kid? I always wondered how that shit starts. Well, this post here is a good example of choosing dick over her own son.\n\nOP, save your kid from decades of trauma and leave that AH, you are an AH too, but you can at least start choosing the wellbeing of your son from now on.\n\nI'd like to think there are plenty of good guys out there who'd love you AND your son.", "Some know when they hit bottom and some reach for a shovel lol", "Exactly…. A man that calls her child ugly and disgusting???? Wtf", "Op is a guy btw", "Op is male", "According to the post, OP is a man.", "That flag would make Betsy Ross jealous it’s so big…", "You said it exactly like I wanted to.  We will be reading about this child in the news.", "Subtle my ass OP is a horrible mother for staying with this person", "This guy is 20 and they’ve been dating a few months…", "Why would you tell OP to get divorced? They’re not married . He’s her bf of 3 months. Of course, she should breakup with him. He’s not the father of the child. Did you read the post?", "I'm kind of confused as to how op is the asshole for sending photos of his kid, it's bound to happen if you are dating someone who has a child. When you date someone who has a child, you're taking on the role of a step parent, ultimately meaning you have to see the kid otherwise the relationship won't work out.\n\nIf he was genuinely afraid and hates children, he should have broken up with him", "They could be bisexual. And not unusual to have a child at 20 years old.", ">You are gay and have a son at 20?\n\nWhat's so weird about that? \n\nI'm more curious as to why someone as immature as OP has a child, and how concerning that is for the child's wellbeing. \n\nOP's sexual orientation is the least relevant thing here, in my opinion.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", " If you don’t break up with this guy, you’re an even bigger ahole.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "They both are men.", "Damn. I overlooked that. I’ll change it.", "My bad", "Single parent* then. ❤️ The sentiment still stands. I apologize for not reading through it more thoroughly", "If I would’ve seen this comment in 2 more days you would be getting a gold award from me", "It breaks my heart. There's really no time for sugar coating it, I see no reason to baby people like this since becoming a mum. I left my child's dad because they became number 1 in my life and I realised I was with an abusive narcissist. Do I want my child to go through that?? No? So I left him. Doing it without a dad is far better for their mental health than doing it with an abusive one and I can sleep at night knowing I do everything possible to protect them from men like that, just like OP should be doing.", "How else would a relationship start…", "Oh shit. Real sorry man. My English ain't very good. So I might have missed that. And hey 3 months is enough for a wedding ya know. But eh sorry", "His boyfriend. Op is male", "I think their point is OP is an AH for not responding by breaking up with the bf. Intending to continue exposing your 1 year old to this person is harmful", "If someone tells you \"I'm afraid of dogs\", are you then going to send them pictures of dogs? \n\nNobody should ever send people pictures they don't want. No matter how much they themselves like what is in the picture. \n\nSure don't date someone with a child if you don't like children. Unless you talk to your partner who has a child and tell them about your boundaries, and you find a way to make the relationship work. But you will have to be way more op front than the boyfriend have been here. \nNot every relationship have to lead to moving in, getting married and having children.  \n\nA relationship even with someone who has a child can be casual and just dating and not getting involved in everyday life of your partner. \n\nThe boyfriend is 20 yo, and probably did not  plan this to be ting, where he would have to be involved with the child as he has made it clear that he do not like children.", "Unless it’s a typo, OP is also a male. If that’s true, sounds like jealousy.", "Yes, it makes sense. Still it seems life has been on fast track.", "Thats cool", "Without her introducing him to her child.\n\nAlso I don’t think most 20yo’s are thinking about “forever” after dating someone a short period of time.", "That isn't at all what they were saying, they said OP is the AH for sending him pics\n\nI do agree that it's harmful, but I don't think it makes OP the ah yet, if he continues to date him then I'd be more willing to say he's an ah", "I don't think he's genuinely afraid of the kid. He's just saying he doesn't like the kid, hence why he insults the kid instead of saying \"I'm actually scared of your child\".\n\nIt is fully on him for getting into a relationship with someone who openly has a child who is 1. It's impossible for the relationship to work out, especially when the child is 1 and he is okay with verbally abusing him.\n\nI still do not understand how OP is the AH in this situation", "I completely missed that, thank you for correcting!", "1. Idk how many women feel comfortable enough to let their baby meet a man on or after a first date. Or even for awhile but i guarantee she told him about the child. \n2. What are you on bro. The entire point of a relationship is because you want this person if your life. If you’re hopping into relationships just for fun and then leaving when its not it wasnt even a relationship. Just f buddies or friends w benefits whatever", "Because OP is pushing his child on someone who is clearly not interested in a relationship with the child. \n\nOP has not started if he is the full time parent, or if a mother or other farther is involved. We don't know if the boyfriend could have reason to believe, that he did not need to be involved with the child. And OP clearly wants his boyfriend to be involved. They need to talk about that. And as I stated OP should really consider if he i willing to have a relationship with a boyfriend who don't want to be involved with the child.", ">Because OP is pushing his child on someone who is clearly not interested in a relationship with the child. \n\nWhich is inevitable. OP has a 1 year old child, the relationship will not work out at all if his boyfriend doesn't like kids to the extent of verbally abusing them. It's very much on the boyfriend to explicitly state \"I do not want to talk about your child or see your child, even in photo format\".\n\nAnd still, bf should've broken up as soon as he found out OP has a child. It will not work out.\n\nSince bf won't, and decides to verbally abuse a child instead, OP needs to.\n\nI still don't see how OP is the AH. I could only agree if OP sees all these verdicts, and decides to continue dating him.", ">Which is inevitable. OP has a 1 year old child, the relationship will not work out at all if his boyfriend doesn't like kids\n\nWell I disagree. A relationship with someone who has a child does not have to involve the child. Especially if the child is living somewhere else some of the time. \n\nThis relationship does however aplenty due to OPs actions have to involve the child. And OP should be upfront about that and not just send pictures when his boyfriend dont want that. \nThey should talk about the issue, and OPs boyfriend should make his boundaries clear and not act mean about the child. \n\nAnd yes they should definitely break up if OP needs a boyfriend who wants to be involved with his child."]}